{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book_on-top-of-spaghetti.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "Italian", "keywords": ["baked pasta", "Italian", "pasta", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pasta Baked with Radicchio, Gorgonzola, and Pancetta", "link": "https://www.seriouseats.com/recipes/2007/04/pasta-baked-with-radicchio-gor.html", "description": "Today's recipe from On Top of Spaghetti is a baked-pasta dish that's ridiculously good. And ridiculously rich, too--so eat slowly, savor each magnificent bite, and, if it helps, eat less. Pasta Baked with Radicchio, Gorgonzola, and Pancetta...", "totalTime": "", "recipeYield": "Serves 6", "recipeCategory": ["Cook the Book", "Italian", "Pasta"], "recipeIngredient": ["2 1/2 cups heavy cream", "1/2 cup chicken stock", "2 cups finely shredded radicchio or Belgian endive", "1/2 cup freshly grated Parmigiano-Reggiano", "1/2 cup freshly grated Pecorino Romano", "1/2 cup freshly grated Fontina cheese", "1/4 cup finely crumbled Gorgonzola", "1/2 teaspoon or more kosher or sea salt", "1 pound dried pasta shells or rotini", "1/4 cup finely chopped pancetta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 500 degrees.  Bring a large pot of water to a boil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine the cream, stock, radicchio, all the cheeses, and salt.  Taste and add more salt if necessary.  Set the sauce mixture aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously salt the boiling water and drop in the pasta.  Cook, stirring often, for 4 to 5 minutes.  The pasta will be parboiled and too hard to eat; it cooks further in the oven.  Drain the pasta, reserving about 1 cup water.  Transfer the macaroni to the mixing bowl and combine thoroughly with the sauce mixture.  If the sauce seems too thick, add some of the reserved water, a tablespoon at a time, until the pasta moves freely and is surrounded by liquid.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to individual shallow baking dishes or to 1 or 2 large shallow baking dishes.  Evenly distribute the pancetta over the surface and bake for 8 to 10 minutes, or until the pasta is bubbly hot, with bits of browned pancetta and pasta poking out on top.  Serve right away.</p>"}]}