{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["chestnuts", "fall recipes", "farro", "soup", "Sunday Night Soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: Chestnut, Pumpkin, and Farro", "link": "https://www.seriouseats.com/recipes/2007/11/sunday-night-soups-chestnut-pumpkin-and-farro.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week's Sunday Night Football game on NBC. This week, the New England Patriots pay a visit to Buffalo and their Bills. Northwest...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Nuts", "Pumpkin", "Soups and Stews"], "recipeIngredient": ["4 ounces <a href=\"http://en.wikipedia.org/wiki/Emmer\">farro</a> soaked in cold water for 90 minutes or so (If you cannot find farro, you could use cooked wild rice instead.)", "2 pounds whole chestnuts", "6 tablespoons olive oil", "1 red onion peeled and chopped", "3 stalks celery, chopped", "4 ounces pancetta, diced (You do want dice here, so avoid the case-ready packages of sliced pancetta. Better yet, <a href=\"http://seriouslygood.kdweeks.com/2007/01/pancetta.html\">start curing your own</a>.)", "5-6 cloves of garlic, peeled", "2-4 dried red chiles", "1 quart chicken stock. (This is no place for your clarified, blonde stocks. Think more Anne Bancroft, less Paris Hilton.)", "Salt and pepper to taste."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the farro. Peel your pumpkin or squash, toss with salt and olive oil, and roast on a 400f oven for an hour or until the flesh softens and begins to color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the farro soaks, cut Xs in the chestnuts, and put in boiling water for five minutes or so. Drain and peel. There are some pretty compelling college football games today that you could watch while you do.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the farro is done soaking, drain it, cover with water, bring to boil, and simmer for 20 minutes, or until the farro has an appropriate, slightly resisting texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm 2-3 tablespoons of olive oil in a big pan. Sweat the pancetta slightly, add the onions, chilies, garlic, and celery, and cook gently until the garlic just begins to show some color. Add the chestnuts, let them cook for five minutes, then add the pumpkin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add stock, bring to simmer, and add the cooked farro. Check seasoning, and serve with a drizzle of good olive oil.</p>"}]}