{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071217-msclassicsoriginal.jpg", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["Cook the Book", "garlic", "Martha Stewart", "Martha Stewart Original Classics", "pasta", "shallots"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Caramelized Garlic and Shallot Pasta", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-caramelized-garlic-and-shallot-1.html", "description": "Vampires beware: I love garlic in its many wondrous forms&mdash;roasted, toasted, sautéed, puréed&mdash;you name it, I'll snarf it down. Having never eaten it in its sweet caramelized form, when I saw the recipe for caramelized garlic and shallot pasta from...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cook the Book", "Garlic", "Mains", "Pasta"], "recipeIngredient": ["2 tablespoons unsalted butter ", "1 1/2 pounds (about 15 medium) shallots, sliced crosswise into 1/4-inch rings ", "1 cup peeled garlic cloves (about 3 heads), large cloves halved lengthwise ", "2 teaspoons sugar ", "1 1/2 teaspoons coarse salt, plus more for water ", "1/4 teaspoon freshly ground black pepper ", "2 cups homemade chicken stock or low-sodium store-bought chicken broth, skimmed of fat ", "1 pound farfalle, rigatoni, or cavatelli ", "Fresh basil leaves, for garnish ", "Parmigiano-Reggiano cheese, for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter in a large skillet over medium­low heat. Add the shallots and garlic cloves, stirring to coat. Sprinkle with the sugar, 1 teaspoon salt, and the pepper, and stir to combine. Cook until very soft and golden, about 1 hour, adding water 2 table­spoons at a time if the pan seems dry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, transfer the garlic and shallots to a bowl, and set aside. Add the chicken stock, and bring to a boil, using a wooden spoon to scrape up any browned bits from the pan. Cook, stir­ring occasionally, until the mixture is reduced by one-quarter, about 5 minutes. Remove from the heat, return the garlic and shallots to the pan, and keep warm while cooking the pasta. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover a large pot of salted water, and bring to a boil. Drop the pasta into the boiling water; stir to keep pasta from sticking. Cook until al dente; drain and return to saucepan. Stir in 1/2 teaspoon salt, re­served garlic and shallots, and sauce. Cut basil leaves into thin strips. Divide pasta and sauce among six serving bowls; garnish with the basil and shaved Parmigiano-Reggiano. Serve hot. </p>"}]}