{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dorie-choppedchocolate.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "chocolate", "Cookies", "desserts", "Dorie Greenspan", "holiday baking", "holiday recipes", "holidays"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: Cookies for Julia", "link": "https://www.seriouseats.com/recipes/2007/10/baking-with-dorie-cookies-for-julia.html", "description": "The cookies use one pound&mdash;yes, a full pound&mdash;of chocolate. You can use all bittersweet (which is almost always my choice) or make a mix, say a half-pound of bitter or semi-sweet, a quarter pound of milk, and a quarter pound of white. Just use great chocolate&mdash;it makes a world of difference.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking With Dorie", "Desserts"], "recipeIngredient": ["2 cups unbleached all-purpose flour", "2 to 3 tablespoons instant coffee powder (according to your taste)", "1 teaspoon baking soda", "1 teaspoon salt", "2 sticks (8 ounces) unsalted butter, cut into chunks", "3/4 cup granulated sugar", "3/4 cup (packed) dark brown sugar", "2 large eggs", "1 teaspoon pure vanilla extract", "1 pound chocolate (bittersweet, milk or white, or a combination), cut into larger-than-chocolate-chip-size chunks", "1/2 pound plump, moist dried apricots, coarsely chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour, coffee powder, baking soda and salt together in a medium bowl to blend; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter in the bowl of a mixer fitted with the paddle attachment (or work with a hand-held mixer) and beat on medium speed until the butter lightens in color. Add the granulated sugar and beat for about 30 seconds, just to blend. Add the brown sugar and beat for another 30 seconds. Add the eggs one at a time, beating for a minute after each addition. The mixture should be light and fluffy; if necessary, beat 1 more minute. Add the vanilla and beat until blended.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the mixer speed down to low and add the dry ingredients, mixing until they are incorporated. Remove the bowl from the mixer and clean the paddle and the sides of the bowl with a rubber spatula. Add the chocolate chunks and the apricots, if you’re using them, and stir with the spatula to distribute them equally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chilling the dough:</strong> Wrap the dough in plastic and chill for several hours or overnight, to firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking the cookies:</strong> When you are ready to bake, position the racks to divide the oven into thirds and preheat the oven to 350 degrees F. Line two heavy-duty baking sheets with parchment paper. (If you do not have heavy-duty sheets, double up the pans&mdash;these cookies need heavy sheets so that their bottoms don’t burn.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a heaping tablespoon of dough for each cookie, drop the dough onto the lined sheets, leaving at least 2 inches of space between each mound of dough so that the cookies have room to spread. Bake for 10 to 12 minutes, rotating the pans from front to back and top to bottom halfway through the baking period, until the center is just baked&mdash;they’ll still be soft to the touch. Use a wide metal spatula to transfer the cookies to cooling racks to cool to room temperature. Repeat with the remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Wrapped in plastic bags or in tins, the cookies will keep at room temperature for 3 days. They can be frozen for up to 2 months and should be thawed at room temperature.</p>"}]}