{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Cook the Book", "New Orleans", "Susan Spicer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Wild and Dirty Rice", "link": "https://www.seriouseats.com/recipes/2007/11/cook-the-book-wild-and-dirty-rice.html", "description": "As I would happily eat a bowl of plain, unseasoned rice, I'm not sure it would be safe for me to be around Susan Spicer's wild and dirty rice from her book...", "totalTime": "", "recipeYield": "6 to 8 servings", "recipeCategory": ["Cook the Book", "Rice", "Sides"], "recipeIngredient": ["1 cup wild rice ", "1/2 pound ground pork ", "2 tablespoons butter, oil, or bacon fat ", "1 small onion, diced ", "2 celery stalks, finely chopped ", "1 small green bell pepper, finely chopped ", "1/2 red bell pepper, finely chopped 2 garlic cloves, minced ", "1/2 pound chicken or duck livers, trimmed and coarsely chopped ", "1 cup long-grain white rice ", "1 1/2 cups chicken Stock ", "1 teaspoon Worcerstershire sauce ", "1 teaspoon chopped fresh thyme ", "1 tablespoon chopped fresh parsley ", "1 small bay leaf ", "Salt and pepper ", "Hot sauce ", "1/2 bunch scallions, finely chopped (about 1/4 cup) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a 2-quart saucepan of water to a boil over medium-high heat. Add the wild rice, reduce the heat, and simmer covered for 30-40 minutes, until the grains are tender and the ends have just slightly popped. Drain the rice in a colander and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the rice is cooking, cook the ground pork in a medium skillet over medium heat, stirring to break up any clumps, until it is no longer pink, about 5 minutes. Drain the excess fat and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a wide, shallow skillet or Dutch oven over medium-high heat.  Add the onion, celery, green and red peppers, and garlic, and cook, stirring, until softened, 5-7 minutes.  Add the livers and cooked pork and cook, stirring, until the livers are browned.  Stir in the white rice, chicken stock, Worcestershire, thyme, parsley, bay leaf, and 1/2 teaspoon salt and bring to a boil. Cover and cook over low heat about 15 minutes, until the rice is tender.  Stir in the wild rice and cook for 5 more minutes.  Remove from the heat and let sit, covered, for an additional 5 minutes.  To serve, remove the bay leaf, season with salt, pepper, and hot sauce, and stir in the chopped scallions.</p>"}]}