{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070904primetimegrilling.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Citrus-Marinated Grilled Chicken Breasts", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-citrusmarinated-grilled-chicken.html", "description": "I've made this recipe a number of times, and it's pretty much foolproof. It's from the Lobel family, the folks who wrote the book we're featuring this week. For convenience sake, they've written the recipe to call for boneless, skinless...", "totalTime": "", "recipeYield": "6 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 boneless, skinless chicken breasts, trimmed and halved", "Salt to taste", "1 1/4 cups fresh orange juice", "3 tablespoons fresh lemon juice", "2 teaspoons ground ginger", "1 1/4 teaspoons dried thyme", "2 tablespoons soy sauce", "4 tablespoons plain dry bread crumbs", "Vegetable oil cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the chicken breasts lightly on both sides with salt and put the chicken in a shallow glass or ceramic bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the orange juice, lemon juice, ginger, thyme, soy sauce, and bread crumbs in a small bowl, stirring to make a thin paste. Pour the paste over the chicken and rub it into the chicken. Cover and refrigerate for no longer than 6 hours, letting the chicken come to room temperature before grilling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a charcoal or gas grilL Lightly spray the grill rack with vegetable oil cooking spray. Light the coals or heating elements, and let them burn or heat until moderately hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chicken on the grill and cook for 12 to 16 minutes, turning several times with tongs, until cooked through and the juices run clear when the breast meat is pierced with a small, sharp knife and the crumbs are browned. Serve immediately. </p>"}]}