{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071030ednalewisscottpeacock.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["chicken", "Edna Lewis", "fried chicken", "Scott Peacock", "Southern food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "The Best Fried Chicken Recipe Ever?", "link": "https://www.seriouseats.com/recipes/2007/10/is-this-the-best-fried-chicken-recipe-ever.html", "description": "Many, many years ago, before I even started writing about food, I went to Atlanta on a business trip. I have no idea what the business trip was about, but what I really went to Atlanta to do was taste...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Deep Frying", "Fried Chicken", "Mains"], "recipeIngredient": ["1/2 cup kosher salt (do not use table salt for brining)", "2 quarts cold water", "1 three-pound chicken, cut into 8 pieces", "1 quart buttermilk", "1 pound lard", "1/2 cup (1 stick) unsalted butter", "1/2 cup country ham pieces, or 1 thick slice country ham cut into 1/2-inch strips", "1 cup all-purpose flour", "2 tablespoons cornstarch", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the brine: Stir kosher salt into cold water until dissolved. Place chicken parts in a nonreactive bowl or pot; add enough brine to cover completely. Refrigerate 8 to 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the brined chicken and rinse out the bowl it was brined in. Return chicken to the bowl, and pour the buttermilk over. Cover and refrigerate for 8 to 12 hours. Drain the chicken on a wire rack, discarding the buttermilk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the fat for frying by putting the lard, butter and country ham into a heavy skillet or frying pan. Cook over low heat for 30 to 45 minutes, skimming as needed, until the butter ceases to throw off foam and the country ham is browned. Use a slotted spoon to remove the ham carefully from the fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before frying, increase the temperature to medium-high and heat the fat to 335 degrees. Prepare the dredge by blending together the flour, cornstarch, salt and pepper in a shallow bowl or on wax paper. Dredge the drained chicken pieces thoroughly in the flour mixture, then pat well to remove all excess flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, slip some of the chicken pieces, skin side down, into the heated fat. (Do not overcrowd the pan or the cooking fat will cool. Fry in batches, if necessary.) Regulate the fat so it just bubbles, and cook for 8 to 10 minutes on each side, until the chicken is golden brown and cooked through. Drain thoroughly on a wire rack or on crumpled paper towels, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fried chicken is delicious eaten hot, warm, at room temperature or cold.</p>"}]}