{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070910southernbelly.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "CTB: Southern Belly", "John T. Edge", "sandwiches", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Hot Brown Sandwich", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-hot-brown-sandwich.html", "description": "In Louisville, Kentucky, says John T. Edge, author of Southern Belly: The Ultimate Food Lover's Companion to the South, the Brown Hotel \"has been the epicenter of the social whirl. Debutante parties, Christmas balls, weddings by the score.\" The Hot...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon", "Cook the Book"], "recipeIngredient": ["8 to 12 strips bacon ", "2 tablespoons heavy cream (optional) ", "1/2 cup (l stick) unsalted butter ", "6 tablespoons all-purpose flour ", "3 to 3 1/2 cups whole milk, room temperature ", "6 tablespoons freshly grated Parmesan cheese, plus more for garnish ", "1 large egg, beaten ", "1 to 1 1/2 pounds roast turkey, thinly sliced ", "Salt and freshly ground black pepper", "8 to 12 slices toasted white bread, (crusts removed, optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet over medium heat. Add the bacon without crowding, and cook, turning once, until crisp, 5 to 7 minutes. Remove to a plate lined with paper towels and keep warm. Repeat with remaining bacon, if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the heavy cream, if desired, in a small bowl. Using a whisk, beat until light and fluffy, about 45 seconds. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter in a medium saucepan over low heat. Blend in the flour, and cook slowly, stirring until the nutter and flour foam without coloring. Add the warm milk all at once. Immediately beat vigorously with a whisk to blend the liquid and roux. Bring to a boil and then reduce heat to simmer. Remove from the heat and add the Parmesan cheese and egg. Fold in the whipped cream, if using. Taste and adjust for seasoning with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each Hot Brown, place 2 slices of toast on a metal (or flameproof) dish. Cover the toast with a liberal amount of turkey to make an open-faced sandwich. Pour a generous amount of sauce over the turkey and toast. Sprinkle with additional Parmesan cheese. Place the entire dish under a broiler until the sauce is speckled brown and bubbly. Remove from broiler, cross 2 pieces of bacon on top, and serve immediately.</p>"}]}