{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["baking", "brunch", "eggs", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Southern Corn and Bacon Soufflé", "link": "https://www.seriouseats.com/recipes/2007/12/sunday-brunch-southern-corn-and-bacon-souffle-recipe.html", "description": "Writers James Villas and Alexandra Grablewski have provided the friends of bacon lovers everywhere with a perfect holiday gift opportunity, The Bacon Cookbook: More than 150 Recipes from Around the World for Everyone's Favorite Food. We'll be featuring recipes from...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Bacon"], "recipeIngredient": ["1/2 pound sliced hickory-smoked bacon ", "6 tablespoons (3/4 stick) butter", "1/4 cup freshly grated Parmesan cheese ", "1 medium onion, finely chopped ", "1 1/2 cups whole corn kernels, fresh or frozen and thawed ", "3 tablespoons all-purpose flour ", "2 cups milk, heated ", "6 large eggs ", "Salt and freshly ground black pepper to taste ", "Cayenne pepper to taste "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, fry the bacon over moderate heat till crisp on paper towels, and crumble. Pour off all but about 1 tablespoon of fat from the skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease the bottom and sides of a 1 1/2-quart soufl&eacute; or baking dish with 1 tablespoon of the butter, coat the surfaces with half the grated cheese, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons of the butter to the skillet and melt over moderate heat. Add the onion and corn, stir for 3 minutes, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, melt the remaining 3 tablespoons of the butter over low heat, add the flour, and whisk till golden, 2 to 3 minutes. Remove pan from the heat, add the milk, and whisk till thickened and smooth. Cool the mixture slightly, then whisk in the eggs one at a time till well blended. Add the corn mixture, bacon, salt and pepper, and cayenne and blend thoroughly. Scrape the mixture into the prepared souffl&eacute; dish, sprinkle the remaining cheese over the top, and bake till golden brown, 30 to 35 minutes. Serve hot. </p>"}]}