{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["beef", "sirloin steaks", "steaks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Pan-Roasted Sirloin", "link": "https://www.seriouseats.com/recipes/2007/12/sunday-supper-panroasted-sirloin.html", "description": "I always love the idea of cooking Sunday supper for myself and Vicky and Will. Now that Will's off at college I still look forward to cooking a meal for Vicky on Sundays. Will's coming home tomorrow for winter break,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Sunday Supper"], "recipeIngredient": ["1 tablespoon peanut oil ", "1 (14-ounce) sirloin steak, 1 1/2 to 2 inches thick, cut in half ", "Kosher salt and freshly ground black pepper ", "2 tablespoons unsalted butter ", "2 sprigs of fresh thyme or rosemary ", "Coarse sea salt (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a small skillet over medium heat until it slides easily across the pan. Pat the steaks dry with paper towels. Season the steaks with kosher salt and pepper on both sides, then place them in the skillet. Reduce the heat slightly (the oil should sizzle, not sputter) and cook the steaks until the first sides are browned, about 3 minutes. Turn the steaks and brown the second sides, about 3 minutes more. Prop the steaks on their edges and brown the fat for about 2 minutes, then return the original sides of the steaks to the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the steaks for about another 2 minutes, then add the butter and herb sprigs. Continue turning the steaks from side to side, basting with the lightly browning butter until the steaks are done (a total of 13 to 15 minutes for medium rare). Remove the steaks from the skillet and allow them to rest for about 10 minutes. Slice and serve sprinkled with coarse sea salt.</p>"}]}