{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/ctb-theperfectscoop.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["contests", "Cook the Book", "cookbooks", "CTB: The Perfect Scoop", "david lebovitz", "ice cream", "recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Gianduja Gelato", "link": "https://www.seriouseats.com/recipes/2007/06/cook-the-book-gianduja-gelato.html", "description": "Gianduja is a delicious Italian confection made of ground hazelnuts and milk chocolate. It tastes great in the form of smooth bite-sized chocolates, but possibly even better in the form of gelato. Try this recipe from David Lebovitz's The...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["1 1/2 cups (185 g) hazelnuts, toasted", "1 cup (250 ml) whole milk", "2 cups (500 ml) heavy cream ", "3/4 cup (150 g) sugar ", "1/4 teaspoon coarse salt ", "4 ounces (115 g) milk chocolate, finely chopped ", "5 large egg yolks ", "1/8 teaspoon vanilla extract "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the hazelnuts in a kitchen towel to remove as much of the papery skins as possible, then finely chop them in a food processor or blender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the milk with 1 cup (250 mI) of the cream, sugar, and salt in a saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once warm, remove from the heat and add the chopped hazelnuts. Cover and let steep at room temperature for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the milk chocolate pieces in a large bowl. Heat the remaining 1 cup (250 ml) cream in a medium saucepan until it just begins to boil. Pour it over the milk chocolate pieces and stir until the chocolate is completely melted and smooth. Set a mesh strainer over the top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the hazelnut-infused milk through a strainer into a medium saucepan, squeezing the nuts firmly with your hands to extract as much of the flavorful liquid as possible. Discard the hazelnuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rewarm the hazelnut-infused mixture. In a separate medium bowl, whisk together the egg yolks. Slowly pour the warm hazelnut mixture into the egg yolks, whisking constantly, then scrape the warmed egg yolks back into the saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the mixture constantly over medium heat with a heatproof spatula, scraping the bottom as you stir, until the mixture thickens and coats the spatula. Pour the custard through the strainer and stir it into the milk chocolate mixture. Add the vanilla and stir until cool over an ice bath. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill the mixture thoroughly in the refrigerator, then freeze it in your ice cream maker according to the manufacturer's instructions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Toasting Nuts:</strong> Preheat the oven to 350&deg;F (175&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the nuts in an even layer on an ungreased baking sheet. Bake the nuts in the oven for 10 to 12 minutes, stirring them once or twice while baking so they toast evenly.  To see if they're done, snap one in half: it should be  lightly golden brown throughout.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the nuts cool completely before using unless the recipe indicates otherwise.</p>"}]}