{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070516carrots-thumb.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["braise", "carrots", "Cook the Book", "cookbooks", "CTB: Happy in the Kitchen", "Happy in the Kitchen", "Michel Richard", "recipes", "Serious Recipes", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Braised Carrots", "link": "https://www.seriouseats.com/recipes/2007/05/braised-carrots-with-carrot-top-salad-recipe-from-michel-richards-happy-in-the-kitchen.html", "description": "As I type this, I've got the Serious Eats copy of Michel Richard's Happy in the Kitchenpropped open on the book stand on my desk, and I'm looking at a beautiful photo of his braised carrots. And I guess you...", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Braising and Stewing", "Cook the Book", "Sides"], "recipeIngredient": ["1 orange ", "8 carrots about 9 inches long and 3/4 inch in diameter (about 12 ounces), with their greens ", "4 tablespoons (2 ounces) unsalted butter", "1/2 cup finely chopped yellow onion ", "1 tablespoon granulated sugar", "Fine sea salt ", "Pinch of ground coriander ", "1/2 cup chicken stock", "Finely ground black pepper ", "<strong>For the salad</strong>", "1 cup mâche", "2 tablespoons extra virgin olive oil", "1 tablespoon red wine vinegar", "Pinch of granulated sugar", "Fine sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a small pot of water to a boil. With a vegetable peeler, peel the zest in strips from the orange, avoiding the white pith. Finely chop the zest, place in a small strainer, and dip into the boiling water to blanch for a minute. Rinse zest under cold water; drain on a paper towel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread zest on a plate; allow to dry at room temperature for 24 hours, or dry in the microwave for 3 to 4 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze 1/2 cup juice from the orange. Set aside. Cut off carrot greens and reserve. Peel and trim carrots. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a sauté pan large enough to hold the carrots in a single layer, melt 2 tablespoons of butter over medium-high heat. Add the onion; sauté for 30 seconds. Add the orange juice, sugar, a pinch of salt, the coriander, and carrots. Bring to a simmer, cover, reduce the heat, and simmer for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken stock; simmer for 15 minutes or until the carrots are tender when pierced with the tip of a knife. Meanwhile, bring a medium pot of water to a boil, and fill a medium bowl with ice water. Pick the leaves from the carrot greens and discard the stems. Break leaves into 1- to 2-inch pieces. There should be about 1 cup of loosely packed greens. Blanch greens in the boiling water for about 15 seconds. Drain in a strainer, and immediately plunge strainer into ice water to stop the cooking. When the greens are cold, lift strainer, drain well, and dry greens on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the carrots are tender, transfer them to a plate; cover loosely to keep warm. If there is more than 1/2 cup liquid remaining in pan, return pan to burner and simmer to reduce to 1/2 cup. Combine the cooking liquid and the remaining 2 tablespoons butter in a blender, add carrot greens, and blend until smooth. Season to taste with salt and pepper. (There will be about 1/2 cup sauce.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently toss the mâche with the oil, vinegar, sugar, and salt; add pepper to taste. Serve the carrots family-style on a platter, arranged in a bunch with the mâche at the top and the sauce poured along one side, or serve 2 carrots per plate with a small mound of mâche and the sauce spooned onto the side. Sprinkle the carrots with the orange zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><em>Photograph courtesy Artisan Books</em></small></p>"}]}