{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071015applepie.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["apple pie", "books", "Cook the Book", "CTB: Apple Pie", "dessert", "John T. Edge", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Paul's Fantasy Pie With Biscuit Bowl Crust", "link": "https://www.seriouseats.com/recipes/2007/10/cook-the-book-pauls-fantasy-pie-with-biscuit.html", "description": "In John T. Edge's Apple Pie: An American Story the author introduces us to a number of pie bakers, among them Dora Leung, whose piecrust recipe is kind of a \"drop crust\" and which \"does not rely upon chilled ingredients...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>Crust</strong>", "3 heaping cups all-purpose flour ", "1 teaspoon salt ", "2/3 cup canola oil ", "2/3 cup milk, plus 1 tablespoon for glaze ", "&nbsp", "<strong>Filling</strong>", "6 Granny Smith apples, cored, peeled, and sliced ", "1 lemon, juiced ", "&nbsp", "<strong>Finish</strong>", "3/4 cup sugar, plus one tablespoon ", "1/2 teaspoon cinnamon ", "4 tablespoons unsalted butter "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Crust:</strong> In a large bowl, mix the flour with the salt. In a liquid measuring cup. pour 1/3 cup of the canoIa oil and 1/3 cup of the milk. Pour the oil and milk into the flour by hand and gather into a tacky ball. (Almost by its own volition, it will come into a kind of ball, but you'll need to spank it a bit to bring it into a true form.) Remove the first ball and set it aside. Pour in next 1/3 cup each of milk and oil; again gather into a ball. (You will leave behind a good bit of flour in the bowl.) Lay down a sheet or three of newspaper. Lay a sheet of wax paper atop that. Place one of the balls of dough in the center and cover with another sheet of wax paper. Lay down a second blanket on newspaper and wax paper, and repeat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Filling:</strong> Fill a large bowl with the apples. Pour lemon juice on top. Fill the bowl with water. Set aside for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish:</strong> Drain the apples. Working from the center and pushing out, roll the first ball of dough into circles just larger than the pie plate. Repeat with the second ball. Place the bottom pastry in the plate. Mound the apples into the pastry. Add the 3/4 cup of sugar and a pinch of flour.  Blanket with cinnamon.  Scatter six pats of butter on the apples.  Place this crust atop the apples.  Cut six vents in top crust.  Glaze the top crust with a thin film of milk and then sprinkle with remaining sugar.  Bake in a 400&deg;F oven for 45 minutes, or until golden.</p>"}]}