{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/marioUncloggedBug2.jpg", "author": {"@type": "Person", "name": "Mario Batali"}, "recipeCuisine": "", "keywords": ["cippoline in agrodolce", "Mario Batali", "onions", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mario Unclogged: Sweet and Sour Onions — Cipolline in Agrodolce", "link": "https://www.seriouseats.com/recipes/2007/09/sweet-and-sour-onions-cipolline-in-agrodolce-mario-batali-recipe.html", "description": "About the author: Mario Batali has created a thriving restaurant empire and has established himself as a top restaurateur. Together with his partner, Joe Bastianich, he operates seven New York City hotspots. Mario splits his time between New York City's...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Sides", "Vegetarian"], "recipeIngredient": ["<p>2 pounds cipolline or small red or white onions, about 30, root and stem trimmed<br />", "3 tablespoons extra-virgin olive oil<br />", "2 bay leaves<br />", "4 tablespoons red wine vinegar<br />", "2 tablespoons sugar, or more to taste<br />", "Pinch of salt<br /></p>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brig 6 quarts of water to a boil, and add the onions. Lower to a simmer, and cook for 5 to 7 minutes. Drain and peel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a saucepan, warm the olive oil with the bay leaves while the onions are cooking.  Turn the peeled onions in the olive oil, and cook for 5 minutes, until just browned.  Add the vinegar and sugar, raise the heat slightly, and cook, stirring frequently, until the vinegar-sugar mixture starts to caramelize, about 2 minutes.  Remove from heat and discard bay leaves. Turn the onions gently to coat thoroughly with syrupy mixture.  Season with salt and pepper and set aside to cool.  Serve at room temperature.</p>"}]}