{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["barbecue", "books", "Cook the Book", "CTB: Peace Love and Barbecue", "Mike Mills", "recipes", "rib", "ribs", "Serious Recipes", "Super Bowl mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Apple City Barbecue World Championship Ribs", "link": "https://www.seriouseats.com/recipes/2007/06/cook-the-book-apple-city-barbe.html", "description": "The ribs made by Mike Mills's Apple City Barbecue team using this recipe won first place at Memphis in May, the \"Super Bowl of Swine,\" in 1990 and 1992. Although the instructions here may be a little beyond casual backyard...", "totalTime": "", "recipeYield": "Serves 8", "recipeCategory": ["Cook the Book", "Mains", "Pork"], "recipeIngredient": ["4 racks of ribs (about 2 pounds each)", "<a href=\"#magicdust\">Magic Dust</a> (recipe follows)", "4 cups apple juice in a spray bottle", "<a href=\"#applecitybarbecuesauce\">Apple City Barbecue Sauce</a> (recipe follows)", "1/2 cup paprika", "1/4 cup kosher salt", "1/4 cup sugar", "2 tablespoons mustard powder", "1/4 cup chili powder", "1/4 cup ground cumin", "2 tablespoons black pepper", "1/4 granulated garlic", "2 tablespoons cayenne", "1 cup ketchup", "2/3 cup seasoned rice vinegar", "1/2 cup apple juice or cider", "1/4 cup apple cider vinegar", "1/2 cup packed brown sugar", "1/4 cup soy sauce or Worcestershire sauce", "2 teaspoons prepared yellow mustard", "3/4 teaspoon garlic powder", "1/3 teaspoon ground white pepper", "1/4 teaspoon cayenne", "1/3 cup bacon bits, ground in a spice grinder", "1/3 cup peeled and grated apple", "1/3 cup grated onion", "2 teaspoons grated green bell pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prep ribs, all you have to do is trim any excess fat and remove the skinlike membrane on the back of the ribs. The easiest way to remove it is to start in the middle of the rack and work a table knife or a screwdriver underneath the skin, going all the way across and teasing it up. Slide your forefinger in there and bring your thumb across, holding the rib down and pulling the membrane straight up.  It'll peel from the middle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the ribs liberally with Magic Dust, coating both sides.  Put them in a shallow pan or on a cookie sheet and cover them with clear plastic wrap or a lid.  Refrigerate them until you're ready to use them. I recommend letting them marinate for at least an hour. At the restaurant, we dust the ribs up to a day in advance. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start your fire per the <a href=\"#lightfire\">\"How to Light a Fire\"</a> instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the apple wood chips in water for half an hour. Drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the grate and arrange the medium-hot coals in a grill or smoker. If you are using a grill, it must have a lid. Set an aluminum pan next to the coals as a drip pan. Spread out the wet wood chips on the coals. Replace the rack, close the grill, and check the temperature. It should be between 200 and 210 degrees. If the temperature is too high, open the lid to allow some heat to escape. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Notice that the meat on a rack of ribs is on the top. The bottom, where you removed the membrane, is called the \"bone side.\" Once the temperature is steady, place the ribs on the rack, bone side down. You want to cook them bone side down as much as possible. Turning them dries out the meat. If necessary, you can cut the racks of ribs in half to comfortably fit your grill. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and smoke the ribs for about 1 1/2 hours or until the ribs are done and tender. Do all your homework and read the characteristics of a perfectly cooked rib in Chapter 8. (?)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You'll want to check the ribs every 20 minutes or so. Examine them to see if the surface of the meat looks dry or moist. Ribs \"sweat\" about three times during the smoking process. The pores of the meat open, and this allows moisture to escape. This is when the seasoning from the dry rub and the smoke itself are reabsorbed into the meat. When they're sweating, mop or mist them with some apple juice and sprinkle them with a little more Magic Dust. Opening the lid will lower the temperature; add more coals and wood chips as needed to maintain the temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 10 minutes before you remove the ribs from the pit, mop them with the sauce. When you take them off the pit, mop again with sauce and sprinkle some more Magic Dust on them. Serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"magicdust\"></a><strong>Magic Dust</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 2 1/2 cups - </em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To make this spice mix a little more hot and spicy, increase the mustard powder and black pepper to 1/4 cup each. </em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all ingredients, and store in a tightly covered container. You'll want to keep some in a shaker next to the grill or stove. Keeps indefinitely but won't last long.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"applecitybarbecuesauce\"></a><strong>Apple City Barbecue Sauce</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 3 cups - </em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the ketchup, rice vinegar, apple juice or cider, cider viengar, brown sugar, soy sauce or Worcestershire sauce, mustard, garlic powder, white pepper, cayenne, and bacon bits in a large saucepan. Bring to a boil over medium-high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the apple, onion, and bell pepper. Reduce the heat, and simmer, uncovered, 10 to 15 minutes or until it thickens slightly. Stir often.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow to cool; pour into sterilized glass bottles. A glass jar that used to contain mayonnaise or juice works well. Refrigerate for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"lightfire\"></a><strong>How to Light a Fire</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As I've mentioned, I think the chimney starter is one of the best inventions ever. All you'll need is the charcoal, a few sheets of newspaper or a paper towel, and a match. A chimney starter will hold about 2 to 2 1/2 pounds of charcoal&mdash;half of a 5-pound bag. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Determine how many coals you think you'll need at one time. This will depend on your pit, and it'll require some trial and error. Put the charcoal in the chimney, wad up a piece of newspaper or a paper towel, stuff it underneath the chimney, and light the paper. Set the chimney on the ground next to your pit. Your charcoal will be ready to transfer to the grill in the time it takes to drink one beer&mdash;about 15 minutes. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Again, anticipating when you'll need that next batch of coals takes some practice. When you transfer your coals to the pit, leave one or two lumps in the bottom of the chimney starter and then add some more charcoal on top of that. The smoldering coals will start burning the fresh charcoal. You won't need to use any more paper. This batch of charcoal will take a little longer to burn down, maybe 20 to 30 minutes, but typically you have the time. You won't need this next batch of coals that quickly. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you're competing and you're using two or more pits, you'll want to have two or three chimney starters to keep up with the amount of charcoal you'll need. </p>\r\n\r\n<p>If you're using natural lump charcoal, which I highly recommend, you could add a few raw lumps directly to the fire, once it gets going. In a pinch, I might add two, three, or four raw lumps, but I'd never add 30 at a time. It takes too long for 'em to catch on fire. I'd never add raw briquettes. Not only do they take too long to catch on fire, but even good briquettes seem to put off a fume. Something to do with the binder and compression of wood. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Most people overfire. By that I mean that they start off with too much charcoal, thus starting out at too high a temperature.  I suggest starting off with fewer pieces of charcoal and increasing the temperature as necessary.  It's easier to increase the temperature than to try to bring it down.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Another common mistake is opening the lid to bring the temperature down. This does allow the heat at the top of the pit to escape, but it also lets the fire get all of the oxygen it wants, so the tire picks up. If you do need to bring the temperature down, you need to shut off the air source to the fire. Shut off both the draw (bottom vent) and the top vent to smother the fire. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Charcoal</strong> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Charcoal is what you use for heat. Be sure to use a natural lump charcoal. Charcoal briquettes have additives such as carbon, coal dust, lime, binders, and other chemicals that make them easy to light but that throw off an unpleasant taste. Never use lighter fluid, either. Briquettes and lighter fluid will leave your meat with a noticeable chemical taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>There are many good natural lump charcoals on the market. Be sure to look for the words \"all natural\" and \"no additives\" on the label. On the competition circuit, I used charcoal by Hickory Specialties, now called Royal Oak. Peoples Woods' \"Nature's Own\" from Cumberland, Rhode Island, is another one of my favorite brands. Barbecue legend Billy Bones has his own private label charcoal made by Sugartown Products for sale on his Web site. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Wood</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wood is used in barbecue to get smoke value, not heat value. Heat comes from charcoal; smoke flavor comes from wood. </p>"}]}