{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20070906greenspanplum.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "cake", "desserts", "plums"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Dimply Plum Cake", "link": "https://www.seriouseats.com/recipes/2007/09/baking-with-dorie-dimply-plum-cake.html", "description": "<a href=\"http://www.doriegreenspan.com/\">Dorie</a> says: \"The base of this treat is a brown-sugar cake flavored with cardamom and orange zest, a combination I really like with <strong>plums.</strong> The cake itself is a simple beat-the-butter-with-the-sugar affair. <strong>The baked fruit is really what makes it special.</strong> I love the way the way the <strong>plum juices seep into the batter</strong> and add their own <strong>tangy sweetness</strong> to the mix.\"", "totalTime": null, "recipeYield": "8 servings", "recipeCategory": ["Baking With Dorie", "Desserts", "Plum"], "recipeIngredient": ["1 1/2 cups all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon salt", "Scant 1/4 teaspoon ground cardamom (optional)", "5 tablespoons unsalted butter, at room temperature", "3/4 cup (packed) light brown sugar", "2 large eggs", "1/3 cup flavorless oil, such as canola or sunflower", "Grated zest of 1 orange", "1 1/2 teaspoons pure vanilla extract", "8 purple or red plums, halved and pitted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong> Center a rack in the oven and preheat the oven to 350 degrees F. Butter an 8-inch square baking pan, dust the inside with flour, tap out the excess and put the pan on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the flour, baking powder, salt and cardamom, if you’re using it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with a mixer, beat the butter at medium speed until it’s soft and creamy, about 3 minutes. Add the sugar and beat for another 3 minutes, then add the eggs, one at a time, and beat for a minute after each egg goes in. Still working on medium speed, beat in the oil, zest and vanilla&mdash;the batter will look smooth and creamy, almost satiny. Reduce the mixer speed to low and add the dry ingredients, mixing only until they are incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a spatula around the bowl and under the batter, just to make sure there are no dry spots, then scrape the batter into the pan and smooth the top. Arrange the plums cut side up in the batter&mdash;I usually make four rows of four plum halves each&mdash;jiggling the plums a tad just so they settle comfortably into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for about 40 minutes, or until the top is honey brown and puffed around the plums and a thin knife inserted into the center of the cake comes out clean. Transfer the cake to a rack and cool for 15 minutes&mdash;during which time the plums’ juices will seep back into the cake&mdash;then run a knife around the sides of the pan and unmold the cake. Invert and cool right side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> You can wrap the cake and keep it at room temperature for up to 2 days, during which time it will get softer and moister.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p class=\"caption\">Photograph by Alan Richardson</p>"}]}