{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070731ctbsole.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "Italian", "keywords": ["books", "chicken", "Cook the Book", "cookbooks", "CTB: Cucina del Sole", "Italian", "southern Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lemon and Garlic Chicken", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-lemon-and-garlic.html", "description": "The second featured recipe from Cucina del Sole is one that's as simple as it is delicious. The lemon and rosemary give the roasted chicken here a Mediterranean flavor, as is befitting the book's southern Italian theme, and the garlic...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Cook the Book", "Healthy and Delicious", "Italian", "Mains"], "recipeIngredient": ["2 fresh lemons, preferably organic", "1 head of garlic ", "1 roasting chicken, about 4 pounds, cut up, or 4 pounds chicken legs and thighs ", "1/3 cup extra-virgin olive oil", "3 or 4 bay leaves", "2 fresh rosemary sprigs", "Sea salt and freshly ground black pepper", "12 to 16 small new potatoes, partially peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the lemons and chop them, skin and all, into about 8 pieces each. Smack the head of garlic on a board to separate the cloves, then smash each one lightly with the flat blade of a knife to loosen the peel. Remove and discard the peels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the chicken parts and dry thoroughly with paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear a couple of tablespoons of the olive oil all over the bottom of a roasting pan, then arrange the chicken pieces in the dish. Add the lemon sections to the dish, squeezing each one slightly to release the juice and pressing them down in among the chicken. Scatter the garlic cloves, bay leaves, and rosemary among the chicken pieces. Dribble the rest of the olive oil over the chicken and sprinkle it quite liberally with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to the preheated oven and bake for about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to a rolling boil and add the potatoes. Cook for about 15 minutes, just long enough to tenderize the potatoes slightly. Drain the potatoes and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 20 minutes, remove the chicken from the oven and raise the oven temperature to 425&deg;F. Turn each piece of chicken over and add the potatoes to the pan, stirring to coat them well with olive oil. Return the dish to the oven and roast for 30 to 40 minutes more, or until the chicken and the potatoes are crisp and brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and serve immediately.</p>"}]}