{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["cornmeal", "Ellie Krieger", "ratatouille", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cornmeal-Crusted Roasted Ratatouille Tart", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-cornmeal-crusted-roasted-ratatouille-recipe.html", "description": "Watching the animated food critic Anton Ego take his transcendent bite of ratatouille in the movie by the same name, only makes you wonder what about this classic French peasant dish warrants such fuss. If you're as curious as I...", "totalTime": "", "recipeYield": "8 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>For the crust</strong> ", "2/3 cup yellow cornmeal ", "1/3 cup whole-grain pastry flour or whole-wheat flour ", "1/4 teaspoons saIt ", "2 tablespoons unsalted butter ", "2 tablespoons canola oil ", "3 tablespoons water ", "<strong>For the filling </strong>", "2 tablespoons plus 1 teaspoon olive oil ", "2 shallots, thinly sliced (about 1/3 cup) ", "Cooking spray ", "1 small eggplant (about 1/2 pound), cut into 1/8-inch-thick rounds ", "1 small zucchini (about 1/2 pound), cut into 1/8-inch-thick rounds ", "3 medium ripe tomatoes, thinly sliced ", "1/4 teaspoon salt ", "1/4 teaspoon freshly ground black pepper ", "3/4 cup shredded part-skim mozzarella cheese (about 3 ounces) ", "1/4 cup shredded fresh basil ", "1/4 cup freshly grated Parmesan cheese "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the crust, combine the cornmeal, flour, and salt in a food processor and pulse to incorporate. Add the butter and oil and pulse about 20 times, until the mixture resembles small pebbles. Add the water and pulse until the mixture forms a loose dough. Remove the dough from the processor and press into the bottom and about 1/8 inch up the sides of a 9-inch tart pan with a detachable rim. Press aluminum foil into the bottom and up the sides of the pan on top of the dough. Weight it down with uncooked rice or pie weights. Place the tart pan on a baking sheet and bake for 10 minutes. Remove the rice and foil and bake for another 5 minutes. Remove from the oven and let cool. Increase the oven temperature to 400°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the filling, heat 1 teaspoon of the oil in a small nonstick pan over medium heat; cook the shal­lots, stirring, until softened, 5 to 6 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat two baking sheets with cooking spray. Arrange the eggplant, zucchini, and tomato slices on the sheets in a single layer and brush with the remaining 2 tablespoons oil. Sprinkle with the salt and pepper and roast the vegetables until soft but not browned, about 15 minutes. Remove form the oven and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the oven temperature to 350°F. Lay the eggplant slices on the bottom of the tart, overlapping them if neccessary; cover with one-third of the mozzarella and some of the shredded basil. Add the zucchini and shalots, top with another third of the mozzarella and the remaining basil, then the tomatoes. Top with rest of the mozzarella and all of the Parmesan. Bake until the cheese is melted and the vegetables have further wilted, 25-30 minutes. Remove from the oven, let cool for 5 minutes, and cut into 8 slices. Serve warm.</p>"}]}