{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/books-summer-shack-cookbook.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cookbooks", "CTB: Summer Shack", "fish", "fried fish", "Jasper White", "recipes", "seafood", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Perfect Pan-Fried Breaded Fish", "link": "https://www.seriouseats.com/recipes/2007/06/perfect-pan-fried-fish-from-jasper-whites-summer-shack-cookbook.html", "description": "I have a confession: Until somewhat recently, I did not like the fish. I'd like to blame it on having been raised in Kansas, but the truth is my dad is an avid fisherman and caught plenty of fresh lake...", "totalTime": "", "recipeYield": "4 as a main course", "recipeCategory": ["Cook the Book", "Fish", "Mains"], "recipeIngredient": ["2 large eggs ", "1/4 cup whole milk ", "2 cups all-purpose flour ", "2 cups panko crumbs (Japanese bread crumbs) or fresh white bread crumbs", "Four 8-ounce skinless fish fillets, no thicker than 3/4 inch ", "Kosher or sea salt and freshly ground black pepper", "3 tablespoons vegetable oil, or as needed ", "3 tablespoons unsalted butter. or as needed", "Lemon wedges and fresh parsley sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a large shallow bowl, add the milk, and beat well. Spread the flour and the crumbs in two separate bowls or pie plates. Set a wire rack over a baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the fish fillets on both sides with salt and pepper. Dredge one fillet in flour, lift it out, knock off excess flour, and place fillet in egg wash, making sure entire fillet is coated. Remove fillet from egg wash, letting excess drip off; place in crumbs. Gently press crumbs onto fish on both sides, coating it completely. Transfer breaded fillet to cooling rack; repeat process with remaining fillets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a well-seasoned 12-inch cast-iron skillet over medium-high heat; heat for 5 minutes. Add the oil and butter to skillet. Sprinkle a few crumbs into pan to test temperature&#151;they should sizzle when they hit the fat. Lower fish fillets into hot fat, which should come halfway up sides of fish. As soon as crumbs begin to darken, reduce heat a bit. The key is even cooking, so that when you turn the fillets, they are a perfect golden brown. This will take about 3 to 4 minutes a side; the thicker the fish, the more slowly you should cook it&#151;turn the heat down a bit more if necessary. Turn the fillets; cook 3 to 4 minutes more, until golden brown. Add a little more oil and butter to pan if it appears dry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spatula, transfer fish to individual plates or a platter. Serve garnished with lemon wedges and sprigs of parsley.</p>"}]}