{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20070830melbaz.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "corn", "desserts", "ice cream", "peach Melba", "peaches", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: End-of-Summer Sundae", "link": "https://www.seriouseats.com/recipes/2007/08/okay-this-really-isnt-about.html", "description": "Dorie Greenspan's perfect end-of-summer sundae mixes three of the season's classic foods. Poached <strong>peaches</strong> mingle with <strong>raspberry</strong> sauce and <strong>sweet corn</strong> ice cream.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking With Dorie", "Peach"], "recipeIngredient": ["<strong>For the peaches:</strong>", "4 ripe but firm peaches", "2 cups water", "3/4 cup sugar (you can add up to 1/4 cup more if your peaches aren't super sweet)", "10 leaves lemon verbena (optional)", "3 fat strips lemon zest (removed with a vegetable peeler)", "Pulp and pod from 1/2 vanilla bean or 1/2 teaspoon pure vanilla extract", "2 tablespoons crème de cassis, crème de framboise or Chambord", "Freshly squeezed lemon juice, to taste", "&nbsp", "<strong>For the raspberry sauce:</strong>", "1/2 pint fresh raspberries", "&nbsp", "<strong>For the vanilla ice cream:</strong>", "2 large eggs", "3/4 cup sugar", "2 cups cream", "1 cup milk", "1 1/2 tablespoons pure vanilla extract", "&nbsp", "Lightly whipped cream, for finishing the sundae", "Fresh raspberries, for finishing the sundae (optional)", "Toasted sliced or slivered almonds, for finishing the sundae (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To poach the peaches:</strong> Bring a pot of water to the boil. Drop in the peaches, count to 20, then remove them with a slotted spoon and slip off their skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Empty the pot, add the water and sugar and boil until the sugar dissolves. Add the lemon verbena, if you're using it, the lemon zest and the vanilla bean. (If you're using vanilla extract, hold on to it—you'll add it later.) Bring the mixture to the boil, lower the heat and simmer for 5 minutes. Drop in the peaches and poach them gently for 10 minutes. If there isn't enough liquid to immerse the peaches, cover the pot and turn the peaches frequently. Carefully transfer the peaches to a container that will hold them and the liquid. Stir in the liqueur and the vanilla extract, if you're using it. Taste the syrup and add lemon juice, if you'd like, then pour the poaching syrup over the peaches. Allow the peaches to cool in the syrup. (You can make the peaches up to 3 days in advance and keep them immersed in the syrup, covered and refrigerated.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the raspberry sauce:</strong> Purée the berries in a blender or food processor. You can either leave the sauce as is, with the seeds, or strain it. Add 1 tablespoon – more if you'd like – of peach syrup and cover and chill until needed. (The sauce will keep for up to 3 days in the refrigerator.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the ice cream:</strong> Beat the eggs and sugar together until the mixture turns pale. Add the cream, milk and vanilla and churn, following the instructions that came with your ice cream machine. Transfer the ice cream to a container and freeze for at least 2 hours, or until it is scoopable.</p>"}]}