{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["pork", "pork tenderloin", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tom Valenti's One-Pot Meals: Pork Tenderloin Medallions", "link": "https://www.seriouseats.com/recipes/2007/07/tom-valentis-onepot-meals-pork.html", "description": "Pork tenderloin is an incredibly versatile and easy cut of meat to cook with. You can use it whole or, to really speed up the preparation process, cut into medallions. Tom Valenti, best-selling cookbook author and owner of Ouest restaurant...", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Pork"], "recipeIngredient": ["2 pork tenderloins (about 1 pound each) , cut crosswise into 1 to 1 1/2-inch medallions", "3 cloves garlic. peeled and thinly sliced", "1/4 cup olive oil", "1 quart water", "4 large Spanish onions. peeled and cut into small dice", "2 cups cider vinegar", "1/4 cup light brown sugar", "1 1/2 cups tomato ketchup", "1/4 cup molasses", "1/4 cup chipotle chiles in adobo, pureed in a blender", "4 teaspoons Worcestershire sauce", "1/4 teaspoon Tabasco sauce", "1/2 teaspoon cumin seeds", "Coarse salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pork medallions in a baking dish. Scatter the garlic slices over the pork and drizzle with the olive oil. Cover; let marinate in the refrigerator for 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a boil in a large, heavy-bottomed pot over high heat. Add the onions, and boil until tender, 2 to 3 minutes. Remove onions with a slotted spoon; discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually stir the vinegar and brown sugar into the boiling water; let boil for 5 minutes. Stir in the ketchup, molasses, chipotle purée, Worcestershire sauce, Tabasco sauce, and cumin seeds. Remove the pot from the heat. If not serving immediately, let cool, cover, and refrigerate for a few days or freeze for up to 1 month. Reheat before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork medallions from the refrigerator and let come to room temperature. Set aside half of sauce. Prepare an outdoor grill for grilling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush off the garlic slices and excess oil from pork medallions, season them on both sides with salt and pepper, and place them on the grate over the hottest part of the grill. Grill, basting with the remaining half of the barbecue sauce, for about 5 minutes on each side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, place 1 pork portion on each of 4 plates and serve the reserved barbecue sauce alongside.</p>"}]}