{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["cornbread", "holidays", "muffins", "thanksgiving", "Thanksgiving stuffings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cornbread Stuffing Muffins with Ham and Sage, from 'Bon Appétit'", "link": "https://www.seriouseats.com/recipes/2007/11/cornbread-stuffing-muffins-with-ham-and-sage-recipe-from-bon-appetit-magazine.html", "description": "When we talked to Bon Appétit editor in chief Barbara Fairchild about the November 2007 issue of the magazine, we asked her what her favorite Thanksgiving recipes from the issue were. These muffins, published here courtesy of Fairchild and Bon...", "totalTime": "", "recipeYield": "12 servings", "recipeCategory": [], "recipeIngredient": ["10 cups 1/2-inch cubes cornbread", "4 cups 1/2-inch cubes crustless firm white sandwich bread (from 6 to 7 slices)", "1/2 cup (1 stick) butter", "2 cups thinly sliced leeks (white and pale green parts only; about 3)", "2 cups chopped celery", "1 1/4 cups finely chopped smoked ham (about 7 ounces)", "1/4 cup chopped fresh parsley", "4 teaspoons chopped fresh thyme", "4 teaspoons dried rubbed sage", "1 teaspoon coarse kosher salt", "1 teaspoon freshly ground black pepper", "4 large eggs, beaten to blend", "2 cups low-salt chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Generously butter twelve 1/3-cup nonstick muffin cups. Divide cornbread cubes and white bread cubes between 2 rimmed baking sheets. Dry slightly in oven, about 5 minutes. Cool. Transfer to large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in large skillet over medium heat. Add leeks and celery; cook until soft, stirring often, about 10 minutes. Add ham; stir 1 minute. Add all herbs, 1 teaspoon coarse salt, and 1 teaspoon pepper; stir to blend. Add vegetable mixture to bread; toss. Add eggs and broth; toss. Let stand 5 minutes; toss again. Spoon about 1/2 cup stuffing mixture into each muffin cup. Press to compact. Mound about 1/2 cup remaining stuffing mixture over stuffing in each muffin cup, pressing to hold shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake muffins until golden, about 22 minutes. Cool in pan 15 minutes. Using small plastic knife, loosen muffins. Transfer to rack; cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Do ahead:</strong> Can be made 1 day ahead. Cool, cover, and chill. Rewarm uncovered in microwave in 30-second intervals, or covered loosely with foil in 350&deg;F oven, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Test-kitchen tip:</strong> To ensure that the muffins can be easily removed from the pan, butter the cups generously. To release the muffins, run a plastic knife around them, twist gently, and guide them out of the pan with the knife.</p>"}]}