{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "Vietnamese", "keywords": ["phở", "Sunday Night Soups", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: Pho Bo", "link": "https://www.seriouseats.com/recipes/2007/09/this-week-the-cowboys-visit.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week’s Sunday Night Football game on NBC. This week, the Cowboys visit the Bears for Sunday night Ditkaesque action. We saw the...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Soups and Stews", "Vietnamese"], "recipeIngredient": ["2 large onions, halved lengthwise ", "1 (3-inch) piece fresh ginger, left unpeeled", "1 tb peanut oil", "4 lb meaty cross-cut beef shanks (sometimes called beef shins; 1 1/2 inches thick), oxtails or other meaty beef bones. ", "1 lb fresh (uncured) brisket", "7 qt cold water", "1 Pho sachet,* or: ", "6 whole star anise, ", "3 sticks cinnamon, ", "1 tablespoon cardamom pods, ", "1 tablespoon black peppercorns and ", "8 whole cloves", "1 (1/2-lb) piece boneless beef sirloin steak or tenderloin", "1 lb dried rice noodles (banh pho)", "1 lb bean sprouts ", "4 limes, quartered", "1 bunch basil, cilantro, or mint, rinsed and stemmed", "Asian fish sauce (preferably Vietnamese nuoc mam), or to taste", "Vietnamese chili paste (sriracha) (Huy Fong is a good brand.)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the ginger into thick coins. Slice the onions. Add to stockpot with oil, and cook over medium heat until onions begin to color. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse shanks, then cover with cold water, and bring to boil. Discard water and re-rinse shanks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add shanks to stockpot, and cover with 6-7 quarts of water. Toast spices in skillet until fragrant, taking care not to burn them. Bring to gentle boil,  add spices, and allow to simmer for 4-6 hours, partly covered, adding water as needed. Two hours before you plan to stop cooking the the soup, add the brisket. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place sirloin in the freezer for approximately 30 minutes, and sharpen your best knife. Slice sirloin against the grain, as thinly as possible. Cover and refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the stock through a colander. Check seasoning, and add salt or fish sauce if so desired.  If there is salvageable meat on the soup bones, salvage it. Slice the brisket thinly, cover and refrigerate. Cover the stock and refrigerate. (Cooling the stock is not essential, but it does allow you to remove the fat from the stock, which depending on the soup bones, may be enough to make the stock greasy.) Remove the hard white beef fat from the top of the cooled stock. If you are so inclined, save the beef fat, and the Gurgling Cod can tell you how to make a Vietnamese-flavored Yorkshire pudding which will utterly confound your guests. Reheat stock. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak or cook the rice noodles according to the directions on the package, remembering that the noodles will be immersed in hot broth, so less soaking or cooking is a better bet than more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blanch the bean sprouts for 30 seconds in a pot of boiling water. Drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a portion of noodles in individual bowls. Layer the brisket and sirloin over the noodles. At the table, pour the hot broth over the individual bowls (the broth will cook the sirloin. Pass basil, limes, sprouts, and Vietnamese chili paste (sriracha), and fish sauce. Stir well to combine ingredients and cook sirloin. Serves 6-8.</p>"}]}