{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070904primetimegrilling.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "cowboy steaks", "CTB: Prime Time Grilling", "Lobel's", "meat", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Cowboy Steak with Chipotle Mayonnaise", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-cowboy-steak-with-chipotle-mayo.html", "description": "According to the Lobels, the folks who wrote the book we're featuring this week, cowboy steaks are \"big, brawny, extra-thick, bone-in rib-eye steaks weighing in at about two pounds each.\" They take a while to grill—about 30 to 35 minutes—but...", "totalTime": "", "recipeYield": "2 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>Steaks:</strong>", "One 2-pound cowboy steak, about 2 1/2 inches thick", "Olive oil", "2 teaspoons crushed fresh black peppercorns", "Salt and freshly ground black pepper", "Vegetable oil cooking spray", "<strong>Mayonnaise:</strong>", "1 small chipotle chile in adobo sauce, wiped dry and chopped fine (about 2 tablespoons)", "1/2 cup mayonnaise, store-bought or homemade", "1 small clove garlic, minced", "1 tablespoon chopped fresh cilantro", "1 tablespoon fresh lemon juice", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the steaks: Rub both sides and the sides of the steak with olive oil. Sprinkle the crushed peppercorns on both sides of the steak, pressing them lightly into the meat. Season lightly with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a charcoal or gas grill for <a href=\"#indirectcooking\">indirect cooking</a>.  Lightly spray the grill rack with vegetable oil cooking spray. Light the coals or heating elements, and let them burn or heat until hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the steak over the hottest part of the grill for about 5 minutes. Turn and sear for 5 minutes on the other side. Move the steak to the cool part of the grill and grill, covered, for 15 minutes. Turn and grill for 15 to 20 minutes longer for medium-rare or until it is cooked to the desired degree of doneness. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the chipotle mayonnaise: In a small bowl, stir the chile into the mayonnaise. Add the garlic, cilantro, and lemon juice, stir gently, and season to taste with salt and pepper. Cover and refrigerate if not using within 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the meat rest for a few minutes before serving with the mayonnaise on the side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> Chipotle chiles usually are sold canned, packed in adobo sauce, and are available in many supermarkets as well as Latin markets and specialty food stores.  They are also available loose and dried, but are not as easy to find this way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"indirectgrilling\"></a><strong>Indirect Grilling:</strong> For indirect grilling, the coals are piled two or three coals deep on one side of the grill, or divided and piled on two sides.  This leaves an empty space next to the coals or between them.  If you are grilling on a gas grill, only one or two burners are lit.  Food cooked over indirect heat often is started over direct heat and then moved to the cooler (empty) part of the grill for even, slow cooking.  To make the heat as even as possible, construct two piles of coals or leave the center gas burner off and light those on either side of it.  Do not prepare the gas grill for indirect grilling by preheating only one of two burners.  Let the grill preheat with all burners on high as usual, and then turn off one or more.</p>"}]}