{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["almonds", "books", "cookbooks", "CTB: Cucina del Sole", "Italian", "pasta", "pesto", "southern Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pasta with Tomato and Toasted Almond Pesto", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-pasta-with-tomato-and-toasted-almond-pesto-recipe.html", "description": "The first recipe that caught our eye in Cucina Del Sole is a simple pesto made with fresh tomatoes (it is after all vine-ripened tomato season) and toasted almonds. As Jenkins herself writes: \"For those who think pesto comes only...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Nuts"], "recipeIngredient": ["4 or 5 ripe tomatoes. peeled, seeded, and chopped", "Sea salt", "1/2 to 314 cup blanched almonds", "2 garlic cloves, coarsely chopped", "6 to 8 large fresh basil leaves, torn into small pieces", "Freshly ground black pepper", "Crumbled dried red chili (optional)", "About 5 tablespoons extra-virgin olive oil", "1 pound curly pasta, such as fusilli", "3 tablespoons dry breadcrumbs "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the chopped tomatoes with about a teaspoon of salt; set in a colander in the sink to drain excess liquid while preparing the other ingredients. Preheat oven to 350&deg;F </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy mortar, crush about 1/2 teaspoon salt and the garlic together to make a paste. Add the basil leaves and crush, turning the pestle against the walls of the mortar. When the basil has been fully incorporated, gradually add the chopped drained tomatoes, a few pieces at a time, crushing them into the sauce and adding black pepper to taste, red chili if you wish, and more salt if needed as you crush. The sauce should be thick and rather chunky. Stir in, without crushing them, the finely chopped almonds. Gradually, as if you were making a mayonnaise, mix in 3 or 4 tablespoons of olive oil in a thin thread, stirring constantly. By the time you finish, the sauce should be as thick as a homemade mayonnaise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring at least 6 quarts of lightly salted water to a rolling boil. Drop in the pasta, and let cook until done, 8 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the remaining tablespoon of olive oil in a small skillet over medium heat and add the breadcrumbs. Cook, stirring, until the crumbs turn brown and crisp. Remove and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pasta is done, drain thoroughly and turn into a preheated bowl. Mix in about half the pesto and top with the rest. Sprinkle the breadcrumbs over the top and serve immediately.</p>"}]}