{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["baking", "bread", "Cook the Book", "CTB: Savory Baking From the Mediterranean", "focaccia"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Potato Focaccia", "link": "https://www.seriouseats.com/recipes/2007/10/cook-the-book-potato-focaccia.html", "description": "And, as promised, here's the first recipe from Anissa Helou's Savory Baking From the Mediterranean. Since I mentioned focaccia first, that's what we'll lead off with today. According to Helou, \"This focaccia is a specialty of Puglia, the 'heel' of...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Cook the Book"], "recipeIngredient": ["2 1/4 teaspoons (1 package) active dry yeast ", "3 cups unbleached all-purpose flour, plus extra for kneading and shaping ", "1 1/2 teaspoons fine kosher salt or sea salt ", "5 ounces all-purpose potatoes, cooked and mashed ", "Extra-virgin olive oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve the yeast in 1/2 cup warm water, and stir until creamy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour and salt in a large bowl, and make a well in the center. Add the mashed potatoes and the yeast, and, using fingertips, bring in a little of the flour. Gradually add 2/3 cup warm water and bring in the remaining flour as you go along. Knead briefly to make a rough ball of dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust a work surface with flour. Sprinkle the ball of dough with a little extra flour and knead for 2 to 3 minutes. Invert the bowl over the dough and let rest for 15 minutes. Knead for 2 to 3 minutes more, sprinkling with extra flour if the dough is sticky, until the dough is smooth and somewhat soft. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a 12-inch round pie plate with olive oil. Transfer the dough to the pie plate, and flatten and stretch the dough by hand to cover the bottom of the plate; the dough should be about 1/2 inch thick. Cover with a wet but not dripping kitchen towel and let rise in a warm, draft-free place for 1 1/2 hours. The dough should have doubled in volume. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>. Preheat the oven to 350&deg;F. Press with fingertips on the focaccia to make dimples all over. Brush generously with olive oil. Bake for 35 to 45 minutes, until the focaccia is well risen and golden brown all over. Serve warm, or transfer to a wire rack to let cool and serve at room temperature.</p>"}]}