{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "Italian", "keywords": ["Cook the Book", "desserts", "Dolce Italiano", "Gina DePalma", "Italian", "panna cotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Heavenly Panna Cotta", "link": "https://www.seriouseats.com/recipes/2007/11/babbo-heavenly-panna-cotta-recipe.html", "description": "And, as promised, here's the first recipe from Gina DePalma's Dolce Italiano: Desserts From the Babbo Kitchen. DePalma herself recommended the recipes we'll be featuring this week, choosing them for ease of preparation and maximum deliciousness in mind. About her...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts", "Italian"], "recipeIngredient": ["5 3/4 ounces (1 1/4 cups) ricotta cheese", "1 cup whole milk ", "1 1/2 cups heavy cream ", "1/2 cup plus 2 tablespoons granulated sugar ", "1/2 vanilla bean ", "4 sheets <a href=\"#gelatin\">gelatin</a>", "Chestnut honey or <a href=\"http://www.vincotto.it/\">Vincotto</a>, for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ricotta and 1/2 cup milk in a medium bowl and whisk vigorously until the ricotta is smooth and lump-free. Place the heavy cream and sugar in a medium saucepan. Scrape the seeds from the vanilla bean with the flat side of a small knife and add them to the pan along with the bean. Place the mixture over medium heat and bring just to the boiling point, whisking occasionally. In the meantime, place the gelatin sheets in a bowl of cold water to soften them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cream mixture has scalded, turn off the heat. Remove the gelatin from the water, pat away the excess water with a soft towel, and add the gelatin to the cream mixture, whisking it in thoroughly to dissolve it. Whisk in the remaining 1/2 cup milk. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually pour the liquid into the bowl with the ricotta, whisking constantly until the mixture is completely smooth. Remove the vanilla bean and strain the mixture through a chinois or fine-meshed sieve. Divide the panna cotta among 6 dessert glasses and refrigerate until set, about 4 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before serving, drizzle the surface of each panna cotta with 1 or 2 teaspoons of warm chestnut honey or a few drops of vincotto. </p>"}]}