{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/ctb-theperfectscoop.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["contests", "Cook the Book", "cookbooks", "CTB: The Perfect Scoop", "david lebovitz", "ice cream", "recipes", "The Perfect Scoop"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fresh Mint Ice Cream", "link": "https://www.seriouseats.com/recipes/2007/06/cook-the-book-fresh-mint-ice-c.html", "description": "I once took my friend to an ice cream shop that made mint ice cream from real mint, as opposed to the artificial stuff you find it most places. After taking one bite she alleged that it didn't taste...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["1 cup (250 ml) whole milk ", "3/4 cup (150 g) sugar ", "2 cups (500 ml) heavy cream ", "Pinch of salt ", "2 cups (80 g) lightly packed fresh mint leaves ", "5 large egg yolks "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the milk, sugar, 1 cup (250 ml) of the cream, and salt in a small saucepan. Add the mint leaves and stir until they're immersed in the liquid. Cover, remove from the heat, and let steep at room temperature for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the mint-infused mixture through a mesh strainer into a medium saucepan (the milk will be a lovely shade of emerald). Press on the mint leaves to extract as much of the flavor as possible, then discard the mint leaves. Pour the remaining 1 cup (250 ml) heavy cream into a large bowl and set the strainer on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rewarm the mint-infused mixture. In a separate medium bowl, whisk together the egg yolks. Slowly pour the warm mint liquid into the egg yolks, whisking constantly, then scrape the warmed egg yolks back into the saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the mixture constantly over medium heat with a heatproof spatula, scraping the bottom as you stir, until the mixture thickens and coats the spatula. Pour the custard through the strainer and stir it into the cream. Stir until cool over an ice bath. </p>"}]}