{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070727alone_100.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["beets", "Cook the Book", "CTB: Alone in the Kitchen", "cucumbers", "Jenni Ferrari-Adler", "salads", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Roasted Beet and Cucumber Salad", "link": "https://www.seriouseats.com/recipes/2007/08/cook-the-book-roasted-beet-and-cucumber-salad.html", "description": "If you missed Monday's intro post on it, this week's Cook the Book features Jenni Ferrari-Adler's Alone in the Kitchen with an Eggplant, a book in which food writers and food-crazy authors share what it means to cook for one...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Cucumber", "Healthy and Delicious", "Salads", "Vegetarian"], "recipeIngredient": ["1 bunch beets ", "Salt, to taste", "Extra-virgin olive oil", "Red wine vinegar ", "Freshly ground pepper, to taste", "1 English cucumber ", "1 bunch radishes ", "1 teaspoon chopped fresh dill (or more to taste) ", "1 teaspoon chopped fi:esh mint (or more to taste) Ricotta salata "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the beets: Remove tops and wash beets. Place beets in a roasting pan; sprinkle with salt and olive oil. Add a little water to the pan to prevent beets from sticking. Roast in 350&deg;F oven until beets are easily pierced with a knife. Let cool; peel off the skins and slice into quarter-inch slices. Toss with a little vinegar, olive oil, salt, and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cucumber salad: Prepare this at least half an hour before serving to let the vegetables soften. Peel cucumber in alternating strips, cut it in half lengthwise, and scoop out the seeds with a spoon. Slice on the bias into quarter-inch slices. Slice the radishes into thin rounds. Cut the red onion in half and slice it as thin as possible against the grain. As with the beets, toss  cucumber, radishes, and onion with olive oil, vinegar, salt, and pepper as well as the dill and mint. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beets on the plate, put the cucumber salad on top of the beets, and shave ricotta salata on top.</p>"}]}