{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "Italian", "keywords": ["Holiday Food", "Italian", "Mario Batali", "nuts", "pastas", "vegetarian", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper:  Linguine alle Noci (Linguine with Walnut Sauce)", "link": "https://www.seriouseats.com/recipes/2007/12/sunday-supper-linguine-alle-noci-linguine-with-walnut-sauce.html", "description": "This Mario Batali pasta recipe for Linguini alle Noce (with Walnut Sauce) is so delicious, so simple, and so inexpensive it is the perfect Sunday dinner (or brunch for that matter) for everyone, from college students looking to rustle up...", "totalTime": null, "recipeYield": "4 to 8 servings", "recipeCategory": ["Italian", "Mains", "Nuts", "Pasta", "Sunday Supper", "Vegetarian"], "recipeIngredient": ["1/4 cup extra-virgin olive oil ", "3 garlic cloves, thinly sliced ", "1/2 cup toasted hard bread crumbs ", "1 cup roughly chopped walnuts ", "1 tablespoon hot red pepper flakes ", "1 pound linguine ", "1/2 cup roughly chopped Italian parsley ", "1/2 cup freshly grated caciocavallo cheese or pecorino romano "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 6 quarts of water to a boil and add 2 tablespoons kosher salt </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 14- to l6-inch fry pan, heat the oil over medium heat till smoking. Add the garlic and cook until light golden brown, 2 to 3 minutes. Add half of the bread crumbs, the walnuts, and pepper flakes and cook until lightly toasted, 3 to 4 minutes. Remove from the heat and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the pasta into the boiling water and cook according to the package instructions until 1 minute short of al dente. Just before draining the pasta, add 1/4 cup of the pasta cooking water to the pan with the walnut mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta in a colander and pour the pasta into the pan with the walnut mixture. Place the pan over medium heat and continue cooking the pasta with the walnut mixture until the pasta is lightly dressed with the condiment, about 1 minute. Add the parsley and grated cheese, stir through, pour into a heated bowl, sprinkle with the remaining bread crumbs, and serve immediately. </p>"}]}