{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["cantaloupes", "soups", "Sunday Night Soups", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: Roasted Cantaloupe Soup", "link": "https://www.seriouseats.com/recipes/2007/11/sunday-night-soups-roasted-cantaloupe-soup.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week's Sunday Night Football game on NBC. In case you missed them last week, the Patriots are back on Sunday night, hosting...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Healthy and Delicious", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["4 good size tomatoes (or around 2 pounds)", "1 cantaloupe", "Pretty good olive oil", "1 ludicrously expensive package of basil (the kind sold in the small plastic clamshells) or equivalent", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F. Boil a pot of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the melon in half, scoop out the seeds, cut melon into slices and remove rind from melon. Put a generous slug or two of olive oil in a cast iron skillet, and swirl melon pieces around in the oil. Give another swirl in 10 minutes or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the melon roasts, prep tomatoes: use a paring knife to remove the core of the tomato (you will remove a cone shaped section, oriented around the north pole of the tomato), cut a shallow X in the bottom, and drop into boiling water for 30 seconds, then dunk in ice water.  Cut tomatoes in half, and work skins off under running cold water, and use the water to rinse out all the seeds&#151;you will have to pull the tomato apart a bit as you do this.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cantaloupe pieces are starting to lose structural integrity, and you have a nice slurry of olive oil and cantaloupe essence in the skillet, but before anything chars, turn the cantaloupe out into a bowl, leaving at least some of the slurry in the pan, and add the tomatoes, adding more oil if they threaten to stick. Cook tomatoes just enough so that they do not taste raw.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When melon and tomato are cool enough to work with, combine with basil  and some ice in a blender. Make sure you get all the slurry in there. You remembered to rinse the basil.  Add some lemon, reblend, and check seasoning.  Allow soup to chill, 45 minutes.</p>"}]}