{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "eggs", "Sunday Brunch", "toast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Truffled Egg Toast", "link": "https://www.seriouseats.com/recipes/2007/10/sunday-brunch-truffled-egg-toast.html", "description": "If there's a better egg sandwich than the truffled egg toast made at 'ino in Greenwich Village, I haven't found it. The soft, runny egg, the crunchy white toast, the tangy fontina chesse, and even the usually evil truffle oil...", "totalTime": null, "recipeYield": "4 toasts", "recipeCategory": ["Breakfast and Brunch", "Eggs"], "recipeIngredient": ["2 asparagus spears, woody stems removed ", "4 slices of bread, 1 inch thick ", "8 thin slices of Fontina (about 6 ounces) ", "8 large eggs ", "3 tablespoons truffle-infused oil ", "1/2 teaspoons coarse sea salt ", "Freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a panini grill. Grill the asparagus spears for 2 minutes until they appear roasted but are still crunchy. Transfer to a cutting board and slice thinly on the diagonal. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a toaster oven, lightly toast the slices of bread. Transfer the toasts to a baking sheet. Use a serrated knife to score a 2-inch square in the center of the toasts. Use the handle end of the knife to tamp the squares down, creating indentations to contain the eggs. Cut each Fontina slice into 4 wide strips and form a border around the flattened centers of the bread (there should be no cheese overhang). Crack and separate each egg, sliding 2 yolks into the center of each slice of bread (the whites can be discarded or used for egg-white omelets). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the baking sheet to the toaster oven (or a conventional oven preheated to 350&deg;F) and, using a high setting, toast until the cheese has melted and begins to bubble, about 3 minutes. (For those who fear an undercooked egg, cook the toasts for an additional 2 minutes until the yellows have set.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the toasts to small serving plates, stir the yolks with the tip of the knife (they should be runny), and garnish with asparagus slices. Drizzle a generous amount of truffle oil over each and sprinkle with salt and pepper. Serve immediately. </p>"}]}