{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070917puredessert.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "cake", "Cook the Book", "CTB: Pure Dessert"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Olive Oil and Sherry Pound Cake", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-olive-oil-and-sherry-pound-cake.html", "description": "Alice Medrich, author of Pure Dessert, from which this recipe comes, advises would-be bakers of this cake not to fear the olive oil in it. The result won't be overly sweet, as you'd imagine. Instead, the oil, sherry, and orange...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Desserts", "Healthy and Delicious"], "recipeIngredient": ["3 cups (13.5 ounces) all-purpose flour ", "2 teaspoons baking powder ", "1/4 teaspoon salt ", "2 cups sugar ", "1 cup flavorful extra virgin olive oil ", "2 teaspoons grated orange zest (from medium orange) ", "5 large cold eggs ", "1 cup medium (amontillado) sherry ", "<h5>Equipment</h5>", "A 10- to 12-cup tube or Bundt pan or two 8 by 4-inch (4 cups) loaf pans "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the rack in the lower third of the oven and preheat the oven to 350&deg;F. Grease and flour the pans. (Or, if you prefer, line the bottom and sides of the loaf pans with parchment.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the flour, baking powder, and salt thoroughly in a large bowl and sift together. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer (with the whisk attachment if you have one), beat the sugar, oil, and orange zest on high speed until well blended. Add the eggs one at a time, beating well after each addition; continue to beat until the mixture is thick and pale, 3 to 5 minutes. Stop the mixer and add one-third of the flour mixture. Beat on low speed just until blended. Stop the mixer and add half of the sherry. Beat just until blended.  Repeat with another third of the flour, followed by the remaining sherry, and then the remaining flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the batter into the pan(s). Bake until the cake tester comes out clean, 50 to 60 minutes for either the tube pan or the loaves. Cool the cake in the pan(s) on a rack for about 15 minutes before unmolding. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using a tube pan, slide a skewer around the tube. If the sides of the pan are straight, slide a thin knife or spatula around the sides to release the cake (unless lined with paper). If using a Bundt or other decorative pan, tap one side of the pan against the counter to release the cake, then tap the other side. Invert the cake onto a rack. Turn the preferred side up before cooling the cake completely. Wrapped airtight, the cake keeps well at room temperature for up to 3 days, or freeze for up to 3 months. </p>"}]}