{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book_on-top-of-spaghetti.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["George Germon", "Gorgonzola", "Italian", "Johanne Killeen", "linguine", "pasta", "recipes", "Serious Recipes", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Linguine with Gorgonzola and Fresh Spinach", "link": "https://www.seriouseats.com/recipes/2007/04/linguine-with-gorgonzola-and-fresh-spinach-recipe.html", "description": "On Top of Spaghetti is the second cookbook by Johanne Killeen and George Germon, the owners of Al Forno in Providence, Rhode Island. I've eaten at Al Forno many times over the years, and the pastas, grilled pizza, and desserts...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Spinach"], "recipeIngredient": ["4 ounces Gorgonzola cheese, at room temperature", "3 tablespoons unsalted butter, at room temperature", "8 cups firmly packed and trimmed young, fresh spinach", "2 tablespoons extra virgin olive oil", "2 teaspoons sea salt", "1 pound dried linguine or spaghetti (I used linguine)", "10 to 12 large fresh basil leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil for the pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the spinach in plenty of cold water. Drain in a colander, leaving the water clinging to the leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large straight-sided skillet over moderately high heat. Add the spinach and 1 tablespoon of the salt. Toss the spinach with tongs until it has wilted. Taste it, and add more salt if necessary. Turn off heat, but keep spinach warm on side of stove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously salt the pasta water, and drop in the linguine. Cook at a rolling boil, stirring often, according to the package instructions. Drain pasta, reserving about 1 cup of cooking water. Transfer linguine to skillet, and toss with spinach. Add the Gorgonzola-butter mixture, and toss to coat each strand of the linguine. If pasta seems dry, add a bit of cooking water and toss again. Add as much of the cooking water as you need to make a creamy consistency. If you have fresh basil, tear the leaves and toss into the mixture.  Serve immediately.</p>"}]}