{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/serioussandwiches-snake.jpg", "author": {"@type": "Person", "name": "Zach Brooks"}, "recipeCuisine": "", "keywords": ["holidays", "Paula Deen", "sandwiches", "Serious Sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Sandwiches: Snake Bites Sandwich", "link": "https://www.seriouseats.com/recipes/2007/10/serious-sandwiches-snake-bites-sandwich-recipe.html", "description": "Photograph from concrete angel on Flickr In honor of Halloween, I wanted today's Serious Sandwich to be truly terrifying. Something that was both scary good, but also just plain scary. I think this one fits the bill. I don't...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Halloween"], "recipeIngredient": ["1 can crescent rolls", "Flour, for dusting", "4 tablespoons spicy mustard", "10 ounces thinly sliced ham", "10 ounces thinly sliced salami", "10 ounces bologna", "12 ounces Monterey Jack, grated", "Liquid food coloring", "3 egg yolks", "2 whole cloves", "Toothpicks", "2 small pimiento-stuffed olives", "1 (1-inch) strips jarred roasted red peppers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. Line a cookie sheet with foil. Grease the foil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust a flat surface lightly with flour. Spread out the crescent dough&mdash; do not separate. Pinch together the seams so that you have 1 piece of dough. Roll out to make a large rectangle. Make sure the dough is not stuck to the surface at all.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the dough with the mustard, leaving a 1-inch border. Layer the meats down the center of the rectangle, leaving a 1-inch border on either end. You can feel free to use your favorite cold cuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the meats with the cheese. Fold 1 side of the dough over the filling, lengthwise. Then, fold the other 1/2 over and press the seal the filling inside. Take 1 egg yolk, and beat lightly with a fork. Brush the egg yolk over the top of the dough. The yolk will act as the glue to hold. Fold the dough in 1/2 again lengthwise. Pinch the seam with your fingers to seal. Press the outside of the dough to make sure everything is sealed tight and to make an even thickness for the body of your snake. Taper 1 end of the dough to form a tail shape. Form the other end into a head shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the 2 remaining egg yolks together. Transfer to 3 separate small bowls. Add some food coloring to each bowl - whatever colors you like! Using a clean paintbrush, \"paint\" the snake with the egg yolk/food coloring mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the snake to the foil lined sheet tray. Form into an \"s\" shape so it looks like the snake is slithering. Insert 2 cloves into the head to look like nostrils and 2 stuffed olives for eyes. Create a mouth or tongue with the roasted red peppers. Bake the snake for 25 minutes, or until golden brown and cooked through. </p>"}]}