{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["alcohol", "beer cocktails", "brandy", "cocktails", "drinks", "holiday cocktails", "holidays", "sherry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "A Tipple for More Intimate Holiday Gatherings: Lee Bros. Tannenbaum Tipple", "link": "https://www.seriouseats.com/recipes/2007/12/lee-brothers-tannenbaum-tipple-cocktail-recipe.html", "description": "Matt Lee and Ted Lee are Charleston denizens, but Matt developed the prototype of this punch for a black-tie holiday dinner at a Harvard eating club, so make of that what you will. It is possible that lower indigenous levels of gentility call for lower levels of alcohol.", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["3 small oranges", "20 whole cloves", "Two 750 ml bottles of amontillado (medium dry) sherry", "Six 12-ounce bottles of cold ale (preferably a hoppy American ale like Sam Adams Boston Ale or Charleston’s Palmetto Pale Ale)**", "1 quart gunpowder or other green tea, brewed strong and sweetened with 1/2 cup sugar, at room temperature", "1 cup brandy", "4 cinnamon sticks", "2 whole nutmegs", "1 heaping tablespoon ground ginger."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stud one orange with cloves by pressing the sharp ends into the peel. Slice the second orange into 8 thin disks. Zest the third, and squeeze the juice into a small bowl, then add the zest to the juice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sherry into the punch bowl, then add the ale (pouring slowly, to preserve the effervescence), tea, brandy, orange juice, and zest. Grate the cinnamon sticks over the brew until fatigue sets in, then toss in remaining sticks. Grate the nutmegs into the punch until your fingers are in danger. Add ginger; whisk to incorporate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Float the studded orange and the orange slices in the bowl. Feel free to experiment with the balance of spices to suit your taste. Allspice, mace, and juniper are possible spice additions. </p>"}]}