{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "cakes", "cranberries", "desserts", "Dorie Greenspan", "fall recipes", "holidays", "thanksgiving", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: All-in-One Holiday Cake", "link": "https://www.seriouseats.com/recipes/2007/11/baking-with-dorie-allinone-holiday-cake-recipe.html", "description": "Although I can't quite believe it, it's almost Thanksgiving, America's favorite and most food-centric holiday. I'm like everyone else, I love Thanksgiving&mdash;but it's not a holiday without its hassles. For me, the biggest problem, and the one I can never...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking With Dorie", "Cranberry", "Desserts", "Pumpkin"], "recipeIngredient": ["2 cups all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "2 teaspoons cinnamon", "1/4 teaspoon freshly grated nutmeg", "Pinch of salt", "1 1/2 teaspoons grated fresh ginger root (or 1 teaspoon ground ginger)", "1 1/4 sticks (10 tablespoons) unsalted butter, at room temperature", "1 cup sugar", "1/2 cup (packed) light brown sugar", "2 large eggs, at room temperature", "1 teaspoon pure vanilla extract", "1 1/4 cups canned unsweetened pumpkin puree", "1 large apple, peeled, cored and finely chopped", "1 cup fresh cranberries, halved or coarsely chopped", "1 cup pecans, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 350°F. Butter a 9- to 10-inch (about 12-cup) bundt pan. Do not place the pan on a baking sheet—you want the oven's heat to come up through the bundt's open core. Put the flour, baking powder, cinnamon, nutmeg and salt (and ground ginger, if you're using it) in a bowl and whisk to combine.Working with a mixer (and using a paddle attachment, if you have one), beat the butter and both sugars together at medium speed until light and fluffy. Add the eggs, one at a time, and beat for 1 minute after each addition; beat in the vanilla. Reduce the mixer speed to low and add the pumpkin, chopped apples and grated ginger—don't be concerned if the mixture looks curdled. Still on low speed, add the dry ingredients, mixing only until they are incorporated. Working with a rubber spatula, stir in the cranberries and pecans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the batter into the pan and smooth the top with the spatula. Slide the pan into the oven and bake 60 to 70 minutes, or until a knife inserted into the center of the cake comes out clean. Transfer the cake to a rack and cool for 10 minutes before unmolding. Cool to room temperature on the rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before bringing the cake to the table, dust it with confectioner's sugar. Because of the apples, cranberries and nuts, this cake doesn't lend itself to being cut into dainty slices—and it's just as well: You really want to get a mouthful of this bundt, the better to appreciate its many flavors. The cake needs no embellishments if you're serving it as an afternoon treat, but it is really nice with softly whipped cream or a scoop of ice cream. For brunch, toast the cake lightly and spread it with a little salted butter and/or a slick of pure maple syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Wrapped well, the cake will keep at room temperature for up to 5 days, at which point it will be perfect for toasting, or for up to 2 months in the freezer.</p>"}]}