{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071015applepie.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["apple pie", "books", "Cook the Book", "CTB: Apple Pie", "dessert", "John T. Edge", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cheese-Straw Apple Pie", "link": "https://www.seriouseats.com/recipes/2007/10/cook-the-book-cheesestraw-apple-pie-recipe.html", "description": "And so we've come to the final featured recipe from John T. Edge's Apple Pie: An American Story. This one gets its name because it's made with a dough similar to that used for those curiously addictive bread-basket inhabitants. The...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>For the crust:</strong>", "1 1/2 sticks unsalted butter, cut into small pieces ", "2 tablespoons cold vegetable shortening, cut into pieces ", "3 cups all-purpose flour", "1 teaspoon salt ", "1 or 2 teaspoon(s) cayenne pepper ", "2 1/3 cups shredded extra-sharp cheddar cheese ", "1/2 cup plus 2 tablespoons ice water ", "<strong>For the filling:</strong>", "5 large, tart apples ", "1/2 large lemon ", "1/2 cup dark brown sugar ", "1 tablespoon all-purpose flour", "1 teaspoon cinnamon ", "1 teaspoon vanilla ", "1/2 teaspoon salt ", "1/4 teaspoon freshly ground nutmeg ", "1 1/2 tablespoons butter, cut into six parts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Crust:</strong> Frigidity is all-important here. Place butter and shortening in freezer for at least an hour before mixing. Pulse flour, salt, and cayenne pepper in food processor. Remove the lid and tuck the butter and shortening into the mixture. Pulse the machine 4 times to cut in the butter. Add 1 1/3 cups of cheese and pulse 4 more times. Sprinkle half of the water over the flour mixture and pulse 5 or 6 times. Add the rest of the water and pulse 5 or 6 more times, until the pastry looks like very coarse crumbs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move mixture to a chilled bowl and work until dough is formed. Round into two balls, one slightly larger than the other. Wrap each dough ball in two layers of plastic wrap and press them into disks. Chill at least three hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Filling:</strong> Heat oven to 400&deg;F. Peel and slice apples. In a bowl, mix the apples, lemon juice, dark brown sugar, flour, cinnamon, vanilla, salt, and nutmeg with your hands. Set aside and retrieve the piecrusts from the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish:</strong> Roll the dough into two circles that are 2-3 inches wider in diameter than your pie shell or plate. Press the bottom crust into the pie plate and mound apples until they fill the crust and dome slightly. Scatter the butter over the mound. Cut a center vent the size of a dime into the top crust. Sprinkle the remaining cup of shredded cheese onto the crust. With a rolling pin, roll lightly to press the cheese into the dough. Roll the crust onto the rolling pin so that the rolling pin resembles the sausage in a pig-in-a-blanket. Unroll the crust, cheese-side down, on top of the apples. Bake at 400&deg;F for 10 minutes. Reduce the heat to 350&deg;F and bake for 40 to 50 minutes longer. Crimp the edges of the crusts. </p>"}]}