{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/books-donuts-an-american-passion.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "John T. Edge", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Farmers' Market Purse Donuts", "link": "https://www.seriouseats.com/recipes/2007/05/cook-the-book-farmers-market-p.html", "description": "The beauty of the following recipe, which comes from John T. Edge's Donuts, is that it can be tailored to the season. For the filling, use whatever berries or fruit happen to be at their peak at the time. Farmers'...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Doughnuts"], "recipeIngredient": ["1 package (2 1/4 teaspoons) active dry yeast", "1/2 cup warm water", "3 1/2 cup warm water", "3/4 cup sugar", "Scant teaspoon salt", "2 large eggs, separated (reserve the whites in the refrigerator for assembly)", "3 tablespoons unsalted butter, softened", "1/2 gallon peanut or vegetable oil for frying", "<strong>For the Filling</strong>", "2 tablespoons sugar", "1 cup water", "Juice of 1 lemon", "2 quarts hulled strawberries or other fresh berries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, dissolve the yeast in the warm water, stir to combine, and set aside for 5 minutes for the mixture to foam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine the flour, sugar, salt, and egg yolks, mixing well.  Pour the yeast mixture into the flour mixture and mix until a dough forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a work surface and dump the dough out.  Knead in 2 tablespoons of the butter and continue kneading until the dough is no longer sticky.  With the remaining tablespoon of butter, grease another large bowl, dump the dough in, and turn the dough to coat in the butter.  Cover with plastic wrap and place in the refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the morning, pull the dough our of the refrigerator, remove the wrap, and let it come to room temperature.  That should take 30 minutes or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the filling: In a small saucepan, make a simple syrup by combining the sugar with the water in a small saucepan over medium heat and heating to a simmer.  Stir until the sugar is incorporated and the mixture is somewhat viscous.  Add the lemon juice and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour a work surface and roll out the dough with a rolling pin to a thickness of about 1/8 inch.  Using a wide-mouth glass or a 2- or 3-inch pastry cutter, punch out 20 or so rounds.  Gather the scraps and reroll as necessary, cutting out about another 12 rounds, working to get an even number.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease two baking sheets with butter or shortening.  In a small bowl, beat the two egg whites.  Arrange rows of dough rounds on the trays.  Brush the edges of the rounds with egg white and top with a second round.  Press the two halves to seal along the periphery&mdash;do not mash them together.  Repeat again and again, setting the complete donuts aside to rise for about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a cast-iron Dutch oven or other deep, heavy-bottomed pot until it reaches a depth of 3 to 4 inches.  Heat the oil over medium-high heat to 360&deg;F.  Working in batches of 3 or 4, slide the donuts into the oil.  Cook, turning once, for about 2 minutes, or until golden on both sides.  Remove with a slotted spoon, drain on wire racks, an cool for 10 to 15 minutes.  With a sharp knife, slit the donuts open, working to free a pocket at the core.  Ladle in berries and syrup, stuffing until the donuts are just shy of overflowing.</p>"}]}