{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071105dolceitaliano.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "Italian", "keywords": ["baking", "cakes", "Cook the Book", "desserts", "Dolce Italiano", "Gina DePalma", "Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Venetian Apple Cake", "link": "https://www.seriouseats.com/recipes/2007/11/cook-the-book-venetian-apple-cake.html", "description": "And so we've come to the end of the line with this week's featured Cook the Book, Gina DePalma's Dolce Italiano: Desserts From the Babbo Kitchen. DePalma decided to call this Venetian Apple Cake because \"it contains spices, which came...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts", "Italian"], "recipeIngredient": ["1 1/2 cups unbleached all-purpose flour ", "1/2 cup instant or fine polenta ", "2 teaspoons baking powder ", "1 teaspoon kosher salt ", "1/2 teaspoon ground cinnamon ", "1/2 teaspoon ground ginger ", "1/4 teaspoon ground nutmeg ", "1 large Granny Smith or Golden Delicious apple", "8 tablespoons (1 stick/4 ounces) unsalted butter, softened ", "2 tablespoons extra-virgin olive oil ", "3/4 cup granulated sugar ", "1/2 cup honey ", "2 large eggs ", "1 1/2 teaspoons pure vanilla extract ", "1/4 cup whole milk "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F and position a rack in the center. Grease a 9-by-2-inch round cake pan with butter or nonstick cooking spray, dust it with flour, and tap to knock out the excess. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the flour, poleta, baking powder, salt, and spices together and set aside. Peel the apple and grate it, using the medium side of a box grater. Place the grated apple in a bowl, cover it with plastic wrap, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an electric mixer fitted with the paddle attachment, cream the butter, olive oil, and sugar together on medium speed until and fluffy, about 1 minute. Scrape down the sides of the bowl and beat in the honey until the mixture is smooth and creamy, about 1 minute. Beat in the eggs, one at a time, scraping down the sides of the bowl, followed by the vanilla extract. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On low speed, beat in half the dry ingredients, followed by all the milk. Scrape down the sides of the bowl and beat in the remaining dry ingredients. Switch the mixer to medium speed and beat for 30 seconds to emulsify the batter. Using a rubber spatula, gently fold in the grated apple. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan, smoothing the top with the spatula. Bake for 35 to 40 minutes, or until a cake tester inserted near the center of the cake comes out clean and the cake springs back when lightly touched. Allow the cake to cool in the pan on a wire rack for 10 minutes, then invert it onto the rack to cool completely. </p>"}]}