{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["Arthur Schwartz", "eggs", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch:  Eggs in Purgatory", "link": "https://www.seriouseats.com/recipes/2007/11/sunday-brunch-eggs-in-purgatory.html", "description": "I don't know about you, but I have just about had it with Thanksgiving leftovers at this point. So though you might have thought that I was going to give you a turkey hash with a fried egg on top...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["1 small onion, cut in half, then finely sliced or chopped", "2 tablespoons extra-virgin olive oil", "Pinch hot red pepper flakes", "2 cups tomato puree, canned crushed tomatoes, or chopped and drained canned tomatoes", "1/4 teaspoon dried marjoram", "Salt", "4 eggs", "Grated cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 9- or 10-inch skillet, combine the onion, the olive oil, and the hot pepper and cook over medium heat until the onion is lightly golden, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomato puree, dried marjoram, and a big pinch of salt to start.  Simmer for 5 to 6 minutes, until the sauce has concentrated a little.  You can set the pan aside now (at room temperature or  in the fridge) if you are not cooking the eggs or later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before cooking the eggs, bring the sauce back to a simmer, taste, and add more salt if necessary, then break the eggs into the bubbling sauce.  Cover and cook until the eggs are done to taste, meaning with fully set whites and runny yolks, or until the yolks are set further or completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with Parmigiano-Reggiano, a pecorino, or ricotta salata.</p>"}]}