{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Jenn Smith"}, "recipeCuisine": "", "keywords": ["soups", "thanksgiving", "Thanksgiving Easy Menu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Creamy Corn Soup with Bacon and Cheddar Crostini", "link": "https://www.seriouseats.com/recipes/2007/11/creamy-corn-soup-with-bacon-and-cheddar-crostini-recipe.html", "description": "Ed introduced the concept of an assisted Thanksgiving with yesterday's confession of a semi-homemade holiday, and I say, why stop with the big classics of stuffing, sweet potatoes and pie? Nancy Silverton's A Twist of the Wrist collects ideas that...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["8 1/2-inch-thick slices from a baguette or 2 slices from a large round rustic white loaf, cut in half) ", "Extra-virgin olive oil, for brushing the bread ", "4 strips thick-cut applewood smoked bacon ", "2 ounces aged white Cheddar, grated (about 1/2 cup) ", "20 fresh chives ", "2 1-quart boxes pureed corn soup ", "High-quality extra-virgin olive oil, for drizzling "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Rip each strip of bacon in four pieces  and place on a piece of toast, arranging them so the ends hang over the edges of the toast. Cover the toast with an uneven layer of the Cheddar cheese, allowing the edges of the toast to show through. Repeat for the remaining crostini. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Place the crostini on a clean baking sheet and bake them for 3 to 5 minutes, until the cheese melts. Remove the crostini from the oven and use scissors to snip about 1 teaspoon of chives over each. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Meanwhile, heat the soup in a large saucepan over medium heat, stirring occasionally to keep it from scorching, until it comes to a low boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Divide the soup evenly among four large soup plates or bowls, filling them to just below the rim. Place the crostini on top of the soup and drizzle high quality olive oil around the crostini. </p>"}]}