{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["stuffings", "thanksgiving", "Thanksgiving stuffings", "The Silver Palate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Silver Palate's Corn Bread-Sausage Stuffing With Apples", "link": "https://www.seriouseats.com/recipes/2007/11/the-silver-palates-corn-breadsausage-stuffing-recipe.html", "description": "Although Ed Levine is a self-proclaimed semi-homemadeoholic when it comes to preparing Thanksgiving dinner, he does have a few tried-and-true recipes that he can count on to make the meal less \"semi-homemade\" and just plain \"homemade.\" He admittedly uses Pepperidge...", "totalTime": null, "recipeYield": "enough stuffing for a 20-pound turkey, 12 to 14 portions", "recipeCategory": ["Bread", "Sides"], "recipeIngredient": ["12 tablespoons (1 1/2 sticks) unsalted butter ", "2 1/2 cups finely chopped yellow onions ", "3 tart apples (Jonathan and Winesap are good), cored and chunked; do not peel", "1 pound lightly seasoned bulk sausage (breakfast sausage with sage is best) ", "3 cups coarsely crumbled corn bread", "3 cups coarsely crumbled whole-wheat bread ", "3 cups coarsely crumbled white bread  (French or homemade preferred)", "2 teaspoons dried thyme ", "1 teaspoon dried sage ", "Salt and freshly ground black pepper, to taste ", "1/2 cup chopped fresh Italian (flat-leaf) parsley ", "1 1/2 cups shelled pecan halves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt half of the butter in a skillet over medium heat.  Add the chopped onions and cook, partially covered, until tender and lightly colored, about 25 minutes, Transfer the onions and butter to a large mixing bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the remaining butter in the same skillet. Add the apple chunks and cook over high heat until lightly colored but not mushy.  Transfer the apples and butter to the mixing bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble the sausage into the skillet and cook over medium heat,stirring, until lightly browned. With a slotted spoon, transfer the sausage to the mixing bowl and reserve the rendered fat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining ingredients to the ingredients in the mixing bowl and combine gently. Cool completely before stuffing the bird; refrigerate if not used promptly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you do not wish actually to stuff the bird (goose or duck. for example, can make the stuffing greasy), spoon it into a casserole. Cover the casserole and set into a large pan. Pour hot water around the casserole to come halfway up the sides, Bake for 30 to 45 minutes, basting occasionally with the cooking juices from the bird or with the reserved sausage fat if necessary.</p>"}]}