{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071224-msclassics.jpg", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["Asian", "Cook the Book", "Martha Stewart", "Martha Stewart New Classics", "noodles", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Rice Noodles with Chinese Broccoli and Shiitake Mushrooms", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-rice-noodles-with-chinese-broccoli-shiitake-mushrooms-recipe.html", "description": "Every time I come home on a college break, the first thing that always happens is either my Mom, Dad, or Grandma asks me if I’m hungry. Before I can give an answer or even if I say no, there’s...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["8 ounces wide (about 3/8 inche) or other rice noodles", "12 ounces Chinese broccoli (also called gai lan), cut into 2-inch pieces", "3 tablespoons low-sodium tamari soy sauce", "1 tablespoon plus 1 teaspoon Thai fish sauce (also called nam pla)", "1 tablespoon plus 1 teaspoon rice wine vinegar (not seasoned)", "1 teaspoon sugar", "3/4 cup homemade or low-sodium store-bought chicken stock", "1 tablespoon canola oil", "1 tablespoon minced peeled fresh ginger, or more to taste", "2 garlic cloves, minced", "8 shiitake mushrooms, stemmed, caps quartered", "2 teaspoons cornstarch mixed with 2 tablespoons cold water", "4 scallions, white and pale-green parts only, cut on the diagonal into 1-inch pieces ", "2 teaspoons toasted sesame oil", "Crushed red pepper flakes, for sprinkling (optional)", "Sesame seeds, for sprinkling (optional)", "Coarse salt, for spirnkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the noodles with very hot water in a large bowl, and let soak 30 minutes. Drain the noodles, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to  a boil. Add the broccoli; cook until crisp tender, about 1 minute. Drain; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the tamari, fish sauce, vinegar, sugar, and stock in a small bowl; set aside. Heat the canola oil in a large nonstick skillet or a wok over medium heat until but not smoking. Add the ginger, garlic, and mushroom caps; cook, stirring, until the mushrooms are soft, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tamari mixture to the skillet; bring to a simmer over high heat. Stir in the cornstarch mixture , and simmer 2 minutes. Add the reserved noodles and broccoli, along with the  scallions, and toss to coat. Drizzle with the sesame oil, and toss again. Serve with red pepper flakes, sesame seeds, and salt for sprinkling, if desired. </p>"}]}