{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "Italian", "keywords": ["Lidia Bastianich", "marinara sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Recipe: Lidia's Marinara Sauce", "link": "https://www.seriouseats.com/recipes/2007/03/lidias-marinara-sauce.html", "description": "Marinara Sauce - makes about 1 quart, enough to dress 6 servings of pasta - The difference between marinara sauce and tomato sauce is this: Marinara is a quick sauce, seasoned only with garlic, pepper, and, if you like, basil...", "totalTime": "", "recipeYield": "about 1 quart, enough to dress 6 servings of pasta", "recipeCategory": ["Condiments and Sauces", "Italian", "Tomato"], "recipeIngredient": ["1/4 cup extra virgin olive oil", "8 garlic cloves, peeled", "3 pounds ripe fresh plum tomatoes, peeled and seeded, or one 35 ounce can Italian plum tomatoes (preferably San Marzano), seeded and lightly crushed, with their liquid", "Salt", "Crushed red pepper", "10 fresh basil leaves, torn into small pieces</small>   "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 2- to 3-quart nonreactive saucepan over medium heat. Whack the garlic with the flat side of a knife, add it to the oil, and cook until lightly browned, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully slide tomatoes and their liquid into the oil. Bring to a boil, and season lightly with salt and crushed red pepper. Lower the heat so sauce is at a lively simmer, and cook, breaking up tomatoes with a whisk or spoon, until sauce is chunky and thick, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the basil about 5 minutes before sauce is finished. Taste sauce, and season with salt and red pepper if necessary.</p>"}]}