{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "desserts", "Dorie Greenspan", "fall recipes", "pies", "thanksgiving", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: Sour Cream Pumpkin Pie", "link": "https://www.seriouseats.com/recipes/2007/11/baking-with-dorie-sour-cream-pumpkin-pie.html", "description": "On Thursdays, Dorie Greenspan drops by with a delicious baking recipe for you to try. Preheat those ovens, people! &#8212;Ed. As every baker knows, Thanksgiving is really about the pie. The turkeys may get the covers of the all the...", "totalTime": null, "recipeYield": "6 to 8 servings", "recipeCategory": ["Baking With Dorie", "Desserts", "Pumpkin"], "recipeIngredient": ["1 9-inch single crust made with Good for Almost Everything Pie Dough (<a href=\"#piedough\">see recipe below</a>), partially baked and cooled, or one 9-inch tart shell made with <a href=\"http://www.seriouseats.com/recipes/2007/08/dorie-greenspan-recipe-an-easy-fruit-tart.html#doriegreenspansweettartcrust\">Dorie's tart shell</a>", "2 cups (canned) unsweetened pumpkin puree", "3 large eggs, at room temperature", "1 cup (packed) light brown sugar", "2 tablespoons unsalted butter, melted and cooled", "1 1/2 cups heavy cream", "1/3 cup sour cream", "1 1/2 teaspoons ground cinnamon", "1 1/2 teaspoons ground ginger", "Pinch of ground cloves", "Pinch of freshly grated nutmeg", "Pinch of salt", "3 tablespoons dark rum", "2 teaspoons pure vanilla extract", "Lightly sweetened lightly whipped cream, for topping", "1 1/2 cups all-purpose flour", "2 tablespoons sugar", "3/4 teaspoon salt", "1 1/4 sticks very cold (frozen is fine) unsalted butter, cut into tablespoon-size pieces", "2 1/2 tablespoons very cold (frozen is even better) vegetable shortening (non-trans fat), cut into 2 pieces", "About 1/4 cup ice water", "&nbsp", "<strong>Good for Almost Everything Pie Dough (makes one 9-inch single crust):</strong>", "1 1/2 cups all-purpose flour", "2 tablespoons sugar", "3/4 teaspoon salt", "1 1/4 sticks very cold (frozen is fine) unsalted butter, cut into tablespoon-size pieces", "2 1/2 tablespoons very cold (frozen is even better) vegetable shortening (non-trans fat), cut into 2 pieces", "About 1/4 cup ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong> Center a rack in the oven and preheat the oven to 450&deg;F. Line a baking sheet with parchment or a silicone baking mat and put the pie plate (or tart pan) on it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put all of the filling ingredients in a food processor and process for 2 minutes, stopping to scrape down the sides of the bowl once or twice. Alternatively, you can whisk the ingredients together vigorously in a mixing bowl. Rap either the work bowl or mixing bowl against the counter to burst any surface bubbles, and pour the filling into the crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10 minutes, then reduce the oven temperature to 300&deg;F and continue to bake for 35 to 45 minutes longer (20 to 25 minutes for a tart), or until a knife inserted close to the center comes out clean. (If you don't want to create a slash in your masterpiece, tap the pan gently&mdash;if the custard doesn't jiggle, or only jiggles a teensy bit in the very center, it's done.) Transfer the pie (or tart) to a rack and cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> Pumpkin pie and whipped cream are naturals and, if you've tested the pie's doneness with a knife, you might want to serve the whipped cream as a cover-up. I like this pie chilled, but others are fans of it at room temperature - decide for yourself.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Like most pies, this one is best served the day it is made. However, you can make the pie early in the day and keep it refrigerated until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pie crust dough:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, sugar and salt in a food processor fitted with a metal blade; pulse just to combine the ingredients. Drop in the butter and shortening and pulse only until the butter and shortening are cut into the flour. Don't overdo the mixing&mdash;what you're aiming for is to have pieces the size of fat green peas and others the size of barley. Pulsing the machine on and off, add 3 tablespoons of the water&mdash;add a little water and pulse once; add some more water and pulse again; and keep going that way. Then use a few long pulses to get the water into the flour. If after a dozen or so pulses, the dough doesn't look evenly moistened or form soft curds, pulse in as much of the remaining water, or even a few drops more, to get a dough that will stick together when pinched. If you've got big pieces of butter, that's fine. The dough is ready and should be scraped out of the work bowl and on to a smooth work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the dough into a disk and wrap it. Refrigerate the dough at least 1 hour before rolling. (If the ingredients were very cold and you worked very quickly, you might be able to roll the dough immediately&mdash;you'll know: the dough will be as cold as if it had just come out of the fridge.) The dough can be kept in the refrigerator for up to 5 days or frozen for up to 1 month.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough is fitted into the pie plate, refrigerate it again. If you don't have time for a longish chill, just keep the pie plate in the fridge while you preheat the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Partially Bake a Single Crust:</strong> Preheat the oven to 400&deg;F. Butter the shiny side of a piece of aluminum foil (or use nonstick foil), fit the foil, buttered side down, tightly against the crust and fill with dried beans or rice. Put the pie plate on a baking sheet and bake the crust for 25 minutes. Carefully remove the foil and weights and, if the crust has puffed, press it down with the side of a spoon (or lightly prick the crust). Return the pie to the oven and bake for about 8 minutes more, or until the crust is very lightly colored. Transfer the pie plate to a rack and cool to room temperature before filling.</p>"}]}