{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070731ctbsole.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "cookbooks", "CTB: Cucina del Sole", "eggs", "frittatas", "Italian", "omelets", "potatoes", "ricotta", "sausage", "southern Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Potato, Sausage, and Ricotta Omelet From Basilicata", "link": "https://www.seriouseats.com/recipes/2007/08/cook-the-book-potato-sausage-a-1.html", "description": "What I love about this omelet from Nancy Harmon Jenkins's Cucina del Sole is its versatility. It's substantial enough to serve as a light supper with a tossed salad or a plate of fresh tomatoes, fresh basil, and mozzarella drizzled...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 medium potato (about 1 pound), peeled, halved, and thinly sliced ", "2 tablespoons extra-virgin olive oil ", "2 ounces hot cured sausage, such as capocollo. coarsely chopped ", "6 eggs ", "Sea salt and freshly ground black pepper ", "Pinch of crumbled dried red chili (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the potato slices and olive oil in a skillet over medium heat. Cook, stirring frequently and breaking up the potato slices with the spatula rim, until the potatoes are very tender. Stir in the sausage and continue cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine the ricotta and eggs, adding salt, black pepper, and, if you wish, chili to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat down low under the skillet and pour the egg mixture over the potatoes in the pan, lifting the potatoes to let the egg batter run underneath. Cook, continually shaking the pan and running a palette knife or a narrow spatula around the edges of the frittata to keep the eggs from sticking. From time to time, lift some of the cooked egg off the bottom of the pan to let uncooked egg run beneath. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the frittata is thoroughly cooked on the bottom, set a platter upside down over the skillet and turn the skillet over so that the frittata drops onto the plate. Now slide the frittata back into the skillet and continue cooking for 30 seconds to 1 minute, or until the frittata is firm on the bottom. Turn the frittata out onto a serving platter and serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If turning the frittata and sliding it back into the skillet seems tricky, try simply running the skillet under a preheated broiler to brown the top very lightly. </p>"}]}