{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070820wells150.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["chicken", "chicken breasts", "Cook the Book", "cookbooks", "CTB: Vegetable Harvest", "mint", "Patricia Wells"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken Breasts with Mint, Capers, and White Wine", "link": "https://www.seriouseats.com/recipes/2007/08/cook-the-book-chicken-breasts.html", "description": "The week's earlier Cook the Book recipes have been soups or sides, which is to be expected, considering the book is called Vegetable Harvest. But how about something a little bit heftier for a main dish? This recipe for chicken...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["4 skinless, boneless chicken breast fillets (each about 4 ounces) ", "1/4 cup fresh mint leaves ", "2 tablespoons extra-virgin olive oil ", "Fine sea salt ", "1 cup dry white wine ", "2 tablespoons capers in vinegar, drained "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each chicken breast in half. Cover with plastic wrap and, with a meat mallet or a heavy-duty skillet, flatten the meat to about 1/4-inch thickness. In a shallow bowl, combine the chicken, mint, and 1 tablespoon of the olive oil. Cover and marinate for at least 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet over moderate heat, heat the remaining tablespoon of oil until hot but not smoking. Add the chicken and cook for about 2 minutes. Season with salt and turn, cooking the other side for about 2 minutes more. Season the second side and transfer to a warm serving platter. Cover with foil to keep warm. Slowly add the wine to the skillet, scraping up any bits of chicken that cling to the pan. Add the capers and boil uncovered, for 2 to 3 minutes or until the sauce is reduced and syrupy. Drizzle the sauce over the chicken.</p>"}]}