{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071220lewissalad.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "composed salads", "Dinner Tonight", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Potato, Chicken, Green Bean, Egg, and Avocado Salad in an Herb Mayonnaise", "link": "https://www.seriouseats.com/recipes/2007/12/dinner-tonight-potato-chicken-green-bean-egg.html", "description": "There was no hope for brevity in titling this recipe—a salad can be made a thousand ways, and rarely is one transcendent or ubiquitous enough to merit its own name. Cobb salad is one; salad Niçoise—the grandfather of composed salads—another....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains", "Salads"], "recipeIngredient": ["<strong>For the salad: </strong>", "2 handfuls green beans", "3/4 pound small red or tiny new potatoes", "1 avocado, peeled and sliced", "2 eggs", "1 cup leftover chicken (or 1/2 pound chicken breast, oiled and broiled in the oven for 3 to 4 minutes per side), shredded with a fork", "1 cup mixed greens (optional)", "<strong>For the mayonnaise</strong>", "1 egg yolk", "2 tablespoons lemon juice", "About one cup oil, half sunflower half olive", "Salt", "1/2 cup herbs, mostly parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a stockpot and saucepan (or other egg-boiling pot) full of salty water to a boil.  Add the potatoes, whole, and cook until nearing fork-tenderness.  Add the green beans and cook until just soft and the potatoes are also soft, but not mushy. Shock the green beans under cold water to arrest the cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, pierce the broad side of each egg with a pin to allow air to release, and lower them into boiling water very gently.  Cook 12 minutes for barely-hard yolks, 15 for fully hard-boiled.  If necessary, broil the chicken breast with a little salt and olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While everything is cooking, make the mayonnaise.  In a food processor or blender, add the yolk, lemon juice, salt, and 1/4 cup oil.  Turn it on and add the rest of the oil in a thin stream, and blend in the herbs.  Alternatively, whisk the non-oil ingredients (including herbs) with a couple tablespoons of sunflower oil to create a good emulsion, then add the rest of the oil very slowly, whisking briskly, until the oil is incorporated and the texture is right.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and slice the egg in half, then those into thirds.  Cut the potatoes into reasonable chunks.  Both the egg and potato should have just a hint of warmth.  Put everything on top of the mixed greens, if using, into a large, shallow bowl or dish, pour the mayonnaise over, and toss gently.  Finish with lots of black pepper.</p>"}]}