{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Cook the Book", "cookbooks", "Mark Bittman", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Stir-Fried Tofu with Bell Peppers or Other Vegetables", "link": "https://www.seriouseats.com/recipes/2007/11/mark-bittman-stir-fried-tofu-with-bell-peppers-recipe.html", "description": "And so we're at the end of the line with our featured recipes from Mark Bittman's How to Cook Everything Vegetarian. This one I picked as much for myself as for you. When I want a simple, meatless stir-fry, I'm...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chinese", "Cook the Book", "Mains", "Tofu", "Vegetarian"], "recipeIngredient": ["1 1/2 to 2 pounds firm to extra-firm tofu, <a href=\"#preparingtofu\">prepared by either of these methods</a> or simply blotted dry", "3 tablespoons peanut oil or neutral oil, like grapeseed or corn ", "1 large onion, halved and sliced ", "1 each green, yellow, and red bell pepper, or any combination, cored, seeded, and sliced", "1 tablespoon chopped peeled fresh ginger", "1/4 cup Shaoxing wine, sherry, sake, white wine, or water", "1/3 cup vegetable stock or water", "2 tablespoons soy sauce", "1/2 cup roughly chopped scallion"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the tofu into 1/2-inch or slightly larger cubes.  Put two tablespoons of the oil in a large skillet or wok, preferably nonstick, over high heat. When hot, add the onion and cook, stirring occasionally, until it begins to soften, a couple of minutes. Add the peppers and continue to cook, stirring occasionally, until both onions and peppers are crisp-tender and a little charred at the edges, about 5 minutes. Remove with a slotted spoon and set aside for a moment. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining oil, then the garlic and ginger, and cook, stirring, for about 10 seconds. Add the tofu and cook, stirring occasionally, until it begins to brown, a couple of minutes. Add the wine and stock and cook, stirring, until about half of it evaporates; return the pepper-onion mix to the pan and cook, stirring, for a minute or so to reheat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the soy sauce and scallion and cook, stirring, until the scallion becomes glossy, about 30 seconds, Serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Stir-Fried Tofu with Peas, Snow Peas, or Snap Peas: </strong>Use these singly or in combination: In Step 1, the onion is optional. In place of the peppers, add 2 cups peas (frozen are fine, but they should be defrosted first if at all possible) and cook until bright green and just beginning to brown; snow peas and snap peas should not soften too much. Remove and proceed with the recipe. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Stir-Fried Tofu with Shiitake Mushrooms: </strong>You can use any mushrooms, of course, but shiitakes (including dried ones) seem to have been made for this: In Step 1, use the onion; you can also use 1 bell pepper if you like. After scooping both out of the pan, cook 2 cups sliced shiitake mushroom caps (stems are good for stock only) in a tablespoon of oil over high heat, stirring, until browned and almost crisp. Remove them with a slotted spoon, then add a tablespoon of oil and proceed with the recipe. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"preparingtofu\"></a><h4>Preparing Tofu</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To freeze, drain the tofu and pay it dry; wrap it in plastic (or put in a container) and freeze for several hours, or until you need it, up to three months.  For extra chew, cut the tofu into cubes, dry them well, and freeze them in a freezer bag.  Allow enough time to defrost tofu before slicing and cooking.</p>"}]}