{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071210baconcookbook.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "flammekueche", "James Villas", "tarte flambée", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Alsatian Bacon and Onion Tart (Tarte Flambée)", "link": "https://www.seriouseats.com/recipes/2007/12/alsatian-bacon-and-onion-tart-tarte-flambee-recipe.html", "description": "You might also know this Alsatian Bacon and Onion Tart as tarte flambée or flammekueche. James Villas—author of this week's Cook the Book, The Bacon Cookbook—recommends trying to find fresh pot cheese in a specialty grocer, but if you can't,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "Cook the Book", "Mains"], "recipeIngredient": ["<strong>For the pastry: </strong>", "1 3/4 cups all-purpose flour ", "8 tablespoons (1 stick) chilled butter, cut into pieces", "1 teaspoon salt ", "2 tablespoons ice water ", "<strong>For the filling: </strong>", "6 to 8 slices <em>ventrèche</em> or Black Forest bacon ", "1/2 cup half-and-half ", "1 tablespoon all-purpose flour", "1 teaspoon salt ", "2 tablespoons vegetable oil", "1 large onion, thinly sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pastry, sift the flour onto a work surface, place the butter in the center, and rub with your fingertips until tiny particles form. Make a well in the mixture, add the salt and water, and mix quickly with fingertips until dough is smooth. Form dough into a ball, wrap in plastic wrap, and chill about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F. Butter a heavy baking sheet; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, fry the bacon in a large skillet over moderate heat until almost crisp; drain on paper towels and chop coarsely. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the dough to form a thin rectangle about 7 by 10 inches; place on the prepared baking sheet and form a slight border by pinching the edges upward. In a bowl, combine the cheese, half-and-half, flour, salt, and oil. Mix until well blended, and spoon the mixture evenly over the bottom fo the pastry shell. Distribute the onion slices over the top, sprinkle on the bacon, and bake for 15 to 20 minutes, or until the pastry is golden brown. Cut the tart into rectangles to serve.</p>"}]}