{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Jenn Smith"}, "recipeCuisine": "", "keywords": ["dressings", "stuffings", "Thanksgiving Classic Menu", "Thanksgiving stuffings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Corn Bread Dressing with Pecans and Bacon", "link": "https://www.seriouseats.com/recipes/2007/10/serious-thanksgiving-corn-bread-dressing-with.html", "description": "Jean Anderson's A Love Affair With Southern Cooking is equal parts recipe collection, autobiography, and anecdotal history of the people and places that have influenced the food of the South. Taken as a whole it is the lovely, chatty product...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Sides"], "recipeIngredient": ["12 cups (3 quarts) 3/4- to 1-inch chunks stale, corn bread ", "6 slices stale, dry, firm-textured white bread, cut into 1/2-inch cubes ", "2 cups coarsely chopped toasted pecans", "1/2 cup coarsely chopped parsley", "1 pound hickory-smoked bacon, each slice cut crosswise into strips 1/2 inch wide", "1 cup (2 sticks) butter, melted, or 1 cup bacon drippings or vegetable oil", "2 very large yellow onions, coarsely chopped", "4 large celery ribs, trimmed and coarsely chopped (include a few leaves)", "1 tablespoon rubbed sage", "1/2 teaspoons dried leaf thyme, crumbled ", "6 cups chicken broth or stock", "3 extra-large eggs, well beaten ", "1 teaspoon salt", "1/2 teaspoon black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>It's important to make the corn bread a day two before you use it. Split it horizontally, spread it on a baking sheet, and let stand at room temperature, turning the pieces several times as they dry. Also set the slices of white bread out to dry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To toast the pecans, spread on a jelly-roll pan or rimmed baking sheet, then set on middle shelf of a 350 &dg; f. oven for 10 to 12 minutes, stirring well at half-time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Spritz a 13-by-9-by-2-inch baking pan with nonstick cooking spray and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the two breads, pecans, and parsley in a very large mixing bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brown the bacon in a very large, heavy skillet over moderate heat, stirring often, for 12 to 14 minutes until all the drippings render out. Drain the bacon on paper toweling and if you intend to use the drippings in the dressing, pour them into a measuring cup. You should have about 1 cup; if not, round out the measure with melted butter or vegetable oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/2 cup of the melted butter or bacon drippings in the same skillet for about 1 minute over moderately high heat. Add the onions and celery and cook, stirring often, for 10 to 12 minutes until lightly browned. Add the dried sage and thyme, and cook and stir for 1 to 2 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the skillet mixture into the mixing bowl along with the reserved bacon and remaining melted butter or bacon drippings; toss well. Add 3 cups of the chicken broth, the eggs, salt, and pepper, and toss well again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dressing to the baking pan, spreading to the edges, then drizzle the remaining 3 cups chicken broth evenly an top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover snugly with heavy-duty foil and bake on the middle oven shelf for 25 minutes. Stir the dressing well, cover again with foil, and bake 20 minutes more or until steaming. Serve hot with roast turkey, chicken, or pork and top with lots of gravy.</p>"}]}