{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["gazpacho", "soups", "Sunday Night Soups", "The Gurgling Cod", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: Greenmarket Last Gazp Gazpacho", "link": "https://www.seriouseats.com/recipes/2007/09/sunday-night-soups-greenmarket-last-gazp-gazp.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week’s Sunday Night Football game on NBC. The Giants and the Eagles get together Sunday night, and one thing is sure. When...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Vegetarian"], "recipeIngredient": ["3 biggish tomatoes, cored and diced (Use heirlooms if you are feeling fancy, but if you do, strive for color contrast)", "2 small or one big cucumber, intermittently peeled for tiger-stripe effect, and diced", "2 red, yellow, or orange bell peppers, diced (Again, contrast is good to have here)", "1/2 Vidalia onion, or other sweet onion, finely diced", "2 cloves garlic, minced (Put the press back in the drawer, Mr. Speedy)", "Salt, to taste", "4 to 6 cups tomato juice (It is worth at least springing for the kind that comes in glass)", "1/4 cup sherry vinegar (Do not be tempted to substitute. If you want to fool with cider vinegar and Liquid Smoke, you are on your own)", "Tabasco to taste (Again, here, accept no substitute. Also, if your personal Tabasco has turned gray, start over.)", "Lots of ground black pepper to taste (If you do not own a decent peppermill, get one. They can be had for not much money, and there is no single kitchen item that can do more to create the illusion of civility.)", "Fancy olive oil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the diced vegetables. This is a casual late-summer soup, so no need to get out the calipers to check your dice. As far as the size goes, consider what makes sense for a spoon, and that the softer vegetables will lose a bit of mass. Resist the temptation to chuck the lot in a blender, unless you want slurry. Salt vegetables, and let sit for a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomato juice, vinegar, hot sauce, and some pepper. Cover and refrigerate. Check seasoning before serving, and garnish with a splash of fancy olive oil, if desired.</p>"}]}