{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["pork", "pork loin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Recipe: Grilled Boneless Pork Loin with Tangerine-Rosemary Glaze", "link": "https://www.seriouseats.com/recipes/2007/07/recipe-grilled-boneless-pork-l.html", "description": "Sometimes we all need a dish we can cook and get on the table in 20 minutes, max. When I'm in that \"20 minutes from start to finish\" frame of mind I often cook slices of boneless pork loin. I...", "totalTime": "", "recipeYield": "Serves 8", "recipeCategory": ["Mains", "Pork"], "recipeIngredient": ["<em>For the glaze:</em>", "1/4 cup sugar", "1/2 cup white vinegar", "1 cup fresh tangerine juice (you may substitute fresh orange juice)", "1 tablespoon fresh rosemary", "1 tablespoon lime juice (about 1/2 lime)", "Salt and freshly cracked black pepper to taste", "2 tablespoons unsalted butter", "8 four-ounce boneless pork loin fillets", "Salt and freshly cracked black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan over medium heat, boil the sugar and vinegar together for five minutes.  Add the juice and simmer until reduced by a third to a half.  At this point the mixture should coat the back of a wooden spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the mixture from the heat, add the rosemary, lime juice, and salt and pepper to taste.  Mix well, then add the butter and stir gently until it is melted and well incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the fillets with salt and pepper to taste and place them on the grill over medium-high heat for three to four minutes per side.  The surface of the meat should be slightly brown and crispy, and the interior should have a hint of pinkness, depending on your preference.  (Check the interior by nicking one of the fillets slightly with a knife.  If you like yours cooked completely through, leave it on an additional 2 minutes per side.)  Spoon the glaze generously over the fillets before serving. </p>"}]}