{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Asian Flavors of Jean-Georges", "chicken", "Cook the Book", "Jean-Georges Vongerichten", "roasting"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Roast Chicken with Chunky Miso Sauce and Grapefruit", "link": "https://www.seriouseats.com/recipes/2007/11/cook-the-book-roast-chicken-with-chunky-miso-recipe.html", "description": "As promised, here is the first recipe from Jean-Georges Vongerichten's Asian Flavors of Jean-Georges. He calls his roast chicken with chunky miso sauce and grapefruit recipe, whih combines cr&egrave;me fra&icirc;che, miso, yuzu juice, grapefruit and Thai chile, \"the quintessential Vong...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["1/4 cup plus 1 tablespoon extra virgin olive oil ", "One 3-pound chicken, cut into pieces ", "Salt and freshly ground white pepper ", "1 cup crème fraîche or sour cream ", "1 tablespoon chunky miso, or use any miso ", "1 tablespoon <a href=\"http://en.wikipedia.org/wiki/Yuzu\">yuzu</a> or lime juice ", "1 grapefruit, peeled and segmented between membranes, with juices reserved, and chopped into 1/2-inch cubes ", "1 fresh red Thai chile, seeded and minced ", "1 bunch frisée, leaves separated, washed, and dried ", "1 tablespoon fresh lemon juice "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the oil in a large ovenproof skillet over medium-high heat. Sprinkle the chicken pieces with salt and white pepper and add to the skillet, skin side down. Cook until they are very brown on one side, about 10 minutes, then turn the chicken and transfer to the oven and cook until cooked through, about 10 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the creme fra&icirc;che and miso in a saucepan over low heat. Whisk mixture together and warm gently; do not allow the mixture to boil. When bubbles begin forming around the edges, remove from the heat and whisk in the yuzu juice; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, toss the grapefruit and its reserved juices with the chile and 2 tablespoons of the oil. In a separate bowl, toss the fris&eacute;e with the lemon juice and remaining I tablespoon oil and season with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the miso sauce into the bottom of four serving bowls. Center the chicken pieces on the sauce, then spoon the solids from the grapefruit mixture on top. Garnish with the fris&eacute;e, drizzle on the remaining grape, fruit juice, and serve. </p>"}]}