{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/supernaturalcooking.jpg", "author": {"@type": "Person", "name": "Alaina Browne"}, "recipeCuisine": "", "keywords": ["Cook the Book", "CTB: Super Natural Foods", "Heidi Swanson", "recipes", "Serious Recipes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Giant Crusty and Creamy White Beans with Greens", "link": "https://www.seriouseats.com/recipes/2007/04/giant-crusty-and-creamy-white-beans-recipe.html", "description": "In early 2003, Heidi Swanson, an enthusiastic cookbook consumer, made a resolution: \"When you own over 100 cookbooks, it is time to stop buying, and start cooking.\" From that resolution sprang a food blog—one of the earliest, in fact—called 101cookbooks...", "totalTime": "", "recipeYield": "6 to 8 as a side dish", "recipeCategory": ["Cook the Book", "Healthy and Delicious", "Sides", "Vegetarian"], "recipeIngredient": ["1/2 pound medium or large dried white beans, cooked (see page 204)", "3 tablespoons clarified butter or olive oil", "Fine-grain sea salt", "1 onion, coarsely chopped", "4 cloves garlic, chopped", "6 or 7 big leaves chard, preferably rainbow chard, leaves cut into wide ribbons and 1 or 2 stems cut into 1/2-inch pieces", "Freshly ground black pepper", "Extra-virgin olive oil, for drizzling", "Freshly grated Parmesan cheese, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans, then heat the butter over medium-high heat in the widest skillet you’ve got. Add beans to the hot pan in a single layer. If you don’t have a big-enough skillet, just do the sauté step in two batches or save the extra beans for another use. Stir to coat the beans with butter, then let them sit long enough to brown on one side, about 3 or 4 minutes, before turning to brown the other side, also about 3 or 4 minutes. The beans should be golden and a bit crunchy on the outside and soft and creamy on the inside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Salt to taste, add the onion and garlic, and cook for 1 or 2 minutes, until the onion softens. Stir in the chard, and cook until just beginning to wilt. Remove from heat, and season to taste with a generous dose of salt and pepper. Drizzle with a bit of top-quality extra-virgin olive oil, and sprinkle with freshly grated Parmesan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em><strong>Note:</strong> For a twist on bruschetta, serve the beans over grilled slices of rustic bread rubbed with a clove of garlic and a fragrant extra-virgin olive oil. For a cold-weather option, omit the onions and garlic and instead stir in deeply caramelized onions when you add the chard. </em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><em>Photograph courtesy of <a href=\"http://www.101cookbooks.com\">Heidi Swanson</a></em></small></p>"}]}