{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070917puredessert.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "books", "candy", "caramels", "Cook the Book", "cookbooks", "CTB: Pure Dessert", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Golden Vanilla Bean Caramels", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-golden-vanilla-bean-caramels.html", "description": "OK, folks, break out your candy thermometers, 'cause you're going to need 'em for this one. These caramels, which come from Pure Dessert by Alice Medrich use whole ground vanilla beans and golden syrup, which makes them extra delicious. If...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["1 cup golden syrup ", "2 cups sugar ", "3/8 teaspoon fine sea salt ", "2 cups heavy cream ", "1 1/2 teaspoons pure ground vanilla beans, purchased or ground in a coffee or spice grinders, or 1 tablespoon plus 1 teaspoon pure vanilla extract ", "3 tablespoons unsalted butter, cut into chunks, softened ", "<h5>Equipment</h5>", "A 9-inch square baking pan ", "Candy thermometer "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom and sides of the baking pan with aluminum foil and grease the foil. Combine the golden syrup, sugar, and salt in a heavy 3-quart saucepan and cook over medium heat, stirring with a silicone spatula or wooden spoon, until the mixture begins to simmer around the edges. Wash the sugar and syrup from the sides of the pan with a pastry brush dipped in water. Coverer and cook for about 3 minutes. (Meanwhile, rinse the spatula or spoon before using it again later.) Uncover the pan and wash down the sides once more. Attach the candy thermometer to the pan, without letting it touch the bottom of the pan, and cook, uncovered (without stirring) until the mixture reaches 305&deg;F. Meanwhile, combine the cream and ground vanilla beans (not the extract) in a small saucepan and heal until tiny bubbles form around the edges of the pan. Turn off the heat and cover the pan to keep the cream hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sugar mixture reaches 305&deg;F, turn off the heat and stir in the butter chunks. Gradually stir in the hot cream; it will bubble up and steam dramatically, so be careful. Turn the burner back on and adjust it so that the mixture boils energetically but not violently. Stir until any thickened syrup at the bottom of the pan is dissolved and the mixture is smooth. Continue to cook, stirring occasionally, to about 245&deg;F. Then cook, stirring constantly, to 260&deg;f for soft, chewy caramels or 265&deg;F; for firmer chewy caramels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the heat and stir in the vanilla extract, if using it. Pour the caramel into the lined pan. Let set for 4 to 5 hours, or overnight until firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift the pan liner from the pan and invert the sheet of caramel onto a sheet of parchment paper. Peel off the liner. Cut the caramels with an oiled knife, Wrap each caramel individually in wax paper or cellophane. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Variations</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fleur de Sel Caramels:</strong> Extra salt, in the form of fleur de seI or another coarse flaked salt, brings out the flavor of the caramel and offers a little ying to the yang. Add an extra scant 1/4 teaspoon of coarse sea salt to the recipe. Or, to keep the salt crunchy, let the caramel cool and firm. Then sprinkle with two pinches of flaky salt and press it in. Invert, remove the pan liner, sprinkle with more salt. Then cut and wrap the caramels in wax paper or cellophane. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Nutmeg and Vanilla Bean Caramels:</strong> Add 1/2 teaspoon freshly grated nutmeg to the cream before you heat it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cardamom Caramels:</strong> Omit the vanilla. Add 1/2 teaspoon slightly crushed cardamom seeds (from about 15 cardamom pods) to the cream before heating it. Strain the cream when you add it to the caramel; discard the seeds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Caramel Sauce:</strong> Stop cooking any caramel recipe or variation when it reaches 225&deg;F or, for a sauce that thickens like hot fudge over ice cream, 228&deg;F. Pour it into a sauceboat to serve or into a heatproof jar for storage. The sauce can be stored in the refrigerator for ages and reheated gently in the microwave or a saucepan just until hot and flowing before use. You can stir in rum or brandy to taste. If the sauce is too thick or stiff to serve over ice cream, it can always be thinned with a little water or cream. Or, if you like a sauce that thickens more over ice cream, simmer it for a few minutes longer. </p>"}]}