{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/doriegreenspan-cobbler.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "cobblers", "desserts", "Dorie Greenspan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: A Cobbler to Coo Over", "link": "https://www.seriouseats.com/recipes/2007/08/baking-with-dorie-a-cobbler-to.html", "description": "You know how cooks are always cooing about how easy summer is? \"I just put some stuff on the grill, toss a salad and it's dinner,\" they'll say. Well, we bakers can coo, too. Try this: \"I just toss some...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking With Dorie", "Desserts"], "recipeIngredient": ["<strong>For the crust:</strong>", "2 cups all-purpose flour", "1 tablespoon double-acting baking powder", "3 tablespoons sugar", "1/2 teaspoon salt", "3/4 stick (6 tablespoons; 3 ounces) cold unsalted butter, cut into bits", "3/4 cup cold heavy cream", "<strong>For the fruit filling:</strong>", "4 peaches, peeled, pitted and cut into small cubes", "2 cups blueberries", "3 to 5 tablespoons sugar (taste and decide how much you want)", "1 tablespoon cornstarch", "Grated zest of 1 lemon", "6 leaves lemon verbena, finely shredded (optional)", "6 leaves lemon balm, finely shredded (optional)", "1 tablespoon heavy cream, to brush the crust (optional)", "Decorating sugar or raw sugar, to dust the crust (optional)", "Vanilla ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong> Center a rack in the oven and preheat the oven to 375 degrees F. Butter a 9-inch deep-dish pie plate and put it on a baking sheet lined with foil, parchment paper or a silicone baking mat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the crust:</strong> Whisk the flour, baking powder, sugar and salt together in a big bowl. Drop in the butter and, with your fingers, toss everything together to coat the butter with flour. Working quickly, rub the butter into the dry ingredients until you have a pebbly mixture. You'll have pieces the size of peas and others the size of oatmeal flakes and that's just right.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cream over the mixture, grab a fork and gently turn the ingredients until you have a very soft dough. You'll probably have some dry ingredients in the bottom of the bowl, so reach in and mix and knead the dough with your hands until it's all blended. This is the show-restraint point&mdash;don't overdo it. If you've got a few dry spots, it's OK.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a piece of wax paper or plastic wrap, cover with another sheet of paper or wrap and gently press or roll the dough into a circle with a diameter of about 9 inches. Don't worry about being exact or about getting even edges – this is a homey dessert and any roughness will only add to its charms. Refrigerate the dough while you put together the fruit. (You can keep the dough in the refrigerator for up to 6 hours or you can wrap it airtight and freeze it for up to 2 months – you don't need to defrost it before baking.)<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the fruit filling:</strong> Put all the ingredients in the buttered pie plate and stir to combine. (I always toss with my hands.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the top sheet of paper or plastic from the crust and, using a small sharp knife, cut about 6 slits in the dough, just as you would for a pie, then cut a circle out of the center. (I always use a large piping tip to cut the circular steam vent.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the dough over the fruit. If the circle of dough is a little too big, you can trim it; if it's a little small, don't worry&mdash;it will look nice when the fruit bubbles over it.</p>\r\n\r\n<p>If you're using it, brush the cream over the dough and sprinkle over the decorating or raw sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cobbler for 60 to 70 minutes, or until the crust is puffed and golden brown and the fruit is bubbling all around the crust and up through the center vent. (If you think the crust is getting too brown, but the cobbler isn't ready, you can put a loose foil tent over the pan. But don't forget&mdash;you want the crust to be a deep golden color.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cobbler to a rack and let it cool for at least half an hour before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the cobbler warm or at room temperature, with ice cream.</p>"}]}