{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/ctb-asianflavorsjeangeorges.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Asian Flavors of Jean-Georges", "Cook the Book", "Jean-Georges Vongerichten"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Ginger Fried Rice", "link": "https://www.seriouseats.com/recipes/2007/11/cook-the-book-garlic-fried-rice.html", "description": "Few things say \"warm carb-laden deliciousness\" quite like a bowl of fluffy, freshly cooked rice. But what happens when the rice ages, dries up and hardens into a cold shell of its former self? Well, with a bit of help...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1/2 cup rendered chicken fat or neutral oil ", "2 tablespoons minced garlic ", "2 tablespoons minced fresh ginger ", "Salt ", "2 cups thinly sliced leeks, white and pale green parts only ", "4 cups day-old cooked rice, preferably jasmine, at room temperature ", "2 teaspoons sesame oil ", "4 teaspoons soy sauce ", "1 tablespoon grape seed, corn, or other neutral oil ", "4 large eggs "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt half the fat in a large skillet over medium heat.  Add the minced garlic and ginger and season lightly with salt. Cook, stirring occasionally, until crisp and browned. Drain on paper towels and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt the remaining fat in a large deep skillet over medium-low heat, then add the leeks. Cook, stirring occasionally, until softened, about 10 minutes. They should be very tender, but not browned. Season to taste with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice and cook, stirring welt, until heated through. Season to taste with salt, then remove from the heat, Put a quarter of the rice into a smalt bowl and gently press down into the bowl. Invert the bowl onto a serving plate. The rice will unmold in a small dome. Drizzle 1/2 teaspoon of the sesame oil and 1 teaspoon of the soy sauce around the mound of rice. Repeat with the remaining rice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the grape seed oil in a nonstick skillet and fry the eggs, sunny-side up, until the edges are set, but the yolk is still runny. Put the eggs on top of the mounds of rice. Top each mound of rice and egg with some of the garlic-ginger crisps and serve immediately. </p>"}]}