{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["Nancy Silverton", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Raised Doughnuts, Twists, and Holes", "link": "https://www.seriouseats.com/recipes/2007/06/cook-the-book-raised-doughnuts.html", "description": "If you were upset with my inclusion of apple fritters in this series of Nancy Silverton doughnut recipes, then I'll return to \"true\" doughnut form with this recipe, which makes raised doughnuts, twists, or holes. Raised Doughnuts: Twists and Holes...", "totalTime": "", "recipeYield": "18 doughnuts and holes", "recipeCategory": ["Desserts", "Doughnuts"], "recipeIngredient": ["2 teaspoons (0.6 ounce) packed fresh yeast or 2 1/4 teaspoons active dry yeast", "3/4 cup whole milk", "3 cups plus 2 tablespoons unbleached pastry flour or unbleached all-purpose flour", "6 extra-large egg yolks", "1/2 cup granulated sugar", "3/4 teaspoon kosher salt", "1 stick (4 ounces) unsalted butter", "1 vanilla bean", "1 tablespoon pure vanilla extract", "<strong>For White Glaze</strong>", "1/2 cup plus 2 tablespoons powdered sugar, sifted", "1/4 cup heavy cream", "1/2 teaspoon pure vanilla extract", "1/8 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the yeast in the bowl of an electric mixer.  In a small saucepan over medium heat, heat the milk until warm to the touch.  Pour the milk over the yeast to soften 1 to 2 minutes.  Stir to combine.  Add 2 3/4 cups of the flour to the milk mixture, without stirring.  Cover the bowl tightly with plastic wrap and set aside in a warm place until the surface of the flour cracks, about 30 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, whisk together the egg yolks, sugar, and salt.  Whisk in 1/4 cup of the flour and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In a small saucepan, over medium heat, melt the butter.  Using a small paring knife, split the vanilla bean lengthwise.  With the back of the knife, scrape out the pulp at the seeds and add the scrapings from the vanilla bean and the pod to the butter.  Swirl the pan to ensure the butter cooks evenly and doesn't burn.  it will bubble somewhat vigorously as it browns.  Continue cooking 3 to 5 more minutes, until the bubbles subside and the liquid is dark brown with a nutty, toasty aroma.  Remove the vanilla bean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the butter and dark flecks over the egg mixture, whisking to combine.  Stir in the vanilla extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the browned butter mixture to the yeast mixture.  Using the paddle attachment, mix on low for about 1 minute.  Add the remaining 2 tablespoons of flour and mix to combine.  Turn the mixer up to medium-high for 1 more minute.  The dough will be very sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the bowl onto a floured work surface and gather it into a ball.  Clean the mixing bowl and lightly coat it with vegetable oil.  Place the dough in the oiled bowl, cover, and allow to rise for 1 1/2 to 2 hours, until doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured surface, tuck under the edges to deflate and return the dough back to the oiled bowl.  Cover the bowl and allow the dough to rise until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured surface and gently roll or pat the dough into a rectangle about 1/2 inch thick, flouring the surface of the dough as necessary.  Dip the cutter in flour and, cutting as closely together as possible, cut out the doughnuts and holes.  Place them on a floured surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form a twist, flour your hands and pick up one end of the dougnuts with your thumb on top and forefinger on the bottom.  Using the other hand, pick up the other end of the doughnut, reversing the finger placement.  Turn each side away from the other, in opposite directions, stretching slightly to form a doughnut with 2 twists.  (When you fry the twists they will untwist once.)  Place on a floured surface to rest for 15 minutes before frying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather the scraps of dough together, gently roll or pat into 1/2-inch thickness and cut out the remaining doughnuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a high-sided skillet or wide pot with 2 inches of oil, and heat the oil to 375&degF. Fry doughnuts in batches, turning once, until they are golden and crisp, about 3 minutes. Drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While still warm, dip the top half of the doughnut into the White Glaze, moving side to side as you life the doughnut out of the glaze to evenly coat it.  Dip the holes in the glaze to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> To Make Glaze: </strong>In a small stainless steel bowl set over a pot of gently simmering water, combine the powdered sugar, cream, vanilla extract, and salt. Heat until just warm, stirring frequently. The glaze should be thin and translucent; if necessary, thin it down with more cream.</p>"}]}