{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071029htcev-thumb.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cookbooks", "fall recipes", "Mark Bittman", "tomatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pan-Fried Pumpkin With Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2007/10/cook-the-book-panfried-pumpkin-with-tomato-sa.html", "description": "When we paged through Mark Bittman's How to Cook Everything Vegetarian earlier in the week, we knew we had to save this recipe for today. If you selected a pumpkin with eating in mind rather than carving, you should be...", "totalTime": "", "recipeYield": "4 to 6 servings", "recipeCategory": ["Cook the Book", "Pumpkin", "Vegetarian"], "recipeIngredient": ["1/4 cup neutral oil, like grapeseed or corn, plus more if needed", "2 pounds pumpkin, peeled, seeded, and cut into large chunks", "Salt and freshly ground black pepper", "1 large onion, chopped", "2 tablespoons minced garlic", "2 tablespoons minced fresh chile, or to taste, or hot red pepper flakes or cayenne to taste", "1/2 red wine, any vegetable stock, or water", "Chopped parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the pumpkin is cooked, pour off all but 2 or 3 tablespoons of the oil and add the onion, garlic, and chile.  Cook, stirring frequently, until softened, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the wine, scraping up any browned bits from the bottom of the pan. Let the liquid boil off for a few minutes and thicken, then stir in the tomato and its juice.  Bring the sauce to a boil, then lower the heat a bit so it bubbles along nicely. Cook, stirring occasionally, until it thickens, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pumpkin to the pot and let the mixture come back to a boil. Cover and turn the heat to low.  Cook, stirring once or twice, until the sauce has thickened even more and the pumpkin is tender but not mushy, about 10 minutes. Taste and adjust the seasoning, garnish, and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Panfried Pumpkin with Tomato Sauce, Cocoa, and Pumpkin Seeds:</strong> Sort of like a quick mole: Omit the parsley garnish. Follow the recipe all the way through Step 3. While the pumpkin is cooking, toast 1 cup pumpkin seeds, tossing until golden. Chop a small bunch of cilantro. When the pumpkin is ready, stir in the pumpkin seeds along with 1/4 cup unsweetened cocoa powder and 1 teaspoon ground cinnamon. Garnish with cilantro and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Panfried Pumpkin with Cranberries and Pistachios:</strong> Festive all through the fall: Instead of the tomatoes, combine 3 cups cranberries with 2 cups freshly squeezed orange juice. Omit the parsley garnish. Follow the recipe through Step 3, adding the cranberries and juice in place of the tomato. Proceed with the recipe and garnish with 1/2 cup chopped pistachios instead of the parsley. </p>"}]}