{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/lamaisonduchocolat.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "cakes", "chocolate", "desserts", "Dorie Greenspan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: Grandmother's Creamy Chocolate Cake From Robert Linxe", "link": "https://www.seriouseats.com/recipes/2007/10/baking-with-dorie-grandmothers-creamy-chocola.html", "description": "Bonjour from Paris, where the Salon du Chocolat just finished its run. This year's salon, the French edition of what Americans know as the Chocolate Show (which will open in New York City on November 9), was held at the...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Baking With Dorie", "Desserts"], "recipeIngredient": ["2 sticks (8 ounces) unsalted butter, cut into 16 pieces", "8 ounces bittersweet chocolate, finely chopped", "3/4 cup sugar", "4 large eggs, at room temperature", "1/4 cup all-purpose flour", "Whipped cream, cr&egrave;me fra&icirc;che or vanilla ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 300 degrees F. Butter an 8-inch square pan and line it with aluminum foil. Have a larger pan that can hold the cake pan and water at the ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter in a heavy medium saucepan, then add the chocolate and the sugar. Place the pan over medium-low heat and, stirring almost constantly, heat until the ingredients are melted and well blended. Remove the pan from the heat and let it rest on the counter for 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One by one, stir the eggs into the chocolate mixture with a whisk. Sift the flour over the mixture and stir it in as well. Rap the saucepan on the counter to deflate any bubbles and pour the batter into the prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the cake pan into the larger pan, fill the larger pan with enough hot water to come halfway up the sides of the cake pan, and slip the setup into the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 35 to 40 minutes, or until the cake is set on top and a knife inserted into the center of the cake comes out streaky but not wet. Lift the cake pan out of the water bath and place it on a rack to cool to room temperature. Chill the cake for at least 1 hour before unmolding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cake is cold, gently turn it over onto a serving platter, lift off the pan and carefully remove the cake. The cake is meant to be served upside, with its smoother side facing the world.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> The cake can be served cold or at room temperature with a scoop of whipped cream, cr&egrave;me fra&icirc;che or ice cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Wrapped tightly, the cake will keep for about 3 days at room temperature or for up to 2 months in the freezer.</p>"}]}