{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071217-msclassicsoriginal.jpg", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "Martha Stewart", "Martha Stewart Original Classics", "pasta", "short ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Short Ribs Ragu with Pappardelle", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-short-ribs-ragu-with-pappardelle-recipe.html", "description": "The Holiday Countdown is upon us and with only one weekend of shopping left, no one wants to spend the day battling the hoards of frenzied shoppers over that last Wii to then go home and cook a big dinner....", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Cook the Book", "Mains"], "recipeIngredient": ["2 tablespoons canola oil", "3 1/2 to 4 pounds short ribs, each about 2 inches long, cut flanken style (across the bone)", "1 tablespoon kosher salt, plus more for pasta water", "1 teaspoon freshly ground black pepper ", "1 dried bay leaf", "1 sprig fresh rosemary ", "5 sprigs fresh thyme", "2 sprigs fresh flat-leaf parsley", "4 small carrots, cut into 1/4-inch pieces", "2 celery stalks, strings removed, cut into 1/4-inch pieces", "1 medium onion, cut into 1/4-inch pieces", "2 medium shallots, cut into 1/4-inch pieces ", "2 teaspoons all-purpose flour", "2 teaspoons tomato paste", "1/2 cup ruby port", "2 cups red wine, such as Cabernet ", "1/2 head of garlic", "3 1/2 cups Veal Stock, Beef Stock, or frozen, thawed", "1 pound pappardelle or other long, flat pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 275°F. Place a 5-quart ovenproof casserole or Dutch oven over medium heat. Add the oil, and heat until it is very hot but not yet smoking. Sprinkle the short ribs generously with salt and pepper. Working in batches if necessary to keep the short ribs from touching at all during this crucial browning step, add the short ribs to the hot oil (they should sizzle the moment they hit the pan). Cook the ribs until well browned, 10 to 15 minutes. Reduce heat to medium low if necessary to keep the ribs from overbrowning; do not rush this step. Remove the ribs from the casserole, and transfer to a large bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, tie the bay leaf, rosemary, thyme, and parsley in a small piece of cheesecloth to make a bouquet garni. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the carrots, celery, onion, and shallots to the oil in the casserole, and cook over medium heat,stirring occasionally, until the vegetables are soft and golden, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour and tomato paste to the casserole, and stir to combine. Add the ruby port; stir with a wooden spoon until all the browned bits have been scraped from the pan and the bottom of casserole is clean. Add the red wine; simmer until the liquid is reduced by a third, about 10 minutes. Add the qarlic, veal stock, and the reserved bouquet garni.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the browned ribs to the casserole. Bring the liquid to a simmer over medium-high heat. Cover the casserole, and place it in the oven. Cook until the ribs are very tender, about 3 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove cooked ribs from casserole. Set casserole on top of the stove over medium heat, and simmer to thicken the sauce just slightly. As soon as short ribs are cool enough to handle, remove the meat from the bones, and shred into small pieces. (If you like, you can leave the meat on the bone for serving, too.) Discard any fat not rendered during cooking; discard the bouquet garni. Return shredded meat to casserole; simmer to reduce sauce by about half, until sauce is of desired consistency, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fill a large pot with salted water. Set over high heat, and bring to a boil. Add the pasta. cook until the pasta is al dente, following the package instructions. Drain the pasta, and serve hot with the short-rib ragu. </p>"}]}