{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20071101bakedapples.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["apples", "baking", "desserts", "Dorie Greenspan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: Fruit-Nut-and-Honey Baked Apples", "link": "https://www.seriouseats.com/recipes/2007/11/baking-with-dorie-fruitnutandhoney-baked-appl.html", "description": "Baked apples, or <em>pommes au four,</em> as they're known here in Paris, are less a recipe than a construction. While I do nothing more than core the apples and stuff the centers with dried fruits and nuts, honey, and butter, I've had meringue-topped baked apples and apples topped with streusel.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Apple", "Baking With Dorie", "Desserts", "Healthy and Delicious"], "recipeIngredient": ["4 apples, such as Gala, Rome Beauties, or Cortlands (or your favorite apple)", "Slice of lemon", "1/2 cup assorted coarsely chopped dried fruit, such as raisins, figs, prunes, dates, apricots or cherries (this time I used 1 Medjool date, 2 prunes and 2 tablespoons raisins; there are no rules, so you can use as many fruits as you want or stick to just ", "2 tablespoons nuts, coarsely chopped (I used walnuts)", "1 1/2 tablespoons honey", "Pinch fleur de sel (optional)", "Pinch cinnamon (optional)", "4 tablespoons unsalted butter", "2/3 cup apple cider (or water)", "Plain or vanilla yogurt, heavy cream, cr&egrave;me fra&icirc;che or vanilla ice cream, for topping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong> Center a rack in the oven and preheat to 350&deg;F. Have an ovenproof baking dish at hand. You want a dish that can hold the apples comfortably but snugly&mdash;a 9- or 10-inch deep-dish Pyrex pie pan works well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Core the apples, making sure not to cut through the bottoms, and peel the apples down to the halfway mark; don’t toss away the peels. Now do what I didn't do: Make a very shallow cut around the apples at the point where the peel begins. Rub the cut parts of the apples with lemon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in a small bowl, mix together the dried fruits, nuts and honey; add the salt and cinnamon, if you’re using them. Cut 8 teaspoons of butter and put a teaspoon-chunk inside each apple. Divide the fruit-and-nut mixture among the apples then top with another teaspoon-chunk of butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the apples in the pan, pour in the cider (or water), cut the remaining butter into bits and scatter the bits over the cider, then toss in the peels (if they’re very long, just cut them into manageable strips).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the pan into the oven and bake the apples, basting them every 15 minutes, for 50 to 75 minutes, or until the apples are tender. (I can’t give you a more precise estimate of the time because it will depend on the size and type of your apples&mdash;so check early and often.) Don’t go for al dente&mdash;the apples should be spoon tender.</p>"}]}