{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dorie-ricottaberrymuffins.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "desserts", "muffins", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Ricotta-Berry Muffins", "link": "https://www.seriouseats.com/recipes/2007/10/baking-with-dorie-ricottaberry-muffins.html", "description": "Muffins could be the poster child for a joy-of-baking campaign: Everyone loves them and everyone can make them. The basics of muffin-making are simple: Have your oven preheated and your muffin pans prepped before you make the batter&mdash;once the batter’s...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking With Dorie", "Breakfast and Brunch"], "recipeIngredient": ["3/4 cup ricotta, preferably at room temperature", "2 large eggs, preferably at room temperature", "1/2 teaspoon pure vanilla extract", "1 stick (4 ounces) unsalted butter, melted and cooled", "2/3 cup sugar", "Finely grated zest of 1 lime", "2 cups all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon baking soda", "1/2 teaspoon salt", "1 to 1 1/3 cups blueberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong> Center a rack in the oven and preheat the oven to 400 degrees F. Butter or spray the 12 molds in a regular-size muffin tin, or fit the molds with paper muffin cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the ricotta, eggs and vanilla together, then stir in the melted butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in a large bowl and using your fingertips, rub the sugar and lime zest together until the sugar is moist and fragrant. Switch to a whisk and stir in the flour, baking powder, baking soda and salt. Put the ricotta mixture on top of the dry ingredients and, using a rubber spatula, gently but quickly stir to blend&mdash;don’t worry about being thorough. The batter will be thick and heavy and that’s fine. Stir in the blueberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly among the muffin molds, slide the pan into the oven and bake 20 to 25 minutes. When fully baked, the tops of the muffins will be golden, springy to the touch and a knife inserted into the center of the muffins will come out clean. Pull the pan from the oven and carefully lift each muffin out of its mold and onto a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> These are best eaten the day they are made, but you can wrap them airtight and pop them into the freezer, where they’ll keep for about two months; re-warm in a 300&deg;F oven or split them and toast.</p>"}]}