{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-youngmanandthesea.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["beets", "books", "Cook the Book", "cookshelf", "CTB: The Young Man and the Sea", "Dave Pasternack", "Ed Levine", "flounder", "seafood", "snap peas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Flounder with Beets and Sugar Snap Peas", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-flounder-with-be.html", "description": "Working with Dave Pasternack on The Young Man and the Sea taught me how good seemingly plebian flounder can be if it's fresh and prepared well. This recipe for pan-fried Flounder with Beets and Sugar Snap Peas will have you...", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Fish", "Legumes", "Mains"], "recipeIngredient": ["1 pound beets, scrubbed and dried", "1/2 cup extra virgin olive oil, plus more for drizzling", "Sea salt", "Freshly ground black pepper", "1/4 cup mint leaves", "1 cup high-quality store-bought breadcrumbs", "1 cup Wondra", "3 large eggs", "Four 5-ounce flounder fillets", "1 pound sugar snap peas", "1/4 cup canola oil", "3 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Place each beet on a square of aluminum foil. Drizzle with olive oil, roll the beet to lightly coat, and season with a sprinkling of salt and pepper. Wrap loosely in the foil. Place the packets on a baking sheet and then in the oven. Roast until the beets are easily pierced with the point of a knife, about 1 hour. Remove from the oven and let cool. When cool enough to handle, peel and cut into 1/2-inch dice. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop half the mint leaves. In a shallow bowl, combine them with the breadcrumbs. In another shallow bowl, season the Wondra with 1 teaspoon each salt and pepper. In a third bowl, lightly beat the eggs. Dredge each flounder fillet in the seasoned flour, then dip in the beaten egg, and then in the breadcrumbs. Set aside on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan, heat the 1/2 cup olive oil. Add the sugar snap peas, and sauté until tender, about 5 minutes. Add the diced beets and the reserved unchopped mint, and continue cooking for 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another large, preferably nonstick, sauté pan, heat the canola oil until hot but not smoking. Add the butter. When the foam subsides, add the fillets; you should hear them sizzle. Cook until golden brown, about 3 to 4 minutes per side. Transfer the cooked fillets to a paper-towel-lined platter, and season immediately with salt and pepper. Serve with the sugar snap peas and beets alongside.</p>"}]}