{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070712ctb-thumb.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "CTB: The Young Man and the Sea", "Dave Pasternack", "Ed Levine", "pancetta", "radicchio", "recipes", "seafood", "Serious Recipes", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fettuccine with Rock Shrimp, Corn, &amp; Jalapeno", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-fettuccine-with.html", "description": "Rock shrimp are delicious, forgiving, and so easy to cook with. Peppers and corn are the essence of summer eating, and when you combine them with rock shrimp and fettuccine you end up with the perfect, hassle-free summer dinner. Fettuccine...", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Mains", "Pasta", "Shrimp"], "recipeIngredient": ["1 pound dried fettuccine ", "3 tablespoons plus 1/4 cup extra-virgin olive oil, plus high-quality extra-virgin olive oil, for drizzling ", "1 medium jalapeño, stemmed and seeded, sliced in rounds ", "1 pound rock shrimp, peeled and deveined ", "Sea salt ", "Freshly ground black pepper ", "6 ears corn, kernels removed from cob ", "2 cups arugula, rinsed and spun-dry, chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add the fettuccine and cook 1 minute less than the box instructs for al dente. Drain the pasta in a colander, reserving about 1/4 cup of the cooking water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pasta is cooking, heat the 3 tablespoons olive oil over a medium flame in a deep, straight-sided saute pan. Add the jalapeño and cook until softened, about 2 minutes. Season the rock shrimp with salt and pepper, then add to the pan. Sear the shrimp on all sides for 6 to 8 minutes total. Add the corn, stir well to combine, and cook for about 1 minute more. Season with 1/2 teaspoon sea salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the flame to medium and add the arugula. Stir to combine. Add the pasta and the reserved pasta water. Use tongs to combine the ingredients, and continue cooking for about 1 minute more. Season with additional salt and pepper. Use the tongs to transfer the pasta to four serving bowls, and drizzle some high-quality extra-virgin olive oil over each bowl before serving. </p>"}]}