{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070920coconutz.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "coconut", "coconut domes", "congolais", "desserts", "Super Bowl desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: Coconut Domes", "link": "https://www.seriouseats.com/recipes/2007/09/baking-with-dorie-coconut-domes-rochers-congolais-recipe.html", "description": "Whenever someone tells me they're afraid to tackle French pastry or that they certainly don't have the courage to attempt replicating anything from a famous pastry chef, I give them this recipe for coconut domes. The cookies have only four...", "totalTime": null, "recipeYield": "about 24 cookies", "recipeCategory": ["Baking With Dorie", "Coconut", "Desserts"], "recipeIngredient": ["1/3 cup plus 2 tablespoons whole milk", "1 1/2 cups plus 1 tablespoon (5 1/4 ounces) unsweetened finely grated dried coconut (available in specialty and healthfood stores)", "1/3 cup plus 2 tablespoons sugar", "2 large eggs, at room temperature and lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The day before:</strong>  Warm the milk in a microwave oven or over direct heat until it is 85 degrees F as measured on an instant-read thermometer.  (This isn't very hot at all, so you may overshoot the mark and have to let the milk cool.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the coconut and sugar together in a mixing bowl.  Stir in the warm milk and then the lightly beaten room-temperature eggs; continue to stir until all the ingredients are blended.  Press a piece of plastic wrap against the dough to seal it airtight, and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To bake:</strong>  Line a baking sheet with parchment paper or a silicone baking mat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a level tablespoon of dough for each cookie, shape the dough into balls between your palms, and place the cookies, 1 inch apart, on the lined sheet.  When all the dough is shaped, place the baking sheet in the freezer while you preheat the oven.  (The cookies can be made ahead to this point; when they are frozen, remove them from the sheet and pack airtight for long-term storage.  Properly packed, the cookies can be frozen for up to 2 months; they should not be defrosted before baking.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 475 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the baking sheet from the freezer, slide another baking sheet under it (or transfer the cookies and parchment to an insulated baking sheet), and bake the cookies for 7 to 11 minutes.  The outside of the cookies should be just set and the tops should take on some color.  The centers of the domes should remain soft, moist and chewy.  Transfer the cookies to a rack and let them cool before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Depending on the absorbency of your coconut, you may find that during baking the domes seep a little liquid.  Once the cookies have cooled, you can cut this extra little skirt of dough away with a pair of scissors.  However, if you always buy the same coconut and always have the same problem, use a little less milk in the dough.</p>"}]}