{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070517babyback-thumb.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cookbooks", "CTB: Happy in the Kitchen", "Happy in the Kitchen", "meat", "Michel Richard", "pork", "recipes", "rib", "ribs", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Thyme-Glazed Baby Back Ribs", "link": "https://www.seriouseats.com/recipes/2007/05/michel-richard-thyme-glazed-baby-back-ribs-recipe.html", "description": "We've done french fries, chicken salad, and braised carrots so far from Michel Richard's Happy in the Kitchen. Today, I thought we'd offer something a little more meaty. And since these thyme-glazed baby back ribs looked so good, I thought...", "totalTime": null, "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Mains", "Pork"], "recipeIngredient": ["2 racks baby back ribs (about 2 pounds each)", "1/3 cup fine sea salt, plus additional for sprinkling ", "1 large leek ", "5 star anise ", "2 teaspoons chile flakes ", "2 teaspoons black peppercorns ", "8 thyme sprigs, plus 2 teaspoons thyme leaves ", "2 cups 1-inch chunks onion (about 1/2 large) ", "2 cups 1-inch chunks carrots (about 4 large)", "1 1/2 cups honey ", "1 cup red wine vinegar", "Cayenne pepper ", "Freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each rack of ribs crosswise into 2 pieces, and place in a large stockpot. Add enough cold water to just cover, about 4 quarts. Add the salt; bring to a boil over medium-high heat. As the water heats, skim off any foam that rises, and place it in a bowl. Once no more foam comes to the surface, strain contents of bowl through a fine-mesh strainer back into pot; discard scum remaining in strainer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cut off the green portions of the leek (discard or reserve for another use) and the root end. Split the leek lengthwise; rinse under warm water to remove any dirt, and set aside. Place the star anise, chile flakes, peppercorns, and 4 of the thyme sprigs on a square of cheesecloth; tie into a bundle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once there is no more foam in the stockpot, add spice bundle, leek, onions, carrots, 1 cup of the honey, and the vinegar to pot. Partially cover pot, and reduce heat to keep the liquid at just under a simmer; there should be only very light bubbling at edges of pot. Cook 45 minutes or until the meat is tender but not yet falling from bones. Remove pot from heat; cool ribs completely in the liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. Line a baking sheet with a Silpat baking mat or parchment paper. Remove meat from cooking liquid; drain on paper towels, discarding liquid. Scrape away and discard any silverskin remaining on underside of ribs. Dry ribs completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the remaining 1/2 cup honey in the microwave or on the stove until liquefied. Add cayenne pepper to taste. Brush both sides of ribs with half the honey; sprinkle with the thyme leaves, salt, and black pepper. Place ribs meaty side up on prepared baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake ribs about 30 minutes or until the tops are lightly caramelized and shiny. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve a half rack per person or cut into individual ribs. Place ribs on a platter, brush with the remaining honey, and garnish with remaining thyme sprigs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><em>Photograph courtesy Artisan Books</em></small></p>"}]}