{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["fall recipes", "soups", "Sunday Night Soups", "The Gurgling Cod"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: Small-C Chunky Posole", "link": "https://www.seriouseats.com/recipes/2007/11/sunday-night-soups-small-c-chunky-posole-recipe.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week's Sunday Night Football game on NBC. Suddenly, it's week eight and time for the Cowboys to visit the Eagles. Not all...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["1 large onion, chopped", "6 to 8 cloves garlic, minced", "2 teaspoons olive oil", "3/4 teaspoon chili powder", "1 teaspoon oregano", "1 bay leaf", "1 to 2 teaspoons cumin", "1/4 cup chopped fresh cilantro (optional)", "Sour cream (optional)", "Lime wedges", "Corn tortillas", "Roasted squash or pumpkin seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are using the whole thighs, skin and bone them, setting aside skin and bones separately. There are two optional refinements you can do at this stage:</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover thighbones with water in small casserole. Add bay leaf, and whole head of garlic, cut through equator. Simmer gently, skimming any foam with a slotted spoon&mdash;add water to cover as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut skin and fat into postage stamp sized pieces. Add to small saucepan with 1 to 2 cups of water. Simmer gently until fat is rendered and skin is crisp. If you have extra chicken fat, it helps to add for the trying out of the skin. Salt to taste, and save chicken fat for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In separate 5 quart saucepan, combine hominy, broth and spices.  When meat is done, combine with hominy mixture and spices and simmer all together for an hour or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with lime wedges, cilantro and warm tortillas. If you made the crisp chicken skin, use as a garnish. Alternatively, roasted squash or pumpkin seeds add a nice crunch. Sour cream in this soup is a divisive issue, but considering it invented itself, you might as well have it to hand.  Serves 4-6, doubles, and stores well, so make a bunch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"note\"></a>* Yes, real posole does involve the head of a pig bobbing in a bunch of broth. <a href=\"http://en.wikipedia.org/wiki/Diana_Kennedy\">Diana Kennedy</a> has a good recipe. I made it once, and folks seem to enjoy the chicken one pretty well, and do not recoil in horror so much.</p>"}]}