{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070713albacore-thumb.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "CTB: The Young Man and the Sea", "Dave Pasternack", "Ed Levine", "pancetta", "radicchio", "recipes", "seafood", "Serious Recipes", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Albacore Crudo with Caperberries", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-albacore-crudo-w.html", "description": "Dave Pasternack is probably best known for introducing crudo, Italian-style raw fish, to American palates. Think of it as sashimi with an Italian soul. I have eaten this Albacore Tuna Crudo at Dave's restaurant, Esca, hundreds of times and never...", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Healthy and Delicious", "Shrimp"], "recipeIngredient": ["3 lemons, halved", "1 pound albacore fillet", "Fine sea salt", "Freshly ground black pepper", "High-quality extra-virgin olive oil, for drizzling", "16 Sicilian caperberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a small puddle of lemon juice&mdash;about 1 tablespoon each&mdash;in the center of six serving plates then drizzle the lemon juice around the sides of the plates.  The lemon juice is put under the fish so that it will not discolor it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each fillet into four strips from nose to tail, first in half along where the spine would be, then the belly and top halves.  Cut away the tip ends so that the strips are fairly rectangular, and of equal thickness.  Then cut each rectangle into crudo slices about 2 inches wide and 1/4-inch thick.  Cut the strips on the bias using a very sharp straight blade.  Move your fingers back, slice by slice, making a clean, sure cut.  There should be at least 16 slices, though the size and shape of the fillets may allow for more or less.  Arrange the slices on the serving plates atop the puddle of lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle a few crunchy grains of sea salt on each slice of fish.  Follow with a light grinding of black pepper on each piece and then a light drizzle of high-quality olive oil over the top.  Add 4 caperberries to each plate and serve immediately.</p>"}]}