{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cookbooks", "CTB: Happy in the Kitchen", "french fries", "Happy in the Kitchen", "Michel Richard", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Very French Fries", "link": "https://www.seriouseats.com/recipes/2007/05/michel-richards-very-french-fries-recipe.html", "description": "As promised, here's the first recipe from Michel Richard's Happy in the Kitchen. This being National Hamburger Month, I couldn't resist adapting the recipe for french fries. Find it (and a bit of french fry trivia) after the jump. And...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "French Fries", "Sides", "Vegetarian"], "recipeIngredient": ["1 large (about 12 ounces) baking potato per person, peeled", "Peanut or canola oil, for deep-frying", "Fleur de sel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with ice water. Trim each potato into a 3- to 4-inch-long smooth-sided block, then cut lengthwise into 1/2-inch slices. Cut each slice lengthwise into 1/2-inch-wide strips. Trim the fries 3 to 4 inches long by 1/2 inch square. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As you work, drop the potatoes into the ice water. Leave the potatoes in the ice water for at least a few mintues to rinse off the starch; they can be refrigerated in the water for up to a day. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a handful of potatoes in the fryer basket and carefully lower into the oil; do not crowd the potatoes. If the oil bubles excessively, lift up the basket for a few seconds, then return the potatoes to the oil. Repeat if necessary; the bubbles should calm down. Cook for 4 to 5 minutes or until the potatoes are cooked through but just lightly colored. Drain on paper towels; repeat with remaining potatoes. The potatoes can be fried a few hours ahead and kept at room temperature until the second frying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the second frying, reheat the oil if necessary to 325&deg;F. Lower the fries into the oil a batch at a time as before, and fry 4 to 5 minutes or until crisp and evenly browned. Drain on paper towels, sprinkle with fleur de sel, serve hot.</p>"}]}