{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dorie-swedishapplecake.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["apples", "baking", "cakes", "desserts", "Dorie Greenspan", "Swedish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: Ann Brettingen’s Swedish Apple Cake", "link": "https://www.seriouseats.com/recipes/2007/11/baking-with-dorie-annes-swedish-apple-cake.html", "description": "My friend Sally, she of the garden elves, showed up for a pancake breakfast this weekend bearing gifts: rosemary and bay plants transplanted from my garden into house-size pots and a recipe for her friend Ann Brettingen’s Swedish Apple Cake....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Apple", "Baking With Dorie", "Desserts"], "recipeIngredient": ["3/4 cup all-purpose flour", "1 teaspoon baking powder", "Pinch of salt (optional)", "1 extra-large egg or 1 large egg plus 1 large egg yolk", "3/4 cup sugar", "1/2 teaspoon pure vanilla extract (optional)", "1 stick (4 ounces) unsalted butter, melted and cooled", "1 to 1 1/2 apples (I used Fujis), peeled, cored and cut into 1/2-inch thick wedges", "Apple, quince or ginger jelly or preserves, for glazing the cake (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 350&deg;F. (Ann says 345&deg;F, but my oven doesn’t do that.) Generously butter a 9-inch deep-dish pie plate or a similar sized cast-iron skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the flour, baking powder and salt, if you’re using it, and keep at hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in a mixing bowl with the whisk, beat the egg(s) and sugar together until thick and pale. Stir in the vanilla, if you’re using it, and then the melted butter. The mixture will be smooth and shiny. Stir in the dry ingredients and scrape the batter into the prepared pan. Top with the apples, making a spiral pattern. Leave some space between each slice, so the batter can puff up between the wedges – it looks much nicer with the puffs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the pan into the oven and bake for about 40 minutes, or until a knife inserted into the cake comes out clean. Transfer the cake to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want to glaze the cake, warm a few spoonfuls of jelly and a splash of water in a microwave oven (or a saucepan) until the jelly liquefies. Brush the jelly over the hot cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cake cool for at least 15 minutes, or wait until it reaches room temperature, before you cut it into wedges to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Cooled and covered, the cake will keep overnight at room temperature, but it’s best served shortly after it’s baked.</p>"}]}