{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071105dolceitaliano.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["baking", "Cook the Book", "desserts", "Dolce Italiano", "Gina DePalma", "Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sicilian Pistachio Bars", "link": "https://www.seriouseats.com/recipes/2007/11/babbo-sicilian-pistachio-bars-dessert-recipe.html", "description": "Gina DePalma's Sicilian Pistachio Bars are another easy-to-make Italian dessert that she recommended we feature this week. It's one simple dough pressed in a pan and then baked with pistachios on top. Of course, the half cup of ground pistachios...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 cups unbleached all-purpose flour ", "1/2 teaspoon kosher salt ", "1 cup shelled, whole, unsalted pistachios, Sicilian if available ", "1 cup (2 sticks/8 ounces) unsalted butler, softened ", "1 1/4 cups plus 2 teaspoons granulated sugar ", "2 large eggs ", "1 teaspoon pure vanilla extract ", "1 teaspoon amaretto or 1/2 teaspoon pure almond extract ", "Freshly grated zest of 1 lemon "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F. Lightly grease a 13-by-18-inch jelly-roll pan and line it with parchment; then lightly grease the paper, using nonstick cooking spray or butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the flour and salt and set aside. Place 1/2 cup pistachios in the bowl of a food processor and process for 20 to 30 seconds, until the nuts are finely ground. Stir the ground pistachios into the flour mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an electric mixer fitted with the paddle attachment, cream the butter with the 1 1/4 cups sugar until very light and Huffy, about 2 minutes. Beat in the eggs, one at a time, followed by the vanilla extract, amaretto, and lemon zest, scraping down the sides of the bowl after each addition. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On low speed, mix in the dry ingredients to make a soft dough. Use an offset spatula to spread the dough evenly in the pan, smoothing the surface as much as possible. Coarsely chop the remaining 1/2 cup pistachios in the food processor and sprinkle them evenly over the surface of the dough. Sprinkle the remaining 2 teaspoons sugar evenly over the nuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 35 to 45 minutes, or until rhe dough is firm and just turning golden brown at the edges, rotating the pan 180 degrees halfway through the baking time to ensure even browning. Allow the pan to cool on a wire rack for 30 to 45 minutes before cutting the cookies into rectangular bars, about 1 1/2 inches long and 1/2 inch wide. The cookies can be stored in an airtight container, layered between sheets of parchment paper, and kept in a cool, dry place for up to 3 days.</p>"}]}