{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["ham", "soups", "Sunday Night Soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: The Minimalist's Prosciutto Soup (Gurgling Cod Country Honk Version)", "link": "https://www.seriouseats.com/recipes/2007/12/sunday-night-soups-the-minimalists-prosciutto.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week's Sunday Night Football game on NBC. This week, the Patriots cede the Sunday Night spotlight to the 4-7 Bengals, who visit...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Ham"], "recipeIngredient": ["3 tablespoons extra virgin olive oil (It is really worth it to use a good fruity one here—I prefer Frantoia)", "1/4 pound country ham, in one chunk or slice", "6 cloves garlic, peeled and mashed", "1 medium onion, peeled and chopped", "1/2 pound greens, preferably kale (You could use mustard or turnip greens if you wanted to chase a cold, or even collards, if you wanted to make it even countrier)", "Parmesan rind, diced (optional)", "Chives (optional)", "Salt and freshly ground black pepper to taste."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set 6 cups of water to boil. Put 2 tablespoons of the olive oil in the bottom of a medium soup pot, and turn the heat to medium. Finely dice the ham, and add to the oil . Brown, stirring occasionally, for about 5 minutes, while you prepare the garlic, onion and greens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the garlic, and chop it roughly or leave it whole. Peel and chop onion. Wash and chop greens into bite-size pieces. Rinse once more than you think you need to.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the ham is browned, add the garlic, and cook, stirring occasionally, until it begins to color, about 2 minutes. Add the onions, and cook, stirring occasionally, until they become translucent, 2 or 3 minutes. Add the greens, and stir; then, add the 6 cups of boiling water. Stir in the pasta and a good sprinkling of salt and pepper; adjust heat so the mixture simmers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pasta has been going for about 5 minutes, add the diced parmesan rind. It will soften as the pasta cooks -- ideally, the pasta will be done just as the parmesan softens and surrenders its flavor, but before it disintegrates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>(Optional) If you are actually serving this soup to Ben Roethlisberger, remove pasta from broth and thread a piece of chive through each piece of pasta, to create a suggestion of a chinstrap. If your guests are smart enough to wear helmets when they operate two wheeled vehicles, you may omit this tedious refinement.</p>"}]}