{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070924howtopickapeachsmall.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "CTB: How to Pick a Peach", "Russ Parsons", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Southern Comfort Soup", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-southern-comfort-soup.html", "description": "This week's Cook the Book entry, How to Pick a Peach by Russ Parsons, is all about where the foods in the produce aisle come from, when they're at their best, and how to pick a prime example of whatever...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<p>2 tablespoons olive oil<br />", "4 garlic cloves, minced <br />", "1/2 pound mixed leafy greens without stems (mustard, kale, collard, beet. turnip and chard) <br />", "6 cups weak vegetable or chicken broth <br />", "Salt <br />", "1 1/2 cups water <br />", "3/4 cup jasmine rice <br />", "1 1/2 teaspoons sherry vinegar, plus more to taste <br />", "Freshly ground pepper <br />", "Freshly grated Parmigiano-Reggiano  </p>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil and garlic in a soup pot over medium-high heat until the garlic softens, about 3 minutes. Coarsely chop the greens and add them to the pot. They will come close to overfilling, but within about 5 minutes of cooking and stirring they will wilt down to almost nothing. Add the broth and 2 teaspoons salt and slowly bring to a simmer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the greens are cooking, heat the water and rice in a 1-quart saucepan over medium-high heat. When the water comes to a boil, reduce the heat to low and cover tightly. Cook until the bottom of the pan is dry and the rice is tender, about 15 minutes. Remove from the heat and let cool, covered, until ready to use.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the greens come to a simmer, cook until the colors begin to darken and fade, 5 minutes or less. Transfer half of the greens and liquid to a food processor and puree until the greens are finely minced. Transfer to a bowl and repeat with the remaining greens and liquid.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pot and return the puree to it. Bring back to a simmer, then stir in the rice and vinegar. Season with a generous grinding of pepper. Taste for salt and vinegar.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into heated shallow bowls and garnish with a generous grating of cheese. Serve. </p>"}]}