{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-baking.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["baking", "books", "Cook the Book", "CTB: From My Home to Yours", "desserts", "Dorie Greenspan", "peaches", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Crunchy and Custardy Peach Tart", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-crunchy-and-cust.html", "description": "I love peaches, but they're so fragile that after buying a bucket's worth I end up having to quickly devour most of them before they turn into sad, brown, bacteria-infested versions of their former delicious selves. While I have no...", "totalTime": "", "recipeYield": "1 9-inch tart", "recipeCategory": ["Cook the Book", "Desserts", "Peach"], "recipeIngredient": ["<em>For the streusel</em>", "2 tablespoons all-purpose flour ", "2 tablespoons (packed) light brown sugar ", "2 tablespoons chopped almonds ", "2 tablespoons cold unsalted butter, cut into pieces ", "1 9-inch tart crust made with <a href=\"#sweettartdough\">Sweet Tart Dough with Nuts</a>, partially baked and cooled ", "&nbsp", "<em>For the filling</em>", "3 large ripe peaches, peeled, halved and pitted ", "1/2 cup heavy cream ", "1 large egg ", "1/8 teaspoon pure almond extract ", "1/4 cup sugar ", " Confectioners' sugar, for dusting ", "1 1/4 cups all-purpose flour ", "1/4 cup finely ground almonds (or walnuts, pecans, or pistachios)", "1/2 cup confectioners' sugar ", "1/4 teaspoon salt ", "1 stick plus 1 tablespoon (9 tablespoons) very cold (or frozen) unsalted butter, cut into small pieces ", "1 large egg yolk "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the streusel:</strong> Working with your fingertips, blend all the ingredients together in a small bowl until evenly combined. Cover the streusel tightly with plastic wrap and refrigerate it until needed. (Wrapped well, the streusel can be refrigerated for up to 2 days.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 425 degrees F. Place the tart pan on a baking sheet lined with parchment or a silicone mat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the tart:</strong> Slice 5 of the peach halves crosswise. The best way to do this is to place each peach half cut side down on a cutting board and slice it crosswise into thin slices, keeping the sliced half intact. Then lift each half on a spatula, press down on the half lightly to fan it just a bit and place it in the crust, with the edge of the outer peach slice almost touching the edge of the crust, so you have 5 peach \"spokes\" and an empty space in the center. Trim the remaining unsliced peach half so it will fit into the center of the tart and, using the tip of your knife, cut a little tic-tac-toe pattern in the center of the peach. Set aside while you make the creamy filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the cream, egg, sugar and almond extract together in a small bowl. When blended, rap the bowl on the counter to knock out the air bubbles, and pour the filling over and around the peaches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the tart for 10 minutes. Lower the oven temperature to 375 degrees F, and bake the tart tor another 20 minutes, at which point you should add the streusel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the streusel from the refrigerator and, using your fingers, break it up into small bits. Carefully pull the baking sheet to the front of the oven (if you can manage to get the streusel onto the tart without removing the tart from the oven and jostling the delicate filling, so much the better, but pull it out completely if it's easier) and sprinkle the streusel evenly over the creamy parts of the tart. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for another 20 to 25 minutes (total baking time is 50 to 55 minutes), or until the filling is set and the streusel is golden. Remove the tart from the oven and transfer t he pan to a rack to cool until barely warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, dust with confectioners' sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a  name=\"sweettartdough\"></a><font style=\"text-transform:uppercase;\"><strong>Sweet Tart Dough with Nuts</strong></font> <em>- makes one 9-inch crust -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, ground nuts, confectioners' sugar and salt in a food processor and pulse a couple of times to combine. Scatter the pieces of butter over the dry ingredients and pulse until the butter is coarsely cut in&mdash;you should have some pieces the size of oatmeal flakes and some the size of peas. Stir the yolk, just to break it up, and add it a little at a time, pulsing after each addition. When the egg is in, process in long pulses&mdash;about 10 seconds each&mdash;until the dough, which will look granular soon after the egg is added, forms clumps and curds. Just before you reach this stage, the sound of the machine working the dough will change&mdash;heads up. Turn the dough out onto a work surface and, very lightly and sparingly, knead the dough just to incorporate any dry ingredients that might have escaped mixing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9-inch fluted tart pan with a removable bottom. Press the dough evenly over the bottom and up the sides of the pan, using all but one little piece of dough, which you should save in the refrigerator to patch any cracks after the crust is baked. Don't be too heavy-handed&mdash;press the crust in so that the edges of the pieces cling to one another, but not so hard that the crust loses its crumbly texture. Freeze the crust for at least 30 minutes, preferably longer, before baking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> To Partially or Fully Bake the Crust: </strong> Center a rack in the oven and preheat the oven to 375 degrees F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter the shiny side of a piece of aluminum foil and fit the foil, buttered side down, tightly against the crust. (Since you froze the crust, you can bake it without weights.) Put the tart pan on a baking sheet and bake the crust for 25 minutes. Carefully remove the foil. If the crust has puffed, press it down gently with the back of a spoon. For a partially baked crust, patch the crust if necessary, then transfer the crust to a cooling rack (keep it in its pan). </p>"}]}