{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070601zingermans.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "John T. Edge", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Zingerman's Roadhouse Donuts", "link": "https://www.seriouseats.com/recipes/2007/06/cook-the-book-zingermans-roadh.html", "description": "Zingerman's, the collection of food purveyors based in Ann Arbor, Michigan, turns out some of my favorite doughnuts. Short of traveling to Michigan or mail-ordering a couple dozen, I'm happy I can turn to the recipe for them in John...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts", "Doughnuts"], "recipeIngredient": ["5 cups all-purpose flour", "1 tablespoon baking powder", "2 teaspoons freshly grated nutmeg", "1 1/2 teaspoons salt", "1/2 cup buttermilk, at room temperature", "2 large eggs, at room temperature", "1 large egg yolk, at room temperature", "3/4 cup granulated sugar", "1/2 cup vegetable shortening, melted and cooled", "1/4 cup molasses", "1/2 rounded teaspoon lemon zest", "1/2 gallon vegetable oil for frying", "1/2 muscovado brown sugar for sprinkling (or substitute dark brown sugar)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour, baking powder, nutmeg and salt together into a large mixing bowl.  In another large mixing bowl, combine the buttermilk, eggs, egg yolk, granulated sugar, melted vegetable shortening, molasses, and lemon zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually add the four mixture to the wet mixture, stirring gently.  Stop stirring as soon as all the ingredients are combined&mdash;overstirring will make tough donuts.  You'll still see a little flour.  (You may use a standing mixer for this process&mdash;just be sure to stop mixing as soon as all the flour is added and combined.)  Cover the dough with plastic and let rest in the refrigerator for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a cast-iron Dutch oven or other heavy-bottomed ad deep pot until it reaches a dept of 3 to 4 inches.  Heat the oil over medium-high heat to 370&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Knead the dough on a well-floured surface for 1 minute, then roll it out with a rolling pin to 1/2 inch thickness.  Cut out rounds using a 3 1/2 inch pastry cutter, then cut the centers out with a 1 1/2 inch round.  Gather the scraps and reroll as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To avoid overcrowding, fry only 2 or 3 donuts at a time.  All told, they'll take about 3 to 4 minutes to cook, needing to be turned every minute or so.  Drop the rings into the hot oil.  They will float in about 30 seconds or so.  Fry them for 1 minute more, then turn them over and fry for another minute.  Turn them once again and fry 1 minute more, until golden.  Remove with a slotted spoon onto a kitchen towel and immediately sprinkle with muscovado sugar.  Cover the donuts as you make them and store them in a warm place until they're all done.</p>"}]}