{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cook's Illustrated", "roasting", "thanksgiving", "Thanksgiving mains", "Thanksgiving turkeys", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook's Illustrated's Roasted Brined Turkey", "link": "https://www.seriouseats.com/recipes/2007/11/cooks-illustrated-roasted-brined-turkey-recipe.html", "description": "When we talked to Cook's Illustrated publisher Chris Kimball about the November 2007 issue of the magazine, we asked for his turkey recipe. You may not be able to get a fresh turkey from your neighbor across the street, like...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "Mains", "Turkey"], "recipeIngredient": ["Table salt ", "1 turkey (12-14 pounds gross weight), rinsed thoroughly, giblets and neck reserved for gravy, if making", "4 tablespoons unsalted butter, melted "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve 1 cup salt per gallon cold water for -4 to 6-hour brine or 1/2 cup salt per gallon cold water for 12- to 14-hour brine in large stockpot or clean bucket. Submerge turkey completely and refrigerate for predetermined amount of time. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before removing turkey from brine, adjust oven rack to lowest position; heat oven to 400&deg;F. Line large V-rack with heavy-duty foil and use paring knife or skewer to poke 20 to 30 holes in foil; set V-rack in large roasting pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove turkey from brine and rinse well under cool running water. Pat dry inside and out with paper towels. Tuck tips of drumsticks into skin at tail to secure; tuck wing tips behind back. Brush turkey breast with 2 tablespoons butter. Set turkey breast-side down on prepared V-rack; brush back with remaining 2 tablespoons butter. Roast 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove roasting pan with turkey from oven (close oven door to retain oven heat). Using clean potholders or kitchen towels, rotate turkey breast-side up; continue to roast until thickest part of breast registers 165 degrees and thickest part of thigh registers 170 to 175 degrees on instant-read thermometer, 50 to 60 minutes longer. Transfer turkey to carving board: let rest 30 minutes. Carve and serve. </p>"}]}