{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["baking", "cheesecakes", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Junior's Apple Caramel Cheesecake", "link": "https://www.seriouseats.com/recipes/2007/10/juniors-apple-caramel-cheesecake-recipe.html", "description": "...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["<strong>For the apple filling:</strong>", "3 large firm, crisp red-skinned apples", "1/2 cup apple cider or apple juice", "1 tablespoon cornstarch", "1/4 teaspoon ground cinnamon", "&nbsp", "<strong>For the cheesecake:</strong>", "Three 8-ounce packages cream cheese (use only full fat), room temperature", "1 1/3 cups sugar", "1/4 cup cornstarch", "1 tablespoon pure vanilla extract", "2 extra-large eggs", "2/3 cup heavy or whipping cream", "&nbsp", "<strong>For the apple-caramel topping:</strong>", "2 large firm, crisp red-skinned apples", "Juice of one large lemon", "1 cup caramel or butterscotch ice cream topping", "&nbsp", "<strong>Junior’s Sponge Cake Crust</strong> <em>- makes one 9-inch crust</em>", "1/3 cup sifted cake flour", "3/4 teaspoon baking powder", "Pinch of salt", "2 extra-large eggs, separated", "1/3 cup sugar", "1 teaspoon pure vanilla extract", "2 drops pure lemon extract", "2 tablespoons unsalted butter, melted", "1/4 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make and bake the <a href=\"#juniorsspongecakecrust\">Sponge Cake Crust</a>, and leave it in the pan. Keep the oven on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, peel and core the apples for the filling into ½-inch, bite-size pieces. Combine the cider, cornstarch, sugar, and cinnamon in a small saucepan and whisk until completely dissolved. While stirring constantly, bring to a full boil over medium heat and continue to boil until thickened, about 2 minutes. Remove from the heat and stir in the apples. Set aside to cool while you make the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put one package of the cream cheese, 1/3 cup of the sugar, and the cornstarch in a large bowl. Beat with an electric mixer on low until creamy, about 3 minutes, scraping the bowl down several times. Blend in the remaining cream cheese, one package at a time, scraping down the bowl after each one. Increase the mixer speed to medium and beat in the remaining 1 cup of sugar, then the vanilla. Blend in the eggs, one at a time, beating well after adding each one. Beat in the cream just until completely blended. Be careful not to overmix! Gently spoon the batter on top of the crust, then spoon the apple mixture over the batter, gently spreading it almost to the edge of the pan, completely covering the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cake in a large shallow pan containing hot water that comes about 1 inch up the sides of the springform. Bake until the edges are light golden brown and the top is slightly golden tan, about 1 1/4 hours. Remove the cheesecake from the water bath, transfer to a wire rack, and let cool for 2 hours (just walk away—don’t move it). Leave the cake in the pan, cover loosely with plastic wrap, and refrigerate until completely cold, preferably overnight or at least 4 hours. Transfer the cake to the freezer for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the prettiest cake, decorate within a few hours of serving, so the apples stay fresh and crisp. To make the topping, core the apples and thinly slice them or cut them into bite-size pieces (leave the peel on if you like). Toss the apples with the lemon juice (this keeps them from turning brown). Release and remove the sides of the springform, leaving the cake on the bottom of the pan. Place on a serving plate. Top the cake with the apples (wipe them with a paper towel first).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>arm the caramel ice cream topping (don’t let it boil), then drizzle it from the tip of a small spoon in stripes across the top of the cake, all around the edges, and some down the sides. Return the cake to the freezer until the caramel has set, 30 minutes. Refrigerate the cake until ready to serve. Slice with a sharp straight-edge knife, not a serrated one. Cover any leftover cake and refrigerate. Do not freeze this cake. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Junior’s Sponge Cake Crust </strong> Preheat the oven to 350°F and generously butter the bottom and sides of a 9-inch springform pan (preferably a nonstick one). Wrap the outside with aluminum foil, covering the bottom and extending all the way up the sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, sift the flour, baking powder, and salt together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg yolks in a large bowl with an electric mixer on high for 3 minutes. With the mixer running, slowly add 2 tablespoons of the sugar and beat until thick light yellow ribbons form, about 5 minutes more. Beat in the extracts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour mixture over the batter and stir it in by hand, just until no more white flecks appear. Now, blend in the melted butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now wash the mixing bowl and beaters really well (if even a little fat is left, this can cause the egg whites not to whip). Put the egg whites and cream of tartar into the bowl and beat with the mixer on high until frothy. Gradually add the remaining sugar and continue beating until stiff peaks form (the whites will stand up and look glossy, not dry). Fold about one-third of the whites into the batter, then the remaining whites. Don’t worry if you still see a few white specks, as they’ll disappear during baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently spread out the batter over the bottom of the pan, and bake just until set and golden (not wet or sticky), about 10 minutes. Touch the cake gently in the center. If it springs back, it’s done. Watch carefully and don’t let the top brown. Leave the crust in the pan and place on a wire rack to cool.</p>"}]}