{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "cookbooks", "Fergus Henderson", "Justin Piers Gellatly", "offal", "pigs ears"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pressed Pig's Ear", "link": "https://www.seriouseats.com/recipes/2007/10/cook-the-book-pressed-pigs-ear.html", "description": "And the first recipe from Beyond Nose to Tail is go! Here's what'll do you for Pressed Pig's Ear, a dish Henderson describes as \"thin slivers of joyous piggy jelly, within which there is a beautiful weave of ear.\"...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Offal"], "recipeIngredient": ["14 pig ears, cleaned and any remaining hair shaved off with a Bic razor, then <a href=\"#brine\">brined for at least 3 days</a>", "3 pig trotters, cleaned ", "2 onions, peeled ", "2 carrots, peeled ", "2 leeks, peeled ", "2 sticks of celery ", "A head of garlic ", "A bundle of parsley, thyme and rosemary ", "2 bay leaves ", "Peppercorns ", "Enough very light chicken stock to cover the above ingredients ", "400 grams caster sugar (about 1 1/3 cups) ", "600 grams sea salt (about 2 1/2 cups)", "12 juniper berries ", "12 cloves ", "12 black peppercorns ", "3 bay leaves ", "4 liters water (about a gallon plus 1/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ears from the brine, rinse thoroughly and soak in fresh water for half a day. Final ear procedure: you need to flatten them, so when they turn into funnels split them open with a knife. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all the ingredients in a pot and cover with the chicken stock, then lid on pot and into a medium oven for 4 hours. After 3 hours, take a look; remember you want a totally submissive texture, but also that there is the cartilage in the ear, which will never give in. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When done, remove from the oven. Carefully take out the ears and layer them in a terrine mold or bread tin lined with cling film. Strain the liquor off the vegetables and trotters into a clean pan. Place on the hob and simmer until reduced to the point where it will still cover the ears. Check for seasoning&mdash;remember it is going to be served cold, which always dulls flavor. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the reduced liquor over the ears. Cut a bit of cardboard to fit in your mold, cover it with cling film and place on top of your juicy ears. Apply weights to it&mdash;tins of tomato etc. Allow to cool, then leave in the fridge overnight. Next day it is ready to eat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"brine\"></a><h4>Making a Brine</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 4 liters -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring all the brine ingredients together in a pot and bring to the boil so the sugar and salt melt. Decant into a container and allow to cool. When cold, add your meat. Leave it in the brine for the number of days required for your recipe.</p>"}]}