{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/ctb-asianflavorsjeangeorges.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Asian Flavors of Jean-Georges", "beef", "Cook the Book", "Jean-Georges Vongerichten", "roasting"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Beef Brisket With Onions and Chile", "link": "https://www.seriouseats.com/recipes/2007/11/cook-the-book-beef-brisket-with-onions-and-chile-recipe.html", "description": "Jean-Georges Vongerichten spices up beef brisket with his recipe for beef brisket with onions and chile by topping beef brisket with caramelized onions cooked with red finger chile. He refers to it as as Alsatian-Jewish-Chinese dish, \"representative of both...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 tablespoons extra virgin olive oil ", "1/2 fresh red finger chile, seeded and thinly sliced ", "2 onions, diced ", "2 1/2 pounds beef brisket ", "Salt and freshly ground black pepper 2 carrots, diced ", "1 celery stalk, diced ", "5 cups chicken stock. preferably homemade or canned low-sodium broth, plus more as needed ", "1 pound fresh egg noodles ", "Soy sauce "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a skillet mover medium-low heat. Add the chile and half the diced onions and cook, stirring occasionally, until brown. Remove from the heat and cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, trim excess fat off the brisket, leaving a thin, even layer of fat on top. Season the meat generously with salt and pepper and put it in a roasting pan. Scatter the carrots, celery, and remaining onions around the brisket. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the caramelized onions onto the top of the brisket to form a crust. Pour in enough stock so that everything but the crust is covered. Cover the pan with foil and transfer to the oven, </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the meat, basting every half hour, until it is very tender, 2 to 3 hours. Remove the pan from the oven and allow the brisket to cool in its juices before carving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a targe pot of water to a boil. Salt it generously and add the egg noodles. Cook, stirring occasionally, until al dente, about 4 minutes. Drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the noodles and pan juices among the serving bowls and top with slices of the beef. Season to taste with soy sauce and serve. </p>"}]}