{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070913savorycheddarchivez.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "bread", "cheddar-chive bread", "Dorie Greenspan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Savory Cheddar-Chive Bread", "link": "https://www.seriouseats.com/recipes/2007/09/baking-with-dorie-savory-cheddarchive-bread.html", "description": "I know this looks like a good old American quick bread, but, even though it's shot through with straight-from-Vermont cheddar cheese, it's got a French soul&#8212;at least I think it has, since I was inspired to make it after having...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Baking With Dorie", "Bread"], "recipeIngredient": ["1 3/4 cups all-purpose flour", "1 tablespoon baking powder", "1/2 to 1 teaspoon salt (it depends on what cheese and add-ins you're using)", "1/4 teaspoon freshly ground white pepper (or more to taste; you could even add a pinch of hot pepper)", "3 large eggs, at room temperature", "1/3 cup whole milk, at room temperature", "1/3 cup extra-virgin olive oil", "3 ounces coarsely grated cheddar or other cheese", "2 ounces cheddar or other cheese, cut into very small cubes", "1/2 cup minced chives or other herbs", "1/3 cup toasted walnuts, chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, baking powder, salt, and pepper in a large mixing bowl and whisk the ingredients together to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Put the eggs in another mixing bowl; whisk for about 1 minute, until they're foamy and blended. Whisk in the milk and olive oil.nn3. Pour the wet ingredients over the dry ingredients and, using a sturdy rubber spatula or a wooden spoon, gently mix until the dough comes together. There's not need to be energetic\u0097beating the dough toughens it\u0097nor do you need to be very thoroughly. Just stir until all the dry ingredients are moistened. Now, stir in the cheese, grated and cubed, the herbs and the toasted walnuts, if you're using them. You'll have a thick dough. Turn the dough into the buttered pan and even the top with the back of the spatula or spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the pan into the oven and bake for 35 to 45 minutes, or until the bread is golden and a slender knife inserted into the center of the loaf comes out clean.  Transfer the pan to a cooling rack, wait about 3 minutes, then run a knife around the sides of the pan and turn the loaf over onto the rack; invert and cool to room temperature right-side up.</p>"}]}