{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "French", "keywords": ["Cook the Book", "duck", "French", "poultry", "Think Like a Chef", "Tom Colicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Duck Confit", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-duck-confit-recipe.html", "description": "If you don't think you like duck, maybe that's because you haven't eaten duck confit. The formula for duck confit can only equate to deliciousness: Cure duck legs in seasoned salt and garlic for a day, then bake the legs...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Cook the Book", "French", "Mains", "Other Meats"], "recipeIngredient": ["3 tablespoons kosher salt ", "4 garlic cloves, smashed ", "1 shallot, peeled and sliced ", "6 sprigs of fresh thyme ", "4 duck legs with thighs ", "4 duck wings, tip joint trimmed off ", "Coarsely ground black pepper ", "About 4 cups duck fat "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle 1 tablespoon of the salt in the bottom of a dish large enough to hold the duck pieces in a single layer. Evenly scatter half the garlic, shallot, and thyme over the salt. Place the duck on top of the salt mixture, then sprinkle with the remaining salt, garlic, shallot, and thyme. Season with pepper, cover with plastic wrap, and refrigerate for 24 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 225&deg;F. Melt the duck fat in a saucepan over medium-low heat. Brush the salt and seasonings off the duck and arrange the pieces in a single snug layer in a high-sided baking dish. Pour the melted fat over the duck. (The duck pieces should be covered by fat. If they are not, switch pans or use more fat.) Transfer the confit to the oven and cook at a very gentle simmer-just an occasional bubble-until the duck is tender and can be easily pulled from the bone, 2 to 3 hours. Remove the dish from the oven and set aside to cool. Store the duck in the fat in the refrigerator, up to 1 month. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To use, brown the duck pieces, skin-side down, in a small amount of fat, turn over, and place in a 300&deg;F. oven until heated through, about 15 minutes. </p>"}]}