{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["eggs", "grilled cheese sandwich", "Mario Batali", "mozzarella"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Holiday Brunch:  Mozzarella in Carozza", "link": "https://www.seriouseats.com/recipes/2007/12/holiday-brunch-mozzarella-in-carozza.html", "description": "In honor of the superlong holiday weekend and the multiple brunch possibilities contained therein I am going to post the Serious Eats Sunday Brunch recipe suggestion today. I'm a grilled cheese fanatic for breakfast, brunch, lunch, or dinner, so when...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["8 slices American-style sandwich bread, crusts removed ", "1 pound fresh mozzarella di bufala, cut into four 3-by4-inch slices ", "4 eggs plus 3 yolks ", "1 cup whole milk ", "1 teaspoon chopped fresh thyme leaves ", "1 teaspoon kosher salt ", "2 tablespoons extra-virgin olive oil ", "2 tablespoons unsalted butter "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top each of 4 slices of bread with a piece of mozzarella. Cover with the 4 remaining slices of bread to form sandwiches.  Trim the bread to within 1/4 inch of the cheese and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide, shallow bowl, whisk the eggs and the yolks together. Add the milk, thyme, and salt and mix until well blended. Dip the sandwiches into the mixture one by one to coat, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 12- to 14-inch nonstick saute pan, head 1 tablespoon of the olive oil until smoking. Add 1 tablespoon of the butter cook over medium-high heat until the sizzling subsides. Place 2 sandwiches in the pan and cook slowly until golden brown on the first side, about 2 minutes. Flip each sandwich and cook on the other side for 2 more minutes. Remove sandwiches and set aside in a warm oven. Repeat the process with the remaining oil, butter, and sandwiches. Serve immediately. </p>"}]}