{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071105dolceitaliano.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["baking", "cakes", "chocolate", "Cook the Book", "desserts", "Dolce Italiano", "Gina DePalma", "Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chocolate and Date Pudding Cakes", "link": "https://www.seriouseats.com/recipes/2007/11/cook-the-book-chocolate-date-pudding-cake-recipe.html", "description": "Gina DePalma, author of Dolce Italiano: Desserts From the Babbo Kitchen, recommended that we feature her Chocolate and Date Pudding Cake recipe, saying it has a \"soft, gooey, spoon food, and the flavor of the dates really shines through the...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 cup walnut pieces ", "8 large Medjool dates (6 ounces) ", "1/2 cup whole milk ", "4 ounces bittersweet or semisweet chocolate, chopped ", "4 tablespoons (1/2 stick/2 ounces) unsalted butter ", "3/4 cup unbleached all-purpose flour ", "2 tablespoons unsweetened Dutch.processed cocoa powder ", "1/4 teaspoon baking powder ", "1/4 teaspoon baking soda ", "1/2 teaspoon kosher salt ", "2 large eggs ", "1/4 cup granulated sugar ", "1/4 cup packed dark brown sugar ", "1 teaspoon pure vanilla extract ", "3/4 cup heavy cream "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F and position a rack in the center. Lightly grease eight 6-ounce ramekins or custard cups or a 6-cup muffin tin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the walnuts in a single layer on a baking sheet and toast them until they are golden brown and aromatic, 12 to 14 minutes. Set the walnuts aside to cool, then finely chop them in a food processor. Remove and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dates in half lengthwise and remove and discard the pits. Roughly chop the dates and place them in the food processor. In a small saucepan, heat the milk over medium-high heat to scald it, then add it to the dates and process to make a puree; it will be a bit lumpy. Place the chocolate and butter in a heatproof bowl placed over a saucepan of gently simmering water and melt, whisking to combine them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the all-purpose flour, cocoa powder, baking powder, baking soda, and salt and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an electric mixer fitted with the paddle attachment, beat the eggs and sugars together on medium speed until they are thick and light-colored, about 4 minutes. Beat in the vanilla extract, followed by the chocolate and butter mixture. Scrape down the sides of the bowl and beat in the dry ingredients on low speed. Beat in the date puree, followed by the heavy cream and then the walnuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter among the ramekins or cups and place them on a baking sheet, evenly spaced about an inch apart. Bake the pudding cakes for 20 to 25 minutes, rotating the baking sheet halfway through the baking time to ensure they bake evenly. The cakes should be puffed and cracked on top, but the centers will sink as they cool, remaining soft and slightly wet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pudding cakes from the oven and cool on a rack for about 15 minutes before serving them warm. You may also refrigerate them for up to 24 hours and reheat them before serving. </p>"}]}