{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Deborah Madison", "vegetarian", "Vegetarian Suppers from Deborah Madison's Kitchen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Cook the Book: Sweet Potato Gratin with Onions and Sage", "link": "https://www.seriouseats.com/recipes/2007/11/cook-the-book-sweet-potato-gratin-with-onions-recipe.html", "description": "In her recipe for sweet potato gratin with onions and sage, Deborah Madison tosses thin slices of sweet potato with onions, sage, parsley and garlic, and layers the potatoes with Gruy&egrave;re and Parmesan. Make sure you use cream or half-and-half&mdash;Madison...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cook the Book", "Sides", "Vegetarian"], "recipeIngredient": ["2 teaspoons oil, plus a little for the dish ", "1 large onion, chopped into 1/2-inch dice ", "2 tablespoons chopped sage or 2 teaspoons dried ", "3 medium sweet potatoes (about 1 1/2 pounds), thinly sliced ", "Sea salt and freshly ground pepper ", "a large handful of parsley leaves, chopped with 1 plump garlic clove ", "3/4 cup grated Gruy&egrave;re or smoked mozzarella cheese ", "Freshly grated Parmesan cheese ", "1 cup cream or half-and~half, warmed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Lightly oil a 2-quart gratin dish and put a moderately large pot of water on to boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 2 teaspoons oil in a skillet over medium heat and add the onion and sage. Cook, giving them an occasional stir, until soft and golden, about 12 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, peel the sweet potatoes, then slice them as thinly as you can manage. Salt the water, then drop them in. Allow the water to return to a boil, which may take a few minutes. Boil for a minute or until the potatoes arc partly tender when pierced with a knife, then drain. Toss them with the onions, chopped parsley, and garlic. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop a third of the potatoes into the prepared dish and even them out. Season with salt and pepper, add half the Gruy&egrave;re, and grate over a little Parmesan. Repeat, making two more layers and covering the last with a dusting of the Parmesan. Pour the warm cream over all, cover with foil, and bake in the center of the oven for 25 minutes. Remove the foil and continue baking until the potatoes are utterly soft and the gratin has browned, another 25 minutes or so. Let the gratin stand a few minutes before serving. If you're not ready to eat, it can wait in the turned-off oven for another half hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Tip:</strong> Begin with the onion, and while it's cooking, peel and slice the sweet potatoes.  Parboil the potatoes, toss with the onion and seasonings, then pour over the cream and bake.</p>"}]}