{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Jenn Smith"}, "recipeCuisine": "", "keywords": ["Lee Bros.", "thanksgiving", "Thanksgiving Healthy Menu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sneaky Collards", "link": "https://www.seriouseats.com/recipes/2007/11/sneaky-collards-collard-greens-recipe.html", "description": "Here's another option if you're throwing a meat-free Thanksgiving. These smoky greens from Matt Lee and Ted Lee's The Lee Bros. Southern Cookbook are \"sneaky\" because, while they taste rich enough to make you believe they have been simmered for...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dairy-Free", "Healthy and Delicious", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["8 cups water ", "3 dried chiles or 1 tablespoon crushed red pepper flakes ", "1 tablespoon plus 1 teaspoon kosher salt, plus more to taste ", "3 3/4 pounds collard greens (about 72 leaves or 3 bunches), ribbed, washed, and cut into 1-inch wide strips ", "1 large onion, trimmed, peeled, and quartered ", "1 large tomato, cored and quartered ", "2 tablespoons extra-virgin olive oil ", "1 tablespoon balsamic vinegar, sherry vinegar. or red wine vinegar ", "1 teaspoon Spanish smoked paprika (pimenton) or Hungarian paprika ", "3 cloves garlic ", "1 teaspoon freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an 8-quart stockpot, bring the water to a boil over high heat. Add the chiles and 1 tablespoon salt, reduce the heat to medium-low, and simmer until the stock has a nice salty spiciness, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a few handfuls of greens to the pot. They will float on the surface, so stir them frequently, submerging with the spoon, until they have turned a bright kelly green, 3 to 5 minutes. They will become floppy and more compact, so you can add more handfuls of greens. Continue adding greens, stirring and submerging them until all the collards are in the pot (6 to 10 minutes). Turn the heat down to the gentlest simmer, and note your time at this point. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the greens simmer, place the onion and tomato in a small bowl. Drizzle the olive oil and vinegar over them, add 1 teaspoon salt, the paprika, and the pepper, and toss to coat. Transfer the vegetables to a medium cast-iron skillet and add the garlic. place the skillet under a hot broiler, about 3 inches from the flame or heating element, until the vegetables are nicely charred, 6 to 8 minutes. Set them on the stove top to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the garlic is cool enough to touch, peel the cloves and return them to the skillet, disscarding the charred skins. Transfer the broiled onion, tomato, and garlic to a blender or food processor and blend at high speed until the mixture is completely smooth, about 3 minutes. You should have close to 1 1/2 cups of purée. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a ladle, remove 6 cups of stock from the collards pot and discard or save for soup. Add the puree and continue to simmer the greens, for a total of 1 hour from the point at which you noted the time. The greens will be a very dark matte green and completely tender, bathed in pale red gravy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer servings to plates with a slotted spoon.</p>"}]}