{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["apple pie", "books", "Cook the Book", "CTB: Apple Pie", "dessert", "John T. Edge", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Hypocrite Pie", "link": "https://www.seriouseats.com/recipes/2007/10/cook-the-book-hypocrite-pie.html", "description": "In John T. Edge's Apple Pie: An American Story the author travels the country eating the best pies and highlighting them for us. (Tough job, eh?) Hypocrite Pie is so named because its creator, Beth Tartan, creates a false impression...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>Crust</strong>", "<strong>Filling</strong> ", "6 tablespoons bntter ", "3 tart apples, peeled, cored, and sliced ", "1 cup white sugar ", "1/2 teaspoon ground cinnamon ", "2 eggs ", "1 teaspoon vanilla ", "1 tablespoon all-purpose flour ", "1 cup buttermilk ", "2/3 cup vegetable shortening, chilled ", "1/2 tablespoon salt ", "2 cups flour ", "4 to 5 tablespoons cold water ", "1 egg, separated ", "1/2 tablespoon cider vinegar ", "3/4 cup warm water ", "3 cups all-purpose flour ", "1 cup lard (or shortening) ", "1 1/2 teaspoons salt ", "2 2/3 cups all-purpose flour", "3/4 teaspoon kosher salt ", "3/4 tablespoon sugar ", "4 ounces butter, chilled and cut into pieces ", "4 ounces vegetable shortening, chilled and cut into pieces ", "1/4 to 1/2 cup water, chilled in a squeeze bottle or spray bottle "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 300&deg;F. Melt 2 tablespoons of the butter in a skillet. Add apples, 1/4 cup of the sugar, and the cinnamon. Cook over medium heat for 4 to 5 minutes, until the apples are tender. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the remaining 4 tablespoons of softened butter with the remaining 1/2 cup of the sugar. Beat until creamy. Beat in the eggs one at a time. Mix in the vanilla and flour. Pour in the buttermilk and beat until silky. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish:</strong> Working from the center and pushing out, roll the dough into circles just larger than the pie plate. Repeat. Place one crust in a pie pan and prick the bottom with a fork. Save the other crust for a future use. Spoon the apples into the crust. Pour the buttermilk custard over top, ensuring that it thoroughly covers the apples. Bake for 50 to 50 minutes, or until a knife inserted in the center comes out clean. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"passerby-crust\"></a><h4>Apple Pie for a Passerby Piecrust</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a pastry cutter or a fork, cut the shortening and salt into the flour until the mix is pebbly. Add the water and stir with a fork until the dough becomes somewhat sticky. Form dough into a ball, and then cut the ball in half, handling the dough as little as possible. Wrap in plastic and refrigerate, preferably for at least an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"lonepie-crust\"></a><h4>Lone Pie Piecrust</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a liquid measuring cup, stir egg yolk with cider vinegar and enough warm water to reach the 1/2 cup mark. Set aside. Put flour, lard, and salt into a mixing bowl. Combine. Add egg mixture, stir, and form two balls. Place one between two sheets of plastic wrap and with a rolling pin press into a disk large enough to overlap the edges of your pie plate. Repeat with second dough ball. Refrigerate doughs for at least an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse flour, salt, and sugar in a food processor until blended. Add butter and shortening and pulse 12 to 14 times or until the mixture looks like clumpy sand. Transfer mixture to a large bowl and gradually spray in enough cold water to form a cohesive and evenly moistened dough that is still not sticky. Work quickly, tossing and stirring with a fork until dough begins to come together. Divide dough in two. Shape each half into a flattened round. Wrap in plastic and chill in the refrigerator for several hours or overnight. To prepare dough for the pie plate, lay down a sheet of wax paper. With a rolling pin, bang out the rounds into crusts, making initial impact at the centermost point before stroking quickly outward. Lift the pin each time before whacking it again. Ten or twelve spankings should do it. This crust recipe works well with just about any filling. </p>"}]}