{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["apple fritters", "apples", "Nancy Silverton", "pastries", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Apple Fritters", "link": "https://www.seriouseats.com/recipes/2007/06/cook-the-book-apple-fritters.html", "description": "I know that some of you will grouse and tell me that an apple fritter is not a doughnut. And, you're probably right. But, because it's sold in doughnut shops everywhere, I'm including this recipe. Apple Fritters...", "totalTime": "", "recipeYield": "16-20 fritters", "recipeCategory": ["Apple", "Cook the Book", "Desserts", "Doughnuts"], "recipeIngredient": ["2 teaspoons (0.6 ounce) packed fresh yeast or 2 1/4 teaspoons active dry yeast", "2/3 cup whole milk", "3 1/4 cups plus 2 tablespoons unbleached pastry flour or unbleached all-purpose flour", "4 extra-large egg yolks", "1/2 cup granulated sugar", "1/3 cup sparkling apple cider", "1/2 stick (2 ounces) unsalted butter, melted", "1 teaspoon kosher salt", "1/2 teaspoon ground cinnamon", "1 tablespoon pure vanilla extract", "<strong>For the apples</strong>", "1/2 stick (2 ounces) unsalted butter", "1 vanilla bean", "7 firm and tart Granny Smith apples (2 1/2 pounds), peeled and cut into 1/2-inch cubes to equal 7 cups", "1/2 teaspoon ground cinnamon", "1/4 cup granulated sugar", "1/4 cup apple cider vinegar", "1 cup sparkling apple cider", "<strong>For the white glaze</strong>", "1/2 cup plus 2 tablespoons powdered sugar, sifted", "1/4 cup heavy cream", "1/2 teaspoon pure vanilla extract", "1/8 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the dough: Place the yeast in the bowl of an electric mixer.  In a small saucepan, over medium heat, heat the milk until warm to the touch.  Pour the milk over the yeast to soften, 1 to 2 minutes.  Add 2 cups of the flour to the milk mixture, without stirring.  Cover the bowl tightly with plastic wrap and set aside in a warm place until the surface of the flour cracks, about 30 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl combine the egg yolks and sugar.  Add the cider, melted butter, salt, cinnamon, vanilla extract, and 1 1/4 cups of the flour and mix until combined.  Add this mixture to the yeast.  Using the paddle attachment of an electric mixer, mix on low for half a minute, then turn up to medium for about 1 minute.  Add the remaining 2 tablespoons of flour and mix on low for half a minute, then on medium for another half a minute.  The dough will be very sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift an even layer of flour onto the work surface; scrape the dough out of the bowl, onto the work surface.  Clean the mixing bowl and lightly coat it with vegetable oil.  Gather the dough and return it to the oiled bowl.  Cover it tightly with plastic wrap, and set aside in a warm place until the dough has doubled in size, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the apples: In a large skillet over medium heat, melt the butter.  Using a small paring knife, split the vanilla bean lengthwise.  With the back of the knife, scrape out the pulp and the seeds of the vanilla bean, and add the scrapings and the pod to the butter.  Heat the butter until bubbly.  Add the chopped apples, tossing to coat them with butter.  Add the cinnamon and sugar, and saute 3 to 5 minutes until slightly softened and the majority of the apples are deep golden.  Add the vinegar ad cider, and reduce over medium-high heat.  If the apples are becoming too mushy, turn the heat up, so the liquid reduces quickly.  If they are still very firm, turn the head down to reduce slowly.  The apples should be cooked, but still slightly firm to the touch.  Remove the vanilla bean and place the apples on a baking sheet to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough out onto a floured surface and stretch into a rectangle about 2 inches thick. Spread half of the apples over the dough and fold into thirds by bringing the bottom up and the top down, patting with your hands to flatten slightly.  Scatter the remaining apples on top and fold into thirds again.  Gather the dough together by tucking under the edges and return it to the oiled bowl.  Cover and allow to rise until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil to 375 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough out onto a floured surface and gently roll or pat it into a rectangle about 1/2 inch thick, flouring the surface of the dough as necessary.  Dip the cutter in flour and, cutter as closely together as possible, cut out the fritters.  Place them on a floured surface and allow to rest for 10 minutes, no longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the glaze: In a small stainless steel bowl set over a pot of gently simmering water, combine the powdered sugar, cream, vanilla extract, and salt.  Heat until just warm, stirring frequently.  The glaze should be thin and translucent; if necessary, thin it down with more cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip your hands in flour, and stretch the fritters by pulling them gently elongating the round shape into a 4-inch oval.  Don't worry if you puncture the dough as you stretch it.  Drop directly into the hot oil and fry according to instructions (link to the introduction about frying).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the fritters with glaze while they are warm.</p>"}]}