{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Sunday Brunch: Thomas Keller's Quiche", "link": "https://www.seriouseats.com/recipes/2007/12/sunday-brunch-thomas-kellers-quiche.html", "description": "", "totalTime": "2 days", "recipeYield": "Serves 8", "recipeCategory": ["Breakfast and Brunch", "Eggs"], "recipeIngredient": ["<strong>For the Shell:</strong>", "2 cups flour (about 12 ounces), sifted, plus a little more for rolling", "1 teaspoon kosher salt", "1 cup (8 ounces) chilled unsalted butter, cut into 1/4-inch pieces", "1/4 cup ice water", "2 tablespoons canola oil", " ", "<strong>For the Quiche:</strong>", "2 cups milk", "2 cups heavy cream", "6 large eggs", "1 tablespoon kosher salt", "1/4 teaspoon freshly ground white pepper", "6 gratings fresh nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Shell:</strong> Place 1 cup of the flour and the salt in the bowl of a heavy-duty mixer fitted with the paddle attachment. Turn the mixer to low speed and add the butter a small handful at a time. When all the butter has been added, increase the speed to medium and mix until the butter is completely blended with the flour. Reduce the speed, add the remaining flour and mix just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the water a little at a time and mix until the dough gathers around the paddle and pulls cleanly away from the sides of the bowl. It should feel smooth, not sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the mixer and check to be certain that there are no visible pieces of butter remaining; if necessary, return the dough to the mixer and mix briefly again. Pat the dough into a 7- to 8-inch disk and wrap in plastic. Refrigerate for at least 1 hour or up to a day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly brush the inside of a 9-by-2-inch removable-bottom tart pan with canola oil and place it on a jelly roll pan. Place the dough on a floured work surface and rub on all sides with flour. Flatten it into a larger circle using a rolling pin or the heel of your hand. Roll the rolling pin back and forth across the dough a few times, then turn it 90 degrees and roll again. Continue to turn and roll until the dough is 1/4-inch thick and about 14 inches in diameter. (If the kitchen is hot and the dough has become very soft, move it to a baking sheet and refrigerate for a few minutes.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To lift the dough into the tart pan, place the rolling pin across the dough about one-quarter of the way up from the bottom edge, fold the bottom edge of the dough up and over the pin, and roll the dough up on the rolling pin. Lift the dough on the pin and hold it over the pan, centering it. Carefully lower the dough into the pan, pressing it gently against the sides and into the bottom. Trim any dough that extends more than an inch over the sides of the pan and reserve the scraps. Fold the excess dough over against the outside of the ring. (Preparing the quiche shell this way will prevent it from shrinking down the sides as it bakes. The excess dough will be removed after the quiche is baked.) Carefully check for any cracks or holes in the dough, and patch with the reserved dough as necessary. Place in the refrigerator or freezer for at least 20 minutes to resolidify the butter. Reserve the remaining dough scraps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a rack in the middle of the oven and heat the oven to 375&deg;F. Line the quiche shell with a 15-inch round of parchment paper. Fill the shell with pie weights or dried beans, gently guiding the weights into the corners of the shell and filling the shell completely. Bake the shell until the edges of the dough are lightly browned but the bottom is still light in color, 35 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the parchment and weights. Check the dough for any new cracks or holes and patch with thin pieces of the reserved dough if necessary. Return the shell to the oven until the bottom is a rich golden brown, 15 to 20 minutes. Remove from the oven and allow the shell to cool completely on the jellyroll pan. Once again, check the dough for any cracks or holes, and patch if necessary before filling with the quiche batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Quiche:</strong> Combine the milk and cream in a large saucepan and heat over medium heat until scalded (meaning a skin begins to form on the surface). Remove from heat and set aside to cool slightly, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 3 eggs, half the milk and cream mixture, 1 1/2 teaspoons salt, 1/8 teaspoon pepper and 3 gratings of nutmeg in a blender and blend on low speed about 5 seconds to mix thoroughly, then increase the speed to high and blend until the batter is light and foamy, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This is the first layer of the quiche. Once you have assembled it, add the remaining ingredients to the blender and repeat the process to complete the quiche.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 1 hour, 15 minutes, until the top of the quiche is browned and the custard is set when the pan is jiggled. Remove the quiche from the oven and let stand 15 minutes before serving, or cool, then refrigerate until chilled, at least 1 day, or up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the quiche is thoroughly chilled, using a metal bench scraper or a sharp knife, scrape away the excess crust from the top edge. Place a large bowl upside down on a work surface and place the quiche pan on top of that. Gently remove the outside ring, working it free in spots with a small knife if necessary. Return to the refrigerator until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, heat the oven to 375&deg;F. Line a baking sheet with lightly oiled parchment paper. Using a long serrated knife, and supporting the sides of the crust with your opposite hand, carefully cut through the edge of the crust in a sawing motion. Switch to a long slicing knife and cut through the custard and bottom crust. Repeat, cutting the quiche into 8 to 10 pieces. Place the pieces on the baking sheet and reheat for 15 minutes or until hot throughout. To check, insert a metal skewer into the quiche for several seconds and then touch the skewer to your lip to test the temperature of the quiche.</p>"}]}