{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Asian", "Chinese", "Gourmet magazine", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gourmet's Smoked-Oyster Sticky Rice Stuffing in Lotus Leaf", "link": "https://www.seriouseats.com/recipes/2007/11/gourmets-smoked-oyster-sticky-rice-stuffing-in-lotus-leaf-recipe.html", "description": "This stuffing, loaded with mushrooms, smoked oysters, and sweet, fatty Chinese sausage, sounds like a meal in itself. In our interview with Gourmet magazine's editor-in-chief Ruth Reichl about the magazine's approach to Thanksgiving this year, she recommends this recipe, describing...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["3 cups Asian short-grain sticky (\"sweet\") rice (1 pound 6 ounces) ", "12 Chinese dried black mushrooms or dried shiitake mushrooms  (1 1/2 inches in diameter; 3 ounces) ", "2 cups boiling-hot water ", "2 bunches scallions ", "4 links Chinese sweet sausage (also called lop chong) ", "1/2 cup Chinese rice wine, such as Shaoxing, or medium-dry Sherry ", "2 tablespoons soy sauce ", "1 tablespoon sugar ", "1 tablespoon Asian sesame oil ", "3 dried lotus leaves (optional) ", "1 tablespoon peanut or vegetable oil ", "1/4 cup pine nuts (1 ounce) ", "1 tablespoon finely chopped peeled ginger ", "2 (3-ounce) cans smoked oysters (about 1 cup), drained and coarsely chopped ", "<strong>Equipment</strong>", "A 10-inch (5-cup) deep-dish pie plate; a well seasoned 14-inch flat-bottomed wok with a lid; 2 small metal or bamboo skewers; a collapsible steamer rack with center stem removed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover rice generously with cold water in a large bowl and soak at least 2 hours and up to 12 hours. Drain in a medium-mesh sieve and rinse well under cold running water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak mushrooms in boiling-hot water (2 cups) in a medium bowl, turning mushrooms over occasionally, until softened, about 1 hour. Lift out mushrooms, squeezing excess liquid back into bowl. Cut out and discard stems, then thinly slice caps. Reserve 1 cup mushroom-soaking liquid and discard remainder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop scallions, keeping pale green and white parts separate from dark green parts. Quarter sausages lengthwise, then cut into 1/2-inch pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together reserved mushroom-soaking liquid, rice wine, soy sauce, sugar, sesame oil, 1 teaspoon salt, and 1/2 teaspoon pepper in a bowl until sugar has dissolved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill sink with hot water and soak 2 or 3 lotus leaves (if using) until softened, about 15 minutes. Pat lotus leaves dry. Choose best leaf (some leaves may be blemished or damaged), discarding remainder. Cut out center stem and arrange leaf in pie plate (there will be a lot of overhang), overlapping leaf slightly to cover gap in center. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a steamer rack inside cleaned wok and add enough water to reach just below steamer rack, then bring to a boil. Steam stuffing in pie plate on rack, covered with lid, 45 minutes (replenish water as necessary). Remove wok from heat and let stand, covered, 10 minutes, then carefully remove pie plate from steamer with oven mitts. Remove skewer and open leaf, then stir in scallion greens. Fold leaf over to keep warm. </p>"}]}