{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["bread salad", "chicken", "roast chicken", "Zuni Cafe", "Zuni roast chicken"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Best Roast Chicken Recipe? Who Wants to Try It With Me?", "link": "https://www.seriouseats.com/recipes/2007/09/the-best-roast-chicken-recipe-try-it-with-me.html", "description": "There's a hint of fall in the air, I'm feeling a tad frisky, so I'm finally going to tackle the Zuni Cafe roast chicken recipe. I've had Judy Rodgers' famous roast chicken and bread salad many times at her restaurant,...", "totalTime": null, "recipeYield": "2 to 4", "recipeCategory": ["Chicken", "Mains"], "recipeIngredient": ["One small chicken, 2 3/4 to 3 1/2 pounds", "4 tender sprigs fresh thyme, marjoram, rosemary, or sage, about 1/2 inch long", "Salt", "About 1/4 teaspoon freshly cracked black pepper", "A little water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Seasoning the chicken (1 to 3 days before serving; for 3 1/4 to 3 1/2 pound chickens, at least 2 days):  Remove and discard the lump of fat inside the chicken.  Rinse the chicken and pat very dry inside and out.  Be thorough--a wet chicken will spend too much time steaming before it begins to turn golden brown.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Approaching from the edge of the cavity, slide a finger under the skin of each of the breasts, making 2 little pockets.  Now use the tip of your finger to gently loosen a pocket of skin on the outside of the thickest section of each thigh.  Using your finger, shove an herb sprig into each of the 4 pockets.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken liberally all over with salt and the pepper (we use 3/4 teaspoon sea salt per pound of chicken). Season the thick sections a little more heavily than the skinny ankles and wings.  Sprinkle a little of the salt just inside the cavity, on the backbone, but don't otherwise worry about seasoning the inside.  Twist and tuck the wing tips behind the shoulders.  Cover loosely and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 475 degrees.  Depending on the size, efficiency, and accuracy of your oven, and the size of your bird, you may need to adjust the heat to as high as 500 degrees or as low as 450 degrees during the course of roasting the chicken to get it to brown properly.  If that proves to be the case, begin at that temperature the next time you roast a chicken.  If you have a convection function  on your oven, use it for the first 30 minutes; it will enhance browning, and may reduce overall cooking time by 5 to 10 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Choose a shallow flameproof roasting pan or dish barely larger than the chicken, or use a 10-inch skillet with an all-metal handle.  Preheat the pan over medium heat.  Wipe the chicken dry and set it breast side up in the pan.  It should sizzle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in the center of the oven and listen and watch for it to start sizzling and browning within 20 minutes.  If it doesn't, raise the temperature progressively until it does.  The skin should blister, but if the chicken begins to char, or the fat is smoiking, reduce the temperature by 25 degrees.  After about 30 minutes, turn the bird over (drying the bird and preheating the pan should keep the skin from sticking.)  Roast for another 10 to 20 minutes, depending on size, then flip back over to recrisp the breast skin, another 5 to 10 minutes.  Total oven time will be 45 minutes to an hour.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the oven and turn off the heat.  Lift the chicken from the roasting pan and set on a plate.  Carefully pour the clear fat from the roasting pan, leaving the lean drippings behind.  Add about a tablespoon of water to the hot pan and swirl it.  Slash the stretched skin between the thighs and breasts of the chicken, then tilt the bird and plate over the roasting pan to drain the juice into the drippings.  Set the chicken in a warm spot (which may be your stovetop), and leave to rest.  The meat will become more tender and uniformly succulent as it cools.  Tilt the roasting pan and skim the last of the fat.  Place over medium-low heat, add any juice that has collected under the chicken, and bring to a simmer.  Stir and scrape to soften any hard golden drippings.  Taste--the juices will be extremely flavorful.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the chicken into pieces and pour the pan drippings over the chicken.  </p>"}]}