{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-thinklikeachef.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Cook the Book", "onions", "stocks", "Think Like a Chef", "Tom Colicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Onion Confit", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-onion-confit-recipe.html", "description": "If you're a fan of sweet caramelized onions, you'll love Tom Colicchio's onion confit. He takes caramelized onions to the next level by simmering them in chicken stock and vinegar for half an hour after the onions have already caramelized,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Condiments and Sauces", "Cook the Book"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil ", "6 onions, peeled and thinly sliced (about 12 cups) ", "Kosher salt and freshly ground black pepper ", "1 cup <a href=\"#stock\">White Chicken Stock</a> (recipe below)", "2 tablespoons white wine vinegar ", "2 tablespoons fresh thyme leaves ", "4 anchovy fillets, chopped (optional) ", "4 pounds chicken bones or 4 pounds chicken legs, wings, and backs ", "1 onion, peeled and quartered ", "1 carrot, peeled and coarsely chopped ", "2 stalks celery, coarsely chopped ", "2 leeks, white parts only, trimmed and chopped ", "1 bay leaf ", "Peppercorns ", "3 to 4 sprigs fresh flat-leaf parsley ", "3 to 4 sprigs fresh thyme "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large deep skillet over medium heat until it slides easily across the pan. Add the onions and salt and pepper. Reduce the heat to medium-low and cook, stirring occasionally, until the onions are very soft but not brown, about 30 minutes. Add the stock and vinegar and simmer, continuing to stir occasionally, until the pan is dry and the onions are golden, about 30 minutes more. Add the thyme leaves and anchovies (if using) and mix well. Serve warm or at room temperature. The confit should be refrigerated and will last at least a week. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"stock\"></a><h4>White Chicken Stock</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse chicken bones or chicken parts well. Remove the fat and skin if any, and place into a pot with just enough hot water to cover. Bring to a boil over medium-high heat and let boil for about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the chicken and discard the water (see sidenote). Return the chicken to the pot, cover with fresh water and bring to a simmer over medium-high heat. Reduce the heat to medium and gently simmer the stock for about 1 hour, skimming whenever fat or scum accumulates on the surface. Add more hot water if necessary to keep the level consistent. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onion, carrot, celery, leeks, bay leaf, and peppercorns. Simmer for 15 minutes. Add the parsley and thyme and simmer for an additional 5 minutes. Take the pot off the heat and strain the stock. Cool, and refrigerate for up to 5 days or freeze for up to 4 months. </p>"}]}