{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110504-macarons-in-oven.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "French", "keywords": ["baking", "chocolate", "Cookies", "French", "macarons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "How to Make Macarons", "link": "https://www.seriouseats.com/recipes/2007/10/how-to-make-macarons-recipe.html", "description": "I'm ashamed to admit that while I have eaten many macarons, I've never made them on my own. Thankfully, plenty of other people much more skilled in the culinary arts than I am have bravely attempted to make macarons in their home kitchens and have shared their results.", "totalTime": "", "recipeYield": "makes 30-50 macaron sandwiches / ganache recipe makes about 2 cups (550 grams)", "recipeCategory": ["Desserts", "French"], "recipeIngredient": ["<strong>Basic Macaron Cookie:</strong>", "225 grams icing sugar", "125 grams ground almonds", "110 grams egg whites (about 4), aged overnight at room temperature", "30 grams granulated sugar", "Pinch of salt", " ", "<strong>Bittersweet Chocolate Cream Ganache:</strong>", "8 ounces (230 grams) bittersweet chocolate, preferably Valrhona Guanaja, finely chopped", "1 cup (250 grams) heavy cream", "4 tablespoons (2 ounces; 60 grams) unsalted butter, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On three pieces of parchment, use a pencil to draw 1-inch (2.5 cm) circles about 2 inches apart. Flip each sheet over and place each sheet on a baking sheet.  [Note: You only have to draw circles on the parchment paper if you want absolutely even-sized macarons.  If you're skilled with piping and don't mind eyeballing the amount of batter per cookie, skip this step.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push almond flour through a tamis or sieve, and sift icing sugar. Mix the almonds and icing sugar in a bowl and set aside. If the mixture is not dry, spread on a baking sheet, and heat in oven at the lowest setting until dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large clean, dry bowl whip egg whites with salt on medium speed until foamy. Increase the speed to high and gradually add granulated sugar. Continue to whip to stiff peaks&mdash;the whites should be firm and shiny.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a flexible spatula, gently fold in icing sugar mixture into egg whites until completely incorporated. The mixture should be shiny and 'flow like magma.' When small peaks dissolve to a flat surface, stop mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit a piping bag with a 3/8-inch (1 cm) round tip. Pipe the batter onto the baking sheets, in the previously drawn circles.  Tap the underside of the baking sheet to remove air bubbles. Let dry at room temperature for 1 or 2 hours to allow skins to form. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, in a 160&deg;C/325&deg;F oven for 10 to 11 minutes. Use a wooden spoon to keep the oven door slightly ajar, and rotate the baking sheet after 5 minutes for even baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove macarons from oven and transfer parchment to a cooling rack. When cool, slide a metal offset spatula or pairing knife underneath the macaron to remove from parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pair macarons of similar size, and pipe about 1/2 tsp of the filling onto one of the macarons. Sandwich macarons, and refrigerate to allow flavors to blend together. Bring back to room temperature before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bittersweet Chocolate Cream Ganache:</strong> Place the chocolate in a bowl that's large enough to hold the ingredients and keep it close at hand.  Bring the cream to a full boil in a heavy-bottomed saucepan.  While the cream is coming to the boil, work the butter with a rubber spatula until it is very soft and creamy.  Keep the butter aside for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cream is at the boil, remove the pan from the heat and, working with the rubber spatula, gently stir the cream into the chocolate.  Start stirring in the center of the mixture and work your way out in widening concentric circles.  Continue to stir&mdash;without creating bubbles&mdash;until the chocolate is completely melted and the mixture is smooth.  Leave the bowl on the counter for a minute or two to cool the mixture down a little before adding the butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the mixture in two additions, mixing with the spatula from the center of the mixture out in widening concentric circles.  When the butter is fully incorporated, the ganache should be smooth and glossy.  depending on what you're making with the ganache, you can use it now, leave it on the counter to set to a spreadable or pipeable consistency (a process that could take over an hour, depending on your room's temperature) or chill it in the refrigerator, stirring now and then.  (If the ganache chills too much and becomes too firm, you can give it a very quick zap in the microwave to bring it back to the desired consistency, or just let it stand at room temperature.)</p>"}]}