{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071022nosetotail.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["chocolate", "Cook the Book", "desserts", "Fergus Henderson", "Justin Piers Gellatly", "puddings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Hot Chocolate Pudding", "link": "https://www.seriouseats.com/recipes/2007/10/cook-the-book-fergus-henderson-st-john-hot-chocolate-pudding-recipe.html", "description": "I'd imagine this hot chocolate pudding would be an especially welcome dessert on a chilly day. (But who knows when that may be, what with the weird unseasonably warm weather that's befallen much of the U.S. lately). As the authors...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["250 grams plain chocolate, with at least 70% cocoa solids, cut into small chunks ", "250 grams unsalted butter, diced, plus extra for greasing ", "6 large eggs ", "5 large egg yolks ", "125 grams caster sugar, plus extra for dusting ", "75 grams plain flour "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease 8 individual ramekins or dariole molds (or one large ovenproof dish) with butter and dust with caster sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chocolate and butter in a heatproof bowl and place over a saucepan of simmering water, making sure the water doesn't touch the base of the bowl. Leave until melted. Meanwhile, using an electric mixer on full speed, whisk the eggs, yolks and sugar together for about 6 minutes, until they have at least tripled in volume. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour into a bowl and slowly pour on the melted chocolate and butter mixture, whisking constantly until a thin paste has formed. Fold this into the whisked egg mixture very carefully but quickly, as the chocolate will start to set. Pour into the prepared dishes and bake in an oven preheated to 350&deg;F/180&deg;C/Gas Mark 4, until risen and firm on the outside but soft in the center. The large one will take about 30 minutes to cook, the individual ones about 13 minutes. Serve with cr&egrave;me fra&icirc;che or ice cream and, if in season, some cherries. </p>"}]}