{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070809-easy-fruit-tart.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "desserts", "Dorie Greenspan", "fruit tarts", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: An Easy Fruit Tart", "link": "https://www.seriouseats.com/recipes/2007/08/dorie-greenspan-recipe-an-easy-fruit-tart.html", "description": "Before we dive into the sweet, crisp, creamy goodness of this post, we'd like to take a moment to introduce its author, Dorie Greenspan. You might already know her from her many cookbooks or her popular blog. She'll be joining...", "totalTime": null, "recipeYield": "6 servings", "recipeCategory": ["Baking With Dorie", "Desserts"], "recipeIngredient": ["Best-quality strawberry jam", "One 9-inch tart shell (<a href=\"#doriegreenspansweettartcrust\">see recipe below</a>), fully baked, cooled and removed from pan", "About 1 quart ripe strawberries", "Sugar (optional)", "Kirsch, fraise or framboise eau-de-vie or crème de cassis (optional)", "Freshly ground black pepper, a little fresh basil or mint, or finely grated lemon or lime zest (optional)", "Crème fraîche or lightly whipped cream", "1 1/2 cups all-purpose flour", "1/2 cup confectioner's sugar", "1/4 teaspoon salt", "1 stick plus 1 tablespoon (9 tablespoons; 4 1/2 ounces) very cold (or frozen) unsalted butter, cut into small pieces", "1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the jam to loosen it to a spreadable consistency or, if it's very stiff, warm it in a microwave oven for a few seconds.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut as many portions of the crust as you need, put each portion on a plate and spread the jam over the cut pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hull and half as many berries as you need (if they're really large, you might want to quarter them or slice them) and, if you think they need it, toss them with some sugar.  Add a splash of liqueur, if you'd like, and stir in the black pepper, basil, mint or zest, if you feel like it.  (Use a light touch with the extras – the berries are the main event and anything else should be there only to enhance their flavor.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the berries and any juices that have accumulated over the slices of crust.  Don't try to be neat – the berries should tumble over the sides of the crust.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with the cream or serve it alongside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> While you can bake the crust early in the day (or, in a pinch, the day before) and keep it at room temperature, and you can also cut and sugar the berries about an hour in advance, the tart should be assembled just before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Sweet Tart Crust</strong> <em>- makes enough for one 9-inch crust - </em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, sugar and salt in the bowl of a food processor and pulse a few times to combine.  Scatter the pieces of butter over the dry ingredients and pulse until the butter is coarsely cut in&#151;you should have pieces the size of oatmeal flakes and some the size of peas.  Stir the yolk, just to break it up, and add it a little at a time, pulsing after each addition.  When the egg is in, process in long pulses&#151;about 10 seconds each&#151;until the dough, which will look granular soon after the egg is added, forms clumps and curds.  Just before you reach this stage, the sound of the machine working the dough will change&#151;heads up.  Turn the dough out onto a work surface and, very lightly and sparingly, knead the dough just to incorporate any dry ingredients that might have escaped mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To roll or press the dough into the pan:  Butter a 9-inch fluted tart pan with a removable bottom.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want to roll the dough, chill it for about 2 hours before rolling (unless you've used frozen butter and the dough comes out of the processor firm and cold, in which case you can roll it immediately).  I find it easiest to roll this dough out between two sheets of plastic film – make sure to peel away the film frequently, so it doesn't get rolled into the dough. If you want to use the press-in method, you can work with the dough as soon as it's processed.  Just press the dough evenly over the bottom and up the sides of the pan.  Don't be too heavy-handed – press the crust in so that the edges of the pieces cling to one another, but don't press so hard that the crust loses its crumbly texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze the crust for at least 30 minutes, preferably longer, before baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fully bake the crust:  Center a rack in the oven and preheat the oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter the shiny side of a piece of aluminum foil (or use nonstick foil) and fit the foil, buttered side down, tightly against the crust.  (Since you froze the crust, you can bake it without weights.)  Put the tart pan on a baking sheet and bake the crust for 25 minutes.  Carefully remove the foil.  If the crust has puffed, press it down gently with the back of a spoon (or prick it with the tip of a small knife).  Bake the crust for another 8 minutes or so, or until it is firm and golden brown, brown being the important word: a pale crust doesn't have a lot of flavor.  Transfer the pan to a rack and cool the crust to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> The dough can be wrapped and kept in the refrigerator for up to 5 days or frozen for up to 2 months.  While the fully baked crust can be packed airtight and frozen for up to 2 months, I prefer to freeze the unbaked crust in the pan and bake it directly from the freezer – it has a fresher flavor.  Just add about 5 minutes to the baking time.</p>"}]}