{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-thinklikeachef.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Cook the Book", "leeks", "potatoes", "soups", "Think Like a Chef", "Tom Colicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Diced Potato-Leek Soup", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-diced-potatoleek-soup-recipe.html", "description": "Soup rarely appeals to me (too much liquid, not enough chewing), but when the weather is bitterly cold (like now), nothing fills up your inner crevices as well as a bowl of hot, chunky soup. Tom Colicchio's simple diced potato-leek...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Bacon", "Cook the Book"], "recipeIngredient": [], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split the leeks lengthwise, then slice into thin semicircles. Cut the bacon and potatoes into a small dice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large saucepan over medium heat until it slides easily across the pan. Add the bacon and cook until it is rendered but not yet crisp, about 2 minutes. Add the leeks, salt, and pepper and cook, stirring frequently, until the leeks just begin to soften, about 3 minutes. Reduce the heat to medium-low and add the potatoes. Cook, stirring frequently, until the potatoes soften slightly, 3 to 5 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough stock to moisten the vegetables, about 1/2 cup. Bring the soup to a simmer, then add another 1/2 cup of stock. Continue gradually adding the stock, 1/2 cup at a time, until it has all been added. Gently simmer the soup until the potatoes are tender (about 10 minutes from the time you begin adding stock), then stir in the butter and chives. Add salt and pepper and serve immediately. </p>"}]}