{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070917puredessert.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "books", "cake", "chocolate", "Cook the Book", "cookbooks", "CTB: Pure Dessert", "desserts", "tortes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Italian Chocolate-Almond Torte", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-italian-chocolatealmond-torte.html", "description": "Alice Medrich, author of Pure Dessert, from which this recipe comes, took inspiration for this Italian Chocolate-Almond Torte from Claudia Roden's torta di mandorle e cioccolata in Roden's Book of Jewish Food. The chocolate in this torte is ground, rather...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["1 cup (5 ounces) unblanched or blanched whole almonds ", "7 ounces good-quality unsweetened chocolate, roughly chopped ", "1 cup sugar ", "1/8 teaspoon salt ", "7 large egg whites (1 cup) ", "1/4 teaspoon cream of tartar ", "Powdered sugar or unsweetened cocoa powder for dusting ", "Sweetened whipped cream for serving (optional) ", "<h5>Equipment</h5>", "A 9-inch springform pan or a 9 by 3-inch round pan with a removable bottom "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the lower third of the oven and preheat the oven to 350&deg;F. Grease the sides of the springform pan and line the bottom with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the almonds. chocolate, 1/2 cup of the sugar, and the salt in a food processor and pulse until the almonds and chocolate are very finely chopped but not completely pulverized.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the clean dry bowl of a stand mixer or using a hand-held mixer and a large bowl, beat the egg whites with cream of tarter until soft, moist peaks are formed when the beaters are lifted. Gradually add the remaining 1/2 cup sugar and continue to beat until the egg whites are stiff but not dry. Add one-third of the nut mixture to the egg whites and fold in with a large rubber spatula until nearly incorporated. Fold in half of the remaining nuts, then fold in the rest of the nuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the batter into the prepared pan and spread it evenly. Bake until the torte has risen and is golden brown on top and a toothpick inserted in the center of the cake comes out clean, or with a little melted chocolate, 25 to 30 minutes. Set the pan on a rack to cool for 10 minutes. Remove the sides of the pan and invert the cake onto the rack. Remove the bottom of the pan and then the parchment liner. Turn the cake right side up and cool completely. Cover or wrap tightly, and store for up to 3 days at room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, transfer the cake to a serving plate. Dust with powdered sugar or cocoa, and serve slices with a dollop of whipped cream, if desired. </p>"}]}