{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071217-msclassicsoriginal.jpg", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["Cook the Book", "lasagna", "Martha Stewart", "Martha Stewart Original Classics", "mushrooms", "pasta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Wild Mushroom and Spinach Lasagna", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-wild-mushroom-and-spinach-lasagna-recipe.html", "description": "Every Thursday night back at my Williams College abode, everyone in my house clears their busy schedules to get together and cook a potluck feast. We hardly get to eat with everyone together during the week so we like to...", "totalTime": "", "recipeYield": "10 to 12", "recipeCategory": ["Cook the Book", "Healthy and Delicious", "Lasagna", "Mains", "Mushrooms", "Vegetarian"], "recipeIngredient": ["1 cup (2 sticks) unsalted butter", "3 garlic cloves, finely sliced", "5 pounds fresh spinach, washed, stems removed", "1 pound ricotta cheese", "2 tablespoons kosher salt", "1 3/4 teaspoons freshly ground black pepper ", "3 pounds wild mushrooms (such as chanterelle, oyster, and shiitake), wiped. clean, trimmed, cut into 1-inch pieces", "3/4 cup Madeira wine", "1/2 cup chopped fresh flat-leaf parsley", "1 quart plus 1/2 cup milk", "1/2 cup all-purpose flour", "1/2 teaspoon ground nutmeg", "1 cup (3 ounces) grated Pecorino Romano cheese", "1 1-pound package fresh spinach lasagna sheets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon butter in large pan over medium heat. Add half the garlic; cook until light golden, about 2 minutes. Add half the spinach leaves, cover, and cook, stirring occasionally, until wilted, about 5 minutes. Drain the spinach in a colander. Repeat with another tablespoon of the butter and the remaining garlic and spinach. When the spinach is cool enough to handle, squeeze to extract all the liquid. Roughly chop the spinach; place in a medium bowl. Add the ricotta, 2 teaspoons salt, and 1 teaspoon pepper; mix well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons butter in a large skillet over medium heat. Add one third of the mushrooms; season with 1 teaspoon salt and ¼ teaspoon pepper. Cook until the mushrooms are softened and browned, about 10 minutes. Pour ¼ cup Madeira into the hot skillet with mushrooms, and use a wooden spoon to loosen any browned bits cooked onto the skillet. Cook the mushrooms until the liquid had almost evaporated. Transfer mushrooms to a medium bowl. Repeat with another 2 tablespoons butter, another third of the mushrooms, and ¼ cup Madeira. (Reserve remaining mushrooms and Madeira for the topping.) Stir in two-thirds of the chopped parsley with the mushrooms. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan over medium heat, heat 1 quart milk. Melt 1 stick butter in a medium saucepan over medium heat. When the butter bubbles, sprinkle in the flour; cook, whisking constantly, until the mixture bubbles and becomes thick. Remove the pan from the heat. Stir in 2 teaspoons salt, 1 teaspoon pepper, the nutmeg, and ½ cup grated cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Set aside ½ cup of the sauce. Assemble the lasagna: Spread ½ cup of the sauce in the bottom of a 9 x 13-inch roasting pan. Place a layer of lasagna sheets in the pan, trimming to fit; spread 1 cup of the spinach mixture, 1 cup of the mushrooms mixture, and ½ cup of the sauce on top of the lasagna sheets. Repeat the layers several times. For the last layer, place lasagna sheets on top; spread ½ cup of the sauce over the sheets. Sprinkle with the remaining ½ cup grated cheese. Bake until the top is golden brown, 1 to  1 ¼ hours. Let stand 20 minutes before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, melt the remaining 2 tablespoons butter in the skillet over medium heat. Add the remaining third of the uncooked mushrooms; season with 1 teaspoon salt and 1/4 teaspoon pepper. Cook until golden and tender, about 10 minutes. Add the remaining 1/4 cup Madeira, and stir with a wooden spoon to loosen any cooked-on bits from the bottom of the pan. Stir in the remaining fresh parsley. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine the reserved 1/4 cup of sauce with the remaining 1/2 cup of milk. Over medium heat, whisk until warm and smooth. Spoon the cooked mushrooms over each serving, or serve on the side. Serve the lasagna hot with the sauce. </p>"}]}