{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Recipe: North Carolina-Style Pulled Pork", "link": "https://www.seriouseats.com/recipes/2007/09/north-carolinastyle-pulled-pork.html", "description": "There is no higher form of pork cooking than slow-smoked North Carolina pulled pork. The result of cooking a pork butt or whole shoulder at a very low temperature for a long time, pulled pork is so named because it's...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mains", "Pork"], "recipeIngredient": ["Pork butt, Boston butt, or untrimmed end-cut pork shoulder roast, 7 to 9 pounds", "Olive oil", "Kosher Salt", "Freshly ground pepper", "Hickory wood chips, soaked in water for 30 minutes", "Lexington-Style Vinegar Sauce (recipe below)", "North Carolina Coleslaw (recipe below)", "8 plain white hamburger buns", "2 cups apple cider vinegar", "1/2 cup ketchup", "1/4 cup packed brown sugar", "2 tablespoons sugar", "1 tablespoon kosher salt", "1 tablespoon ground white pepper", "1/2 to 1 tablespoon red pepper flakes", "1/2 teaspoon freshly ground black pepper", "1 recipe Lexington-Style Vinegar Sauce", "1 medium head green cabbage, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Build a charcoal or gas grill for indirect cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Do not trim any excess fat off the meat; this fat will naturally baste the meat and keep it moist during the long cooking time. Brush pork with a thin coating of olive oil. Season with salt and pepper. Set aside on a clean tray until ready to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Before placing the meat on the grill, add the soaked wood chips. Place the chips directly on gray-ashed briquettes or in the smoking box of your gas grill. If you are using a charcoal grill, you will need to add charcoal every hour to maintain the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Place the pork in the center of the cooking grate, fat-side up, over indirect low heat. Cover and cook slowly for 4 to 5 hours at 325&deg;F to 350&deg;F, or until an instant-read thermometer inserted into the middle of the pork registers 190&deg;F to 200&deg;F. The meat should be very tender and falling apart. If there is a bone in the meat, it should come out smooth and clean with no meat clinging to it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Let the meat rest for 20 minutes or until cool enough to handle. Using rubber kitchen gloves, pull the meat from the skin, bones, and fat. Set aside the crispy bits (fat) that have been rendered and look almost burned. Working quickly, shred the chunks of meat with 2 forks and \"pulling\" the meat into small pieces from the butt. Alternately, you can chop the meat with a cleaver. Chop the reserved crispy bits and mix into the pulled pork. While the meat is still warm, mix with enough Lexington-Style Vinegar Sauce to moisten and season the meat (about 3/4 cup). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Serve hot, sandwich-style on a hamburger bun and top with coleslaw. Serve more sauce on the side if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Lexington-Style Vinegar Sauce</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- Makes about 3 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all ingredients together in a large nonreactive  bowl and let sit at least 10 minutes or almost indefinitely, covered in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>North Carolina Coleslaw</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- Makes about 3 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the sauce and cabbage together until well mixed and not quite wet. You may have sauce left-over. Refrigerate. Let sit for at least 2 hours or overnight before serving.</p>"}]}