{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071217-msclassicsoriginal.jpg", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["Asian", "Chinese", "Cook the Book", "dumplings", "Martha Stewart", "Martha Stewart Original Classics"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pork and Vegetable Dumplings", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-pork-and-vegetable-dumplings-recipe.html", "description": "During the holidays, for a lot of families, it’s tradition to get together to bake cookies and other sweet goodies. I’ve never made cookies with my family, but so much of my childhood was spent making countless dumplings and wontons...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 pounds bok choy", "8 ounces ground pork", "1 large egg", "1 teaspoon cornstarch, plus more for dusting", "1 tablespoon canola oil", "1/2 cup plus 1 tablespoon soy sauce ", "1 teaspoon freshly grated ginger", "2 teaspoons Asian fish sauce (nam pla), optional", "1/2 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper ", "1 12-ounce package round dumpling wrappers", "2 1/2 teaspoons sugar", "1 1/2 tablespoons dark sesame oil", "2 tablespoons thinly sliced scallion greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and bring a large saucepan of water to a boil. Prepare an ice-water bath. Add the whole heads of bok choy to the pan, and gently boil until tender, about 3 minutes. Using a slotted spoon, remove the bok choy from saucepan, and plunge into the ice-water bath. Drain, discarding the liquid, and finely chop. Place the bok choy in a clean kitchen towel or a double thickness of cheese cloth, and squeeze out all the water. Transfer to a bowl, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the pork, egg, cornstarch, oil, 1 tablespoon soy sauce, the ginger, the fish sauce if using, salt, and pepper. Add the chopped bok choy, and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust a baking sheet with cornstarch. Make dumplings (*for assemblage directions, see below). Place completed dumplings on the baking sheet; cover with a damp towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and bring a large pot of water to a boil. Add as many dumplings as will fit without crowding. Gently stir them up from the bottom to prevent sticking, cover, and return to a boil, about 1 minute. Uncover, add 1/4 cup cold water, replace the cover, and return the water to a boil. Boil for about 2 minutes more. Remove dumplings with a slotted spoon, and keep warm. Continue until all the dumplings are cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the dipping sauce by combining the remaining soy sauce, sugar, sesame oil, and scallion. Mix well, transfer to small serving dishes, and serve with the warm dumplings. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Making Dumplings</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fill dumplings, place a wrapper in one hand, and spoon about 1 tablespoon of the filling into the middle of the wrapper. Moisten the edges with water. Fold to form a crescent shape around filling. There are two ways to shape dumplings: For a smooth edge, tightly pinch the edges closed. For a pleated edge, pinch the edges together only in the top center to seal. Pinch 6 small pleats  (3 on either side of the sealed center point) along the top layer. Seal dumplings by pressing pleated and unpleated edges together. </p>"}]}