{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "pancakes", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Great, Great, Pancakes", "link": "https://www.seriouseats.com/recipes/2007/10/sunday-brunch-great-great-pancakes.html", "description": "At our house Sunday brunch or breakfast (depending on how early my wife gets up) is the perfect excuse to whip up a batch of featherlight pancakes with a crispy veneer and tender insides. This recipe is adapted from Pam...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pancake"], "recipeIngredient": ["1 cup all-purpose bleached flour (softer than unbleached flour)", "2 tsps. sugar", "3/4 tsp. salt", "1/2 tsp. baking powder", "1/4 tsp. baking soda", "3/4 cup buttermilk", "1/4 cup milk", "1 large egg", "2 Tbs. unsalted butter, melted", "1 tsp. vanilla extract", "Vegetable oil for brushing the griddle"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large non-stick skillet or griddle over low heat while preparing ingredients. Mix flour, sugar, salt (if using salted butter, reduce salt to 1/4 tsp.), baking powder and baking soda in a medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Microwave buttermilk and milk in a 2-cup Pyrex measuring cup to room temperature, 20 to 30 seconds. Whisk in egg, butter and vanilla. Add wet ingredients to dry ingredients and whisk until just mixed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return batter to measuring cup, stirring in a teaspoon or so of water, if necessary, to make a thick but pourable batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to medium and generously brush skillet or griddle with oil. When oil starts to spider, but before it starts to smoke, pour batter, about 1/4 cup at a time. Work in batches, if necessary, to avoid overcrowding. When pancake bottoms are golden brown and tops start to bubble, 2 to 3 minutes, flip pancakes; cook until golden brown on remaining side. Repeat, brushing skillet or griddle with oil. Serve hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Variations</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Lemon Poppy Seed Pancakes</strong>: Follow pancake recipe, whisking 1 tsp. of finely grated lemon zest and 1 tsp. of poppy seeds into the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Orange Cardamom Pancakes</strong>: Follow pancake recipe, whisking 1 tsp. of finely grated orange zest and 1/4 tsp. ground cardamom into the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Gingerbread Pancakes</strong>: Follow pancake recipe, substituting 4 tsps. of molasses for the sugar and adding it to the wet ingredients, then whisking 1/2 tsp. ground cinnamon, 1 1/2 tsps. ground ginger and 1/8 tsp. ground cloves into the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Chip Pancakes</strong>: Follow pancake recipe, sprinkling 1 Tb. of miniature chocolate chips over the uncooked side of each pancake as it cooks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Ginger Pancakes</strong>: Follow pancake recipe, whisking 1 tsp. ginger into the dry ingredients and sprinkling 1 Tb. of finely chopped crystallized ginger (about 1/2 cup total) over the uncooked side of each pancake as it cooks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Almond Pancakes</strong>: Follow pancake recipe, substituting 1 tsp. almond extract for the vanilla extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Corn Pancakes</strong>: Follow pancake recipe, reducing flour to 3/4 cup and whisking 1/2 cup fine yellow cornmeal into dry ingredients, and sprinkling 2 Tbs. of frozen corn (about 1 cup total) over the uncooked side of each pancake as it cooks.</p>"}]}