{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["beans", "black beans", "rice", "soups", "Sunday Night Soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: Cuban Black Beans and Rice", "link": "https://www.seriouseats.com/recipes/2007/12/cuban-black-beans-and-rice-soup-recipe.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week's upcoming Sunday Night Football game on NBC. This weekend, Sunday Night Soups returns to its NFC East comfort zone. The Redskins...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beans and Pulses", "Mains", "Rice", "Soups and Stews"], "recipeIngredient": ["1 pound dried black beans, preferably turtle beans ", "6 cups cold water ", "2 small ham hocks, about 1 1/4 pounds  (get smoked ones, if you can)", "1/2 cup olive oil", "3 1/2 cups finely chopped yellow onions", "1 1/2 cups chopped green peppers ", "2 tablespoons finely minced garlic", "2 bay leaves ", "1/4 teaspoon dried hot red-pepper flakes ", "3 tablespoons red-wine vinegar", "Salt, to taste", "Freshly ground black pepper, to taste ", "1/4 teaspoon cayenne pepper", "1/4 teaspoon Tabasco sauce ", "1/2 cup dark rum", "Cooked white rice ", "2 white onions", "Onions for black beans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the beans in a bowl with the six cups of cold water. Cover and let stand overnight. Make sure you have enough water to cover well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans, reserving the water in which they soaked. Measure the water and add enough additional water to make eight cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the beans, water and ham hocks in a small kettle or large saucepan and bring to the boil. Cook over low heat, uncovered, skimming the surface as necessary to remove any foam. Stir and make sure beans are not burning or sticking. The beans should cook until tender, four to six hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the oil in a skillet and add the onions and green peppers. Cook, stirring, until the mixture is wilted. Add the garlic and cook briefly, stirring. After the beans have cooked about two hours, add the mixture to the beans. Add the bay leaves, pepper flakes, vinegar, salt and pepper. While the beans cook, finely chop two white onions, and toss with about a teaspoon each of salt and sugar, and a splash of white wine vinegar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the beans are almost tender, add rum, uncover and continue cooking 30 minutes. Be vigilant at this stage, for you want the beans not too soupy, but you do not want to burn them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ham hocks. When they are cool enough to handle, remove and discard the skin, fat, bones and gristle. Shred the meat and return it to the beans. (You need the hocks for flavor during the cooking, but effort/reward ratio for taking the edible meat off the hocks is between you and your conscience. One benefit of skipping this step is that the finished product is \"vegetarian,\" if like some folks I know [Hi, mom!] your definition of \"vegetarian\" is \"no big pieces of meat.\" ) Remove the bay leaves. Add the cayenne pepper and Tabasco. Serve with white rice.</p>"}]}