{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dorie-honey.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "cakes", "Dorie Greenspan", "Pierre Herme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Pierre Herm&eacute;’s Fruit and Spice Loaf Cake", "link": "https://www.seriouseats.com/recipes/2007/12/baking-with-dorie-pierre-hermes-fruit-and-spice-loaf-cake-recipe.html", "description": "I’m in Paris now where the sweet you see in every pastry shop and bakery this time of year is pain d’&eacute;pices. Sometimes translated as spice bread or likened to gingerbread, I think pain d’&eacute;pices comes closer to honey cake...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Baking With Dorie", "Desserts", "Vegetarian"], "recipeIngredient": ["3/4 cup plus 2 tablespoons water", "10 pieces star anise", "1/3 cup honey", "5 1/2 tablespoons (2 3/4 ounces) unsalted butter, melted", "2 1/4 cups all-purpose flour", "1/4 cup rye flour", "2 1/2 teaspoons baking powder", "1 tablespoon cinnamon", "1 teaspoon ginger", "1 teaspoon freshly ground black pepper", "1/2 teaspoon ground coriander", "1/2 teaspoon ground cardamom", "1/2 teaspoon freshly grated nutmeg", "2/3 cup coarsely chopped walnuts", "1/3 cup sliced blanched almonds, toasted", "13 pitted, moist prunes, cut into 1/4-inch cubes", "13 moist, plump dried apricots, cut into 1/4-inch cubes", "Zest of 1 lemon&mdash;removed with a zester and finely chopped", "Zest of 1 orange&mdash;removed with a zester and finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the water and star anise in a saucepan over high heat, or in a microwave-safe container in the microwave oven, and bring to the boil. Remove from the heat, cover and infuse for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 300 degrees F. Very lightly spray an 8 x 4 x 2 1/2 inch loaf pan with vegetable oil spray and then line the pan with parchment paper; set aside until needed. Prepare an insulating layer for the cake by stacking two baking sheets, one on top of the other, or use an insulated (air-cushioned) baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the honey and melted butter together in a medium bowl, then strain the star anise-infused water into the bowl (discard the star anise). Stir to blend and then set the bowl aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the all-purpose flour, rye flour, baking powder and spices together into a large bowl. In another bowl, stir together the nuts, dried fruits and zests. Add 1 tablespoon of the dry ingredients to the nuts and fruits and toss to coat the ingredients lightly with the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the honey mixture into the bowl with the flour and spices and stir gently with a wooden spoon or large rubber spatula. Treat this batter as you would a quick bread or muffin mixture&mdash;stir it only until the dry ingredients are moistened. Add the nuts and fruits and lightly stir them into the batter&mdash;thoroughness isn’t important here. (The batter will be very thick, more like a quick bread dough than a cake batter.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the batter into the pan and bake for 65 to 75 minutes, or until a thin knife inserted deeply into the cake comes out clean. Transfer the cake to a cooling rack and unmold it, then invert it to cool to room temperature right side up. When the cake is absolutely cool&mdash;this can take a couple of hours&mdash;wrap it in a double thickness of plastic wrap and allow it to “ripen” for a day before slicing and serving in very thin slices. (Of course, you can eat it now, if you want to.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Wrapped airtight, the cake will keep for about 4 days at room temperature or for up to 2 months in the freezer.</p>"}]}