{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Patricia Wells", "recipes", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Recipe: Patricia Wells's Risotto", "link": "https://www.seriouseats.com/recipes/2007/03/recipe-patricia-wellss-risotto.html", "description": "Saffron Risotto...", "totalTime": "", "recipeYield": "Makes 4-6 servings.", "recipeCategory": [], "recipeIngredient": ["About 5 cups chicken stock, preferably homemade", "A pinch (about ¼ teaspoon) saffron threads", "4 tablespoons (2 ounces) unsalted butter", "1 tablespoon extra-virgin olive oil", "2 shallots, minced", "Sea salt to taste", "1 1/2 cups Italian Arborio rice", "1/2 cup freshly grated Parmigiano-Reggiano cheese, plus additional for the table"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, heat the stock and keep it simmering, at barely a whisper, while you prepare the risotto.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a measuring cup with a spout, combine ½ cup of the hot stock and the saffron. Stir to infuse and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heavy-bottomed saucepan, combine 2 tablespoons of the butter, the oil, shallots, and salt over moderate heat. Cook, stirring, until the shallots are soft and translucent, about 3 minutes. (Do not let the shallots brown.) Add the rice, and stir until the rice is well coated with the fats, glistening and semitranslucent, 1 to 2 minutes. (This step is important for good risotto: the heat and fat will help separate the grains of rice, ensuring a creamy consistency in the end.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rice becomes shiny and partly translucent, add a ladleful of the stock. Cook, stirring constantly, until the rice has absorbed most of the stock, 1 to 2 minutes. Add another ladleful of the simmering stock, and stir regularly until all of the broth is absorbed. Adjust the heat as necessary to maintain a gentle simmer. The rice should cook slowly and should always be covered with a veil of stock. Repeat the procedure, stirring frequently and tasting regularly, until the rice is almost tender but firm to the bite, about 17 minutes total. Add the saffron stock at the end. The risotto should have a creamy, porridge like consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the saucepan from the heat and stir in the remaining 2 tablespoons butter and the cheese. Cover and let stand off the heat for 2 minutes, to allow the flavor to blend. Taste for seasoning. Transfer to warmed shallow soup bowls, and serve immediately, passing additional cheese.</p>"}]}