{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Jenn Smith"}, "recipeCuisine": "", "keywords": ["apples", "cranberries", "dessert", "fall recipes", "thanksgiving", "Thanksgiving Easy Menu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple Cranberry Crisp with Pecan Topping", "link": "https://www.seriouseats.com/recipes/2007/11/apple-cranberry-crisp-with-pecan-topping-recipe.html", "description": "Can a Thanksgiving dessert be made entirely from scratch, but also be easy? I find making pie crusts to be a real challenge, and while there are some good store-bought options, another solution is to avoid pies altogether. This year...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Apple", "Cranberry", "Desserts"], "recipeIngredient": ["3 pounds apples (4 to 5 medium-large), such as Braeburn, Gala, Rome, or Honeycrisp", "1/2 teaspoon ground cinnamon", "1/2 pound (2 1/4 cups) fresh cranberries, picked over and rinsed", "1 teaspoon finely grated orange zest", "1 tablespoon unsalted butter", "3 tablespoons fresh orange juice ", "Pinch table salt", "1 cup granulated sugar Pecan Topping (see below)", "&nbsp", "<strong> For Pecan Topping </strong>", "5 3/4 ounces (1 1/4 cups) all-purpose flour ", "1/2 cup firmly packed light brown sugar ", "2 tablespoons granulated sugar", "1/2 teaspoon ground cinnamon", "1/4 teaspoon table salt", "1/2 cup (1 stick) cold unsalted butter, cut into 1/2-inch pieces", "3 ounces (3/4 cup) pecans, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 375 &deg; F. Butter the sides only of a 9-inch-square baking pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel, quarter, and core the apples. Cut each apple quarter crosswise into 3/4 inch thick slices. Put them in a large bowl, sprinkle on the cinnamon, and toss until evenly coated. Combine the cranberries and orange zest in a food processor and pulse until the cranberries are finely chopped, scraping the sides with a rubber spatula as needed. Add the cranberries to the apples and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter, orange juice, and salt in a small microwaveable dish or a small pan. Heat in the microwave or over medium-Iow heat until the butter melts, about 1 minute. Svvirl to blend, then pour over the apples, and toss to coat. Add the sugar and toss to coat again. Pour the apple mixture into the prepared pan and spread it evenly. Sprinkle the topping evenly on top of the apples.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a heavy-duty rimmed baking sheet with foil. Set the pan on the sheet and bake until the juices are bubbling on the sides, the top is golden brown, crisp, and hard, and the apples are tender when pierced with a fork, 60 to 70 minutes (rotate the pan for even browning, if necessary). If the top starts to get too brown after 45 minutes, cover it loosely with foil. Let cool on a wire rack for at least 30 minutes so the juices thicken. Serve warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Pecan Topping</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the flour, both sugars, cinnamon, and salt. Rub in the butter with your fingertips until it's well blended and the mixture is clumpy but still a bit crumbly (it should hold together if you pinch it). Mix in the pecans. Refrigerate until ready to use.</p>"}]}