{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070518choccorngrape-thumb.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["chocolate", "Cook the Book", "cookbooks", "CTB: Happy in the Kitchen", "desserts", "grapes", "Happy in the Kitchen", "Michel Richard", "popcorn", "recipes", "Serious Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chocolate Popcorn and Grapes", "link": "https://www.seriouseats.com/recipes/2007/05/chocolate-popcorn-and-chocloate-grape-recipe-michel-richard.html", "description": "And here's our final recipe of the week from Michel Richard's Happy in the Kitchen. Here, chocolate unexpectedly covers two familiar snacks--popcorn and grapes....", "totalTime": "", "recipeYield": "12 cups", "recipeCategory": ["Cook the Book", "Grapes"], "recipeIngredient": ["12 cups freshly popped popcorn, at room temperature ", "10 ounces 60 percent semisweet chocolate, melted, at body temperature ", "1/2 cup plus 1 tablespoon unsweetened cocoa powder ", "2 tablespoons chopped pistachio nuts (optional)", "1 pound cold firm seedless grapes, stems removed ", "4 ounces 60 percent semisweet chocolate, melted, at body temperature ", "1 to 2 tablespoons unsweetened cocoa powder "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the popcorn in a bowl large enough to toss it easily or divide it between two huge bowls. Line two baking sheets with Silpat baking mats or parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly add the melted chocolate, about a quarter at a time, to the popcorn, folding the chocolate into the popcorn with a spatula, carefully scraping down sides of bowl to coat all pieces evenly. Spread the popcorn on the prepared pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chocolate begins to set, use a small strainer to sprinkle the cocoa powder, little by little, over the surface. Stir carefully as you sift, breaking popcorn into clusters. Continue adding cocoa until all kernels are well coated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with plastic wrap; refrigerate for about 20 minutes or until chocolate is set. Remove from the refrigerator and store in an airtight container at room temperature up to 2 days. To serve, place in a bowl; sprinkle with pistachios if desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><font style=\"text-transform:uppercase;\"><strong>Chocolate Grapes </strong></font></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the grapes well; place them in a bowl large enough to toss easily. Line a baking sheet with a Silpat baking mat or parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chocolate to the grapes about 1 tablespoon at a time, stirring well with a spatula, carefully scraping the sides of the bowl and folding through center of grapes to coat them all evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chocolate begins to set, use a small strainer to sprinkle the cocoa powder, little by little, over surface. Gently toss or stir grapes as you sift, continuing to add cocoa until all grapes are well coated and separated. Spread on prepared sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with plastic wrap; refrigerate until chocolate is set or up to 1 day.<br />\r\n</p>"}]}