{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "cookshelf", "CTB: The Young Man and the Sea", "Dave Pasternack", "Ed Levine", "pancetta", "radicchio", "recipes", "seafood", "Serious Recipes", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Shrimp with Pancetta and Radicchio", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-grilled-shrimp-w.html", "description": "Dave Pasternack, with whom I wrote The Young Man and the Sea, has a real knack for combining two or three ingredients into something unique and delicious. Take this grilled shrimp dish for example. I love the combination of grilled...", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1/2 pound medium shrimp, shells on, split down the back, vein removed ", "Sea salt ", "Freshly ground black pepper ", "1/4 cup extra-virgin olive oil, plus high-quality extra-virgin olive oil, for drizzling ", "1/2 pound pancetta, cut into 1/2-inch lardons ", "1 clove garlic, thinly sliced ", "1 medium head radicchio, cut into 4 wedges ", "2 tablespoons aceto balsamico (aged balsamic vinegar) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the shrimp with salt and pepper. Heat 3 tablespoons of the olive oil in a large, straight-sided sauté pan until hot but not smoking. Add the shrimp, in two batches if necessary, and cook for about 3 minutes per side. (Add the remaining tablespoon of oil to the pan between batches if necessary.) The shells should be pink and the flesh opaque. Transfer the cooked shrimp to a plate and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe the pan clean with a paper towel and add the diced pancetta. Cook over a medium flame until the fat begins to render, about 3 minutes. Add the garlic, stir to combine, and continue to cook until the lardons are browned and the garlic has softened, about 3 more minutes. Add the radicchio and the balsamic vinegar and continue to cook until the radicchio is tender and the vinegar has reduced slightly, 4 to 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, spoon the wilted radicchio equally onto four serving plates. Top with the sautéed shrimp and drizzle with high-quality extra-virgin olive oil.</p>"}]}