{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Gurgling Cod"}, "recipeCuisine": "", "keywords": ["fall recipes", "leeks", "oysters", "potatoes", "seafood", "soups", "Sunday Night Soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Night Soups: Leek, Potato, and Oyster Soup", "link": "https://www.seriouseats.com/recipes/2007/12/sunday-night-soups-leek-potato-and-oyster-sou.html", "description": "Sunday Night Soups, where each week The Gurgling Cod shows up to offer a soup appropriate to the week's Sunday Night Football game on NBC. The antepenultimate regular season Sunday Night Soup has SNS regulars the Redskins venturing to Minnesota...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Clams, Mussels, and Oysters", "Mains", "Potato", "Soups and Stews"], "recipeIngredient": ["7 tablespoons unsalted butter (A good trick I played on my brother-in-law last weekend that you can try anytime you have a recipe that calls for more than 4 and less than 8 tablespoons of butter: meticulously cut off the small piece, then toss the big pie", "9 leeks, with as much green stuff as possible (You cannot clean leeks well enough—work the individual rings apart, and rinse once more than you think is sane) ", "1 onion, peeled and sliced", "5 cloves garlic, peeled and sliced", "4 potatoes, peeled and chopped", "2 quarts light chicken stock (A good time to use the real stuff)", "Sea salt and fresh black pepper", "12 medium oysters, shucked, with liquor reserved (Fergus says Pacific—I say from whichever coast is closer)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pan large enough for all the ingredients, melt butter and sweat the leeks, onion, and garlic, taking care not to let them brown. When these are giving, add potatoes and cook for 8 minutes, continuing to avoid browning. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock and bring to a gentle boil. When the potatoes are cooked through, season to taste with salt and pepper. Purée in blender, (hot liquids and blenders demand care) and return to clean pan, and reheat. Just before serving, add liquor to soup. Place two shucked oysters in each bowl, and ladle soup over.</p>"}]}