{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/thanksgivingBug.png", "author": {"@type": "Person", "name": "Jenn Smith"}, "recipeCuisine": "", "keywords": ["dressings", "gravy", "stuffings", "thanksgiving", "Thanksgiving Classic Menu", "Thanksgiving mains", "Thanksgiving turkeys", "turkeys"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "My Own Favorite Roast Turkey", "link": "https://www.seriouseats.com/recipes/2007/10/serious-thanksgiving-roast-turkey-recipe.html", "description": "The \"my\" of this recipe's title is James Beard, who observed that \"American food is anything you eat at home\". As no meal is more associated with home cooking than Thanksgiving, and no food writer was a greater champion of...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "Mains"], "recipeIngredient": ["Stuffing:", "1/2 cup butter", "1 cup finely chopped shallots or finely cut green onions", "1 1/2 tablespoons dried tarragon or 3 tablespoons fresh tarragon, finely cut", "1 tablespoon salt or to taste ", "1 1/2 teaspoons freshly ground pepper", "1/2 cup pine nuts", "Additional melted butter, if needed", "10 to 12 cups fine fresh breadcrumbs", "Turkey:", "1 turkey, 18 to 20 pounds", "1 onion stuck with 2 cloves ", "1 sprig parsley", "Additional salt and pepper ", "1/2 teaspoon thyme", "1 quart water", "Half a lemon", "1 stick (1/2 cup) or more softened butter", "Strips of fresh or salt pork, or bacon rind", "4 tablespoons flour", "1/4 cup Cognac or Madeira (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Make the stuffing first. Melt the butter in a heavy skillet ( a 12 inch one if possible). Add the shallots or green onions and the tarragon and allow to cook until the shallots are just wilted. Add salt, pepper, pine nuts, and then additional butter as needed (I should say another 1/2 to 1 cup butter, depending on the amount the onion has absorbed). Finally add the crumbs and toss. Taste the mixture and add more of any of the ingredients as required. A clove or two of garlic may also be added to the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Remove the neck from the bird if not already done, and put it in a 2-quart saucepan with the liver, gizzard, heart, and the onion, parsley, 2 teaspoons salt, and the thyme. Add the water, bring to a boil, and boil 5 minutes, after which reduce the heat and simmer, covered, 1 hour. Drain and reserve for the sauce. If you like, chop the gizzard, heart, and liver to add to the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Rub the inside of the turkey with the lemon, and dry with paper towels. Fill the body cavity and neck cavity with stuffing, but not too tightly - the crumbs should remain somewhat loose. Truss the turkey with a trussing needle, by hand-tying the piece of neck to the back of the turkey, or by sewing with a needle and twine. Close the vent of the bird, and either secure with skewers and twine or sew it up. Tie the legs together firmly, and then tie them to the tail of the bird. Massage the turkey well with softened butter, then salt and pepper it. Line a rack with strips of fresh or salt pork or with the rind of bacon, which you can sometimes buy from your butcher when he cuts down a whole slab. Set the rack in a fairly shallow roasting pan, and place the turkey breast side down on the rack. Roast 1 hour at 350 degrees. Remove the pan from the oven, turn the turkey on one side, and rub with softened butter. Return the turkey to the oven and roast another hour. Remove the pan, turn the turkey on its other side, and rub with butter. Roast for another hour, turn the turkey on its back, and rub the breast with butter. Return to the oven and continue roasting till the turkey tests done.  Remove from the oven and place on a hot platter. Allow it to rest 15 minutes if being served hot. If being served tepid, let it cool gently at room temperature. Remove all twine and skewers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. For the sauce, remove all the fat from the roasting pan save 4 tablespoons. Over medium heat add the flour to the pan and blend thoroughly. scraping to loosen bits of caramelized dripping. If there are any juices, add those (skimmed of fat) as well. Gradually stir in 2 cups or more of the turkey broth and cook, stirring constantly, till the mixture thickens. Correct the seasonings. Add the chopped giblets, if you like, and Cognac or Madeira, and simmer about 4 to 5 minutes. Serve with the turkey and stuffing.</p>"}]}