{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["appetizers", "Bruce Aidells", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Chips: You Can't Eat Just One", "link": "https://www.seriouseats.com/recipes/2007/08/pork-chips-you-cant-eat-just-o.html", "description": "This Bruce Aidells recipe from his Complete Book of Pork is not really for chips, but rather patties of ground pork crispy on the outside, juicy on the inside. They're like potato chips in that it's downright impossible to eat...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pork", "Sides"], "recipeIngredient": ["2 slices coarse-textured white bread (French, Itaian, or country", "bread), crusts trimmed and torn into pieces, soaked in 1/4 cup milk", "for 15 minutes", "1 1/2 pounds boneless pork loin, cut into 1-inch pieces", "1 teaspoon kosher salt", "2 tablespoons heavy cream", "1 tablespoon finely chopped shallot or green onions (white part only)", "1 teaspoon minced garlic", "2 tablespoons sun-dried tomatoes, packed in oil, chopped (optional)", "1 tablespoon finely chopped capers", "1/2 teaspoon freshly ground black pepper", "2 teaspoons lemon zest", "1 tablespoon chopped fresh basil", "2 cups fresh bread crumbs of same bread as soaked", "olive oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze the bread to remove the excess milk. Set the soaked bread aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the diced pork on a plate and chill in the freezer for 10 minutes. Put half of the pork and 1/2 teaspoon of the salt in the bowl of a food processor fitted with the metal blade. Pulse until the mixture forms a paste, about 1 minute. Transfer to a bowl and repeat with the remaining pork and salt. Return all the ground pork to the processor and add the soaked bread, cream, shallot, garlic, sun-dried tomatoes, capers, pepper, lemon zest, and basil and pulse until the mixture is just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Moisten your hands with cold water and form the mixture into 16 oval patties, 2 to 3 inches long, 1 to 2 inches wide and 1/2 to 3/4 inch think. Put the bread crumbs in a shallow bowl and coat the patties well with the crumbs, then set aside on a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil to a depth of 1/8 to 1/4 inch in a large skillet or  saute pan over medium heat. When the oil begins to shimmer, add the patties (in batches if necessary) and cook until golden brown, about 3 to 4 minutes. Turn and cook until brown on the other side, about 3 minutes. Cut into a patty to make sure it signs no sign of pink in the center. Transfer the patties to paper towels to drain. Serve hot with the suggested garnishes.</p>"}]}