{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/books-donuts-an-american-passion.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lazy Man's Ersatz Donuts", "link": "https://www.seriouseats.com/recipes/2007/05/cook-the-book-lazy-mans-ersatz.html", "description": "If the idea of preparing a dough to fry up in vast amounts of oil is just too much for you, there's a recipe in Donuts that involves almost nothing more than pressing a spoon into the side of one...", "totalTime": "", "recipeYield": "Makes 12 donuts", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1/2 gallon peanut or vegetable oil for frying", "1 10-pack cylinder canned biscuit dough", "1 tablespoon ground cinnamon", "1/4 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a cast-iron Dutch oven or other deep, heavy-bottomed pot, until it reaches a depth of at least 2 but not more than 3 inches.  heat the oil over medium-high heat to 375&deg;F.  Extract the biscuits from the can and pat the circles of dough out to 1 1/2 times their original diameter, or about 1/4 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut out donut holes using a bottle cap or a shot glass.  Slip the rings into the oil, working in two batches.  Do not crowd the pot.  Cook for a minute or two per side, flipping the donuts with care to prevent splatter.  When light golden brown on both sides, use a slotted spoon to remove the donuts from the pan to a wire rack and fry the holes.  Using a metal slotted spoon or spatula keeps the holes moving, as they can become weighted and difficult to flip.  Drain the holes on a wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the cinnamon and sugar together in a large brown paper bag and drop the donuts in one at a time, shaking lightly to distribute evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the holes all at once, shaking in the same fashion.</p>"}]}