{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20070917puredessert.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "Cook the Book", "Cookies", "CTB: Pure Dessert", "holiday baking", "holiday recipes", "holidays"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sesame Coins", "link": "https://www.seriouseats.com/recipes/2007/09/cook-the-book-sesame-coins.html", "description": "Truth be told, about the only time I run into sesame seeds is on a bagel or hamburger bun. But the little suckers always delight me when they appear in desserts, as they do in this recipe for sesame cookies...", "totalTime": "", "recipeYield": "about forty-eight 1 1/2-inch cookies", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2/3 cup (3 ounces) all-purpose flour ", "1/4 teaspoon baking soda ", "2/3 cup unsalted tahini (pure ground roasted sesame seeds) ", "4 tablespoons unsalted butter, melted ", "1/2 cup sugar ", "1 large egg yolk ", "1/2 teaspoon pure vanilla extract ", "1/2 teaspoon salt ", "3 tablespoons natural or black sesame seeds "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour and baking soda in a small bowl until thoroughly blended. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl mix the tahini, butter, sugar, egg yolk, vanilla, and salt until smooth. Add the flour mixture and work with your hands until blended. The dough will be slightly crumbly, and you will have to push or squeeze it together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half-form it into 2 patties, and wrap the patties in plastic wrap. Chill for at least 2 hours, or, preferably, overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the racks in the lower and upper thirds of the oven and preheat the oven to 325&deg;F. Line the baking sheets with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove one piece of dough from the refrigerator and allow it to soften slightly. Roll it between two pieces of wax paper or plastic wrap to a thickness of 1/4 inch. If the dough is crumbly, just push it together. Sprinkle the dough with half of the sesame seeds and roll over them gently to secure them to the dough. Cut as many rounds as possible, trying to minimize dough scraps, and transfer to the lined pans, spacing the cookies 1 inch apart. Repeat with the second dough patty. Press all of the scraps together, without overworking the dough, roll out, and cut additional cookies. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the edges of the cookies arc golden brown, 10 to 12 minutes, rotating the sheets from back to front and top to bottom halfway through baking. Set the baking sheets on racks to cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing: </strong>The cookies will keep in an airtight container for at least 1 month. </p>"}]}