{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Alaina Browne"}, "recipeCuisine": "", "keywords": ["Lee Bros.", "pimento cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pimento Cheese for Grilling", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-pimento-cheese-f-1.html", "description": "Foodstuffs I took for granted growing up in North Carolina include but are not limited to: sweet tea, hush puppies, collard greens, chopped barbecue, and pimento cheese sandwiches. I've only recently learned via the Lee brothers and John T. Edge...", "totalTime": "", "recipeYield": "12 inch-thick slices; enough for 4 sandwiches or 6 cheeseburgers", "recipeCategory": ["Cheese", "Cook the Book"], "recipeIngredient": ["1 red bell pepper", "8 ounces (about 3 cups) finely grated extra-sharp cheddar cheese", "2 ounces (about 1/4 cup) softened cream cheese, cut into pieces", "1 teaspoon crushed red pepper flakes", "Salt and freshly ground black pepper to taste", "<font style=\"text-transform:uppercase;\"><strong>For Each Grilled Pimento Cheese Sandwich</strong></font>", "Three 1/3-inch-thick slices Pimento Cheese for Grilling", "1 tablespoon unsalted butter", "Two 1/3-inch-thick slices <a href=\"http://www.baking911.com/recipes/bread/sally_lunn.htm\">Sally Lunn</a> or other white bread", "<font style=\"text-transform:uppercase;\"><strong>For Each Pimento Cheeseburger</strong></font>", "6 ounces ground beef (chuck, round, or sirloin, whichever you prefer)", "Two 1/3-inch-thick slices Pimento Cheese for Grilling", "1 hamburger bun, lightly toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Turn on the broiler. place the pepper on its side in a dry skillet and slide it under the broiler until the skin blackens on the side facing up, about 3 minutes. With tongs, turn the pepper so that an unblackened side faces up, and repeat until the skin is blackened on all sides. Place the pepper in a small bowl, cover it, and let it steam for 5 minutes as it cools down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Uncover the bowl. When the pepper is cool enough to handle, transfer it to a cutting board, reserving any liquid in the bowl. Remove the blackened skin with your fingers and discard. Using a paring knife, cut open the pepper, remove and discard the stem and seeds, and chop the pepper into 1/4-inch dice. You should have a scant 1/2 cup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Place the grated cheddar in a medium bowl and add the cream cheese pieces, the diced red pepper and its liquid, and the red pepper flakes, distributing them evenly over the cheese. With a rubber spatula or wooden spoon, blend the ingredients together until the spread is thoroughly mixed, about 2 minutes. Season to taste with salt and black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Turn the blended cheese out onto a cutting board and use a spatula to gather it into a rectangular block about 5 inches long and 3 inches wide, and 2 inches high. Wrap the cheese tightly in plastic wrap and refrigerate for 1 hour, or until ready to use. Slice and serve. Grillable pimento cheese keeps for 2 weeks in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><font style=\"text-transform:uppercase;\"><strong>For Each Grilled Pimento Cheese Sandwich</strong></font></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly toast the bread in a toaster or under the broiler.  Place the cheese between the slices of toast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, melt the butter over medium hear. As soon as the butter is frothy, place the sandwich in the skillet. Pan-fry the sandwich for 6 minutes. Flip it with a spatula, cover the skillet, and cook for 3 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a cutting board, slice the sandwich diagonally with a serrated knife into two portable pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><font style=\"text-transform:uppercase;\"><strong>For Each Pimento Cheeseburger</strong></font></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill Beef patties as preferred with pimento cheese slices added toward the end to melt (cover patties with shallow bowl to facilitate melting if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>3. </strong>Set the bottom half of the hamburger bun on a plate and transfer the burger to the bun. Let rest for 2 minutes before dressing with condiments or garnishes. We prefer a slice of tomato and a thin ring of red onion.</p>"}]}