{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["books", "Cook the Book", "cookshelf", "CTB: The Young Man and the Sea", "Dave Pasternack", "Ed Levine", "pasta", "peas", "seafood", "shrimp", "taglietelle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Taglietelle with Shrimp and Peas", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-taglietelle-with.html", "description": "After writing The Young Man and the Sea, I had a keen appreciation for Dave Pasternack's ability to combine fish or shellfish with pasta in ingeniously simple fashion. This recipe for Tagliatelle with Shrimp and Peas is easy, delicious, and...", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Legumes"], "recipeIngredient": ["1 pound fresh shelled peas (about 1 ¼ pounds before shelling), or frozen peas", "4 ounces slab pancetta, cut into a small dice", "1 pound medium shrimp (about 35 shrimp) peeled and deveined", "Sea salt", "Freshly ground black pepper", "1 pound fresh tagliatelle or fettuccine", "1 tablespoon roughly chopped tarragon leaves", "1/2 cup extra-virgin olive oil, plus high-quality extra-virgin olive oil, for drizzling "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil for the pasta, and a smaller saucepan of salted water to a boil for the peas. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blanch the peas in the samll saucepan until tender, approximately 5 minutes, depending on their size and starchiness—tasting them is the best gauge. Drain and set aside. (If using frozen peas, prepare them according to package instructions.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, straight-sided saute pan, brown the pancetta over a medium flame, 5 to 7 minutes. Transfer the pancetta to a paper-towel-lined plate and set aside. Spoon some of the rendered fat out of the pan, leaving about 2 tablespoons. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the shrimp with salt and pepper. Add the shrimp to the pan and saute for 5 to 6 minutes, turning them midway, until opaque. Turn off the flame, leaving the shrimp in the saute pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the fresh pasta to the large pot of boiling water and cook for 1 minute less than the package instructs for al dente. Drain the pasta in a colander and add to the pan of shrimp. Return the pan to a medium flame, and add the blanched peas, pancetta, tarragon, and the ½ cup olive oil. Season with 1 teaspoon of sea salt and 1 teaspoon freshly ground black pepper; toss with tongs to fully combine. Divide the pasta in shallow bowls, and drizzle each bowl with high-quality olive oil, and finish with a sprinkling of coarse sea salt and freshly ground black pepper. Serve immediately.</p>"}]}