{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-texas-cowboy-cookbook.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["cobblers", "CTB: Texas Cowboy Cookbook", "peach cobblers", "peaches", "Robb Walsh", "Serious Recipes", "Super Bowl desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Paige Denison's Deep-Dish Peach Cobbler", "link": "https://www.seriouseats.com/recipes/2007/05/paige-denisons-deep-dish-peach-cobbler-recipe.html", "description": "Here's the second recipe from Robb Walsh's Texas Cowboy Cookbook. As Robb says, \"Paige Denison is known as the 'Cobbler Queen' on the Adamah Ranch cook-off team. She makes a lattice-crust peach cobbler that may not be historically accurate but...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Desserts", "Peach"], "recipeIngredient": ["<strong><em>For the filling</em></strong>", "6 cups peeled, sliced peaches (about 8)", "3/4 cup granulated sugar", "3/4 cup brown sugar", "1/4 teaspoon grated nutmeg", "1/8 teaspoon salt", "1/2 teaspoon ground cinnamon", "2 teaspoons fresh lemon juice", "3 tablespoons butter", "1/4 cup all-purpose flour", "<strong><em>For the dough</em></strong>", "6 cups all-purpose flour", "2 teaspoons salt", "2 cups Crisco", "2 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a deep, covered pan, combine all filling ingredients. Add 1/2 cup water; mix well. Cook over medium-high heat until the mixture begins to thicken, about 10 minutes. Reduce heat to a simmer; cover.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F and begin making dough: In a large mixing bowl, combine the flour and salt. Cut the Crisco into the mixture with a fork or pastry blender until it has the texture of coarse meal. Add the eggs and 3/4 cup water. Mix well, until dough holds together in a ball; divide dough in two equal parts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out one part of dough onto a lightly floured work surface; roll into a rectangle about 1/4 inch thick, shaped to fit a 9-by-13-inch baking dish and with enough overlap to form the side crust. Transfer this dough to a 9-by-13-inch baking dish; trim edges to fit pan. Press dough into pan, making sure to get the corners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the warm peach mixture into pan, spreading evenly. Roll the remaining dough half into a rectangle the same size as the first. Using a sharp knife, cut four 1/2-inch stripes lengthwise. Lay each strip evenly apart on top of the peach mixture, trimming edges and tucking them underneath the bottom crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Re-roll remaining dough if needed; cut four more 1/2-inch strips widthwise. Lay these strips across the first four, creating a lattice pattern. Trim any overhang; tuck strips underneath the bottom crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cobbler in lower portion of oven for about 30 minutes, until peach mixture bubbles and crust is golden brown. Remove from oven; let cool until cobbler sets, about 20 minutes.</p>"}]}