{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["baking", "breads", "Cook the Book", "Martha Stewart", "Martha Stewart Original Classics"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Buttermilk-Onion Pull-Apart Rolls", "link": "https://www.seriouseats.com/recipes/2007/12/cook-the-book-butter-milk-onion-pullapart-rolls-recipe.html", "description": "Sadly, I’ve never made my own homemade rolls&mdash;always just opting for the rolls-in-the-can Pillsbury method (the leap of excitement when the tube bursts open just never gets old). But after seeing the buttermilk-onion pull-apart rolls recipe from The Martha Stewart...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["11  tablespoons (1 3/8 sticks) unsalted butter, softened, plus more for the bowl, plus 5 tablespoons melted ", "1 envelope (1/4 ounce) active dry yeast ", "1 tablespoon sugar ", "2 tablespoon warm water (105°F to 110°F )", "3/4 cup buttermilk ", "1 large egg, lightly beaten ", "2 3/4 cups plus 2 tablespoons all-purpose flour, plus more for the surface and pin ", "2 teaspoons salt ", "2 pounds sweet onions, such as Rio (1 1/2 pounds cut into 1/4-inch slices, 1/2 pound finely chopped) ", "1/8 teaspoon freshly grated nutmeg "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9-inch cake pan using 1 tablespoon softened butter. Butter a large bowl; set aside. Stir together the yeast, sugar, and warm water in a small bowl; let the mixture stand until foamy, about 5 minutes. Stir until dissolved. Stir in the buttermilk and egg. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix 2 3/4 cups flour and 1 1/2 teaspoons salt in the bowl of an electric mixer fitted with the dough hook. Make a well in the center. Pour in the buttermilk mixture; mix to combine. Add 6 tablespoons softened butter; mix on medium-high speed until a soft dough forms, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough onto a lightly floured work surface; sprinkle with the remaining 2 tablespoons flour. Knead the dough until smooth, about 5 minutes. Transfer to the buttered bowl. Cover the dough with a clean kitchen towel; let rise in a warm place until doubled in bulk, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the remaining 4 tablespoons softened butter in a large saucepan over medium-high heat. Add the onions; raise heat to high, and cook, stirring often, until soft, about 5 minutes. Reduce heat to medium; cook, stirring, until golden brown, about 30 minutes. Stir in the nutmeg. Season with 1/2 teaspoon salt. Let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch down the dough, and turn out onto a lightly floured work surface. With a lightly floured rolling pin, roll the dough into a 17 x 10-inch rectangle, and brush with 3 tablespoons melted butter. Spread the onions evenly over the dough. Starting on 1 long side, roll the dough into a log. Press the seam to seal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut into about 12 slices, about 1 1/4 inches thick each. Arrange the slices, cut sides up, in the buttered pan, and brush with remaining 2 tablespoons melted butter. Cover loosely with plastic wrap. Let rise in a warm place until doubled in bulk, about 50 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. Bake the rolls until golden brown, about 35 minutes. Immediately invert the rolls onto a wire rack. Serve warm. </p>"}]}