{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["baking", "bittersweet chocolate", "chocolate", "Cookies", "hazelnut", "holiday baking", "holiday recipes", "holidays"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bittersweet Chocolate and Hazelnut Cookies", "link": "https://www.seriouseats.com/recipes/2007/12/bittersweet-chocolate-and-hazelnut-cookies-recipe.html", "description": "...", "totalTime": "", "recipeYield": "about 5 dozen cookies", "recipeCategory": ["Nuts"], "recipeIngredient": ["2 cups unbleached all-purpose flour", "1/3 cup unsweetened Dutch-processed cocoa", "1/2 teaspoon baking powder", "1/2 teaspoon kosher salt", "1/2 cup whole hazelnuts, skinned or unskinned", "1 cup (2 sticks/8 ounces) unsalted butter, softened", "1/2 cup granulated sugar", "1 large egg", "1 teaspoon pure vanilla extract", "5 ounces semisweet or bittersweet chocolate, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the flour, cocoa powder, baking powder, and salt.  Place the hazelnuts in the bowl of a food processor and puse them 2 or 3 times to chop them medium-fine.  Add the hazelnuts to the bowl with the dry ingredients and stir to combine them.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, cream together the butter and granulated sugar on medium speed until pale and fluffy, about 2 minutes.  Beat in the egg and vanilla extract and scrape down the sides of the bowl.  On low speed, beat in the dry ingredients, followed by the chocolate, and beat just until combined.  Cover the bowl with plastic wrap and chill the dough until firm, about 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325 degrees.  Lightly grease two baking sheets with nonstick cooking spray or butter or line them with parchment.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the confectioners' sugar in a shallow bowl.  To form the cookies, roll 1 scant tablespoon of dough into a 1-inch ball, then flatten it slightly with your fingertips to form a small disk.  Roll the cookie in the confectioners' sugar to coat it evenly and place it on the baking sheet.  Repeat until all of the dough is used, spacing the cookies 1 inch apart on the baking sheets.  <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies until they are puffed and cracking, 8 to 10 minutes.  Rotate the baking sheets 180 degrees halfway through the baking time to ensure that the cookies bake evenly.  Allow the cookies to cool on the baking sheets for 1 to 2 minutes, then use a spatula to transfer them gently to a wire rack to cool completely.  If desired, dust them with additional confectioners' sugar.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The cookies can be stored in an airtight container, layered between sheets of parchment paper, and kept in a cool, dry place for up to 1 week.</p>"}]}