{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-leebros.jpg", "author": {"@type": "Person", "name": "Alaina Browne"}, "recipeCuisine": "", "keywords": ["buttermilk biscuits", "Cook the Book", "Lee Bros."], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bird-Head Buttermilk Biscuits", "link": "https://www.seriouseats.com/recipes/2007/07/cook-the-book-birdhead-butterm.html", "description": "Is there anything better than a tearing apart a steaming hot biscuit, adding a pat of butter, and chomping down? Mmmm. Pure heaven. I love all kinds of biscuits, but some of my favorite come hot out of the oven...", "totalTime": "", "recipeYield": "about sixteen 2-inch round biscuits", "recipeCategory": ["Biscuit", "Cook the Book"], "recipeIngredient": ["2 1/4 cups sifted cake flour or 2 cups sifted bleached all-purpose flour, plus more for your work surface and hands ", "1 tablespoon baking powder ", "1 tablespoon plus 1 teaspoon sugar ", "1 teaspoon salt ", "4 tablespoons cold unsalted butter, cut into several pieces ", "2 tablespoons cold lard or vegetable shortening, cut into several pieces ", "3/4 cup cold whole or lowfat buttermilk (preferably whole) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, mix the dry ingredients thoroughly with a fork. Transfer to a food processor fitted with the chopping blade. Add the butter and lard and pulse the mixture in 2-second increments until the mixture resembles coarse crumbs with a few pea-sized pieces, about 5 pulses. (If you don't have a food processor, cut the fats into the dry ingredients in a bowl by mashing with a fork, a whisk, or a pastry blender; it will take about 3 minutes.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture back to the bowl, pour the buttermilk over it, and mix with the fork for about 1 minute, until the dough just comes together. Turn the dough out onto a floured board, knead with floured fingers once or twice, and pat it into a rectangle about 6 x 10 inches and 1 inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the rightmost third of the rectangle over the center third and fold the left third on top. Turn the dough a quarter turn, pat it into a 6-x-10-inch rectangle, and fold it upon itself in thirds again. Repeat one more time, then pat the dough into a 6-x-10-inch rectangle about 1 inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a floured 2-inch biscuit cutter (or an upside-down shot glass), cut the biscuits from the dough and place them about I'll inches apart on an ungreased baking sheet. Bake for 15 to 20 minutes, until the tops just begin to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the biscuits warm, with butter or eggs and bacon.</p>"}]}