{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20071029htcev-thumb.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "American", "keywords": ["Cook the Book", "cookbooks", "How to Cook Everything Vegetarian", "macaroni and cheese", "Mark Bittman", "Super Bowl sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Baked Macaroni and Cheese", "link": "https://www.seriouseats.com/recipes/2007/10/baked-vegetarian-macaroni-and-cheese-recipe.html", "description": "The omission of meat—rather than the inclusion of vegetables—is primarily what makes this recipe vegetarian. But who's going to object when it comes to mac and cheese? The instructions below come from Mark Bittman's How to Cook Everything Vegetarian and...", "totalTime": "", "recipeYield": "", "recipeCategory": ["American", "Cook the Book", "Mac and Cheese", "Mains", "Sides", "Vegetarian"], "recipeIngredient": ["Salt", "2 1/2 cups milk (low-fat is fine)", "2 bay leaves", "1 pound elbow, shell, ziti or other cut pasta", "4 tablespoons (1/2 stick) butter", "3 tablespoons all-purpose flour", "1 1/2 cups grated cheese, like sharp cheddar or Emmental", "1 1/2 cups freshly grated Parmesan cheese", "Freshly ground black pepper", "1/2 cup or more bread crumbs, preferably fresh"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Bring a large pot of water to a boil, and salt it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the milk with the bay leaves in a small saucepan over medium-low heat. When small bubbles appear along the sides, about 5 minutes later, turn off the heat and let it stand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta to the point where it is almost done but you would still think it needed another minute or two to become tender.  Drain it, rinse it quickly to stop the cooking, and put it in a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan over medium-low heat, melt 3 tablespoons of the butter; when it is foamy, add the flour and cook, stirring, until the mixture browns, about 5 minutes. Remove the bay leaves from the milk, and add about 1/4 cup of the milk to the hot flour mixture, stirring with a wire whisk all the while. As soon as the mixture becomes smooth, add a little more milk, and continue to do so until all the milk is used up and the mixture is thick and smooth. Add the cheddar and stir. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sauce over the noodles, toss in the Parmesan, and sprinkle with salt and pepper. Use the remaining 1 tablespoon butter to grease a 9-by-13-inch or similar-size baking pan and turn the pasta mixture into it. Top liberally with breadcrumbs, and bake until bubbling and the crumbs turn brown, about 15 minutes.  Serve piping hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Simple Macaroni and Cheese:</strong> Here the ingredients are just layered and cooked together: Proceed with Steps 1 through 3 as directed. Butter the baking pan with an extra 1 or 2 tablespoons butter. Layer one-third of the pasta, sprinkle with half of the flour, fleck with half of the butter, cover with about 1/2 cup of the cheddar, pour half of the heated milk over the top, and sprinkle with salt and pepper. Repeat the layers, using the remaining flour, butter, and milk, and top with the remaining pasta, cheese, and bread crumbs. Bake until bubbling and browned on top, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Rich Macaroni and Cheese: </strong>Super-creamy and decadent; make this even more special with some saut&eacute;ed wild mushrooms: Reduce the milk to 3/4 cup. Omit the bay leaves, the first 3 tablespoons butter, and all of the flour. Substitute mascarpone cheese for the grated cheese. Add about a cup or so saut&eacute;ed wild mushrooms, if you like, and 1 tablespoon chopped fresh sage leaves (or 1 1/2 teaspoons dried sage). Cook the pasta as directed. Mix together the milk, mascarpone, and Parmesan in a large bowl. Add the cooked pasta and the sage, sprinkle with salt and pepper, and combine. Proceed with Step 5. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Nutty Macaroni and Blue Cheese: </strong>Substitute 1 cup blue cheese for the Parmesan and reduce the cheddar by 1/2 cup; use a mild or medium cheddar. Add 3/4 cup roughly chopped walnuts. Fold the blue cheese and walnuts into the pasta mixture in Step 5 (melting the blue cheese in the sauce will make it gray and not so attractive.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Macaroni and Goat Cheese With Roasted Red Peppers: </strong>Nice and tangy from the goat cheese, while rich and sweet from the roasted peppers: Add 2 roasted red peppers, peeled and chopped, and 1/2 cup each chopped fresh basil leaves and toasted pine nuts. Substitute 1 cup soft goat cheese for the Parmesan, and reduce the grated cheese by 1/2 cup. Omit the bay leaves. Proceed with the recipe, stirring in the peppers, basil, and pine nuts with the pasta in Step 5. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Macaroni and Chile Cheese: </strong>For a spicy dish, use a hotter chile or add a tablespoon chopped chipotle chile with adobo sauce: Use grated Jack or cheddar for all 2 cups of the cheese. Add 2 medium poblano or other mild green fresh chiles, roasted, cleaned, and chopped,1/4 cup or so chopped fresh cilantro leaves, and 1 medium tomato, sliced. proceed with the recipe, stirring in the chiles and cilantro with the pasta in Step 5, then top with the tomato slices and breadcrumbs.</p>"}]}