{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["baking", "cakes", "classic cookbooks", "desserts", "Edna Lewis", "pound cakes", "The Taste of Country Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Yellow Vanilla Pound Cake", "link": "https://www.seriouseats.com/recipes/2008/07/yellow-vanilla-pound-cake-recipe.html", "description": "In her cookbook The Taste of Country Cooking, Edna Lewis says there was always pound cake on special summer occasions to eat with whatever berries and fruit were left over from canning and preserving. This cake is dense and delicious,...", "totalTime": null, "recipeYield": "8 generously or 12 sensibly", "recipeCategory": ["Desserts"], "recipeIngredient": ["1 cup (1/2 pound) cold butter", "1 2/3 cups sugar", "1/4 teaspoons salt ", "5 eggs (medium to large but not jumbo)", "2 cups sifted unbleached flour", "1 tablespoon vanilla extract", "1 teaspoon fresh-squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter in a large mixing bowl and work it with a wooden spoon until it becomes shiny, about 5 minutes. Add in the sugar and salt and continue to work sugar and butter together. When well mixed, begin to stir in a circular motion until the mixture loses most of he gritty feeling. The addition of eggs will dissolve the rest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add eggs one at a time, stirring well after each addition. After the third egg has been incorporated, add 2 tablespoons of flour and stir well. This will keep the batter from separating. Add the fourth and fifth egg and continue to stir, then the rest of the flour in four parts, stirring well after each addition. Finally beat in the vanilla and lemon juice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter and dust a 9-inch tube pan (I think this means angel food cake style; I used a 12 cup Bundt pan with good results) on the bottom only; the sides should remain ungreased because the cake will adhere to the sides better when rising. Spoon the batter into the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set into an oven that has been preheated long enough for the heat to have risen and become stable at between 275°F and 300°F. Bake for 40 minutes at that temperature, then raise the temperature to 325°F for 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven, run a knife around the sides of the pan, turn out right away on a wire rack, and turn face up. Cool uncovered for 15 minutes, then cover with a clean towel; otherwise the cake will become dry and hard. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cold, store in a clean tin. Plastic containers develop an undesirable odor.</p>"}]}