{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["appetizers", "Cook the Book", "mushrooms", "shrimp", "snacks", "stuffed mushrooms", "The Cook's Country Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chesapeake Shrimp Stuffed Mushrooms", "link": "https://www.seriouseats.com/recipes/2008/10/cook-the-book-chesapeake-shrimp-stuffed-mushr.html", "description": "Yesterday, at my boyfriend's request, I watched a football game and a baseball game. It's that time of year again: TVs are tuned in every Sunday afternoon, cold beers are nestled in their cozies, and salty snacks are on the...", "totalTime": "", "recipeYield": "24 stuffed mushrooms", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Mushrooms", "Shrimp", "Snacks"], "recipeIngredient": ["<strong>For the topping:</strong>", "1 slice hearty white sandwich bread, quartered", "1 tablespoon chopped fresh parsley", "2 garlic cloves, minced", "2 tablespoons olive oil", "<strong>For the mushrooms:</strong>", "24 large white mushrooms, stems removed", "1/4 cup olive oil", "1 teaspoon fresh lemon juice", "1/4 teaspoon salt", "1/8 teaspoon pepper", "<strong>For the stuffing:</strong>", "1/4 pound cooked, peeled shrimp", "1/2 cup shredded cheddar cheese", "2 ounces cream cheese, softened", "2 tablespoons drained jarred roasted red peppers, chopped", "3 scallions, sliced thin", "1 garlic clove, minced", "1 tablespoon fresh lemon juice", "1/2 teaspoon Old Bay seasoning", "1/4 teaspoon salt", "1/8 teaspoon pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the topping: Pulse the bread in a food processor to coarse crumbs. Mix the parsley, garlic, and oil in a bowl. Stir the crumbs into the oil mixture to coat. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the mushrooms: Adjust an oven rack to the middle position and heat the oven to 450ºF. Line a rimmed baking sheet with foil and set a wire rack inside the baking sheet. Toss the mushrooms with the oil, lemon juice, salt, and pepper in a bowl. Arrange the mushrooms gill-side up on the rack and roast until the juices are released, about 20 minutes. Turn the caps oven and roast until the mushrooms are well-browned, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the mushrooms are roasting, make the stuffing: process all of the ingredients in a food processor until smooth. Set aside, or store in the refrigerator until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the baking sheet from the oven. Flip the mushrooms gill side up and cool slightly. Fill a zipper-lock plastic bag with stuffing and snip off one corner, then fill the mushrooms. Press each cap (stuffing side down) into the bread crumb topping to coat, and arrange the caps (topping side up) on the rack. Bake until the filling is hot and the topping is golden brown, about 10 minutes. Cool about 5 minutes before serving. (The unbaked, stuffed mushrooms can be stored, stuffing side up, on a paper towel-lined plate covered tightly with plastic wrap, and refrigerated for up to 3 days. The bread crumb topping can be refrigerated separately for up to 3 days. Add the crumb topping just before baking.)</p>"}]}