{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "corned beef hash", "hash", "Tom Douglas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Tom Douglas' Corned Beef Hash", "link": "https://www.seriouseats.com/recipes/2008/11/brunch-tom-douglas-corned-beef-hash-recipe.html", "description": "When the weather gets cooler I start craving corned beef hash. My friend Tom Douglas, perhaps Seattle's best-known chef-restaurateur (Dahlia Lounge, Palace Kitchen, and Etta's Seafood, among others), has a great corned beef hash recipe in his first book Tom...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Breakfast and Brunch"], "recipeIngredient": ["2 pounds uncooked corned beef", "1/2 pound Yukon Gold potatoes (or any smooth-skinned potato)", "5 tablespoons unsalted butter or a combination of butter and bacon fat", "2/3 cup diced sweet onions", "1 poblano chile, seeded and minced (about 2/3 cup)", "2 tablespoons plus 1 teaspoon Heinz Chili Sauce", "Kosher salt", "8 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the corned beef in a large pot and cover with water. Bring to a boil, then reduce the heat to a simmer and cook until very tender, about 3 hours, adding more water as needed to keep the meat covered.  Remove the corned beef from the pot and allow to cool.  Remove and discard the fat from the corned beef and shred the meat by pulling it apart with your fingers.  Roughly chop the shredded meat and set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the potatoes, then cut into 1/2-inch dice.  Place the potatoes in a pot of cold salted water and bring to a boil.  Reduce the heat to a simmer and cook jut until the potatoes are tender, about 15 minutes total cooking time. Drain the potatoes and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven 200 degrees. Melt tablespoons of the butter in a 12-inch saute pan over high heat.  Add the potatoes, onions, poblano, and carrot and fry, stirring occasionally, until the potatoes begin to brown and the vegetables are soft. Add the corned beef and stir in the chili sauce.  Season to taste with salt.  Add the remaining 2 tablespoons butter to the pan and continue to cook over high heat, tossing or turning the hash with a spatula, until it starts to get crisp and brown.  Set the pan in the oven to keep the hash warm while you prepare the eggs any way you like them: p</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pan in the oven to keep the hash warm while you fry the eggs over easy (or any other way you want to prepare the eggs).</p>"}]}