{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080718-piecrust-thumb.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["baking", "desserts", "pies", "Serious Eats Essentials"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Pie Crust", "link": "https://www.seriouseats.com/recipes/2008/07/essentials-pie-crust-recipe.html", "description": "Here’s a confession: until recently I did not really understand the appeal of pie. As a child I didn’t care for things that were crisp and buttery, like shortbread and crust, and that was that. In the past few years,...", "totalTime": "", "recipeYield": "2 9-inch crusts, for 1 double-crust pie or 2 bottom-crust pies", "recipeCategory": ["Desserts", "Serious Eats Essentials"], "recipeIngredient": ["2 sticks butter, cold, chopped into pieces", "2 cups flour", "1/2 tablespoon plus 1/2 teaspoon sugar", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse all ingredients in a food processor until they resemble coarse meal. With the machine running, add 1/4 cup ice water bit by bit until the dough comes together in a solid mass. This should take less than a minute and may not require all of the ice water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured surface and knead once or twice to pull together. Divide the dough in half. If you are making only one bottom-crust pie, shape one of the chunks of dough into a flattened disk, wrap very well in plastic wrap, and freeze until you are ready to use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough you are using into a 12-inch circle. I like to do this between two pieces of plastic wrap for easy handling. Line your pie plate with dough, crimp the edge if you like (or leave it rough-edged and floppy to be folded over the filling), and chill for 15 minutes before filling and baking.</p>"}]}