{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080810-shopsins-cover.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Eat Me: The Food and Philosophy of Kenny Shopsin", "Frank's hot sauce", "fried chicken", "Shopsin's", "tortilla chips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Taco-Fried Chicken", "link": "https://www.seriouseats.com/recipes/2008/09/kenny-shopsins-spicy-hot-taco-fried-chicken-recipe.html", "description": "The writer Calvin Trillin, a longtime patron of the original Shopsin's on Bedford Street in New York City, once took Kenny Shopsin to the bar in Buffalo, New York, where Buffalo wings were invented. The sauce there was a straightforward...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Deep Frying", "Fried Chicken", "Mains"], "recipeIngredient": ["Peanut oil for deep-frying", "All-purpose flour for dredging", "3 extra-large eggs", "1 1/2 cups heavy cream or milk or water", "1 to 2 cups crushed tortilla chips", "Four 5- to 6-ounce boneless, skinless chicken breasts", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a deep-fryer or a large potful of peanut oil over high heat to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour in a bowl big enough to fit one of the cutlets. In another similar size bowl, whisk the eggs and cream together. Put the crushed tortilla chips in a third bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large knife, with the flat side of the blade parallel to your cutting board, slice the chicken through the middle to form cutlets about 5/8 inch thick. Salt and pepper both sides of each cutlet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip a cutlet into the flour and turn it so that it is uniformly coated. Shake off any excess flour and dip the cutlet in the egg-cream mixture and then in the crushed tortilla chips. Repeat the dipping with as many cutlets as will fit in your deep fryer or pot without touching one another.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the cutlets into the oil and cook for 4 1/2 to 5 minutes, until the crust is a nice golden brown. Make sure the chicken is submerged while it is frying. Place on paper towels to drain. While the chicken is frying, repeat the dipping process with the remaining cutlets and fry them after the first batch is out of the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the Spicy Buffalo Wing Sauce into a bowl. Dump the sauce over the chicken just before serving.</p>"}]}