{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["barbecue", "chicken", "Cook the Book", "grilling", "Rick Browne", "The Best Barbecue on Earth", "yakitori"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Yakitori", "link": "https://www.seriouseats.com/recipes/2008/08/yakitori-recipe.html", "description": "The Japanese term yakitori literally means \"grilled bird,\" and refers to skewers of chicken barbecued over a charcoal grill. Commonly served in casual, inexpensive izakayas (Japanese drinking establishments with food beyond bar snacks) and beer gardens, yakitori is considered by...", "totalTime": null, "recipeYield": "4 to 6 appetizer servings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Cook the Book"], "recipeIngredient": ["1/4 cup soy sauce", "1/4 cup mirin (rice wine) or rice vinegar ", "1/4 cup sugar", "1 1/2 pounds boneless, skinless chicken breasts, cut into 1-inch cubes", "1/2 pound shiitake mushrooms", "2 red or yellow bell peppers, stemmed, seeded, and cut into 2-inch pieces", "5 green onions, green and white parts, cut into 2-inch lengths"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a charcoal or gas grill to 375ºF. Make sure the grill rack is clean and oil it thoroughly with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the soy sauce, mirin, and sugar. Add the chicken, mushrooms, and peppers; marinate for five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserving the marinade, remove the chicken from and vegetables from the bowl. Thread the chicken onto skewers and, separately, thread the mushrooms, peppers, and green onions on skewers as well. (Keep the chicken and vegetables separate so you can control the cooking time better.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the marinade into a saucepan and boil for 12 minutes to use as a basting and serving sauce. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the skewers to the prepared grill rack over direct heat. Cook, basting often with the sauce, five minutes per side, until the chicken is starting to brown on the edges and the vegetables are soft and charred at the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the skewers to a heated platter, drizzle with sauce, and serve. </p>"}]}