{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080211-bittersweet.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "bittersweet", "bittersweet chocolate", "books", "brownies", "chocolate", "Chocolate Lover's Library", "contests", "Cook the Book", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: The Serious Eats Chocolate Lover's Library", "link": "https://www.seriouseats.com/recipes/2008/02/cook-the-book-the-serious-eats-chocolate-love.html", "description": "This week's Cook the Book is a little different&#8212;and sweeter&#8212;than most. Usually, we feature one book the entire week, excerpting adapted recipes as the days go by. This week, in honor of Valentine's Day, we've put together a list of...", "totalTime": "", "recipeYield": "16 large or 25 smaller brownies", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["10 tablespoons (1 1/4 sticks) unsalted butter", "1 1/4 cups sugar", "3/4 cup plus 2 tablespoons unsweetened cocoa powder (natural or Dutch-process)", "1/4 teaspoon salt", "1/2 teaspoon pure vanilla extract", "2 cold large eggs ", "1/2 cup all-purpose flour ", "2/3 cup walnut or pecan pieces (optional) ", "<h5>Equipment</h5>", "8-inch square baking pan "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the lower third of the oven; preheat to 325&deg;F. Line the bottom and sides of baking pan with parchment paper or foil, leaving an overhang on two opposite sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the butter, sugar, cocoa, and salt in a medium heatproof bowl; set bowl in a wide skillet of barely simmering water. Stir from time to time until butter is melted and mixture is smooth and hot enough that you want to remove your finger fairly quickly after dipping it in to test. Remove bowl from skillet; set aside briefly until mixture is only warm, not hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the vanilla with a wooden spoon. Add the eggs one at a time, stirring vigorously after each. When batter looks thick, shiny, and well blended, add the flour; stir until you cannot see it any longer. Beat vigorously for 40 strokes with wooden spoon or rubber spatula. Stir in the nuts, if using. Spread evenly in lined pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until a toothpick inserted into center emerges slightly moist with batter, 20 to 25 minutes. Let cool completely on a rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift up the ends of the parchment or foil liner; transfer brownies to cutting board. Cut into 16 or 25 squares. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>Any unsweetened natural or Dutch-process cocoa powder works well here. Natural cocoa yields brownies with more flavor complexity and lots of tart, fruity notes. Durch-process cocoa results in a darker brownie with a mellower, old-fashioned chocolate pudding flavor.</p>"}]}