{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080730-peach-pudding2.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["peaches", "poach", "puddings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tipsy Summer Peach Pudding: The Best Use of a Wine-Poached Peach", "link": "https://www.seriouseats.com/recipes/2008/07/poaching-peaches-summer-tipsy-pudding.html", "description": "Eaten straight out of hand or cut up, a ripe peach is hard to beat. But, peach perfection is a fleeting thing, and the only way to forestall an impending perish? Cooking the fruit. Cobblers, pies and preserves all have...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Peach"], "recipeIngredient": ["<strong>For the cake</strong>", "1 1/4 cup fresh bread crumbs ", "1/2 cup sugar ", "2 eggs, separated", "Zest of one orange", "1 teaspoon vanilla extract", "Pinch of salt", "<strong>For poached peaches</strong>", "3-4 ripe peaches", "1 1/2 cups red wine", "1 cup fresh orange juice", "2 vanilla beans", "1/4 cup sugar", "<strong>To assemble</strong>", "Whipped cream, sweetened to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the cakes, preheat oven to 350° F. Grease six 4-ounce ramekins or eight standard muffin tins and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the bread crumbs by removing the crust of the bread and pulsing it in a food processor until fine, uniform crumbs form.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside two tablespoons of sugar. Combine the rest with the egg yolks, zest, and extract and beat with an electric mixer on high until very thick and lightly colored, about two minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the egg whites with a pinch of salt until frothy.  Add the reserved sugar little by little while continuing to beat the whites until soft peaks form.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently mix about a quarter of the whipped egg whites into the yolk mixture to lighten it.  Add this lightened yolk mixture to the remaining whites along with the bread crumbs and gently fold the ingredients together until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the mixture evenly among the ramekins or muffin tin cavities and bake cakes for about 20 minutes for ramekins, about 15 minutes for muffin tins, until cakes are lightly brown and just beginning to pull away from the sides of the pan. Cool the cakes upside down on a cooling rack.  When completely cool, run a paring knife around the outside of each cake to loosen and gently pry out if necessary. Cakes keep well in an airtight container for several days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the peaches, wash and dry the peaches and lightly score their blossom ends with a shallow \"X.\"</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the wine, juice, sugar and vanilla beans in a small, non-reactive sauce pan and heat until sugar dissolves and mixture just begins to steam.  Add peaches, stem-side down, set burner to medium-low and cover pot.  Poach for ten minutes, checking pot occasionally and adjusting the heat as necessary to ensure that the wine mixture maintains a low simmer but does not reach a full boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the lid and gently turn each peach to submerge its uncooked side in the cooking liquid.  Replace lid, continue to cook over low heat for five minutes.  Remove pot from heat and leave peaches to soak, covered for an additional five to ten minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove peaches to a plate to cool.  Place saucepan with wine mixture over medium-high heat and reduce to 1 1/2 cups liquid. (Peaches may be served immediately or refrigerated, submerged in their poaching liquid, for several days.  Peaches will become more deeply flavored and colored by the poaching liquid as they soak.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve each cake with ½ of a poached peach, about ¼ cup of the poaching liquid and a dollop of whipped cream.</p>"}]}