{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080905-dinner-tonight-mushrooms.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chives", "mushrooms", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Cremini Mushrooms with Pureed Chives and Pasta", "link": "https://www.seriouseats.com/recipes/2008/09/cremini-mushrooms-with-chive-pasta-recipe.html", "description": "Photograph by kitchenbeard on Flickr It had everything in a pasta I could ever want: high heat and minimal ingredients. The mushrooms were to be grilled until nearly blackened, then everything would be perfumed with pureed chives. I was...", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Mushrooms"], "recipeIngredient": ["1/2 pound mushrooms, cremini or button, stems removed", "5 tablespoons olive oil", "1/2 cup chives, chopped", "1/2 pound angel hair pasta", "Pecorino Romano", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a grill pan or grill to high heat.  Dump the mushrooms into a large bowl.  Pour in 2 tablespoons of olive oil, and toss until coated.  Set the mushrooms on the grill pan and cook for about 8 minutes, turning once.  When done and slightly cooled, cut into quarters. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rest of the olive oil into a food processor along with the chives and a pinch of salt and pepper.  Process until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to a boil.  Cook the pasta according the instructions on the box.  When done, save a 1/2 cup of pasta water and drain the pasta.  In a large bowl mix the pasta with the chive oil and mushrooms.  Add some pasta water if it is too dry.  Season with salt if needed, and sprinkle with grated pecorino Romano.   </p>"}]}