{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080811-dt-frittata-thumb.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["brunch", "Dinner Tonight", "eggs", "frittatas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Frittata with Corn, Scallion, and Potato", "link": "https://www.seriouseats.com/recipes/2008/08/frittata-with-corn-scallion-and-potato-recipe.html", "description": "Since I had some corn and potatoes on hand that I wanted to use up, I did a quick search on Epicurious for an appropriate recipe, resulting in this one for corn, scallion, and potato frittata. I'm not sure why...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mains", "Vegetarian"], "recipeIngredient": ["1 large russet potato (or other baking potato), peeled and diced into 1/4 inch pieces", "4 eggs", "2 cups corn kernels (about 2 cobs worth of corn)", "1 bunch scallions, separate white and green part and chop both", "2 cloves garlic, minced", "3 tablespoons olive oil", "4 ounces mozzarella, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an iron skillet or oven safe skillet, pour in 2 tablespoons of the olive oil and turn the heat to medium.  Add the chopped white parts of the scallions and the garlic.  Saute for 2 minutes until softened.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the diced potato, turn the heat to medium-low and cook until soft, about 10 to 15 minutes.  Add the corn kernels, season with salt and pepper, and cook for 1 minute if corn is frozen and 3 minutes if fresh.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the eggs, green parts of the scallion and mozzarella.  Pour in the potato mixture, and stir until well combined.  Wipe out the skillet.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the last tablespoon of the oil into the now clean skillet.  Turn the heat to medium-high.  Dump in the egg mixture and cook for 6 minutes, shaking the pan every 1 minute or so to keep it from sticking.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Then place the skillet underneath the broiler and cook for 2 to 3 minutes, or until the top is golden brown.  Remove from the broiler, and slide onto a plate.  Season with salt and pepper, carve like a pie, and eat. </p>"}]}