{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/deviledeggs.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Alice Waters", "deviled eggs", "Serious Eats Essentials", "The Art of Simple Food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Stuffed Eggs", "link": "https://www.seriouseats.com/recipes/2008/03/essentials-alice-waters-stuffed-deviled-eggs-recipe.html", "description": "Since I don’t go to church and am not crazy about holidays whose secular celebrations feature chocolate and candy, Easter barely registers on my seasonal radar. If you, on the other hand, have a bunch of pastel hard-boiled eggs around,...", "totalTime": "", "recipeYield": "12 half eggs", "recipeCategory": ["Deviled Eggs", "Serious Eats Essentials"], "recipeIngredient": ["6 eggs at room temperature", "Salt", "Fresh-ground black pepper", "3 tablespoons homemade mayonnaise", "1 teaspoon Dijon mustard", "Optional: chopped chives, chopped parsley, paprika, garlic, capers", "1 egg yolk", "1/2 teaspoon lemon juice or white wine vinegar, plus a dash extra", "Salt", "1 cup olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium pot with water and bring to a boil. Add the eggs and simmer for 9 minutes. Drain the eggs and chill in ice water until cooled. If you’re going to color the eggs, I suppose now’s the time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the eggs, cut them in half lengthwise, and scoop the yolks into a bowl. Set the whites on a platter, cut side up, and sprinkle with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a fork to mash the eggs with the mayonnaise, mustard, and salt and pepper to taste. If the mixture is very thick, add cold water 1 teaspoon at a time until the consistency is right. Taste for seasoning; fill the whites with the yolk mixture. If not serving within an hour, refrigerate until ready to eat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You may simply sprinkle the eggs with chopped chives and/or parsley or dust them with paprika. For extra flavor, you may mash into the yolk mixture chopped herbs, paprika, a tiny bit of pounded garlic, or chopped capers. My favorite combination is a tiny bit of garlic mixed into the yolk with minced chives sprinkled on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Mayonnaise</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-makes about 1 cup-</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Adapted from </em>The Art of Simple Food</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the yolk in a bowl with the lemon juice or vinegar and a pinch of salt. Whisk well, until the salt has dissolved and the yolk has thickened a bit. Slowly dribble the olive oil into the egg yolk mixture, whisking constantly. As yolk absorbs the oil, the sauce will thicken, lighten in color, and become opaque. Once this happens, you can begin to add the oil a little faster, in a thin but constant stream, whisking all the while. Taste and whisk in another dash of vinegar or lemon juice if it needs brightening.</p>"}]}