{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Bobby Flay", "Bobby Flay's Grill It!", "Cook the Book", "cookbooks", "grilling", "rice noodles", "scallops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Scallops with Citrus-Ginger Sauce and Rice Noodle Salad", "link": "https://www.seriouseats.com/recipes/2008/08/grilled-scallops-with-citrus-ginger-sauce-and-rice-noodle-salad-recipe.html", "description": "Grilling is most often associated with bold, forthright flavors&mdash;thick sauces, fiery spices, and lots of meat&mdash;but there are delicate options out there that are just as delectable. Today's Cook the Book recipe, excerpted from Bobby Flay's Grill It! combines tender...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Other Seafood"], "recipeIngredient": ["2 teaspoons toasted sesame oil ", "4 tablespoons canola oil ", "2 tablespoons grated orange zest ", "12 large sea scallops, muscle removed ", "1 tablespoon finely grated peeled fresh ginger ", "1/2 teaspoon red chile flakes ", "2 cups orange juice (not from concentrate) ", "Juice of 1 lime ", "2 tablespoons light brown sugar ", "1 tablespoon low-sodium soy sauce ", "2 tablespoons rice wine vinegar ", "Kosher salt ", "8 ounces rice noodles ", "Freshly ground black pepper ", "2 green onions, white and green parts, thinly sliced ", "1 tablespoon sesame seeds, toasted "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the sesame oil, 2 tablespoons of the canola oil, and the orange zest in a medium bowl. Add the scallops and let marinate in the refrigerator for at least 15 minutes and up to 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 2 tablespoons canola oil in a medium saucepan over medium heat. Add the ginger and red chile flakes and cook until the ginger is salt, about 2 minutes. Increase the heat to high, add the orange juice, lime juice, brown sugar, and soy sauce, and simmer, stirring occasionally, until the mixture is reduced by half, 8 to 10 minutes. Remove from the heat, stir in the rice vinegar, and let cool to room temperature. The sauce can be made 8 hours in advance, covered, and refrigerated. Bring to room temperature before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil over high heat. Add the noodles and cook until al dente, 3 to 4 minutes. Drain, rinse with cold water, and drain again. Transfer to a platter and toss with half of the citrus-ginger sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your grill to high. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the scallops on both sides with salt and pepper. Place the scallops on the grill and grill until golden brown and slightly charred, about 3 minutes. Turn over and continue cooking for about 3 minutes longer until just cooked through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the scallops on top of the noodles and drizzle with the remaining citrus-ginger sauce. Garnish with green onions and sesame seeds. </p>"}]}