{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081210-cookiecutters.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["chocolate", "Cookies", "holiday baking", "holiday sweets", "Martha Stewart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Cookies: Martha Stewart's Chocolate Cookie Cutouts", "link": "https://www.seriouseats.com/recipes/2008/12/martha-stewart-chocolate-cookie-cutouts-recipe.html", "description": "Photograph from Bethany L King on Flickr Today's chocolate cutouts come from Martha Stewart's Cookies, a mighty tome often cited as the absolute last word in baking. Dark and crisp, the cookies have two distinct advantages over the standard...", "totalTime": null, "recipeYield": "3 to 4 dozen", "recipeCategory": ["Desserts"], "recipeIngredient": ["1 1/2 cups all-purpose flour, plus more for dusting", "1/2 cup plus 2 tablespoons unsweetened Dutch-process cocoa powder", "1/8 teaspoon salt", "1/4 teaspoon ground cinnamon", "3/4 cup (1 1/2 sticks) unsalted butter, room temperature", "1 1/2 cups sifted confectioners' sugar", "1 large egg, lightly beaten", "1/2 teaspoon pure vanilla extract", "Nonpareils, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift flour, cocoa powder, salt, and cinnamon into a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put butter and confectioners' sugar in the bowl of an electric mixer fitted with the paddle attachment. Mix on medium-high speed until pale and fluffy, about 3 minutes. mix in egga nd vanilla. Reduce speed to low. Gradually mix in flour mixture. Wrap dough in plastic wrap. Refrigerate until firm, 1 hour or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured work surface, roll out dough to 1/8-inch thick. Transfer to a parchment paper-lined baking sheet. Chill in freezer 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees F. Using a 3-inch cookie cutter, quickly cut out shapes from dough (if dough begins to soften, chill it in freezer 3 to 5 minutes). Reroll and cut scraps. Transfer shapes to prepared baking sheets, spacing them 2 inches apart. Brush flour from shapes. Sprinkle with nonpareils, if using. Chill in freezer until firm, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cookies until crisp, about 9 minutes. Let cool completely on sheets on wire racks. Cookie can be stored betwween layers of parchment in an airtight container at room temperature up to 1 week. </p>"}]}