{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080528-lemons-thumb.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cake", "Cooking Light", "dessert", "lemon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Everyone Loves a Lemon Layer Cake", "link": "https://www.seriouseats.com/recipes/2008/05/nathans-lemon-cake-recipe.html", "description": "My parents' birthdays are four days apart, so usually I just make one cake for them both. Every year it poses a bit of a challenge. My mom is fond of carrot cake, cream cheese frosting, and chocolate, while my dad is more of a plain butter cake or upside-down fruit kind of guy. The one flavor they both love? Lemon.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts", "Lemon"], "recipeIngredient": ["<strong>For the Cake:</strong>", "Cooking spray", "2 tablespoons all-purpose flour", "2 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 1/2 cups granulated sugar", "1/2 cup unsalted butter, softened", "3 large eggs", "1 cup nonfat buttermilk", "2 tablespoons finely grated lemon rind", "2 tablespoons fresh lemon juice", "<strong>For the icing:</strong>", "3 cups powdered sugar", "1/4 cup unsalted butter, melted", "1 tablespoon lemon rind", "1/4 cup fresh lemon juice", "Lemon rind strips or fresh raspberries, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees. Coat 2 (8-inch) round cake pans with cooking spray; line bottoms of pans with wax paper. Coat wax paper with cooking spray. Dust pans with 2 tablespoons flour, and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly spoon 2 cups flour into dry measuring cups, and level with a knife. Combine 2 cups flour, baking powder, baking soda, and salt, stirring with a whisk. Place granulated sugar and 1/2 cup butter in a large bowl; beat with a mixer at medium speed until well blended (about 5 minutes). Add eggs, one at a time, beating well after each addition. Add flour mixture and nonfat buttermilk alternately to sugar mixture, beginning and ending with the flour mixture. Beat in 2 tablespoons lemon rind and 2 tablespoons lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour batter into prepared pans; sharply tap pans once on counter to remove air bubbles. Bake at 350°F for 32 minutes or until a wooden pick inserted in center comes out clean. Cool in pans 10 minutes on a wire rack; remove from pans. Cool completely on wire rack; remove wax paper from cake layers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare icing, combine powdered sugar and the remaining ingredients (except lemon rind strips) in a large bowl; stir with a whisk until smooth. Place 1 cake layer on a plate; spread half of icing on top of cake. Top with remaining cake layer. Spread remaining half of icing over top of cake. Garnish with lemon rind strips or raspberries, if desired. Store cake loosely covered in the refrigerator. </p>"}]}