{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081207bittman_howtocookeverything.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "How to Cook Everything", "Mark Bittman", "Super Bowl dips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Skordalia, with Three Variations", "link": "https://www.seriouseats.com/recipes/2008/12/mark-bittman-how-to-cook-everything-skordalia-recipe.html", "description": "Skordalia is a thick spread of Greek origin. Its name may be a compound of Greek and Italian words meaning \"garlic\" and \"garlicky\"&mdash;any dish named \"garlicky garlic\" sounds pretty promising to me. Garlic aside, skordalia is a creamy, mayo-like dip...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 thick slice day-old bread", "About 1 1/2 cups stock, milk or water", "2 tablespoons extra virgin olive oil, plus more if needed", "1 cup walnuts", "2 cloves garlic, peeled, or to taste", "1/4 teaspoon cayenne or 1 teaspoon not-too-hot ground dried chile, or to taste", "1 tablespoon freshly squeezed lemon juice, or to taste", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the bread in a bowl and saturate it with some of the liquid. Squeeze bread to drain off excess, then put it in a food processor with the oil, nuts, garlic, and cayenne. Process the mixture until the walnuts are ground, then, with the machine running, pour in enough of the remaining liquid and more olive oil to form a creamy sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lemon juice and some salt and pepper and serve immediately or cover and refrigerate for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Variations:</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Taramasalata:</em> The classic fish roe pur&eacute;e from Greece: In Step 2, add a 7- or 8-ounce jar of tarama (salted mullet, cod, or salmon roe); mash lightly; you will probably need more lemon juice to cut the richness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Artichoke Dip:</em> With fresh artichoke hearts, just brilliant, but pretty good with frozen (thawed, of course) as well: If you like, reduce the garlic and omit the cayenne from Step 1. In Step 2, leave the mixture in the food processor and add 1 cup cooked artichoke hearts; pulse the machine until they are well integrated and chopped but not pur&eacute;ed. Proceed with the recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Olive Dip:</em> If you have tapenade, just stir that into the skordalia, to taste. Or use 1 teaspoon fresh thyme or sage leaves in place of the cayenne. In Step 2, leave the mixture in the food processor and add 1 cup pitted black olives, preferably a mixture of oil cured and kalamata; pulse the machine until they are well integrated and chopped.</p>"}]}