{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Lynne Rossetto Kasper", "Sally Swift", "The Splendid Table", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Tomato-Cheddar-Packed Turkey Burgers", "link": "https://www.seriouseats.com/recipes/2008/06/tomato-cheddar-packed-turkey-burgers-recipe.html", "description": "From beef to veggie, tuna to mushroom, mini-slider to double-decker, I love burgers of all kinds. The one patty that can prove problematic? Turkey. It's hard to keep ground poultry from drying out. Even carefully cooked chicken and turkey burgers...", "totalTime": "", "recipeYield": "4 generous burgers", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["4 tablespoons good-tasting extra-virgin olive oil", "1 large onion, finely chopped", "1 cup grape tomatoes, halved; or 1 large ripe tomato, diced", "Salt and freshly ground black pepper", "2 large garlic cloves, finely chopped", "1 pound ground turkey (organic, and half light and half dark meat if possible)", "1/4 cup dry white or red wine", "2 to 3 ounces extra-sharp cheddar cheese, cut into 1/4- to 1/2-inch cubes", "4 large hamburger buns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the oil in a 12-inch nonstick skillet over high heat. Add the onions and tomatoes with generous sprinkles of salt and pepper. Sauté over high heat, stirring frequently, until the onions begin to brown, about three minutes. Add the garlic and sauté for 1 more minute. Remove the skillet from the heat. Scoop half of the onion mixture into a large bowl and the rest into a small one. Rinse the skillet and dry it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add to the large bowl the ground turkey, 1/4 teaspoon salt, 1/8 teaspoon pepper, and the wine. Blend well, and shape the mixture into 4 balls. Make a deep hole in each ball with your thumb, and insert one-forth of the cheese into each hole. Pinch the holes closed, and flatten the balls into 3/4 to 1-inch thick patties with no sign of cheese on the outside. The patties will be very soft and sticky. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 2 tablespoons olive oil in the same skillet over medium-high heat. Sear the burgers for about 30 seconds on each side, until they are browned. Turn them carefully with a pancake spatula, as they are quite fragile. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the heat to medium low and cook the burgers for about 5 minutes per side, or until there is no pink at the center and an instant-reading thermometer measures at least 150°F. Serve them hot on the buns, topping each one with some of the reserved onions and your favorite condiments. </p>"}]}