{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Cook with Jamie", "Jamie Oliver", "pork", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Old-School Pork Chops with Apple and Sage", "link": "https://www.seriouseats.com/recipes/2008/02/old-school-pork-chops-with-apple-and-sage-recipe.html", "description": "The following recipe is from the February 6th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Pork, apple and stilton? That's three food groups! Four if you count the sage leaves. Combine...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mains", "Pork"], "recipeIngredient": ["Four 9-ounce pork chops, preferably free-range or organic ", "Sea salt and freshly ground black pepper ", "Olive oil ", "2 good eating apples (e.g. Mcintosh or Cox), unpeeled, cored and each cut into 8 wedges ", "A knob of butter (a couple of tablespoons)", "A handful of fresh sage leaves ", "3 1/2 ounces good strong cheese like Stilton or taleggio (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. What I like to do is to lay the pork chops out on a board and, using a sharp knife, make 1-inch-deep cuts all along the fatty side of them. You can even ask your butcher to do this for you if you like. It helps to render the fat out and will also make the skin crispy. Sprinkle the chops with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chops are nearly done, lift them out of the pan and put them in an oiled baking pan. Add the apple wedges and a knob of butter to the pan and fry until lightly golden. Lay 4 wedges of apple on top of each pork chop. Dress your sage leaves in a little olive oil and top each apple stack with them. Sometimes I like to top it all off with a knob of Stilton or taleggio. Put the baking pan into the oven for 4 to 6 minutes until everything is golden and melted. </p>"}]}