{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20081020-apple-thumb.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["An Apple a Week", "apples", "caramel apples", "desserts", "fall", "fruit"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "An Apple a Week: Calvados Caramel Apples with Salted Walnuts", "link": "https://www.seriouseats.com/recipes/2008/10/an-apple-a-week-calvados-caramel-apples-with.html", "description": "Some take the high road, and some take the low. But me, I like to walk somewhere in the middle. When figuring out how to \"caramel\" my apples from apple-picking, I knew I didn't want the sugar sheet wrap-on caramel,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Apple"], "recipeIngredient": ["6 medium apples", "2 bags of individually wrapped Kraft caramels (about 50 caramels totals)", "1/4 cup Calvados (alternatively, use regular brandy, apple cider, or apple juice)", "1 cup of walnuts, toasted in a 300 degree oven for 10 minutes, chopped (you could also use pecans)", "1 teaspoon of course sea salt, Maldon salt, or fleur de sel (use only 1/2 teaspoon if using regular fine salt)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and completely dry the apples.  Insert a stick into the stem end of each apple.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the Calvados and caramels to a heavy-bottomed sauce pot over low heat.  Stir occasionally for 15 minutes, until the caramel is melted.  If you find the caramel is too thick for successful dipping, shut of the heat, add a little more Calvados, and turn on the heat again.  With brandy, flare ups are possible, so use caution.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the walnuts and salt into a bowl and combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the apples into the melted caramel, using a spoon to help it along.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the bottom of the apple into the walnut-salt mixture, making sure the caramel sticks to both.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool on a Silpat or buttered wax paper for 30 minutes.</p>"}]}