{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080819-eggplantzies.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["chard", "Eating for Two", "eggplant", "lasagna", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eating for Two: Lasagna with Eggplant and Chard", "link": "https://www.seriouseats.com/recipes/2008/08/lasagna-with-eggplant-and-chard-recipe.html", "description": "&copy;iStockPhoto.com/imagestock I'm due in about two weeks and my head is spinning. In between tying up loose ends with work and making the apartment baby-ready, I consider all the things I won’t be able to do for a while,...", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Eggplant", "Lasagna", "Vegetarian"], "recipeIngredient": ["1 box lasagna noodles", "1 1/2 pounds eggplant, sliced crosswise 1/4 inch thick", "2 tablespoons olive oil, plus extra for the eggplant", "2 tablespoons butter", "1/2 onion, finely diced", "3 garlic cloves, finely chopped", "1 bunch green chard, about 1 1/2 pounds, stems removed", "Salt and freshly milled pepper", "1/2 cup dry white wine (I usually substitute water unless I happen to have a bottle of wine or vermouth open)", "1 cup ricotta", "1 egg", "1 cup tomato sauce (your favorite; make sure it is well seasoned)", "3/4 cup grated pecorino romano", "8 ounces fresh mozzarella, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the lasagna noodles according to package instructions. Unless it is garden fresh, salt the eggplant, let stand 30 minutes, then blot dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Brush both sides of the eggplant slices lightly with oil. Place the slices on a sheet pan and bake, turning once, until browned on both sides, about 30 minutes in all. Chop coarsely. Do not turn off oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil and the butter in a large skillet. Add the onion and garlic and cook over medium heat for about 3 minutes, stirring frequently. Add the chard, sprinkle with 1/2 teaspoon salt, and cook until wilted, about 5 minutes. Add the wine, cover, and cook until the chard is tender and the pan is dry, about 10 minutes. Turn the mixture out onto a cutting board and chop finely.  In a bowl, mix together the ricotta, 1/3 cup water, and the egg, then stir in the chard. Taste and season with salt and freshly ground pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Oil a 9x13 inch baking dish. Spread 1/3 cup tomato sauce over the bottom and cover with a layer of pasta. Scatter a quarter of the grated cheese over the top and add a quarter of the eggplant, ricotta mixture, and mozzarella. Follow with another layer of pasta and repeat for three more layers. End with a layer of pasta and the remaining sauce. Cover with foil, tenting it above the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in the 400°F oven 20 to 30 minutes or until heated through. Remove the foil and bake 5 to 10 minutes more.</p>"}]}