{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081020-cookscountry.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["America's Test Kitchen", "chicken", "Cook the Book", "mushrooms", "The Cook's Country Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken and Mushroom Fricassee", "link": "https://www.seriouseats.com/recipes/2008/10/chicken-and-mushroom-fricassee-recipe.html", "description": "Chicken fricassee has always struck me as a somewhat outdated dish; something my grandmother would have prepared for a weeknight meal, probably without even following a recipe, the ingredients and amounts long since committed to memory. Ever intent on rescuing...", "totalTime": null, "recipeYield": "4 servings", "recipeCategory": ["Chicken", "Cook the Book", "Mains", "Mushrooms"], "recipeIngredient": ["4 bone-in, sin-on split chicken breasts (about 3 pounds), ribs removed", "Salt and pepper", "2 teaspoons vegetable oil", "2 onions, minced", "6 garlic cloves, minced", "12 ounces white mushrooms, sliced thin", "4 large portobello mushroom caps (about 12 ounces), gills removed, halved and sliced thin", "1 tablespoon minced fresh thyme", "1/4 cup all-purpose flour", "1 cup low-sodium chicken broth", "1 cup low-sodium beef broth", "1 cup white wine", "1/3 cup heavy cream", "4 teaspoons fresh lemon juice", "2 tablespoons chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the chicken dry with paper towels and season with salt and pepper. Heat the oil in a Dutch oven over medium-high heat until just smoking. Cook the chicken, skin side down, until deep golden brown, about 6 minutes. Flip and brown on the second side, about 3 minutes. Transfer the chicken to a plate; remove and discard the skin. Pour off all but 1 tablespoon fat from the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the onions in the remaining fat until golden, about 5 minutes. Stir in the garlic and cook until fragrant, about 30 seconds. Add the mushrooms, thyme, and 1/4 teaspoon salt. Reduce the heat to medium and cook, covered, stirring occasionally, until the mushrooms have released their juices, about 10 minutes. Uncover and cook until the liquid evaporates and the mushrooms begin to brown, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the flour and cook until golden, about 1 minute. Slowly stir in the broths and wine and bring to a boil. Return chicken and any accumulated juices to the pot. Reduce the heat to low and simmer, covered, until the meat registers 160ºF on an instant-read thermometer, 20 to 30 minutes. Transfer the chicken to a serving platter and tent with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cream to the pot and simmer until the sauce is thickened, about 15 minutes. Stir in the lemon juice and parsley and season with salt and pepper to taste. Pour the sauce over the chicken. Serve. </p>"}]}