{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080530-essentials-icecream-thumb.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["desserts", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Vanilla Ice Cream", "link": "https://www.seriouseats.com/recipes/2008/05/essentials-vanilla-ice-cream-recipe.html", "description": "If I had to make a lifetime commitment to one dessert, forsaking all others, I would probably choose vanilla ice cream. Maybe we’d spice things up sometimes with caramel sauce or a gingersnap on the side, but my heart would...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts", "Serious Eats Essentials"], "recipeIngredient": ["4-inch piece of vanilla bean", "1 cup half-and-half", "2 cups whipping cream", "2/3 cup sugar", "6 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split the vanilla bean in half lengthwise and scrape the fine black seeds into a non-corroding saucepan. Add the vanilla bean pod, half-and-half, cream, and sugar, and warm the mixture, stirring occasionally, until the sugar has dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the egg yolks just enough to mix them and whisk in some of the hot half-and-half mixture. Return to the pan and cook over low heat, stirring constantly, until the custard coats the spoon (when you draw a finger across the custard coating the back of the spoon, your finger should leave a clear trail). (I am hopeless with the “coats the spoon test,” so I usually use a candy thermometer and watch until the custard hits 170-175°F. This is the point at which it is finished cooking.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain through a medium-fine strainer to remove any lumps that may have formed, scraping as much of the vanilla bean through the strainer as you can. Strain the custard into a storage container, recovering the vanilla bean pods from the strainer and putting them in the container to flavor the ice cream mixture while it chills. Cover the container tightly and chill the custard thoroughly (preferably over night). When you are ready to freeze the mixture, remove the vanilla bean pods. Freeze according to the directions for your ice cream maker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frozen desserts should be stored in non-reactive containers—plastic or glass—tightly covered. Aluminum foil must not contact their surfaces. They should be stored at 0°F for best quality but warmed to 5°F to 7°F before serving.</p>"}]}