{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "mains", "poultry", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Flattened Chicken Breasts with Shallot and White Wine Sauce", "link": "https://www.seriouseats.com/recipes/2008/08/flattened-chicken-breasts-with-shallot-and-white-wine-sauce-recipe.html", "description": "I decided to try this Cook's Illustrated recipe for saut&eacute;ed chicken cutlets mainly for the accompanying shallot and white wine sauce, besides that I got a great new skillet and wanted to put it to some good use. It just...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "Condiments and Sauces", "Mains"], "recipeIngredient": ["2 boneless, skinless, chicken breasts", "4 teaspoons vegetable oil ", "1/2 medium shallot, minced", "6 tablespoons chicken broth ", "1/4 cup dry white wine", "1/2 teaspoon fresh thyme, minced", "1 1/2 tablespoons butter", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear off two large pieces of plastic wrap.  Smear a teaspoon of oil in between the pieces.  Lay a breast in between, then pound with a mallet or a large pot until the meat is about 1/4 inch thick.  Repeat with the other four cutlets.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the 4 cuts with salt and pepper.  Pour 2 teaspoons of the vegetable oil into a large skillet over medium-high heat.  When hot, place two of the cutlets in skillet and cook for two minutes.  Flip and cook for 15-30 seconds, or until firm to the touch.  Transfer to a plate and cover with foil.  Cook the other two fillets in the same way.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skillet from the heat, and add 1 teaspoon of oil and the shallot.  Cook the shallot with the residual heat of the skillet for about 30 seconds.  Return to the medium-high heat and pour in the white wine and chicken broth.  Scrap the skillet with a pair tongs to dislodge the brown bits on the bottom.  Bring to a boil, then reduce to a simmer and cook until reduced by to about 1/2 cup, about 5 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter, 1/2 tablespoon at a time, to the skillet.  Stir until incorporated and add more butter.  Sprinkle in the thyme and season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Plate the chicken pieces and pour the sauce on top.       </p>"}]}