{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["A Twist of the Wrist", "beef", "horseradish", "mashed potatoes", "Nancy Silverton"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Seared Beef Filet with Horseradish-Spiked Mashed Potatoes and Horseradish Cream", "link": "https://www.seriouseats.com/recipes/2008/01/seared-beef-filet-with-horseradish-mashed-potatoes-recipe.html", "description": "On Sundays when I was growing up we would frequently have grilled steak and pizza for dinner. I have no idea what my mother's rationale was for serving such an unlikely but delicious combination, but I have to tell you...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["<strong>For the horseradish cream:</strong>", "1/4 cup grated peeled fresh horseradish (from 1 2-inch piece)", "2 tablespoons crème fraîche (or sour cream)", "1 heaping tablespoon prepared horseradish", "1 teaspoon kosher salt", "10 drops Tabasco sauce", "2 drops Worcestershire sauce", "Freshly ground black pepper", "<strong>For the potatoes: </strong>", "16 canned or jarred potatoes (from 2 12-ounce jars or 2 15-ounce cans)", "1/2 cup cream", "2 tablespoons unsalted butter", "4 large garlic cloves, grated or minced (about 1 tablespoon)", "1 teaspoon kosher salt", "2 tablespoons crème fraîche (or sour cream)", "4 six-ounce beef filets (about 3/4 inch thick)", "Kosher salt and freshly ground black pepper", "1/4 cup canola oil (or other neutral-flavored oil)", "Peeled fresh horseradish, for grating", "30 fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the horseradish cream, stir the grated horseradish, crème fraîche, prepapred horseradish, kosher salt, Tabasco, Worcestershire, and freshly ground black pepper together in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the mashed potatoes, break the potatoes up into 1-inch pieces. Combine them in a medium saucepan with the cream, butter, garlic, and salt. Put the pan over high heat and bring the potatoes to a boil, stirring often. Reduce heat and simmer potatoes 5 minutes, stirring occasionally. Remove pan from heat; use a handheld immersion blender to purée the potatoes 10 to 15 seconds, until they're mashed but still slightly lumpy (or mash them with a potato masher or purée them in a food mill). Stir in the crème fraîche and cover.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season both sides of the steaks with kosher salt and black pepper. Heat the canola oil in a large skillet over high heat for 2 to 3 minutes, until the oil's almost smoking (you will begin to smell the oil at this point). Place steaks in the skillet and sear them on one side for 2 minutes if you want them medium-rare, 4 minutes for medium. Flip the steaks, turn off the heat, and let them sit in the skillet until the skillet goes quiet, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the potatoes onto each of four plates, dividing them evenly and smashing them down slightly to create a bed for the steak. Grate about 1 tablespoon of fresh horseradish and use scissors to snip about 1 tablespoon of chives over each serving. Lay the steaks on the potatoes first-cooked side up, dollop 1 tablespoon of the horseradish cream on each steak and serve with the remaining horseradish cream on the side.</p>"}]}