{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080924-squash-gnocchi.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["fall recipes", "gnocchi", "sauces", "squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Squash Gnocchi with Meat Sauce", "link": "https://www.seriouseats.com/recipes/2008/09/squash-gnocchi-with-meat-sauce-recipe.html", "description": "Squash. Photograph by Robyn Lee. I've made potato gnocchi and ricotta gnocchi before, but I've never branched out beyond that--nor realized I could. But it does make sense. The idea that squash could be turned into gnocchi immediately grabbed...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight"], "recipeIngredient": ["1/2 pound ground beef", "1/2 pound ground pork", "1 tablespoons olive oil", "Salt and pepper", "1 onion, chopped", "1 28-ounce can peeled whole tomatoes, chopped", "1 butternut squash, quartered and seeds removed", "2 eggs ", "1 cup flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350.  Place the squash in a roasting pan, cover with foil, and place in the oven.  Cook for an hour.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toss the pork and beef into a large skillet over medium heat.  Cook, breaking up the chunks with a wooden spoon, until browned.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, the oil into a large pot over medium heat, add the onion, and cook until soft, about 20 minutes.  Dump the tomatoes with the juices, then reduce the heat and simmer.  Pour off as much fat from the meat as possible and then add it to the pot.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil.  When the squash is done, scoop out the flesh and place in a large bowl.  Mash with a potato masher for a few minutes.  Add the eggs and mash some more.  Add the flour and work it in with your hands, until it forms a soft dough.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a tablespoon, sccop up some batter and use a second tablespoon to scrap the dough off into the boiling water.  Cook until the gnocchi rise to the top of the water and transfer to a warm platter.  Repeat with the rest of the dough.  Serve the sauce over the gnocchi and season with salt.  </p>"}]}