{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080218-jamie.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Cook with Jamie", "Jamie Oliver", "leeks", "sides", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Slow-Cooked Leek Soldiers with Bacon", "link": "https://www.seriouseats.com/recipes/2008/02/cook-the-book-slow-cooked-leeks-with-bacon.html", "description": "Today's Cook the Book recipe (adapted from Cook with Jamie by Jamie Oliver) is a slow-cooked leek dish that delivers the true flavor of the vegetable by asking you to keep the leeks whole while still finely slicing up the...", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Bacon", "Cook the Book", "Pork", "Sides"], "recipeIngredient": ["12 leeks olive oil ", "4 cloves of garlic, peeled and finely sliced ", "Small bunch of fresh thyme, leaves picked", "Butter ", "Wineglass of white wine", "1 cup chicken or vegetable stock ", "8 slices of bacon "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F. Ideally you want to use a 10-inch buttered ovenproof dish that's about 1 1/2 inches high. Trim the ends of the leeks and discard the outer two or three layers. Cut off the dark-green tops, leaving the remaining pale-green and white sections in 2-inch pieces. Wash and finely slice the dark-green parts; place  them in a frying pan with a couple tablespoons of olive oil and the garlic, thyme, and butter. Cook about 10 minutes, until softened, and spread them out in the bottom of prepared dish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stand remaining pieces of leek upright next to each other in the dish. Pack them in tightly so the flavors from underneath, and from the bacon that goes on top, will cook subtly and evenly through the leeks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine and stock; lay the bacon over the top. Take a big strip of waxed paper, wet it under the faucet, and scrunch it up. Fit this snugly over and around the leeks and bacon; cover with a layer of aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dish in oven for about an hour. Leeks should be nice and tender by this point, but if not, give them a little longer (cooking time depends on size and age of leeks). Once tender and soft, remove foil and waxed paper; put dish back in oven for 20 minutes, or until bacon is crisp and golden. Remove bacon, chop it finely. Taste the juice in the dish for seasoning; adjust as needed. Serve leeks sprinkled with the crisp bacon.</p>"}]}