{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081029-cherryzinger.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["baking", "cranberry", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Zingers", "link": "https://www.seriouseats.com/recipes/2008/10/cranberry-zingers-recipe.html", "description": "The pressures of coming up with regular specials are very new to me. In my previous restaurant position, all of my new dishes had to meet with the approval of the owner and the director of creative development before they...", "totalTime": "", "recipeYield": "about 8 cakes", "recipeCategory": ["Cranberry", "Desserts"], "recipeIngredient": ["<strong>For the cake:</strong>", "1 cup plus 2 tablespoons AP flour (135g)", "3/8 teaspoon baking soda ", "1/8 teaspoon salt", "1 large egg", "1/2 cup sugar (105g)", "1 teaspoon lemon juice", "5 tablespoons canola or vegetable oil (70g)", "1 ½ teaspoons vanilla extract", "6 tablespoons water (84g)", "<strong>For the cranberry sauce/coating:</strong>", "3/8 cup sugar (80g)", "Zest of one orange, finely grated", "½ bag cranberries (6oz or ~170g)", "½ cup orange juice (112g)", "Shredded, sweetened coconut to coat (about 2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the cake: Lightly grease a standard metal loaf pan (9X5X2 or 3), and line the bottom with parchment or wax paper.  Place a cooling or roasting rack in the bottom of a deep metal roasting pan and fill with water to just below the level of the rack.  Position the roasting pan over two stove burners.  Turn burners to medium-high and invert a metal baking tray over roasting pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine first three ingredients and whisk to evenly distribute and break up any lumps.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl with an electric mixer, whip together egg and sugar on medium-high speed until very light and thick, about two minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add juice, and whip briefly to incorporate.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continuing to whip, add oil in a slow stream, stopping the stream every so often to allow mixture to fully emulsify before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 1/3 of the combined dry ingredients (from step 2), and mix just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add extract and half of the water and mix just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of remaining dry ingredients; followed by remaining water, finishing with the rest of the dry ingredients, mixing between each ingredient addition just to combine. Turn the batter into the prepared loaf pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the inverted baking sheet “lid” from the roasting pan, avoiding steam and hot water that may have collected on the underside of the pan.  Place filled loaf pan on rack inside roasting pan, re-cover the roasting pan with baking sheet, and steam cake until a thin knife or toothpick inserted in the center comes out free of uncooked batter (a few moist crumbs are okay). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the cake completely.  Run a knife around the edges of the pan to loosen the cake and turn the cake out onto a cutting board.  Using a bread knife or other long serrated knife, cut cake into about 10 even rectangular logs, about 1” wide.  Place the cake logs on a parchment- or wax paper-lined sheet tray. (If you are going to fill the cakes, pipe the icing in using a squeeze bottle or pastry bag fitted with a Bismarck tip, then cover the cakes and refrigerate.  If you are just going to coat the cakes – unfilled – just wrap and refrigerate until needed.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the sauce/coating: Combine the sugar and zest in a small sauce pan and rub together between your hands to release the oils from the zest.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cranberries and juice and cook over medium heat until mixture comes to the boil.  Continue to cook, stirring occasionally, until all cranberries have popped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately pour mixture through a fine mesh strainer set over a wide bowl.  Press gently on the solids to release trapped liquid.  Discard solids.  Place sauce in refrigerator to cool to luke warm or colder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble: Set up a coating assembly line.  Line a tray or storage container with parchment or wax paper.  Set beside it a wide, shallow dish or pan filled with an even layer of shredded coconut.  Beside the coconut, place the cooled cranberry sauce, and beside the sauce place the tray of chilled cakes. (Chilling makes the cakes a bit more sturdy for rolling and handling.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use one hand to coat the cakes in the cranberry sauce and transfer them to the coconut pan.  Use the other hand to coat the cakes with coconut and transfer them to the clean paper-lined tray.  Once all cakes are coated, they may be wrapped and stored at room temperature for a day or two or stored in the refrigerator for several days. (For the most eating pleasure, be sure to allow chilled cakes to come to room temperature before serving.)</p>"}]}