{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080409-dinnertonight-broiledchicken.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "mains", "poultry", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Broiled Chicken with Garlic Sauce", "link": "https://www.seriouseats.com/recipes/2008/04/dinner-tonight-broiled-chicken-with-garlic-sa.html", "description": "I've been having a lot of fun flipping through The Ethnic Paris Cookbook. It's unpretentious, easy to use, and full of tasty dishes that seem to be entirely too simple, if a little hard to believe. And this one is...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight"], "recipeIngredient": ["1/2 cup sunflower oil", "1 ice cubes, crushed", "2 tablespoons lemon juice", "2 cloves of garlic, peeled", "1/2 medium starchy potato, peeled and cubed", "1/2 tablespoon salt", "1/2 chicken ", "Olive oil", "Salt and pepper", "Fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler.  Place the 1/2 chicken on a cutting board.  Set a heavy pan, like an iron skillet, on top and press down firmly.  You want it as flat as possible without breaking the bones of the chicken so it cooks evenly.  When it’s flattened, smear the skin with olive oil, and season with salt.  Place it in the broiler, breast side up.  Cook for 10-15 minutes.  Then flip and cook for another 10-15 minutes, or until completely cooked.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a blender, toss in the cubed potato, garlic and the 1/2 tablespoon of salt.  Process on medium until smooth.  You might need to stop and stir the contents a few times.  The potato pieces might not completely break down, but it’s okay.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the speed to slow, and stream in the sunflower oil.  When it’s completely incorporated, increase the speed to high and add the crushed ice and the lemon juice.  Continue to blend until it’s completely smooth.  There should be no pieces of potato by now.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken is done, remove it from the broiler and set it on a large piece of aluminum foil.  Sprinkle the chicken with a couple sprigs of thyme and a little pepper.  Wrap it up and let it sit for 7-10 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve up the pieces, plate, and serve with the sauce poured on top.  </p>"}]}