{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-marthastewart-entertaining.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["bread", "classic cookbooks", "entertaining", "Martha Stewart", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Tuscan Tomato Soup and Homemade French Bread", "link": "https://www.seriouseats.com/recipes/2008/05/tuscan-tomato-soup-and-homemade-french-bread-recipe.html", "description": "The first time I really sat down and read Entertaining was when I was planning my wedding. I opened it looking for ideas and closed it thinking, “Yes, I could make all the food for our wedding, wouldn’t that be...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Classic Cookbooks", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["2 tablespoons olive oil", "2 tablespoons butter", "2 carrots, peeled and finely diced", "2 stalks celery, finely diced", "1 1/2 medium onions, minced", "2 28-ounce cans whole plum tomatoes, chopped, with their juice, or 7 large ripe tomatoes, peeled and seeded", "1/4 cup chopped parsley", "6 leaves fresh basil (optional)", "Salt and freshly ground pepper", "1/2 cup cream (optional)", "1 package active dry yeast", "1 1/4 cup plus 2 tablespoons warm water", "3 1/2 cups unbleached white flour (I used bread flour)", "2 1/8 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil and butter in a heavy soup pot. Cook the carrots, celery, and onions for about 20 minutes, or until very tender. Add the tomatoes and continue cooking over moderate heat for 25 to 30 minutes longer. Stir in the parsley and basil, season with salt and pepper, cook a minute or so longer, and serve hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As a variation, she says you can strain the soup and thin it with cream. I pureed half of my soup and stirred it back into the chunky half. Then I stirred in a half cup of cream because I happened to have it in the refrigerator, and I was pleased with the resulting soup, which was still quite thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Homemade French Bread</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 3 baguettes -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Adapted from</em> <a href=\"http://www.amazon.com/exec/obidos/ASIN/B0013MPCP2/serieats-20\">Entertaining</a> <em>by Martha Stewart.</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soften the yeast in 1/4 cup warm water. (It isn’t clear to me whether this should come out of the water listed in the ingredients. I used 1/4 cup extra here and the amount listed in the ingredients in the next step.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the flour and salt in a large bowl. Add the warm water and mix well. Add the yeast mixture and blend it into the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn onto floured board and knead until dough is smooth and elastic, about 10 minutes. You can also do this in a standing mixer with a dough hook, of course, in which case it will only take about 4 or 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the kneaded dough in a covered bowl and let rise until doubled in bulk. (I can never tell whether dough has doubled in bulk, so I just wait an hour.) Punch dough down and let rise a second time until doubled. Punch down. Turn onto a floured board and shape as desired per instructions below. (I shaped my loaves right on a parchment-lined baking sheet and had no problem.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After forming the loaves, let rise covered with plastic wrap until doubled in size. Long loaves must be slashed along top with a sharp razor (3 or 4 diagonal slashes should do).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in a 400°F oven for 25 minutes. To obtain a fine crust, spray the loaves with water 3 or 4 times during baking. Loaves are done when golden brown and crispy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To shape dough into baguettes: </strong>Divide dough into 3 equal pieces. Pat each piece into an oval and press down the middle lengthwise with the edge of your hand. Fold in half and seal edges with the heel of your hand, pressing hard to expel air bubbles. Shape into a long, even cylinder by rolling like a clay snake. Place in bread pan (with no bread pan, I just put mine on a baking sheet) and cover for the final rise (step 5 above). After the final rise, make 3 or 4 long, diagonal cuts in the top of each loaf with a razor. Bake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To shape dough into branches: </strong>Use one long, thin baguette for each branch. After the final rise but without slashing the top of the loaf, use sharp scissors to make diagonal cuts 3 inches long into each side of the baguette. You want about 4 cuts per side, and the cuts on each side should be parallel to each other, creating a series of points. Pull the points out from the baguette so that they resemble leaves or an ear of wheat. Spray with water and bake immediately, without leaving the bread to rise again.</p>"}]}