{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080311-dinnertonight-ratatouille.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Spanish", "keywords": ["Dinner Tonight", "eggs", "gluten free", "ratatouille", "spanish", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pisto Manchego (Spanish Ratatouille)", "link": "https://www.seriouseats.com/recipes/2008/03/dinner-tonight-pisto-manchego-spanish-ratatouille-recipe.html", "description": "The French may have ratatouille, with its newfound cinematic fame, but they aren't the only ones: a similar stewed vegetable dish can be found in many other cultures from the Phillipines to Turkey to Malta. There is something magical about...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Eggs", "Gluten-Free", "Mains", "Spanish", "Vegetarian"], "recipeIngredient": ["1/4 cup olive oil", "1/2 head garlic, top third sliced off", "1 eggplant, about 1 pound, pierced several times with a fork", "1 medium red onion, unpeeled", "2 pounds tomatoes (or one carton cherry tomatoes and one can diced with juice)", "3 peppers, red or green", "2 medium zucchini", "1 teaspoon dried oregano", "1/8 teaspoon cumin", "Large pinch red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using either a large grill, grill pan, a 500&deg;F oven, or a broiler, grill/roast the eggplant, peppers, and unpeeled onion, turning occasionally, for 15-20 minutes until soft and charred.  10 minutes in, add the zucchini and tomatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the vegetables to a rimmed baking sheet as they finish cooking, picking over as they cool to remove charred skins.  Core and seed the peppers and cut into a medium dice.  Halve the eggplant, remove the seeds, and dice.  Peel and thinly slice the onion.  Dice the zucchini.  Slip the garlic cloves from their skins and trim any charred parts, then chop.  Roughly chop the tomatoes, and seed if using whole tomatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (at least 12-inch) skillet, heat the olive oil over medium heat and add the eggplant and onion.  Cook, stirring, for 3 minutes, then add the remaining vegetables and spices, plus any juices from the baking sheet, strained.  Bring to a boil then simmer until the vegetables are all tender and the sauce has thickened.  Season with salt and pepper (it will certainly need a lot of seasoning).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry as many eggs as eaters, cooking without flipping until the whites are just set.  Divide the vegetables into ramekins or small bowls, and top with the fried egg.</p>"}]}