{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Asian", "pork", "pork chops", "sunday suppers", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Vietnamese-Style Pork Chops with Caramel Sauce", "link": "https://www.seriouseats.com/recipes/2008/03/sunday-supper-vietnamesestyle-pork-chops-with.html", "description": "Each Saturday evening we bring you a Sunday Supper recipe. Why on Saturday? So you have time to shop and prepare for tomorrow. If you've been following along this week, you might know that I picked up a panini press...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Sunday Supper"], "recipeIngredient": ["6 quarter-inch-thick boneless pork chops", "1/3 cup sugar", "2 shallots, finely chopped", "1 tablespoon fresh lime juice", "1 tablespoon <a href=\"http://en.wikipedia.org/wiki/Fish_sauce\">Asian fish sauce</a>", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pork chops between two sheets of plastic wrap, leaving a large margin or wrap around chops. Pound pork flat with a meat pounder or rolling pin until about 1/8 inch thick. Halve the chops lengthwise and place them in a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy saucepan over medium heat, cook the sugar, dry and without stirring, until it starts melting. Keep cooking, now stirring occasionally with a wooden spoon, until it melts into a caramel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shallots, lime juice, fish sauce, and salt. The caramel will harden, but keep cooking, now stirring constantly, until it dissolves and the shallots soften, about 2 minutes. Pour this sauce over the pork, tossing until meat is coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a grill pan and heat it over medium-high heat until hot but not smoking (or, in this case an electric grill press). Cook the pork in batches, turning once, until just cooked through, about a minute a side.</p>"}]}