{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "Italian", "keywords": ["cookbooks", "fish", "grilling", "Italian", "mains", "Mario Batali", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Swordfish Involtini Sicilian-Style", "link": "https://www.seriouseats.com/recipes/2008/05/swordfish-involtini-sicilian-style-recipe.html", "description": "Tomato salads are one of the best parts of summer eating. What could be better, or easier, than a perfectly ripe, sliced beefsteak topped with nothing more than a drizzle of olive oil and a shower of salt and pepper?...", "totalTime": "", "recipeYield": "6 servings", "recipeCategory": ["Cook the Book", "Fish", "Italian", "Mains"], "recipeIngredient": ["<strong>For the tomato salad:</strong>", "1 pound ripe tomatoes, cut into 1/4-inch cubes ", "1/4 cup salt-packed capers, rinsed and drained ", "1/4 cup currants ", "2 tablespoons pine nuts, toasted until golden brown ", "1 1/2 teaspoons hot red pepper flakes ", "1/4 cup extra-virgin olive oil ", "Kosher salt ", "2 oranges ", "1 cup fresh bread crumbs ", "1/4 cup finely chopped fresh Italian parsley ", "1/4 cup extra-virgin olive oil ", "Kosher salt and freshly ground black pepper ", "One 2-pound skinless swordfish steak, cut horizontally into 6 thin slices (about1/3 inch thick) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate the zest from the oranges; set aside. Using a sharp paring knife or serrated knife, cut off the top and bottom of 1 orange to expose the flesh (reserve the other orange for another use). Stand it upright on a work surface and slice off the skin and bitter white pith, working from top to bottom and following the natural curve of the fruit, then trim away any remaining pith. To remove the segments, carefully cut each one away from the membranes, sliding the knife down either side to release it. Set aside in a small bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the bread crumbs, parsley, reserved orange zest, 2 tablespoons of the olive oil, 1/2 teaspoon salt, and pepper to taste, mixing well with your hands or a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut twelve 9-inch-long pieces of kitchen twine. Season each slice of swordfish with salt and pepper. Layout on a work surface and divide the bread crumb mixture among the slices, spreading it evenly. Starting from a narrow end, carefully roll each one up like a jelly roll and tie with 2 pieces of twine. Place on a plate and refrigerate for 20 to 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas grill or prepare a fire in a charcoal grill. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the swordfish rolls all over with the remaining 2 tablespoons olive oil and season again with salt and pepper. Place on the hottest part of the grill and cook for 2 minutes. Gently turn over 90 degrees with tongs and cook for 1 minute, then repeat twice to cook on all sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, season the tomato salad with a little salt and spread out on a platter. Place the involtini on the tomatoes, and garnish with the orange segments. </p>"}]}