{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "garlic", "Martha Stewart", "Martha Stewart's Cooking School", "mashed potatoes", "potatoes", "rosemary"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Garlic and Rosemary Potato Puree", "link": "https://www.seriouseats.com/recipes/2008/11/martha-stewart-rosemary-garlic-mashed-potatoes-recipe.html", "description": "I love garlicky mashed potatoes, but seldom make them because I can't be bothered to roast the cloves. Thanks to Martha Stewart, author of this week's Cook the Book selection and the genius behind the concept of boiling the garlic...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Garlic"], "recipeIngredient": ["3/4 cup heavy cream", "1 to 2 tablespoons rosemary leaves (from about 2 sprigs)", "1/2 cup (1 stick) unsalted butter", "2 pounds red or white potatoes ", "2 garlic cloves, peeled", "Coarse salt and freshly ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring cream and rosemary to a simmer in a small pot, then remove from heat and let steep 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain through a fine sieve (to remove the herbs as well as any skin that might have formed) and clean pot, then return cream to pot. Add butter and heat over medium until melted, stirring to combine. Cover and keep warm (either over lowest setting on the stove or in a warm spot).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, peel and cut potatoes into 1 1/2-inch pieces, then place in a medium stockpot and cover with water. Add the garlic and a generous amount of salt and bring to a boil, then reduce to a rapid simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook until potatoes are very tender when pierced with the tip of a paring knife, about 15 minutes. Drain well, then return to pot and set over low heat, stirring until the potatoes are thoroughly dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While potatoes are still hot, pass through a ricer or a food mill fitted with the fine disk. Stir in cream mixture and season with salt and pepper. If a finer texture is desired, pass puree through a medium-mesh sieve, pressing on solids with a rubber spatula to extract as much puree as possible. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat over medium heat with a little more cream (or water), if necessary, before serving.</p>"}]}