{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080525-corndogs.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["corn dogs", "deep-fried", "fair food", "hot dogs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Summer Shack Corn Dogs", "link": "https://www.seriouseats.com/recipes/2008/05/sunday-brunch-summer-shack-corn-dogs.html", "description": "Jonathunder on Flickr I know serving corn dogs for brunch is a bit of a stretch, but I think I can get away with it on Memorial Day weekend, which in many parts of the country is the start...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Deep Frying", "Mains"], "recipeIngredient": ["1/2 cup all-purpose flour", "1/2 cup yellow cornmeal", "1 heaping teaspoon baking powder", "2 teaspoons sugar ", "1/2 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "1 tablespoon finely minced scallion or onion", "1 large egg, beaten", "1/2 cup whole milk", "10 beef hot dogs, preferably natural casing dogs (1 1/2 to 2 ounces)", "4 cups canola oil", "Yellow or deli mustard and dill pickle spears", "10 heavy 8-inch wooden skewers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the batter:  Combine the flour, cornmeal, baking powder, sugar, salt, and pepper in a large mixing bowl (a deep narrow bowl if you have one) and whisk well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the scallion, egg, and milk in a small bowl and whisk well.  Gently fold the wet ingredients into the dry ingredients.  Do not overmix.  Cover the batter and allow it to rest at room temperature for 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 200 degrees.  Line a baking sheet with paper towels.  Heat 2 inches of oil to 350 degrees in a large deep skillet (at least 12 inches in diameter).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oil is heating, skewer each hot dog lengthwise, stopping about 1 inch from the top.  When the oil is hot dip a hot dog into the batter, using the stick to twirl the dog and coat it evenly; make sure the bottom end of the hot dog is sealed, but try not to get too much batter on the stick.  Remove the dog from the batter and twirl it once to let excess batter drip back into the bowl, then holding the stick end, lower the corn dog into the oil, keeping it suspended about 5 seconds before letting go (this will prevent the corn dog from sticking to the bottom of the pan).  Dip 2 or 3 more hot dogs and add to the pan (do not fry more than 3 or 4 dogs at a time). Turn the dogs occasionally with tongs to make sure they cook evenly, and fry until the corn coating is a deep rich brown, 4 to 5 minutes. Lift them out of the oil one at at a time with a Chinese wire-mesh skimmer and transfer to the lined baking sheet, and then into the oven.  Dip and fry the remaining dogs, making sure to let the oil come back to 350 degrees between batches, using a candy thermometer. (As you get near the end of the batter, you may need to spoon it over the dogs to coat them evenly.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the corn dogs hot with your favorite mustard and dill pickle spears or hot dog relish.</p>"}]}