{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080627-chickenkabobs-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["chicken", "grilling", "kabobs", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Bacon-Wrapped Chicken Kabobs", "link": "https://www.seriouseats.com/recipes/2008/06/grilling-bacon-wrapped-chicken-kabobs-recipe.html", "description": "You can't argue with meat on a stick. Especially if it's wrapped in bacon. On top of that kabobs happen to be one of the best items to grill as a group. They get everyone around the grill, cooking their own food, and are done quickly. Perfect for your upcoming Fourth of July cookout.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Chicken", "Grilling", "Mains"], "recipeIngredient": ["1/4 cup soy sauce", "1/4 cup cider vinegar", "2 tablespoons honey", "2 tablespoons canola oil", "2 green onions, minced", "20 Cremini mushrooms, scrubbed", "3 skinless, boneless chicken breast halves, cut into 1 inch cubes", "1 pound sliced thick cut bacon, cut in half", "1 pineapple, cut into 1 inch cubes", "Bamboo Skewers, soaked in water for 30 minutes prior to use"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the soy sauce, cider vinegar, honey, canola oil, and green onions in a small bowl. Place the mushrooms and chicken into a large Ziploc bag, pour in marinade, and toss to coat evenly.  Reseal the bag, removing as much air as possible, and marinate in the refrigerator at least 1 hour, preferably overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light 1 chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the charcoal is lighting, wrap the chicken chunks with bacon, and thread onto skewers so that the bacon is secured. Alternate with mushroom and pineapple chunks.  Reserve remaining marinade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil the grill grate. Arrange skewers on the prepared grill. Cook, brushing occasionally with remaining soy sauce mixture, until bacon is crisp and chicken juices run clear, about 3-5 minutes per side, turning the kabobs 4 times.  Serve immediately.</p>"}]}