{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feat-dt-BucatiniallaLipari.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["pasta", "pesto", "pine nuts", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Bucatini alla Lipari (Bucatini With Raw Nut Pesto and Tomato Sauce)", "link": "https://www.seriouseats.com/recipes/2008/10/bucatini-alla-lipari-bucatini-raw-nut-pesto-tomato-sauce-recipe.html", "description": "I'm all about simple pasta dishes, so this one, which combines two sauces at the very last second, originally struck me as needlessly extravagant. But I couldn't help but be intrigued. One sauce is a bare-bones tomato sauce with lots...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Nuts", "Pasta", "Pesto"], "recipeIngredient": ["4 tablespoons olive oil", "1/2 medium onion, finely chopped", "2 cloves garlic, chopped", "1 cup canned whole peeled tomatoes, with juice", "1 teaspoon red chili flakes", "1 cup mixed nuts, like pine nuts, pistachios, walnuts, or hazelnuts", "Handful fresh mint", "1/2 pound bucatini", "Parmesan, or other grating cheese like pecorino", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start with the tomato sauce.  Pour 2 tablespoons of the olive oil into a large skillet over medium heat.  Add the onions and cook until they are translucent.  Then add 1 clove of garlic and all of the whole tomatoes.  Break the tomatoes up with a wooden spoon.  Bring to a boil, then reduce to a simmer and cook for 25 minutes.  Season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toss the rest of the garlic and olive oil, and all the red chili flakes, nuts, and 4 leaves of mint into a food processor.  Process until it becomes a relatively smooth paste.  Season with black pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta in large pot of salted water according to the directions on the back of the box.  Reserve 1/4 cup of the pasta water, and then drain the pasta.  Return the pasta to the large pot and pour in both of the sauces.  Stir well until the pasta is coated in the sauce.  Add the pasta water if mixture seems too dry.  Garnish with reserved mint leaves, season with salt and pepper to taste, and grate a little Parmesan on top. </p>"}]}