{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "escargot", "Mindy Fox", "Olives and Oranges", "salad", "Sara Jenkins", "scallops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Roasted Scallops with Snail Butter and Mâche", "link": "https://www.seriouseats.com/recipes/2008/09/roasted-scallops-with-snail-butter-mache-recipe.html", "description": "I adore escargot: the chewy, earthy flavor; the delicate shells; and most of all, mopping up all the melted garlic- and parsley-infused butter with chunk of baguette. Sara Jenkins, author of this week's Cook the Book selection Olives &amp;...", "totalTime": "", "recipeYield": "4 main course servings, or 6 small plates", "recipeCategory": [], "recipeIngredient": ["<strong>For the Snail Butter:</strong>", "1 1/4 cups loosely packed fresh flat-leaf parsley leaves", "2 garlic cloves, coarsely chopped", "5 tablespoons unsalted butter, at room temperature", "Grated zest of 1/2 lemon", "4 ounces field-grown mâche, baby spinach, or watercress", "2 pounds dry-packed medium scallops", "Medium-coarse sea salt and coarsely ground black pepper", "1 tablespoon extra-virgin olive oil", "Juice of 1 lemon", "Crusty bread, sliced and toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the snail butter, finely chop parsley and garlic together. Place in a bowl, add butter and zest, and mash together with a fork until well combined. Place mâche in a large bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously season scallops with salt and pepper. Heat a large cast-iron pan over high heat until quite hot. Add oil and then scallops, slowly feeding them into pan, being careful not to crowd the pan or lower the temperature of oil; as scallops form a crusty brown sear on the bottom side, 3 to 4 minutes, move them on top of each other and add more to the pan. When all scallops are browned on one side, remove the pan from the heat and dot scallops with snail butter. Place skillet in oven for 5 minutes to melt butter and cook scallops through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer scallops and butter to bowl with mâche, add lemon juice, toss, and serve immediately, with crusty bread to sop up buttery juices. </p>"}]}