{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["black beans", "healthy and delicious", "Madhur Jaffrey", "Madhur Jaffrey's World Vegetarian", "rice", "sack lunch", "Super Bowl sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: Black Beans and Rice", "link": "https://www.seriouseats.com/recipes/2008/02/sack-lunch-black-beans-and-rice.html", "description": "My boss used to tease me when I would bring black beans and rice to work for lunch. He thought, as far as I can tell, that this was my subtle way of asking for a raise, but I had...", "totalTime": "", "recipeYield": "4 generous servings", "recipeCategory": ["Beans and Pulses", "Healthy and Delicious", "Mains", "Rice", "Vegetarian"], "recipeIngredient": ["<ul><li>2 cups (12 ounces) dried black beans, picked over, washed, and drained</li><li>4 to 5 garlic cloves, peeled and coarsely chopped</li><li>1 large red or green bell pepper, cored, seeded, and chopped into 1/4-inch dice, divided (this should be at le"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the beans overnight in water to cover by 5 inches. Alternatively, you could put the beans in a pot with the same amount of water, bring to a boil, and boil hard for 2 minutes; then cover, turn off the heat, and let the pot sit, covered, for 1 hour. I never soak beans overnight, always using the second method instead.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans and put them in a large pot with 8 3/4 cups fresh water. Add the garlic, half of the diced pepper, and 1/4 cup plus 2 tablespoons chopped cilantro. Bring to a boil. Cover partially, adjust heat so the liquid simmers quite gently, and cook until the beans are fairly tender (she says 1 1/2 hours; my beans were practically edible after 1 hour, so I went ahead then). Stir in 2 teaspoons salt and cook another 15 minutes, until the beans are very tender. Drain the beans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the oil in a pot or skillet large enough to hold all the ingredients and set over medium high heat. When the oil is hot, add the onion and remaining bell pepper. Stir and fry until the onion is translucent, turning the heat down if it begins to brown. Add the remaining cilantro (about 1/2 cup) and stir for a minute; then add the beans. Stir for 2 minutes, breaking up any clumps, and then add the rice. Stir to break up clumps of rice. Add salt and pepper to taste and continue to stir and fry until the rice and beans are heated through.</p>"}]}