{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20081205-smokedfish-thumb.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fish", "mains", "seafood", "smoked fish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Smoked Fish Patties with Dill Mayonnaise", "link": "https://www.seriouseats.com/recipes/2008/12/smoked-fish-patties-with-dill-mayonnaise-recipe.html", "description": "In my local market there are multiple stands that sell all manner of smoked and preserved fish, from pickled herring to gravlax-style salmon. But by far the most prevalent are hot-smoked, whole head-on fish like latikas (bream) and forell (trout)....", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Fish", "Mains"], "recipeIngredient": ["1 1/4 pounds mealy potatoes, such as Russet", "3 tablespoons butter", "1 pound hot-smoked fish fillets, such as trout", "1/4 cup chopped fresh dill, plus 3 tablespoons more for mayonnaise", "A little flour for dusting", "3 tablespoons peanut or canola oil for frying", "1 clove garlic, crushed or minced", "1/2 cup mayonnaise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the potatoes, cut into quarters, and boil in salty water until tender.  Drain the potatoes and beat with the butter, either by hand or using a mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, remove any skin or bone from the fillets and roughly break up the flesh.  Cover with boiling water and let them sit for ten minutes to soften.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the fish, along with the dill and salt and pepper to taste, into the warm potatoes.  Allow to cool a little, then shape into 10-12 patties, each with a chunk about the size of a large golf ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out the patties on a cutting board and dust with a sprinkling of flour.  Heat the oil over medium-high heat in a skillet (or two to expedite frying), preferably non-stick.  When it shimmers, add the patties, flour-side down.  Sprinkle the tops with a little more flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, undisturbed, until they form a crust and are easily flipped, 3 minutes per side.  Serve with the sauce, which is just the mayonnaise mixed with remaining dill and garlic.</p>"}]}