{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "Mexican", "keywords": ["fish", "grilling", "Mexican", "Rick Bayless", "salmon", "seafood", "sunday suppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Cinco de Mayo Grilled Salmon Vera Cruz", "link": "https://www.seriouseats.com/recipes/2008/05/grilled-salmon-vera-cruz-recipe.html", "description": "Each Saturday evening we bring you a Sunday Supper recipe. Why on Saturday? So you have time to shop and prepare for tomorrow. While the unofficial start to grilling season, Memorial Day, is yet to come, it's May, so what...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mains", "Mexican", "Salmon", "Sunday Supper"], "recipeIngredient": ["1/4 cup extra-virgin olive oil, plus more for oiling grill and salmon", "1 medium-size onion, sliced thinly", "4 cloves garlic, chopped finely", "7 cups diced tomatoes", "2 tablespoons chopped fresh thyme leaves, plus a few sprigs for garnish", "2 teaspoons finely grated lemon zest", "1 cup pitted, roughly sliced green olives", "1/4 cup capers, drained and rinsed", "3 pickled jalapeño peppers, thinly sliced", "Salt", "6 salmon steaks (each 7 to 8 ounces), about 1 inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the oil in a pan over medium heat. Add the onion; cook, stirring, until just beginning to brown, about 5 minutes. Add the garlic; cook 1 minute. Raise heat to medium-high; add the tomatoes, thyme, lemon zest, and half the olives, capers, and peppers. Simmer while stirring for about 5 minutes; you want to evaporate some of the liquid. Reduce heat to medium-low; stir in 1 cup water, and simmer for 15 minutes. Taste and season with salt. Let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat grill to medium-high. Reduce heat on one side of grill to medium-low (if using charcoal grill, set it up for indirect cooking by moving the coal to one side and leaving other half of grill empty). Set the cooking grate in place; cover grill and let grate heat 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Oil grill and both sides of each salmon steak. Sprinkle salt on fish. Cook  salmon over hottest part of grill for about 4 minutes, until nicely browned underneath. Flip fish carefully onto cooler side of grill; cook 2 to 4 minutes more for medium-rare.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon sauce into a deep platter; nestle fish in it. Let stand at room temperature about an hour to bring together flavors of fish and sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, sprinkle salmon with remaining olives, capers, and peppers; garnish with the thyme sprigs.</p>"}]}