{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/sacklunch.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["eggs", "healthy and delicious", "sack lunch", "sandwiches", "sardines"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: Sardine-and-Egg Salad Sandwich", "link": "https://www.seriouseats.com/recipes/2008/04/sack-lunch-sardineandegg-salad-sandwich.html", "description": "Photograph from RockyEda on Flickr I've been working my way through everyone’s suggestions in response to last month’s post about how to eat sardines. With many methods and recipes left to try, I have already discovered one new favorite....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Eggs", "Fish", "Healthy and Delicious", "Sandwiches"], "recipeIngredient": ["2 hard-boiled eggs, peeled and sliced in half", "1 3.75-ounce can oil-packed sardines, drained", "Mayonnaise ", "Mustard", "Freshly ground pepper", "Salt", "2 split English muffins (or other bread for making sandwiches)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the hard-boiled yolks into a bowl and mash them well with a fork. Dump the drained sardines on top of them and chop the sardines up into little bits, as small as you like. Chop the hard-boiled whites very fine and put them in the bowl. Top with mayonnaise, mustard, and freshly ground pepper to taste (I just eyeball it—I think I use about 2 teaspoons each mayonnaise and mustard and 1/8 teaspoon pepper) and stir and mash everything together until evenly combined. Taste and add salt only if you think necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve on an English muffin or bread of your choice. This makes enough for 2 sandwiches; if you aren’t making 2 sandwiches at once, the leftover will keep in the refrigerator for a day or two. </p>"}]}