{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["bone marrow", "Cook the Book", "fat", "Jennifer McLagan", "red wine", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Steak with Red Wine Sauce and Bone Marrow", "link": "https://www.seriouseats.com/recipes/2008/10/grilled-steak-with-red-wine-sauce-bone-marrow-recipe.html", "description": "A friend of mine once told me that at Ruth Chris, the popular national steakhouse chain, the chef melts a stick of butter over every ribeye, porterhouse, and T-bone as it leaves the kitchen. It's probably an exaggeration (an entire...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Cook the Book", "Mains"], "recipeIngredient": ["2 cups red wine", "4 shallots, chopped", "1 carrot, peeled and sliced", "3 sprigs thyme", "1 fresh bay leaf", "1/2 teaspoon black peppercorns, crushed", "2 cups concentrated veal stock", "2 bone-in rib steaks, each 3 inches thick", "Sea salt and freshly ground black pepper", "6 pieces whole bone marrow (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the wine, shallots, carrot, thyme, bay leaf, and peppercorns in a saucepan over high heat and bring to a boil. Reduce the heat and boil gently until the liquid is reduced to 2/3 cup, 15 to 20 minutes. Add the veal stock and continue to boil gently until the liquid is reduced by half. Strain the sauce through a fine-mesh sieve, pressing hard against the solids to extract all the liquid. The sauce can be stored for up to a day in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One hour before cooking, remove the steaks from the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the grill or broiler to high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the steaks with salt and pepper. Sear the steaks for 1 minute per side. Lower the heat or move the grill rack farther away from the heat and continue to cook the steaks, turning once, until a kitchen thermometer registers 120º to 125ºF for medium-rare, 10 to 14 minutes. Let the steaks rest, loosely covered with aluminum foil, for 10 minutes. Remember, during this time the internal temperature of the steak will rise by about 5ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the meat is resting, reheat the sauce over medium-low heat. Slice the marrow into 1/2 inch slices and poach them in simmering salted water until translucent and no longer pink, about 2 minutes. Drain the marrow on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the meat from the bone and slice it thickly. Top the sliced meat with the poached marrow and serve with the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> Once purchased from the butcher, raw marrow bones must be soaked for 12 to 24 hours in salted water to extract the blood. Place the bones in a large dish of ice water to cover, and add 2 tablespoons of coarse sea salt. Refrigerate, changing the water 4 to 6 times (be sure to add 2 more tablespoons of salt with each change).</p>"}]}