{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["fried", "fried pizza", "Jamie Oliver", "pizza", "pizza fritta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jamie Oliver's Pizza Fritta, 'Fried Pizza'", "link": "https://www.seriouseats.com/recipes/2008/10/jamie-olivers-pizza-fritta-fried-pizza.html", "description": "Jamie Oliver may sound English, but deep down he's really Italian—take, for example, his new chain of Jamie's Italian restaurants slowly spreading their way through England, from Oxford to Bath and beyond. In his book Jamie's Italy, he offers these...", "totalTime": "", "recipeYield": "10", "recipeCategory": ["Deep Frying", "Pizza"], "recipeIngredient": ["1 basic pizza dough (recipe follows)", "Flour, for dusting", "Vegetable oil, for frying", "1 five-ounce ball of buffalo mozzarella", "Optional: 5 teaspoons dried oregano", "<strong>For the tomato sauce:</strong>", "Extra virgin olive oil", "1 clove of garlic, peeled and finely sliced", "A bunch of fresh basil, leaves picked", "1 14-ounce can of good-quality plum tomatoes", "Sea salt and freshly ground black pepper", "1 3/4 pound strong white bread flour", "1 1/2 cups fine ground semolina flour or strong white bread flour", "1 level tablespoon fine sea salt", "1/4 ounce envelope active dried yeast", "1 tablespoon golden caster sugar", "Just over 2 cups lukewarm water", "<h5>Procedure:</h5>", "<strong>1. </strong>Pile the flours and salt onto a clean surface and make a 7-inch well in the center.  Add your yeast and sugar to the lukewarm water, mix up with a fork and leave for a few minutes, then pour into the well.  Using a fork and a circular ", "<strong>2. </strong>Flour the top of your dough, cover it with plastic wrap, and let it rest for at least 15 minutes at room temperature.  This will make it easier to roll it thinly.  Now divide the dough into as many balls as you want to make pizzas, i.e", "<strong>3. </strong>Timing-wise it’s nice to roll the pizzas out 15 to 30 minutes before you start to cook them.  If you want to work more in advance, it’s better to keep the dough wrapped in plastic wrap in the fridge rather than having rolled-out pi", "<strong>4. </strong>When you’re ready to cook them, preheat your oven to 500F.  At this stage you can apply your toppings.  Remember: less is more.  If you can, cook the pizzas on a piece of granite or marble in your convection oven—if not do them "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, make your basic pizza dough.  While it’s resting, make your tomato sauce.  Heat a saucepan, add a splash of oil and the sliced garlic and cook gently.  When the garlic has turned light golden, add half the basil, the tomatoes, and a few pinches of salt and pepper.  Cook gently for about 20 minutes, mashing the tomatoes until smooth, then taste, season again, and put to one side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your grill or broiler to its highest temperature.  Divide the dough into 10 pieces and press them flat onto a floured work surface.  Roll them out to about 1/4 inch thick and allow them to rest for 10 minutes or so.  Heat a frying pan over a high heat, add about 3/4 inch of vegetable oil and fry each pizza for 30 seconds or so on each side.  Remove with tongs and place on a baking tray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all the bases are fried, smear each one with a spoonful of the tomato sauce and tear over some mozzarella and a leaf or two of basil or dried oregano.  Drizzle with olive oil and grill until the cheese is bubbling and the dough is light brown and cooked through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Basic Pizza Dough</h4>"}]}