{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-juliaandjacques.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["eggs", "Julia and Jacques Cooking at Home", "Julia Child", "omelets", "sack lunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: Spanish Tortilla", "link": "https://www.seriouseats.com/recipes/2008/02/sack-lunch-spanish-tortilla-recipe.html", "description": "Despite the fact that I’ve cut back on meat in the past few years, it rarely occurs to me to turn to eggs as a source of protein. As part of my effort to liberate them from my mental breakfast...", "totalTime": "", "recipeYield": "4, or 2 for dinner and 2 again for lunch", "recipeCategory": [], "recipeIngredient": ["1 medium leek, white and palest green parts only", "2 medium potatoes (about 10-12 ounces total), Yukon Gold or other all-purpose variety", "1 tablespoon unsalted butter", "2-3 tablespoons olive oil", "Salt and freshly ground black pepper", "7 large eggs", "Drops of Tabasco sauce", "1/4 cup chopped onion", "1 teaspoon minced garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Clean the leek well and slice it lengthwise into narrow strips, then slice again crosswise into 1/4-inch pieces. You should end up with about 1 cup total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the potatoes and slice crosswise into thin slices, no more than 1/8 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a 10-inch nonstick ovenproof skillet over medium heat with the butter and 1 tablespoon olive oil. When the oil is sizzling, add the potato slices to the pan and spread them out, flipping and turning to coat evenly with oil. Season with 1/4 teaspoon salt and 1/4 teaspoon pepper and cook for about 7 minutes, turning occasionally. The slices should be barely soft and still intact; if they are still firm, cover the pan and cook 2-3 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, crack the eggs into a large bowl, season with 1/4 teaspoon salt, 1/4 teaspoon pepper, and drops of Tabasco to taste. Whisk until well blended.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are just tender, scatter the leek, onion, and garlic over the slices and toss to mix. Cook 2-3 minutes, stirring and tossing, to soften all the vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the beaten eggs all at once all over the potato mixture. Allow to set in the pan for about a minute, then stir the eggs and vegetables together gently. Continue to cook over moderate heat until the eggs have begun to solidify, about 3 minutes. Lower the heat if the eggs seem to be cooking rapidly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the skillet in the oven and bake 6-8 minutes. The eggs will be fully set, slightly puffed, and shrinking from the sides of the skillet. Remove to the stovetop—remember, the handle is hot!—and set over medium heat for a minute or two to brown the bottom. While cooking, drizzle a spoonful or so of olive oil all around the outer edge of the omelet and swirl the pan gently to loosen it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the cooked omelet out onto the serving plate to present the top side with the vegetables visible, or invert onto the plate to show the browned bottom. Drizzle with extra-virgin olive oil to serve if you like.</p>"}]}