{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081117-cover-food-and-wine.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["caramel", "fall recipes", "food and wine", "pies", "thanksgiving", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "'Food &amp; Wine' Magazine's Caramel Cream Pie with Crispy Rice Topping", "link": "https://www.seriouseats.com/recipes/2008/11/food-wine-magazine-caramel-cream-pie-recipe.html", "description": "When we talked to Food &amp; Wine Magazine editor in chief Dana Cowin about the November 2008 issue of the magazine, we asked her what her favorite Thanksgiving recipes from the issue were. This is one of them. More of...", "totalTime": "", "recipeYield": "one 10-inch pie", "recipeCategory": [], "recipeIngredient": ["<strong>Crust</strong>", "3 ounces blanched hazelnuts (3/4 cup)", "1 cup graham cracker crumbs", "2 tablespoons sugar", "6 tablespoons unsalted butter, melted", "<strong>Caramel Pudding</strong>", "1 cup sugar", "1/4 cup water", "4 cups whole milk", "1 teaspoon pure vanilla extract", "1 teaspoon unflavored gelatin", "1/2 cup cornstarch", "1 teaspoon kosher salt", "4 large egg yolks", "<strong>Crispy Rice</strong>", "1/2 cup sugar", "1 tablespoon water", "1 teaspoon light corn syrup", "1/2 teaspoon kosher salt", "1 1/2 cups puffed rice cereal", "Lightly sweetened whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°. Spread the hazelnuts in a glass pie plate and toast for about 8 minutes, until lightly golden and fragrant; let cool. Transfer the nuts to a mini food processor and coarsely grind. Pour the ground nuts into a medium bowl and add the graham cracker crumbs, sugar and butter; mix until evenly moistened. Press the crumbs over the bottom and up the side of the pie plate in an even layer. Bake the crust for 8 minutes, until barely set. Transfer the pie plate to a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy saucepan, combine the sugar and water and bring to a boil over moderately high heat, gently swirling the pan until the sugar dissolves. Cook over moderate heat, undisturbed, until a deep-amber caramel forms, about 8 minutes. Remove from the heat. Carefully add 1 cup of the milk, then cook over moderately low heat, whisking gently, until smooth, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small glass bowl, combine 1/4 cup of the milk with the vanilla; sprinkle the gelatin on top and let stand until softened. In a large glass measuring cup, whisk the remaining 2 3/4 cups milk with the cornstarch and kosher salt. Pour the milk mixture into the caramel and bring to a boil over moderately high heat, whisking constantly until thickened, about 10 minutes. Remove from the heat and whisk in the egg yolks, one at a time. Return the mixture to a boil and cook until thickened once again, about 5 minutes. Whisk in the gelatin mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a rubber spatula, gently spread the caramel pudding in the cooled crust. Tap the pie plate gently on a work surface to settle the pudding. Press a piece of plastic wrap directly on the surface of the pie and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with parchment paper and coat with vegetable spray. In a small, heavy saucepan, bring the sugar, water and corn syrup to a boil over moderately high heat. Lower the heat to moderate and simmer undisturbed until a deep-amber caramel forms, about 5 minutes. Remove the caramel from the heat and stir in the salt and rice cereal. Scrape the caramelized cereal onto the prepared baking sheet and let cool for 30 minutes, until it is hardened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the crispy rice into shards; transfer to a sturdy plastic bag. Using a rolling pin, crush the topping into small pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the whipped cream on top of the chilled pie, making deep swirls. Top the pie with the crispy rice and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Make Ahead</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The rice topping can be stored in an airtight container for up to 3 days. The pie can be refrigerated for up to 6 hours. </p>"}]}