{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080923-shopsins-sliders.jpg", "author": {"@type": "Person", "name": "Allison Hemler"}, "recipeCuisine": "", "keywords": ["beef", "Eat Me: The Food and Philosophy of Kenny Shopsin", "Kenny Shopsin", "sandwiches", "Shopsin's"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kenny Shopsin's Sliders", "link": "https://www.seriouseats.com/recipes/2008/10/kenny-shopsin-sliders-mini-burgers-recipe.html", "description": "Photograph by Nick Solares Kenny Shopsin wants you to know that sliders are not really hamburgers: \"They might be made of the same components, but so is spaghetti and meatballs when you stop to think about it.\" The meat is...", "totalTime": "", "recipeYield": "one set of 3 sliders", "recipeCategory": ["Beef", "Burger", "Mains", "Sandwiches"], "recipeIngredient": ["1 big yellow Spanish onion, thinly sliced", "5 ounces chopped meat (20 to 30 percent fat)", "Salt ", "Butter for the rolls ", "3 Martin's dinner rolls, or any soft rolls about the size of Parker House rolls, cut in half but leaving them attached to one another if possible ", "3 slices American cheese "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the onion slices until they're brown and crispy (Kenny slices them very thin and throws them in a pot of hot oil until they are charred). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the meat into three equal-sized balls. Preheat a griddle or large cast-iron skillet over high heat until it is searing hot. Place the balls of meat on the griddle or in the pan and press them down with a heavy spatula or bacon weight to form patties about 1/2 inch thick. Season them with salt. Place a bacon weight or heavy lid on top of the patties to keep them smashed down and cook about 2 minutes per side, until they are cooked through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, butter the insides of the rolls and toast them in whatever way is most convenient for you. Place the patties so they are all in a row, butting up against one another. Put the fried onions on the patties, and then top each patty with one slice of the cheese. On top of the cheese, place the tops of the buns and on top of the tops, the toasted bottoms. Then, on top of everything, place your bacon weight or a lid and cook for 1 minute to melt the cheese and steam the bun. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, place the bun bottoms on a plate. Carefully slide your spatula under the three patties to lift them up in one piece and place them on top of the bottom buns. Serve at once. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Related</strong> <a href=\"http://aht.seriouseats.com/archives/2008/09/shopsins-general-store-sliders-burgers-lower-east-side-nyc.html\">Shopsin's General Store, for the Best Sliders in New York City</a></p>"}]}