{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "mains", "peas", "rice", "risotto", "Serves One", "shiitake mushrooms", "Toni Lydecker", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Risotto with Shiitake Mushrooms and Peas", "link": "https://www.seriouseats.com/recipes/2008/07/risotto-with-shiitake-mushrooms-and-peas-recipe.html", "description": "Today's Cook the Book recipe is for Risotto with Shiitake Mushrooms and Peas. Before you balk at the notion of cooking a single serving of this notoriously laborious rice dish (all that stirring!), consider how relaxing it would be if...", "totalTime": "", "recipeYield": "-serves-one.html#20080707", "recipeCategory": ["Cook the Book", "Legumes", "Mushrooms", "Vegetarian"], "recipeIngredient": ["1 1/2 cups store bought or homemade chicken stock or vegetable broth", "1 teaspoon extra-virgin olive oil", "2 teaspoons butter, divided", "1 tablespoon finely chopped shallot or onion", "3/4 cup thinly sliced shiitake mushroom caps cremini, or white mushrooms, or a mixture", "1/8 teaspoon dried thyme, or leaves from one sprig fresh thyme ", "Salt and freshly ground black pepper, to taste", "1/3 cup Arborio, Carnaroli, or other medium-grain Italian rice", "2 tablespoons dry white vermouth", "1/4 fresh or frozen peas", "1-2 tablespoons grated Parmigiano-Reggiano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the broth to a simmer in a small saucepan over low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil and 1 teaspoon of the butter in a small sauté pan or saucepan (about 6 inches in diameter) over medium heat. Sauté the shallot until tender but not browned. Add the mushrooms and cook, stirring often, until they soften. Add the thyme and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 1 teaspoon butter and stir in the rice. Cook and stir for a minute or 2 until the grains are well coated. Add the vermouth and, when most of the liquid has evaporated, ladle in enough warm broth to barely cover the rice. Adjust the heat so the liquid simmers briskly. Once that is absorbed, replenish with the same amount of broth. Continue to stir often, adding broth as needed, until the rice is cooked but still slightly firm in the center.</p>"}]}