{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080814-carrot-buttermilk-tart-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["carrots", "desserts", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dessert Inspiration from Milan: A Carrot-Buttermilk Tart", "link": "https://www.seriouseats.com/recipes/2008/08/carrot-buttermilk-tart-recipe.html", "description": "While visiting Milan in the spring, I tried something I had never tried before: a carrot-yogurt tart. With its tender, nutty crust and tangy, cheesecake-like yogurt filling, topped with toothsome, barely cooked shredded carrots, the tart was a study in...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["<strong>Crust:</strong>", "1/2 cup unsalted butter, soft but cool (112 grams)", "1/2 cup light brown sugar (105 grams)", "1 large egg white (30 grams)", "1/2 cup All Bran cereal (35 grams)", "1 1/4 cup all-purpose flour (150 grams)", "1/2 teaspoon ground cinnamon", "1/8 teaspoon salt ", "<strong>Carrot topping:</strong>", "1 1/2 cups shredded carrot (about 130 grams)", "1 tablespoon unsalted butter (14 grams)", "1 tablespoon honey (21 grams)", "1/2 teaspoon Chinese five-spice powder<a href=\"#note\">*</a>", "2 pinches salt", "<strong>Filling:</strong>", "1/4 cup sugar (53 grams)", "2 tablespoons all-purpose flour (15 grams)", "Pinch of salt ", "1 large egg (50 grams)", "1 large yolk (20 grams)", "1 tablespoon unsalted butter, melted and cooled", "1 1/2 teaspoons lemon juice", "1 teaspoon vanilla extract", "1 cup buttermilk (250 grams)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the crust: About one hour before preparing the crust dough, remove butter from the fridge and allow to sit at room temperature.  With an electric mixer, cream butter with brown sugar until light and fluffy, scraping down the sides of the bowl occasionally.  Add egg white and beat with butter mixture, scraping down sides occasionally, until mixture is smooth, glossy and homogeneous.  Using a spice mill or small food processor, grind the cereal to a fine powder.  Combine cereal with remaining crust ingredients and whisk to thoroughly distribute.  Add half of this dry mixture to the butter mixture, and mix to just incorporate.  Scrape around the sides and bottom of the mixing bowl, then add the remaining dry mixture.  Mix just to incorporate.  Dough will be rather moist and sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a sheet of parchment or waxed paper.  Lightly moisten hands with cold water and gently pat the dough into a thick, even circle.  Lay a second sheet of parchment or waxed paper over the dough circle and roll the dough into a circle 12- to 13-inch circle.  Slide the dough, with paper attached, onto the back of a baking tray and refrigerate until dough is firm.  Peel the paper off of the top surface of the dough.  Invert dough and carefully center over a drop-bottom, 1-inch deep, 9-inch diameter tart pan before carefully peeling away second layer of paper.  With lightly moistened fingers gently ease the dough down into the pan, taking care to press dough completely into corners and fluting.  Wipe fingers and remoisten as necessary to keep dough from sticking to them.  Trim excess dough to patch any cracks that may occur.  Once pan is fully lined and all cracks have been sealed, refrigerate the tart shell for one hour. (Dough or unbaked shell may be refrigerated, tightly wrapped, for up to three days.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F.  Place refrigerated pan lined with dough onto a baking sheet and bake for 12 minutes.  Rotate shell once during baking.  Gently press down any significant bubbles that occur during baking with the back of a flat spatula, taking care not to cause cracks in the crust.  Cool shell completely.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For carrot topping: In a small sauce pan, combine butter, honey, salt and spice.  Heat over medium-high heat, stirring occasionally to keep honey from scorching, until mixture begins to bubble.  Add shredded carrot, stirring well to evenly distribute the honey mixture.  Remove pan from the heat and leave carrot mixture in pan to cool and release juices while preparing the filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the filling: Combine sugar, flour and salt.  Add egg and whisk to thoroughly blend.  Add yolk, followed by melted butter, lemon juice and extract, whisking between each addition to blend.  Add buttermilk half a cup at a time, whisking well between each addition until mixture is homogeneous.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish: Place the cooled, pre-baked tart shell on a foil-lined baking sheet on the extended oven rack.  Pour in the tart filling up to the inner edge of the shell (there may be a little excess, depending on shell shrinkage).  Carefully slide the rack back into the oven, taking care not to slop the filling.  Bake at 425&deg;F for 7 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, turn cooled carrot mixture into a strainer set over a bowl.  Squeeze and press the carrot to extract as much juice as possible.  Pour the drained juices back into the sauce pan, and set the drained carrot aside. Rotate the tart carefully and bake for another 7 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, reduce reserved carrot juices over medium-high heat, stirring often, until thickened and beginning to caramelize.  Pour into a bowl, and set aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very lightly sprinkle the shredded carrot over the surface of the filling.  Turn the oven temperature down to 350&deg;F, and continue to bake the tart for an additional 6 to 8 minutes, until a knife inserted into the center of the tart comes out clean.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or cool.  Right before serving, drizzle the tart with the reduced carrot juices.  The tart is best eaten the day it is made.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"note\"></a>* Five-Spice is a wonderfully fragrant spice blend, common to Chinese savory cooking, but I’ve found it to be valuable for sweet cooking as well.  5-Spice blends vary, but generally contain some permutation of cinnamon, clove, fennel, anise seed, star anise, Sichuan pepper, and sometimes ginger.  If you do not have 5-Spice, you may substitute any one or a blend of the typical 5-Spice components to suit your tastes.</p>"}]}