{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Martha Hall Foose", "rice", "salads", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Apricot Rice Salad", "link": "https://www.seriouseats.com/recipes/2008/06/apricot-rice-salad-recipe.html", "description": "Last week, I went to a lecture given by Martha Hall Foose, author of this week's Cook the Book selection, Screen Doors and Sweet Tea. She strode up to the podium in dusty Keds, white ankle socks, and the same...", "totalTime": "", "recipeYield": "6 servings", "recipeCategory": ["Cook the Book", "Dairy-Free", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 teaspoon cumin seeds ", "1/2 teaspoon coriander seeds ", "1 green cardamom pod, crushed ", "3 tablespoons olive oil ", "2 tablespoons chopped red onion ", "1 1/2 cups Basmati rice, rinsed thoroughly ", "1-inch piece cinnamon stick ", "1 bay leaf ", "1/2 cup chopped dates ", "1/2 cup diced dried apricots ", "1/4 cup golden raisins ", "1/4 cup dried cherries or cranberries ", "1 cup plus 1 tablespoon fresh orange juice ", "1/4 teaspoon salt ", "2 green onions, white and green parts, thinly sliced on the diagonal "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 10-inch ovenproof pan with a tight-fitting lid, briefly heat the cumin, coriander, and cardamom over medium heat to toast, shaking the pan to prevent scorching. When the spices are fragrant, remove them from the pan and let cool. Grind the cumin and coriander finely with a mortar and pestle or in a spice grinder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tablespoon olive oil to the same pan and heat over medium-high heat; add the onion, cooking and stirring occasionally for 4 to 6 minutes or until the onion is tender. Reduce the heat and add the rice, spices, cinnamon stick, and bay leaf. Cook and stir until the rice is light golden and each grain is coated with oil. Remove the bay leaf and cinnamon stick and mix in the dates, apricots, raisins, and cherries. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 cup of the orange juice, 1 1/2 cups water, and the salt, stirring briefly just to combine. Bring the mixture to a boil over high heat; reduce the heat to low, cover, and simmer for 15 minutes, or until the rice is tender and has absorbed the liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large fork to fluff up the rice and fruit mixture, turn it into a serving dish, drizzle with the remaining 2 tablespoons oil and 1 tablespoon orange juice, and combine using the fork. Allow to cool, covered by a clean dish towel, then serve at room temperature or chilled, sprinkled with green onion across the top. </p>"}]}