{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080320-dorie-ramekins.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "bread puddings", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Little Bread Puddings", "link": "https://www.seriouseats.com/recipes/2008/03/baking-with-dorie-little-bread-puddings-recipe.html", "description": "©iStockphoto.com/shatteredlens I must be in a mini-mood&mdash;I just looked over my posts from the past couple of weeks and saw that everything was baby-sized. And here's another \"small enough to hold in the palm of your hand\" recipe. This one...", "totalTime": "", "recipeYield": "8 servings", "recipeCategory": ["Baking With Dorie", "Bread Pudding", "Desserts", "Puddings and Custards"], "recipeIngredient": ["1 1/2 cups whole milk", "1 cup heavy cream", "3/4 cup (packed) light brown sugar", "1 1/2 tablespoons whole allspice berries", "8 thin slices firm-textured white bread, crusts removed", "3/4 cup plump pitted prunes, finely diced or coarsely chopped", "3 large eggs", "2 egg yolks", "3/4 teaspoon pure vanilla extract", "2 tablespoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk, cream and brown sugar into a medium-sized saucepan.  Tap the allspice berries with the back of a heavy knife to bruise them slightly and add the berries to the pot.  Bring the mixture to the boil, stirring to dissolve the sugar.  Remove from heat, cover and steep for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 375&deg;F.  Butter eight 6-ounce custard cups or ramekins.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the bread into 1/2-inch dice and put the pieces in a mixing bowl.  Add the prunes, tossing to combine.  Divide the bread and prune mixture evenly among the ramekins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the eggs, yolks and vanilla in a measuring cup with a spout or in a mixing bowl; whisk to blend.  Strain the steeped milk into the eggs, whisking all the while.  (Discard the allspice berries.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour about 1/3 cup of custard into each ramekin.  Push the bread down into the custard with a spoon.  Add more custard slowly until the cups are filled.  Let stand for 10 minutes, so the bread can absorb the custard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the granulated sugar over the tops of the puddings.  Place the ramekins in a large roasting pan.  Fill the pan with enough warm water to come halfway up the sides of the ramekins.  Bake for 20 to 25 minutes, or until a knife inserted near the center a pudding comes out clean and the tops are puffed and golden (puffed is important here).  Remove the puddings to a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> These can be served warm, after cooling for about 20 minutes, at room temperature or  chilled; each has its admirers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Covered, the puddings will keep overnight in the fridge.</p>"}]}