{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["beef", "grilling", "mains", "Mario Batali", "prime rib"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spit-Roasted Prime Rib", "link": "https://www.seriouseats.com/recipes/2008/05/mario-batali-spit-roasted-prime-rib-recipe.html", "description": "Adapted from Italian Grill by Mario Batali....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Mains"], "recipeIngredient": ["3 tablespoons kosher salt", "3 tablespoons freshly ground black pepper", "Black pepper", "2 tablespoons finely chopped fresh rosemary, plus 2 or 3 whole springs", "2 tablespoons fresh thyme leaves", "One 8-pound prime rib roast, chine bone removed and fat trimmed to a thin layer by the butcher", "About 1 cup dry white wine", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the salt, pepper, chopped rosemary, thyme, and dry mustard and mix well. Rub the spice mixture generously all over the meat. cover with plastic wrap and let stand for 1 hour at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a gas or charcoal grill for spit-roasting over indirect medium heat (or according to the instructions for your grill). Pour about 1/2 inch of wine into the drip pan, add the rosemary sprigs, and set under the center of the spit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push the spit through the roast and secure it with the clamps. Attach the spit to the rotisserie mechanism, cover the grill, and cook for about 1 1/2 to 2 hours, depending on the temperature of your grill, or until the internal temperature&ndash;insert an instant-read thermometer about 3 inches deep into the center of the roast, without touching the bones&ndash;reaches 115&deg; to 120&deg;F for medium-rare (the temperature will rise at least 5 degrees while the roast rests). Check the temperature after 1 1/4 hours, and once it has reached 110&deg;F or so, check it often.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the spit from the grill and place the roast, still on the spit, on a carving board (if you remove the spit before letting the roast rest, you will lose a lot of the juices) to rest for 15 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the spit from the roast. Carve the roast off the bone and cut into 3/4-inch-thick-slices. Place on a platter, set out a small bowl of coarse salt and a pepper mill alongside, and serve.</p>"}]}