{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["butterscotch", "desserts", "Melissa Murphy", "puddings", "The Sweet Melissa Baking Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Butterscotch Pudding", "link": "https://www.seriouseats.com/recipes/2008/04/sweet-melissa-butterscotch-pudding-recipe.html", "description": "The week's final Cook the Book recipe, adapted from The Sweet Melissa Baking Book, appears today at the insistence of Serious Eats overlord Ed Levine. And though Sweet Melissa Patsisserie is only a few blocks away from my home, I...", "totalTime": null, "recipeYield": "6 servings", "recipeCategory": ["Cook the Book", "Desserts", "Vegetarian"], "recipeIngredient": ["6 large egg yolks", "1/4 cup firmly packed dark-brown sugar", "1 cup whole milk", "2 cups heavy cream", "1/2 cup granulated sugar", "1/4 cup water", "1 teaspoon fine table salt", "1 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven, and preheat oven to 300°F. Place six 6-ounce ramekins in a 9-by-13-inch roasting pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, lightly whisk the egg yolks until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium heavy-bottomed saucepan over medium-high heat, combine the brown sugar, milk, and heavy cream and heat to scalding, or until the milk is steaming and tiny bubbles have formed along the edges. Do not boil. Stir frequently to dissolve the brown sugar. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cream mixture is heating, in a medium heavy-bottomed saucepan over low heat, stir together the granulated sugar and water. Increase the heat to high and boil the sugar. When the sugar starts to sputter, use a pastry brush dipped in water to wash down the sides of the pan. As soon as the sugar turns amber in color (like clover honey), remove from heat; slowly and carefully pour in the hot cream while stirring to stop the cooking. (The caramel will bubble as you add the cream, so use a long wooden spoon or whisk to stir them.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a slow steady stream, slowly and gently whisk the hot caramel mixture into the egg yolks. Stir in the salt and vanilla. Strain the mixture into a clean pitcher; skim off any air bubbles with a spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into the prepared ramekins. Fill roasting pan with hot water until it reaches halfway up sides of ramekins. Cover pan with aluminum foil. Bake 50 to 60 minutes or until just set. Begin checking after 45 minutes. When gently shaken, a pudding should no longer look liquidy; it will move as one mass and register 150° to 155° on an instant-read thermometer. Remove to a wire rack to cool to room temperature in the water bath.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ramekins from the pan. Refrigerate for several hours until chilled. Serve. For longer storage, once chilled, wrap each individually with plastic wrap and refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Notes: </strong>Serve chilled with freshly whipped cream. The puddings keep covered with plastic wrap in the fridge for up to 5 days.</p>"}]}