{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080331-sweetmelissa.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["brownies", "cakes", "chocolate", "Melissa Murphy", "The Sweet Melissa Baking Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Sweet Melissa Baking Book: Brooklyn Brownout Cake", "link": "https://www.seriouseats.com/recipes/2008/04/sweet-melissa-brooklyn-brownout-cake-recipe.html", "description": "Today's Cook the Book recipe, adapted from The Sweet Melissa Baking Book, is for Brooklyn Brownout Cake, basically a chocolate-lover's one-stop shop for chocomadness. Even though the cake as a whole might seem to take more than a bit of...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>For the cake</strong>", "4 ounces best-quality unsweetened chocolate, coarsely chopped", "1/2 cup vegetable or canola oil", "2 cups sugar", "1 cup plus 2 tablespoons all-purpose flour", "3 tablespoons plus 1 teaspoon best-quality unsweetened Dutch-process cocoa powder", "3/4 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup sour cream", "2 large eggs", "3/4 cup hot strong brewed coffee", "<strong>For the chocolate ganache frosting</strong>", "12 ounces best-quality semisweet (58%) chocolate", "1 cup heavy cream", "2 tablespoons light corn syrup", "<strong>For the brownie crumble</strong>", "4 Chocolate Walnut Brownies (see recipe below)", "1/4 cup walnut pieces (optional)", "1/2 pound (2 sticks) unsalted butter", "4 ounces best-quality unsweetened chocolate, coarsely chopped", "2 large eggs", "1 1/2 cups sugar", "1 teaspoon pure vanilla extract", "1 cup all-purpose flour", "1/2 teaspoon kosher salt", "2/3 cup walnuts, coarsely chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Before you start</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of your oven. Preheat the oven to 350ºF. Butter and flour two 7x2-inch round cake pans. Line each pan with a 7-inch round of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cake</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the top of a double boiler set over simmering, not boiling, water, melt the chocolate, stirring occasionally. When the chocolate is completely melted, whisk in the vegetable oil until smooth. Remove from the heat but keep warm over the hot water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, combine the sugar, flour, cocoa powder, baking soda, and salt, and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, whisk together the sour cream and eggs until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg mixture to the flour  mixture, and mix until combined. Be sure to scrape down the sides of the bowl. Add the melted chocolate mixture and mix until combined. Add the hot coffee in a stream, and mix until combined. (Again, scrape down the sides and bottom of the bowl.) The batter will be loose.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly between the prepared cake pans. Bake for 35 to 40 minutes, or until a wooden skewer inserted into the center comes out clean. Remove to a wire rack to cool in the pans for 25 minutes before turning out the layers onto the rack. Cool completely before finishing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the ganache</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the chocolate into small pieces and place in a medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan over medium heat, bring the cream to scalding, or until the cream is steaming and tiny bubbles have formed along the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately pour the hot cream over the chocolate to cover completely. Do not stir. Wait 5 minutes, then whisk together until smooth. Stir in the corn syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a sheet of plastic wrap flush against the surface of the frosting. Let cool to slightly warm before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the crumble and complete the cake</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the tops of the cake layers so that they are even and no longer domed. Break the cake trimmings up into 3/4- to 1-inch chunks and place in a medium bowl. Place one of the cake layers cut side up on a wire rack set over a cookie sheet lined with wax paper or parchment paper for glazing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break up the brownies into 3/4- to 1-inch chunks. Combine the broken-up cake scraps with the brownie pieces. Pour half of the chocolate ganache over the brownies and cake scraps and stir gently with your fingers to coat. This is your brownie crumble.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one of the cake layers (cut side up) on a wire rack set over a cookie sheet lined with wax paper or parchment paper for glazing. Layer about 1/3 of the brownie crumble evenly over the top of the cake layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining cake layer upside down on the other cake and press down gently with your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the remaining chocolate ganache over the assembled cake. Let it drip down over the sides of the cake. (You may use a metal offset spatula to help push some of the frosting from the top of the cake down the sides.) Spread the frosting with the spatula along the sides to seal. Don't worry if the separate layers are still visible. Once the frosting has stopped dripping, you may scrape up the excess that has dripped through the rack onto the the paper and put it into the remaining brownie crumble (thou must not waste chocolate!).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Chocolate Walnut Brownies</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1 dozen brownies -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Before you start</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of your oven. Preheat the oven to 350ºF. Butter and flour a 9x9x2-inch square cake pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the top of a double boiler set over simmering, not boiling, water, melt the butter and chocolate. Remove from the heat but keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the whip attachment, beat together the eggs, sugar, and vanilla on medium speed until pale yellow in color, about 2 minutes. Add the melted chocolate and mix to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>in a separate bowl, whisk together the flour and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour mixture to the chocolate mixture in 3 batches, mixing on low speed until just combined. Do not overmix. Scrape down the sides of the bowl. Stir in the nuts by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan. Bake for 45 to 50 minutes, or until sides begin to pull away from the pan and center is moist but not runny, and a wooden skewer inserted into the center comes out clean. Remove to a wire rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cool, loosen the edges of the pan with a knife and invert the brownies onto a cutting board. Cut into 12 brownies, measuring 3 inches by 2 1/4 inches, or serve straight from the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The brownies keep in an airtight container at room temperature for up to 3 days. For longer storage, wrap in plastic wrap and refrigerate for up to 5 days, or freeze well wrapped in plastic wrap and then aluminum foil for up to 3 weeks. Do not unwrap before defrosting.</p>"}]}