{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["beets", "borscht", "Cook the Book", "sides", "soups", "Steven Jenkins", "The Food Life", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Elaine's Clear Vegetarian Borscht", "link": "https://www.seriouseats.com/recipes/2008/07/elaines-clear-vegetarian-borscht-recipe.html", "description": "In the introduction to one of the chapters in this week's Cook the Book selection, The Food Life, author Steven Jenkins states: \"a salad without beets is just not a proper salad.\" I couldn't agree more. Sweet, earthy, brilliantly colored...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Dairy-Free", "Vegan", "Vegetarian"], "recipeIngredient": ["2 bunches (about 2 1/2 pounds) red beets with healthy beet greens, washed well, beets thinly sliced and greens reserved", "1 medium Spanish onion, thinly sliced", "1/2 cup fresh lemon juice, or to taste", "1/2 cup granulated sugar, or to taste", "2 tablespoons kosher or sea salt, or to taste", "Sour cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sliced beets and their greens in a large stainless steel stockpot or another nonreactive stockpot and add the onion. Pour in water to cover the beets and onion by just about 1 inch (about 12 cups). Bring to a boil, then reduce the heat and simmer until the beets are tender, 30 to 35 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the broth into a glass container or another nonporous (and, therefore, nonstaining) container, discarding all the solids. While the soup is still hot, stir in the lemon juice, sugar, and salt; adjust the seasonings to your taste. Cover the borscht with plastic wrap and chill it in the refrigerator for at least 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, ladle the soup into chilled bowls and drop a big dollop of sour cream into each serving. Or, if you want to be dramatic, serve it in glasses, also topped with sour cream.</p>"}]}