{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["recipe newsletter", "sardines", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Sardines with Bread Crumbs, Green Garlic, and Mint", "link": "https://www.seriouseats.com/recipes/2008/09/roasted-sardines-with-bread-crumbs-green-garlic-and-mint-recipe.html", "description": "The following recipe is from the September 3rd edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! This week's recipe is for a salty, crispy, addictive dish of roasted sardines with bread crumbs,...", "totalTime": "", "recipeYield": "6 antipasto servings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish"], "recipeIngredient": ["12 (2-ounce) fresh sardines, scaled and gutted", "Kosher salt", "Extra virgin olive oil", "4 stalks green garlic, trimmed and thinly sliced crosswise", "1/4 cup fresh bread crumbs, toasted", "1 tablespoon salt-packed capers, soaked and minced", "1/3 cup loosely packed fresh mint leaves, torn by hand", "1/2 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 500ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the fresh sardines you buy have not been scaled or gutted, it is easy to do. First, using a sharp pairing knife, make a slit along the belly of the fish. Pry the fish open and scrape and rinse out its innards. Next, lay the fish, flesh side down, on a work surface. Grasping the tail and working from tail to head, drag the blunt edge of the knife the length of the fish to remove the scales. Rinse the fish well, pat dry, and repeat with the remaining fish, then clean your work surface before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with one fish at a time, remove the head. Gently pry open the belly to reveal the backbone. Place the fish, skin side up, on a work surface and run the palm of your hand along the spine to loosen it, then trim off the back fin. Turn the sardine over. Starting at the head end, pull the backbone towards the tail in a single motion. (Part of the tail may come off with the backbone.) Rinse the sardine under cold running water, checking for any loose bones, and then pat dry. Repeat with the remaining sardines.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the butterflied sardines on a baking sheet, skin side up. Season both sides with salt, and brush both sides lightly with olive oil. Roast the sardines, skin side up, for about 5 minutes, or until they are cooked through and the skin begins to sizzle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small sauté pan, heat a few tablespoons olive oil over medium heat. Add the green garlic and sauté for about 1 minute, or until softened. With a slotted spoon, remove the green garlic and set aside. Over medium-low heat, replenish the sauté pan with a few additional tablespoons of olive oil and sprinkle in the bread crumbs. Sauté for about 2 minutes, or until they crisp up and darken slightly. Remove from the heat, add the green garlic, stir in the capers and mint, and set aside until serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the sardines to a serving platter or divide among individual plates, and squeeze the lemon half.</p>"}]}