{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Cook with Jamie", "dumplings", "Jamie Oliver", "rabbit", "rabbit stew", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Rabbit Stew with Dumplings", "link": "https://www.seriouseats.com/recipes/2008/02/cook-the-book-rabbit-stew-with-dumplings.html", "description": "We thought we'd start out this week's Cook the Book series by highlighting one of Jamie Oliver's favorite recipes from Cook with Jamie. It's a dish he playfully calls Tender-as-You-Like Rabbit Stew with the Best Dumplings Ever. Though rabbit is...", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Mains", "Other Meats"], "recipeIngredient": ["<strong>For the dumplings:</strong>", "3 cups self-rising flour", "14 tablespoons butter", "A bunch of fresh tarragon, finely chopped", "Sea salt and freshly ground black pepper", "Milk", "1/2 a nutmeg", "<strong>For the rabbits:</strong>", "2 rabbits, preferably free-range or organic, each jointed and cut into 10 pieces", "Flour", "Olive oil", "A couple tablespoons of butter", "Sea salt and freshly ground black pepper", "10 slices of bacon, finely sliced", "2 sprigs of fresh rosemary", "9 ounces mushrooms (field, shitake, or oyster), cleaned and torn", "A large handful of baby onions, peeled", "", "1 1/2 pints chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough into a big sausage shape and cut it into 18 equal-sized pieces. Roll these into little balls in your hands, grate over the nutmeg and place on a tray in the fridge. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Get your rabbit pieces and coat each of them with flour, shaking off any excess. Heat a deep oven-proof pot, about 12 inches in diameter, with a little olive oil and a couple tablespoons of butter, add the rabbit pieces in batches and cook for about 5 minutes until golden on all sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the final batch, return the pieces to the pot, and add a good pinch of salt and pepper and the bacon. Carry on cooking for a couple of minutes until the bacon is crispy, keeping the rabbit moving around the pan at the same time. Add the rosemary sprigs, mushrooms and onions and continue frying for another 10 minutes, by which time the meat will be nicely colored and the veg will be softened. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix in a tablespoon of flour, pour in your beer and chicken stock, cover and simmer for half an hour. Then put your dumplings on top of the stew with about 1/2 inch between them. They will act as a kind of lid, allowing the stew to retain moisture and not to boil dry. When perfectly cooked they will crisp up on the top and stay bun-like and soft on the bottom. Drizzle them with olive oil and put the pot into the preheated oven for 45 minutes.</p>"}]}