{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111103cookspumpkinpiepri.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cook's Illustrated", "fall recipes", "pies", "Thanksgiving pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4285714285714", "ratingCount": "7"}, "name": "Cook's Illustrated's Pumpkin Pie", "link": "https://www.seriouseats.com/recipes/2008/11/cooks-illustrated-pumpkin-pie-recipe.html", "description": "[Photograph: B Calkins on Shutterstock] If candied yams are unavailable, regular canned yams can be substituted. The best way to judge doneness is with an instant-read thermometer. The center 2 inches of the pie should look firm but jiggle slightly....", "totalTime": null, "recipeYield": "one 9-inch pie", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles", "Pumpkin"], "recipeIngredient": ["<strong>For the crust:</strong>", "1 1/4 cups (6 1/4 ounces) unbleached all-purpose flour ", "1/2 teaspoon table salt ", "1 tablespoon sugar ", "6 tablespoons (3/4 stick) cold unsalted butter, cut into 1/4-inch slices  ", "1/4 cup cold vegetable shortening, cut into 2 pieces ", "2 tablespoons cold vodka (see note) ", "2 tablespoons cold water ", "&nbsp;", "<strong>For the filling:</strong>", "1 cup heavy cream ", "1 cup whole milk ", "3 large eggs plus 2 large yolks ", "1 teaspoon vanilla extract ", "1 (15-ounce) can pumpkin puree ", "1 cup drained candied yams from 15-ounce can (see note) ", "3/4 cup sugar ", "1/4 cup maple syrup  ", "2 teaspoons grated fresh ginger  ", "1/2 teaspoon ground cinnamon ", "1/4  teaspoon ground nutmeg ", "1  teaspoon table salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the crust: Process 3/4 cup flour, salt, and sugar in food processor until combined, about two 1-second pulses. Add butter and shortening and process until homogenous dough just starts to collect in uneven clumps, about 10 seconds; dough will resemble cottage cheese curds with some very small pieces of butter remaining, but there should be no uncoated flour. Scrape bowl with rubber spatula and redistribute dough evenly around processor blade. Add remaining 1/2 cup flour and pulse until mixture is evenly distributed around bowl and mass of dough has been broken up, 4 to 6 quick pulses. Empty mixture into medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle vodka and water over mixture. With rubber spatula, use folding motion to mix, pressing down on dough until dough is slightly tacky and sticks together. Flatten dough into 4-inch disk. Wrap in plastic and refrigerate at least 45 minutes or up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lowest position, place rimmed baking sheet on rack, and heat oven to 400°F. Remove dough from refrigerator and roll out on generously floured (up to 1/4 cup) work surface to 12-inch circle about 1/8 inch thick. Roll dough loosely around rolling pin and unroll into pie plate, leaving at least 1-inch overhang on each side. Working around circumference, ease dough into plate by gently lifting edge of dough with one hand while pressing into plate bottom with other hand. Refrigerate 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim overhang to 1/2 inch beyond lip of pie plate. Fold overhang under itself; folded edge should be flush with edge of pie plate. Using thumb and forefinger, flute edge of dough. Refrigerate dough-lined plate until firm, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pie pan from refrigerator, line crust with foil, and fill with pie weights or pennies. Bake on rimmed baking sheet 15 minutes. Remove foil and weights, rotate plate, and bake 5 to 10 additional minutes until crust is golden brown and crisp. Remove pie plate and baking sheet from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the filling: While pie shell is baking, whisk cream, milk, eggs, yolks, and vanilla together in medium bowl. Combine pumpkin puree, yams, sugar, maple syrup, ginger, cinnamon, nutmeg, and salt in large heavy-bottomed saucepan; bring to sputtering simmer over medium heat, 5 to 7 minutes. Continue to simmer pumpkin mixture, stirring constantly and mashing yams against sides of pot, until thick and shiny, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pan from heat and whisk in cream mixture until fully incorporated. Strain mixture through fine-mesh strainer set over medium bowl, using back of ladle or spatula to press solids through strainer. Rewhisk mixture and transfer to warm prebaked pie shell. Return pie plate with baking sheet to oven and bake pie for 10 minutes. Reduce heat to 300°F and continue baking until edges of pie are set (instant-read thermometer inserted in center registers 175 degrees), 20 to 35 minutes longer. Transfer pie to wire rack and cool to room temperature, 2 to 3 hours. Cut into wedges and serve.</p>"}]}