{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["beans", "cassoulet", "Cook the Book", "duck", "fat", "Jennifer McLagan", "lamb", "pork", "Super Bowl mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cassoulet", "link": "https://www.seriouseats.com/recipes/2008/10/cassoulet-recipe.html", "description": "Here in America we love to argue about food, from chili (should it have beans?), to macaroni and cheese (creamy or crusty?), to bagels (to toast or not to toast?). In France, they like to argue about cassoulet, the classic...", "totalTime": null, "recipeYield": "6 to 8 servings", "recipeCategory": ["Chicken", "Cook the Book", "Lamb", "Mains", "Other Meats", "Pork"], "recipeIngredient": ["4 1/2 cups dried white beans, soaked overnight in cold water", "2 onions", "2 cloves", "3 cloves garlic, peeled", "6 sprigs thyme", "4 sprigs flat-leaf parsley", "1 fresh bay leaf", "1/2 pound pork belly, skin on", "1/2 pound boneless lamb shoulder", "Sea salt and freshly ground black pepper", "1/4 cup duck fat", "2 garlic pork sausages", "1/2 cup dry white wine", "4 plum tomatoes, cored, seeded, and chopped", "1 teaspoon tomato paste", "2 legs duck confit (<a href=\"#duckconfit\">recipe follows</a>)", "1 1/4 cups fine fresh bread crumbs", "1 1/2 ounces coarse sea salt", "2 fresh bay leaves, torn", "3 sprigs thyme, stemmed", "2 teaspoons black peppercorns", "1/4 teaspoon freshly ground nutmeg", "6 whole duck legs (about 4 1/2 to 5 pounds)", "3 cloves garlic, peeled and halved", "6 1/2 cup duck fat, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans, discarding the soaking water. Place the beans in a large saucepan and cover with cold water. Cut 1 of the onions in half and skewer each half with a clove. Add to the pan with 2 of the garlic cloves, the thyme and parsley sprigs, and bay leaf. Bring to a boil over medium heat, then lower the heat, skim any foam from the surface, and discard. Simmer the beans, uncovered, until they are just tender, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the beans are cooking, remove the skin from the pork belly, cut into 1/2-inch squares, and set aside. Cut the pork belly into 1-inch pieces and the lamb into 1 1/2-inch pieces. Season the pork belly and lamb pieces with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the duck fat in a frying pan over medium heat. When hot, add the pork belly and lamb and brown on all sides. Transfer to a plate. Prick the sausages several times with a fork and add them to the pan. Lower the heat to medium and brown the sausages on all sides. Transfer the sausages to a plate and cut each sausage into 4 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the remaining onion, add to the pan, and cook over low heat until softened. Add the remaining garlic and the wine and bring to a boil. Deglaze the pan, using a wooden spoon to scrape up the browned bits from the bottom. Stir in the tomatoes and tomato paste and simmer until reduced slightly, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skin from the duck legs and set aside, then remove the meat from the bones in large pieces. Set the meat aside and discard the bones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the beans are cooked, drain them, reserving the cooking liquid. Transfer the beans to a large bowl, discarding the onion halves and herbs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the reduced tomato and onion mixture into the beans and season with salt and pepper, remembering that the confit will add some salt to the finished dish. Put about half the bean mixture in a large Dutch oven or casserole. Now place the pieces of pork skin, pork belly, lamb, and duck confit on top, making sure the different meats are well distributed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the meats with the remaining bean mixture and push the sausage pieces into the top bean layer so they almost disappear into the beans. Pour in enough of the reserved cooking liquid to come up almost to the top of the beans. Cover the surface of the cassoulet with about half of the bread crumbs and dot with the remaining duck fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, uncovered, for 3 hours or until a golden crust has formed over the creamy textured beans. Three or four times during the cooking time, break the bread crumb crust with the back of a spoon and sprinkle the cassoulet with a few more tablespoons of bread crumbs. Also make sure the cassoulet is not becoming dry, adding more of the bean cooking liquid if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the cassoulet straight from the dish, making sure everyone gets a little crust and beans and some of each of the meats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"duckconfit\"></a><h4>Duck Confit</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the coarse salt, bay leaves, thyme, peppercorns, and nutmeg in a spice grinder and grind until powdery.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the duck legs with the garlic cloves and place both the duck and the garlic in a glass dish. Sprinkle the legs with the salt mixture, turning to coat. Cover and refrigerate for 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 200ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the legs to remove the excess seasoning mixture and pat dry. Place the legs in a heavy flameproof casserole or Dutch oven, putting the biggest legs on the bottom, skin side down, and the smaller legs on top, skin side up. Add the garlic cloves and enough fat just to cover the legs and place the pan over medium heat. When you see the first bubble in the fat, remove the pan from the heat and place on a rimmed baking sheet in the oven. Cook, uncovered, until the meat is very tender and has shrunk away from the bone, 4 to 5 hours. The juices should run clear when a leg is pierced with a skewer. If any part of the leg is not quite covered, just turn the legs after 2 hours of cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the confit is cooking, place thee wooden skewers in a saucepan and cover with water. Bring to a boil over high heat and boil for 5 minutes. Let cool, remover the skewers from the water, and set aside. </p>"}]}