{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080522-tortacaprese-thumb.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "Italian", "keywords": ["baking", "balsamic vinegar", "brownies", "chocolate", "desserts", "Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Torta Caprese: An Italian-Inspired Brownie", "link": "https://www.seriouseats.com/recipes/2008/05/torta-caprese-italian-inspired-brownie-recipe-brooks-headley.html", "description": "This brownie was created by <strong>Brooks Headley,</strong> executive pastry chef at <strong>Del Posto</strong> in New York City. If you don't want to splurge on the aceto balsamico tradizionale, you can try reducing a supermarket balsamic vinegar in a nonreactive saucepan. Just be careful in the reduction--let it go too long, and your saucepan is toast.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts", "Italian"], "recipeIngredient": ["14 ounces best-quality chocolate (splurge for some <a href=\"http://www.chathamsfinechocolates.com/Manufacturers.asp?ID=2&Name=Amedei?Source=AW-AMEDEI\">Amadei</a>)", "8 ounces sugar", "1/2 ounce sea salt, plus more for walnut sliver topping", "11 ounces melted butter", "16 ounces ground walnuts", "8 eggs, separated", "Walnuts, cut into slivers", "Olive oil", "Chile flakes", "Ground cumin", "Balsamic vinegar (preferably <a href=\"http://www.igourmet.com/Shoppe/search.aspx?qry=Aceto+Balsamico+Tradizionale+di+Modena\">aceto balsamico tradizionale</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325°F. Meanwhile, grind the chocolate, 4 ounces of sugar, 1/2 ounce sea salt, and 16 ounces of walnuts in a food processor until crumbly and powdery but not sticky. Empty into a large bowl. Add the melted butter and the egg yolks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a mixer and in a separate bowl, slowly begin to whip the egg whites, while gradually adding the remaining 4 ounces sugar, until you have a very soft meringue.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently combine the whites and the chocolate mixture. Spread the mixture on a parchment-lined baking sheet. Bake until puffy and firm, the edges are dark, and the center still seems a bit underdone it is ready, about 25 minutes—this will ensure that the cake will be moist later on. Remove from oven and let cool. Cake will deflate a bit upon cooling. Place in freezer just long enough to firm up the cake for a clean cut. (This is more a restaurant thing, where we are looking for precise clean cuts; at home you can just let it cool and then cut as needed&mdash;the more rustic the better. Either way, you are looking for the cake to be moist and kind of crumbly at the same time. It's a great combination&mdash;very Italian.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, roast walnut slivers with olive oil, chile flakes, and just a little bit of ground cumin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove cake from freezer and cut into squares. Allow to come to room temperature. Top each square with a sliver of walnut and a single drop of the balsamic vinegar. Serve with a pint of olive oil gelato that you picked up from <a href=\"http://www.ottopizzeria.com/\">Otto</a>. Eat lots.</p>"}]}