{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["4th of July", "Diane Morgan", "grilling", "pineapple", "seafood", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Shrimp and Pineapple Skewers with Garlic and Cilantro Drizzle", "link": "https://www.seriouseats.com/recipes/2008/06/shrimp-and-pineapple-skewers-with-garlic-and-cilantro-drizzle-recipe.html", "description": "This 4th of July, whether you're hosting a big backyard bash or simply cooking out with a few friends, you can't go wrong with today's Cook the Book recipe for Shrimp and Pineapple Skewers with Garlic and Cilantro Drizzle, excerpted...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Mains", "Pineapple", "Shrimp"], "recipeIngredient": ["8 10-inch bamboo skewers, soaked in water for 15 minutes, then drained", "1 pound large shrimp (26/30 count), peeled and deveined, tails removed", "2 red bell peppers, seeded, deribbed, and cut into 1-inch squares (about 24 pieces)", "1/2 a pineapple, peeled, halved, cored, and cut into 1-inch cubes (about 24 pieces)", "6 tablespoons extra-virgin olive oil, plus more for brushing", "1 1/2 tablespoons fresh lime juice", "2 garlic cloves, minced", "1 1/2 tablespoons minced fresh cilantro", "1/2 teaspoon kosher or sea salt", "1/2 teaspoon sugar", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immerse the skewers before lighting the grill so they have time to soak. Prepare a medium-hot fire in a charcoal grill or preheat a gas grill on medium-high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the skewers, pinch a shrimp into a horseshoe shape and thread it onto a skewer, piercing it once near the tail end and again near the head end. Follow with a square of red pepper and a cube of pineapple. Repeat the lineup three more times, then load the remaining skewers the same way. Arrange the skewers on a rimmed baking sheet and brush them with olive oil. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the grill is heating, prepare the sauce: In a small bowl, combine the 6 tablespoons olive oil, the lime juice, garlic, cilantro, salt, sugar, and pepper. Stir to mix, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Oil the grill grate. Fold a foot-long piece of aluminum foil in half lengthwise and lay it on the grill grate. Arrange the skewers so the exposed bamboo is protected from the flame by the foil and the food is directly over the medium-hot fire. Use 2 pieces of foil if necessary. Grill on one side until light grill marks appear on the shrimp and the pineapple begins to caramelize, about 3 minutes. Turn and grill until the shrimp turn pink on the outside and are just opaque on the inside, about 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange 2 skewers on each warmed dinner plate, and drizzle the garlic and cilantro sauce over the skewers. Serve immediately.</p>"}]}