{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "Spanish", "keywords": ["spanish", "torrejas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Torrejas", "link": "https://www.seriouseats.com/recipes/2008/10/brunch-torrijas-spanish-mario-batali-recipe.html", "description": "Torrejas can be described as spiked Spanish French toast for grown-ups, or, as Mario Batali describes it, French toast meets bruschetta meets red wine written by Cervantes somewhere in La Mancha. I've adapted this recipe from Spain: A Culinary Road...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Breakfast and Brunch", "Spanish"], "recipeIngredient": ["3 cups olive oil", "2 cups dry red wine", "18 half-inch-thick slices crusty bread", "3 large eggs", "1/4 cup sugar, mixed with 2 teaspoons ground cinnamon", "Mosto (recipe below) or maple syrup or reduced balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large heavy pot over medium-high heat until it reaches 365°F.  Meanwhile, pour the wine into a large shallow bowl, add the bread, and let soak briefly, until evenly moistened.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another shallow bowl, beat the eggs until well mixed.  Working in batches, remove the bread from the wine, draining well, add to the eggs, and turn to coat on both sides, then add to the hot oil and cook until golden brown, about 1 minute per side.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain on paper towels, sprinkle with the cinnamon sugar, drizzle with mosto, and serve to friends. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mimicking Mosto:</strong> To mimic mosto at home, boil 3 cups of dry red wine with 1 cup sugar, a cinnamon stick, and a slash of fresh apple cider until it is reduced by three-quarters (it will be thick and syrupy).  Allow it to cool, then store it in a clean wine bottle. Or just heat some maple syrup or reduce some balsamic vinegar in a sauce pan on a stove.</p>"}]}