{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081006Grapes.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Mario Batali", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mario Batali's Schiacciata with Concord Grapes and Fennel Seeds", "link": "https://www.seriouseats.com/recipes/2008/12/mario-batalis-schiacciata-with-concord-grapes-recipe.html", "description": "Pizza can be more versatile than we tend to think, and this one has neither sauce nor cheese. But pizza dough is a creative base for this season's iconic Concord grapes. Mario's basic dough recipe follows, but if you do...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mains", "Pizza"], "recipeIngredient": ["Pizza Dough (recipe follows, or dare I say, use pizza dough bought from your favorite pizzeria)", "1/4 cup extra-virgin olive oil", "2 cups Concord grapes, halved and seeded", "1/4 cup fennel seeds", "Coarse sea salt", "3 1/4 cups all-purpose flour, plus extra for dusting", "2 teaspoons instant or rapid-rise yeast", "1 tablespoon salt", "1 tablespoon sugar", "1 cup warm water", "1/4 cup dry white wine, at room temperature", "2 tablespoons plus 1 teaspoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas grill or prepare a fire in a charcoal grill.  Put a piastra (griddle) on the grill to preheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 2 pieces.  Using a floured rolling pin, roll each piece out to a rectangular shape about 12 inch long, 6 to 7 inches wide, and 1/4 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully place one rectangle on the piastra (or cook both breads at the same time if your piastra is big enough) and cook for just 30 seconds.  Carefully turn over and cook until the bottom is light golden brown and dry, about 1 minute.  Transfer to a cutting board (with the less cooked side up), and repeat with the second piece of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the top of each bread with 2 tablespoons of the olive oil.  Arrange the grape halves cut side down on the breads, using your fingertips to press them firmly into the soft dough.  Sprinkle with the fennel seeds and sea salt.  Using a large spatula, carefully place one of the breads (both if you have room) on the piastra, cover with the large upside-down roasting pan, and cook, undisturbed, for about 5 minutes, or until the bottom is a deep gold brown and the top has cooked through; the grapes will be just starting to wilt.  Transfer to a cutting board and repeat with the second bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>All the schiacciate to rest for 5 minutes, then cut into wedges and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Pizza Dough</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-makes about 1 3/4 pounds</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the flour, yeast, salt, and sugar and mix well.  Make a well in the center of the dry ingredients and add the warm water, wine, and olive oil.  Using a wooden spoon, stir the wet ingredients into the dry until the mixture is too stiff to stir, then mix with your hands in the bowl until the dough comes together and pulls away from the sides of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust a work surface with flour and turn the dough out.  Knead gently, dusting the work surface lightly with more flour as necessary, for 5 minutes, or until the dough is smooth, elastic, and only slightly sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Oil a large clean bowl, add the dough, and turn to coat.  Cover the bowl with plastic wrap or a kitchen towel, set in a warm part of the kitchen, and let the dough rise until doubled in size, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch down the dough, and it is ready to use.</p>"}]}