{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081017-cpk-pizza.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["California Pizza Kitchen", "fall recipes", "pizza", "Thanksgiving recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "California Pizza Kitchen's Jack-O-Lantern Pizza", "link": "https://www.seriouseats.com/recipes/2008/10/california-pizza-kitchen-cpk-jack-o-lantern-halloween-pumpkin-pizza.html", "description": "According to the California Pizza Kitchen Family Cookbook, this recipe is \"pumpkin pie on a pizza crust.\" This little jack-o-lantern gives a new life to the phrase \"pizza pie,\" and from one pizza and pie lover to another, why not?...", "totalTime": "", "recipeYield": "1 large pizza, 2 medium pizzas, or 4 individual pizzas", "recipeCategory": ["Halloween"], "recipeIngredient": ["1 pound Traditional or Honey-Wheat Pizza Dough (recipe for Honey-Wheat follows)", "2 cups canned pumpkin pie filling ", "1 twelve-ounce bag (2 cups) mini chocolate chips ", "2 chocolate kisses per pizza", "2 cups whipped cream ", "1 cup candy corn", "<h5>Special equipment</h5>", "16-inch pizza stone, wooden pizza peel, mesh strainer", "1 teaspoon active dry yeast (not \"quick rise\" type) \t", "1 cup plus 1 tablespoon warm water (105° to 110°F) ", "1 cup unbleached bread flour\t\t", "1 ½ cups whole wheat flour \t", "1 tablespoon plus 2 teaspoons clover honey \t\t", "1 teaspoon kosher salt ", "1 tablespoon plus 1 teaspoon extra-virgin olive oil \t", "<h5>Special Equipment</h5>", "Stand mixer with paddle attachment or food processor with plastic blade (both optional); do not use a hand-held mixer, which may shred the dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a seasoned (or oiled) pizza stone in the middle of your oven and preheat to 450°F for at least 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll and shape the dough into 1 large, 2 medium, or 4 individual pumpkin-shaped crusts with raised rims, and place on a floured pizza peel. If making 4 pizzas, prepare 2 at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sugar in a fine-mesh strainer and sift a thin, even layer of sugar over the dough. This will caramelize as the pizza bakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pizza to the oven and bake for 5 minutes to set the dough. Once all of the crusts have been partially cooked, spread each with a thin layer of pumpkin pie filling and return to the oven for another 5 to 10 minutes, or until the filling is set. Remove from the oven and allow the pizzas to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decorate the pizzas using mini chocolate chips to represent the vertical lines, whipped cream for the eyes and mouth, chocolate kisses for the eyeballs, and candy corn for the teeth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Honey-Wheat Pizza Dough</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1 pound, enough for 1 thirteen-inch pizza, 2 nine-inch pizzas, or 4 six-inch pizzas -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, dissolve the yeast in the water. Make sure the water is not too hot, as this will kill the yeast and prevent the dough from rising. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using a stand mixer, use the paddle because the dough hook will not mix this size batch efficiently. In the mixing bowl, combine the flour, sugar, salt, and 1 tablespoon of the olive oil and stir by hand just to distribute. Add the dissolved yeast and place the bowl and paddle on the mixer. Start mixing on the lowest speed to mix. Increase the speed slightly and mix for 2 to 3 minutes, until the dough is smooth and elastic. Do not over-knead, as this will build up too much gluten and make the dough difficult to shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using a food processor, be sure to use the plastic blade; the metal knife will cut through the gluten strands and keep the dough from developing any \"body.\" Proceed as for the stand mixer, making sure to stop kneading as soon as the dough forms a smooth ball. Over-kneading could overheat the dough because the mixing bowl is directly above the motor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If mixing by hand, place the dry ingredients in a 4- to 6- quart mixing bowl, and stir to combine. Make a well in the middle and pour the liquids, reserving 1 teaspoon of olive oil. Use a wooden spoon to combine the ingredients. Once all the flour is mixed in, turn the dough onto a lightly floured work surface and, with lightly oiled hands, knead the dough for 5 minutes. It should be smooth and elastic, but will still be slightly sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining teaspoon of oil in a 1- quart mixing bowl and spread it with your fingertips. Place the dough ball in the bowl, move it around the oil, then turn it over so that the oiled side is facing upward. Cover the bowl tightly with plastic wrap and allow the dough to rise until doubled in bulk, 11⁄2 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You may use the dough at this point, but if possible--and this requires some planning-- punch the dough down, re-shape it into a ball, and cover tightly with plastic wrap. Refrigerate the dough overnight; this will develop a more flavorful dough with a chewier consistency. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 2 hours before you are ready to assemble your pizza, remove the dough from the refrigerator. If making individual pizzas, use a sharp knife to divide the dough into 2 or 4 equal portions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each portion of dough into a round ball on a smooth, clean surface, making sure to seal any holes by pinching or rolling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the newly formed dough balls in a glass baking dish, spaced far enough apart to allow for each to double in size. Seal the top of the dish with clear plastic wrap. Set aside at room temperature until the dough balls have doubled in size, about 2 hours. They should be smooth and puffy. Dress the pizza according to the recipe.</p>"}]}