{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "duck rillettes", "fat", "Jennifer McLagan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Duck Rillettes", "link": "https://www.seriouseats.com/recipes/2008/10/cook-the-book-duck-rillettes.html", "description": "Oddly, I'd never had duck rillettes—or any rillettes for that matter—until I moved to Brooklyn. Fortunately, Smith Street, the borough's restaurant row, changed all that. Sample, a tiny, global tapas bar with a killer cocktail list (I love their Tamarind...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Cook the Book"], "recipeIngredient": ["1 1/2 pounds duck legs, neck, wings, skin, and fat", "10 1/2 ounces pork belly, skin removed", "1/4 cup dry white wine", "1 orange", "2 cloves garlic", "1 fresh bay leaf", "1 1/2 teaspoons coarse sea salt", "1 teaspoon coriander seeds, crushed", "Freshly ground black pepper and fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the duck legs, neck, and wings in half. Cut the skin and fat into small pieces and the pork belly into 3/4-inch pieces. Place all duck and pork in a large bowl and add the wine. Remove a large strip of zest from the orange and set the orange aside. Peel and halve the garlic cloves, removing the germ (where the shoot starts). Add the orange zest, garlic, bay leaf, coarse salt, and coriander seeds to the duck mixture. Season generously with freshly ground pepper and toss to mix. Marinate 6 to 8 hours or overnight in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 250ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tip the duck mixture with all the seasonings and wine into a heavy casserole or Dutch oven, cover, and cook, stirring occasionally, until the meat is falling off the bone, about 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the duck mixture from the oven, and tip it with all the fat and juices into a large, fine-mesh sieve suspended over a bowl. Empty the contents of the sieve onto a large platter, then pour the liquid from the bowl into a measuring cup and set aside. Let the meat mixture cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The cooking liquid will have separated into fat and juices. Carefully pour off the fat and set aside. Add about 1/4 cup of the juices to the shredded meat mixture so that it is very moist. Taste and adjust the seasoning, adding more pepper and fine sea salt if necessary. Finely grate 1 tablespoon of zest from the orange and then squeeze 2 tablespoons of juice. Stir the zest and juice into the mixture.</p>"}]}