{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/sacklunch.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["coleslaw", "sack lunch", "sandwiches", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: Turkey and Coleslaw Sandwich", "link": "https://www.seriouseats.com/recipes/2008/06/turkey-and-coleslaw-sandwich-recipe.html", "description": "One of my favorite sandwiches is roast turkey and coleslaw on a Kaiser roll. I happened to overhear someone order it at the inauspicious looking but better-than-average deli near my first office, and I’ve been hooked ever since. I’m always...", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Mains", "Sandwiches", "Turkey"], "recipeIngredient": ["1 head red or green cabbage (2 pounds), cored and shredded (12 to 14 cups)", "Salt", "1/2 teaspoon caraway seeds", "1/2 cup mayonnaise", "2 tablespoons white vinegar", "1 teaspoon Dijon mustard", "1 teaspoon sugar", "Pepper", "2 carrots, peeled and grated ", "1 small onion, minced", "2 pounds boneless turkey breast, tied up like a roast", "Olive oil", "Coarse salt", "Pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the cabbage with 1 teaspoon salt and allow to sit in a colander for at least 1  hour or up to 4 hours. Meanwhile, toast the caraway seeds in a small skillet over medium heat until fragrant, about 3 minutes. Rinse the cabbage, then pat thoroughly dry with paper towels. Whisk the toasted caraway seeds, mayonnaise, vinegar, mustard, sugar, and 1/4 teaspoon pepper together in a bowl large enough to hold the salad. Add the cabbage, carrots, and onion and toss. Chill for at least 1 hour before serving. Season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Roast Turkey for Sandwiches</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 8 sandwiches -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Put the turkey on a baking sheet, rub it all over with olive oil, and season generously and evenly with salt and pepper. When the oven is hot, roast the turkey to an internal temperature of about 160°F. This should take about 45 minutes, but start checking with a meat thermometer at 30 minutes. Allow the cooked roast to rest for at least 15 minutes before slicing thinly. The turkey will be much easier to slice thinly when it has cooled completely and been refrigerated for a while.</p>"}]}