{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/gingersnaps-thumb.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["baking", "Cook the Book", "Cookies", "gingersnaps", "holiday baking", "holiday recipes", "holiday sweets", "holidays", "Nick Malgieri", "The Modern Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Three-Way Gingersnaps", "link": "https://www.seriouseats.com/recipes/2008/09/three-way-gingersnaps-recipe.html", "description": "Something about gingersnaps&mdash;perhaps their subtle, warm spiciness; perhaps their crumbly crunch&mdash;reminds me of crisp autumn leaves. Right around this time of year, I start to crave a plate of cookies straight from the oven, paired with a steaming mug of...", "totalTime": null, "recipeYield": "about 60 cookies", "recipeCategory": ["Cook the Book", "Desserts", "Ginger"], "recipeIngredient": ["2 cups all-purpose flour", "3 teaspoons ground ginger", "2 teaspoons baking soda", "1/2 teaspoon salt", "12 tablespoons unsalted butter, softened", "1 cup sugar, plus more for rolling the cookies before baking", "1 large egg", "1 tablespoon grated fresh ginger", "2 tablespoons finely chopped crystallized ginger", "2 tablespoons honey", "2 or 3 cookie sheets or jelly-roll pans lined with parchment or foil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set racks in the upper and lower thirds of the oven and preheat to 325ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the flour with the ground ginger, baking soda, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the butter and sugar in the bowl of an electric mixer and beat with the paddle attachment on medium speed until lightened, about 3 minutes. Beat in the egg and continue beating until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decrease the mixer speed to low and beat in half the flour mixture. Stop and scrape down the bowl and paddle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat in the grated ginger, the crystallized ginger, and the honey. After they are incorporated, beat in the remaining flour mixture. Remove the bowl from the mixer and use a large rubber spatula to give a final mixing to the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll 1/2 tablespoon of the dough between the palms of your hands to make a little sphere, then roll it in a shallow bowl of sugar. Place it on one of the prepared pans. Continue with the remaining dough, keeping the subsequent cookies about 2 inches apart on all sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the gingersnaps until they spread and become deep golden, 15 to 20 minutes. After the first 10 minutes, place the pan from the lower rack on the upper one and vice versa, turning the pans from back to front at the same time. If you know that your oven gives off strong bottom heat, stack the pan on the lower rack on top of a second one for insulation.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the papers off the pans to cool the cookies. If you have only one more pan of gingersnaps to bake, readjust one of the racks to the middle level for baking.</p>"}]}