{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080810-shopsins-cover.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["black beans", "brunch", "Cook the Book", "Eat Me: The Food and Philosophy of Kenny Shopsin", "eggs", "Shopsin's", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Blisters on My Sisters", "link": "https://www.seriouseats.com/recipes/2008/10/blisters-on-my-sisters-recipe.html", "description": "How many dishes do you know of that were originally inspired by a Frank Zappa song? I'm guessing not many. Motivated by Zappa's lyrics from his song Jewish Princess: \"I want a dainty little Jewish princess with a couple of...", "totalTime": "", "recipeYield": "2 servings", "recipeCategory": ["Beans and Pulses"], "recipeIngredient": ["6 corn tortillas, warmed", "2 cups cooked white rice", "1 cup Cuban Black Bean Soup (recipe follows) or canned black bean soup or black beans, drained", "2 roma tomatoes (fresh or from a can of <strong>San Marzano</strong> tomatoes), chopped", "Minced jalapeño or chipotle peppers, to taste", "2 extra-large eggs", "2 big handfuls of arugula", "1 pound black turtle beans, soaked for at least 12 hours ", "1 smoked pork shank, or ham bone or 2 ham hocks", "1/2  big yellow Spanish onion, chopped", "1 tablespoon ground cumin", "1 tablespoon garlic powder", "1 tablespoon good olive oil", "2 teaspoons red wine vinegar", "1/4 to 1 teaspoon minced pickled jalapeño peppers, depending on taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the tortillas on the griddle or in whatever way you like to heat tortillas. In a sauté pan over medium heat, combine the rice, soup, tomatoes, and jalapeño peppers. Mush it all up together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile cook the eggs sunny-side up. To serve, put 1 handful of arugula in the bottom of two plates. Put the tortillas side by side on top of the arugula, and the rice-beans mixture on top of the tortillas, dividing it evenly. Carefully slide the sunnies on top of that and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Cuban Black Bean Soup</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-makes 3 to 8 servings-</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain and rinse the beans three times and then put them in a large pot with the pork shank, onion, and enough water to cover. Add the cumin, garlic powder, olive oil, vinegar, and jalapeño peppers. Simmer for 4 hours, or until the beans are the proper texture for your taste. (Personally, I am not an al dente bean guy. I like my beans so that when I bite into them, the texture is pleasantly creamy and tender, like a piece of cake.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork shank, pull the meat from the bone, discard the bone, and put the meat back in the pot. If you are freezing some of the soup, let it cool before portioning it into plastic bags.</p>"}]}