{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["baking", "cakes", "Cook the Book", "Nick Malgieri", "The Modern Baker", "whipped cream cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Whipped Cream Layer Cake", "link": "https://www.seriouseats.com/recipes/2008/09/whipped-cream-layer-cake-recipe.html", "description": "In the 1970s, the author of this week's Cook the Book Nick Malgieri visited with James Beard, who told him about a cake that was \"little more than some sweetened whipped cream, a couple of eggs, and some flour.\" The...", "totalTime": null, "recipeYield": "one 9-inch, 2-layer cake, about 12 servings", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["<strong>For the cake:</strong>", "2 cups all-purpose flour", "1 1/2 cups sugar", "3 teaspoons baking powder", "1/2 teaspoon salt", "1 1/2 cups heavy whipping cream", "2 teaspoons vanilla extract", "3 large eggs", "<strong>For the caramel whipped cream:</strong>", "1/2 cup sugar", "1 teaspoon water", "3 cups heavy whipping cream", "2 teaspoons vanilla extract", "Two 9-inch round cake pans, 2 inches deep, buttered, and the bottoms lined with disks of parchment or buttered wax paper cut to fit."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a rack in the middle of the oven and preheat to 350ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the cake batter, combine the flour, 3/4 cup of the sugar, the baking powder, and salt in a bowl and stir well to mix. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the cream and vanilla in a large bowl and whisk by hand until thickened and stiff. Whisk in the eggs, one at a time. Whisk in the remaining 3/4 cup sugar. Whisk in the flour mixture in 3 separate additions, whisking smooth after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter between the 2 prepared pans and smooth the tops. Bake the layers until they are well risen, deep golden, and firm in the center when pressed with a fingertip, 30 to 35 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the layers in the pans on racks for 5 minutes, unmold them, and cool them right side up on the racks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the layers are baking, prepare the caramel whipped cream. Combine the sugar and water in a heavy saucepan and stir well to mix. Put 1/2 cup of the cream in a second small saucepan. Place the first pan on medium heat and cook undisturbed until the sugar begins to melt and caramelize—you'll see a few wisps of smoke coming out of the sugar. Reduce the heat to low and stir occasionally so that the sugar melts and caramelizes evenly. Remove it from the heat when the caramel is still very pale (the sugar will continue to darken off the heat). Slide the pan with the cream off the burner. As soon as the cream has some bubbles around the edge, add it to the caramel at arm's length, averting your face—the caramel will boil up and may splatter out of the pan. Pour the diluted caramel into a medium bowl and cool it to room temperature. Stir in the remaining 2 1/2 cups cream and the vanilla and chill until you are ready to finish the cake (this can be made the day before).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish the cake, whip the cream mixture by hand or with an electric mixer until it holds a firm peak. Place one of the cake layers on a cake cardboard or platter and spread it with a little less than half the whipped cream. Invert the second layer onto the cream and spread the outside of the cake with the remaining whipped cream, swirling it with the point of the spatula.</p>"}]}