{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["thanksgiving", "Thanksgiving turkeys"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salted Roast Turkey with Herbs and Shallot-Dijon Gravy from 'Bon Appétit'", "link": "https://www.seriouseats.com/recipes/2008/10/salted-roast-turkey-with-herbs-and-shallot-dijon-gravy-from-bon-appetit-magazine.html", "description": "When we talked to Bon Appétit editor in chief Barbara Fairchild about the November 2008 issue of the magazine, we asked her what her favorite Thanksgiving recipes from the issue were. I love the idea of salting a turkey instead...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["<strong>Herbed Salt:</strong>", "1/3 cup plus 1 tablespoon coarse kosher salt", "1 1/2 teaspoons dried rosemary", "1 1/2 teaspoons dried rubbed sage", "1 1/2 teaspoons dried thyme", "1 teaspoon black peppercorns, crushed", "3 small bay leaves, coarsely torn", "1 teaspoon finely grated lemon peel", "<strong>Turkey:</strong>", "1 14- to 16-pound turkey (neck, heart, and gizzard reserved)", "1 large onion, chopped", "1 large celery stalk, chopped", "1 whole lemon, chopped with peel", "1 teaspoon dried rosemary", "1 teaspoon dried rubbed sage", "1 teaspoon dried thyme", "1/2 cup (1 stick) unsalted butter, room temperature", "2 cups (or more) <a href=\"#stock\">Golden Turkey Stock</a>", "<strong>Gravy:</strong>", "3 1/2 cups (about) <a href=\"#stock\">Golden Turkey Stock</a>", "2/3 cup chopped shallots", "1/2 cup all purpose flour", "1/2 cup dry white wine", "2 tablespoons Dijon mustard", "2 teaspoons chopped fresh rosemary", "<strong>Golden Turkey Stock:</strong>", "4 1/2 pounds turkey wings, cut in half", "1 large onion, chopped", "1 large carrot, chopped", "1 large celery stalk, chopped", "6 fresh Italian parsley sprigs", "1 bay leaf", "1/2 teaspoon dried thyme", "1/4 teaspoon whole black peppercorns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Herbed salt:</strong> Rub first 6 ingredients in small bowl to crush herbs finely. DO AHEAD Can be made 1 week ahead. Cover; store at room temperature. Stir in peel before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Turkey:</strong> Rinse turkey inside and out (do not pat dry). Pull any fat pads from main cavity and neck cavity of turkey; wrap, chill, and reserve fat for roasting. Place turkey in roasting bag; sprinkle inside and out with herbed salt. Close bag. Place on baking sheet; refrigerate 18 to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set rack at lowest position in oven and preheat to 325°F. Rinse turkey inside and out; pat very dry. Stir chopped onion and next 5 ingredients in small bowl. Divide onion mixture between main and neck cavities. Fold neck skin under and secure with skewer. Tuck wing tips under. Tie legs together loosely. Place turkey on rack set in large roasting pan. Spread butter all over turkey. Place reserved fat pads and reserved neck, heart, and gizzard in pan; pour in 2 cups Golden Turkey Stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast turkey 45 minutes. Baste with pan juices. Continue to roast until thermometer inserted into thickest part of thigh registers 165°F to 170°F, basting every 45 minutes, adding stock or water to pan if dry, and tenting loosely with foil if browning too quickly, 3 to 3 1/2 hours longer. Transfer turkey to platter; tent very loosely with foil and let rest 30 to 45 minutes. Reserve roasting pan with juices for gravy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Gravy:</strong> Remove turkey neck, heart, and gizzard from roasting pan. Pull meat off neck; chop neck meat, heart, and gizzard and reserve for gravy, if desired. Pour pan juices into 8-cup measuring cup. Spoon off fat from surface, reserving 1/2 cup fat. Add enough turkey stock to degreased pan juices to measure 5 1/2 cups total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place roasting pan over 2 burners on medium heat. Add 1/2 cup reserved fat and shallots; sauté 1 minute. Whisk in flour. Cook until roux is light brown, whisking constantly, about 2 minutes. Whisk in wine, stock mixture, mustard, and fresh rosemary. Bring to boil, whisking to blend. Boil until gravy coats spoon, about 3 minutes. Add neck, heart, and gizzard, if desired. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve turkey with gravy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"stock\"></a><strong>Golden Turkey Stock:</strong> Preheat oven to 400°F. Arrange wings in large roasting pan. Roast until deep brown, turning once, about 2 hours total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer wings to large bowl. Spoon 3 tablespoons turkey fat from roasting pan into large pot (reserve roasting pan). Add onion, carrot, and celery to pot. Sauté over medium-high heat until vegetables are golden, about 20 minutes. Add turkey wings to pot. Add 2 cups water to roasting pan; place over 2 burners and bring to boil, scraping up browned bits. Add liquid to pot. Add remaining ingredients and enough cold water to cover wings by 1 inch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring water to boil. Reduce heat to medium-low; simmer uncovered until stock is very flavorful and reduced to 7 1/2 to 8 cups, about 2 1/2 hours. Strain stock into large bowl. Cool 1 hour, then chill until cold, about 3 hours. Can be made 3 days ahead. Cover and keep chilled. (Can also be made and frozen 2 weeks ahead.) Spoon off fat from surface before using.</p>"}]}