{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["A Platter of Figs", "David Tanis", "recipe newsletter", "Roasted peppers", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Pepper Salad", "link": "https://www.seriouseats.com/recipes/2008/09/roasted-pepper-salad-recipe.html", "description": "The following recipe is from the September 10th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! When roasting peppers, most cooks will tell you to cover the scorched veggies or put them...", "totalTime": null, "recipeYield": "enough for a small crowd", "recipeCategory": ["Salads", "Vegetarian"], "recipeIngredient": ["12 large sweet peppers, preferably a mix of yellow, orange, and red", "Salt and pepper", "2 garlic cloves, smashed to a paste with a little salt", "1 tablespoon capers, rinsed", "Red wine vinegar", "Olive oil", "1/2 cup Niçoise olives, rinsed", "Basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the peppers over an open flame, either a wood fire or on the stovetop, or under the broiler. Try to get the peppers as close to the flame as possible so their skins will blacken and blister quickly. Turn the peppers frequently with a pair of tongs so they roast evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the peppers on a baking sheet so they can cool to room temperature. Some cooks will tell you to cover the just-roasted peppers, or put them in a bag, but I believe too much steaming overcooks the flesh.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the peppers are cool enough to handle, split them top to bottom with a large knife. Scrape the seeds from the insides, then turn each pepper half over and scrape away the charred skin. When all the peppers are scraped, slice them into 1-inch-wide strips and put them in a bowl. Season with salt and pepper and toss well. Add the garlic, capers, and a teaspoon or two of red wine vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, taste and adjust the seasoning, then mound the salad on a platter. Garnish with the olives. Drizzle with a little more oil. Decorate the salad with basil leaves. </p>"}]}