{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080923-bacon-grease-jar.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["Meat Lite", "potatoes", "Thanksgiving sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Oven Roasted Potato Wedges with Bacon Grease", "link": "https://www.seriouseats.com/recipes/2008/09/oven-roasted-potato-wedges-bacon-grease-recipe.html", "description": "Even among fats, <strong>bacon grease</strong> is considered a special kind of villain. It represents all the evils of saturated fat, calories, and cholesterol. But the fact is: bacon fat has the same amount of calories as olive oil. It's true that it has more saturated fat than some oils do, but it's no worse on that score than butter. And, if you start with high-quality bacon from Heritage pigs, it would be unforgivable to allow that flavorful fat to go to waste. I have a jar of congealed bacon fat in my fridge at all times.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon", "Meat Lite", "Potato", "Sides"], "recipeIngredient": ["1 pound red bliss or new potatoes", "2 slices thick-cut bacon (Something from a gourmet market, mail order, or a farmers' market)", "Salt and fresh ground black pepper", "1 tablespoon fresh chives, minced  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 450ºF. (Do you have a convection function? Now is the time to crank it up.) Wash the potatoes, then place them on a rimmed baking sheet and put them in the oven for three minutes to dry completely. (Dry things brown better, as do things cooked on pre-heated baking sheets.) Remove potatoes and return baking sheet to your still-heating oven. Cut the potatoes into uniform wedges&mdash;six or eight wedges per potato depending on their size. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the potato wedges with the bacon fat and a liberal sprinkle of salt and pepper. When the oven is properly preheated, remove the hot baking sheet and lay the potatoes on it in one layer, cut side down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast for 20 minutes or until well browned. Toss with chives while hot. Serve with ketchup or mayonnaise.</p>"}]}