{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["fall recipes", "gratin", "potatoes", "stuffing", "thanksgiving", "Thanksgiving sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato Gratin and Baguette Stuffing Tarte", "link": "https://www.seriouseats.com/recipes/2008/11/potato-gratin-and-baguette-stuffing-tarte.html", "description": "Every year for Thanksgiving in my family, we make some variation of potatoes au gratin. Sometimes we do it with blue cheese and caramelized onions, sometimes we go rustic and traditional, but this year I'm taking a cue from a...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Potato", "Sides"], "recipeIngredient": ["1 premade or store-bought pie crust, cold", "5 large boiler potatoes, peeled and thinly sliced", "3 cups of half and half", "2 bay leaves", "2 sprigs of thyme", "A pinch of freshly ground nutmeg", "Salt and pepper", "2 onions, thinly sliced", "2 tablespoons of butter, plus a bit extra", "1/2 baguette, cut into a 1/2-inch dice", "1 slice of prosciutto, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the cold pie crust so that it fits into a 10-inch pie plate.  Cover the bottom with dry beans and bake for about 20 minutes, until the crust is ¾ of the way cooked.  Put to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add the potatoes, half and half, bay leaves, thyme, and nutmeg, along with a good amount of salt and pepper, to a saucepot.  Bring to a low simmer, and simmer, mostly covered, for 20 minutes, until the potatoes are tender.  Drain the potatoes, but reserve the cooking cream.  Discard the bay leaves and thyme stems.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sauté the onions for 15 minutes in 2 tablespoons of butter, so that they soften, but do not take on color.  Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the onions on the bottom of the pie crust.  Follow with the potatoes, and then the prosciutto.  Pour ½ cup of the reserved cooking cream over the potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, pour enough of the reserved cooking cream over the baguette cubes to saturate (most of the liquid).  Allow them to soak up the liquid, then, using your hands (this will be messy!), lift them out, allowing the excess to drip off, but allowing them also to retain the moisture they have absorbed.  Place a layer of baguette over the potato tart.  Top with a few dabs of butter to facilitate the browning of the tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 35 minutes, until the top of the baguettes are crisp, and the pie crust is golden.  Serve in wedges.</p>"}]}