{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080618-dinnertonight-chicken-thumb.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "fall recipes", "mains", "Mexican", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken with Pumpkin Seed Sauce", "link": "https://www.seriouseats.com/recipes/2008/06/chicken-with-pumpkin-seed-sauce-recipe.html", "description": "I was initially attracted to this recipe for chicken with pumpkin seed sauce because of the similarities between it and Leo Maya's chicken with green sauce. Both cook the chicken in a glorious green sauce littered with tomatillos and chiles,...", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains", "Mexican"], "recipeIngredient": ["1/4 cup hulled pumpkin seeds", "1/2 tablespoon sesame seeds", "2 chicken breasts or legs, bone-in ", "2 1/2 cups chicken stock", "1/2 small onion, cut in half", "1 clove garlic, peeled", "1/2 habanero chile, seeded", "1/8 pound tomatillos, husked", "1/3 cup pistachios, shelled and chopped", "Salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pumpkin seeds in a large skillet over medium.  Toast for about 3, shaking the pan from time to time.  They should be very fragrant.  Remove.  Add the sesame seeds to the now empty skillet and toast for about 4 minutes, shaking the pan from time to time, again.  Remove.  If either looks like it is going to turn black then immediately remove.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the pumpkin and sesame seeds in a food processor and blend until they become a fine dust.  Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skin from the chicken pieces.  Season with salt and set in a large pot.  Pour in the chicken stock and bring to a simmer.  Cook for 20 minutes.  Remove the chicken. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onion, garlic, habanero, tomatillos, and half of the pistachios.  Cook at a simmer for 10 minutes.  Toss out the habanero.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, remove the vegetables and toss them in a blender.  Keep the stock.  Add about 1 cup of the stock and blend until very smooth.  Add more stock if it's too dry.  <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sauce into a large skillet, turn the heat to medium-low, and slowly whisk in the ground pumpkin and sesame seeds.  It should thicken the sauce up, but if it gets too dry add some more of the stock.  Add the chicken to the skillet and let them warm back up.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the chicken with the sauce on top.  Sprinkle with the rest of the pistachios.       </p>"}]}