{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080522-colacanchicken-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["beer can chicken", "chicken", "cola", "cola-can chicken", "Dr Pepper", "grilled chicken", "grilling", "poultry", "Super Bowl mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<strike>Beer</strike> Cola-Can Chicken", "link": "https://www.seriouseats.com/recipes/2008/05/beer-can-cola-can-dr-pepper-grilled-chicken-recipe.html", "description": "I was discussing Memorial Day eats on the ride home with my coworker and mentioned the possibility of smoking some beer-can chicken this weekend. This utterance caused my workmate to drop his jaw, take his eyes off the road to stare directly at me and exclaim with puzzled excitement, \"What the hell is that?!?!\"", "totalTime": null, "recipeYield": "2 to 4", "recipeCategory": ["Chicken", "Grilling", "Mains"], "recipeIngredient": ["1 chicken (3 1/2 to 4 pounds)", "2 quarts cold water", "1/2 cup kosher salt", "1/2 cup white sugar", "1 tablespoon chili powder", "2 teaspoons salt", "2 teaspoons light brown sugar", "1 teaspoon freshly ground black pepper", "1 teaspoon ground cumin", "1/2 teaspoon garlic powder", "1/4 teaspoon cayenne pepper, or more to taste", "1 can (12 ounces) cola", "2 teaspoons melted butter", "1 to 2 chunks of light smoking wood (preferably cherry or apple) <em>optional</em>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the salt and white sugar in the cold water until completely dissolved to make the brine.  Wash the chicken inside and out and place it in the brine breast side down, placing a weight on top of the chicken to keep it submerged.  Brine the chicken in the refrigerator for 1 hour, then remove from the brine, wash again, and pat dry with paper towels.  Place the chicken on a plate and put it back in the fridge to air dry overnight (optional).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chili powder salt, light brown sugar, black pepper, cumin, garlic powder, and cayenne pepper together in a small bowl.  Pop open your cola and drink 1/2 of the soda.  Make two additional holes at the top of the can with a church key-style can opener, and toss in about 1 teaspoon of the rub.  Sprinkle 1 tablespoon of the rub inside the body cavity.  Hold the bird upright, with body cavity at the bottom, and lower it onto the can so the can fits into the cavity.  Pull the legs forward to form a sort of tripod, and then tuck the wing tips behind the chicken's back.  Brush the chicken all over with the melted butter, and then apply the  remaining rub to the chicken liberally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light 1 chimney of charcoal, and when lit and covered in gray ash, dump out onto the charcoal grate.  Arrange half of the coals on each side of the grate and place a drip pan in the middle between the two piles of charcoal.  Place the wood chunks on top of the charcoal if using.  Bring the grill to between 325-350 degrees.  Place the chicken in the middle of the cooking grate, over the drip pan, then cover and cook until an instant read thermometer reads 180 degrees in thickest part of the thigh.  You may need to add more charcoal about 1 hour through cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use tongs to carefully transfer the bird on the can to a cutting board, use caution since the can and the liquid inside will be extremely hot.  Let the bird rest for 10-15 mins, then remove the can, carve, and serve.</p>"}]}