{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20081013-tweak-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["caramel popcorn", "contests", "popcorn", "Sweet Tweaks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Introducing Sweet Tweaks, a New Serious Eats Bake-Along Contest", "link": "https://www.seriouseats.com/recipes/2008/10/introducing-sweet-tweaks-a-new-serious-eats-b.html", "description": "Always adding or substituting ingredients, adjusting techniques and altering presentations, I tend to see recipes as malleable inspiration more than rigid structure. Following your comments from week to week, I get the sense that many of you are the...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["2 tablespoons cooking oil (26g)", "1/3 cup popping corn (~80g)", "6 tablespoons unsalted butter (84g)", "1/4 cup corn syrup (80g)", "1 cup sugar (210g)", "1 teaspoon salt", "1/4 teaspoon baking soda"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a two baking sheets with silicone baking sheets or lightly greased aluminum foil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large pot over medium high heat.  Add cooking oil and a few kernels of the corn and cover.  When kernels begin to pop, add the remaining popping corn.  Cover pot and shake regularly until all kernels have popped.  Remove lid and remove pot from heat, but leave popcorn in warm pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in large sauce pan or small stock pot (you’ll need plenty of room to stir the popcorn around at the end) over medium-high heat.  Add corn syrup and sugar and stir continuously with a heatproof spoon or spatula until mixture begins to boil.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At the boil, stop stirring and allow mixture to continue to boil until it turns a light blonde color with spots of amber beginning to appear (300F), about 5 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add salt and soda to sugar mixture and stir well to distribute.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat, and add reserved popcorn to mixture, stirring quickly and gently until sugar mixture is evenly distributed.  Immediately turn popcorn out onto prepared trays, spreading the pieces out as much as possible while caramel coating is still very hot.  Cool completely.  Store in an airtight container for several days.</p>"}]}