{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["beans", "cheese", "Cook the Book", "Giada de Laurentiis", "pasta", "ricotta", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Whole-Wheat Linguine with Green Beans, Ricotta, and Lemon", "link": "https://www.seriouseats.com/recipes/2008/10/wholewheat-linguine-with-green-beans-ricotta-lemon-recipe.html", "description": "When people think \"Giada\" they think \"pasta.\" After all, her previous cookbook, Everyday Pasta, was entirely dedicated to the subject. At a time when most of America was quaking in the wake of carbs, Giada taught us that they were...", "totalTime": "", "recipeYield": "4 to 6 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 pound whole-wheat linguine ", "1/2 cup part-skim ricotta cheese", "3 tablespoons olive oil", "1/2 pound French green beans (haricot verts), trimmed and halved lengthwise", "1 garlic clove, chopped", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "1 cup halved cherry tomatoes", "Zest of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, 8 to 10 minutes. Drain the pasta, reserving 1 cup of the cooking water. Transfer the hot pasta to a large heat-proof bowl and add the ricotta. Toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large, heavy skillet, warm the olive oil over medium-high heat. Add the green beans, garlic, salt, and pepper and sauté for 4 minutes. Add the reserved pasta cooking liquid and continue cooking until the beans are tender, about 4 more minutes. Add the ricotta-coated pasta to the pan with the green beans and toss to combine. Add the tomatoes and toss gently. Transfer to a serving plate and sprinkle with the lemon zest. Serve.</p>"}]}