{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080821-butterscotch-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["butterscotch", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Butterscotch Pudding: Searching for the Perfect Recipe", "link": "https://www.seriouseats.com/recipes/2008/08/butterscotch-pudding-history-recipe.html", "description": "We're not above instant pudding or even a foil-topped pudding cup from time to time, but some itches for butterscotch pudding can only be scratched by the real homemade deal.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts"], "recipeIngredient": ["1/2 cup sugar (105g)", "2 tablespoons cold tap water (28g)", "3 large egg yolks (60g)", "3 tablespoons cornstarch (24g)", "1/2 teaspoon kosher salt (4g)", "1 tablespoon molasses (20g)", "2 1/2 cups whole milk (560g)", "1 teaspoon vanilla extract (5g)", "2 teaspoons scotch, whiskey, bourbon or dark rum, optional (10g)", "6 tablespoons cold unsalted butter, cut into about 8 large chunks (84g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a fine mesh strainer over a heatproof bowl and place beside the stovetop. Whisk together cornstarch and egg yolks until smooth.  Add molasses and salt, and whisk to incorporate.  Slowly whisk in about 1/2 cup of the whole milk, until mixture is smooth and free of lumps. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining milk in the microwave or on the stove top until hot but not boiling.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread sugar evenly over the bottom of a medium sauce pan.  Sprinkle sugar with water, tilting pan slightly to moisten all sugar.  Place pan over medium-high heat.* After about five minutes, sugar will begin to color.  With a long-handled heat-proof spatula or wooden spoon, gently stir the sugar until it is an even, red-amber color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taking care to avoid hot splatter, slowly pour in about half of the warm milk, stirring vigorously to dissolve the caramelized sugar. Once the caramel is dissolved, add the remaining warm milk and turn off the heat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir cornstarch mixture from the first step to loosen and smooth.  Slowly whisk about half of the hot caramel-milk mixture into the cornstarch mixture, then pour this cornstarch mixture back into the pot with the remaining caramel milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stirring constantly, and taking care to scrape regularly along the sides and corners of the pot, cook the mixture over medium heat for about eight minutes, until foam subsides, mixture thickens and large bubbles begin to occasionally rise and break at the surface.  Continue to cook the pudding, stirring vigorously for an additional minute.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from heat, stir in the extract and liquor, then immediately pour the pudding through the reserved strainer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the pudding to cool in the bowl at room temperature for about 10 minutes, stirring occasionally to prevent a skin from forming.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the pudding into a blender pitcher or food processor bowl and blend or process on high.  (Be careful to avoid hot splatter.) Add butter chunks one by one, and continue to blend the pudding for about a minute after the last butter chunk has been added.  Scrape down the sides of the container and blend pudding briefly to ensure thorough incorporation.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the pudding into six 4-ounce ramekins and refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* If you’re comfortable making a caramel and want to save some time, you can perform first and second steps while the sugar cooks in third step.</p>"}]}