{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cakes", "chocolate", "chocolate cakes", "Cook the Book", "Cowgirl Cuisine", "desserts", "Paula Disbrowe"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chocolate Whiskey Cake", "link": "https://www.seriouseats.com/recipes/2008/05/cook-the-book-chocolate-whiskey-cake.html", "description": "I saved the best for last. Today's Cook the Book recipe, the final one to be excerpted from Cowgirl Cuisine, is for a deep, dark, incredibly dense Chocolate Whiskey Cake. This is one of my go-to, never-fail dessert recipes: I've...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["12 tablespoons (1 1/2 sticks) unsalted butter, cut into 1-inch pieces, plus more to grease the pan", "3/4 cup plus 3 tablespoons unsweeted (not Dutch process) cocoa powder", "1 1/2 cups strong brewed coffee", "1/2 cup whiskey", "1 cup granulated sugar", "1 cut dark brown sugar", "2 cups all-purpose flour", "1 1/2 teaspoons baking soda", "3/4 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1/8 teaspoon ground cloves", "3 large eggs", "2 teaspoons pure vanilla extract", "1 cup mini chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>place an oven rack in the center of the oven and preheat to 325°F. Butter a 10-inch springform pan and dust with 3 tablespoons cocoa powder, tapping out the excess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the coffee, whiskey, butter, and remaining 3/4 cup of cocoa powder in a heavy medium saucepan over low heat until the butter is melted, whisking occasionally, Add the sugars and whisk until dissolved. Remove from the heat, transfer the mixture to a large bowl, and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the chocolate cools, whisk together the flour, baking soda, salt, black pepper, and cloves, in a largebowl. In a separate, small bowl, whisk together the eggs and vanilla. Beginning with a slow drizzle, whisk the eggs into the cooled chocolate mixture until combined. Add the flour mixture and whisk until smooth (but don't overmix), then stir in the chocolate chips. Pour the batter into the prepared pan and bake until a wooden pick inserted into the center comes out mostly clean, about 50 minutes to 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the cake in the pan on a rack (if you're going to leave the cake in the pan overnight cover it with a dish towel so it doesn't dry out). Using the tip of a knife, loosen the cake from the pan and remove the outer ring. Wrap the cake in plastic so it doesn't dry out. After 1 day, store it in the fridge, where it will last up to 1 week.</p>"}]}