{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081229jamieathome.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Jamie at Home", "Jamie Oliver", "sausages"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sweet Cherry Tomato and Sausage Bake", "link": "https://www.seriouseats.com/recipes/2008/12/jamie-oliver-sweet-cherry-tomato-and-sausage-bake-recipe.html", "description": "Today's Cook the Book recipe, sweet cherry tomato and sausage bake, is a perfect way to make the most of less-than-stellar winter tomatoes. Drizzled with olive oil, balsamic vinegar, and fresh herbs, the cherry tomatoes are baked until they burst,...", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cook the Book", "Mains", "Pork"], "recipeIngredient": ["4 1/4 pounds lovely ripe cherry tomatoes, mixed colors if you can find them", "2 sprigs each of fresh thyme, rosemary and bay ", "1 tablespoon dried oregano", "3 cloves of garlic, peeled and chopped", "12 good-quality coarse Italian pork sausages", "Extra virgin olive oil", "Balsamic vinegar", "Sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Put tomatoes, herb sprigs, oregano, garlic and sausages in a large roasting pan, and drizzle well with extra virgin olive oil and balsamic vinegar and season with salt and pepper. Toss together, then make sure the sausages are on top and pop the pan into the oven for half an hour. After this time, give it a shake and turn the sausages over. Return to the oven for 15 to 30 minutes, depending on how golden and sticky you like your sausages.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the sauce is too thin, lift out the sausages and place the pan on the stove to cook it down to the consistency you like, and then put the sausages back in. Check seasoning and serve with good, warm bread or with mashed potato, rice or polenta, a green salad and a nice glass of wine.</p>"}]}