{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feat-20081111homefries.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["fried potatoes", "fries", "home fries", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Paprika-Spiked Home Fries with Poached Egg", "link": "https://www.seriouseats.com/recipes/2008/11/paprika-spiked-potatoes-home-fries-poached-egg-recipe.html", "description": "\"The more stirring, the less brown. And brown is the whole point.\" Because sometimes, this is all I want to eat for dinner, home fries. And I say there's nothing wrong with that. Deeply crisp, creamy chunks of potato seared...", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Breakfast and Brunch", "Dinner Tonight", "Eggs", "Mains", "Potato", "Vegetarian"], "recipeIngredient": ["3/4 pounds Yukon Gold potatoes (2-3 medium), scrubbed and cut into 3/4-inch pieces", "3 tablespoons unsalted butter", "1 small onion, finely chopped", "1/2 teaspoon paprika (or substitute garlic powder)", "1/2 teaspoon table salt, or to taste", "Ground black pepper", "2 eggs", "2 tablespoons white vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange potatoes in large microwave-safe bowl, top with 1 tablespoon butter, and cover tightly with plastic wrap. Microwave on high until edges of potatoes begin to soften, 5 to 7 minutes, shaking bowl (without removing plastic) to redistribute potatoes halfway through cooking.  Alternatively, do not chop them and boil for 8 to 10 minutes, drain, and chop once cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 1 tablespoon butter in a 10 or 12-inch skillet over medium heat. Add onion and cook until softened and golden brown, about 6 minutes. Transfer to small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining tablespoon of butter in now-empty skillet over medium heat. Add potatoes and pack down with spatula. Cook, without moving, until underside of potatoes is brown, 5 to 7 minutes. Turn potatoes, pack down again, and continue to cook until well browned and crisp, 5 to 7 minutes. Reduce heat to medium-low and continue cooking, stirring potatoes every few minutes, until crusty and golden on all sides, 9 to 12 minutes. Stir in onion, seasonings of your choice and salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When potatoes are about ten minutes off, bring a small pot of water to boil, and add the vinegar.  Turn the heat down to a very gentle simmer and slide the eggs into the water (I use a <a href=\"http://www.seriouseats.com/recipes/2008/05/frisee-aux-lardon-bacon-and-eggs-salad-recipe.html\">ladle technique</a>).  Guide the eggs back into a compact shape if needed.  Cook just until the whites are completely set, 3-5 minutes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste the home fries for seasoning, and dust with almost all the paprika.  Remove to two plates, top with the egg and sprinkle remaining paprika, lots of fresh black pepper, and a sprinkle of salt.</p>"}]}