{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["mains", "mussel", "mussels", "seafood", "Top Chef"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Spicy Coconut Curry Steamed Mussels with Mango Couscous", "link": "https://www.seriouseats.com/recipes/2008/05/spicy-coconut-curry-steamed-mussels-with-mango-couscous-recipe.html", "description": "Today's Cook the Book recipe, excerpted from Top Chef: The Cookbook, pairs the fresh seaside flavors of steamed mussels with fragrant coconut, spicy curry, and fruity mango. Could anything be more perfect for summer? Originally prepared by chef Betty Fraser...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["4 pounds fresh mussels, scrubbed and debearded", "2 tablespoons vegetable oil", "One 2-inch piece fresh ginger, peeled and minced", "1 small red onion, minced", "1 tablespoon red curry paste, or to taste", "One 13-ounce can unsweetened coconut milk", "3 cups low-sodium vegetable stock", "Juice and finely minced zest of two limes", "1 teaspoon ground coriander", "1/2 teaspoon salt", "Freshly ground black pepper", "2 cups instant couscous", "1 mango, peeled and diced", "1/4 cup cognac", "2 tablespoons sugar", "1/4 cup fresh basil", "1/4 chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard any mussels with cracked shells, and those that do not close when tapped gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan or skillet with a lid, heat 1 tablespoon of the oil and add the ginger and onion. Cook over medium heat, stirring frequently, until the onion is just starting to soften, about three minutes. Add the curry paste and stir well to coat the ginger and onion. Add the coconut milk and 1 cup of the stock and raise the heat to high; bring to a boil and cook for 5 minutes, or until reduced slightly. Add the lime zest and the mussels, then put the lid on and cook over medium-high heat for 6 to 8 minutes, until all the mussels are open. Discard any unopened mussels after 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium saucepan, bring the remaining 2 cups stock, the remaining 1 tablespoon oil, the ground coriander, the salt, and a pinch of pepper to a boil. Add the couscous and stir. Cover the pan and remove from the heat. Let stand for 5 minutes, then fluff with a fork and gently fold in the mango.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small sauté pan or skillet, combine the lime juice, cognac, and sugar. Cook over low heat, stirring frequently, until the sugar is dissolved, then carefully ignite the mixture and pour it over the mussels. Stir in the basil and cilantro and serve immediately with the couscous. </p>"}]}