{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["chocolate", "dessert", "frozen yogurt", "ice cream", "The Yogurt Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Frozen Yogurt", "link": "https://www.seriouseats.com/recipes/2008/07/chocolate-frozen-yogurt-recipe.html", "description": "Ever since I got my Cuisinart ICE-20 at the beginning of the summer, I've been churning out flavor after delectable flavor of cool, smooth, luxurious ice cream. And while there's certainly nothing wrong with indulging every now and again (and...", "totalTime": null, "recipeYield": "about 1 1/2 quarts", "recipeCategory": ["Desserts"], "recipeIngredient": ["2 cups whole milk", "4 egg yolks", "2/3 cup sugar", "4 ounces bittersweet or semisweet chocolate, melted and cooled", "1 1/2 teaspoons vanilla extract", "2 cups full-fat plain yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan over medium heat, heat the milk until just under a boil (you will see tiny bubbles around the edges and steam rising from the surface). Remove the milk from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk the egg yolks and the sugar in a bowl to blend. Gradually add 1/4 cup of the hot milk into the egg yolks, whisking constantly, then add the egg yolks back to the saucepan with the rest of the milk and cook over medium heat, stirring constantly, until the mixture has thickened enough to coat the back of a spoon (a candy thermometer will register 170°F). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the melted chocolate and the vanilla extract. Strain the mixture through a fine mesh sieve into a large bowl and allow to cool to room temperature. Stir in the yogurt and chill in the refrigerator until very cold, several hours or overnight. Freeze in an ice cream maker according to the manufacturer's instructions. </p>"}]}