{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080703-homemade-bomb-pops.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["blueberries", "frozen treats", "ice pops", "popsicles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red, White, and Blueberry Pops", "link": "https://www.seriouseats.com/recipes/2008/07/red-white-and-blueberry-homemade-bomb-pops-recipe.html", "description": "Replacing artificial colors and flavors with the natural charms of fresh berries and tangy cheesecake, nobody will miss the true blue in these delicious homespun versions of the familiar day-glo red-white-and-blue rocket pop. For a more in-depth how-to on this...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Blueberry"], "recipeIngredient": ["For the red layer:", "¼ cup water (55g)", "½ teaspoon powdered gelatin (optional)", "1 cup strawberries, hulled (~130g)", "1 cup raspberries (~110g)", "1 teaspoon balsamic vinegar ", "¼ cup honey (80g)", "For the white layer:", "¼ cup milk (55g)", "½ teaspoon powdered gelatin (optional)", "½ vanilla bean (optional)", "1 6-ounce container of plain yogurt (170g)", "4 ounces cream cheese (110g)", "¼ cup honey (80g)", "Pinch salt", "For the blueberry layer:", "¼ cup water (55g)", "½ teaspoon powdered gelatin (optional)", "1 pint blueberries, picked over (~250g)", "2 teaspoon lemon juice", "¼ cup honey (80g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the first ingredient of each layer into separate microwave-safe bowls.  Sprinkle the surface of the liquid in each bowl with ½ teaspoon each of powdered gelatin.  Set the bowls aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse and hull the strawberries and place them in a food processor or blender, along with the raspberries, vinegar and honey for the red layer.  Puree smooth, scraping down the sides occasionally, to ensure thorough blending.  Place one bowl of water and gelatin in the microwave and heat for 5 second intervals, stirring in between, until gelatin is fully dissolved.  Add melted gelatin mixture to pureed mixture and process until fully incorporated.  Carefully pour about 4 teaspoons of this mixture into each of eight 2- to 2-1/2 ounce popsicle molds.  Place partially filled molds in the freezer for about 20 minutes while preparing the white layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly clean the food processor or blender, add the scrapings of the vanilla bean (save the pod for another use) and add the remaining four ingredients for the white layer.  Blend until very smooth, scraping down the sides occasionally, to ensure thorough blending.  Place the bowl containing the milk and gelatin in the microwave and heat for 5 second intervals, stirring in between, until gelatin is fully dissolved.  Add melted gelatin mixture to cream cheese mixture and process until fully incorporated.  Remove the partially filled molds from the freezer and carefully pour about 4 teaspoons of the cream cheese mixture into each mold.  Return the molds to the freezer for about 20 minutes while preparing the blueberry layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the food processor or blender once more.  Add the blueberries, lemon juice and remaining quantity of honey and pulse to make a slightly chunky puree, scraping down the sides occasionally.  Place the remaining bowl of water and gelatin in the microwave and melt gelatin as per the previous layers.  Add the gelatin mixture to the blueberry puree and gently stir to combine (do not puree or the blueberry mixture will become very foamy).  Carefully pour about 4 teaspoons of the blueberry mixture into each of the popsicle molds and return to the freezer for about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the blueberry layer has set slightly, carefully insert a stick into each popsicle, taking care not to disturb the various layers.  Freeze pops completely before unmolding and serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> The gelatin in this recipe helps the layers to set up more quickly in the freezer, allowing for speedier assembly, and it helps to slow the pops melting at room temperature, but it may be omitted without serious consequence.  If you decide to omit the gelatin, the water or milk may be omitted from each layer as well.</p>"}]}