{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080214-dinnertonight-artichoke.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["appetizers", "Dinner Tonight", "gluten free", "Julia Child", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Artichokes with Lemon Butter", "link": "https://www.seriouseats.com/recipes/2008/02/dinner-tonight-artichokes-with-lemon-butter-recipe.html", "description": "Photograph from carvalho on Flickr Need some last minute Valentine's dinner plans? Think artichokes. They're tender and subtly flavored, reminiscent of a flower, and have a heart in the middle. The possibilities for metaphor are endless. Though artichoke season isn't...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Gluten-Free", "Vegetarian"], "recipeIngredient": ["2 globe artichokes", "1 stick unsalted butter, cut into 8 pieces and chilled", "Juice of two lemons to make 1/4 cup", "1/8 teaspoon salt", "Pinch of white pepper (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the artichokes for boiling: lay each on its side and cut off about an inch or so off the top, break off the small leaves near the base, and cut off all but an inch or so of the stem (you can also snap it off where it naturally breaks, like an asparagus).  Snip off the ends of the leaves all around the artichoke with scissors to rid it of any sharp points.  Rinse it well under cold water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the artichokes, uncovered, for about half an hour.  They are done cooking when the leaves pull out easily and the bottoms are tender when pierced with a knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, prepare the lemon butter.  Gently reduce the lemon juice, salt, and pepper in a small saucepan until about one tablespoon.  Over low heat, whisk in the chilled butter pieces, one at a time, until creamy.  Remove from heat, and, when ready to serve, whisk in 2-3 tablespoons dribbled hot water to warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the artichokes with the butter for dipping, and a large bowl for unused stems.  The edible parts of each leaf are nearest their base.  Bottom teeth are especially good for scraping off the flesh.</p>"}]}