{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cocktailChroniclesBug.png", "author": {"@type": "Person", "name": "Paul Clarke"}, "recipeCuisine": "", "keywords": ["cocktail", "mint", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Queen's Park Swizzle", "link": "https://www.seriouseats.com/recipes/2008/10/queens-park-swizzle-recipe.html", "description": "Several months ago I spoke with Forbidden Island owner <a href=\"http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2008/01/31/WIGQULBO0.DTL\">Martin Cate</a> for an article I was writing about ice and cocktails (the article is in the September/October issue of <em><a href=\"http://www.imbibemagazine.com\">Imbibe</a></em>). While talking about <strong>swizzles</strong>--a classic style of Caribbean drink made with well-packed crushed ice, hence a slow-sipper of a drink--Martin recommended the ancestral swizzle, a true tropical drink that launched countless imitators, called the <strong>Queen's Park Swizzle</strong>.", "totalTime": "5 minutes", "recipeYield": "makes 1 cocktail", "recipeCategory": [], "recipeIngredient": ["3 ounces 80-proof Demerara rum (El Dorado and Lemon Hart are recommended brands)", "1/2 ounce rich simple syrup", "1/2 ounce fresh lime juice", "2 dashes Angostura bitters", "8 to 10 fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a wooden muddler or the back of a wooden spoon, lightly bruise the mint leaves in the bottom of a tall chimney or highball glass, gently rubbing the leaves along the sides of the glass to coat with the fragrant oil. Add remaining ingredients to the glass and fill with crushed ice. Using a bar spoon, swizzle the drink by gently twirling the spoon between the palms of your hands, adding additional crushed ice as needed. Continue until a layer of frost develops on the outside of the glass. Garnish with a sprig of mint, spear with a straw and do what comes natural.</p>"}]}