{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["breads", "chili con queso", "classic cookbooks", "sauces", "spoonbread", "Super Bowl appetizers", "The James Beard Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Spoonbread", "link": "https://www.seriouseats.com/recipes/2008/06/james-beard-cornmeal-souffle-spoonbread-chili-con-queso-recipe.html", "description": "While your other correspondents were dolled up and hobnobbing at the Beard Awards Sunday night, I was just a few blocks and a world away, wearing an old Mexican dress and perusing The James Beard Cookbook. I thought I should...", "totalTime": null, "recipeYield": "4 generously or 6 to 8 as a small side", "recipeCategory": ["Bread", "Classic Cookbooks", "Condiments and Sauces"], "recipeIngredient": ["2 cups of milk (I used 2%)", "1 teaspoon salt", "1 cup cornmeal", "4 tablespoons butter", "Freshly ground pepper (optional)", "4 eggs, separated", "2 tablespoons butter", "2 tablespoons flour", "1/2 cup heavy cream", "1/2 cup milk", "Salt", "Pepper", "2 finely chopped cloves garlic", "1 28-ounce can plum tomatoes", "2 4-ounce cans chopped green chilies", "1 pound shredded jack cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the milk and salt to a boil, then reduce the heat. Gradually whisk in the cornmeal, stirring constantly until the mixture is smooth. It will also be very, very thick, almost like wet concrete. Stir in the butter and set aside to cool slightly. (I added 1/4 teaspoon freshly ground pepper at this point.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg yolks well and stir into the cooled cornmeal mixture. Beat the egg whites until stiff but not dry and slowly fold into the cornmeal mixture in two batches. Pour the batter into a well-buttered casserole (I used a 2-quart soufflé dish) and bake at 375°F for 35 to 40 minutes, or until light, puffy, and browned on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve from the casserole with a spoon. He recommends passing plenty of butter, salt, and pepper on the side, but I found that no extra butter or seasoning was necessary. Spoonbread is edible the second day but much better straight out of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Chili con Queso</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>No yield was provided for this recipe. Seriously, I am dying to hear about it—will someone please make this?</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter and stir in the flour, blending completely. Remove the pan from the heat and slowly whisk in the cream and then the milk, continuing to whisk until the mixture is smooth. Return to the heat and cook slowly, stirring constantly, until the sauce is thickened and smooth. Season to taste with salt and pepper. This is the cream sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic and tomatoes and cook down over medium heat for 20 minutes, stirring occasionally. Add the canned chilies and continue to cook until thickened. Stir in the cream sauce and cheese. Taste for seasoning. Do not allow to boil after the cheese has been added. Serve warm as a dip for breadsticks, corn chips, or raw vegetables.</p>"}]}