{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["A Platter of Figs", "baby artichokes", "beef", "Cook the Book", "David Tanis", "grilling", "mains", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bistecca with Fried Artichokes and Potatoes", "link": "https://www.seriouseats.com/recipes/2008/09/bistecca-with-fried-artichokes-and-potatoes-recipe.html", "description": "There are still a few solid outdoor cooking days left before it's time to trade in your Weber grill for your Le Creuset Dutch oven, and your charred burgers for slow braised meats. Why not take advantage of the weather...", "totalTime": "", "recipeYield": "8-10 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["4 pounds flank steak", "Salt and pepper", "Olive oil", "4 pounds medium potatoes, such as Yellow Fin", "2 pounds baby artichokes", "1 lemon", "4 garlic cloves, finely chopped", "1 bunch flat-leaf parsley, leaves roughly chopped", "1/2 pound arugula, washed and dried", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the flank steak generously with salt and coarsely ground black pepper. Drizzle with a little olive oil and massage in the seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and refrigerate for at least several hours, or overnight. Bring to room temperature before cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the potatoes and cut them into wedges. Boil the potatoes in salted water until just done (soft when pierced with the tip of a knife). Drain the potatoes and spread them on a baking sheet to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the baby artichokes, cut off the tops and remove a few outer leaves from each to reveal the pale green centers. Trim the stem ends with a pairing knife. Slice the artichokes lengthwise 1/4 inch thick. Put the slices in a bowl of cool water. Squeeze in the juice of the lemon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a fire in a charcoal grill. While you wait for the grill to heat, pan-fry the artichokes and potatoes: Drain the artichoke slices and blot with a kitchen towel. Put a large skillet over a high flame. Add 1/2 inch of the olive oil and let it heat. Add the artichokes and stir them around in the oil for a minute or so. Add the potatoes and let them sizzle with the artichokes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the flame to medium, shaking the pan and stirring the vegetables, until they brown and crisp, about 10 minutes. Season with salt and pepper. Add the garlic and let it sizzle without browning. Stir in the parsley and turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the flank steak over hot coals. For a rare steak, cook about 4 minutes per side, just until juices begin to appear on the surface. Transfer to a platter and let the steak rest for 10 to 15 minutes before carving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve the flank steak in thin slices against the grain. Arrange the meat on a large warmed platter. Reheat the fried artichokes and potatoes if necessary and spoon around the steak. Garnish the platter with arugula leaves and lemon wedges. </p>"}]}