{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["appetizers", "cheesecake", "Cook the Book", "Giada de Laurentiis", "Giada's Kitchen", "pita chips", "red peppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Red Pepper Cheesecake with Homemade Pita Chips", "link": "https://www.seriouseats.com/recipes/2008/10/red-pepper-cheesecake-with-pita-chips-recipe.html", "description": "Normally, I wouldn't excerpt a recipe that calls for a specific pan in an unusual shape or size. Nothing is more frustrating then getting all excited to bake, say, a spicy gingerbread, only to discover that it requires six mini...", "totalTime": null, "recipeYield": "4 to 6 servings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Cook the Book"], "recipeIngredient": ["4 ounces ricotta cheese, at room temperature", "4 ounces cream cheese, at room temperature", "2 ounces goat cheese, at room temperature", "1 tablespoon sugar", "1 egg", "Kosher salt", "2 jarred roasted red bell peppers cut into thin strips and halved (about 1/2 cup)", "4 pitas", "2 tablespoons olive oil", "Freshly ground black pepper", "1/4 cup apricot jam", "1 to 2 teaspoons hot water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350ºF. Wrap the outside of a 4 1/2-inch springform pan with 2 layers of heavy-duty foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ricotta, cream cheese, and goat cheese in a food processor fitted and pulse to mix. Add the sugar, egg, and a pinch of salt and pulse a few times until well mixed and thick and creamy. Fold in the red pepper strips with a rubber spatula. Pour the cheese mixture into the springform pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the springform pan in a roasting pan and pour enough hot water into the roasting pan to come halfway up the sides of the springform pan. Bake until the cheesecake is golden at the edges and the center of the cake moves slightly when the pan is gently shaken, about 45 minutes (the cake will become firm when it is cold). Transfer the cake to a wire rack to cool for one hour. Refrigerate until the cheesecake is cold, at least 3 hours and up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pita chips, preheat the oven to 350ºF. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the pitas into 8 triangles each (like a pie). Place the triangles on a rimmed baking sheet. Drizzle with the olive oil and sprinkle with salt and pepper. Bake until crisp and golden, about 12 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, combine the jam and the hot water in a small bowl and stir until the jam liquefied. Remove the cheesecake from the springform pan and place on a serving plate. Drizzle the jam mixture over the top of the cheesecake. Serve the pita chips alongside. </p>"}]}