{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080718-dinnertonight-roastedredpepper-thumb.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "mains", "roasted red peppers", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Roasted Red Pepper Salad with Bacon Dressing and Pine Nuts", "link": "https://www.seriouseats.com/recipes/2008/07/roasted-red-pepper-salad-with-bacon-dressing-and-pine-nuts-recipe.html", "description": "Something wasn't quite right with this Bon Appétit recipe for roasted red pepper salad with bacon and pine nuts. While the roasted red peppers were delicious, the dressing tasted fine, and the colors were vibrant, there wasn't much contrast in the salad and it ended up feeling sloppy. But I finally figured out why when I realized I had forgotten to toss in the pine nuts.", "totalTime": "", "recipeYield": "2-3", "recipeCategory": ["Bacon", "Dinner Tonight"], "recipeIngredient": ["2 red bell peppers", "2 green bell peppers (or yellow)", "4 bacon slices", "1 garlic cloves, minced", "Pinch red pepper flakes", "1 teaspoon chopped fresh thyme", "1/2 tablespoon sherry vinegar", "Pinch salt", "2 tablespoons pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Char the peppers on all sides until blackened.  This can either be done by setting them on top of stove or underneath the broiler, turning them every other minute or so.  When charred, place in a plastic bag, tie it shut, and let the peppers steam for 15 minutes.  Peel off the skins of the peppers (it should be very easy to do so), remove the skins, and slice the peppers into 1/3 inch strips.  Place in a large bowl.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, saut&eacute; the bacon in a large skillet until cooked.  Remove the pieces of bacon, and drain on a paper towel.  Add the minced garlic and red pepper flakes to the skillet and cook for 1 minute.  Add the chopped thyme, cook for 10 seconds and then pour in the vinegar.  Turn off the heat.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the pine nuts by placing them in a skillet over medium heat.  Shake the pan every 30 seconds or so, and cook until the pine nuts developed color but not blackened.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the dressing over the red peppers.  Season with salt, and sprinkle the toasted pine nuts over top.  </p>"}]}