{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080208-feature01.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "chocolate", "Cookies", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Chocolate-Dipped Linzer Hearts", "link": "https://www.seriouseats.com/recipes/2008/02/baking-with-dorie-chocolatedipped-linzer-hearts-cookies-recipe.html", "description": "If you haven't already whipped up something wonderful for the sweetheart(s) in your life, here's a recipe for a cookie that makes any day sweeter.  It's a <strong>linzer cookie</strong>&mdash;made with flour and ground nuts and spiced with cinnamon and cloves&mdash;cut out with a cute little heart-shaped cutter and dipped in melted chocolate.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Baking With Dorie", "Cookies", "Desserts"], "recipeIngredient": ["1 1/2 cups finely ground almonds, hazelnuts or walnuts", "1 1/2 cups all-purpose flour", "1 1/2 teaspoons ground cinnamon", "1/4 teaspoon salt", "Scant 1/4 teaspoon ground cloves", "1 large egg", "2 teaspoons water", "1 stick (8 tablespoons) unsalted butter, at room temperature", "1/2 cup sugar", "1/2 cup chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the ground nuts, flour, cinnamon, salt and cloves. Using a fork, stir the egg and water together in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the butter and sugar together at medium speed until smooth, about 3 minutes, scraping down the bowl as needed.  Add the egg mixture and beat for 1 minute more.  Reduce the mixer speed to low and add the dry ingredients, mixing only until they disappear into the dough.  Don't work the dough much once the flour is incorporated.  If the dough comes together but some dry crumbs remain in the bottom of the bowl, stop the mixer and finish blending the ingredients with a rubber spatula or your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half.  Working with one half at a time, put the dough between two large sheets of wax paper or plastic wrap.  Using your hands, flatten the dough into a disk, then grab a rolling pin and roll the dough, turning it over frequently and lifting the paper so it doesn't cut into it, until it is about 1/4 inch thick.  Leave the dough in the paper, and repeat with the second piece of dough.  Transfer the wrapped dough to a baking sheet or cutting board (to keep it flat) and refrigerate or freeze it until it is very firm, about 2 hours in the refrigerator and about 45 minutes in the freezer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 375&deg;F.  Line two baking sheets with parchment or silicone baking mats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel off the top sheet of wax paper from one piece of dough and, using a small heart-shaped cookie cutter, cut out as many cookies as you can.  If you want to have a peek-a-boo cutout, use the end of a piping tip to cut a very small circle from the centers of half the cookies.  Transfer the hearts to the baking sheets, leaving a little space between the cookies.  Set the scraps aside&mdash;you'll combine them with the scraps from the second disk and roll, cut and bake more cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies one sheet at a time for 11 to 13 minutes, or until the cookies are lightly golden, dry and just firm to the touch.  Transfer the cookies to a rack to cool to room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the second disk of dough.  Gather the scraps together, press them into a disk, roll them between sheets of wax paper or plastic wrap and refrigerate until firm, then cut and bake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To dip the cookies, have a baking sheet lined with wax paper at the ready.  When the cookies are cool, melt the chocolate chips in a coffee cup or small bowl. Dip one edge of each cookie into the chocolate, letting the excess chocolate drip back into the cup and running the edge of the cookie against the edge of the cup to clean the dipped side, then place the cookie on the lined baking sheet.  When all the cookies are dipped, slide the baking sheet into the refrigerator or freezer to set the chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing: </strong>The cookies will keep in a covered tin&mdash;use wax paper to separate the layers&mdash;for about 3 days.  They can be frozen for up to 2 months.</p>"}]}