{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["pasta", "rosemary", "Sunday Brunch", "tagliatelle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Tagliatelle with Rosemary and Lemon", "link": "https://www.seriouseats.com/recipes/2008/06/tagliatelle-with-rosemary-and-lemon-recipe.html", "description": "When the weather gets warmer I like to eat a light pasta dish for brunch. This recipe, adapted from Patricia Wells' The Provence Cookbook, is featherlight and the essence of summer. Note: I halved the amount of rosemary Wells called...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["3 tablespoons coarse sea salt", "1 pound fresh tagliatelle pasta or fresh imported linguine", "1/2 cup extra-virgin olive oil", "1/2 cup freshly squeezed lemon juice, preferably Meyer lemon", "1 cup fresh fresh rosemary leaves, finely minced", "2 cups (8 ounces) freshly grated Parmigiano-Reggiano cheese", "Fine sea salt to taste "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the pasta pot bring about 5 quarts of water to a rolling boil over high heat.  Add the coarse sea salt and the pasta, stirring to prevent the pasta from sticking.  Cook until tender or firm to the bite, 2 to 3 minutes.  Remove the pasta pot from the heat.  Remove the colander and drain over a sink, shaking to remove excess water, but retain 1 cup of the remaining pasta cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the skillet, heat the oil and lemon juice just until warm.  Add the drained pasta and the pasta cooking water, tablespoon by tablespoon, until the pasta absorbs the liquid.  Add the rosemary and toss.  Add half the cheese and toss once more.  Cover to let rest for 1 to 2 minutes to allow the pasta to thoroughly absorb the sauce.  Taste for seasoning.  Transfer to individual warmed shallow soup bowls.  Serve immediately, passing the remaining cheese at the table.    </p>"}]}