{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["sides", "stuffings", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cheeseburger and Fry Dressing", "link": "https://www.seriouseats.com/recipes/2008/11/cheeseburger-and-fry-dressing-recipe.html", "description": "Read the backstory of the dressing, based on White Castle's hamburger stuffing....", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["1 28-ounce bag of Ore Ida steak fries", "6 Kaiser rolls, cut into a 1-inch dice", "1 pound of ground sirloin", "1 tablespoon of tomato paste", "2 tablespoons of Worcestershire sauce", "3 tablespoons of olive oil, plus 1 tablespoon", "1 onion, diced", "3 ribs of celery, finely diced", "5 stems of thyme", "10 ounces of extra sharp yellow cheddar cheese, cut into a half-inch dice", "2 cans of beer", "1 cup of stock (chicken, beef, or vegetable will do)", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin by precooking the fries.  Spread in an even layer on a baking sheet and place into a preheated 450&deg;F oven for 22 minutes.  Cut in half, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the oven to 300&deg;F.  Arrange the cubed bread on two baking sheets in even layers, and bake for 35 minutes.  Meanwhile, prepare the burger.  Heat 1 tablespoon of olive oil in a large frying pan, and add the meat, salt and pepper.  Break up the meat, and as it browns, add the tomato paste and the Worcestershire sauce.  When the meat is full browned, set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the pan, and add 3 tablespoons of olive oil.  Sauté the onions, celery, and thyme, seasoned with salt and pepper, for about 8 minutes, until they are fragrant and translucent.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, warm the stock and beer in a stock pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the largest bowl you can find, toss together the bread, meat, vegetables, cheese, and potatoes with the beer and stock mixture.  Spoon into a buttered baking dish and covered with a sheet of buttered aluminum foil.  Bake covered in the foil for 20 minutes at 350 degrees, then remove the foil, and allow to bake for 25 minutes more.  Allow to sit for 10 to 15 minutes before serving.</p>"}]}