{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080121-cookthebook.png", "author": {"@type": "Person", "name": "Emily Koh"}, "recipeCuisine": "", "keywords": ["Cook the Book", "CTB: Whole Grains Every Day", "healthy and delicious", "Lorna Sass", "pancakes", "Whole Grains Every Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Healthy and Delcious Buckwheat Pancakes with Smoked Salmon and Dilled Yogurt Cheese", "link": "https://www.seriouseats.com/recipes/2008/01/cook-the-book-buckwheat-pancakes-with-smoked-salmon-dilled-yogurt-cheese-recipe.html", "description": "It's rare for me to find a pancake that satisfies. Let me clarify: whenever I go out to brunch, the first thing that leaps out at me are the pancakes. The idea of pancakes are always enticing&mdash;soft, fluffy discs of...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<b>For the Yogurt Cheese</b>", "2 cups plain low-fat yogurt*", "2 tablespoons scissor-snipped fresh chives or minced red onion ", "2 tablespoons chopped fresh dill", "<small><i>* Allow at least 1 hour to drain the yogurt for cheese.</i></small>", "<b>For the Pancakes</b>", "1/2 cup toasted (kasha) or untoasted buckwheat groats, or 1/3 cup buckwheat flour ", "1 1/2 cups whole-wheat pastry flour", "1/4 cup scissor-snipped fresh chives or thinly sliced scallion greens ", "2 tablespoons chopped fresh dill", "2 teaspoons baking powder ", "1/2 teaspoon baking soda ", "1/2 teaspoon salt ", "2 large eggs ", "1 cup well-shaken buttermilk", "1/2 to 3/4 cup 2% milk ", "4 tablespoons (1/2 stick) butter, melted and cooled ", "Safflower or canola oil, for greasing the griddle ", "6 to 8 ounces thinly sliced smoked salmon, cut into 2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>1.</b> To make the yogurt cheese: Spoon the yogurt into a fine-meshed strainer set over a bowl. Set aside for 1 to 4 hours to drain. (The longer you drain the yogurt, the thicker it will become.) Transfer the drained yogurt to a bowl and blend in the chives and dill. Cover and refrigerate until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>2.</b> To make the pancakes: If using groats, grind them to a fine flour in a spice grinder. In a large bowl, combine the buckwheat flour with the whole-wheat flour, chives, dill, baking powder, baking soda, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>3.</b> In another bowl, lightly beat the eggs. Blend in the buttermilk, 1/2 cup milk, and butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>4.</b> Make a large well in the center of the dry ingredients. Pour in the buttermilk mixture. Use a spatula to gently fold the wet ingredients into the dry to create a slightly lumpy batter. Avoid overmixing, which can make the pancakes gummy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>5.</b> If you plan to hold the pancakes to serve all at once, preheat the oven to 200°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>6.</b> Heat a large griddle or skillet over medium heat. Use a silicone brush or paper towel to lightly coat the griddle with oil. When a drop of water thrown on the griddle sizzles, pour 1/4 cup batter onto the griddle for each pancake, leaving space in between for the pancakes to spread. If the batter is too thick to pour easily, stir in a few more tablespoons of milk. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>7.</b> When the pancakes become slightly dry around the edges, 2 to 3 minutes, flip them. Cook until brown on the second side, 1 to 2 additional minutes. Lower the heat if the pancakes are browning too quickly, leaving the inside raw or doughy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>8.</b> To keep the pancakes warm, place them in a single layer on a rack in the oven. To serve, set a piece of salmon on top of each pancake and top with a dollop of yogurt cheese. Serve immediately. </p>"}]}