{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081120-dt-frenchonion.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "French", "keywords": ["Dinner Tonight", "French", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: French Onion Soup with Star Anise", "link": "https://www.seriouseats.com/recipes/2008/11/dinner-tonight-french-onion-soup-with-star-anise-recipe.html", "description": "You could argue that messing with classic recipes like French Onion Soup shouldn't be done. Nevertheless, in a search to transform the recipe from the very authentic (hours of caramelization and real homemade beef broth) to the everyday, some things...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "French", "Soups and Stews"], "recipeIngredient": ["2 cups reduced-sodium chicken broth", "2 cups water", "2 whole star anise", "6 black peppercorns", "2 pounds red onions, cut into 1/2-inch wedges", "3 tablespoons olive oil", "1 tablespoon white flour", "1/2 cup dry red wine", "4 (1-inch-thick) slices of baguette", "6 ounces Manchego or Gruyère cheese, cut into thin slices or grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a medium heavy pot (such as a dutch oven) over medium-high heat and add the oil and onions.  Cover and cook for about ten minutes, stirring occasionally.  Once they are all soft and liquidy, uncover, turn the heat to high, and continue cooking until reduced to 1/4 their original size, an additional 15-20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring the broth, water, and spices to a boil.  Turn off the heat, cover, and let steep until needed, about 20-30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the onions are reduced and well-caramelized, add the flour and stir very well to eliminate any lumps. Cook for 1-2 minutes to cook out any raw floury flavor, then add the red wine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking until the red wine is syrupy and soaked into the onions. Add the broth through a strainer to remove the spices (or pick them out beforehand). Use a wooden spoon to scrape up any brown bits in the pot.  Bring to a boil and continue simmering until the flavors marry. Season with salt and pepper if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle soup into broiler-proof bowls, float baguette slices on top, and layer with cheese.  Broil until just lightly browned. (Alternatively, lay cheese on the baguette slices and broil on their own if no ovenproof bowls are available).</p>"}]}