{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080923pastazucchinieggyolk.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "pasta", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Pasta with Zucchini and Beaten Egg Yolk", "link": "https://www.seriouseats.com/recipes/2008/09/vegetarian-pasta-with-zucchini-and-beaten-egg-yolk-recipe.html", "description": "This pasta is a peaen to the power of flour, milk, egg yolk, and pasta water. With small quantities of these four ingredients, it's possible--and relatively quick and easy--to create a sauce of rich creaminess. On top of that, this...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Healthy and Delicious", "Mains", "Pasta", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 pound fresh zucchini, cut into 3-inch long matchsticks", "2 cups vegetable oil, for frying", "3 tablespoons butter", "1 teaspoon flour dissolved in 1/3 cup milk", "1 egg yolk, beaten gently with a fork", "1/2 cup Parmigianno-Reggiano", "1/4 cup pecorino", "2/3 cup torn fresh basil leaves or chopped parsley", "1 pound pasta, fusilli or other pasta that will capture the creamy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet or pan, fry the zucchini strips over medium-high heat in the vegetable oil (they should sizzle when dropped in), in batches if necessary to avoid crowding, until lightly browned, turning occassionally.  Dry on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salty water to boil.  Cook the pasta until al-dente, reserving some pasta water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, in a large (12-inch) skillet, melt 2 tablespoons of the butter over medium until it foams then subsides.  Turn the heat to medium-low and add the flour/milk mixture, whisking.  Cook for a minute or so, until it begins to thicken, then season with a pinch of salt.  Add the zucchini strips and cook for an additional minute, turning them to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skillet from the heat and quickly swirl in the last tablespoon of butter and the egg yolk.  Whisk constantly to avoid scrambling the egg.  Add the drained cooked pasta and toss, then add the cheese and basil or parsley and toss again.  Add pasta water little by little, stirring, until the pasta is moist and creamy.  Serve immediately.</p>"}]}