{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/sacklunch.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Nigel Slater", "noodles", "sack lunch", "soups", "spicy", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: A Luxurious and Deeply Aromatic Noodle Lunch", "link": "https://www.seriouseats.com/recipes/2008/03/sack-lunch-a-luxurious-and-deeply-aromatic-noodle-dish-recipe.html", "description": "Nigel Slater’s luxurious and deeply aromatic noodle dish has been on my poorly-maintained “to-make” list since Amazon delivered my copy of Appetite four years ago. It was the title that won me over, I must admit, though the pictures are...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["4 or 5 small, very hot red peppers", "2 or 3 small garlic cloves", "A small lump of ginger, about the size of a walnut in its shell", "2 or 3 plump lemon grass stems", "A few coriander seeds", "A small handful cilantro leaves, plus 2 or 3 of their roots if possible", "1 teaspoon ground turmeric", "A little vegetable oil", "2 cups stock, preferably chicken", "1 3/4 cups coconut milk", "Juice of 1 lime", "Just a little nam pla (Thai <a href=\"http://en.wikipedia.org/wiki/Fish_sauce\">fish sauce</a>)", "A small handful of mint leaves", "About 4 ounces noodles (I used udon but you could try different noodles)", "A small handful crabmeat per person (I skipped this)", "About 1/2 pound peeled large shrimp"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve and seed the hot peppers. Peel the garlic. Peel and shred the ginger. Finely slice the tender, innermost leaves of the lemon grass. Grind the coriander seeds or crush them in a mortar. Blitz it all with the cilantro and turmeric in a food processor until you have a thick green sludge. You may need a few spoons of vegetable oil to help it all go around, but use as little as you can.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put your soup pot over moderate heat, add half the sludgy green spice paste (you won’t use the other half in this recipe), and fry it, stirring, for a minute or so. Then pour in the stock and coconut milk and bring to a boil. Turn the heat down and simmer for 10 minutes. Meanwhile, cook the noodles briefly in boiling water and drain them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the crabmeat and shrimp into the soup. The shrimp only need a minute or two to cook. When they are done, season with lime juice, salt, a teaspoon or so of fish sauce, and the mint leaves, torn up if they are large.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the noodles among four large, deep bowls and ladle over the hot soup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day you can eat this cold or heated. Either way, add another squeeze of lime juice and some fresh mint leaves.</p>"}]}