{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Ellie Krieger", "Gorgonzola", "mushrooms", "panini", "sun-dried tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Portobello Panini with Gorgonzola and Sun-Dried Tomatoes", "link": "https://www.seriouseats.com/recipes/2008/01/cook-the-book-portobello-panini-gorgonzola-sun-dried-tomatoes-recipe.html", "description": "It's almost the New Year and this time, your resolution to eat healthier foods can be a lot easier to keep with Ellie Krieger's new cookbook, The Food You Crave: Luscious Recipes for a Healthy Life. The portobello panini with...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Healthy and Delicious", "Mushrooms"], "recipeIngredient": ["4 sun-dried tomatoes (not oil packed)", "Boiling water", "4 portobello mushrooms (2 ounces each)", "1/4 cup Gorgonzola cheese", "1 tablespoon plus 1 teaspoon olive oil", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reconstitute the sun-dried tomatoes by soaking them in boiling water for 10 minutes. Remove the toma­toes from the water, pat dry, and chop them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the stems off the mushrooms so they can lay completely flat. Slice each cap in half so you have 8 round mushroom slices. Top half of the mushrooms with 1 tablespoon of the chopped tomatoes and 1 tablespoon of the cheese. Top with the remaining mushroom slices. Brush the top side of each \"sandwich\" with some of the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a large nonstick skillet or grill pan over medium-high heat until good and hot. Place the mushroom sandwiches in the hot pan carefully, oiled side down, and cook for 2 minutes, Brush the top half with the remaining oil, flip with a spatula, and cook until the mushroom softens and begins to brown and the cheese is melted, about another 2 minutes. Season with salt and pepper and serve. </p>"}]}