{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["fall recipes", "holidays", "Lidia Bastianich", "thanksgiving", "Thanksgiving turkeys", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lidia Bastianich's Roast Turkey", "link": "https://www.seriouseats.com/recipes/2008/11/lidia-bastianichs-roast-turkey.html", "description": "...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Mains", "Turkey"], "recipeIngredient": ["1 fresh turkey, 12 to 14 pounds, including neck and giblets", "1-1/2 tablespoons kosher salt", "1/4 cup extra-virgin olive oil  ", "<strong>Vegetables and seasonings:</strong>", "1 pound carrots, peeled and cut into 2-inch chunks", "2 large onions, peeled and chopped into 1-inch pieces", "3/4 pound celery stalks with leaves, rinsed and cut in 2-inch chunks", "1 ounce dried porcini slices, crumbled into 1/2-inch pieces", "1 tablespoon whole black peppercorns", "6 short branches of fresh rosemary, with plenty of needles", "1/4 cup extra-virgin olive oil", "1 teaspoon kosher salt, if needed", "4 to 6 cups turkey or vegetable broth  ", "<strong>For glazing the turkey (optional):</strong>", "1/4 cup balsamic vinegar reduction, glaze consistency", "<h5>Recommended Equipment</h5>", "A heavy-duty roasting pan, at least 12 inches by 18-inches, preferably larger", "A flat wire roasting rack, big enough to hold the turkey but small enough to leave space for vegetables in the pan bottom", "Wide, heavy duty aluminum foil", "A saucepan, a medium mesh sieve and a potato masher, to make the sauce", "A kitchen brush, for painting the turkey with glaze "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepping the turkey and vegetables:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange a rack low in the oven, making sure that the fully prepared turkey will fit in easily and roast well below the oven ceiling. Remember that the foil tent will be an inch or 2 higher than the turkey itself. Preheat the oven to 375°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take out the giblets and neck from the turkey and save. Remove and discard any lumps of fat from the cavities. Rinse the bird inside and out, in cool running water, clearing the cavity of any residue. Rinse the giblets too. Pat everything dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the wire roasting rack in the pan and the turkey on the rack with the neck and giblets in the pan bottom. Sprinkle 2 teaspoons of the kosher salt inside the main turkey cavity and the rest of the salt (1-1/2 tablespoons in all) over the outside of the bird. Pour the olive oil on the turkey, a bit at a time, and spread it with your hands to coat the entire skin, including the back. Twist the tip joint of each wing down and forcefully fold it so it stays in place under the neck (think of placing both your hands behind your neck). Rest the oiled turkey on the rack, flat on its back, wings folded and breast up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a handful or 2 of mixed vegetables(and one of the rosemary branches) loosely into the cavity of the turkey. Spread all the rest in one layer in the pan bottom, all around the turkey. Push the vegetables pieces under the rack, if your pan is small, so they will cook in the stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Putting up the tent and roasting the turkey:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear two long sheets of aluminum foil. Cover one side of the pan with the first sheet, arching it well above the turkey. Crimp the foil against the rim of the pan so it stays in place without touching the bird. Cover the rest of the pan and turkey with the second sheet of foil (or more if needed), overlapping the sheets several inches. Press the bottom of the foil tightly against the sides of the pan, all around, sealing the tent completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully place the covered pan on the oven rack--it will be heavy so you may need some help. Push it well to the back of the oven for the maximum heat and let the turkey roast undisturbed for 2 hours. Open the oven, pull the roasting pan to the front, and lift off the foil sheets. The pan juices should be bubbling away and the steaming turkey will be mostly pale.) With a ladle or bulb baster, baste the turkey all over with the pan juices and return it to the oven. Save the foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the turkey uncovered for 30 minutes to an hour, to brown the skin and cook the meat to a safe internal temperature. (Because every oven thermostat is different and turkeys will vary in size, cooking times will vary.) After 30 minutes, baste again and check the internal temperature of the turkey, then continue roasting, if necessary until the meat is reaches the right temperature. If the breast is getting too dark, cover it loosely with a sheet of foil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Starting the sauce:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You should have 1 to 2 quarts of pan juices (depending on how much stock you started with and the roasting time). Set the saucepan over high heat, bring the juices to a boil and let them reduce, uncovered. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Glazing the turkey and final steps:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a glaze for turkey by mixing 1/4 cup of balsamic vinegar reduction and 2 tablespoons of the pan sauce, mixing well until it is spreadable: heat and thin it as needed. Put the turkey, still on the rack, back in the empty roasting pan. Brush the glaze all over the bird in a smooth even coat. Return the turkey to the oven for 10 to 15 minutes, or until the glazed skin is crisp, shiny and deeply colored. Let it rest in a warm place. tented with foil, if you wish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish the sauce: pour into the boiling sauce any turkey juices that accumulated in the baking sheet. When the sauce has reduced almost by half, taste it for salt and add a bit more if you like. Remove the turkey neck and giblets and bring back to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: for formal occasions, you can present the whole turkey and carve it at the table. For most family dinners, I cut the bird up in the kitchen as follows: cut the wings off, slice the breast meat, then remove the legs at the joint and slice the leg and thigh meat from the bones for dark meat lovers; arrange all the pieces on a serving platter. Pour any juices left in the pan or on the cutting board over the meat, then nap all the pieces with a cup or more of the finished sauce. Bring the platter to the table and let people serve themselves. Put the rest of the sauce in a bowl and pass it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>More holiday recipes from Lidia Bastianich</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/2008/05/lidia-bastianich-octopus-and-potato-salad-recipe.html\">Octopus and Potato Salad</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/2008/11/lidia-bastianichs-swiss-chard-crostata-recipe.html\">Swiss Chard Crostata</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/2008/11/lidia-bastianichs-broccoli-rabe-with-oil-and.html\">Broccoli Rabe with Oil and Garlic</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/2008/11/lidia-bastianichs-apple-strudel.html\">Apple Strudel</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/2008/11/lidia-bastianich-cranberry-quince-chutney-recipe.html\">Cranberry-Quince Chutney</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/2008/11/lidia-bastianich-squash-tiramisu-recipe.html\">Squash Tiramisù</a></p>"}]}