{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080806-corncupcakes-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["cakes", "corn", "cupcakes", "desserts", "frostings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Sweet Side of Corn: Sweet Corn Cupcakes with Brown Butter Frosting", "link": "https://www.seriouseats.com/recipes/2008/08/sweet-corn-cupcakes-with-brown-butter-frosting-recipe.html", "description": "I love corn. When it’s in season, I sneak fresh sweet corn into every meal that I can. Before it goes out of season, I cut a bunch off of the cob to keep in the freezer, and when that...", "totalTime": null, "recipeYield": "12 cupcakes", "recipeCategory": ["Corn", "Desserts"], "recipeIngredient": ["<strong>For the frosting:</strong>", "10 tablespoons unsalted butter, cut into chunks (140 grams)", "1 teaspoon molasses (8 grams)", "½ teaspoon vanilla extract", "1/8 teaspoon salt", "1 cup confectioners’ sugar (120 grams)", "<strong>For the cupcakes:</strong>", "¼ cup unsalted butter (56 grams)", "Reserved butter solids, leftover from browning the butter for the frosting", "¼ cup sugar (50 grams)", "¼ cup brown sugar (50 grams)", "1 large egg", "¼ cup plain low-fat yogurt (60 grams)", "3/4 cup corn kernels (120 grams)", "1 ¼ cup cake flour (150 grams)", "¼ teaspoon salt", "¼ teaspoon baking soda", "½ teaspoon baking powder", "½ cup corn kernels (80 grams)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the first quantity of butter in a heavy-bottomed sauce pan and heat over medium-high flame.  Swirl the pan occasionally to melt butter completely.  Place a fine mesh strainer inside a heat-proof bowl; keep within easy reach of the stovetop.  Continuing to heat, butter will foam and begin to brown around the edges.  Be careful to avoid hot butter splatters.  Scrape around the sides and bottom of the pan with a heat-proof spatula to prevent scorching and ensure even browning.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When butter solids (the sandy bits that accumulate in the bottom of the pan) have turned a uniform mahogany brown, remove pan from heat and immediately pour butter through nearby strainer, separating all but the finest bits of solid from the butter fat.  Set strainer lined with butter solids aside.  Place butter fat in the refrigerator to set while preparing cake batter.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F.  Line 12 standard cupcake tins with paper liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine second quantity of butter with the reserved butter solids and the brown and regular sugars.  Beat with an electric mixer until light and fluffy, scraping down the bowl occasionally.  Add egg and beat until light and homogeneous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender or food processor, pur&eacute;e yogurt with first quantity of corn until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, salt, baking soda and baking powder, and whisk to blend.  Add about 1/3 of the flour to the butter and egg mixture and mix to incorporate.  Mix in half of the corn pur&eacute;e.  Add half of the remaining flour and mix just to incorporate.  Add remaining corn pur&eacute;e.  Mix in remainder of flour and stir to incorporate.  Fold in the second quantity of corn kernels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the batter evenly among the cupcake papers.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cupcakes until set, 15 to 17 minutes.  Remove cupcakes from pan to cooling rack while preparing frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cooled brown butter with confectioners’ sugar and salt.  Beat with mixer until light and fluffy, scraping down occasionally.  Add molasses and vanilla, and mix to thoroughly incorporate. Frost cupcakes and store in an airtight container.</p>"}]}