{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fennel", "Second Helpings of Roast Chicken", "Simon Hopkinson", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fennel Soup with Parmesan Cream", "link": "https://www.seriouseats.com/recipes/2008/11/cook-the-book-fennel-soup-with-parmesan-cream.html", "description": "Simon Hopkinson, author of this week's Cook the Book selection, Second Helpings of Roast Chicken, doesn't understand the concept of garnishing cream soups. \"Why laboriously purée and sieve if you then put the lumpy bits back in?\" Croutons, however, he...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["1 large onion, peeled and chopped", "14-ounce fennel bulb, trimmed and chopped", "2 tablespoons olive oil", "2 tablespoons butter", "2 cloves garlic, peeled and chopped", "2 tablespoons Pernod (or Ricard, pastis, etc.)", "1/2 cup white wine", "2 cups plus 2 tablespoons light chicken stock (a dissolved cube will just do)", "Salt and white pepper", "2/3 cup whipping cream", "About 2 tablespoons freshly grated Parmesan", "Croutons, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pan, very gently stew the onion and fennel in the oil and butter until really soft, without coloring. (Note: this should take at least 20 minutes, and is an essential step for any properly flavored, creamed vegetable soup.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the garlic and stew for a further 5 minutes. Add the Pernod and light it with a match, shaking the pan a little until the flames subside. Pour in the wine and cook fast for a few minutes (simply to allow the harsher edges of the wine to dissipate quickly) then turn the heat down once more, add the stock with some seasoning, cover, and simmer quietly for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Purée in a blender for as long as you can bear it (a food processor is not as good here), before pushing the result through a fine sieve into a clean pan. Reheat but do not boil. Ladle into 4 heated deep soup bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently heat the cream in a small pan and whisk in the Parmesan until dissolved. Divide between the 4 soup bowls, spooning it over the surface of each serving. Hand a bowl of croutons at the table.</p>"}]}