{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fried chicken", "garlic", "Second Helpings of Roast Chicken", "Simon Hopkinson"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Southern-Style Fried Chicken Thighs with Garlic Cream", "link": "https://www.seriouseats.com/recipes/2008/11/cook-the-book-southern-style-fried-chicken-thighs-with-garlic-cream.html", "description": "Back in January our own Ed Levine, a self-professed \"roast chicken freak,\" brought you Simon Hopkinson's version of the classic Sunday supper dish, excerpted from his first cookbook, Roast Chicken and Other Stories. In Simon's newest book, Second Helpings...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Garlic"], "recipeIngredient": ["<strong>For the chicken:</strong>", "8 large chicken thighs, skinned", "Seasoned flour (celery salt, cayenne pepper, paprika, and white pepper)", "2 small eggs, beaten", "1/2 cup butter", "2/3 cup pure olive oil", "Lemon wedges", "<strong>For the garlic puree:</strong>", "3 plump heads of garlic, peeled", "Salt", "2 tablespoons extra-virgin olive oil", "1 large tub of crème fraîche", "A few shakes of Tabasco"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the thighs in the flour and shake off any excess. Coat thoroughly with the egg and lay on a cooling rack for a minute or so. Dip again in the flour and once more in the beaten egg. Return to the rack and finally dip into the flour. Set aside on the rack until ready to cook. This seemingly excessive dipping and flouring does, I assure you, provide a good crust, however messy it sounds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large, shallow pan, melt together the butter and olive oil on a medium heat until the fat starts to sizzle somewhat; drop a small piece of bread into it and if it sizzles nicely, then the temperature should be just about fine. Slide the chicken thighs into the fat and gently shallow-fry (the depth should not be more than 3/4-1 1/4 inches) for 15 to 20 minutes, turning halfway through, until golden brown and crusted all over. Remove from the pan and lay on a double fold of paper towel. Sprinkle with salt and serve without delay. (Note: you might like to strain the fat into a small bowl and keep in the fridge for further southern-frying excursions.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pur&eacute;e, simmer the garlic cloves in water with a little salt, until just tender. Drain. Pur&eacute;e in a food processor with the olive oil, but leave it a little bit coarse. Tip into a bowl and cool. Add the crème fraîche and beat with a whisk until thick. Add more salt if necessary and the Tabasco. Serve at room temperature, with the chicken and lemon wedges. </p>"}]}