{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080107-katzenbook.jpg", "author": {"@type": "Person", "name": "Jenn Sit"}, "recipeCuisine": "", "keywords": ["Cook the Book", "french fries", "kid-friendly", "Mollie Katzen", "Super Bowl sides", "sweet potatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Oven-'Fried' Sweet Potatoes", "link": "https://www.seriouseats.com/recipes/2008/01/mollie-katzen-oven-fried-sweet-potatoes-recipe.html", "description": "Last summer, I worked for the nonprofit Wellness in the Schools, where I helped to develop a nutrition program for NYC public schools. One of the dishes we promoted was sweet potato fries—a really great alternative to French fries, for...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Healthy and Delicious", "Sides", "Sweet Potatoes and Yams", "Vegetarian"], "recipeIngredient": ["3 tablespoons high-oleic safflower oil or extra-virgin olive oil", "2 pounds sweet potatoes ", "Salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Line 2 baking trays with foil and coat each with 1 1/2 tablespoons oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the sweet potatoes and use a very sharp knife to cut them first into thin slices (1/4 inch or less) and then into long batons at ¼-inch intervals. (These measures are all approximate of course.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the batons in single layers on the baking trays and place the trays in the oven. After 10 minutes, use togs to turn the sweet potatoes over and let them back another 5 to 10 minutes on the second side until fork tender. (Careful not to let them burn! This will depend on the thickness of the pieces, so you’ll need to watch them.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you like softer “fries,” take them out of the oven now. If you prefer a crisper result, turn the oven down to 200°F and leave the trays in there for up to 20 minutes. (This will give the sweet potatoes a chance to dry out a little and acquire some texture. They will shrink somewhat in volume.) Remove the trays from the oven, salt the sweet potatoes lightly, and serve hot, warm, or at room temperature.</p>"}]}