{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-lidiasitaly.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "Italian", "keywords": ["Cook the Book", "cookbooks", "Italian", "Lidia Bastianich", "Lidia's Italy", "seafood", "squid"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Manfredi's Steamed Calamari", "link": "https://www.seriouseats.com/recipes/2008/04/manfredis-steamed-calamari-recipe.html", "description": "Today's Cook the Book recipe, excerpted from Lidia's Italy, proves that Italian food doesn't have to be heavy. There are plenty of light, flavorful dishes that are just as satisfying as stick-to-your-ribs spaghetti and cheese-laden lasagna. Manfredi's Steamed Calamari is...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Healthy and Delicious", "Italian", "Mains", "Other Seafood"], "recipeIngredient": ["2 1/2 pounds medium-large calamari (uncleaned), or 2 pounds cleaned, uncut calamari", "1 lemon", "2 fresh bay leaves", "3/4 teaspoon coarse sea salt or kosher salt, or to taste", "5 tablespoons best-quality extra-virgin olive oil, or more if needed", "2 tablespoons freshly squeezed lemon juice (from lemon used above)", "1/4 teaspoon peperoncino flakes, or to taste", "1 teaspoon finely grated orange zest", "2 tablespoons chopped fresh Italian parsley "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the calamari one at a time, if necessary, by bulling the tentacles slowly until all the innards come out of the body. Cut off the tentacles below the eyes, and discard the rest of the head and the innards; pop out and discard the small hard beak where the tentacles join. Cut off the pointy tip of each body, and peel off the skin; discard both. Rinse the trimmed tentacles and the body, holding it open under running water to flush the cavity. Slice the cleaned body crosswise, in rings 1/3 inch thick. Drain all the tentacles and rings in the steamer basket colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shave off the lemon peel (zest layer only) with a vegetable peeler, in short strips. Squeeze the juice of the lemon and reserve. Drop the zest into the water with the bay leaves, cover the pot, and simmer the water for about 1/2 an hour, to infuse it with the aromas of lemon and bay.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keep the water simmering, and set the steamer basket with all the calamari in it inside the pot. Put on the cover, making sure it fits snugly inside, and steam the calamari gently. After 2 minutes, lift the cover, tumble the calamari over a couple of times in the colander, and sprinkle over it a couple of pinches of salt. Cover and steam another 2 minutes, tumble, and salt again. Repeat after 2 more minutes&mdash;you should have used 1/4 teaspoon salt in all. Steam for a total of 8 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the calamari is tender but slightly resilient to the bite, remove the colander, season the pieces with another 1/4 teaspoon salt, mix well, then let them drain and cool for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the calamari into a bowl while still quite warm. Toss with the olive oil and lemon juice, sprinkle over the remaining salt, the peperoncino, grated orange zest, and parsley, and toss well again. Taste, and adjust the seasonings. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or at room temperature.</p>"}]}