{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Emily Koh"}, "recipeCuisine": "", "keywords": ["baking", "brunch", "Melissa Murphy", "muffins", "The Sweet Melissa Baking Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Sweet Melissa Baking Book: Sweet Muffins", "link": "https://www.seriouseats.com/recipes/2008/03/the-sweet-melissa-baking-book-sweet-muffins.html", "description": "And the first of our Cook the Book recipes this week from The Sweet Melissa Baking Book is for sweet muffins. And with the variations here, you'll have at least three ways of making these treats, which are ideal for...", "totalTime": "", "recipeYield": "12 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 3/4 cups all-purpose flour", "1 tablespoon plus 1 teaspoon baking powder", "1/2 cup granulated sugar", "1/2 teaspoon kosher salt", "8 tablespoons (1 stick) unsalted butter, melted", "1/3 cup firmly packed light-brown sugar", "2 large eggs, at room temperature", "1/4 cup heavy cream, at room temperature", "1/2 cup whole milk, at room temperature (more or less depending on juiciness of fruit)", "Zest of 1 lemon", "1 cup fresh fruit, cut into 1/4-to-1/2 inch pieces", "1 tablespoon vanilla sugar* or granulated sugar, for sprinkling", "<strong>Before you start: </strong>Position a rack in the center of the oven. Preheat oven to 350ºF. Line a standard 12-cup muffin tin with muffin papers (or butter and flour the cups or spray with nonstick vegetable cooking spray)."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the flour, baking powder, granulated sugar, and salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the melted butter, brown sugar, and eggs until smooth–no lumps. Whisk in the heavy cream and milk until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the zest to the flour mixture and with your hands, gently rub the mixture together, releasing the oils and breaking up the bits. Add the fresh fruit and gently toss with your fingers to combine. Make a well in the center of the bowl. Pour the butter mixture into the center of the well and, using a rubber spatula, gently pull the flour mixture into the center of the well until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly among the prepared muffin cups, filling each cup until full. Bake for 30 to 35 minutes, or until lightly golden and a wooden skewer inserted into the center comes out clean. Remove to a wire rack and sprinkle with sugar. Let cool to warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variations</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fresh Peach Muffins:</strong> Add 1/2 teaspoon ground cinnamon to the flour  mixture. Decrease the milk by 2 tablespoons. Use 1 1/2 teaspoons freshly grated orange zest to rub into the flour mixture. Add 1 cup peeled diced fresh peaches to the dry mixture, and proceed with the batter. Fill the prepared muffin cups and sprinkle on cinnamon sugar, if desired. Bake as directed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Strawberry Muffins with Fresh Lemon and Rosemary:</strong> Decrease the milk by 2 tablespoons. Use 1 1/2 teaspoons freshly grated lemon zest and 3/4 teaspoon finely chopped fresh rosemary to rub into the flour mixture. Add 1 cup diced fresh strawberries to the dry mixture, and proceed with the batter. Fill the prepared muffin cups and sprinkle on vanilla sugar, if desired. Bake as directed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* To make vanilla sugar, combine the salt and scraped pod and seeds of 1 vanilla bean with 8 cups of sugar.  Rub them together with your hands.  Store in an airtight container.</p>"}]}