{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080124-hazan.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["cabbage", "chickpeas", "Essentials of Classic Italian Cooking", "Marcella Hazan", "potatoes", "salad", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Simple Dinners from Marcella Hazan", "link": "https://www.seriouseats.com/recipes/2008/02/classic-cookbooks-simple-dinners-from-marcell-1.html", "description": "Besides big roasts, slow braises, and stuffed pastas that are probably best for lazy-Sunday cooking, Essentials of Classic Italian Cooking has much to offer in the way of weeknight dinner (if you’re accustomed to spending about an hour making dinner,...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cabbage", "Classic Cookbooks", "Legumes", "Mains", "Potato", "Salads", "Sides", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["1 yellow bell pepper", "2 cups onion sliced very thin", "1/3 cup extra virgin olive oil [I think you could get away with less oil, maybe half this much]", "1 1/2 cups firm, ripe tomatoes, peeled and chopped, OR canned Italian plum tomatoes, cup up, with their juice", "Freshly ground black pepper", "1 1/2 pounds round, waxy boiling potatoes", "Salt", "1 Savoy cabbage, about 2 pounds", "A slice of crusty bread", "2 garlic cloves", "Salt", "Freshly ground black pepper", "Extra virgin olive oil", "Good red wine vinegar", "4 whole garlic cloves, peeled", "1/3 cup plus 1 tablespoon extra virgin olive oil", "1 1/2 teaspoons dried rosemary leaves, crushed fine almost to a powder, or a small sprig of fresh rosemary", "2/3 cup canned Italian plum tomatoes, cut up, with their juice", "3/4 cup dried chick peas, cooked, or 2 1/4 cups canned chick peas, drained", "4 (or more) cups meat broth, homemade or prepared using bouillon cubes", "1 cup rice, preferably Arborio"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the pepper in half, remove its seeds and membranes, and peel it with a vegetable peeler (less trouble than it sounds). Slice it lengthwise into 1/2-inch-wide strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Choose a sauté pan that can accommodate all the ingredients. Add the onions and olive oil to the pan and turn the heat to medium. Cook, stirring, until the onions wilt and turn light gold. Then add the yellow pepper and cook for 3 or 4 minutes, stirring occasionally, before adding the cut-up tomatoes with their juices. Adjust the heat so the mixture cooks at a slow but steady simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tomatoes cook, peel the potatoes, rinse them in cold water, and chop them into 1-inch cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil floats free of the tomatoes, add the potatoes, turn the heat down to very low, and cover the pan. Cook until the potatoes feel tender when prodded with a fork, about 30 minutes, depending on the potatoes. Turn the contents of the pan over from time to time as it cooks. Add several grindings of black pepper, taste for salt, and serve right away. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"cabbage\"></a><h4>Shredded Savoy Cabbage Salad</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- serves 6 -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull the green outer leaves from the cabbage and discard or save for soup. Shred the white leaves very fine and put them in a serving bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull the soft crumb from the bread and cut two pieces of crust, each about 1 inch long.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly mash the garlic cloves with a knife and remove their skin. Rub both pieces of bread crust vigorously with garlic. Discard the garlic, put the crusts in the bowl of cabbage, and toss thoroughly. Let stand 45 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, add salt, pepper, enough olive oil to coat well, and a dash of vinegar to the bowl. Toss the cabbage until evenly dressed. Discard the bread crusts. Taste, correct seasoning, and serve immediately. (My standards are less exacting than Hazan’s, and I think this tastes pretty good after it’s been sitting around for a while, too.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"soup\"></a><h4>Chick Pea Soup with Rice</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- serves 8…supposedly -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the garlic and 1/3 cup olive oil in a 2-quart pot. Turn the heat to medium and sauté the garlic cloves until they turn a light nut brown. Remove them from the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the dried or fresh rosemary and then add the tomatoes with their juice. Cook for 20-25 minutes, or until the oil floats free of the tomatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the drained chick peas and cook for 5 minutes, stirring to coat with pan juices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 cup of broth, cover, and adjust heat so the soup bubbles steadily but moderately for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste for salt. Add a few grindings of pepper. Let the soup bubble uncovered a minute more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Purée all but 1/4 cup of the soup, preferably by putting it through the larger disk of a food mill into a soup pot. Add the remaining 1/4 cup soup and the remaining 3 cups broth or bouillon and bring to a steady but moderate boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice, stir, cover the pot, and cook, allowing the soup to bubble steadily but moderately, until the rice is tender but still firm. Check after about 10-12 minutes to see if more liquid is needed. If the soup seems to be becoming too dense, add more homemade broth or water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rice is done, swirl in the remaining tablespoon olive oil and taste for salt. Let the soup settle for 2 or 3 minutes before serving.</p>"}]}