{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-winebarfood.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cathy Mantuano", "Cook the Book", "cookbooks", "lamb", "rice", "tapas", "Tony Mantuano", "wine", "Wine Bar Food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Rice Balls Stuffed with Lamb, Spinach, and Cheese", "link": "https://www.seriouseats.com/recipes/2008/05/rice-balls-stuffed-with-lamb-spinach-and-cheese-recipe.html", "description": "When I was 17, I spent the summer in Italy. After traveling through Rome, Florence, Milan, and Venice, I lived with a host family in Sicily for a month. I kept a journal while I was there, and wrote in...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 cups Arborio rice ", "Sea salt and freshly ground black pepper ", "2 tablespoons extra virgin olive oil ", "6 ounces ground lamb ", "1 garlic clove, minced ", "Large handful of fresh spinach, stems removed ", "5 large eggs ", "11/2 cups grated aged Pecorino Romano, plus more for serving ", "11/2 ounces mozzarella cheese, cut into 1/4·inch dice (2 tablespoons) ", "1 cup dried bread crumbs, preferably panko ", "1/2 cup all·purpose flour 1 quart canola oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the rice with 1 quart of water in a medium saucepan. Season lightly with salt and simmer over medium heat until all the water is absorbed, 10 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rice onto a cookie sheet and spread it out to cool. Heat the olive oil in a medium sauté pan over medium heat. Add the lamb and cook for 2 minutes. Add the garlic and continue cooking until the lamb is completely browned, about 5 minutes. Add the spinach and cook until wilted, a minute or two. Remove from the heat and set aside to cool. Season with salt and pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rice is cool, stir in 2 of the eggs and 1 cup of the grated pecorino cheese. Using your hands, shape the rice into balls about 2 inches in diameter. Use your finger to make a hole and fill it with a little of the ground lamb mixture and 2 or 3 cubes of the mozzarella. Press the rice up and over: the opening to close. Refrigerate for at least 30 minutes before breading. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the remaining 3 eggs with a pinch of salt in a shallow bowl. Put the bread crumbs and remaining 1/2 cup pecorino in another shallow bowl. Put the flour in a third bowl. Dip the rice balls in the flour, then in the beaten eggs, and then in the bread-crumb mixture. Shake off any excess. The rice balls can be cooked immediately or refrigerated overnight or frozen for up to 1 month. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fry, heat the canola oil in a deep-fryer or heavy-bottomed pot to 325°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of the rice balls to the hot oil and fry, turning as needed so they brown evenly, until golden brown, about 7 minutes. Remove from the hot oil and drain on paper towels. Wait for the oil to return to 325°F before repeating with the rest of the rice balls. When cool enough to handle, after about 3 minutes, transfer to a serving plate and serve immediately. </p>"}]}