{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081220SmokedSalmonFougasse.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["brunch", "fougasse", "holiday entertaining", "New Year's Day brunch", "smoked salmon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "New Year's Brunch: Fougasse with Scottish Smoked Salmon, Fried Capers, and Lemon Crème Fraîche", "link": "https://www.seriouseats.com/recipes/2008/12/new-years-brunch-fougasse-with-scottish-smoke.html", "description": "Editor's note: SE intern Kerry Saretsky is so considerate. Not only does she provide us all with some great New Year's Eve Champagne cocktails, she takes care of us for the morning after with some brunch recipes. As I said,...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["12 ounces of bought pizza dough, rolled out into a circle 12-inches in diameter", "1 tablespoon of olive oil", "Salt and pepper", "1/3 cup crème fraîche", "Zest of 1 lemon", "Juice of 1/2 lemon", "8 ounces paper-thin slices of Scottish smoked salmon", "Half a bunch of chives, snipped", "Lemon wedges for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425 degrees F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Paint the rolled out pizza dough with 1 tablespoon of olive oil.  Season lightly with salt and pepper.  Puncture the dough a few times all over with the point of a knife, and dump some blind-baking beans all over the pizza crust.  Bake for 15 minutes, until golden.  Remove the beans, and remove to a cooling rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the lemon crème fraîche by combining the crème fraîche with the lemon zest, lemon juice, and a touch of salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the capers by heating about 1 tablespoon of light olive oil in a small saucepan over medium high heat, and then add the capers.  First, drain the capers of their brine, and then pat dry with paper towels.  Add the capers to the oil, and fry for about 4 minutes, until they are crisp and golden.  Then remove to a paper towel to drain.  The capers will splatter when you add them to the oil, so stand back.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the crust is completely cooled, layer the sheets of salmon all over the crust, leaving a tiny border if you want.  Spoon dollops of the lemon crème fraîche sporadically over the crust, and then scatter the fried capers and snipped chives all over the top.  Cut into slices, and serve with lemon wedges.</p>"}]}