{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fish", "Rick Browne", "salmon", "The Best Barbecue on Earth", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Salmon with Scotch Whisky Sauce", "link": "https://www.seriouseats.com/recipes/2008/08/salmon-with-scotch-whisky-sauce-recipe.html", "description": "Scottish barbecue? Isn't the country more famous for oats, barley, and boiled potatoes? Scotland actually produces many of the best meats in the world, from Angus beef, to venison, lamb, and game birds such as pheasant and grouse. All of...", "totalTime": "", "recipeYield": "4 to 6 servings", "recipeCategory": ["Cook the Book", "Mains", "Salmon"], "recipeIngredient": ["4 (8-ounce) salmon fillets, preferably sockeye or king salmon", "2 tablespoons salt", "4 tablespoons brown sugar", "2 tablespoons grated orange zest", "1 teaspoon freshly ground black pepper", "3 egg yolks ", "1 tablespoon freshly squeezed lemon juice", "1/2 cup (1 stick) butter, cut into pieces", "3 tablespoons Scotch whisky", "3 tablespoons very hot tap water", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the salmon well, then pat dry. Combine the salt, sugar, zest, and pepper. Rub all over the salmon and refrigerate for about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a charcoal grill or a gas grill to 350ºF. Make sure the grill rack is clean and oil it thoroughly with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the sauce, combine the egg yolks and lemon juice, whisking to blend. Transfer to a heat-proof bowl set over a saucepan of hot (but not boiling) water over low heat. Whisk until the mixture begins to thicken. Gradually stir in the butter, a little at a time. If any lumps appear in the mixture, remove the bowl from the heat, add a teaspoon of cold water, then return to the heat. Continue cooking until the sauce is smooth and thick enough to coat the back of a spoon, about 8 to 10 minutes. Remove the bowl from the heat and add the whisky and water and whisk until just smooth. Keep the sauce warm while the salmon is cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the salmon with olive oil and transfer it to the prepared grill rack over direct heat. Grill until just cook through, about 2 to 3 minutes per side. Transfer the fillets to serving plates and serve with the whisky sauce on the side.</p>"}]}