{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/BarleyRisotto12292008.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["barley", "healthy and delicious", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Healthy &amp; Delicious: Barley Risotto", "link": "https://www.seriouseats.com/recipes/2008/12/healthy-delicious-barley-risotto-recipe.html", "description": "Editor's note: On Mondays, Kristen Swensson of Cheap, Healthy, Good swings by these parts to share healthy and delicious recipes with us. Beyond the cookies, the caroling, the gold, the frankincense, and the myrrh, the nicest thing about Christmas is...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Healthy and Delicious", "Other Grains"], "recipeIngredient": ["4 cups low-sodium chicken broth", "4 cups water", "1 medium onion, chopped fine", "1 medium carrot, peeled and chopped fine", "1 teaspoon olive oil", "Salt", "1 1/2 cups pearl barley, rinsed", "1 cup dry white wine", "1 teaspoon minced fresh thyme leaves", "2 ounces grated Parmesan cheese (about 1 cup)", "1 tablespoon unsalted butter", "Ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the broth and water to a simmer in a medium saucepan; reduce the heat to the lowest possible setting and cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the onion, carrot, oil, and 1/2 teaspoon salt in a large saucepan. Cover and cook over medium-low heat, stirring occasionally, until the vegetables are softened, 8 to 10 minutes. Increase the heat to medium, add the barley, and cook, stirring frequently, until lightly browned and aromatic, about 4 minutes. Stir in the wine and continue to cook, stirring frequently, until the wine has been completely absorbed by the barley, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the thyme and 3 cups of the warm broth and simmer, stirring occasionally, until the liquid is absorbed and the bottom of the pan is dry, 20 to 22 minutes. Stir in 2 more cups of the warm broth and continue to simmer, stirring occasionally, until the liquid is absorbed and the bottom of the pan is dry, 15 to 20 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to cook the risotto, stirring frequently and adding 1/2 cup of the remaining broth at a time as needed to keep the pan bottom from becoming dry (about every 5 to 6 minutes), until the grains of barley are cooked through but still somewhat firm in the center, about 25 minutes. Off the heat, stir in the Parmesan and butter, and season with salt and pepper to taste. Serve immediately in warmed shallow bowls, with wedges of lemon and/or fresh parsley.</p>"}]}