{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "mains", "pastas", "Top Chef"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Truffle and Cognac Cream Macaroni and Cheese", "link": "https://www.seriouseats.com/recipes/2008/05/truffle-and-cognac-cream-macaroni-and-cheese-recipe.html", "description": "Manhattan's très chic West Village restaurant, The Waverly Inn, has a $55 version of macaroni and cheese on the menu made with shaved fresh truffles. Much has been blogged about the tremendous price, but everyone seems to be in agreement...", "totalTime": null, "recipeYield": "4 to 6 servings", "recipeCategory": ["Cheese", "Cook the Book", "Mains", "Pasta"], "recipeIngredient": ["Unsalted butter for the baking dishes", "1 cup of cognac", "1 tablespoon extra-virgin olive oil", "1 small shallot, minced", "6 roasted garlic cloves, minced", "1 tablespoon sherry", "6 ounces Perigord black truffles: 3 ounces finely chopped, 1 1/2 ounces thinly sliced with a truffle slicer, mandoline, or very sharp knife, and 1 1/2 ounces finely grated", "4 cups heavy cream", "2 teaspoons minced fresh oregano", "2 teaspoons fresh thyme leaves", "6 ounces Parmesan cheese, finely grated (about 2 cups), plus more for sprinkling", "2 teaspoons chipotle Tabasco sauce", "Salt and freshly ground pepper", "1 pound fresh penne or other pasta, cooked al dente", "8 ounces fontina cheese, finely grated (about 2 1/2 cups)", "2 cups seasoned sourdough croutons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously butter the bottom and sides of 4 to 6 medium baking dishes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cognac in a small saucepan or skillet over medium heat. Bring to a simmer and cook until reduced by half, 10 to 15 minutes. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, heat the oil over medium heat. Add the shallot and garlic and cook until the vegetables are softened but not browned, about 3 minutes. Add the sherry and stir until evaporated. Add the chopped truffles, cream, reduced cognac, oregano and thyme.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a simmer, reduce the heat to medium-low, and cook, stirring occasionally, until the mixture is reduced by half and the truffle flavor is infused, about 20 minutes. Watch the pot carefully so the cream doesn’t boil over. Add the Parmesan cheese, Tabasco, and salt and pepper to taste. Add the cooked pasta and fontina cheese and stir until the cheeses are melted. Taste and adjust the seasoning if necessary. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the croutons in a food processor and process until broken down into crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange a layer of truffle slices on the bottom of each baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta among the baking dishes and top with the crouton crumbs, grated truffles, and a sprinkling on Parmesan cheese. Bake for about 20 minutes, or until bubbly and browned on top.</p>"}]}