{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["pork", "roast pork", "sunday suppers", "Tom Douglas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Slow-Roasted Pork with Caraway Onion Gravy", "link": "https://www.seriouseats.com/recipes/2008/03/sunday-supper-slowroasted-pork-with-caraway-o.html", "description": "Each Saturday evening we bring you a Sunday Supper recipe. Why on Saturday? So you have time to shop and prepare for tomorrow. I'm on a pork kick with Sunday Supper lately. This is one I've made for a small...", "totalTime": null, "recipeYield": "6 to 8 people", "recipeCategory": ["Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["One 6- to 7-pound bone-in pork loin rib roast, cut from the blade end, chine bone removed and reserved", "Kosher salt and freshly ground black pepper ", "2 tablespoons caraway seeds ", "1 tablespoon bacon fat ", "1 medium onion, peeled, cut in half, and julienned", "5 garlic cloves, peeled ", "3 tablespoons tomato paste ", "5 cups chicken stock, hot", "1 tablespoon \"quick mixing\" flour, such as Wondra"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F. Season the pork generously with salt and pepper;  sprinkle with the caraway seeds. Melt the bacon fat over medium-high heat in a roasting pan placed over 2 burners. Add the pork and the chine bone; brown on all sides, about 10 minutes. Remove the pan from the heat. Place the onion in the pan; arrange the pork roast, bony side up, on top of the onion. Leave the chine bone in the pan; place the pan in oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 2 1/2 hours of roasting, stick an instant-read thermometer into the meat; it should read about 165°F. If the temperature is lower than that, keep roasting until thermometer does read 165°F. At that point, remove pan from oven. Transfer pork to a platter; set it in a warm spot, and cover it loosely with foil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pork to a cutting board; cut into portions between bones. Pile cut pork on a platter; pour a quarter of the gravy over it. Pour the rest of the gravy into a sauce boat, and use it for whatever gravy-friendly side you wish.</p>"}]}