{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-leebros.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Lee Bros.", "pork", "Serious Eats Essentials", "taco", "tacos", "The Lee Bros. Southern Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Pork Tacos at Home", "link": "https://www.seriouseats.com/recipes/2008/02/essentials-pork-tacos-at-home-recipe.html", "description": "I’m a little nervous about putting this recipe before this crowd, which probably includes more people with dearly-held opinions about barbecue and tacos than I could find anywhere else. Me, I like pulled pork, but I’m from Texas, so that’s...", "totalTime": "", "recipeYield": "8-12", "recipeCategory": ["Mains", "Pork", "Serious Eats Essentials"], "recipeIngredient": ["One 28-ounce can whole tomatoes, lightly crushed, with their juices", "2 teaspoons Spanish smoked paprika (pimentón) or 2 chipotles in adobo, plus more to taste [I use 3 or 4 chipotles]", "2 tablespoons sorghum molasses, cane syrup, or honey, plus more to taste [I use honey]", "1/2 cup white wine vinegar, champagne vinegar, or cider vinegar, plus more to taste", "One 6-8 pound pork picnic shoulder (or Boston butt, if you prefer)", "2 teaspoons kosher salt, plus more to taste", "1 teaspoon freshly ground black pepper, plus more to taste", "1 1/2 tablespoons canola oil", "4 large plum tomatoes, cored", "1 medium yellow onion, trimmed, peeled, and quartered", "1 small bunch cilantro", "1 red onion", "24-36 flour tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large enameled cast-iron stockpot or Dutch oven, bring the canned tomatoes, paprika, sorghum molasses, and 6 tablespoons vinegar to simmer over medium heat. (The authors recommend a 6-quart pot, but in my experience that is not large enough to hold these ingredients plus, later, the pork. I use a 9 1/2-quart Dutch oven, which is a little roomy but works fine. I suspect 7 1/2 quarts would be perfect.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pork skin side up on your work surface. Use a sharp knife to slice the skin from the shoulder with a gentle sawing motion, working back from the point diagonally across from the leg end where the skin forms a corner (you can ask your butcher to do this to save yourself time). Leave a thin layer of fat on the shoulder. Season the pork with the salt and black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a 12-inch skillet or sauté pan and heat over a high flame. When the oil shimmers and just begins to smoke, put the pork in the pan, skinned side down, and sear until golden brown all over, about 3 minutes per side. Lower the pork, skinned side down, into the pot with the tomato braising liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the plum tomatoes and onion to the skillet and cook, turning every few minutes, until the tomato skins blister and blacken and the onion is caramelized on all sides. Tuck the vegetables around the pork in the pot. Add the remaining 2 tablespoons vinegar to the skillet and stir with a wooden spoon, scraping up any caramelized pork, tomato, and onion bits from the bottom. Pour over the pork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pot, transfer to the oven, and cook for 30 minutes. Baste the pork, then turn the heat down to 300&deg;F and continue to cook, basting every 30 minutes, until the pork is tender, about 2 1/2 hours. For pork so tender it falls from the bone—the kind suitable for barbecue sandwiches or tacos—cook 1 hour longer for a total of 3 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the oven and the pork from the pot. Let the pork cook on a cutting board. Season the sauce in the pot with molasses, vinegar, salt, pepper, and smoked paprika to taste (it usually tastes pretty good to me without further seasoning).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pork is cool enough to handle, pull it into shreds. I’m not going to lie to you—this is pretty gross, because the muscles in the shoulder are very articulated and, well, muscle-y. But you can’t run from the fact that you’re eating an animal here, so fortify yourself with a beer and get to it. Refrigerate the pulled pork overnight in a container with the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the time comes to serve the tacos, reheat the pork gently in its sauce on top of the stove. Chop the cilantro and slice the onion very thin. Warm the flour tortillas (I do this in a skillet, individually, but this gets really tiresome with so many tortillas—any great ideas out there about how to warm a bunch of tortillas at once and still have them taste and feel good?) Let your guests build their own tacos, adding as much cilantro and onion as they like. The Lee brothers recommend using 1/4 cup pork and sauce per taco.</p>"}]}