{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20081002-bluecheesecheesecake-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["bleu cheese", "cheese", "cheesecake", "dessert", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dessert or Cheese Plate? Blue Cheese Cheesecake Does Both", "link": "https://www.seriouseats.com/recipes/2008/10/blue-bleu-cheesecake-recipe-dessert.html", "description": "Despite my better intentions at the beginning of a meal, it’s fairly rare that I actually have the cargo capacity for both a cheese plate <em>and</em> a dessert. I end up in an unhappy position of indecision. With this concern in mind, I began toying with dishes that could double as a dessert and composed cheese plate.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cheese", "Desserts"], "recipeIngredient": ["2/3 cup whole milk (150g)", "2 tsp agar powder", "1-1/2# cream cheese (2.5 8-ounce blocks or 672g)", "½ cup sugar (105g)", "¼ cup water (56g)", "4 large eggs whites (~125g)", "Pinch of salt", "7 ounces quality blue cheese, small dice (196g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe the inside of an 8X8-inch square cake pan with a moist paper towel.  Gently ease a sheet of plastic wrap into the pan, taking care to press the plastic all the way into all of the corners and smooth any wrinkles with a dry cloth or paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place milk in a small saucepan.  Sprinkle agar over the surface of the milk and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cream cheese in a heat-proof mixing bowl set over a pot of simmering water.  Stir occasionally as you measure the remaining ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cheese is completely smooth and melted, remove the bowl from the heat and place sauce pan of milk and agar over medium heat.  Stirring occasionally, bring the mixture to a full boil to fully dissolve the agar (mixture will become very thick at the boil, so be sure to stir well at this point to keep from scorching).  Immediately blend agar mixture into warm, softened cream cheese and set mixture aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar and water in a small sauce pan and place over medium-high heat.  Meanwhile, place egg whites and salt in the bowl of a stand mixer fitted with the whisk attachment.  Whip whites on medium speed as the sugar syrup cooks.  When sugar syrup reaches the soft ball stage (235-245F), turn the mixer speed up to medium-high (whites should be white, with a dense foamy texture) and carefully pour the hot syrup down the inside of the mixer bowl, into the whipping whites.  Once all of the syrup has been added, reduce the mixer speed slightly, and continue to whip the meringue until firm peaks form and the outside of the mixing bowl is just warm to the touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly and gently (the agar begins to set quickly once the batter has been lightened by the meringue), pour about ¼ of the cream cheese mixture into the meringue and loosely fold together (mixture does not have to be homogenous, just swirled and fairly evenly distributed).  Loosely fold about half of this meringue mixture into the cream cheese mixture.  Then add the remainder of the meringue mixture, along with the diced blue cheese, and fold all together, until the mixture is fairly homogenous and the cheese pieces are well distributed.  Immediately turn this mixture into the prepared cake pan, pushing gently into all of the corners and smooth the surface with an offset spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the pan loosely in plastic wrap and refrigerate until set.  Cut with a knife dipped in hot water.  Cake will keep wrapped in the refrigerator for 3 or 4 days.</p>"}]}