{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/tagliatelleFeatured.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["artichokes", "Gina DePalma", "Italian", "leeks", "lemon", "pasta", "Snapshots from Italy", "tagliatelle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snapshots from Italy: Tagliatelle with Artichokes, Leeks, and Lemon", "link": "https://www.seriouseats.com/recipes/2008/03/tagliatelle-with-artichokes-leeks-and-lemon-pasta-recipe.html", "description": "Spring vegetables arrive shockingly early in Rome to the eyes of this American. As the availability of puntarelle has waned, artichokes have burst onto the scene as the first harbingers of <em>primavera</em>.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Healthy and Delicious", "Italian", "Lemon", "Mains", "Pasta", "Vegetarian"], "recipeIngredient": ["2 medium lemons", "4 fresh artichokes", "1 medium leek", "Extra-virgin olive oil", "Several pinches of kosher salt to taste", "Several peperoncini, or crushed red pepper flakes to taste", "12 ounces fresh tagliatelle or fettucine", "Pecorino Romano for grating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with 1 quart cold water; squeeze the juice from one of the lemons into the bowl, and toss the two lemon halves in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a sharp knife, trim the artichokes down to the heart and tender leaves, and cut the center into eighths; add them to the bowl of water. Peel about 2 inches of the artichoke stems, slice them lengthwise, and add them to the bowl. Thinly slice the leek, rinsing it well to wash away any sand and dirt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat about 1/2 cup of extra-virgin olive oil in a large, deep sauté pan; add the drained, sliced artichoke hearts and stems, keeping them moving in the pan and adjusting the heat to prevent them from browning. After a few minutes, add the sliced leek, and season everything with a pinch of salt. Continue to sauté the vegetables over medium heat until the leeks are soft and almost translucent, then add the lemon zest and juice, a few crumbled peperoncini or crushed red pepper flakes to taste, and 2 or 3 tablespoons of the hot pasta water. Cover the sauté pan, and steam the artichokes tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the pot of pasta water to a rolling boil. When the artichokes are tender and the leeks are translucent, add the fresh pasta to the boiling water, and cook until it is al dente, which should take 1 to 2 minutes, depending on the thickness. When the pasta is cooked, add it to the simmering pan of artichokes with a splash of the pasta water and a few more tablespoons of olive oil. Toss everything over the heat for 30 seconds to bind the sauce with the pasta before plating. Serve with a grating of Pecorino Romano.</p>"}]}