{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20081119-turkey.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cook's Illustrated", "fall recipes", "gravy", "holidays", "roasting", "thanksgiving", "Thanksgiving turkeys", "turkeys"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook's Illustrated's Slow-Roasted Turkey with Gravy", "link": "https://www.seriouseats.com/recipes/2008/11/cooks-illustrated-slow-roasted-turkey-with-gravy-recipe.html", "description": "Note: Instead of drumsticks and thighs, you may use 2 whole leg quarters, 1 1/2 to 2 pounds each. The recipe will also work with turkey breast alone; in step 2, reduce the butter to 1 1/2 tablespoons, the salt...", "totalTime": null, "recipeYield": "10 to 12", "recipeCategory": ["Chicken"], "recipeIngredient": ["<strong>Turkey Ingredients</strong>", "3 medium onions, chopped medium", "3 medium celery ribs, chopped medium", "2 medium carrots, peeled and chopped medium", "5 sprigs fresh thyme", "5 medium garlic cloves, peeled and halved", "1 cup low-sodium chicken broth", "1 whole bone-in, skin-on turkey breast (5 to 7 pounds), trimmed of excess fat and patted dry with paper towels (see note)", "4 pounds turkey drumsticks and thighs, trimmed of excess fat and patted dry with  paper towels (see note)", "3 tablespoons unsalted butter, melted", "1 tablespoon table salt", "2 teaspoons ground black pepper", "<strong>Gravy Ingredients</strong>", "2 cups low-sodium chicken broth", "3 tablespoons unsalted butter", "3 tablespoons unbleached all-purpose flour", "2 bay leaves", "Table salt and ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the turkey: Adjust oven rack to lower-middle position and heat oven to 275°F. Arrange onions, celery, carrots, thyme, and garlic in even layer on rimmed baking sheet. Pour broth into baking sheet. Place wire rack on top of vegetables (rack will rest on vegetables, not on bottom of baking sheet).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush turkey pieces on all sides with melted butter. Sprinkle salt and pepper evenly over turkey. Place breast skin-side down and drumsticks and thighs skin-side up on rack on vegetable-filled baking sheet, leaving at least 1/4 inch between pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast turkey pieces 1 hour. Using wads of paper towels, turn turkey breast skin-side up. Continue roasting until instant-read thermometer registers 160°F when inserted in thickest part of breast and 170 to 175°F in thickest part of thighs, one to two hours longer. Remove baking sheet from oven and transfer rack with turkey to second baking sheet. Allow pieces to rest at least 30 minutes or up to 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the gravy: Strain vegetables and liquid from baking sheet through colander set in large bowl. Press solids with back of spatula to extract as much liquid as possible. Discard vegetables. Transfer liquid in bowl to 4-cup liquid measuring cup. Add chicken broth to measuring cup (you should have about 3 cups liquid).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium saucepan, heat butter over medium-high heat; when foaming subsides, add flour and cook, stirring constantly, until flour is dark golden brown and fragrant, about five minutes. Whisk in broth mixture and bay leaves and gradually bring to boil. Reduce heat to medium-low and simmer, stirring occasionally, until gravy is thick and reduced to 2 cups, 15 to 20 minutes. Discard bay leaves. Remove gravy from heat and adjust seasonings with salt and pepper. Keep gravy warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Heat oven to 500°F. Place baking sheet with turkey in oven. Roast until skin is golden brown and crisp, about 15 minutes. Remove baking sheet from oven, transfer turkey to cutting board, and let rest 20 minutes. Carve and serve, passing warm gravy separately.</p>"}]}