{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "bananas", "brunch", "chocolate", "Chocolate Holidays", "crepes", "desserts", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Banana Blintzes", "link": "https://www.seriouseats.com/recipes/2008/02/chocolate-banana-blintzes.html", "description": "The following recipe is from the February 6th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Although I love ordering blintzes at restaurants, I've never thought of making them until I read...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Banana"], "recipeIngredient": ["<strong>Crepes</strong>", "3 eggs", "1 cup all-purpose flour", "1/8 teaspoon salt", "1 3/4 cups milk", "2 tablespoons melted butter", "Butter or oil, for frying", "<strong>Sauce</strong>", "7 ounces bittersweet or semisweet chocolate, chopped into small pieces", "1/2 cup milk, plus extra if needed", "2 teaspoons sugar", "1/2 teaspoon vanilla extract", "3 large ripe bananas", "Butter, for frying", "Sour cream, for serving (optional)", "<strong>Equipment</strong>", "6-inch frying pan", "Tray, lined with wax paper", "Chocolate note: You can use any domestic bittersweet or semisweet chocolate without a percentage on the label, or any boutique or imported brand labeled 50 to 60 percent. Higher-percentage chocolates will require extra milk to make the sauce smooth and fl"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make crepes, combine eggs, flour, salt, milk, and melted butter in a blender or food processor. Pulse just until blended. Chill for 1 hour or up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a 6-inch frying pan over medium-high heat. Brush it lightly with butter. Pour in 2 tablespoons of batter and tilt the pan immediately to coat the surface evenly. When the crepe is uniformly translucent and the surface no longer looks wet, 45 seconds to 1 minute, loosen the edges with a spatula and invert the pan over a piece of wax paper. Repeat with the remaining batter, buttering the pan when necessary. Use the crepes immediately, or stack between sheets of wax paper, cover airtight, and refrigerate up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, mix chocolate, milk, sugar, end vanilla in the top of a double boiler over barely simmering water, Or microwave on Medium (50 percent) power, about 2 minutes. Stir frequently until smooth, adding milk as necessary. Use the warm sauce immediately or set aside and use cool. The sauce keeps several days in the refrigerator. Rewarm gently before use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the blintzes, slice the bananas 1/4 inch thick. Place 3 slices in a row, horizontally, in the middle of a crepe. Spread 1 tablespoon of sauce over them. Fold 2 sides of the crepe, then the top, over the bananas. Fold the bottom up to overlap. Place on a tray. Cover with plastic wrap and refrigerate at least 1 hour or up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, heat a large frying pan over medium-high heat. When the pan is hot, add 1 tablespoon of butter and swirl to coat the pan. Cook as many blintzes as will fit comfortably until just browned, about 30 seconds, on each side. Serve plain or with sour cream, if desired. </p>"}]}