{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["desserts", "floating island", "Serious Eats Essentials"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Floating Island", "link": "https://www.seriouseats.com/recipes/2008/05/floating-island-recipe.html", "description": "For the last year or two I’ve been obsessed with the idea of floating island even though I had never tasted it. It’s an old-fashioned dessert that sounded to me like pure delight: chunks of caramel-drizzled meringue in a puddle...", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Desserts", "Serious Eats Essentials"], "recipeIngredient": ["2 1/2 cups sugar, divided", "1 1/2 teaspoons pure vanilla extract, divided", "1 1/2 cups (5 ounces) sliced almonds", "8 extra-large egg whites, at room temperature", "1/8 teaspoon kosher salt", "1/4 teaspoon cream of tartar", "Crème Anglaise (recipe below)", "4 extra-large egg yolks", "1/2 cup sugar", "1 teaspoon cornstarch", "1 3/4 cups scalded milk", "1 teaspoon pure vanilla extract", "1 1/2 teaspoons Cognac (I skipped this; don’t like boozy desserts)", "Seeds of 1/2 vanilla bean (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the caramel, heat 1 1/2 cups of the sugar and 1/2 cup water in a small, heavy-bottomed sauce pan until the sugar dissolves. Cook over medium heat until the syrup turns a warm caramel color. Don’t stir, just swirl it in the pan. Off the heat, add 1/2 cup water and 1/2 teaspoon of the vanilla; be careful, for the syrup will bubble violently (I like to put the pot in the sink and pour the liquid in from above). Stir and cook over high heat until the caramel reaches 230 degrees (thread stage) on a candy thermometer. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the praline, combine the almonds with 1/4 cup of the caramel and spread them on a sheet pan lined with parchment paper. Bake for 10 to 12 minutes, until the almonds are lightly browned. Allow to cool at room temperature and then break up into pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the oven to 250°F. Line 2 sheet pans with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the meringues, beat the egg whites, salt, and cream of tartar in the bowl of an electric mixer fitted with the whisk attachment on medium speed until frothy. Turn the mixer on high speed and add the remaining 1 cup of sugar. Beat until the egg whites are very stiff and glossy. Whisk in the remaining teaspoon of vanilla. Place large mounds of meringue on the parchment paper with soup spoons and bake for 20 minutes, or until a cake tester comes out clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For serving, pour crème anglaise on the bottom of individual plates. Place a meringue or two on top of each serving, drizzle with caramel sauce, sprinkle with praline, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make a day or two ahead, leave the caramel and praline at room temperature and refrigerate the crème anglaise. Bake the meringues before guests arrive and assemble the desserts just before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Crème Anglaise</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 2 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Adapted from </em>Barefoot in Paris</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg yolks and sugar in the bowl of an electric mixer fitted with the paddle attachment on medium-high speed for 3 minutes, or until very thick. Reduce to low speed and then add the cornstarch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer still on low, slowly pour the hot milk into the eggs. Pour the custard mixture into a saucepan and cook over low heat, stirring constantly with a wooden spoon, until thickened. The custard will coat the spoon like heavy cream. Don’t cook it above 180 degrees or the eggs will scramble.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sauce through a fine strainer, add the vanilla extract, Cognac, and vanilla seeds, if using, and chill.</p>"}]}