{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080808-charredonion-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["grilling", "onions", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Charred Onion Salad with Prosciutto and Parmigiano", "link": "https://www.seriouseats.com/recipes/2008/08/grilling-charred-onion-salad-with-prosciutto-and-parmigiano-recipe.html", "description": "Truth be told, I'm not a huge salad eater&mdash;I usually glance over them at restaurants and opt for heartier sides at home. But when a salad calls for me to grill, I'm all over it. Flipping through the pages of...", "totalTime": "", "recipeYield": "4-6", "recipeCategory": [], "recipeIngredient": ["4 large sweet onions", "2 2-inch slices of country bread", "2 cloves of garlic, cut in half", "2 tablespoons balsamic vinegar", "1/2 cup chopped fresh Italian parsley", "4 pieces of prosciutto, cut into strips", "8 parmesan cheese curls or more to taste", "Olive Oil", "Kosher Salt", "Freshly Ground Black Pepper", "Wood skewers, soaked in water for 30 minutes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the charcoal is lighting, slice each onion into rings 1 inch thick, discarding the end pieces and papery outer ring from each onion.  Spear them straight through the center with wooden skewers, they will look like lollipops.  Brush each onion ring with olive oil and season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the bread slices lightly with olive oil and sprinkle with salt.  Grill each slice of bread until browned on each side, 1-2 minutes per side.  Remove bread from the grill and rub both sides with the cut pieces of garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the skewered onion rings on the grill and cook until charred and tender, about 10 minutes per side.  Remove from the grill and allow to cool for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove onion rings from skewers and place the rings in a medium bowl.  Toss the onions with 2 tablespoons of olive oil and the balsamic vinegar, season with salt and pepper to taste.  Cut bread into 1 inch cubes and toss in with the onions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To build the salad, place a serving of the onion rings and bread on each plate, top with chopped parsley, prosciutto slices, and parmesan curls, then season with freshly ground black pepper and serve.</p>"}]}