{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Eat Me: The Food and Philosophy of Kenny Shopsin", "fall recipes", "pancakes", "peanut butter", "Shopsin's"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Slutty Cakes", "link": "https://www.seriouseats.com/recipes/2008/09/kenny-shopsins-slutty-cakes-pancake-recipe.html", "description": "I was going to save this recipe for later in the week. Slutty Cakes, along with Ho Cakes, are one of the most famous dishes on the Shopsin's menu (PDF). But then I thought, why not start out with a...", "totalTime": "", "recipeYield": "12 three-inch pancakes", "recipeCategory": ["Cook the Book", "Nuts", "Pancake", "Pumpkin"], "recipeIngredient": ["2 heaping tablespoons peanut butter", "2 heaping tablespoons canned pumpkin puree", "A big pinch of Mara Spice (recipe follows), or pumpkin pie spice", "Peanut oil for the griddle", "Butter for the griddle and for serving", "3 cups pancake batter (such as Aunt Jemima frozen batter, thawed, or scratch batter)", "Warm grade B maple syrup for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the peanut butter, pumpkin purée, and Mara Spice (see below) in a medium bowl. Prepare the griddle. (Make sure the griddle is clean. Heat until a drop of water bounces off the surface. Float a layer of peanut oil over the griddle. Just before you drop the batter, add a generous pat of cold butter.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the batter into the griddle, according to the instructions on the package or in the recipe you are following. When small bubbles appear over 40 to 50 percent of the surface of the pancakes, about 2 minutes, drop a small spoonful of the peanut butter-pumpkin mixture in the center of each cake. Turn and cook the other side about 2 more minutes, until golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve B-side up with butter and warm maple syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Mara Spice</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1 tablespoon ground cinnamon, 1 heaping teaspoon ground cloves, 1 teaspoon ground nutmeg, 1 teaspoon ground ginger, and a pinch of allspice.</p>"}]}