{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080723-bruschetta-blackrasp.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Black Raspberry and Nectarine Bruschetta Dolce", "link": "https://www.seriouseats.com/recipes/2008/06/black-raspberry-and-nectarine-bruschetta.html", "description": "Anybody who has eaten in a contemporary Italian restaurant is likely to be familiar with the tasty simplicity that is bruschetta. It's little more than toasted slices of bread topped with flavorful combinations of whatever beans, vegetables, herbs, and cheeses...", "totalTime": "", "recipeYield": "makes 24 bruschette", "recipeCategory": [], "recipeIngredient": ["3/4 cup whole milk ricotta", "Pinch kosher salt", "4 teaspoons honey", "1 teaspoon freshly squeezed lime juice", "1 teaspoon fresh thyme leaves", "1 large ripe nectarine, diced with skin on", "1/2 cup whole black raspberries or halved blackberries", "24 pieces <a href=\"http://www.seriouseats.com/recipes/2008/07/basic-pound-cake.html\"> basic pound cake</a>, approximately 2\" x 1.5\" x 3/8\""], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a wire mesh sieve with a double layer of cheese cloth.  Set the sieve over a bowl, leaving room beneath the sieve for liquid to collect.  Spoon the ricotta into the lined sieve.  Fold the corners of the cheese cloth over the ricotta.  Place a layer of plastic wrap over the top of the sieve, covering the cheese-cloth bundle.  Place a few glass or ceramic bowls on top of the plastic to gently weight the cheese down and place the whole setup in the refrigerator overnight.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the weight bowls and turn the ricotta out of the cheese cloth into a clean bowl. Discard the cheese cloth and the liquid that drained from the cheese overnight.  Add the salt and 2 teaspoons of honey to the pressed ricotta and stir well to combine.  Cover the mixture and refrigerate until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small mixing bowl, stir together the remaining 2 teaspoons of honey, lime juice and thyme leaves.  Add the nectarine and berries, and gently toss to coat with the honey mixture.  Cover and set aside until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush pound cake slices lightly with olive oil; place on the grill until toasted (alternatively, you can place cake slices in a grill or sauté pan or under the broiler). Toasted pound cake pieces may be used immediately or placed on paper towels in a single layer to cool for later use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble: Place a generous dollop, about 1 teaspoon, of the ricotta mixture on each pound cake base, and spread toward the edges.  Scoop up the nectarine mixture by the teaspoon, pressing each spoonful gently against the side of the bowl to allow juices to drain away before placing the fruit on top of the ricotta topped pound cake bases.  After assembling all of the bruschette, arrange them on a serving platter, drizzle each with a little of the reserved fruit juice mixture, and serve immediately. (As an alternative, serve the components&mdash;toasted pound cake, cheese and fruit mixtures&mdash;individually so that guests may assemble their own bruschette.)</p>"}]}