{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feat-20080724-bruschettadolce.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["bruschetta", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Keeping Summer Dessert Sweet and Simple with Bruschetta Dolce", "link": "https://www.seriouseats.com/recipes/2008/07/bruschetta-dolce-cherry-hazelnut-black-raspberry-nectarine-pound-cake-recipe.html", "description": "By substituting pound cake for the bread and crowning it with sweeter, fruit-based mixtures, you have <strong>bruschetta dolce.</strong>  It's a a fantastic opportunity to take advantage of beautiful summer fruits and the residual heat of the grill, and it makes the ideal finale to your next summer barbecue.", "totalTime": "", "recipeYield": "16-20 bruschette", "recipeCategory": [], "recipeIngredient": ["1/2 pound fresh sweet cherries", "1 1/2 teaspoons butter (7 grams)", "2 teaspoons dark brown sugar (8 grams)", "3/4 teaspoon balsamic vinegar", "Pinch salt", "16 - 20 pieces <a href=\"http://www.seriouseats.com/recipes/2008/07/basic-pound-cake.html\"> basic pound cake</a>, approximately 2\" x 1.5\" x 3/8\"", "Melted butter", "3 tablespoons nutella", "About 2 tablespoons toasted blanched hazelnuts, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse, stem, pit, and quarter the cherries.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small sauté pan over medium-high heat and add butter.  When butter has completely melted and begins to foam, add cherries. Sauté, tossing regularly to ensure even cooking, for one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the cherries with the brown sugar and continue to sauté for a few more seconds, just until sugar melts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the heat, add vinegar and salt, and toss cherries to distribute.  Pour mixture into a wide, shallow bowl to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush pound cake slices lightly with olive oil; place on the grill until toasted (alternatively, you can place cake slices in a grill or sauté pan or under the broiler).  Remove toasted cake pieces to a paper towel-lined tray to cool completely before assembly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble: Spread each cooled cake base sparingly with about 1/2 teaspoon of Nutella.  Arrange about a teaspoon and a half of the cherry mixture, reserving juices, over the Nutella on each base.  Sprinkle each bruschetta with a few pieces of toasted hazelnut.  Arrange on a serving tray, drizzle each with some reserved juice, and serve immediately.</p>"}]}