{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Amy Scherber", "Amy's Bread", "butterscotch", "cashews", "desserts", "Super Bowl desserts", "The Sweeter Side of Amy's Bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Butterscotch Cashew Bars", "link": "https://www.seriouseats.com/recipes/2008/10/butterscotch-cashew-bars-recipe.html", "description": "The following recipe is from the October 29th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Butterscotch cashew bars were one of Amy Scherber's favorite after-school snacks when she was a child....", "totalTime": null, "recipeYield": "25 bars", "recipeCategory": ["Desserts", "Nuts"], "recipeIngredient": ["<strong>Crust:</strong> ", "2 2/3 cups (388 grams/13.68 ounces) unbleached all-purpose flour", "2 teaspoons kosher salt", "1 1/4 cups (284 grams/10 ounces) unsalted butter, cold", "1 1/8 cups (250 grams/8.82 ounces) light brown sugar, packed", "&nbsp", "<strong>Topping:</strong> ", "1/2 cup plus 2 tablespoons (205 grams/7.23 ounces) light corn syrup", "1 2/3 cups (284 grams/10 ounces) butterscotch chips", "3 1/2 tablespoons (50 grams/1.76 ounces) unsalted butter", "2 tablespoons (28 grams/1 ounces) water", "1/4 teaspoon kosher salt", "2 cups (256 grams/9.03 ounces) Cashew pieces, roasted and salted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position rack in the middle of the oven and preheat the oven to 350ºF. Grease a 12 x 17-inch sheet pan lightly with softened butter and line it with aluminum foil, pressing the foil up the sides of the pan and into the corners. Grease the foil with softened butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the crust: In the bowl of a food processor fitted with the metal blade, combine the flour and salt. Dice the butter into 1-inch pieces and place half in the food processor with the flour. Pulse for a few seconds. Add half of the brown sugar and pulse again, and then add the remaining butter and brown sugar and process for 20 to 30 seconds until a coarse meal is formed and the dough is just beginning to gather into a ball. If you don't have a food processor, follow the same procedure but cut the butter into the flour, alternating with the brown sugar, using a pastry blender to form a coarse meal. The dough will be a little crumbly but will almost form a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the crust evenly in the bottom of the prepared pan. Pat it gently and evenly into the pan all the way to the corners. Be careful not to pack it down too much or the crust will become tough. Bake it for about 5 minutes, then prick the dough lightly with a fork all over, and return the pan to the oven and bake for about 10 more minutes. When the crust is ready, it will be slightly browned and a bit soft when you press it lightly.  Remove crust from oven and allow it to cool for several minutes. Do not turn off the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the topping: in a medium saucepan, add the butterscotch chips, corn syrup, butter, water, and salt and cook over medium heat, stirring constantly until the chips have melted completely and the topping has just begun to simmer, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the cashew pieces into the hot topping and spread it evenly over the baked crust. Try to spread it out to the corners if possible, but the topping will spread into any bare spots during baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake again for 11 to 15 minutes, or until the surface is brown and very bubbly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the bars to cool completely on a wire rack before cutting them into 25 pieces. </p>"}]}