{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mario Batali's Tortelloni di Treviso with Fonduta di Parmigiano", "link": "https://www.seriouseats.com/recipes/2008/11/mario-batali-tortelloni-di-treviso.html", "description": "...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["4 heads radicchio di Treviso", "4 tablespoons virgin olive oil", "1 medium red onion", "1/2 cup grated parmigiano reggiano plus 1/2 cup", "2 bunches Italian parsley, finely chopped to yield 1/2 cup", "salt and pepper", "1 tablespoon balsamic vinegar", "1 recipe basic pasta, rolled to thinnest setting on machine", "1 cup whipping cream", "2 egg yolks", "1/4 fresh grated nutmeg", "8 tablespoons butter", "3 1/2 cups unbleached all-purpose flour plus 1/2 cup", "4 extra large eggs", "1/2 teaspoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop radicchio into 1/4-inch pieces, rinse and spin dry.  In a 12-inch to 14-inch sauté pan, heat olive oil until smoking over medium high heat.  Add onion and cook until softened and light brown, about 6 to 7 minutes.  Add radicchio and toss until very soft, about 6 to 7 more minutes.  Remove from pan and allow to cool.  Place in mixing bowl and add one half cup parmesan, parsley, salt and pepper and balsamic vinegar and stir well.  Cut pasta into 4-inch squares.  Place 1 tablespoon into center of each pasta square.  Fold to form triangle and then fold ends together to form tortelloni.  Continue until all pasta filling is finished. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring six quarts water to boil and add 2 tablespoons salt.  Place tortelloni in boiling water and lower heat to high simmer.  Meanwhile, bring cream to boil in 1 quart saucepan.  Remove from heat, add remaining 1/2 cup parmesan, yolks and nutmeg and stir through.  Drain tortelloni and place into 12-inch to 14-inch sauté pan with butter and reserved radicchio and simmer over low heat.  Place 3 tortelloni on each plate, spoon 2 tablespoons fonduta over the pasta and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Fresh Egg Pasta</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a mound of the flour in the center of a large wooden cutting board. Make a well in the middle of the flour and add the eggs, oil and any other flavoring you choose. Using a fork, beat together the eggs, oil and flavorings and begin to incorporate the flour starting with the inner rim of the well. As you expand the well, keep pushing the flour up to retain the well shape. Do not worry that this initial phase looks messy. The dough will come together when 1/2 of the flour is incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start kneading the dough with both hands, using the palms of your hands primarily. Once you have a cohesive mass, remove the dough from the board and scrape up any left over crusty bits. Lightly flour the board and continue kneading for 3 more minutes. The dough should be elastic and a little sticky. Continue to knead for another 3 minutes, remembering to dust your board when necessary. Wrap the dough in plastic and allow to rest for 30 minutes at room temperature. Note: do not skip the kneading or resting portion of this recipe, they are essential for a light pasta. </p>"}]}