{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["holidays", "lamb", "lamb shanks", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Citrus-Braised Lamb Shanks", "link": "https://www.seriouseats.com/recipes/2008/03/citrus-braised-lamb-shanks-recipe.html", "description": "If you're celebrating Easter, you've probably already got plans for tomorrow night's supper, but if not, I've found this recipe, adapted from The River Cottage Meat Cookbook by Hugh Fearnley-Whittingstall, ideal for a Sunday afternoon. I'm posting it a little...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Easter", "Lamb", "Mains", "Sunday Supper"], "recipeIngredient": ["4 lamb shanks", "2 to 3 tablespoons olive oil", "1 carrot, finely diced", "1 onion, finely diced ", "2 celery stalks, finely diced", "A few sprigs of thyme ", "2 bay leaves ", "2 garlic cloves, finely chopped ", "1 tablespoon tomato paste ", "1/2 bottle of white wine ", "1 cup water ", "Juice and finely grated zest of 1 lemon ", "Juice and finely grated zest of 1 orange ", "Salt and freshly ground black pepper ", "Chopped parsley, to garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat some of the olive oil in a large flameproof casserole, add the diced vegetables, and sweat, without browning, until tender. Add the thyme, bay, garlic, tomato paste, wine, and water, along with most of the citrus juice and zest (reserve a few pinches of zest and a tablespoon of each juice). Bring to a boil and then reduce the heat to a gentle simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a little more olive oil in a separate pan; brown the lamb shanks on all sides, seasoning with a little salt and pepper. Add shanks to casserole; cover with lid. Transfer to a about 250&deg;F oven; cook for about 2 1/2 hours, until meat is completely tender and falling off bone. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove shanks from pan; keep warm while you finish the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skim off some of the fat from the surface; taste the liquid for seasoning and intensity. Boil to reduce if it needs it. Stir in reserved lemon and orange juice to refresh the citrus flavor. Serve the shanks on warmed plates with a generous amount of sauce spooned over and sprinkled with a little parsley and a pinch of citrus zest. Accompany with mashed potatoes, soft polenta, or creamy beans, such as butter beans or cannellini.</p>"}]}