{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081201leftoversempanadas.JPG", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["empanadas", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Leftovers Empanadas", "link": "https://www.seriouseats.com/recipes/2008/12/leftovers-empanadas-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by the book coauthored by the two, Almost Meatless, due out in spring...", "totalTime": "", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Mains", "Meat Lite", "Sides"], "recipeIngredient": ["10 6-inch masa dough rounds (packaged or homemade, if you still have it in you to tough it out in the kitchen)", "6 ounces shredded turkey meat (about 1 packed cup)", "1/2 cup salsa (homemade or your favorite jarred variety)", "1 cup cooked potato (mashed, scalloped, boiled, roasted and chopped- whatever your tradition)", "2 scallions thinly sliced ", "4 ounces shredded Monterey Jack cheese", "1/2 cup gravy, reheated", "Peanut or vegetable oil for frying (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the dough rounds in a single layer and cover with a damp cloth to prevent drying.  Mix the shredded turkey and salsa together in a small bowl.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread a heaping teaspoon of potatoes in the middle of each round.  Sprinkle with scallions and top with a heaping spoonful of the turkey mixture.  Divide the cheese amongst each empanada.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one at a time, fold the dough round in half over the filling so that the edges of each side meet.  Press the edges together and then close them either by pressing with the tines of a fork or by pinching and folding the dough on itself to create a roped edge.  (Adjust the amount of filling if necessary so it's not bursting from the seams.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour about an inch of oil into a Dutch oven, heavy-bottomed saucepot or high straight-sided frying pan.  Heat the oil to about 375°F on a deep-fry thermometer, or until a steady stream of bubbles forms around the handle of a wooden spoon in the hot oil.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently lower the empanadas into the hot oil to avoid splashes.  Fry in batches of 3 or 4, depending on the size of your pot, flipping with a slotted spoon so that each side cooks to golden brown, about 1 to 2 minutes per side.  Transfer to a paper towel-lined plate until all of the empanadas are cooked. </p>"}]}