{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080819fishwithpico.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["fish", "halibut", "pico de gallo", "tilapia"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Crispy Tilapia with Pico de Gallo Salsa", "link": "https://www.seriouseats.com/recipes/2008/08/crispy-tilapia-with-pico-de-gallo-salsa-recipe.html", "description": "A glistening bowl of chopped summer tomatoes, onions, cilantro, and lime juice—it doesn't get much better than that. But that's the problem with this recipe. If tortilla chips are anywhere nearby, you might skip dinner altogether. If you can guard...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Fish", "Healthy and Delicious"], "recipeIngredient": ["4 tilapia fillets, seasoned with salt and pepper", "2-3 tomatoes, or a pint box of cherry tomatoes", "1 medium onion", "1 small bunch of cilantro", "1 clove garlic, pressed through a garlic press", "2 limes", "Olive oil", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the tomatoes and onions and add to a bowl along with the cilantro, finely chopped.  Add a few healthy pinches of salt, black pepper, the garlic, and the juice of one lime.  Add a touch of olive oil, no more than one tablespoon, and taste.  Adjust for seasoning and allow to sit for at least 15 minutes, preferably longer for the flavors to marinate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat two large nonstick skillets (or one, and cook in batches) over medium-high heat with enough olive oil to cover the bottom.  When the oil is almost smoking, lay the fillet in the oil to coat, then turn over to cook opposite side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, without touching, for one to two minutes per side, depending on thickness.  Remove from the heat and plate, topping with the pico de gallo.  Squeeze a little lime juice, crack fresh pepper, and serve.</p>"}]}