{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-joyofcooking.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["casseroles", "chicken", "classic cookbooks", "Joy of Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: 'Joy of Cooking' Chicken Divan", "link": "https://www.seriouseats.com/recipes/2008/02/classic-cookbooks-joy-of-cooking-chicken-divan-recipe.html", "description": "As I wrote long ago in another forum, Joy of Cooking has never much appealed to me. A prudish child, I was, I think, put off by the way its title echoed The Joy of Sex (a subject I would...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Classic Cookbooks", "Mains"], "recipeIngredient": ["2 tablespoons butter, plus extra for greasing the dish and buttering toast", "4 slices white bread", "2 boneless, skinless chicken breast halves (about 12 ounces), poached and thinly sliced", "10 ounces frozen chopped broccoli, thawed", "Salt", "2 cups whole milk", "1/4 onion, peeled", "2 whole cloves", "1 bay leaf", "2 tablespoons flour", "1 cup grated cheese (I used 1/2 cheddar and 1/2 parmesan)", "1/3 cup parmesan cheese", "Freshly ground pepper", "Cayenne pepper or freshly grated nutmeg to taste (I used 1/4 teaspoon cayenne)", "1 1/2 pounds boneless, skinless chicken breast", "1 3/4-2 cups chicken stock", "4 tablespoons unsalted butter, plus extra for greasing the dish", "1/2 cup flour", "1 1/2 cups whole milk, half-and-half, or light cream", "2-3 tablespoons sherry (optional)", "Salt", "Pepper", "Freshly grated nutmeg", "3 cups steamed broccoli florets", "1/2 cup grated parmesan cheese or 1 cup grated cheddar cheese (I used cheddar)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F. Butter an 8- or 9-inch square baking dish. Toast and butter the white bread and use it to line the bottom of the baking dish, trimming to fit as necessary. (Hint: toast scraps taste good with Mornay sauce.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the cooked, sliced chicken over the toast. Top the chicken with broccoli and sprinkle with 1/4 teaspoon salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the Mornay sauce. Put the milk in a small saucepan with 1/4 onion stuck with 2 whole cloves and heat over a low flame for 15 minutes; the milk should not boil but should get warm enough to take on the flavor of the onion, cloves, and bay leaf. Take the milk from the heat and remove the onion, cloves, and bay leaf. Melt the 2 tablespoons butter in a medium, heavy-bottomed saucepan over medium-low heat. When the foam subsides, add the flour all at once, turn the heat to low, and stir for 2-3 minutes, until it no longer smells raw and has taken on some color but is not nutty brown. Remove the saucepan from the heat, allow it to cool for a minute, then whisk in the warm milk until no lumps remain. Put the saucepan back over a low flame and cook for 8-10 minutes, stirring frequently, until the sauce is the consistency of a thick cream soup. Then stir in the cup of grated cheese until it is completely melted but no longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the saucepan from the heat and season with salt and pepper to taste. Stir in cayenne or nutmeg. Pour this sauce over the dish of chicken and broccoli. Sprinkle 1/3 cup grated parmesan over the top and bake for 25-35 minutes, until the top is browned and the sauce is bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Chicken Divan (Original Recipe)</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>adapted from </em><a href=\"http://www.amazon.com/All-New-Purpose-Joy-Cooking/dp/0684818701/ref=pd_bbs_sr_3?ie=UTF8&s=books&qid=1203442414&sr=8-3\">The All-New, All-Purpose Joy of Cooking</a> <em>(1997)</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-serves 6-8</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chicken in a Dutch oven with the stock. If the stock does not cover the chicken, add enough water to cover completely. Bring to a simmer over high heat, then reduce the heat so the liquid barely bubbles. Cover partially and cook until done, 8-12 minutes. Remove the meat from the stock (do not discard stock) and let it stand until cook enough to handle. Cut or shred into bite-sized pieces. Skim the fat from the stock with a spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Melt the butter in a large saucepan over medium-low heat. Whisk in the flour and cook, whisking constantly, for 1 minute. Remove the pan from the heat and whisk in 2 cups of the chicken stock until smooth. Then whisk in the milk, half-and-half, or cream and return the pan to the burner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the flame to medium and bring the mixture just to a simmer, whisking constantly. If lumps form, remove the pan from the heat, scrape its sides with a spatula, and whisk the lumps away. Simmer 1 minute. Stir in the cooked chicken and optional sherry. Cook 1 minute more. Remove from the heat and season to taste with salt, pepper, and nutmeg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9x13 inch baking dish. Spread the steamed broccoli in the dish and top with the creamed chicken. Sprinkle with cheese and bake until the sauce is bubbly and the cheese is golden brown, 25-35 minutes.</p>"}]}