{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081229jamieathome.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["chorizo", "Cook the Book", "Jamie at Home", "Jamie Oliver", "omelette"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Potato and Chorizo Omelette with a 'Kinda' Parsley Sauce", "link": "https://www.seriouseats.com/recipes/2008/12/jamie-oliver-potato-and-chorizo-omelette-recipe.html", "description": "Jamie Oliver, author of this week's Cook the Book pick, describes his potato and chorizo omelette as a cross between a tortilla española and a frittata. These aren't the only categories the dish spans, as it is just as suitable...", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["4 small waxy potatoes, scrubbed and cut into chunks", "Sea salt and freshly ground black pepper", "6 large free-range or organic eggs", "2 two-ounce good-quality Spanish chorizo sausages, cut into 1/2-inch thick slices", "2 sprigs of fresh rosemary, leaves picked", "2 shallots, peeled and very finely sliced", "Juice of 1 lemon", "Extra virgin olive oil", "A bunch of fresh flat-leaf parsley, leaves picked"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to full whack, or get your broiler nice and hot. Put the potatoes into a saucepan of boiling salted water and simmer until cooked, then drain and leave to steam dry. Beat the eggs with a fork in a large mixing bowl, season well with salt and pepper, and put to one side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a 7- ot 8-inch non-stick, ovenproof frying pan. Add the chorizo slices and the potato chunks. The chorizo will start to sizzle releasing all its tasty oils and spices. After a couple of minutes, when everything is lightly golden and crisp, remove from the pan with a slotted spoon and set aside. Sprinkle the rosemary leaves into the hot fat. Pour the beaten eggs on top immediately, adding the potatoes and chorizo and spreading everything out evenly. Place the whole pan in the preheated oven or under the broiler until the omelette is golden brown on top and just cooked through in the middle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the omelette is cooking, put the shallots into a bowl with the lemon juice, some salt and pepper and a glug of extra virgin olive oil. Toss and pinch the shallots with your fingertips to soften them slightly, then mix in the parsley leaves. Serve a little on top of the omelette and dig in!</p>"}]}