{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["baking", "brunch", "desserts", "pound cakes", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Pound Cake", "link": "https://www.seriouseats.com/recipes/2008/02/sunday-brunch-pound-cake.html", "description": "I know I'm going to get hammered by the nutrition police for advocating eating pound cake for brunch, but really, when you think about it, what's the difference between eating pound cake and eating pancakes or French toast or cereal?...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Breakfast and Brunch", "Desserts"], "recipeIngredient": ["12 ounces butter plus more for the pan, at room temperature", "2 tablespoons plus 3 cups flour", "1 teaspoon baking powder", "1/2 teaspoons fine salt", "1 cup milk, at room temperature", "1 teaspoon pure lemon extract", "1 teaspoon pure vanilla extract", "3 cups sugar", "6 large eggs, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 325&deg;F.  Generously grease a light-colored 10-inch tube pan with butter.  Add 2 tablespoons flour; turn pan to coat evenly with flour, tap out any excess, and set aside. (The inside of the pan should be smoothly and evenly coated with butter and flour, with no clumps or gaps.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sieve set over a bowl, sift together remaining flour, baking powder, and salt.  Repeat twice more. In a measuring vessel with a pourable spout, combine milk and the lemon and vanilla extracts. In the bowl of a stand mixer fitted with the paddle attachment, cream butter at medium-low speed until light and fluffy, about 2 minutes.  Gradually add sugar, 1/4 cup at a time, scraping down the sides of the bowl with a rubber spatula, and beat until satiny smooth, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 egg at a time to the butter mixture, beating 15 seconds before adding another, and scraping down the bowl after each addition.  Reduce mixer speed to low and alternately add the flour and milk mixtures in 3 batches, beginning and ending with the flour.  Scrape down sides of bowl; beat just until batter is smooth and silky but no more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan and firmly tap on a counter to allow batter to settle evenly. Bake until light golden and a toothpick inserted in center of cake comes out moist but clean, about 1 hour and 15 minutes. Let cake cool in pan on a rack for 30 minutes. Invert cake onto rack; let cool completely before serving.</p>"}]}