{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Michael Tong", "seafood", "soft-shelled crabs", "The Shun Lee Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Soft-Shelled Crabs with Ginger and Scallions", "link": "https://www.seriouseats.com/recipes/2008/08/soft-shelled-crabs-with-ginger-and-scallion-recipe.html", "description": "In this recipe for soft-shelled crabs with ginger and scallions, excerpted from The Shun Lee Cookbook, the crabs are fried for three short intervals instead of one long one. While that may seem like a lot of unnecessary work, the...", "totalTime": "", "recipeYield": "2 to 4 servings", "recipeCategory": ["Cook the Book", "Lobster and Crab", "Mains"], "recipeIngredient": ["2 soft-shelled crabs", "1/4 cup all-purpose flour", "Vegetable oil, for deep-frying, plus 2 tablespoons", "1 scallion, white part only, trimmed and minced", "1 tablespoon seeded and minced red bell pepper", "1 tablespoon minced cilantro", "1 teaspoon peeled and minced ginger", "1 tablespoon rice wine or dry sherry", "Pinch of sugar", "Pinch of salt", "1/4 teaspoon dark sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To clean the crabs, lift up both sides of the shell and pull away and discard the gills and spongy (watery) part above the flesh. Do this on the bottom of the crab and the center (pointy) area as well. Also cut off the face of the crab, including the eyes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each crab into 4 pieces. Pour the flour into a bowl, and dip each piece of crab into the flour, shaking off any excess. Place the crab pieces on a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large wok over high heat. Add enough oil to come 1 1/2 inches up the sides of the wok, and heat it to 375ºF. Carefully add the crab pieces to the oil. Stand back&mdash;they will puff up and, because the crabs have a lot of water in them, they will sizzle and crackle. Deep-fry until the coating is set, about 30 seconds. Using a wide wire-mesh strainer, transfer them to a colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat oil to 375ºF. Return the crabs to the oil and deep-fry for 30 seconds more. Transfer to colander. Reheat the oil again to 375ºF. Return the crabs to oil and deep-fry until the sizzle in the oil slows down and the crabs are very crisp, about 30 seconds more. Transfer the crabs to the colander. Discard the oil and wipe out the wok with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the wok to high heat. Add the 2 tablespoons oil and heat it. Add the scallions, bell pepper, cilantro, and ginger, and stir-fry for 30 seconds. Return the crab pieces to the wok and add the rice wine, sugar, salt, and sesame oil. Stir-fry for 30 seconds. Serve immediately.</p>"}]}