{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081121baked.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Baked", "Matt Lewis", "New Frontiers in Baking", "Renato Poliafito", "shortbread", "Twix"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Millionaire's Shortbread", "link": "https://www.seriouseats.com/recipes/2008/11/baked-millionaires-shortbread-recipe.html", "description": "In this recipe, traditional Scottish shortbread is smeared with golden dulce de leche and, once cooled, covered in a dark chocolate glaze. \"This is a messy bar,\" note the authors--for neater edges, dip your knife in hot water and pat it dry before slicing.", "totalTime": null, "recipeYield": "24 bars", "recipeCategory": ["Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["<strong>Shortbread</strong>", "1/2 cup sugar", "1 1/4 cups (2 1/2 sticks) unsalted butter, softened", "2 /12 cups all-purpose flour", "1 large egg yolk, slightly beaten", "<strong>Caramel filling</strong>", "28 ounces sweetened condensed milk (two 14-ounce cans)", "<strong>Chocolate glaze</strong>", "6 ounces dark chocolate (60% cacao), coarsely chopped", "1 teaspoon light corn syrup", "1/2 cup (1 stick) unsalted butter, softened, cut into cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the shortbread:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. butter the bottom and sides of aa 9-by-13-inch baking pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, beat the sugar and butter together until blended</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 cups of the flour and beat until well combined. Add the egg yolk and beat for a few seconds, or until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured work surface. Dust the top of the dough and your hands with a little flour. Use your hands to gently work the dough into a 6-by-6-inch square. You will have to turn the dough and sprinkle the top with flour as you go. Sprinkle the remaining 1/2 cup flour on the surface of the dough. Fold the dough over and knead until incorporated, then flatten the dough into a rectangle. Transfer the rectangle to the prepared pan and press it into the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prick the dough all over with a fork and bake in the center of the oven for 20 to 22 minutes, until golden brown. Transfer to a wire rack and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the caramel filling:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the sweetened condensed milk in a large microwave-safe bowl. Cook on 50 percent power (medium) for 4 minutes, stirring briskly halfway through, until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook on 30 percent power (medium-low) for 12 to 18 minutes, until very thick and caramel colored, stirring briskly every 2 minutes, until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the caramel filling over the cooled shortbread and place the pan in the refrigerator until cool, about two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the chocolate glaze:</strong> In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled caramel layer and use an offset spatula to spread it into an even layer. Put in the refrigerator for 1 hour, or until the glaze hardens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the refrigerator 30 minutes before serving so as not to crack the chocolate glaze. Cut into squares and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The bars can be stored in the refrigerator, tightly covered, for up to 4 days.</p>"}]}