{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["bananas", "brunch", "chocolate", "vegetarian", "waffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Banana Waffles", "link": "https://www.seriouseats.com/recipes/2008/05/chocolate-banana-waffles-recipe.html", "description": "The following recipe is from the May 7th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Why not treat your mom this coming Mother's Day with a plate of chocolate banana waffles?...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Banana", "Desserts", "Vegetarian", "Waffle"], "recipeIngredient": ["4 firm ripe bananas", "10 tablespoons (1 1/4 sticks) unsalted butter", "1/4 cup plus 2 tablespoons (packed) brown sugar", "Splash of rum (optional)", "3/4 cup all-purpose flour", "2 tablespoons granulated sugar", "2 teaspoons baking powder", "1/4 teaspoon salt", "1/4 cup unsweetened cocoa powder, natural or Dutch process", "1/2 cup milk", "1/2 teaspoon instant coffee powder", "1 egg", "1/2 teaspoon vanilla extract", "1 cup crème fraîche, for serving", "<h5>Equipment</h5>", "Large skillet", "Waffle iron"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the bananas in half lengthwise. Cut each half into 3 or 4 pieces. Heat 2 tablespoons of the butter in a large skillet. Saut&eacute; the banana pieces 3 to 5 minutes on each side, or until tender and browned. Sprinkle with 2 tablespoons of the brown sugar, turn once more, and splash with rum, if using. Set aside and reheat when the waffles are ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, mix the flour, granulated sugar, baking powder, and salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the remaining 8 tablespoons of butter in a small saucepan. Stir in the cocoa until smooth and hot. Gradually stir in the milk until smooth. Off the heat, whisk in the remaining 1/4 cup of brown sugar, coffee powder, egg, and vanilla, stirring until the mixture is completely smooth. Pour the contents of the saucepan over the flour mixture and stir until the dry ingredients are completely moistened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the waffle iron. Make each waffle with 1/4 to 1/3 cup of batter, cooking just until steam stops rising from the sides of the waffle iron. Either serve immediately topped with warm saut&eacute;ed bananas and a dollop of crème fraîche, or cool very briefly on a rack to crisp before serving. Waffles may also be made in advance, cooled on a rack, and reheated on a cookie sheet in a 350°F oven for a few minutes before serving.</p>"}]}