{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["beef", "brisket", "classic cookbooks", "Edna Lewis", "mains", "The Taste of Country Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Edna Lewis's Oven Brisket", "link": "https://www.seriouseats.com/recipes/2008/07/edna-lewis-oven-brisket-rolled-chuck-recipe.html", "description": "My family has a dinner-table tic: whether we’re at a restaurant or at home and especially good bread is served, someone always says, “You know, I could just eat bread for dinner. This is all I need.” When my father...", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Beef", "Classic Cookbooks", "Mains"], "recipeIngredient": ["3 pounds beef brisket or chuck", "Vegetable oil or lard", "1 tablespoon butter", "1 1/2 pounds onions, peeled and sliced", "Fresh-ground black pepper", "3 or 4 whole allspice", "1 bay leaf", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe the meat with a damp cloth. Heat a skillet, grease lightly with oil or lard, and add the beef, searing well on all sides until well browned. Place the seared meat in a heavy pot or pan. Wipe the skillet out and then add a tablespoon of butter and put in the onions. Stir the onions until they are pretty well browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the meat over with fresh ground black pepper, then add the browned onions, allspice, and bay leaf. Cover closely and see that the pan is good and hot before placing it in the oven. Set into a preheated 400°F oven until the meat begins to cook. Turn the oven to 225°F and leave to cook undisturbed for 2 1/2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When finished, remove the meat and press the onions through a sieve. Add to pan drippings and season this sauce with salt and pepper to taste. Serve hot with the beef.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>My modifications:</strong> I used a larger brisket and increased the amount of onions. She notes that <strong>the weight of the onions should be 1/2 the weight of the meat. </strong>I seasoned the meat generously with kosher salt and pepper before browning, and I browned each side for about eight minutes. I sliced my onions about 1/4 inch thick and cooked them until they were a pale caramel color, not truly brown. Instead of using a separate skillet for browning, as she suggests, I browned the meat in a large Dutch oven, removed it to a board while I cooked the onions, and then returned the meat to the pot, scooping most of the onions up and over it. I didn’t see why I should get two things dirty, especially when that might mean losing some cooked-on meat and onion juices. I was not sure how to tell when the meat had started cooking in the oven, so I left it at 400°F for 15 minutes and then turned the oven down and let it go three hours more, which seemed to work out well.</p>"}]}