{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080519-dinnertonight-thumb.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Asian", "rice", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Ginger Fried Rice", "link": "https://www.seriouseats.com/recipes/2008/05/ginger-fried-rice-recipe.html", "description": "About three different times during the process of cooking this meal I turned to the fianc&eacute;e and said we should just scrap it and make a more traditional fried rice recipe.  Many of the hallmarks of a fried rice recipe were ignored, including no high heat and no scrambling of eggs.  But I was calmed by the fact this was a Jean-Georges recipe.  And it certainly doesn’t taste like any fried rice I’ve had before.", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Fried Rice", "Ginger", "Sides", "Vegetarian"], "recipeIngredient": ["1/4 cup canola oil ", "1 tablespoon garlic, minced", "1 tablespoons fresh ginger, minced", "1 cup leeks, thinly sliced white and pale green parts only", "2 cups rice, preferably day old or at least cool", "1 teaspoons sesame oil ", "2 teaspoons soy sauce", "2 large eggs", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pan pour half of the oil in over medium heat.  Toss in the leeks and cook until they are softened, but not browned.  It should take about 10 minutes.  Turn the heat to medium-low if they start to develop any color.  Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump in the rice and stir it together with the leeks.  Cook until it is hot, just a few minutes.  Turn off the heat.  Divide the rice into two plates.  Drizzle each with half of the soy sauce and sesame oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in another large pan pour the rest of the canola oil over medium heat.  When hot, add the garlic and ginger.  Stirring occasionally, cook until the garlic is nicely browned, just a few minutes.  Remove the garlic and ginger and drain on a paper towel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the eggs sunny-side up in the remaining oil left from frying the garlic and ginger.  When done, place one egg on each mound of rice.  Sprinkle the garlic and ginger on top.  Season with salt.  Add more soy sauce or sesame oil if you so desire.   </p>"}]}