{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081020-cookscountry.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Jack Daniels", "pork chops", "The Cook's Country Cookbook", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Tennessee Whiskey Pork Chops", "link": "https://www.seriouseats.com/recipes/2008/10/cook-the-book-tennessee-whiskey-pork-chops.html", "description": "Like the classic pairings of peanut butter and jelly or milk and cookies, pork chops and whiskey go hand in hand. But what's the best way to pair them? Numerous recipes for chops soused in Jack Daniels exist. Some include...", "totalTime": null, "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Mains", "Pork"], "recipeIngredient": ["1/2 cup Jack Daniels Tennessee Whiskey or bourbon", "1/2 cup apple cider", "2 tablespoons light brown sugar", "1 tablespoon Dijon mustard", "1/8 teaspoon cayenne pepper", "1/2 teaspoon vanilla extract", "4 teaspoons cider vinegar", "4 bone-in center-cut pork chops, about 1 inch thick", "2 teaspoons vegetable oil", "Salt and pepper", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the whiskey or bourbon, cider, brown sugar, mustard, cayenne, vanilla, and 2 teaspoons of the vinegar together in a medium bowl. Transfer 1/4 cup of the whiskey mixture to a gallon-sized zipper-lock plastic bag, add the pork chops, press the air out of the bag, and seal. Turn the bag to coat the chops with the marinade and refrigerate for 1 to 2 hours. Reserve the remaining whiskey mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chops from the bag, pat dry with paper towels, and discard the marinade. Heat the oil in a large skillet over medium high heat until just beginning to smoke. Season the chops with salt and pepper and cook until well browned on both sides and a peek into the thickest part of a chop using a paring knife reveals still-pink meat 1/4 inch from the surface, 3 to 4 minutes per side. Transfer the chops to a plate and cover tightly with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the reserved whiskey mixture to the skillet and bring to a boil, scraping up any browned bits with a wooden spoon. Cook until reduced to a thick glaze, 3 to 5 minutes. Reduce the heat to medium-low and, holding on to the chops, tip the plate to add any accumulated juices back to the skillet. Add the remaining 2 teaspoons vinegar, whisk in the butter, and simmer the glaze until thick and sticky, 2 to 3 minutes. Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the chops to the skillet and let rest in the pan until the sauce clings to the chops, turning them occasionally to coat both sides, and a peek into the thickest part of the pork chop using a pairing knife shows completely cooked meat (145ºF on an instant-read thermometer), about 5 minutes. Transfer the chops to a platter and spoon the sauce over the meat. Serve.</p>"}]}