{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20081205-kingarthurbiscotti-thumb.jpg", "author": {"@type": "Person", "name": "Erin Zimmer"}, "recipeCuisine": "", "keywords": ["biscotti", "Cookies", "holiday baking", "holiday recipes", "holidays"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Cookies: Pistachio-Cherry Biscotti", "link": "https://www.seriouseats.com/recipes/2008/12/pistachio-cherry-biscotti-recipe.html", "description": "Labeling biscotti as a \"Serious Cookie\" might have turned some heads, but given the lighter texture (from all the extra butter) and leavening, it's cookier than your average stick-shaped biscuit.", "totalTime": null, "recipeYield": "14 to 16 biscotti", "recipeCategory": ["Desserts"], "recipeIngredient": ["1 cup chopped pistachios", "1 cup sweet or sour dried cherries ", "6 tablespoons (3/4 stick) unsalted butter", "2/3 cup sugar", "1/4 teaspoon salt", "1 teaspoon vanilla extract", "1 1/2 teaspoons baking powder", "2 large eggs", "2 cups unbleached all-purpose flour "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.  Lightly grease (or line with parchment) a large (18 x 13-inch) baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized bowl, beat the butter, sugar, salt, vanilla, and baiting powder until the mixture is smooth and creamy. Beat in the eggs; the batter may look slightly curdled. Lower the mixer speed, add the flour, and mix until smooth. The dough will be quite soft and sticky, but should hold its shape when you drop it from a spoon. Stir in the pistachios and cherries. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to the prepared baking sheet, shaping it into a rough log about 14 inches long. It will be about 2 1/2 inches wide and about 3/4 inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the dough for 25 minutes. Remove it from the oven and let cool on the pan anywhere from 5 to 25 minutes; just work it into the schedule of whatever else you're doing in the kitchen. Five minutes before cutting, use a spray bottle filled with room-temperature water to lightly but thoroughly spritz the log, making sure to cover the sides as well as the top. Softening the crust just this little bit will make slicing the biscotti much easier. </p>\n\n<p>Reduce the oven temperature to 325°F. Wait another 5 minutes, then cut the biscotti into 1/4- to 3/4-inch slices. How thick you slice them depends on a number of factors. This recipe, without nuts or any add-ins, is easy to slice thin. Once you start adding chips, almonds, raisins, and other chunky ingredients, a 3/4-inch slice is more realistic. When you're slicing, be sure to cut straight up and down, if you cut at an angle, biscotti may be thicker at the top than the bottom, and they'll topple over during their second bake.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the biscotti upright on the prepared baking sheet. Bake for 25 minutes. Remove from the oven and transfer them to a rack to cool. </p>"}]}