{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080827-cooking-from-glossies.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "Everyday Food", "pancetta", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cooking from the Glossies: Salad with Pancetta Crisps, Roasted Brussels Sprouts, and Pear", "link": "https://www.seriouseats.com/recipes/2008/08/brussels-sprouts-new-bacon-salad-with-pancetta-roasted-pear-recipe.html", "description": "Brussels sprouts are the new bacon. Wait. Hear me out. Even if you don't agree that mini cabbages will ever hold a candle to cured pork, you must admit that Brussels sprouts, like bacon before them, are the latest chic...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon"], "recipeIngredient": ["3 ounces thinly sliced pancetta", "1/2 pound Brussels sprouts, trimmed and quartered lengthwise", "1/4 cup olive oil", "Coarse salt and ground pepper", "1/4 cup white-wine vinegar or sherry vinegar", "1 head Boston lettuce (about 1 pound), torn into bite-size pieces, or 1 pound mixed Greens", "1 red Bartlett pear, halved, cored, and thinly sliced", "2 ounces ricotta salata, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425ºF, with racks in upper and lower thirds. On a rimmed baking sheet, arrange pancetta in a single layer. Bake on a lower rack until golden brown, 10 to 12 minutes. Transfer to a paper-towel-lined plate to drain; set aside. On another rimmed baking sheet, toss Brussels sprouts with 2 tablespoons oil; season with salt and pepper. Bake on upper rack until tender, 18 to 20 minutes, tossing once. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together vinegar and remaining 2 tablespoons oil; season with salt and pepper. Add lettuce, pear, and Brussels sprouts; toss to combine. Divide among four serving plates, and top with ricotta salata and pancetta. </p>"}]}