{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Amy Scherber", "cherries", "chocolate", "Cook the Book", "Cookies", "desserts", "holiday baking", "holiday recipes", "holidays", "The Sweeter Side of Amy's Bread", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: White Chocolate Cherry Chunkers", "link": "https://www.seriouseats.com/recipes/2008/10/amys-bread-white-chocolate-cherry-chunkers-recipe.html", "description": "People can be very opinionated about white chocolate. Some view it with disdain, citing the fact that it contains no cocoa solids as evidence that it's not \"real\" chocolate. Others love it for its smooth, creamy, and delicate taste. Personally,...", "totalTime": "", "recipeYield": "1 dozen large cookies", "recipeCategory": ["Cherry", "Cook the Book"], "recipeIngredient": ["1 2/3 cups (244 grams/8.6 ounces) unbleached all-purpose flour ", "2 1/4 cups(188 grams/6.6 ounces) old-fashioned rolled oats", "1 1/4 teaspoons baking soda", "1/2 teaspoon kosher salt", "2 large eggs", "1 1/4 teaspoons vanilla extract", "1 cup (170 grams/6 ounces) dried tart cherries", "3/4 cup (125 grams/4.4  ounces) white chocolate chunks or chips", "1 cup (227 grams/8  ounces) unsalted butter, slightly softened", "1/2 cup 144 grams/5 ounces) firmly packed dark brown sugar", "5/8 cup (125 grams/4.4 ounces) granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position one rack in the top third of the oven, one rack in the bottom third of the oven, and preheat the oven to 350ºF. Line the cookie sheets with baking parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, add the flour, oats, baking soda, and salt and whisk together. In a separate bowl, whisk together the eggs and vanilla. In another large bowl, add the cherries and white chocolate and toss gently to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl, using an electric mixer with a paddle attachment, cream together the butter and sugars on medium speed for 2 minutes, or until light and fluffy, scraping the sides and bottom of the bowl frequently. Gradually add the egg mixture until everything is well combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer on low speed, add the flour mixture in stages. Mix only until everything is well combined, scraping the sides and bottom of the bowl frequently. There should not be any pockets of dry flour left in the dough. Add the cherries and chocolate and mix again on low speed until everything is evenly distributed. If you're using a mixer that has beaters instead of a paddle, you may want to fold these last ingredients in by hand with a wooden spoon or a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large soup spoon, a metal ice cream scoop, or your clean hands moistened with water, scoop out big balls of dough, placing 6 balls on each prepared cookie sheet. Each ball should weigh approximately 100 g/3.5 oz. If you don't have a scale, use a scant 1/2 cup to estimate the size. The dough balls should be about 2 1/4 inches in diameter. Press down lightly to flatten them to a thickness of about 2 inches. They will spread a lot during baking. Bake the cookies for about 18 minutes, rotating the cookies halfway through the baking time. They should be golden brown and baked all the way to the center. They should be soft, but be careful not to underbake them or they'll be doughy and will fall apart easily. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cookies cool on the sheets for 5 minutes, then move them to a rack and cool completely before serving.</p>"}]}