{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["frittata", "Mark Peel", "Nancy Silverton"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch (or Dinner):  Twelve Egg Frittata with Bacon and Bitter Greens", "link": "https://www.seriouseats.com/recipes/2008/02/sunday-brunch-twelve-egg-frittata-with-bacon.html", "description": "Though this twelve egg frittata, from the fertile culinary imaginations of Mark Peel and Nancy Silverton, is a great brunch dish, it can also easily be served throughout your Super Bowl gathering, because it's good warm, at room temperature, or...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon"], "recipeIngredient": ["12 slices bacon, cut into 1/2 inch pieces", "1 large bunch mustard greens (about 1/2 pound)", "12 eggs (large or extra-large)", "3/4 cup milk or half-and-half", "1/4 teaspoon coarsely ground black pepper1 ", "1/2 tablespoons capers, chopped", "4 ounces blue cheese", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 14-inch ovenproof skillet fry the bacon over moderate heat until browned but not crisp. Remove with a slotted spoon to paper towels to drain.  Discard all but 1 tablespoon of fat in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the mustard greens and remove and discard the stems.  Cut the leaves into 1-inch strips.  Saute in the reserved bacon fact just until wilted.  Remove from the pan, squeeze out any liquid that might make the eggs runny, and set aside.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl mix together the eggs, milk, pepper, capers, and half of the cheese.  Stir in the bacon and mustard greens.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in the skillet over high heat and pour in the egg mixture.  Crumble the remaining cheese on top.  Cook until the edges are set.  Place in the broiler 4 inches from the heat and broil until lightly browned but still soft in the center.  Remove from the oven and allow to stand for 5 minutes before serving.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully slide the frittata onto a serving platter or serve directly from the skillet.  </p>"}]}