{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Erin Zimmer"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Raised Doughnuts", "link": "https://www.seriouseats.com/recipes/2008/10/raised-doughnuts-donuts-recipe.html", "description": "...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts", "Doughnuts"], "recipeIngredient": ["3-3 1/4 cup unbleached all purpose flour", "1 envelope or 2 1/4 tsp instant yeast", "6 tablespoons sugar", "1/2 teaspoons salt", "2/3 cups whole milk, at room temp", "2 large eggs, beaten lightly", "6 tablespoons (3/4 stick) butter, softened but still cool", "6 cups shortening or oil to fry in (I only used 3 cups in a flat bottomed skillet so that doughnuts were shallow fried, never completely covered and it worked just fine)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together 3 cups of flour, the yeast, 5 tbsp sugar, and the salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the milk and eggs in the bowl of a standing mixer fitted with the dough hook.  Add the flour mixture and mix on low speed for 3 to 4 minutes, or until ball of dough forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the softened butter one piece at a time, waiting about 15 seconds after each addition. Continue mixing for about 3 minutes longer, adding the remaining flour 1 tablespoon at a time if necessary, until dough forms a soft ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough in a  lightly oiled medium bowl and cover with plastic wrap.  Let the dough rise at room temp until nearly double in size, 2 to 2 1/2 hours.  Place the dough onto a floured surface and, using a rolling pin, roll it out </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the doughnut rings and holes onto a floured baking sheet. Loosely cover with plastic wrap and let rise at room temp until slightly puffy, 30 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fit a candy thermomenter to the side of a large Dutch oven. Add the shortening or oil to the pot and gradually heat over medium-high heat to 375°F.  Place the rings and holes carefully into the hot fat 4 or 5 at a time. Fry</p>"}]}