{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["breads", "Cook the Book", "Nick Malgieri", "olives", "rosemary", "The Modern Baker", "yeast breads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Rosemary Olive Knots", "link": "https://www.seriouseats.com/recipes/2008/09/nick-malgieri-rosemary-garlic-knots-bread-recipe.html", "description": "Nick Malgieri, author of this week's Cook the Book selection, The Modern Baker, recommends serving these Rosemary Olive Knots split and filled with aged Gruyère, prosciutto, soft goat cheese and roasted peppers, or sliced tomatoes sprinkled with olive oil and...", "totalTime": "", "recipeYield": "12 medium-size rolls", "recipeCategory": ["Cook the Book", "Olives"], "recipeIngredient": ["<strong>For the dough:</strong>", "3 1/2 cups unbleached, all-purpose flour", "2 teaspoons salt", "2 1/2 teaspoons (1 envelope) active dry yeast", "1 1/2 cups warm water, about 110ºF", "3 tablespoons olive oil", "<strong>For the filling:</strong>", "1/2 cup pitter Gaeta or Kalamata olives, cut into 1/4-inch pieces", "3 tablespoons chopped fresh rosemary leaves", "1 tablespoon olive oil", "1/2 teaspoon freshly ground black pepper", "1 cookie sheet or jelly roll pan lined with parchment paper or foil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour and salt in the bowl of a food processor fitted with the metal blade. Pulse several times to mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the yeast into the water in a small bowl and whisk in the oil. Pour the liquid into the processor bowl and pulse until the dough forms a ball. Let rest for 10 minutes, then let the machine run continuously for 15 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert the food processor bowl over a lightly floured surface to turn out the dough. Carefully remove the blade and transfer any dough on it to the surface. Use a bench scraper to fold the dough over on itself several times. Place the dough into an oiled bowl and turn it over so that the top is oiled. Cover the bowl with a towel or plastic wrap and let the dough rise until it has doubled in bulk, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough to a floured work surface and lightly flour the top of the dough. Pat the dough into a 10-inch square. Fold the dough into thirds and slide both hands under it, palms up and flat, and lift it to a floured cookie sheet or small cutting board. Unfold the dough, even out the shape, and cover it with plastic wrap. Refrigerate the dough until it firms up, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the dough is chilling, for the filling, place the olives, rosemary, oil, and pepper in a small bowl and stir well to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough is firm, remove it from the refrigerator, leaving it on the pan or cutting board. Evenly distribute the filling on the bottom half of the dough in a 15 x 10-inch rectangle. Fold the top half of the dough down over the filling without pulling on it or stretching it, and press well with the palms of your hands to adhere.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a sharp pizza wheel to cut the dough into a 12 equal strips, each about 3/4 inch wide and 5 inches long. Set the prepared pan next to the dough. One at a time, loosely knot the strips of dough, letting one end of the strip protrude slightly at the top and arranging the other end under the roll. As the strips are knotted, transfer them to the prepared pan, leaving about 2 inches all around each one to allow room for expansion. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan with a wide towel or oiled plastic wrap and let the rolls rise until they have doubled in bulk, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 20 minutes before the rolls are completely risen, set a rack in the middle of the oven and preheat to 400ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the rolls until they are well-risen, deep golden, and feel firm to the touch, about 30 minutes. Slide the rolls on parchment paper on a rack to cool.</p>"}]}