{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "eggplant", "Michael Tong", "recipe newsletter", "The Shun Lee Cookbook", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sichuan Eggplant", "link": "https://www.seriouseats.com/recipes/2008/08/sichuan-eggplant-recipe.html", "description": "The following recipe is from the August 13th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! This week's recipe, excerpted from The Shun Lee Cookbook by Michael Tong, is for Sichuan eggplant....", "totalTime": null, "recipeYield": "4 servings", "recipeCategory": ["Chinese", "Eggplant", "Mains", "Vegetarian"], "recipeIngredient": ["4 small Japanese eggplants (about 1 pound total) trimmed", "Vegetable oil, for passing through", "<strong>Sauce:</strong>", "1 tablespoon vegetable oil", "6 garlic cloves, peeled and minced", "3 scallions, white parts only, trimmed and minced", "1/4 teaspoon freshly ground black pepper", "1 tablespoon dark sesame oil", "1 1/2 tablespoons distilled white vinegar", "1 tablespoon sugar", "1 tablespoon soy sauce", "1 teaspoon rice wine or dry sherry", "1 teaspoon hot bean paste", "1 teaspoon hot chili oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil, and keep it at a low boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, lightly score the skin of the eggplants in a crosshatch pattern, with the lines about 1 inch apart. Halve or quarter the eggplants lengthwise to make sticks about 1/2-inch wide. Cut the sticks into 2-inch lengths.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large wok over the high heat. Add enough oil to come about 1 1/2 inches up the sides of the wok, and heat it to 350°F. Working in batches without crowding, fry the eggplant, turning it occasionally, until tender, about 45 seconds. Do not overcook it or it will lose its shape. Using a wide wire-mesh skimmer, quickly remove the fried eggplant from the oil, dip it briefly in the boiling water and then transfer it to paper towels to drain. Repeat with the remaining eggplant, drying the skimmer after each use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, heat 1 tablespoon oil in a small skillet over medium-low heat. Add the garlic and stir-fry until fragrant, about 10 seconds. Add the scallions and black pepper, and stir-fry until the scallions are wilted, about 20 seconds. Add the sesame oil, and transfer the mixture to a bowl. Add the vinegar, sugar, soy sauce, rice wine, hot bean paste, and hot chili oil, and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the eggplant on a serving platter and pour the sauce over it. Serve at room temperature.</p>"}]}