{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feature-dorie-potsdecreme.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "French", "keywords": ["baking", "Baking with Dorie", "coffee", "custards", "Daniel Boulud", "desserts", "Dorie Greenspan", "French"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Daniel Boulud's Coffee-Cardamom Pots de Crème", "link": "https://www.seriouseats.com/recipes/2008/01/baking-with-dorie-daniel-bouluds-coffee-cardamom-pots-de-creme-recipe.html", "description": "I always think of <strong>pots de crème</strong>, or little pots of crème, as the French answer to our puddings. Really a baked custard, the crème can be created in just about any flavor combo. That uber-chef <strong>Daniel Boulud</strong> created them to be coffee-cardamom was a nod to the way coffee is often drunk in the Middle East: through a cardamom pod held between one's teeth.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Baking With Dorie", "Desserts", "French", "Puddings and Custards"], "recipeIngredient": ["3 ounces (1 cup) coffee beans, preferably an espresso roast", "2 tablespoons cardamom pods", "3/4 cup sugar", "2 cups (approximately) heavy cream", "1 cup whole milk", "7 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the coffee beans and cardamom pods in the workbowl of a food processor and pulse on and off several times to roughly chop&mdash;not grind&mdash;the ingredients. Turn the chopped beans and pods into a medium saucepan and add 1/2 cup of the sugar. Put the pan over medium heat and cook, stirring constantly with a wooden spoon, until the sugar starts to melt. Patience&mdash;this will take a few minutes. Once the sugar has melted, continue to cook, still stirring without stop, until the sugar caramelizes&mdash;you want the color of the caramel to be deep amber. Now, standing away from the stove so you don’t get splattered, slowly pour in 1 cup of the cream and the milk. Don’t panic&mdash;the caramel will immediately seize and harden&mdash;it will all smooth out as the liquids warm and the sugar melts again. Bring the mixture to a boil and, when the sugar has melted and everything is smooth again, pull the pan from the heat. Cover the pan (we do this with plastic wrap at the Café to get a good seal) and allow the mixture to infuse 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 300&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in a bowl that’s large enough to hold all the ingredients, whisk the yolks and remaining 1/4 cup sugar together until the mixture is pale and thick. Strain the coffee-cardamom liquid into a measuring cup (discard the beans and pods) and add enough heavy cream to bring the liquid measurement up to 2 cups. Very gradually and very gently&mdash;you don’t want to create air bubbles&mdash;whisk the liquid into the egg mixture; skim off the top foam, if there is any.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange six 4-ounce espresso or custard cups in a small roasting pan, leaving an even amount of space between the cups, and fill each cup nearly to the top with the custard mixture. (If you liked, line the roasting pan with a double thickness of paper towel or a kitchen towel to steady the cups.) Carefully slide the pan into the oven; then, using a pitcher, fill the roasting pan with enough hot water to come halfway up the sides of the espresso cups. Cover the pan with plastic wrap (don’t worry&mdash;it can stand the heat) and poke two holes in two diagonally opposite corners. Bake the custards for about 40 minutes, or until the edges darken ever so slightly and the custards are set but still jiggle a little in the center when you shake them gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and let the custards sit in the water bath for 10 minutes. Peel off the plastic wrap, lift the cups out of the water and cool the custards in the refrigerator. (The pots de creme can be prepared a day ahead and, when cool, covered with plastic wrap and stored in the refrigerator.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> The pots de creme are at their best at room temperature, so remove them from the refrigerator and keep them on the counter for about 20 minutes before serving.</p>"}]}