{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["appetizers", "cheese", "cookbooks", "grilling", "Italian", "Mario Batali", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fresh Robiola Wrapped in Mortadella", "link": "https://www.seriouseats.com/recipes/2008/05/fresh-robiola-wrapped-in-mortadella-recipe.html", "description": "Mortadella is to bologna what Dom Perignon is to Andre Spumante. A thick Italian sausage studded with chunks of pork fat (and sometimes pistachios), mortadella has a delicate, smoky flavor often spiced with pepper, nutmeg, and coriander. In this recipe,...", "totalTime": "", "recipeYield": "12 individual packets", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["12 to 14 thin slices mortadella (about 8 ounces; see <a href=\"#note\">Note</a>) ", "12 ounces fresh robiola (or substitute fresh goat cheese or fresh ricotta) ", "12 fresh basil leaves", "3 cups young dandelion greens or other tender bitter greens ", "3 tablespoons extra-virgin olive oil ", "1 tablespoon red wine vinegar ", "Coarse sea salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas grill or prepare a fire in a charcoal grill. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay 12 slices of mortadella out on a work surface. Place 2 tablespoons of the cheese in the very center of each slice, shaping it loosely into a log running across the slice. Place a basil leaf on top of each mound of cheese. Fold the bottom of each slice over the cheese, then fold over the sides and roll the cheese up in the mortadella (like a burrito). Secure each one with a toothpick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the mortadella packets scam side up on the hottest part of the grill and cook until lightly charred on the bottom, about 2 minutes. Turn over and repeat all the second side, about 2 minutes longer. Transfer to a platter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, toss the dandelion greens with the olive oil and then the vinegar. Season with coarse sea salt and pile the greens over the hot and delightful mortadella packets. Serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"note\"></a><strong>Note:</strong> Try to get mortadella without pistachios; if the only mortadella you can buy does have nuts in it, some of them may fall out when it is sliced–if necessary buy one or two extra slices and use them to patch any holes in the 12 slices you need for the recipe.</p>"}]}