{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "Cook the Book", "hazelnuts", "Mollie Katzen", "shallots", "vegetables", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Brussels Sprouts with Shallots and Hazelnuts", "link": "https://www.seriouseats.com/recipes/2008/01/mollie-katzen-brussels-sprouts-with-shallots-and-hazelnuts-recipe.html", "description": "And here's the first of the recipes from Mollie Katzen's The Vegetable Dishes I Can't Live Without. I've been craving brussels sprouts after having had an appetizer similar to this one recently. Here, Katzen combines the sprouts with shallots and...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Healthy and Delicious", "Nuts", "Vegetarian"], "recipeIngredient": ["1 tablespoon extra-virgin olive oil or unsalted butter", "1 cup minced shallots (about 6 ounces)", "4 cups (1 pound) Brussels sprouts, halved or quartered lengthwise (or left whole, if small)", "1/2 teaspoon salt, or to taste", "Roasted hazelnut oil (optional)", "Freshly ground black pepper, to taste", "1/2 cup (or more) blanched hazelnuts, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a large saucepan of water on to boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, place a large, deep skillet over medium heat. After about a minute, add the olive oil or melt the butter and swirl to coat pan. Stir in the shallots, and cook, stirring frequently, for 3 to 5 minutes or until shallots turn deep golden color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water boils, reduce heat to low and add the Brussels sprouts. Simmer 2 to 3 minutes or until sprouts turn green and shiny and are beginning to become tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump sprouts into a colander in the sink; refresh under cold running water. Drain well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sprouts to the shallots, sprinkling with the salt. Stir until well combined, then spread the vegetables out to edges of the pan to make a shallow layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise heat for a few minutes, shaking pan a few times to redistribute the heat. This allows the juices to evaporate—and slightly scorches the vegetables—both of which serve to intensify the flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve hot or warm, with a light drizzle of roasted hazelnut oil, if available, and with sprinklings of black pepper and chopped hazelnuts.</p>"}]}