{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "Italian", "keywords": ["beef", "cookbooks", "grilling", "Italian", "mains", "Mario Batali"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Beef Braciole \"Pinwheel-Style\"", "link": "https://www.seriouseats.com/recipes/2008/05/beef-braciole-pinwheel-style-recipe.html", "description": "Braciole, a mainstay at Italian street fairs, is traditionally made with pounded cutlets of top round or veal. In some parts of Italy, they are simply grilled and topped with a flavorful sauce, while in others the cutlets are rolled...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Cook the Book", "Italian", "Mains"], "recipeIngredient": ["2 garlic cloves, finely minced 4 scallions, thinly sliced ", "1/4 cup chopped fresh Italian parsley ", "4 ounces thinly sliced salami, cut into 1/4-inch-wide matchsticks ", "8 ounces Italian Fontina, cut into 1/4-inch cubes ", "1/2 cup freshly grated Parmigiano- Reggiano ", "1/2 cup toasted bread crumbs ", "1/4 cup plus 3 tablespoons extra-virgin olive oil ", "One 10-inch-long beef tenderloin roast cut from the heart of the tenderloin (2 1/2 to 3 pounds), butterflied  ", "Kosher salt and freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the garlic, scallions, parsley, salami, Fontina, Parmigiano, and bread crumbs and mix well. Add 1/4 cup of the olive oil and mix well with your hands or a spoon. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Cut six 15-inch-long pieces of kitchen twine. Open out the beef; season on both sides with salt and pepper, and place it on a work surface so a long side is toward you. Spread the bread crumb mixture evenly over the beef, leaving a 1/2-inch border along the side farthest from you; press and gently pack the stuffing mixture onto the beef to keep it in place (you may have a little stuffing left over&mdash;it makes a great panini filling). Starting from the side nearest you, roll up the meat like a jelly roll, pressing any stuffing that falls out of the ends back into the roll, and tie tightly with the twine, spacing the ties evenly (it's easier if you have a friend to tie the beef while you hold the roll together). Wrap tightly in plastic wrap to make a compact roll, and place in the refrigerator for at least 2 hours, or as long as overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas grill or prepare a fire in a charcoal grill. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully unwrap the beef roll and, using a very sharp knife, cut it between the ties into six thick pinwheels. Brush gently on both sides with the remaining 3 tablespoons olive oil and season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently lay the pinwheels on the hottest part of the grill and cook, unmoved, for 5 to 7 minutes. Using a spatula, carefully turn each pinwheel over and cook for about 4 minutes longer for medium-rare. (Don't be alarmed if some of the cheese in the stuffing starts to melt and char on the grill, making kind of a savory Florentine-cookie-like thing; but if you find it charring too much, move the pinwheels to a slightly cooler part of the grill.) Transfer to a platter and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> To butterfly the beef, simply use a sharp knife to cut it horizontally almost but not all the way in half, starting from one of the long sides, so you can open it out like a book. </p>"}]}