{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080904-pork-chop-with-corn-salsa.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["corn", "grilling", "pork chops", "salsa", "Super Bowl mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Chili Rubbed Pork Chops with Corn Salsa", "link": "https://www.seriouseats.com/recipes/2008/09/grilling-chili-rubbed-pork-chops-corn-salsa-recipe.html", "description": "With September now upon us, I've been feeling that dreaded sensation that summer is coming to a close. In these last fleeting days I wanted to make good use of the seasonal harvest still around, deciding on a grilled corn...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Corn", "Grilling", "Mains", "Pork"], "recipeIngredient": ["4 pork rib chops, 1 1/2\" thick", "<strong>For the brine:</strong>", "1 quart of cold water", "2 tablespoons kosher salt", "2 tablespoons molasses", "<strong>For the rub:</strong>", "1 tablespoon paprika", "1 teaspoon chili powder", "1 teaspoon granulated garlic", "1 teaspoon onion powder", "1 teaspoon cumin", "1/2 teaspoon cayenne pepper", "1/2 teaspoon sugar", "1/2 teaspoon kosher salt", "1/4 teaspoon black pepper", "<strong>For the salsa:</strong>", "4 ears of corn, husked", "4 plum tomatoes, cored, seeded, and diced", "1 medium red onion, diced", "1 small jalapeño, seeded and diced", "3 heaping tablespoons of finely chopped cilantro", "3 cloves of garlic, minced", "Juice from 1 lime", "Kosher salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the brine, mix the salt and molasses in the cold water until completely dissolved.  Wash the pork chops and place in the brine, completely submerging them.  Brine the pork in the refrigerator for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pork is in the brine, mix all the ingredients for the rub together in a small bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork chops from the brine and wash in cold water.  Pat the chops dry with paper towels.  Liberally season each chop all over with the rub, wrap in foil, and place back in the refrigerator for 2 hours to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork chops from the refrigerator to allow them to come to room temperature.  Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and build a two zone fire, with a thin layer of coals on one side of the charcoal grate, and the rest piled on the other side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the ears of corn in tin foil and place on the hotter side of the grill.  Grill covered for 15 minutes, turning four times during cooking.  Remove the foil from the corn and continue to cook until lightly browned all over, about another five minutes.  Remove the corn from the grill and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork chops from the foil and place them on the hotter side of the grill.  Grill until each side is nicely browned, about 3 minutes per side.  Move the chops to the cooler side of the grill, cover, and continue to cook until an instant read thermometer registers 135 degrees in the thickest part of the chop.  Remove from the grill and tent with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the corn kernels into a medium bowl and discard the cobs.  Add the rest of the salsa ingredients and gently toss until well combined.  Taste and adjust seasoning with salt and pepper.  Remove the pork chops from the foil, top with the corn salsa, and serve.</p>"}]}