{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "desserts", "ice cream", "ice cream cookies", "Jonathan Waxman", "My Last Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Shortbread Ice Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2008/03/cook-the-book-shortbread-ice-cream-sandwiches.html", "description": "My Last Supper takes the old \"last bite on earth\" game to the next level by asking that question of 50 of the world's best-known and most-loved chefs. Though beautifully photographed and almost more of a coffee-table book in size...", "totalTime": null, "recipeYield": "about 6 sandwiches", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["3/4 pound (115 grams) butter", "1 cup (225 grams) plus 1/2 cup (110 grams) sugar", "I tablespoon (15 ml) vanilla ", "3 cups (680 grams) organic pastry flour, plus more for sprinkling", "3/4 teaspoon plus a pinch salt ", "4 egg yolks ", "1/2 cup (120 ml) milk ", "1/2 cup (120 ml) heavy cream (double cream)", "1 vanilla bean", "1/2 cup (110 grams) milk chocolate, chopped into small pIeces", "1 pint (560 grams) wild strawberries (when in season)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the shortbread cookies: </strong>Cream the butter and 1 cup (225 grams) sugar together in a mixing bowl, then add the vanilla. Mix in the flour and 3/4 teaspoon salt until just incorporated; don't overmix. Form the dough into 3-inch (8-cm) diameter cylinders, wrap them in plastic wrap, and chill them in the refrigerator 30 minutes. Slice the cylinders into disks 1/4 inch (1/2 cm) thick; sprinkle liberally with sugar. Bake the cookies in a 350&deg;F (175&deg;C) oven until golden but not too dark, 12 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the remaining 1/2 cup (110 grams) sugar, the egg yolks, and a pinch of salt in a small bowl. Whisk together until they are thoroughly mixed and the yolks are light in color. Set aside. Put the milk and cream into a small saucepan. Split the vanilla bean lengthwise and scrape the seeds into milk, add the vanilla pod. Carefully heat the milk mixture, stirring often, until it starts to boil. Set it aside to steep for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly whisk the hot milk mixture into the egg mixture. When they are combined and smooth, return the milk-egg mixture to the saucepan. Add the chocolate, and mix. Stirring continuously, heat the mixture over medium heat until it begins to thicken and easily coats the back qf a wooden spoon. Remove the vanilla bean. Transfer mixture into a bowl set in an ice bath. Stir  mixture until it is chilled, and then freeze it in an ice-cream machine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use 1/4 cup (60 ml) of ice cream per two cookies, form a sandwich, and chill. Serve with a bowl of wild strawberries (when in season).</p>"}]}