{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080523-cooksillustrated.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["cheese", "mains", "quesadilla", "Serious Eats Essentials", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Quesadillas", "link": "https://www.seriouseats.com/recipes/2008/05/essentials-quesadillas-recipe.html", "description": "My two main goals as a cook are to squeeze more vegetables into our diet and to master the essential dishes of French bourgeois and American home cooking. My husband’s two main goals as an eater are to convince me...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cheese", "Mains", "Serious Eats Essentials", "Vegetarian"], "recipeIngredient": ["2 8-inch flour tortillas", "2/3 cup (3 ounces) shredded Monterey Jack or cheddar cheese", "1 tablespoon minced pickled jalapenos (optional)", "Vegetable oil for brushing tortillas", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 10-inch nonstick or 12-inch cast-iron skillet over medium heat until hot, about 2 minutes. Place 1 tortilla in skillet and toast until soft and puffed slightly at edges, about 2 minutes. Flip tortilla and toast until puffed and slightly browned, 1 to 2 minutes longer. Slip tortilla onto cutting board. Repeat to toast second tortilla while assembling first quesadilla. Sprinkle 1/3 cup cheese and half of jalapenos, if using, over half of tortilla, leaving 1/2-inch border around edge. Fold tortilla in half and press to flatten. Brush top generously with oil, sprinkle lightly with salt, and set aside. Repeat to form second quesadilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put both quesadillas in skillet, oiled sides down, with their flat sides together so that together they fill the skillet; cook over medium heat until crisp and well browned 1 to 2 minutes. Brush tops with oil and sprinkle lightly with salt. Flip quesadillas and cook until second sides are crisp, 1 to 2 minutes. Transfer quesadillas to cutting board. Cool about 3 minutes—otherwise the cheese will all just ooze out, and you’ll burn your mouth if you try to eat them right away anyway. Halve each quesadilla and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finished quesadillas can be held on a baking sheet in a 200°F oven for up to 20 minutes.</p>"}]}