{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feature-dorie-gourmandise.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "Dorie Greenspan", "French", "Pierre Herme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Gourmandise", "link": "https://www.seriouseats.com/recipes/2008/02/baking-with-dorie-gourmandise-recipe.html", "description": "It's not easy to translate <strong><em>gourmandise</em></strong> from the French.  Strictly speaking, I guess it would be a delicacy or a treat, but the word, when applied to food, can also mean <em>greedy</em>.  It's a great word&mdash;I mean, how many of us haven't been <em>greedy</em> for the treats we love&mdash;and it's a great name for this dessert from <strong>Pierre Herme.</strong>", "totalTime": "", "recipeYield": "6 servings", "recipeCategory": ["Baking With Dorie"], "recipeIngredient": ["The dried pineapple (optional, <a href=\"#driedpineapple\">recipe below</a>)", "The tapioca (<a href=\"#tapioca\">recipe below</a>)", "The fresh pineapple (<a href=\"#freshpineapple\">recipe below</a>)", "Red currants or pomegranate seeds, optional", "1/4 pineapple", "Confectioner's sugar", "1 cup whole milk", "2 tablespoons sugar", "Strip of orange zest", "3 tablespoons small-pearl tapioca (<strong>not</strong> granulated or instant)", "1/3 cup heavy cream, boiled (it can be at room temperature)", "1 cup unsweetened coconut milk, at room temperature", "3/4 pineapple (the remainder of the pineapple from above), peeled", "2 tablespoons sweet orange marmalade", "Zest from 1 1/2 limes, removed with a zester (do not grate the zest)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the pineapple and cut 6 slices crosswise, core and all (save the rest of the pineapple, you'll be using it); ideally, the slices should be less than 1/8 inch thick.  (If you have a meat slicer, you'll find it's perfect for getting a very thin slice of fruit.)  Cut the core from each slice (this is easily done with a small cookie or biscuit cutter) and place the slices on a triple thickness of paper towels. Cover with three layers of paper towels and allow the pineapple to drain for an hour or two.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 200&deg;F.  Dust a nonstick baking sheet with a light coating of confectioner's sugar; have another baking sheet at hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For Dried Pineapple: </strong> Place the pineapple rounds on the baking sheet dusted with the confectioner's sugar, cover with the other baking sheet (it will serve as a weight) and bake for about 1 hour, with the oven door held slightly ajar with a wooden spoon, until the pineapple is dried.  Cool on a rack and then store in an airtight container.  (<em>The pineapple can be made a few days ahead and kept in a tin at room temperature, safe from humidity.  This same technique works for oranges, lemons, apples and pears</em>.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the Tapioca: </strong> Bring the milk, sugar and orange zest to a boil in a heavy-bottomed 2-quart saucepan.  Stirring constantly, add the tapioca in a slow, steady stream.  Reduce the heat to its lowest setting and cook the mixture, stirring frequently, for 20 to 25 minutes, or until the tapioca is soft and most of the liquid has been absorbed</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the boiled cream and coconut milk and, stirring constantly, cook over low heat for 3 minutes.  Turn the tapioca out into a bowl, press a piece of plastic wrap against its surface, and cool to room temperature.  When it is cool, wrap the tapioca airtight and refrigerate until thoroughly chilled, about 2 hours.  (<em>The tapioca can be refrigerated for up to two days</em>.)<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><Strong> For Fresh Pineapple: </strong> Quarter the pineapple from top to bottom and cut away the core.  Cut each quarter lengthwise into thin spears, then cut these long pieces crosswise into bite-sized spears.  Blot the pineapple free of excess moisture with paper towels and put the pieces in a bowl.  Add the marmalade and zest and toss until the mixture is well blended.  Cover and chill for at least 1 hour or for as long as a day.</p>"}]}