{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brussel sprouts", "cauliflower", "gratin", "thanksgiving", "Thanksgiving sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cauliflower and Brussels Sprout Gratin from 'Bon Appétit'", "link": "https://www.seriouseats.com/recipes/2008/10/cauliflower-and-brussels-sprout-gratin-from-bon-appetit.html", "description": "When we talked to Bon Appétit editor in chief Barbara Fairchild about the November 2008 issue of the magazine, we asked her what her favorite Thanksgiving recipes from the issue were. Here's another gratin. The pine nuts bring out the...", "totalTime": "", "recipeYield": "Makes 10-12 servings", "recipeCategory": ["Cauliflower", "Sides"], "recipeIngredient": ["1 1/2 pounds Brussels sprouts, trimmed, quartered lengthwise through core", "1 1 1/2- to 1 3/4-pound head of cauliflower, trimmed, cut into small florets", "2 3/4 cups heavy whipping cream", "1/2 cup chopped shallots", "1 tablespoon chopped fresh sage", "1 1/2 tablespoons olive oil", "1/2 cup plain dry breadcrumbs", "1/2 cup pine nuts, lightly toasted", "2 tablespoons chopped fresh Italian parsley", "3 cups grated Parmesan cheese, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill large bowl with ice and cold water. Cook Brussels sprouts in large pot of generously salted boiling water 2 minutes. Add cauliflower to same pot; cook until vegetables are crisp-tender, about 3 minutes longer. Drain. Transfer vegetables to bowl of ice water to cool. Drain well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cream, shallots, and sage in large saucepan. Bring to boil. Reduce heat; simmer until mixture is reduced to 2 1/2 cups, about 10 minutes. Season with salt. Remove from heat. Cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in large nonstick skillet over medium heat. Add breadcrumbs; stir until beginning to brown, about 2 minutes. Transfer to bowl; cool. Stir in pine nuts and parsley. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter 13x9x2-inch glass baking dish; arrange half of vegetables in dish. Sprinkle with salt and pepper, then 1 1/2 cups Parmesan. Arrange remaining vegetables evenly over, then sprinkle with remaining 1 1/2 cups Parmesan. Pour cream mixture evenly over. Breadcrumb topping and gratin can be made 1 day ahead. Cover separately and chill. Bring to room temperature before continuing.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Cover gratin with foil. Bake covered 40 minutes. Uncover; sprinkle breadcrumb topping over and bake uncovered 15 minutes longer.</p>"}]}