{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cook the Book", "O magazine", "The Oprah Magazine Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Seared Tuna with Fresh Corn and Wasabi 'Cream'", "link": "https://www.seriouseats.com/recipes/2008/04/seared-tuna-with-fresh-corn-and-wasabi-cream-recipe.html", "description": "Today's Cook the Book, highlighting the recipes in the upcoming Oprah Magazine Cookbook, is for Seared Tuna with Fresh Corn and Wasabi 'Cream'. It made its way into Oprah's hands via Rozanne Gold, who began her career as personal chef...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 large ears corn, shucked and kernels removed (about 2 cups)", "Salt ", "1 teaspoon wasabi paste ", "Four (8-ounce) fresh tuna steaks, about 3/4 inch thick "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To a small saucepan with 1 3/4 cups water, add 1 1/2 cups corn kernels and a large pinch of salt. Bring to a boil; lower heat and cook until very soft, about 20 minutes. Place corn and cooking liquid in a blender; puree until very smooth, adding several tablespoons water if too thick. Strain through a coarse-mesh sieve into a small bowl. Stir in wasabi paste. Add salt to taste. Makes about 1 cup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place remaining 1/2 cup corn kernels in a saucepan with enough water to cover. Cook over medium heat for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, rub salt into both sides of tuna steaks. Coat a large nonstick skillet with cooking spray. Heat skillet over medium-high heat until hot. Add tuna and sear each side, about 3 minutes. Remove tuna from heat and place on a platter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat sauce, adding salt to taste. Drain corn. Pour sauce over fish and scatter cooked corn on top. Serve immediately.</p>"}]}