{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["beef", "hamburgers", "mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Glazed Doughnut Bacon Egg Cheeseburgers", "link": "https://www.seriouseats.com/recipes/2008/11/glazed-doughnut-bacon-egg-cheeseburgers-recipe.html", "description": "Because cheeseburgers are awesome and doughnuts are awesome, Chris Zelenak submitted this glazed doughnut bacon egg cheeseburger recipe to us. Read more about it on A Hamburger Today or go straight to the recipe!...", "totalTime": "", "recipeYield": "about three burgers per pound of beef", "recipeCategory": [], "recipeIngredient": ["Two glazed donuts per patty", "One egg per patty, fried, as a burger topping  (note: for egg-in-a-hat style you'll need to carve out some extra space in the doughnut, but it fries pretty well)", "Two pieces bacon per patty", "Maple Syrup (1/2 cup per pound beef)", "Kosher Salt (approx 1 tablespoon per pound beef)", "Fresh Basil (1/2 cup per pound beef)", "Worcestershire sauce, to taste", "Red pepper flakes, to taste", "Full egg (1 per pound beef); this will be mixed in with the beef, not fried as the egg above"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all together with beef to form patties.  I was in a rush to get all this done in the lunch hour, but when I make burgers normally I also try to save some kosher salt to coat the outside of the burger, so that it will form a crispy / salty crust (I say crust, but it's barely noticeable&mdash;I do it more for the idea, I think) on the outside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the doughnuts, I shaved off the top part of each doughnut to allow for an easier grilling time for myself, as well as a less messy experience eating the burger.  That was my hope, at least, though after all is said and done, this much shit on a burger is gonna be messy regardless. </p>"}]}