{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "mussel", "mussels", "risotto", "Second Helpings of Roast Chicken", "Simon Hopkinson"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mussel Risotto", "link": "https://www.seriouseats.com/recipes/2008/11/mussel-risotto-recipe.html", "description": "Today, mussels are one of the easiest types of seafood to prepare. Most varieties are cultivated on environmentally responsible farms and can be purchased squeaky clean, without a dead one in the bunch. But Simon Hopkinson, author of this...", "totalTime": "", "recipeYield": "2 servings", "recipeCategory": ["Clams, Mussels, and Oysters", "Cook the Book", "Rice"], "recipeIngredient": ["2 onions, peeled and chopped", "4 tablespoons olive oil", "3/4 cup dry white wine", "2 1/4 pounds mussels, cleaned and debearded", "2/3 cup light chicken stock", "2 very ripe, large fresh tomatoes, peeled, cored, seeded, and chopped", "1/2 cup Carnaroli rice, or other rice suitable for risotto", "1 clove of garlic, peeled and very finely chopped", "1 tablespoon chopped parsley", "A pinch of dried chilli flakes", "A little salt, if necessary", "1 tablespoon softened butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before you do anything at all, have ready a large colander suspended over a pan and in the sink. Soften half the onion with half the olive oil in a large pan that will accommodate the mussels. Turn up the heat, pour in the wine, add the mussels, shake the pan about a bit, and put on the lid, still over a high heat. After about 2 minutes, remove the lid and shake and toss the mussels so that those initially underneath now appear on top; you will notice, from this action, that the mussels underneath have already started to open. Replace the lid, cook for a further 2 to 3 minutes and then repeat the shaking and tossing motion. Depending upon strength of heat, you may have to do this once more, but if it looks as if most of the mussels are now open, tip the whole panful into the colander in the sink. Leave to drain for at least 5 minutes, giving the colander an occasional shake to ensure that all the remaining juices drip through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the mussels are cool enough to handle, extract all the meat from their shells and collect it in a bowl. Cover and set aside. Take the mussel-cooking liquor that has now collected beneath the colander and strain it through a very fine sieve into the stock. Pour this mixture into a pan and place over very low heat to keep hot, but not to boil. (You may not necessarily use all of this; any leftover can, of course, be frozen for a subsequent occasion.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an entirely new solid-bottom pot, heat the remaining olive oil. Soften the remaining onion in this and then add the tomatoes. Briskly cook together for a few minutes until reduced to a sloppy paste. Add the rice and stir around in the tomato mess until thoroughly coated with it. Introduce the first ladle of the hot stock and vigorously stir in. Only consider adding a second ladle once this has been fully absorbed. And so on, until the rice is nearly cooked; taste a grain: it should still possess \"bite.\"</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now add the shelled mussels and stir in, together with what should, hopefully, be the final ladleful of stock. Sprinkle in the garlic, parsley, and chilli flakes and carefully fold everything together, while also making sure that you do not pulverize the naked mussels, which are now fragile, having been robbed of their protective shells. Taste for salt&mash;probably not necessary&mdash;and finally stir in the spoonful of softened butter. Cover the pot with a lid and leave to settle for 5 minutes. Serve from the pot at a table, directly onto hot plates. </p>"}]}