{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081027-chickendivan.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["broccoli", "casseroles", "chicken", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Chicken Divan Hand Pies", "link": "https://www.seriouseats.com/recipes/2008/10/chicken-divan-hand-pies-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by the book coauthored by the two, Almost Meatless, due out in spring...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken"], "recipeIngredient": ["2 tablespoons butter", "1 shallot, minced", "2 tablespoons flour", "2 cups whole milk, hot", "1/2 cup grated cheddar ", "Pinch of cayenne ", "Salt and pepper to taste ", "5 cups (13 ounces) broccoli florets", "1 chicken breast half, poached (or leftover from a roast or rotisserie chicken) and diced (about 2 cups diced) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter a medium saucepan over medium heat, and then add the shallot. Cook for 3 to 5 minutes, or until shallot softens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour and reduce heat to low, stirring briskly to coat with the butter and cook until just golden, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the hot milk and whisk constantly, making sure there are no lumps.Cook over low for about 10 minutes, until the sauce is thick. Whisk in cheese, cayenne and salt and pepper to taste. (It should be liberally seasoned since the sauce seasons the broccoli and chicken, too.) Stir in chicken and broccoli. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Work with one piece of pie dough at a time, keeping the others under a sheet of plastic wrap to prevent drying. Roll out each piece into an 8-inch circle. Fill with 1/6 of the chicken-broccoli mixture, then fold half of the dough over, forming a semicircle. Crimp the edges with a fork to seal, and use a sharp knife to create three small vents for steam. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As each pie is formed, place it on an unrimmed baking sheet lined with a silicone mat or parchment paper. Keep these covered with a sheet of plastic wrap to prevent drying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake pies for 25 to 30 minutes, rotating the baking sheet half way. Let the pies rest for at least five minutes for cutting. Cooled pies can be frozen for up to 6 months. </p>"}]}