{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["bread pudding", "classic cookbooks", "desserts", "Joy of Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Bread Pudding", "link": "https://www.seriouseats.com/recipes/2008/03/classic-cookbooks-joy-of-cooking-bread-pudding-recipe.html", "description": "For me, one of the pleasures of being a young adult was discovering that many of the foods I had rejected as a child were actually edible and, in fact, rather tasty. My mother says I wasn’t a picky eater,...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Bread Pudding", "Classic Cookbooks", "Desserts"], "recipeIngredient": ["Butter for greasing the baking dish", "12 to 16 ounces white bread, stale but not hard, crusts removed, cut into 1/2 inch cubes", "3/4 cup raisins (optional)", "4 large eggs", "3/4 cup sugar", "1 teaspoon vanilla", "1 teaspoon ground cinnamon", "1/2 teaspoon freshly grated or ground nutmeg", "1/2 teaspoon salt", "3 cups whole or low-fat milk", "Turbinado sugar (optional)", "Whipped cream, milk, or heavy or light cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 2-quart baking dish. Spread the bread cubes in the prepared baking dish. (My bread was fresh, so I first put the cubes in a 200°F oven for 15 minutes to make them a little less soft. I can’t say whether this was strictly necessary.) If you are using the raisins (I did not), scatter them over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly whisk together the eggs, sugar, vanilla, cinnamon, nutmeg, and salt. (I used 1/2 cup white sugar and 1/4 cup brown because I love brown sugar. Also, I didn’t have any nutmeg and didn’t miss it.) Whisk in the milk. Pour this mixture over the bread and let stand for 30 minutes, periodically pressing the bread down to help it absorb the liquid. Preheat the oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a rack, a folded dishtowel or a couple of paper towels in the bottom of a baking dish or roasting pan large enough to hold the dish of bread pudding. Set the bread pudding atop the rack or towel and prepare a kettle full of hot but not boiling water. (I scattered turbinado sugar over the surface of my pudding at this point.) Open the oven, set the nested pans on a rack, and quickly pour the scalding water into the outer pan so that it reaches 1/2-2/3 up the outside of the bread pudding pan. Bake until puffed and firm in the center, about 1 1/4 hours. Serve warm or cold with the whipped cream, milk, or cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pudding can be made several days ahead. Cover with aluminum foil and refrigerate. To reheat, bake for 15 minutes in a 325°F oven. </p>"}]}