{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["baking", "brunch", "scones", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Cape Cod Scones", "link": "https://www.seriouseats.com/recipes/2008/09/sunday-brunch-cape-cod-scones.html", "description": "There are so many bad scones in the world that it's easy to forget how good a scone can be. These scones, adapted from Lora Brody's nifty book Cape Cod Table, are light, moist, and addictive. It takes a great...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Breakfast and Brunch", "Vegetarian"], "recipeIngredient": ["2 cups all-purpose flour, measured after sifting", "1 tablespoon baking powder", "3/4 teaspoon salt", "1/3 cup granulated sugar", "1/2 cup dried blueberries, strawberries, or cranberries", "1 1/4 cups heavy cream", "Coarse sugar for sprinkling on tops"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425 degrees with the rack in center position.  The scones will bake on a ungreased heavy-duty baking sheet. Into a medium-size mixing bowl, sift the flour, baking powder, salt, and sugar.  Use a table fork to mix well.  If you are adding dried berries, stir them in at this point.  Dribble the cream over the dry ingredients while mixing with the fork.  Continue mixing gently just until the mixture forms a rough, sticky ball of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough onto a lightly floured work surface, sprinkle lightly with flour, knead 10 times by pushing the half closer to you down and away from you with the heel of your hand and fold it back over itself, giving it a quarter turn each time.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the dough into a 9-inch disk.  Brush the top with melted butter and sprinkle generously with coarse sugar.  Use a long knife to cut the dough into 12 wedges and transfer each to the baking sheet, leaving about 1 1/2 inches between them.  Bake for 15 to 17 minutes, until the tops are golden brown.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm with big glasses of cold milk.</p>"}]}