{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["artichokes", "gluten free", "grilling", "recipe newsletter", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Artichokes with Mint and Chiles", "link": "https://www.seriouseats.com/recipes/2008/05/grilled-artichokes-with-mint-and-chiles-recipe.html", "description": "The following recipe is from the May 21st edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! In this recipe, taken from Mario Batali Italian Grill, fresh artichokes are simmered in a combination...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Vegetarian"], "recipeIngredient": ["6 large artichokes, preferably with stems", "2 lemons, halved", "1 bunch mint, chopped, stems and all, plus about 1/4 cup fresh mint leaves cut into chiffonade (thin slivers)", "6 garlic cloves, thinly sliced", "1 cup extra-virgin olive oil", "1 cup dry white wine", "2 to 4 red jalapeños, diced or thinly sliced", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with about 6 cups of water and add the juice of 1 1/2 of the lemons; add the 3 lemon halves too. Snap off the tough outer leaves from one artichoke until you come to the leaves that are pale yellow toward the bottom. Cut off the top 1 inch of the leaves. As you work, rub the cut surfaces with the remaining lemon half. Trim off the bottom of the stem and, using a paring knife, trim away the tough outer layer from the stem. Trim any dark green parts from the bottom of the artichoke. Halve the artichoke lengthwise and, using a grapefruit spoon or small sharp spoon, remove the fuzzy choke. Pull out the small purple inner leaves. Put the trimmed artichoke in the bowl of lemon water, and repeat with the remaining artichokes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chopped mint, garlic, olive oil, and wine in a large pot. Add the artichokes and the lemon water, along with the lemon shells, then add more water if necessary to cover the artichokes. Put a pan lid on top of the artichokes to keep them submerged and bring to a boil over high heat. Reduce the heat, cover, and simmer until just tender, 15 to 20 minutes, depending on the size of the artichokes. Drain and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas grill or prepare a fire in a charcoal grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the artichokes cut side down over the hottest part of the grill and cook, unmoved, for 3 to 5 minutes, until nicely charred. Turn and cook for 5 minutes more, or until golden brown on the second side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the artichokes on a platter and strew with the remaining mint and the jalapenos. Serve with a bowl of coarse salt. Preheat a gas grill or prepare a fire in a charcoal grill.</p>"}]}