{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081224BrisketBourguignon.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Kosher", "keywords": ["boeuf Bourguignon", "brisket", "hanukkah", "hanukkah entrees", "hanukkah mains", "holidays"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brisket Bourguignon", "link": "https://www.seriouseats.com/recipes/2008/12/the-fifth-night-of-hanukkah-brisket-bourguign.html", "description": "There is nothing brisk about brisket: It takes four hours to cook. The good news is that all the work in this recipe takes about 30 minutes, chopping included, and then you just turn your back on the meat and...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Kosher", "Mains"], "recipeIngredient": ["1 three-pound brisket", "1 bottle of dry red wine, preferably Burgundy", "Salt and pepper", "1 tablespoon flour", "2 tablespoons olive oil", "3 slices of thick-sliced, center cut bacon, roughly diced (for a kosher brisket, substitute the bacon with 1-2 tablespoons olive oil)", "8 ounces sliced mixed mushrooms, including oyster, shitake, and cremini", "2 large onions, cut into thick rings", "6 carrots, cut into 1-inch pieces on the diagonal", "2 cloves garlic, chopped", "5 sprigs thyme", "1 bay leaf", "1/3 cup cognac", "1 tablespoon tomato paste", "2 cups beef stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the beef brisket into a glass baking dish or a large sealable plastic bag, and cover with the entire bottle of red wine, making sure that the wine saturates every inch of the meat.  Cover, and return to the refrigerator to marinate for at least 2 hours, to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the meat out of the fridge while you chop the vegetables, to give it time to take the chill off before it hits the hot pan.  Take the meat out of the wine, but reserve the marinade to use as cooking liquid.  Pat the brisket dry with paper towels.  Then, season the meat liberally with salt and pepper, and dust with the flour, shaking off any excess.  In a large dutch oven, heat the olive oil on medium-high heat, and add the brisket.  Brown on one side for 3 to 4 minutes, flip, and brown the other side.  Remove the meat from the pan, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bacon to the hot pan, and render it down for 2 to 3 minutes, until it gives off some fat, but does not begin to crisp.  Then add the mushrooms, onions, carrots, garlic, thyme, and bay, and season with salt and pepper.  Sauté for 10 minutes, until the onions start to become translucent, and the mushrooms soften.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cognac from the bottle into a separate glass, and add the cognac from that glass into the pan (this process reduces the risk of flare-ups).  Deglaze the bottom of the pan as the cognac simmers and begins to evaporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the tomato paste, reserved wine, and beef stock.  Nestle the brisket into the cooking liquid, down into the vegetables, and bring the wine broth to a simmer.  Lower the heat to the lowest it will go, cover the pot, and allow to cook for 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 4 hours, remove the brisket from the pot, allow to rest for a few minutes, and slice thinly against the grain.  Serve with the vegetables and braising liquid.</p>"}]}