{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["apples", "brunch", "Dolce Italiano", "eggs", "Gina DePalma", "omelets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch:  Sweet Apple Omelet", "link": "https://www.seriouseats.com/recipes/2008/12/sunday-brunch-sweet-apple-omelet.html", "description": "This unusual sweet apple omelet recipe I've adapted from Babbo pastry chef and Serious Eats pal and contributor Gina DePalma's fantastic book Dolce Italiano. I use Honeycrisp apples, everyone's current fave these days, instead of Gina's recommended Golden Delicious, Rome,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Apple"], "recipeIngredient": ["2 medium honey crisp apples ", "3 tablespoons extra-virgin olive oil", "2 tablespoons granulated sugar", "1/4 teaspoon ground cinnamon", "1 tablespoon grappa (optional)", "2 tablespoons unsalted butter", "1 tablespoon honey", "4-5 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and core the apples, cut them into quarters, then cut the quarters into slices.  Heat a large saute pan over medium heat and add the olive oil, followed by the apples. Saute the apples until they just begin to turn soft, translucent, and tender, about 5 minutes. Add the sugar and cinnamon to the pan, shaking to coat the apples. remove the an from the heat and slowly add the grappa, then return the pan to low heat and let the apple mixture simmer for 2 to 3 minutes to cook off the alcohol and tenderize the apples.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a medium bowl and whisk them until the yolks and whites are combined. In a nonstick 10-inch omelet pan, melt the remaining 1 tablespoon butter over medium heat, swirling it around to coat the bottom completely. When the butter begins to bubble, add the eggs. Use a fork or spatula to pull any cooked egg toward the center of the pan while tilting the pan to move uncooked egg to the edges. Continue moving the eggs around gently until all the eggs are cooked, 2 to 3 minutes. Very quickly, spoon some of the cooked apples into the center of the omelet in a straight line spanning the diameter of the omelet. Shake the pan to loosen the omelet completely, then fold one side of the omelet over the apples. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, cutting the omelet into 2 large halves or 4 smaller quarters.</p>"}]}