{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080218brickchicken.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Brick Chicken", "link": "https://www.seriouseats.com/recipes/2008/02/dinner-tonight-brick-chicken.html", "description": "What most people want in a roast chicken is crispy skin and succulent meat. Is it too much to ask? They want the leg to be done cooking before the breast gets tough; they want the skin to be as...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Dinner Tonight", "Roasting"], "recipeIngredient": ["1 small chicken, no more than 3.5 pounds", "Selection of chopped fresh herbs (marjoram and rosemary are good)", "Olive oil", "Salt and pepper", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse your chicken and dry it very well.  Wearing latex gloves, spatchcock the chicken, which involves cutting out the backbone (not the breastbone) with a sharp knife or heavy kitchen scissors.  Once the backbone is removed, turn the chicken over and press down on the breastbone gently until the chicken flattens out (you might hear some cracking).  Alternatively, your butcher would be happy to do this for you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Salt the chicken liberally and press the herbs onto its skin, and perhaps some lemon zest if you feel fancy.  Heat an oven-safe heavy skillet (it must be a heavy skillet&mdash;cast iron is perfect, nonstick won't work) over medium-high heat with a decent coating of oil.  When the oil is almost smoking, carefully lay the chicken into the skillet so that it fits snugly.  Tuck the legs in if possible.  Weight it using either bricks wrapped in tin foil, or a second skillet filled with cans.  The second skillet must have a large bottom so that all of the chicken skin is pressed against the hot surface; otherwise, you'll have super-crispy skin only in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to medium-low (there should be an insistent popping noise throughout) and cook for about 20 minutes.  In the meantime, preheat the oven to 375&deg;F.  After 20 minutes, check on the chicken skin: it should be bronze and golden.  Be careful that it doesn't all stick to the pan when you do: a wooden spoon scraping can help you lift it from the pan still attached to the chicken.  If not crispy, increase the heat and cook another 5-10 minutes until it is.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip the chicken over so that it's skin-side up and cook in the oven an additional 10-15 minutes, or until the juices run clear or the thigh meat is a safe temperature.  I like to make a quick sauce in the skillet after removing the chicken to rest with the juice of one lemon.</p>"}]}