{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081213HANUKKAHBlueberryCrepeBlintzes.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Kosher", "keywords": ["blintzes", "blueberries", "crepes", "fromage blanc", "hanukkah", "hanukkah sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fromage Blanc and Blueberry Crepe Blintzes", "link": "https://www.seriouseats.com/recipes/2008/12/fromage-blanc-and-blueberry-crepe-blintzes-recipe.html", "description": "Christians have Blitzen; Jews have blintzes. Close, but not quite the same thing. The first is a reindeer, while the second is a traditional Jewish dish in which thin pancakes encase a creamy filling of cheese or fruit. I think...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Blueberry", "Crepe", "Kosher"], "recipeIngredient": ["1 1/2 cups ricotta cheese", "1/2 cup fromage blanc", "Zest of 1 lemon", "3 1/2 tablespoons of sugar", "1 egg", "10 bought Breton crepes", "12 ounces thawed frozen blueberries", "1 1/2 tablespoons sugar", "2 teaspoons flour", "Juice of 1/2 lemon", "1 teaspoon of butter, for sautéing the blintzes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat the ricotta cheese, fromage blanc, lemon zest, sugar, and egg with a hand mixer for 30 seconds, until it is combined and slightly lightened.  If you cannot find fromage blanc, substitute cream cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you buy Breton crêpes, they are very thin, large rounds, folded in half.  Keep them folded, and place the rounded edge at facing up on the counter.  Then, trim about 3/4 inch from the left and right sides, so you have blunt edges, instead of the points of the fold.  You can skip this step; it is simply aesthetics.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each crêpe, spoon about 1/4 cup of the cheese filling just to the right of center, in a vertical stripe that does not quite reach the north and south edges of the crêpe.  Then fold the top and bottom of the crêpe so that it just tucks over the cheese filling, and then fold the right side over the filling, and roll toward the left, so you get a rectangular “blintz” pocket.  Continue for all 10 crêpes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a large sauté pan on medium-high heat, and sauté the blintzes 2 minutes per side, just to crisp them.  Transfer the blintzes to a baking sheet, and bake for 8 minutes at 400 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the blueberries, lemon juice, 1 1/2 tablespoons sugar and 2 teaspoons flour in a saucepan over medium high heat.  Simmer for the 8 minutes that the blintzes are in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The blintzes should be golden, and the egg in the cheese filling will have set slightly.  Plate the blintzes, serving the blueberry sauce alongside.</p>"}]}