{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["chinese food", "Cook the Book", "lobster", "Michael Tong", "The Shun Lee Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lobster Cantonese", "link": "https://www.seriouseats.com/recipes/2008/08/lobster-cantonese-recipe.html", "description": "In the 1940s and 50s, many Chinese restaurants in America served a dish known as Lobster Cantonese. Composed of a deep-fried lobster drowning in goopy sauce, it was hardly authentic. In the 1980s, Michel Tong reintroduced Lobster Cantonese at his...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Lobster and Crab", "Mains"], "recipeIngredient": ["One 1 1/2-pound uncooked lobster, cut into 12 pieces", "3 tablespoons cornstarch", "Vegetable oil, for passing through", "<strong>Sauce</strong>", "1 1/2 tablespoons soy sauce", "2 tablespoons rice wine or dry sherry", "2 teaspoons sugar", "3 scallions, white parts trimmed and sliced into 1/2-inch pieces, green parts trimmed and sliced into 2-inch pieces", "1 tablespoon peeled and minced fresh ginger", "3 garlic cloves, peeled and very thinly sliced", "30 fermented Chinese black beans, lightly crushed with a cleaver and minced ", "1/2 teaspoon dark sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the lobster with the cornstarch in a medium bowl. Heat a large wok over medium high heat. Add enough oil to come 1 inch up the sides of the wok, and heat it to 325ºF. In batches without crowding, add the lobster and stir gently until the shells turn bright red, about 1 to 1 1/2 minutes. Using a wide, wire-mesh strainer, transfer the lobster to a colander. Discard all but 2 tablespoons of the oil from the wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To begin the sauce, mix the soy sauce, rice wine, and sugar in a small a bowl, stirring to dissolve the sugar. Set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the wok with the oil to high heat. Add the white scallion pieces along with the ginger, garlic, and black beans. Stir-fry for 10 seconds. Add the lobster, then the soy sauce mixture. Stir-fry for 45 seconds. Add the green scallion pieces, and stir-fry until the sauce is glossy and the lobster is cooked through, about 45 seconds. Add the sesame oil. Serve immediately.</p>"}]}