{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080606-shrimp-thumb.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["fast", "Mark Bittman", "Serious Eats Essentials", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Fast Food, Bittman's Way, with Shrimp", "link": "https://www.seriouseats.com/recipes/2008/06/mark-bittman-shrimp-my-way-recipe.html", "description": "©iStockphoto.com/Juanmonino In the past few months Mark Bittman’s shrimp “my way” has become one of my favorite emergency or late-in-the-week meals. This superfast dish is good with a vegetable, on top of rice, or over angel hair pasta. I think...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Serious Eats Essentials", "Shrimp"], "recipeIngredient": ["1/2 cup extra-virgin olive oil", "3 or 4 big cloves garlic, cut into slivers", "1 1/2 to 2 pounds shrimp, in the 20-30 per pound range, peeled, rinsed, and dried", "Salt and freshly ground black pepper to taste", "1 teaspoon ground cumin", "1 1/2 teaspoons fresh spicy paprika", "Minced fresh parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler and slip an oven rack into the closest possible position.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the olive oil very gently in a large, broad, ovenproof skillet or baking pan. There should be enough olive oil to cover the bottom of the pan; don’t skimp. Put the garlic in the oil and cook for a few minutes, still over low heat, until it turns golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise the heat to medium-high and add the shrimp, salt, pepper, cumin, and paprika. Stir to blend and immediately place under the broiler. Cook, shaking the pan once or twice and stirring if necessary, but generally leaving the shrimp undisturbed, until they are pink all over and the mixture is bubbly. This will take from 5 to 10 minutes, depending on the heat of your broiler. Garnish and serve immediately.</p>"}]}