{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080920inseason-apples2.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["An Apple a Week", "apples", "fall", "pastries", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "An Apple a Week: Tarte Fine aux 'Picked' Pommes", "link": "https://www.seriouseats.com/recipes/2008/10/apple-tarte-fine-aux-picked-pommes-recipe.html", "description": "Editor's Note: Each week in October, we'll have an apple-focused recipe for you. Because as the doctor always said, an apple a week is, well, delicious. We start with a French-inspired pastry that's still as American as apple pie. Photograph...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Apple", "Desserts"], "recipeIngredient": ["6 fresh-picked apples, of a variety of colors, but all about the same size", "1 prepared pie crust, thawed but cold", "cup of water", "1/2 cup of sugar", "2 tablespoons of heavy cream", "1 pinch of apple pie spice", "1 pinch of salt", "<h5>Special Equipment</h5>", "A 13x3” (or other long rectangular) fluted nonstick tart pan with a removable bottom"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the pie crust so that if it is draped into the rectangular fluted pie tin, it fits over the two longer sides with plenty of extra drape.  You do not want the crust too thin, or it will not be able to support the caramel.  Trim the long sides, and use the excess to drape the shorter sides.  Trim any excess.  Simply press at the seams to seal them.  I assure you, this sounds very complicated until you actually do it, and see how it obvious it is!  Put the crust back in the fridge while you work on the apples.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the apples: halve them, core them, and then halve them again.  Then, using a mandoline on a .75 mm setting (any thin setting will do), slice the apples.  If you are handy with a chef’s knife, you could certainly do the slicing by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, on the stove, make the caramel by bringing the water and sugar to a boil.  Allow it to simmer on medium heat for 10 minutes, until it starts to turn the color of, well, caramel.  Turn off the heat, and add the salt, apple pie spice, and 2 tablespoons of cream.  Stir to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the crust out of the refrigerator, and arrange the apples.  The pattern is a bit like a chevron: just create a layer of overlapping apple slices going one way the short side across, then overlap the same kind of layer going the opposite way, all the way down the tart.  Repeat with a second layer covering the first.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the caramel over the top, and bake for 30-35 minutes, until the crust is golden, and the apples soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool in the pan on a cooling rack for at 15 minutes.</p>"}]}