{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080509-lidia.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "Italian", "keywords": ["Italian", "Lidia Bastianich", "Mother's Day", "octopus", "potatoes", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mother's Day with Lidia Bastianich", "link": "https://www.seriouseats.com/recipes/2008/05/lidia-bastianich-octopus-and-potato-salad-recipe.html", "description": "The first serious chef I think of when I think about Mother's Day is Lidia Bastianich. Lidia is the proud mother of Joe Bastianich, restaurateur, vintner, and food businessman extraordinaire, and of Tanya Bastianich Manuali, her travelmate on the Lidia's Italy television series. She's also a grandmother of five and the devoted daughter of her mom, Erminia, who escaped from a refugee camp with Lidia 40 years ago. So I figured I'd ask Lidia how she's celebrating Mother's Day.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Italian", "Other Seafood", "Potato", "Salads"], "recipeIngredient": ["1 1/2 to 2 pounds octopus, cleaned", "1 wine cork", "2 bay leaves", "Salt and pepper to taste", "2 medium Idaho potatoes, whole", "5 tablespoons olive oil", "3 tablespoons red wine vinegar", "1 Bermuda onion, thinly sliced", "2 tablespoons chopped Italian parsley", "Lemon wedges for garnish", "1 1/2 pounds fresh asparagus spears", "1/2 cup extra-virgin olive oil plus more for serving", "4 plump garlic cloves, crushed and peeled", "2 cups potatoes, peeled and cut in 1/2-inch cubes", "3 cups chopped leek, 1/4-inch white and green pieces", "5 quarts water", "2 bay leaves", "1 tablespoon coarse sea salt or kosher salt plus more to taste", "1 cup Arborio rice", "Freshly ground black pepper to taste", "1 cup freshly grated Parmigiano-Reggiano or Grana Padano", "<h5>Recommended Equipment</h5>", "A heavy-bottomed 6-quart saucepan or soup pot, with a cover"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the octopus, wine cork, bay leaves, and salt and pepper in a large pot with water. Cover generously and bring to a boil. Reduce the heat and cook the octopus at a vigorous simmer until tender but slightly al dente, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a second pot, cover the potatoes with cold water and bring to a boil. Cook about 25 minutes, until just tender, then cool, peel, and cut into 1\" cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the octopus, discarding the bay leaves and cork.  Cut the tentacles away where they join the head and, if desired, strip away the skin and suction cups by drawing the tentacles through the bunched fingers of one hand.  Clean the octopus head by squeezing out the core with your fingers, and cut the meat into thin slices. Cut the tentacles into 1\" pieces, and toss the octopus pieces with the warm potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss in the olive oil, red wine vinegar, onion, and parsley.  Place on a plate, garnish with lemon wedges and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 4 quarts of soup, serving 8 -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the asparagus and snap off the tough bottom stubs. Slice the spears crosswise into 1/3-inch chunks, including tips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1/3 cup of olive oil into the pot, drop in the crushed garlic and turn on a medium-high flame. Golden the garlic for a minute or 2, just until fragrant and lightly colored, and stir the potato cubes in the hot oil. Cook, stirring now and then, until the potatoes are crusty and starting to stick to the bottom but not browned—lower the heat if necessary—4 or 5 minutes. Stir in the chopped leeks and cook until softened and sizzling, 3 or 4 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the 5 quarts water into the pot, drop in the bay leaves and tablespoon salt, and stir well, scraping up any crusty potatoes on the bottom. Cover and bring to the boil over high heat. Stir in all the cut asparagus, return to the boil and adjust heat to keep the broth bubbling steadily and slowly reducing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook uncovered for about 1 1/2 hours, stirring occasionally, until the soup volume is reduced by almost 1/3 and the broth is full of flavor—tasting is the way to test for doneness. Stir in the rice, return to the boil and cook for 10 minutes, until the grains are al dente, then turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season with freshly ground black pepper and more salt to taste. Stir in 2 tablespoons fresh olive oil and 1/2 cup grated cheese. Serve immediately in warm bowls, with more cheese and oil at the table.</p>"}]}