{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brownies", "Karen Barker", "mocha", "Sweet Stuff: Karen Barker's American Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mocha Brownie Thins:  The Smaller Brownie Alternative", "link": "https://www.seriouseats.com/recipes/2008/01/mocha-brownie-thins-the-smaller-brownie-alter-1.html", "description": "If portion control is one of the keys to weight control, these mocha brownie thins, courtesy of the great Karen Barker, pastry chef and co-owner (along with her chef-husband Ben Barker) of the Magnolia Grill in Durham, North Carolina, are...", "totalTime": "", "recipeYield": "2 1/2 to 3 dozen brownies, depending on how you cut them", "recipeCategory": [], "recipeIngredient": ["4 ounces unsweetened chocolate", "10 1/2 tablespoons (5 1/4 ounces) butter", "1 1/3 cups flour", "1 teaspoon baking powder", "1/2 teaspoon kosher salt", "2 tablespoons instant espresso or coffee", "4 eggs", "1 1/2 cups sugar", "2 teaspoons vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees.  Butter a half sheet pan or an 11 x 17-inch jellyroll pan, line the bottom with parchment paper, and butter the parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chocolate and butter in the top of a double boiler.  Melt over low heat, stirring occasionally, till smooth.  Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, baking powder, salt, and instant espresso.  Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk the eggs with the sugar till thickened and light.  Add the vanilla.  Beat in the reserved chocolate mixture.  Add the reserved flour mixture and mix in just until thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the batter to the prepared pan.  Using an offset spatula, smooth the batter so that it is of even thickness.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 350 degrees for about 7 minutes.  Rotate the pan and bake an additional 7 to 8  minutes.  The brownies are done when they feel just set in the center and they just start to pull away from the sides.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool completely before cutting.  To remove from the pan, run a paring knife all along the edges.  Cover brownies with a sheet of parchment paper and a flat cookie sheet.  Holding the cookie sheet in place, invert the brownie pan.  Reinvert brownies so they are right side up on a cutting surface.  You can cut brownies into any desired shape.  I like to use a 1 1/2-inch plain round cutter to punch out rounds, but you may prefer squares or rectangles.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>These can be made up to 1 day in advance.  Store airtight in a covered container, separating layers with parchment paper.  They can also be well wrapped and frozen.</p>"}]}