{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/sacklunch.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["beans", "healthy and delicious", "How to Cook Everything", "Mark Bittman", "red beans and rice", "sack lunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: Mark Bittman's Red Beans and Rice", "link": "https://www.seriouseats.com/recipes/2008/04/sack-lunch-mark-bittmans-red-beans-and-rice-recipe.html", "description": "As a devoted user of How To Cook Everything, I’m always interested in bloggers’ strong opinions about Mark Bittman. I haven’t run into any anti-Bittman animus in a while, but every once in a while someone really lets him have...", "totalTime": "", "recipeYield": "4-6, or 2 dinners and 4 lunches", "recipeCategory": ["Mains", "Vegetarian"], "recipeIngredient": ["2 cups kidney, pinto, or other beans, washed and picked over", "2 tablespoons olive oil", "2 large onions, chopped", "2 bell peppers, stemmed, seeded, and chopped", "2 celery stalks, chopped", "1 tablespoon minced garlic", "1 tablespoon chili powder (or 4 or 5 sprigs thyme or 1 teaspoon dried thyme, 2 bay leaves, and 1/4 teaspoon ground allspice; I use chili powder)", "2 cups chopped tomatoes (canned are fine; don’t bother to drain)", "Salt and freshly ground black pepper", "1 1/2 cups long-grain white rice", "3 cups canned coconut milk, warmed", "Chopped parsley or cilantro for garnish", "Tabasco to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the beans in a large pot with water to cover. Turn the heat to high and bring to a boil; skim the foam if necessary. Cover loosely and cook at a gentle simmer, stirring very occasionally; add additional water if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a large skillet and cook the garlic and vegetables over medium heat until softened, about 10 minutes. Add the chili powder (or alternate spices) and stir. Add the tomatoes, turn the heat to medium-low, and cook, stirring, until the tomatoes break up, 10-15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the beans are almost all the way cooked (after about an hour or an hour and 15 minutes; start checking frequently after 50 minutes, since much depends on your particular beans), stir the sautéed vegetables and tomatoes into the beans. Cook until the beans are cooked through and completely tender (keep tasting and checking; this is the secret of cooking beans, at least for me, not to quit until they’re done). Discard the bay leaves, if you used them, and season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 3 cups of the bean-vegetable mixture into another saucepan, one that can hold at least double their bulk comfortably. (You will probably have more than 3 cups of beans and vegetables; freeze the excess.) If the beans in the saucepan are swimming in liquid, cook them gently until they are moist but not inundated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice and warmed coconut milk to the beans and vegetables. Cover and turn the heat to low. Cook for about 20 minutes, or until the rice is tender and the liquid is absorbed. If necessary, uncover and raise the heat to medium-high; cook, stirring, until the liquid is absorbed. Season with salt and pepper, garnish with parsley or cilantro, and serve. A dash or two of Tabasco tastes very good with the coconut milk.</p>"}]}