{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cannedtomatoes.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["Dinner Tonight", "Italian", "pastas", "pork", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pasta alla Burina (Pasta with Rustic Sauce)", "link": "https://www.seriouseats.com/recipes/2008/04/dinner-tonight-pasta-alla-burina-recipe.html", "description": "Photograph from thenestor on Flickr Sometimes I find myself in a rut when it comes to quick pasta tomato sauces. The usual canned tomatoes, a few herbs, garlic and onions&mdash;it's good, but it's a little boring. I thoroughly enjoy Batali's...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Italian", "Pasta", "Pork"], "recipeIngredient": ["1 pound short pasta (I used bow-tie farfalle)", "3 tablespoons butter", "1 small onion, diced", "1 clove garlic, diced", "14 ounce canned whole tomatoes", "1/2 pound pork sausages", "1 glass white wine, about 1 1/2 cups", "1 cup freshly shelled peas, or frozen"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a large skillet over medium heat and add the onion and garlic.  As the onion begin to brown, add tomatoes with juice.  Season to taste with salt and pepper, then simmer about 20 minutes, breaking up the whole tomatoes with a wooden spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prick the sausages and cook gently in the wine in another pan.  Remove the sausages from the wine to cool, then strain the wine/pork juice mixture into the tomatoes.  Slice the sausages into rounds, removing the casing first if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta in abundant salty water, and add the fresh peas to the tomatoes at the same time (if using frozen, wait a few minutes before adding).  Shortly before the pasta is done, add the sausage to the sauce to warm through. Drain the pasta, reserving some water, then add to the tomato sauce and toss to coat. Add a little pasta water to moisten, if necessary.  Serve immediately.</p>"}]}