{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-porkchopswithsoubise.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["pork", "pork chops", "soubise"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pork Chop with Modern Soubise", "link": "https://www.seriouseats.com/recipes/2008/12/dinner-tonight-pork-chop-with-modern-soubise-recipe.html", "description": "Modern soubise? I wasn't even acquainted with the old soubise until I found this recipe in James Peterson's Sauces. I only picked it because it was advertised as a perfect topping for pork chops. The original sauce is apparently a...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Mains", "Pork"], "recipeIngredient": ["<strong>For the stewed-onion purée:</strong>", "1 pound onions, peeled and sliced", "1 ounce butter", "2 tablespoons heavy cream", "1 tablespoon tomato paste", "<strong>For the pork chops:</strong>", "2 pork chops", "1 1/2 tablespoons Canola oil", "1/4 cup red wine", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a large pot over medium heat.  Add the onion slices, and cook until they have turned translucent and all the water has evaporated, 10 to 15 minutes.  Stir constantly to keep them from browning.  Pour in the heavy cream and add the tomato paste.  Stir until incorporated.  Transfer to a blender; process until smooth.  Strain through a metal sieve.  Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 500°F.  Pour the oil into a large iron skillet over medium-high heat. Sprinkle the chops with salt and pepper. Add to the skillet, and cook for about 3 minutes a side.  Check their temperature.  If still below 160°F, transfer to oven and cook for 4 to 6 minutes more.  Flip halfway through.  When temperature hits 160°F, remove chops and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off all the fat from the skillet.  Let the skillet cool for a minute, then set it over medium heat.  Pour in the wine; raise heat to medium-high.  Scrape bottom of skillet with a wooden spoon, dislodging all those browned bits. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When wine has reduced by about one-forth, whisk in about 1 1/2 ounces of the stewed-onion purée. Season with salt and pepper. Serve pork chops with sauce drizzled on top.</p>"}]}