{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "Italian", "keywords": ["cookbooks", "grilling", "Italian", "Mario Batali", "scallops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sea Scallops alla Caprese", "link": "https://www.seriouseats.com/recipes/2008/05/sea-scallops-alla-caprese-recipe.html", "description": "Today's Cook the Book recipe, excerpted from Mario Batali Italian Grill, embodies the spirit of summer&mdash;it's fresh, light, and effortless. Sea scallops are as easy to grill as any Oscar Meyer wiener, and the results are far more fabulous. Paired...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Italian", "Mains", "Other Seafood"], "recipeIngredient": ["2 pounds mixed great heirloom tomatoes ", "24 fresh basil leaves ", "3 medium red onions, cut into l-inch-thick slices ", "Kosher salt and freshly ground black pepper ", "5 to 6 tablespoons extra-virgin olive oil ", "12 giant diver scallops (about 2 ounces each) ", "Maldon salt or other coarse sea salt ", "1 lemon, cut in half "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas grill or prepare a fire in a charcoal grill. Place a piastra on the grill to preheat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tomatoes creatively (leave very small ones whole, or halve them) and layout on a platter. Tear the basil leaves over the tomatoes, strewing them about. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the onion slices on both sides with salt and pepper. Place them on the hot dry piastra and cook, unmoved, for 7 to 10 minutes, until well charred on the first side. Using tongs, carefully turn the slices over and cook for 7 to 10 minutes on the second side, until well charred and softened. Transfer to a plate and let cool slightly, then separate the onion slices into smaller rings and scatter them over the tomatoes. Drizzle the whole mess with 3 to 4 tablespoons of the olive oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the onions cook, carve a checkerboard pattern about 1/4 inch deep into one side of each scallop. Season the scallops all over with salt and pepper, toss them in a bowl with the remaining 2 tablespoons oil, and stir gently to coat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the scallops on the dry clean piastra, design side down, and cook for 5 to 7 minutes, unmoved, until almost cooked&mdash;they should be opaque almost all the way through. Flip them over and sear for just 30 seconds, then remove and arrange on the tomato salad. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the scallops and tomatoes with Maldon salt, squeeze the lemon halves over them, and serve.</p>"}]}