{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "Daniel Boulud", "Michael Tong", "short ribs", "The Shun Lee Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Red-Cooked Beef Short Ribs", "link": "https://www.seriouseats.com/recipes/2008/08/red-cooked-beef-short-ribs-recipe.html", "description": "The Chinese technique known as \"red cooking\" involves braising meat in a mixture of soy sauce, sherry, sugar, and spices until it is incredibly tender. Inspired by Daniel Boulud's famed short ribs braised in red wine, Shun Lee chef Michael...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Cook the Book"], "recipeIngredient": ["2 1/2 pounds beef short ribs, cut by the butcher into 8 pieces about 2 inches long", "5 cups dry sherry or red wine", "1/2 cup sugar", "1/2 cup soy sauce", "2 scallions, white and green parts, trimmed", "One 1 1/2 piece peeled fresh ginger, flattened with a cleaver", "Two 3-inch cinnamon sticks", "3 dried hot red chilies", "3 whole star anise", "1 teaspoon ground white pepper", "1 pound spinach"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large saucepan of water to a boil over high heat. Add the short ribs and cook for one minute to remove some of the surface fat. Drain in a colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sherry, sugar, soy sauce, scallions, ginger, cinnamon sticks, chilies, star anise, white pepper, and 3 cups of water in a flameproof casserole. Stir to mix. Add the short ribs, cover, and bring to a boil over high heat. Reduce the heat to medium low, cover, and simmer until the meat is fork-tender, about two and a half hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, transfer the ribs to a chopping board. Cut the meat from the bones, transfer the meat to a bowl, and discard the bones. Remove the scallions, ginger, and whole spices from the sauce. Boil the sauce, uncovered, until it is syrupy, glossy, and reduced to 3/4 cup, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of lightly salted water to a boil over high heat. Add the spinach and cook until tender, about one and half minutes. Drain in a colander. Place the spinach on a platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return short rib meat to the casserole and cook to heat through. Spoon the meat and sauce over the spinach, and serve immediately. </p>"}]}