{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "bittersweet", "chestnuts", "chocolate", "recipe newsletter", "tortes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chestnut Torte", "link": "https://www.seriouseats.com/recipes/2008/02/chestnut-torte-recipe.html", "description": "The following recipe is from the February 13th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! I was drawn to Alice Medrich's recipe for chestnut torte from Bittersweet because right now I'd...", "totalTime": "", "recipeYield": "12 to 14", "recipeCategory": ["Desserts", "Nuts"], "recipeIngredient": ["4 ounces bittersweet or semisweet chocolate, coarsely chopped", "8 tablespoons (1 stick) unsalted butter, cut into pieces", "3/4 cup (about 6 ounces) mashed. steamed, or roasted chestnuts or canned unsweetened chestnut puree (see note)", "1 tablespoon rum or brandy", "1 teaspoon pure vanilla extract", "Pinch of salt", "4 large eggs, separated, at room temperature", "1/2 cup sugar", "1/8 teaspoon cream of tartar", "Powdered sugar for dusting (optional)", "Rum- or brandy-flavored whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the lower third of the oven and preheat the oven to 375°F. Unless you arc planning to serve the cake on the pan bottom, line the bottom of the cake pan with a circle of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate and butter in a large heatproof bowl in a wide skillet of barely simmering water and stir occasionally until nearly melted. Remove from the heat and stir until melted and smooth. Or microwave on Medium (50%) power for about 1 1/2 minutes. Stir until completely melted and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the chestnuts, rum, vanilla, and salt into the chocolate. Whisk in the egg yolks, along with 6 tablespoons of the sugar. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean, dry bowl, beat the egg whites and cream of tartar with an electric mixer at medium speed until soft peaks form when the beaters are lifted. Gradually sprinkle in the remaining 2 tablespoons sugar and beat at high speed (or medium high speed in a heavy-duty mixer) until the peaks are stiff but not dry. Scoop one-quarter of the egg whites onto the chocolate batter. Using a large rubber spatula, fold them in. Scrape the remaining egg whites onto the batter and fold together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the batter into the prepared pan, spreading it level if necessary. Bake for 20 to 30 minutes, or until a toothpick inserted in the center of the pan still has moist crumbs clinging to it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pan on a rack to cool. (The cooled torte can be covered tightly with plastic wrap, or removed from the pan and wrapped well, and stored at room temperature for up to 3 days or frozen for up to 3 months. Bring to room temperature before serving.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, slide a slim knife around the inside of the pan to loosen the cake. Remoye the pan sides and transfer the cake, on the pan bottom, to a platter, or invert the cake onto a rack or tray, remove the bottom and the paper liner, and invert again onto a platter. Using a fine-mesh sieve, sift a little powdered sugar over the top of the cake before serving, if desired. Serve each slice with a little whipped cream.</p>"}]}