{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["4th of July", "Diane Morgan", "grilling", "mains", "pizza", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Sweet Onion, Thyme, and White Farmhouse Cheddar Pizza", "link": "https://www.seriouseats.com/recipes/2008/06/grilled-sweet-onion-thyme-and-white-farmhouse-cheddar-pizza-recipe.html", "description": "Pizza may have originated in Italy but by now it's also an American classic, from Chicago's deep dish pies to New York's thin-and-foldable slices. What better way to celebrate the 4th of July than with a backyard grilled pizza party?...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["1 16- to 18-ounce package fresh or frozen pizza dough", "1 large walla walla or other sweet onion, cut crosswise into 1/4-inch thick slices", "Extra-virgin olive oil", "Vegetable-oil cooking spray", "All-purpose flour for dusting", "1 tablespoon fresh thyme leaves", "Freshly ground black pepper", "6 ounces white farmhouse cheddar cheese, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fresh dough, remove it from the refrigerator 30 minutes before you roll it out. If using frozen dough, transfer it to the refrigerator a day before you plan to make pizza, so it can thaw slowly, and then let it sit at room temperature for 30 minutes before you roll it out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a hot fire in a charcoal grill or preheat a gas grill on high. If the grill has a built-in thermometer, it should register between 500°F and 600°F. Have ready a 14-inch, non-perforated pizza pan, preferably an inexpensive aluminum one. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the grill is heating, arrange the onion slices in a single layer on a large, rimmed baking sheet and brush the slices on both sides with olive oil. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Oil the grill grate. Place the onions directly over the hot fire and grill, turning once, until grill marks appear on both sides and the onions are crisp-tender when pierced with a knife, about 4 minutes per side. (Use a combination of tongs and a long-handled spatula to turn the onion slices so they stay intact.) Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To top the pizza: Brush olive oil over the crust, leaving a 1-inch boarder. Separate the onion slices into rings and arrange evenly over the pizza dough. Scatter the thyme over the top and season with a few grinds of pepper. Evenly distribute the cheese over the onions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pizza peel or thick oven mitts, remove the pizza from the grill. Slice the pizza into wedges and serve immediately. </p>"}]}