{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081212-shortbreadrecipe.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cookies", "desserts", "holiday baking", "holiday sweets", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Cookies: Shuna Fish Lydon's Shortbread", "link": "https://www.seriouseats.com/recipes/2008/12/shuna-fish-lydon-shortbread-cookies-recipe.html", "description": "Shuna Fish Lydon, or her internet nom de plume eggbeater, has been baking sweets in New York and California kitchens for over 15 years. She now resides in London as the pastry chef of Gail's Bread. When asked for a...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts"], "recipeIngredient": ["8 ounces unsalted butter, room temperature", "4 1/2 ounces sugar", "3/4 teaspoons kosher salt", "Dash of vanilla extract", "9 ounces all-purpose flour ", "2 teaspoons minced herbs", "1/2 teaspoon lemon juice; or 1/2 a vanilla bean, scraped; or 1 tablespoon finely ground toasted hazlenuts; or 1 tablespoon whole coriander seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cream butter until smooth, add sugar and salt and cream a bit further, but do not beat ferociously as you do not want to incorporate air. Mix in all additions, one at a time, and fold in the flour gently but well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap dough as a flat disc and refrigerate for 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You may do any number of things with this shortbread. I like to roll it out (sheet) between two pieces of parchment so as to get an even cookie without adding any more flour, which will make this cookie tough. If you sheet the dough, you may use any shape cutter. Shortbread can also be re-sheeted this way until you have no more dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You may also roll it in a log and chill or freeze log, baking only what you need when inspiration strikes you. If you go the log route, you may want to roll log in raw or <a href=\"http://en.wikipedia.org/wiki/Turbinado\">turbinado sugar</a> and then slice. Slice rounds no thicker than 1/2 inch. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F or 150°C.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cookies on a parchment or silpat lined baking sheet. If the bottom of your oven runs hot, double pan to ensure safety of your cookies. Set first timer for 15 minutes, at which time turn pan around to get an even bake. Set second timer for 8 to 12 minutes, but depending on your oven they may need a little more time. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With shortbread it is very important that a low and slow bake takes place and that the cookie is evenly dark golden. Color is flavor here. Think of it this way: In shortbread, your aim is to confit the butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shortbread will keep two days at room temperature, although they are best eaten the day they are baked. </p>"}]}