{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080204-chochol.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "cakes", "chocolate", "Chocolate Holidays", "Cook the Book", "desserts", "flourless cakes", "flourless chocolate cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Flourless Chocolate Cake", "link": "https://www.seriouseats.com/recipes/2008/02/cook-the-book-flourless-chocolate-cake.html", "description": "This rich, moist flourless chocolate cake is sure to please any valentine. Unless he or she hates chocolate. And if that's the case, why don't you go get yourself a new valentine? Be sure to make it at least one...", "totalTime": null, "recipeYield": "12", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["8 eggs, cold ", "1 pound bittersweet or semisweet chocolate, coarsely chopped ", "16 tablespoons (2 sticks) unsalted butter, cut into 1/2-inch chunks ", "1/4 cup strong coffee or liqueur (optional) ", "<strong>For sauce and topping:</strong>", "1 package (10 to 12 ounces) frozen raspberries, thawed, or 8 to 10 ounces fresh raspberries ", "Granulated sugar to taste ", "Powdered sugar, for decoration (optional)", "1 cup heavy cream ", "1 teaspoon vanilla extract ", "<h5>Equipment Needed</h5>", "8-inch springform pan", "Instant-read thermometer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the lower third of the oven; preheat to 325&deg;F. Meanwhile, to make the cake, line the bottom of the springform pan with parchment paper; grease the sides. Set pan on a wide sheet of heavy-duty foil; wrap foil up sides of pan without tearing it. Set pan in a larger baking pan or a roasting pan. Bring a kettle of water to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preferably using a hand-held mixer, beat the eggs at high speed until volume of eggs doubles to about 1 quart, about 5 minutes. If you have to use a heavy-duty mixer, use the whisk attachment and speed 6 and beat to same volume, which will take about the same amount of time. Melt the chocolate and butter, with coffee or liqueur, if using. In a large heatproof bowl, either set in a pan of barely simmering water or in the microwave on medium (50 percent) power, stirring frequently for 4 to 6 minutes or until mixture is smooth and warm (about 115&deg;F). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold one-third of egg foam into chocolate mixture with a large rubber spatula until just a few streaks of egg are still visible. Fold in half of the remaining foam in the same way. Fold remaining foam into batter until completely incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared springform; smooth the surface. Set roasting pan on oven rack; pour enough boiling water into pan to come about halfway up the side of the springform.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the cake has risen slightly, the edges are just beginning to set, a thin glazed crust (like a brownie) has formed on the surface, and an instant-read thermometer inserted halfway into center of cake registers 140&deg;F, 20 to 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove springform from water bath; set on a wire rack and let cool to room temperature. Cover and refrigerate overnight to mellow. Cake can be kept covered and refrigerated up to 4 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Puréed Raspberry Sauce</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, if using frozen raspberries, drain them and reserve the juice. Place fresh or drained frozen berries in the bowl of a food processor. Pulse briefly but not until perfectly smooth. Press the purée through a strainer to remove the seeds. Add some of the reserved juice, if desired. If the purée seems too tart, sweeten it to taste. Cover and refrigerate until serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 30 minutes before serving, remove the springform pan sides, invert the cake onto a sheet of waxed paper, peel off the parchment liner, and turn the cake right side up on a serving platter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, sieve the cake lightly with powdered sugar, if desired. Whip the cream with the vanilla and 2 teaspoons of sugar or more to taste until nearly stiff. Serve slim slices on a pool of raspberry sauce with a dollop of whipped cream on top.</p>"}]}