{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["desserts", "Jam", "Lynne Rossetto Kasper", "Sally Swift", "tarts", "The Splendid Table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Rustic Jam Shortbread Tart", "link": "https://www.seriouseats.com/recipes/2008/06/rustic-jam-shortbread-tart-recipe.html", "description": "I recently invested in a tart pan, and have been having all kinds of fun baking delicious desserts with fresh berries, ground almonds, and&mdash;of course&mdash;lots of butter. It's amazing how the crust's fluted edges really up the impressive factor. The...", "totalTime": null, "recipeYield": "4 to 6 servings", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["Zest of 1/2 lemon", "1/4 cup whole almonds", "3/4 cup unbleached all-purpose flour", "1/4 cup sugar", "Generous pinch of salt", "6 tablespoons cold, unsalted butter, cut into 6 chunks", "1 large egg yolk", "1/2 teaspoon almond extract", "3/4 cup jam (tart cherry or and wild blueberry are especially good)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Butter a 9-inch round silver-colored cake or tart pan. (If using a dark-colored pan, cut baking time by 5 minutes.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With food processor running, drop in the lemon zest and almonds, and grind them fine. Stop the machine, scrape down sides, and add the flour, sugar, salt, butter, egg yolk, and almond extract. Pulse until they are blended and starting to come together in small clumps at the bottom of the processor. (They should look like clusters of peas.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the pastry dough into the pan. With your hands, pat it to evenly cover the bottom of the pan. Give the tart a standing rim by nudging the dough 1/2 inch up the sides of the pan. Don’t worry if it looks a little ragged. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the crust in the center of the oven for 13 to 16 minutes, or until the edges are golden and the center is starting to color. The rim will sink down a little, which is fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven, and turn the heat up to 500°F. Carefully spread the jam over the tart, and immediately return it to the oven (don’t wait for the temperature to reach 500°F). Bake for another 5 to 10 minutes, or until the jam is bubbly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the tart on a rack, slice it into squares or wedges, and serve. Serve the tart warm&mdash;but not hot, because hot jam can burn.</p>"}]}