{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "bucatini", "cherry tomatoes", "pasta", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Bucatini with Cherry Tomatoes and Olives", "link": "https://www.seriouseats.com/recipes/2008/10/sunday-brunch-bucatini-with-cherry-tomatoes-a.html", "description": "I adapted this simple, appealing recipe from my friend Susan Spungen's terrific, underrated book Recipes: A Collection for the Modern Cook (I know, I know, it's a terrible name). Where I live we're at the tail end of the cherry...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["3 tablespoons kosher salt", "1/2 pound bucatini or other thick pasta like perciatelli", "1 tablespoon extra virgin olive oil", "2 garlic cloves, thinly sliced", "Large pinch of red pepper flakes", "2 heaping cups cherry or grape tomatoes", "1/4 cup coil-cured or nicoise olives, pitted", "1 tablespoon coarsely chopped marjoram", "Freshly grated pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Add the kosher salt and the pasta.  Cook the pasta, using the package directions as a guideline minus one minute, stirring occasionally.  During cooking, remove a piece of pasta two minutes before the package indicates to taste for doneness. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a medium frying pan.  Add the garlic and saute until golden brown, about 5 minutes.  Add the red pepper flakes and tomatoes and saute over medium-high heat until the tomatoes begin to break down, about 10 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the olives to the frying pan and continue to saute over medium heat. As the pasta is finishing, add the marjoram to the tomatoes and reduce the heat to medium.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta, reserving some of the cooking water.  Add to the tomatoes and cook for 2 to 3 minutes, adding a few tablespoons of pasta water.  Divide the pasta among warmed plates and top with the grated cheese.</p>"}]}