{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["eggs", "scrambled eggs", "Shopsin's"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Sunday Brunch: Kenny Shopsin's Perfect Scrambled Eggs and Really Good Toast", "link": "https://www.seriouseats.com/recipes/2008/08/sunday-brunch-kenny-shopsins-perfect-scramble.html", "description": "Philosopher-chef Kenny Shopsin, the proprietor of Shopsin's on New York City's Lower East Side, has written what could loosely be called a cookbook, Eat Me: The Food and Philosophy of Kenny Shopsin. It's a great book, and you are going...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Scrambled Eggs", "Vegetarian"], "recipeIngredient": ["1 teaspoon sweet unsalted butter", "6 extra-large eggs", "1/2 teaspoon heavy cream", "Buttered toast"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>1. </strong>Heat the butter in a nonstick egg pan over medium heat.  Whisk the eggs and cream together in a bowl and pour into the pan.  Let the eggs sit for a bit until you sense that somewhere around the edge they're setting, but they don't yet look like they've set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>2. </strong>Pull a fork gently through the eggs as though you're drawing a line down the center of the pan.  The line you drew though the center will fill up with raw egg, and now all of a sudden there will be ridges separating the raw and the cooked eggs. When the flat raw egg looks like it is setting, pull the fork through it again slowly.  When you do this the third time, pull the fork across in a few places and lift up the center of the eggs so that some of the raw egg gets under them and they don't overcook.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>3. </strong>At this point the eggs are cooked enough for me and Kenny, but he and I like our eggs soft. But as Kenny says, \"I like my eggs soft, with different levels of cookedness within them.\"  If you like your eggs more cooked, cook them more.  Serve with the toast.</p>"}]}