{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080930-grilledcheese.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["cheese", "grilled cheese sandwiches", "sandwiches", "The Hamburger Fatty Melt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Very Thin Grilled Cheese Sandwiches", "link": "https://www.seriouseats.com/recipes/2008/10/very-thin-grilled-cheese-sandwiches-recipe.html", "description": "Photograph by Gordon Mark While the Very Thin Grilled Cheese Sandwich is great on its own--especially if you're into more cheese than bread--it makes its appearance here as part of the recipe for our Hamburger Fatty Melt. Quadruple this recipe...", "totalTime": null, "recipeYield": "makes 2 sandwiches", "recipeCategory": ["Cheese", "Sandwiches"], "recipeIngredient": ["Butter, softened", "4 slices <a href=\"http://www.pepperidgefarm.com/ProductDetail.aspx?catID=755&prdID=11797\">Pepperidge Farm Very Thin white bread</a>", "4 slices Kraft Deli Deluxe American cheese (yellow, not white)", "2 slices tomato (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread just enough butter to cover <em>both</em> sides of each slice of bread. (Yes, both.) Heat a large nonstick pan or griddle over medium. Add bread slices and cook, sliding them around the pan as they cook until an even golden brown on first side, about 2 minutes. Flip two of the slices over and top each with two slices of cheese. (The cheese should go directly on the cooked side). Place the other two slices of bread on top, forming two sandwiches with the cheese and browned sides in the middle, and the still-uncooked sides on the outside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook sandwiches, gently swirling them around the pan occasionally until the bottoms are golden brown, about 2 minutes. Flip and cook remaining side, gently swirling them around the pan occasionally until the remaining side is golden brown, about two minutes longer.</p>"}]}