{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080707-dinnertonight-salad.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "salads", "sides", "summer", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Portuguese Salad", "link": "https://www.seriouseats.com/recipes/2008/07/portuguese-salad-recipe.html", "description": "We got this summery side dish from the Summer Shack Cookbook, a wonderful book that the fianc&eacute;e and I have not been able to use that much. It's all about cooking East Coast seafood on the beach, and after our...", "totalTime": null, "recipeYield": "3-4", "recipeCategory": ["Dairy-Free", "Dinner Tonight", "Salads", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1 red bell pepper", "1 green bell pepper", "3 plum tomatoes", "1/4 olive oil", "1 cucumber, peeled", "1/4 cup cilantro, chopped", "2 tablespoons red wine vinegar", "1 teaspoon chili paste", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the broiler on, and set the red and green bell peppers underneath.  Cook, turning occasionally, until lightly blackened on all sides.  When done, place in a small plastic bag and let steam for a few minutes.  Repeat with the tomatoes, but first lightly coat in olive oil.  They will cook much quicker.  Remove when lightly blackened all over and let cool on a tray. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the bell peppers and tomatoes cool, slice the cucumber into 1/2 inch inch thick slices.  Set on a rack or on a paper towel, and sprinkle lightly with salt.  Let those hang out for 20 minutes or so until they release some water.  Dry with paper towels.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bell peppers from the plastic bags when cooled.  Peel off the skin, remove the stems, and chop into 1-inch squares.  Repeat this process with the tomatoes, discarding most of the pulp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the chopped bell peppers, tomato, and cucumbers in a large bowl.  Add the chopped cilantro, olive oil, red wine vinegar, and chili paste.  Season to taste with salt and pepper.  Eat right away, or let sit in the fridge for 30 minutes for the flavors to really marry. </p>"}]}