{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081223-poblanodinner.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chorizo", "Dinner Tonight", "peppers", "rice", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Poblano Stuffed with Chorizo, Shrimp and Rice", "link": "https://www.seriouseats.com/recipes/2008/12/poblano-stuffed-with-chorizo-shrimp-rice-recipe.html", "description": "This recipe by the Food Network's Guy Fieri initially attracted me because of the combination of Mexican chorizo and shrimp, which he mixed with rice and stuffed into a poblano chile. With a sprinkling of cheese on top, these looked...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Rice", "Shrimp"], "recipeIngredient": ["1/2 tablespoon oil", "1/4 pound Mexican chorizo", "1/2 jalapeno, minced", "1/2 onion, diced", "1 clove garlic, minced", "1/2 cup short-grain rice", "1/2 cup chicken stock", "1/2 cup water", "3 large poblano chiles", "1/2 pound shrimp, shelled and roughly chopped", "3/4 cup Chihuahua cheese or Monterrey Jack, shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large skillet over medium heat.  Add the chorizo.  Cook, breaking up the lumps, for about 3 minutes.  Toss in the jalapeno, onion, and garlic.  Cook until the onion is translucent, about 5 minutes.  Turn the heat down if it starts to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump in the rice.  Stir until the rice is evenly dispersed.  Turn the heat to high and pour in the chicken stock and water.  Boil for 3 minutes.  Then reduce the heat to low, cover, and cook for 20 minutes.  When done, stir in the shrimp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the oven to 400°F. Place the poblanos on a baking sheet and set in the oven.  Cook for 15 minutes.  When done, remove, and set aside to cool for a few minutes.  Cut a slit from the stem to the end of the chile.  Remove the seeds and ribs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully stuff the poblanos with the rice and shrimp mixture.  Place back on the baking sheet and cook for 10 minutes.  Remove, turn on the broiler, and sprinkle the poblanos with the cheese.  Place under the boiler for 2 to 3 minutes, or until the cheese has melted and browned. </p>"}]}