{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/CVR_Saut_grn_bns.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cook's Illustrated", "fall recipes", "green beans", "thanksgiving", "Thanksgiving sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Cook's Illustrated's Sauteed Green Beans with Garlic and Herbs", "link": "https://www.seriouseats.com/recipes/2008/11/cooks-illustrated-sauteed-green-beans-recipe.html", "description": "The base recipe here is simple. Green beans are sautéd with butter, garlic, and herbs until lightly browned. Then, water is added to the pan and the beans are left to simmer for several minutes. This leaves the beans nicely browned, with the snappy freshness you'd achieve by simply steaming them. If you're looking for a recipe with a little more pizzaz, you can spice up your beans with one of the three suggested variations.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Legumes", "Sides", "Vegetarian"], "recipeIngredient": ["1 tablespoon unsalted butter, softened ", "3 medium garlic cloves, minced or pressed through garlic press (about 1 tablespoon)", "1 teaspoon chopped fresh thyme leaves", "1 teaspoon olive oil", "1 pound green beans, stem ends snapped off, beans cut into 2-inch pieces", "Table salt and ground black pepper ", "1/4 cup water", "2 teaspoons juice from 1 lemon ", "1 tablespoon chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter, garlic, and thyme in small bowl; set aside. Heat oil in 12-inch nonstick skillet over medium heat until just smoking. Add beans, 1/4 teaspoon salt, and 1/8 teaspoon pepper; cook, stirring occasionally, until spotty brown, 4 to 6 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add water, cover, and cook until beans are bright green and still crisp, about 2 minutes. Remove cover, increase heat to high, and cook until water evaporates, 30 to 60 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter mixture and continue to cook, stirring frequently, until beans are crisp-tender, lightly browned, and beginning to wrinkle, 1 to 3 minutes longer. Transfer beans to serving bowl, toss with lemon juice and parsley; adjust seasoning with salt and pepper. Serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Sautéed Green Beans with Smoked Paprika and Almonds:</strong> Follow recipe for Sautéed Green Beans with Garlic and Herbs, omitting chopped thyme and parsley. Stir 1/4 teaspoon smoked paprika into softened butter with garlic. Sprinkle cooked beans with 1/4 cup toasted slivered almonds before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Spicy Sautéed Green Beans with Ginger and Sesame:</strong> Combine 1 teaspoon toasted sesame oil, 1 teaspoon grated fresh ginger, and 1 tablespoon chili-garlic paste in small bowl. Follow recipe for Sautéed Green Beans with Garlic and Herbs, substituting vegetable oil for olive oil and increasing amount to 2 teaspoons. Cook as directed, replacing butter mixture with sesame oil mixture and omitting lemon juice and parsley. Sprinkle cooked beans with 2 teaspoons toasted sesame seeds before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Sautéed Green Beans with Roasted Red Peppers and Basil?</strong> Combine 2 teaspoons olive oil, 1 medium shallot, minced, and 1/8 teaspoon red pepper flakes in small bowl. Follow recipe for Sautéed Green Beans with Garlic and Herbs, replacing butter mixture with oil-shallot mixture. Add 1/3 cup roasted red peppers, cut into 1/2-inch pieces, to pan with oil-shallot mixture. Substitute 1 teaspoon red wine vinegar for lemon juice and 2 tablespoons chopped fresh basil leaves for parsley.</p>"}]}