{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081105-grilled-butternut-squash-soup.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["fall recipes", "sausage", "soups", "squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Butternut Squash Soup with Sweet Italian Sausage", "link": "https://www.seriouseats.com/recipes/2008/11/butternut-squash-soup-with-sweet-italian-sausage-grilling-recipe.html", "description": "The slow march into winter has brought the ultimate cold weather comfort food back into my daily life: soup. During the few lingering pleasant days, I wanted to take soup to the grill, but most recipes I came across were...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Grilling", "Soups and Stews", "Squash"], "recipeIngredient": ["1 large butternut squash, about 3lbs.", "2 links sweet Italian sausage", "1 medium onion, diced medium", "3 cloves garlic, minced", "3 cups chicken stock", "1 cup heavy cream", "1/4 teaspoon freshly grated nutmeg", "Olive Oil", "Kosher Salt", "Freshly ground black pepper", "Sour cream <em>(optional)</em>", "Chives, snipped into 1/4 length <em>(optional)</em>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a chimney 3/4 full of charcoal. While the fire is lighting, carefully cut the squash in half lengthwise with a large knife. Scoop out and discard the seeds.  Brush the exposed flesh of the squash with olive oil and lightly season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When charcoal is fully lit and covered in gray ash, pour coals out and arrange them on one side of the charcoal grate, keeping the other side empty. Place squash, cut side down, over the hot side of the grill.  Cover and grill until squash is well browned, about 10-15 minutes.  Flip squash over and move to the cool side of the grill.  Cover and continue to cook until a paring knife can be inserted in the middle of the squash with no resistance, about 20-30 minutes more.  Remove squash from the grill and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the squash is cooling, remove the sausages from their casings and brown the meat in a large dutch oven over medium heat, using a wooden spoon to break up the meat as it cooks.  Remove the sausage to a paper towel lined plate, leaving as much rendered fat in the pot as possible (if there is not a lot of fat, you should add 1 tablespoon of butter).  Add the onions to the dutch oven and cook until softened, about 5 minutes.  Add the garlic and cook until fragrant, about 30 second.  Add the chicken stock, scrapping the bottom of the dutch oven to deglaze the pan.  Scoop out the flesh of the butternut squash and add it in with the stock, bring to a boil, then reduce the heat and allow to simmer for 15 minutes, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an immersion blender, or working in batches in a regular blender, puree soup until smooth.  Add the heavy cream, nutmeg, and browned sausage.  Bring back to a simmer, taste, and adjust seasoning with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, ladle soup into bowls, place a dollop of sour cream in the middle and sprinkle with chives.</p>"}]}