{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["crust", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flakey Pie Dough", "link": "https://www.seriouseats.com/recipes/2008/04/flakey-pie-dough.html", "description": "Makes enough for 1 double-crust or 2 single-crust 10-inch pies from The Sweet Melissa Baking Book...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["2 3/4 cups all-purpose flour", "1/2 teaspoon salt", "5 tablespoons cold unsalted butter, cut into 1/2-inch pieces", "1/2 cup plus 2 tablespoons cold vegetable shortening", "6 to 8 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry blender, cut the butter into the flour until the butter is the size of large peas. (Using a pastry blender is easy. Just put it into the shortening and push through while slightly rotating the blender a quarter spin, which cuts and blends in the same operation. Repeat as needed to obtain a good blend or crumbly mixture. You do occasionally have to clear or remove ingredients that stick to the side of the pastry blender and a butter knife works well for this.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now take the shortening from the freezer and, using your fingertips, scoop out little pieces and toss them into the flour with your fingers as you go (just like you did with the butter chunks).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the pastry blender, cut the shortening into the flour mixture until the shortening and the butter are the size of medium to small peas.Now, the water. If you added any ice cubes to the water, pull them out now. Make a well in the center of the flour mixture with your fingers. Pour half of the ice-cold water into the well. Use a fork to gently pull the flour from the sides of the bowl into the well. Keep turning the bowl and pulling the flour in. The dough should start to come together. Now, add half of the remaining water and continue to pull toward the middle. When the dough has enough water, it will hold together when you squeeze it in the palm of your hand. If it is holding together, stop. If it is not quite there yet, add the remaining water and toss until it does.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured work surface. Pat it together into one piece. Divide the dough into two equal parts, flatten each into a round disk, and then wrap tightly in plastic wrap. Refrigerate for at least 45 minutes. Put what you will use today in the fridge, and the rest (if there is any) goes into the freezer for another time.</p>"}]}