{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "French", "keywords": ["Balthazar", "brunch", "eggs", "French", "oeufs en meurette", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Oeufs en Meurette", "link": "https://www.seriouseats.com/recipes/2008/06/brunch-oeufs-en-meurette-eggs-bordelaise-red-wine-balthazar-recipe.html", "description": "There is no more popular brunch spot in New York City than the utterly classic French brasserie Balthazar. The co-chefs there, Riad Nasr and Lee Hanson, along with their talented kitchen crew, manage to turn out 1,000 plates of delicious...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "French", "Vegetarian"], "recipeIngredient": ["1/2 cup pearl onions", "1/2 pound slab bacon, sliced into 1/2-inch lardons", "1/2 pound small white mushrooms, stems discarded", "1 bottle full-bodied red wine (such as a cabarnet sauvignon)", "8 large eggs, cold from the fridge", "4 thick slices of country bread, crusts removed and toasted", "1/2 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1 bunch of frisée"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a medium saucepan of water over a high flame.  When it reaches a boil, add the onions and blanche for eight minutes until tender.  Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, brown the lardons in a small, dry saute pan, about 10 minutes.  Remove with a slotted spoon, reserve, and pour off all but 2 tablespoons of the rendered fat.  Add the drained pearl onions to the pan over a high flame and saute until they take on color about 5 minutes.  Add the mushrooms and saute for 5 minutes, until they and the onions are golden brown.  Combine the onions, mushrooms, and the lardons in the pan.  Keep warm over a low flame, adding butter to the pan if it dries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, bring the red wine to a simmer over medium heat.  Remove the eggs from the fridge (they should be cold before poaching) and crack 2 into a small saucer.  Slowly slip the eggs into the simmering wine and poach until the yolks are just set but still runny, about 5 minutes.  Cook 4 eggs at a time.  While the eggs cook, place one piece of toast in each of 4 shallow bowls.  When the eggs are done, use a slotted spoon to transfew them to the toast, 2 eggs per bowl  Cover while the remaining eggs are poached.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the eggs are cooked and sitting on toast, season with the salt and pepper.  Spoon the lardons and mushrooms over the top.  Garnish with a little frisee alongside.</p>"}]}