{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["fall recipes", "holidays", "Lidia Bastianich", "thanksgiving", "Thanksgiving sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lidia Bastianich's Broccoli Rabe with Oil and Garlic", "link": "https://www.seriouseats.com/recipes/2008/11/lidia-bastianichs-broccoli-rabe-with-oil-and.html", "description": "Broccoli rabe is earthy and slightly bitter. Good olive oil and lots of garlic are all it take to turn this leafy green into a perfect side dish.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Sides", "Vegetarian"], "recipeIngredient": ["1 pound broccoli rabe", "3 tablespoons extra virgin olive oil", "2 garlic cloves, peeled and sliced", "Salt", "1/4 teaspoon crushed red pepper, or to taste", "1/4 cup (or as needed) water "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To trim the broccoli rabe, first cut off the tough ends of the stems. Then, holding a stem with the florets in hand, nick a little piece of the end of the stem with a paring knife and pull the little piece of the stem towards you, peeling the stem partially. Continue working your way around the stem until it is peeled. As you peel the stem, some of the large tough outer leaves will also be removed; discard those as well. Repeat with the remaining stems. Wash the trimmed broccoli rabe in a sinkful of cold water, swishing the stems gently to remove all dirt from between the leaves. Let the leaves sit a minute or two undisturbed to allow the dirt to settle to the bottom of the sink, then lift the broccoli rabe from the water with your hands or a large skimmer. Drain in a colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large skillet over medium heat. Scatter the garlic over the oil and cook, shaking the pan, until golden brown, about 1 minute. Carefully lay the broccoli rabe into the oil, season lightly with salt and 1/4 teaspoon crushed red pepper. Stir and toss to distribute the seasonings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1/4 cup water into the skillet and bring to a boil. Cover the skillet tightly and cook, lifting the lid to turn the stalks occasionally, until the broccoli rabe is tender. Taste and season with additional salt and crushed red pepper if necessary. Serve hot. </p>"}]}