{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "French toast", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Bourbon Vanilla French Toast", "link": "https://www.seriouseats.com/recipes/2008/06/sunday-brunch-bourbon-vanilla-french-toast.html", "description": "I've never met a French toast recipe I didn't like, but this bourbon vanilla French toast, adapted from Marc Meyer and Peter Meehan's terrific book Brunch, is a particular favorite. It's insanely rich, but you can lighten it a little...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["French Toast"], "recipeIngredient": ["1 cup whole milk", "1/2 cup heavy cream (or 1 percent milk)", "3 large eggs", "1 teaspoon pure vanilla extract", "1 vanilla bean, split and scraped (optional)", "1 teaspoon ground cinammon", "Butter or canola oil as necessary", "8 to 12 slices thick slices brioche, challah, or thick-sliced pullman white bread", "Maple syrup, warmed", "1/4 cup Bourbon "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set an ovenproof platter or or a baking sheet with a cooling rack on top of it into the oven, and turn on the oven to 200&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the milk, cream, eggs, vanilla extract, pod, and seeds, the cinnamon, and bourbon in a wide, shallow dish (a pie plate works great)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast-iron or nonstick skillet or griddle over medium-low heat for a minute or 2, then grease the pan with a teaspoon or more of butter, or, if you prefer, oil.  When the butter starts to sizzle (or, if you're substituting oil, when it slides easily from side to side) turn the heat up a touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the bread into the batter, lightly coating each side, then gently shake off any excess batter and put the battered bread directly into the preheated pan.  Cook the French toast 5 to 6 minutes in total, flipping once or twice, until golden brown.  Transfer finished batches of toast to the platter in the oven.  Repeat with remaining bread slices, adding more butter or more oil to the pan as necessary.  Put your serving plates in the oven to warm before adding the last of the batter to the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can serve the French toast immediately, or hold it up to 30 minutes without any major degradation in quality.  Serve with warmed maple syrup.</p>"}]}