{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["books", "brunch", "cookbooks", "eggs", "Roast Chicken and Other Stories", "Simon Hopkinson"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Oeufs en Meurette", "link": "https://www.seriouseats.com/recipes/2008/02/cook-the-book-oeufs-en-meurette.html", "description": "Which came first—the chicken or the egg? Well, since we've already highlighted an adapted version of Simon Hopkinson's Roast Chicken recipe, I guess we've already ended that discussion. To play catch-up, today's featured recipe is for Oeufs en Meurette, essentially...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 750-ml bottle Beaujolais", "1 cup strong beef stock or canned beef broth", "1 thyme sprig", "1 bay leaf", "1 small onion, peeled and chopped", "1 teaspoon soft butter mixed with 1 teaspoon flour (beurre manié), for thickening", "Salt and pepper ", "4 thick bacon slices ", "2 tablespoons butter ", "12 pearl onions, peeled", "12 button mushrooms", "1 garlic clove, peeled ", "8 bread slices, cut from a baguette and fried in olive oil", "1 tablespoon red wine vinegar ", "8 eggs", "1 tablespoon chopped parsley "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserve a quarter of the bottle of Beaujolais, and put the rest in a saucepan with the beef stock or broth, the thyme, bay leaf, and chopped onion. Cook over high heat, reducing by three-quarters. Strain mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium, return mixture to pan, and thicken slightly by adding the beurre manie in small pieces. Season and allow to simmer gently. Meanwhile, cut the bacon into small pieces; fry in the butter until golden brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bacon; fry the onions and mushrooms in the buttery bacon fat. Season; cook over gentle heat, turning occasionally until cooked through. Keep warm with the bacon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the garlic clove over both sides of the fried bread croûtes and place them on four serving plates. Keep warm. Heat the vinegar and reserved Beaujolais together, and poach the eggs it it. With a slotted spoon, lift out cooked eggs, placing one on each croûte, for two eggs per person. Divide bacon, onions, and mushrooms evenly among the plates, spoon over the red wine sauce, sprinkle with parsley, and serve.</p>"}]}