{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["baking", "chicken pot pie", "Cook the Book", "Nick Malgieri", "savory pies", "The Modern Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken Pie with Biscuit Topping", "link": "https://www.seriouseats.com/recipes/2008/09/cook-the-book-chicken-pie-with-biscuit-toppin.html", "description": "Pot pies are one of those soul-satisfying, stick-to-your-ribs dishes that start to sound really appealing in the early fall. The leaves are beginning to change, it's getting darker earlier, and there's a bit of a nip in the air. Instead...", "totalTime": null, "recipeYield": "one 9-by-13-by-2-inch pie, 4 to 6 servings", "recipeCategory": ["Chicken", "Cook the Book", "Mains"], "recipeIngredient": ["<strong>For the chicken and vegetables:</strong>", "1 1/2 pounds skinless, boneless chicken thighs, trimmed of fat, cut into 1 1/2-inch pieces", "1 quart water", "1 teaspoon salt", "2 large sprigs of flat-leaf parsley", "1 small bay leaf", "1 sprig fresh thyme or 1/2 teaspoon dried thyme leaves tied in a small cheesecloth bag", "1 medium onion peeled, halved, and cut into 1-inch dice", "4 large carrots peeled and cut into 1/2-inch slices", "1/2 cup heavy whipping cream", "Salt and freshly ground black pepper", "1 cup frozen peas", "<strong>For the biscuit topping:</strong>", "3 cups all-purpose flour", "3 teaspoons baking powder", "1 1/2 teaspoons salt", "10 tablespoons cold unsalted butter, cut into 12 pieces", "1 1/4 cups milk or buttermilk", "<strong>Equipment:</strong>", "One 9-by-13-by-2-inch glass baking dish or an oval gratin dish of similar capacity "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the chicken, combine the chicken, water, salt, parsley bay leaf, and thyme in a large saucepan or medium enameled iron Dutch oven. Place over medium heat and bring to a simmer, occasionally skimming off any foam that rises to the top. Lower the heat and cook the chicken until it is tender, about 30 minutes. Add the onion and carrots during the last 10 minutes. (You may need to increase the heat for a few minutes to get the liquid simmering again after adding the vegetables.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken and vegetables are cooked, set a strainer or colander over a bowl and pour in the contents of the pan, reserving the broth. Invert the solid contents into the baking dish and let the chicken and vegetables cool for a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the broth to the pan, and place it over medium heat. Bring to a boil, reduce to a simmer, and then simmer until reduced to 3 cups. Add the cream and continue reducing to 2 1/2 to 3 cups. Taste and correct the seasoning with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After you add the cream to the broth, set a rack in the middle level of the oven and preheat to 375ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the parsley, bay leaf, and thyme from the chicken and vegetables and scatter the peas on top. Pour on the sauce and even out with a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the biscuit topping, combine the flour, baking powder, and salt in the bowl of a food processor fitted with the metal blade. Add the butter and pulse until it is mixed in finely. Add the milk and pulse until the dough just starts to come together. Invert the food processor bowl over a floured work surface to turn out the dough. Carefully remove the blade and transfer any dough on it to the work surface. Press the dough together and fold it over onto itself 2 or 3 times to make it smoother. Press the dough into an approximately 9 x 13-inch rectangle. Cut it into 12 equal pieces. Gently pat each piece into an approximately 3-inch disk. Place the disks over the chicken filling. You may cover and refrigerate the pie for up to one day before baking it. If you do, remember to preheat the oven about 1 hour before you intend to serve the pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pie until the dough is baked through and well colored and the filling is bubbling, about 25 minutes. Set the pie on a rack for a few minutes to cool slightly, then serve immediately.</p>"}]}