{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080124-hazan.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "Italian", "keywords": ["Essentials of Classic Italian Cooking", "Italian", "Marcella Hazan", "pastas", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Classic Cookbooks: Marcella Hazan's Homemade Tagliatelle with Bolognese Meat Sauce", "link": "https://www.seriouseats.com/recipes/2008/01/classic-cookbooks-marcella-hazans-homemade-tagliatelle-bolognese-meat-sauce-recipe.html", "description": "Marcella Hazan, who introduced an America familiar with red sauce joints to true Italian food, is a teacher and writer with whom every home cook should spend some time. She was born in Italy but immigrated to the United States...", "totalTime": "", "recipeYield": "2 heaping cups, for about 6 servings/1 1/2 cups pasta", "recipeCategory": ["Classic Cookbooks", "Condiments and Sauces", "Italian", "Mains", "Pasta"], "recipeIngredient": ["1 tablespoons vegetable oil", "3 tablespoons butter plus 1 tablespoon for tossing with the pasta", "1/2 cup chopped onion", "2/3 cup chopped celery", "2/3 cup chopped carrot", "3/4 pound ground beef chuck, not too lean (or 1/2 pound ground beef chuck plus ¼ pound ground pork, preferably from the neck or Boston butt)", "Salt", "Freshly ground black pepper", "1 cup whole milk [I used 2 %]", "Whole nutmeg for grating", "1 cup dry white wine [I used red]", "1 1/2 cups canned imported Italian plum tomatoes, cut up, with their juice", "1 1/4 to 1 1/2 pounds pasta", "Freshly grated parmigiano-reggiano at the table", "1 cup unbleached flour (Italians use 00/doppio zero flour, which has less gluten than American all-purpose flour, but Hazan says unbleached all-purpose is fine; she also says that semolina flour is appropriate only for factory-made pasta and will frustrat", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the oil, butter, and chopped onion in a heavy-bottomed pot and turn the heat to medium. Cook and stir until the onion is translucent. Add the celery and carrot and cook for about 2 minutes, stirring to coat the vegetables with fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the meat, a large pinch of salt, and some freshly ground pepper. Break the meat up with a fork, stir well, and cook until the meat has lost its raw color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the milk and let it simmer gently, stirring frequently, until it bubbles away completely (this took quite a while). Stir in about 1/8 teaspoon freshly ground nutmeg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine and let it simmer away (this took a while, too, but I did not want to raise the heat and boil the meat hard). When the wine has evaporated, stir in the tomatoes. (Cooking the meat in milk before adding the wine and tomatoes protects it from the acidic bite of the latter.) When they begin to bubble, turn the heat down so that the sauce cooks at the laziest of simmers, with just an intermittent bubble breaking through to the surface. Cook, uncovered, for 3 hours (or more—she says more is better), stirring from time to time. If the sauce begins to dry out, add 1/2 cup of water whenever necessary to keep it from sticking. At the end, there should be no water left, and the fat must separate from the sauce. Taste for salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss with cooked, drained pasta and the remaining tablespoon of butter. Serve freshly grated cheese at the table.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Fresh Pasta At Home</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-makes about 3/4 pound—3 standard servings or 4 appetizer servings-</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hazan advises you to mix the dough on a flat work surface by building a mountain of flour, making a crater in its peak, dumping the eggs into the crater, and mixing them gradually with the flour. Since this method has, in my kitchen, led to unstoppable egg rivulets and much frustration more than once, now I mix pasta dough in a big bowl. Mound the flour in a big bowl and scoop out a deep well in its center. Crack the eggs into the well (I add a little pinch of salt to the eggs; Hazan says it is unnecessary, but I am a compulsive salter). Beat the eggs lightly with a fork for about 1 minute. Then gradually begin to draw flour into the eggs, mixing it in as you continue to beat. Keep going, little by little, until the eggs are no longer runny. Now comes one of those situations where you are supposed to use as little flour as possible, the kind of thing you can judge only with time and experience (I’m not there yet, but my pasta is still quite edible): “Draw the sides of the mound together with your hands, but push some of the flour to one side, keeping it out of the way until you find you absolutely need it. Work the eggs and flour together, using your fingers and the palms of your hands, until you have a smoothly integrated mixture. If it is still moist, work in more flour.” When you think the dough is right (i.e. does not need any more flour), wash your hands, dry them completely, and plunge your thumb into the dough. If it comes out clean, with no sticky matter on it, no more flour is needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If your dough still doesn’t seem quite right, it probably will after you knead it. Knead for 8 minutes, pushing the heel of your palm into the dough, folding it in half, giving it a half turn, and repeating. After 8 minutes, the dough should be “as smooth as baby skin.”</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now it’s time to roll out the pasta. Cut the dough into 6 equal parts (if you started with 2 eggs; 12 equal parts if you started with 4, and so on) and spread out clean, dry dish towels for the pasta to rest on. Begin by putting each lump of dough through the widest setting on the pasta machine. Fold it into thirds like an envelope and feed the narrow end through the widest setting again. Repeat 2 or 3 times, then lay the strip of dough on a dish towel and move on to the next lump. Once each bit of dough has been through the widest setting, decrease the roller width a notch and put them all through again. Continue to decrease the rollers’ thickness until the dough is quite thin—I go to the arbitrarily-named setting “7,” which is the third-thinnest setting on my machine. The gradual progression from thicker to thinner is, Hazan says, one of the things that makes homemade pasta so good, so don’t try to speed things up by skipping some of the intermediate thicknesses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the sheets of pasta dry for at least 10 minutes, turning them over from time to time. The pasta is ready to cut when it no longer sticks to itself but is not yet so dry that it cracks. For Bolognese sauce, you should hand-cut tagliatelle. Fold the properly-dried sheets of pasta loosely along their length so that you end up with a flat roll about 3 inches wide at its sides. With a cleaver or similar knife (I used my pastry scraper), slice the roll into ¼ inch wide ribbons. Cut parallel to the original length of the pasta strip so that when you unroll the noodles they are the full length of the strip. But don’t stress out about this—the pasta will be delicious no matter what shape it is.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta in lots of boiling salted water for 1 1/2 - 2 minutes, until it is al dente. Drain and toss immediately with the hot sauce and butter.</p>"}]}