{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["brunch", "Cook the Book", "eggs", "Fairway", "lox", "Steve Jenkins", "The Food Life"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lox, Eggs, and Onions", "link": "https://www.seriouseats.com/recipes/2008/07/lox-eggs-and-onions-recipe.html", "description": "Did you know there is a difference between smoked salmon and lox? Before I moved to New York, I certainly didn't. Sure, they both come from the same fish, but lox is actually pickled in brine&mdash;it's not smoked at all....", "totalTime": null, "recipeYield": "2 servings", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Eggs"], "recipeIngredient": ["2 tablespoons corn oil", "1 large onion, peeled and chopped (about 2 cups)", "4 large eggs", "2 tablespoons unsalted butter", "5 slices lox (about 4 ounces total), each slice cut crosswise into thirds", "4 tablespoons chopped scallions (3 to 4 scallions)", "1 teaspoon chopped fresh chives", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy skillet over high heat, warm the corn oil. Add the onions and cook, stirring once or twice, until the pieces begin to char and blacken at the ends (charring the onion gives this dish a lot of its flavor), 4 to 5 minutes. Transfer the onion to a sieve set over a bowl to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the eggs into a mixing bowl and whisk with a fork until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, preferably nonstick pan over medium heat, melt the butter. Add the salmon, separating the pieces, and toss once to coat them with butter. Add the drained, charred onion and toss again. Pour the eggs into the pan and let sit for 10 seconds so they start to set. With a wooden spoon, slowly move the eggs around, gently combining them with the lox and onion. <em>Do not scramble.</em> Stir in the chopped scallions, then divide the eggs onto warmed plates. Garnish with chopped chives and season to taste with kosher salt. </p>"}]}