{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-madhurjaffrey-indiancooking.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "Indian", "keywords": ["An Invitation to Indian Cooking", "classic cookbooks", "dal", "Indian", "lamb", "Madhur Jaffrey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Classic Cookbooks: Chana Dal with Lamb", "link": "https://www.seriouseats.com/recipes/2008/04/classic-cookbooks-chana-dal-with-lamb.html", "description": "Although I love dried legumes and pulses more than most non-vegetarians, and although I love the vegetables and meat dishes in An Invitation to Indian Cooking, I tend to avoid the chapter on dals. I think this is because the...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Classic Cookbooks", "Condiments and Sauces", "Indian", "Lamb", "Mains", "Vegetarian"], "recipeIngredient": ["2-2 1/2 pounds boned meat from shoulder of lamb, cut into 1-1 1/2 inch cubes (you could also use leg of lamb or stewing beef; in this case, let the meat cook for 1 1/2 hours before you add the dal and complete the recipe)", "5 medium-sized onions (1 peeled and chopped, 4 halved and sliced into fine half-rings)", "5 cloves garlic, peeled and chopped", "A piece of fresh ginger, about 1 inch cube, peeled and chopped", "10 tablespoons vegetable oil (I used 8)", "1 tablespoon ground coriander", "2 teaspoons ground cumin", "1 teaspoon ground turmeric", "3 tablespoons tomato sauce", "1/4 teaspoon ground mace", "1/4 teaspoon ground nutmeg", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1 1/2 teaspoons salt (or as desired)", "1/8 teaspoon freshly ground black pepper", "1/4-1/2 teaspoon cayenne pepper (optional)", "3/4 cup chana dal, cleaned and washed", "2 tablespoons lemon juice", "3 tablespoons chopped cilantro", "1 cucumber", "16 ounces plain yogurt", "1 teaspoon salt", "1/8 teaspoon freshly ground black pepper", "1/2 teaspoon roasted, ground cumin seeds", "1/8 teaspoon cayenne pepper (optional)", "1/8 teaspoon paprika (for garnishing)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the meat pieces dry with a paper towel. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the 1 chopped onion, garlic, and ginger into the container of a food processor or electric blender. Add 4 tablespoons water and blend at high speed until you have a smooth paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 10-inch heavy bottomed casserole-type pot (I used my Dutch oven) over medium-high flame. Put in the 4 sliced onions and fry them, stirring, for 15 to 20 minutes, or until they are a darkish brown and crisp. (They go from this stage to black and crisp fairly quickly, so be alert.) Remove them with a slotted spoon and spread on a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches, brown the meat well on all sides over high heat in the onion-flavored oil. When all the meat has browned, turn off the heat under the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the remaining oil has cooled a bit, pour in the paste from the food processor or blender. Stir it well, mixing it with the juices in the pot. Turn up the heat and fry the paste, stirring all the time, 8-10 minutes or until it has browned (this happened after about 5 minutes for me). Now lower the heat and add, at intervals, frying and stirring, the coriander, cumin and turmeric; after a minute or two, the tomato sauce; and after another minute, the mace, nutmeg, cinnamon, and cloves. Finally, after 5 minutes, add 1 1/4 cups water, salt, black pepper, cayenne, the browned meat, and the cleaned and washed chana dal. Bring to a boil. Cover, lower the heat, and simmer for 1 hour, stirring gently every 10 minutes or so. Do not let the grains of dal break.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When done, add the lemon juice and stir gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve in a warm bowl, sprinkled with the browned onions and chopped cilantro. Serve with plain rice and at least one relish, such as the cucumber raita below.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Cucumber Raita</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-serves 4-6</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Adapted from </em>An Invitation to Indian Cooking</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and grate the cucumber. Empty the yogurt into serving bowl and beat it well with a fork until it is smooth and pastelike. Add the cucumber, salt, black pepper, roasted cumin (reserve a pinch for garnish), and cayenne to the bowl. Sprinkle with paprika and the pinch of roasted cumin. Cover and refrigerate until ready to serve. This relish goes well with nearly all Indian meals. </p>"}]}