{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/book-joyofcooking.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["classic cookbooks", "Joy of Cooking", "shepherd's pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Shepherd's Pie", "link": "https://www.seriouseats.com/recipes/2008/02/classic-cookbooks-joy-of-cooking-shepherds-pie-recipe.html", "description": "As JerzeeTomato pointed out last week, chicken divan is a great way to use leftovers. Joy of Cooking is chock-full of wonderful ideas about what to do with the remains of last night’s dinner; I just wish that in my...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Classic Cookbooks", "Mains"], "recipeIngredient": ["1 1/2 pounds all-purpose potatoes, peeled, quartered, and rinsed", "Salt", "3 tablespoons butter, divided, 2 tablespoons kept chilled", "Freshly ground pepper", "2 tablespoons vegetable oil", "1 medium onion, chopped", "1 carrot, peeled and chopped", "1 celery stalk, chopped", "1 pound raw ground lamb (for shepherd’s pie) or raw ground beef (for cottage pie) OR 1 pound finely-chopped leftover cooked lamb or beef ", "1 tablespoon all-purpose flour", "3/4 cup beef or vegetable stock", "1 tablespoon chopped fresh thyme OR 1 teaspoon dried [I used dried]", "1 tablespoon chopped fresh rosemary OR 1 teaspoon dried [I omitted the rosemary, as I had neither form on hand]", "Pinch ground nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potato chunks in a large pot of cold water. Bring to a boil, add a teaspoon or so of salt, and cook until tender but not waterlogged, 10-15 minutes. Reserve 1/2 cup of the cooking water and drain the potatoes. Return them to the pot and cook over low heat for a minute to remove excess water. Then mash with a fork, potato masher, or ricer (my choice), adding the cooking water along with 1 tablespoon butter and salt and pepper to taste. Beat with a wooden spoon until fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Heat the vegetable oil in a skillet over a medium-low flame. When hot, add the onion, carrot, and celery. Cook, stirring occasionally, until softened, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the heat to medium and add the meat. Cook raw meat for about 10 minutes, stirring and breaking it up with a wooden spoon; brown leftover meat for about 5 minutes, stirring for even coloration. Spoon off any fat. Sprinkle with the flour and cook, stirring, for 2-3 minutes. Add the stock, herbs, nutmeg, and salt and pepper. Reduce the heat to low and simmer, stirring occasionally, until thickened, about 5 minutes. Allow the meat to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the meat in a 9-inch pie plate or baking dish. Spread the mashed potatoes over the top, making irregular peaks with the tines of a fork. Chop the remaining 2 tablespoons cold butter into small pieces and scatter over the top. Bake in the preheated oven until browned and heated all the way through, 30-35 minutes. Allow to cool slightly before serving in the baking dish.</p>"}]}