{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080424-dorie-tvsnacks.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "French", "keywords": ["baking", "Baking with Dorie", "Cookies", "French", "salty", "snacks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: TV Snacks, French-Style", "link": "https://www.seriouseats.com/recipes/2008/04/baking-with-dorie-tv-snacks-french-style-recipe.html", "description": "Illustration by Florine Asch It's not just potato-chip makers that understand that if you offer us something salty we won't be able to eat just one&mdash;French pastry chefs know that trick too. And Arnaud Larher, whose pastry shop is in...", "totalTime": null, "recipeYield": "about 50 cookies", "recipeCategory": ["Baking With Dorie", "French", "Snacks"], "recipeIngredient": ["3/4 cup (3 1/2 ounces) blanched almonds", "1/2 cup sugar", "1/4 to 3/4 teaspoon salt, according to taste (attention: 3/4 teaspoon salt make a <em>really</em> salty cookie)", "1 cup all-purpose flour", "7 tablespoons cold unsalted butter, cut into 7 pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the racks to divide the oven into thirds and preheat the oven to 350&deg;F.  Line two baking sheets with parchment or silicone baking mats and set them aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the almonds, sugar and salt in the work bowl of a food processor fitted with the metal blade and pulse, scraping down the sides of the bowl now and then, until the nuts are finely ground, about 2 minutes.  Turn the nut sugar onto a piece of wax paper and keep it close at hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour in the processor and, with the motor running, drop in the pieces of cold butter.  As soon as all the pieces are in, switch to pulse mode and pulse just until the mixture looks sandy.  Add the nut-sugar mixture and pulse in 3- to 4-second spurts until the dough forms small curds and clumps.  Scrape the dough onto a piece of wax paper.  (The dough can be made ahead, wrapped airtight and frozen for up to 1 month.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To shape the cookies, pull off small pieces of dough about the size of cherries and squeeze them in your hand to form irregularly shaped chunks.  Place the pieces on the lined baking sheets, leaving about 1/2 inch of space between them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 9 to 11 minutes, rotating the sheets top to bottom and front to back after 5 minutes, or until the cookies are set but not really browned.  The cookies will be soft.  Let the cookies rest on the baking sheet for 3 minutes, then, using a wide metal spatula, carefully transfer them to racks to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Keeping:</strong> The cookies can be kept in an airtight container at room temperature for up to 5 days or frozen for up to 1 month.</p>"}]}