{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081223-lentils.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["chorizo", "kale", "lentils", "Meat Lite", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Lentil, Kale and Chorizo Stew", "link": "https://www.seriouseats.com/recipes/2008/12/lentil-kale-chorizo-stew-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by the book coauthored by the two, Almost Meatless, due out in spring...", "totalTime": "", "recipeYield": "serves 6", "recipeCategory": ["Beans and Pulses", "Meat Lite"], "recipeIngredient": ["1 tablespoon plus 1 teaspoon olive oil", "1 1/2 ounces dried chorizo sausage, diced small", "2 small onions, diced, divided", "1 large shallot, minced", "1/2 pound French lentils", "1 teaspoon salt", "3 cups chicken stock (you know I prefer homemade)", "1 bay leaf", "4 small Yukon gold potatoes, quartered and cut into 1/4-inch thick slices", "1 small head Tuscan kale (aka cavalo nero, black kale, lacinato kale or dinosaur kale), roughly chopped", "Romano cheese, shaved, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 teaspoon oil over medium heat and add the chorizo, stirring occasionally until the fat has rendered and the oil looks orange. Add 1 diced onion and the shallot, and cook, stirring occasionally, until the onions and shallots soften, about 10 minutes. Cover with the stock, add the bay leaf and lentils, and bring to a boil. Reduce heat to low, cover, and simmer for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the potatoes, add a little water to cover if needed, add the salt, and cover again. Cook for another 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the other 1 tablespoon of olive oil over medium-low head in a wide skillet and add the remaining onion. Cook until the onion begins to caramelize, about 20 minutes. Increase the heat to medium-high, add the kale, a heavy pinch of salt, and cook, stirring frequently, until the kale wilts down, about 5 minutes. Remove the kale and onions from heat, and reserve until the potatoes and lentils are finished cooking.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine kale with lentils and potatoes. Mix well. Serve with Italian bread and pass shaved Romano at the table. </p>"}]}