{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080313-bakingwithdorie-cornmuffins-thumb.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "corn", "muffins", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking With Dorie: Corniest Corn Muffins", "link": "https://www.seriouseats.com/recipes/2008/03/baking-with-dorie-corniest-corn-muffins-recipe.html", "description": "Photograph by Alan Richardson I’m still in Paris (yay!) and while I saw brilliant yellow forsythia when I was at the Sunday market, and while there are a few cherry blossoms out in the gardens that get full sun, it’s...", "totalTime": null, "recipeYield": "12 muffins", "recipeCategory": ["Baking With Dorie", "Bread", "Corn", "Vegetarian"], "recipeIngredient": ["1 cup all-purpose flour", "1 cup cornmeal", "6 tablespoons sugar", "2 1/2 teaspoons baking powder", "1/4 teaspoon baking soda", "1/2 teaspoon salt", "Pinch of freshly grated nutmeg (optional)", "1 cup buttermilk", "3 tablespoons (1 1/2 ounces) unsalted butter, melted and cooled", "3 tablespoons corn oil", "1 large egg", "1 large egg yolk", "1 cup corn kernels (add up to 1/3 cup more if you’d like), fresh, frozen or canned (in which case they should be drained and patted dry)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong>  Center a rack in the oven and preheat the oven to 400&deg;F.  Butter or spray the 12 muffin molds in a regular-size muffin tin, or fit the molds with paper muffin cups.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in a large bowl, whisk together the flour, cornmeal, sugar, baking powder, baking soda, salt and nutmeg.  In a large glass measuring cup with a spout or in another bowl, whisk together the buttermilk, melted butter, oil, egg and yolk.  Pour the liquid ingredients over the dry ingredients and, with the whisk or a rubber spatula, gently but quickly stir to blend.  Don’t worry about being thorough – the batter will be lumpy and that’s just the way it should be.  Stir in the corn kernels.  Divide the batter evenly among the muffin molds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the pan into the oven and bake 15 to 18 minutes, or until the tops are golden and a knife inserted into the center of the muffins comes out clean.  Pull the pan from the oven and carefully lift each muffin out of its mold and onto a rack to cool.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> The muffins are great warm or at room temperature and particularly great split, toasted and slathered with butter or jam or both (if they’re not in breadbasket at dinner, that is).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Like all muffins, these are best eaten the day they are made.  If you want to keep them, it’s best to wrap them airtight and pop them into the freezer, where they’ll keep for about a month; re-warm in a 300&deg;F oven, if you’d like, or split them and toast them&mdash;do that and they’ll be that much more delicious with butter.</p>"}]}