{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081208-sugarcookies-gina.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "", "keywords": ["baking", "Cookies", "Gina DePalma", "holiday baking", "holiday recipes", "holiday sweets", "sugar cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sugar Cookies", "link": "https://www.seriouseats.com/recipes/2008/12/sugar-cookies-recipe-gina-depalma-holidays.html", "description": "...", "totalTime": "", "recipeYield": "50 to 60 cookies, depending on the size and shape", "recipeCategory": ["Desserts"], "recipeIngredient": ["2 1/4 cups unbleached all purpose flour", "1 teaspoon kosher salt", "1 cup (2 sticks, 8 oz.) unsalted butter, softened", "3/4 cup granulated sugar", "2 large egg yolks", "2 teaspoons canola or other flavorless oil", "1 teaspoon pure vanilla extract", "1 teaspoon finely grated lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the flour and salt together and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the butter and sugar in the bowl of an electric mixer and use the paddle attachment on medium speed to cream them together until light and creamy, about 1 minute.  Beat in the egg yolks one at a time, followed by the oil, vanilla and lemon zest, stopping occasionally to scrape down the sides of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On low speed, slowly beat in the flour mixture, then increase the speed to medium and beat the dough until it comes away from the sides of the bowl.  Shape the dough into a large disc and wrap it in a sheet of plastic; refrigerate for at least 4 hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to bake the cookies, remove the dough from the refrigerator to slightly soften it while you preheat the oven to 350°F, positioning the racks in the center of the oven.  Spray two cookie sheets or rimmed sheet pans lightly with non-stick cooking spray and line them with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into three pieces; work with one piece at a time, keeping the other pieces chilled or in a cool part of the kitchen.  On a lightly floured board, roll the dough 1/8th of an inch thick, taking care to make sure the dough doesn't stick to the board and remains cool to the touch.  Use your favorite cutters to stamp out the cookies into desired shapes and transfer them to the baking sheets, 1/2 and inch apart.  Work with two sheets at a time, refrigerating the remaining dough and scraps during baking, cooling and decorating.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies 10 to 12 minutes, or until they just turning golden at the edges.  Rotate the baking sheets halfway through the baking time to ensure even browning. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the cookies to cool for one minute on the sheet, and then slide them onto a wire rack to cool completely.  Repeat as necessary with the remaining pieces of dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the cookies up to 2 weeks in an airtight container.</p>"}]}