{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081216eggnog-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["alcohol", "drinks", "eggnog", "holiday entertaining"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Exploring Eggnog", "link": "https://www.seriouseats.com/recipes/2008/12/exploring-eggnog-recipe.html", "description": "A veritable icon of the holiday season, eggnog is nonetheless a divisive concoction. To some, it is a welcome tradition, to others, an out-and-out anathema. (The latter being a stance that I attribute to the existence of some rather vile...", "totalTime": "", "recipeYield": "about six 6-ounce servings", "recipeCategory": ["Cocktails"], "recipeIngredient": ["2 cups milk (450g)*", "1 vanilla bean", "5 large egg yolks", "1/3 cup sugar (70g)**", "1/2 cup liquor of your choice, optional but recommended (110g)***", "1 cup heavy whipping cream (225g)", "Nutmeg, cinnamon or chocolate, grated to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a fine mesh strainer over a large mixing bowl and set aside.  In a medium sauce pan, combine milk with the scrapings of the vanilla bean and the vanilla pod. Place over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk together yolks and sugar in a medium mixing bowl.  When milk begins to steam, slowly pour about half of the hot milk into the yolk mixture, whisking constantly to avoid scrambling the egg.  Slowly whisk this milk-yolk mixture back into the hot milk remaining in the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set whisk aside, and heat the mixture over medium-low heat, stirring constantly with a wooden spoon, until the liquid begins to steam, the bubbles on the liquid’s surface have dissipated, and a finger run across the back of a spoon, leaves a clear channel, without the custard readily bleeding back in.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately pour the hot mixture through the reserved sieve into the mixing bowl below. Discard any solids that collect in the sieve.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If serving the eggnog warm, perform the following steps immediately.  If serving it cold, place the mixing bowl of custard into a larger bowl filled with ice and water, and stir the mixture occasionally until cool to the touch.  Transfer the mixture to a sealed jar or storage container and store in the refrigerator for up to two days before proceeding to the final steps and serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip the heavy cream to soft peaks, about the consistency of Cool Whip. (Do not over-whip or the cream will be difficult to incorporate, resulting in an eggnog with errant lumps of whipped cream and a less frothy texture.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the liquor to the custard mixture, stirring well to distribute. (If serving the eggnog warm, gently warm the liquor before adding it to the custard.  Do not heat it too thoroughly or it will scramble the custard.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Then, using a balloon whisk (bulbous, with large openings between spokes) or a spatula, gently fold in the whipped cream.  Serve immediately in individual portions garnished with an ample dusting of nutmeg or cinnamon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Footnotes</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I generally use whole milk, but light cream or half-and-half may be substituted for an even more luxurious finished product.  Leaner milks may also be used; these will yield a slightly thinner eggnog. I've also had success substituting alternative milks, such as almond and soy, for part of the whole milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** I sometimes substitute brown sugar for white, especially if I’m using rum in the recipe.  Honey, maple syrup and other sweeteners can also be substituted in part or in whole for the sugar, just be aware that liquid sweeteners tend to be sweeter than white sugar and should not be substituted cup for cup.  Instead, substitute sweeteners such as honey and maple little by little, to taste. You can add a little more sweetener to the custard later if necessary, but you won't be able to take it away.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>*** Rum and brandy or cognac are perhaps the most common additions, but bourbon, rye and sherry are also worth trying.  You might also consider substituting a few tablespoons of the primary liquor of your choice with a complementary liqueur, such as Cointreau (orange), crème de cacao (chocolate), Drambuie (honey), Amaretto (almond), Galliano (vanilla overtones with varied herbals), etc. Should you decide to omit the alcohol entirely, try adding 1/4 cup orange juice instead for added flavor.</p>"}]}