{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["beef", "cheeseburgers", "mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Julia Burger", "link": "https://www.seriouseats.com/recipes/2008/09/the-julia-burger-recipe.html", "description": "In her cookbook The New Steak, Cree LeFavour makes the Julia Burger in honor of Julia Child after getting the inspiration from an episode of Jacque and Julia. She says that the burger, which includes butter, mayonnaise, meat, melted cheese,...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Burger", "Mains"], "recipeIngredient": ["1 1/2 pounds steak (hangar, top blade, skirt, sirloin&mdash;whatever you like and can afford), trimmed of all visible fat and cut inlo 2-inch chunks ", "1 1/2 teaspoons kosher salt ", "Freshly ground black pepper ", "1 to 2 tablespoons peanut oil for pan-frying ", "8 slices bacon, cooked crisp ", "1 tomato, sliced ", "4 lettuce leaves, cleaned ", "4 fresh Kaiser rolls. toasted and buttered ", "4 slices sharp Cheddar cheese ", "Mayonnaise ", "Ketchup ", "4 thin slices raw onion "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the cut-up pieces of steak in the food processor along with the salt and a good grind of black pepper and pulse a few times&mdash;just long enough so the meat will hold together and there aren't any big chunks left. Pick out any visible strands of white gristle. Gently form 4 patties, neither pressing nor squeezing the meat. Air is good. You should have about 1/3-pound burgers, which suits the no-holds-harred spirit of this meal. Very thick patties are more difficult to cook; make them thinner;1 1/2 inches is about right;and cook them fast and hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before you cook your burgers, make sure the bacon is done to a crisp and that you have a tomato sliced, lettuce washed, and Kaiser rolls toasting. Butter each roll while it's hot. When everything is ready, cook the burgers either on a grill or in a cast-iron pan. Whichever method you choose, don't press the burgers down with your spatula as you cook! And don't forget to put the cheese on for the last 2 to 3 minutes of cooking on the second side. This should give it time to melt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To grill,</strong> your coals should be so hot that you can comfortably keep your hand 2 inches above the grate for 3 seconds;just! (For gas grills, this means 450°F.) Make sure the grill is well oiled. Put the burgers on the hottest part of the grill and sear for 3 to 5 minutes on each side. If they're browning too much, move them to a cooler pan of the grill to finish cooking. <strong>To pan-fry,</strong> heat the peanut oil in a heavy pan until it's very hot;almost smoking. Sear the burgers for 3 minutes on each side over high heat before turning down the burner. Finish cooking over moderate heat, flipping the burgers every few minutes as they cook. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Test for doneness often by poking, or use an instant-read thermometer. Take them off at between 125° and 130°F for rare to medium-rare. Like a steak, a burger needs to rest in the warming oven (170°F) or on a warm plate under a loose tent of foil before you serve it&mdash;3 minutes should do it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the buttered rolls cool a little before putting a smear of mayonnaise and an even thinner smear of ketchup on each side. Put the cooked burger on the bun, add the bacon to cover the meat and enough lettuce to do the same. Add a slice of tomato and a slice of raw onion before putting the top on. Eat. </p>"}]}