{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Emily Koh"}, "recipeCuisine": "", "keywords": ["baking", "healthy and delicious", "Lorna Sass", "pies", "Whole Grains Every Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Millet Pie with Spinach and Feta", "link": "https://www.seriouseats.com/recipes/2008/01/millet-pie-with-spinach-and-feta.html", "description": "The following recipe is from the January 23rd edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! In honor of January 23rd being National Pie Day, why not sit down to this savory...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Healthy and Delicious", "Mains", "Pasta", "Vegetarian"], "recipeIngredient": ["1 tablespoon olive oil, plus more for greasing pie plate", "1 medium onion, diced", "1 teaspoon dried oregano", "1 cup hulled millet, rinsed", "12 ounces baby spinach", "5 ounces crumbled feta (about 1 cup)", "1 red bell pepper, roasted, seeded, and diced", "2 tablespoons chopped fresh flat-leaf parsley, plus sprigs for garnish", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a 9-inch pie plate. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a medium saucepan. Add the onion and cook over medium-high heat until lightly browned, about 3 minutes. Stir in the oregano. Add 3 1/2 cups of water and bring it to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the millet. Reduce the heat to medium, cover the pot, and cook the millet for 10 minutes. Uncover and boil the mixture over medium-high heat, stirring occasionally, until most of the remaining water evaporates, 5 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking over very low heat until the millet becomes very soft and the mixture is thick and porridgy, usually about 5 minutes more. A minute or so before the millet is tender, stir in the spinach, a large handful at a time. If the mixture becomes dry before the millet is tender, add boiling water, about 1/4 cup at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat and stir in the feta, red pepper, parsley, and salt and pepper. Pour the mixture into the prepared pie plate. Set aside to cool until set, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cut into wedges and serve at room temperature. Alternatively, reheat in the microwave. Set a sprig or two of parsley alongside individual portions. </p>"}]}