{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081224ChallahPainPerdu.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Kosher", "keywords": ["challah", "creme anglaise", "hanukkah", "hanukkah desserts", "holidays", "pain perdu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Challah Pain Perdu with Vanilla Crème Anglaise", "link": "https://www.seriouseats.com/recipes/2008/12/hanukkah-challah-pain-perdu-vanilla-creme-anglaise-recipe.html", "description": "Pain perdu is a French nursery dessert. Meaning \"lost bread,\" it reclaims day-old leftover bread and is the French answer to, aptly named, French toast. Challah is a traditional Jewish egg bread, slightly sweet and buttery, and very similar to...", "totalTime": null, "recipeYield": "4 to 8", "recipeCategory": ["Breakfast and Brunch", "Kosher"], "recipeIngredient": [], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin by making the crème anglaise.  Heat the half and half in a saucepot over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, beat the egg yolks and sugar with a hand mixer until they are light and pale in color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very slowly stream the hot half and half, while mixing, into the sugar-yolk mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the mixture to the saucepot and heat over medium heat.  Add the vanilla.  Stir constantly with a wooden spoon until the crème anglaise coats is thick and coats the back of the spoons.  Pass through a strainer so that any bits of egg that have scrambled will be removed.  Allow to cool only slightly while you assemble the pain perdu.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the half and half, sugar, honey, and eggs.  In a large nonstick sauté pan over medium-low heat, melt 1 tablespoons of butter.  Press the challah, one piece at a time, into the custard, flipping once, so the bread has a chance to soak it up, but not to become overly saturated.  Sauté the custard-soaked bread about 4-5 minutes per side, or until golden, in batches, using more butter as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust powdered sugar over the top of the pain perdu.  Serve with the crème anglaise.</p>"}]}