{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "Italian", "keywords": ["A16 Food + Wine", "antipasti", "Cook the Book", "Italian", "Nate Appleman", "radicchio", "Shelley Lindgren", "tuna conserva", "wine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Tuna Conserva with Potatoes, Radicchio, Green Olives, and Almonds", "link": "https://www.seriouseats.com/recipes/2008/09/cook-the-book-tuna-conserva-with-potatoes-radicchio-green-olives-and-almonds.html", "description": "True Italian tuna conserva is a far cry from Chicken of the Sea. Fresh fish is poached in a bath of water or olive oil, and seasoned with a variety of aromatics such as fennel, garlic, lemon, and crushed black...", "totalTime": "", "recipeYield": "6 servings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Fish", "Italian", "Salads"], "recipeIngredient": ["6 round red or white boiling potatoes (about 2 pounds total)", "Kosher salt", "1 head radicchio, cored, leaves separated, and torn into large bite-sized pieces", "1/2 cup green olives, pitted and sliced", "1 1/2 cups high-quality olive oil-packed tuna, drained", "1/2 cup extra virgin olive oil", "3 tablespoons freshly squeezed lemon juice", "1/3 cup whole natural almonds, toasted and coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the potatoes in a 3- or 4-quart pot, cover with cold water by about 2 inches, and add 1 tablespoon salt. Bring to a boil over high heat, adjust the heat to a simmer, and cook, uncovered, for about 30 minutes, or until the potatoes are tender when pierced with a fork but have not started to split. Drain the potatoes and let cool to room temperature. Cut the potatoes into 1-inch wedges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the radicchio, olives, tuna and potatoes. Drizzle the olive oil along the sides of the bowl, followed by the lemon juice and a generous pinch of salt. With your hands, gently mix the salad, ensuring that the olive oil and lemon juice and evenly distributed. Taste a piece of radicchio to check the seasoning, adding more olive oil, salt, or lemon juice to suit your taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the salad on a platter. Sprinkle with the almonds to finish. Serve immediately. </p>"}]}