{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-madhurjaffrey-indiancooking.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["An Invitation to Indian Cooking", "chicken", "classic cookbooks", "Indian", "Madhur Jaffrey", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Chicken with Sliced Lemon and Fried Onions", "link": "https://www.seriouseats.com/recipes/2008/03/classic-cookbooks-chicken-with-sliced-lemon-and-fried-onions-recipe.html", "description": "One of the first Madhur Jaffrey meat recipes I ever tried was a goat stew. Although she recommends that Americans replace the goat with lamb, I’m open to new meats, and someone at the Greenmarket was actually selling goat for...", "totalTime": "", "recipeYield": "4-6", "recipeCategory": ["Classic Cookbooks"], "recipeIngredient": ["3-3 1/2 pounds bone-in, skinless chicken pieces (I used all thighs; it’s easy to remove the skin yourself, if you can’t find bone-in, skinless parts)", "3 medium-sized onions", "A piece of fresh ginger, about 1-inch cube, peeled and coarsely chopped", "4 cloves garlic, peeled and coarsely chopped", "8 tablespoons vegetable oil (I used only 6)", "1 tablespoon ground coriander", "1 teaspoon ground cumin", "1/2 teaspoon ground turmeric", "2 tablespoons plain yogurt", "4 tablespoons tomato sauce", "1 teaspoon salt", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1/8 teaspoon cayenne pepper", "1 whole lemon", "1 tablespoon sugar", "1/8 teaspoon freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the chicken pieces are skin-on, remove the skin. Rinse and pat dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the onions. Chop two of them coarsely and put them into the bowl of a food processor or blender. Cut the third one in half lengthwise, then slice it into thin half-rounds and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 6 tablespoons of water, the ginger, and the garlic to the onions in the food processor or blender and blend at high speed until you have a smooth paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 6 tablespoons of the oil (I used 4) in a 10-12 inch pot over medium-high flame. When hot, put in the sliced onions and fry them, stirring, until they are darkish brown and crisp, though not burned. Remove onions with a slotted spoon and leave them to drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same oil, brown the chicken pieces on all sides until they are golden. Do this speedily over high flame so the chicken browns but does not cook through. I did the thighs about 2 minutes per side. You will need to do it in at least 2 batches. Remove the chicken with slotted spoon to a bowl or plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 2 tablespoons of oil to the pot. Pour in the paste from the blender (turn your face away!). Stirring, fry on medium-high heat for about 10 minutes or until the paste turns a nice golden brown. Now put in the coriander, cumin, and turmeric and fry, stirring continuously; after another 2 minutes add yogurt, a teaspoon at a time; after 2 or 3 minutes, the tomato sauce, a tablespoon at a time, continuing to stir and fry. Finally, add salt, cinnamon, cloves, cayenne pepper, and 1 1/2 cups of water. Bring to a boil. Cover, lower heat, and simmer gently for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the lemon into 4 or 5 slices, discarding the end pieces, and remove the seeds. Add lemon slices along with the chicken pieces, fried onions, sugar, and the ground pepper to the sauce, stir, and bring to a boil. Cover, lower heat, and simmer gently for 20-25 minutes, or until the chicken is tender, turning the pieces every now and then. If chicken sticks to the bottom of pot, add a little more water. You should end up with a very thick sauce. (My sauce was thick but also copious and in no danger of sticking. I don’t know if it was correct, but it tasted good.)</p>"}]}