{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080506-swisschard.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["healthy and delicious", "sides", "swiss chard", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eating for Two: Swiss Chard with Tomatoes and Chickpeas", "link": "https://www.seriouseats.com/recipes/2008/05/swiss-chard-with-tomatoes-and-chickpeas-recipe.html", "description": "Photograph from LollyKnit on Flickr Baby is kicking every day now and already has a couple of toys and some astonishingly pretty clothes, which for some reason makes her seem much more real. I’m dying to know what she’ll be...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Healthy and Delicious", "Sides", "Vegetarian"], "recipeIngredient": ["3/4 cup (5 ounces) dried chickpeas or 1 20-ounce can chickpeas, drained", "1/4 cup olive oil", "5 garlic cloves, finely chopped", "6 canned plum tomatoes, drained and finely diced", "1 or 2 bunches (about 1 pound) fresh Swiss chard, washed, stems cut crosswise into 1/4 inch sections, leaves cut into 1-inch-wide ribbons", "1 teaspoon salt", "Freshly ground pepper", "1 teaspoon good-quality extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using dried chickpeas: Soak overnight in cold water to cover by about 3 inches. Drain. In a medium pot, bring the chickpeas and 2 1/2 cups water to a boil. Cover, lower the heat, and simmer until tender. You should check after an hour, but this could take as long as 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the oil in a wide, medium pot over medium-high heat. When hot, add the garlic and stir for 20 seconds. Add the tomatoes and stir for a minute. Add the chard stems and stir for 2 minutes. Add the chard leaves and stir until they wilt. Add the chickpeas, their cooking liquid, the salt, and 3/4 cup water (if using canned, drained chickpeas,  add them now along with 3/4 cup water or stock; easy on the salt). Mix well. Cook on medium heat, uncovered, for 20 minutes, stirring occasionally. There should be a little thick juice left at the bottom of the pot when you finish. Taste for salt and pepper. Serve hot or at room temperature, drizzled with the good extra-virgin olive oil.</p>"}]}