{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080926-longanisa-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Filipino", "keywords": ["Filipino", "grilling", "pork", "sausages"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Longanisa", "link": "https://www.seriouseats.com/recipes/2008/09/grilling-longanisa-sausage-recipe.html", "description": "It may be a little early in the season to start dolling out the \"I'm thankful for's,\" but there's really isn't a time that we can't be grateful for the porky, fatty cuisine from the Philippines. I owe so much...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Filipino", "Grilling", "Pork"], "recipeIngredient": ["2 1/2 pounds boneless pork butt, cut into small cubes", "1/2 pound pork fatback, cut into small cubes", "2 tablespoons kosher salt", "1 tablespoon freshly ground black pepper", "1/2 teaspoon red pepper flakes", "12 large cloves of garlic, minced", "2/3 cup chilled cider vinegar", "Hog casings, soaked for at least 30 minutes in warm water, then rinsed well inside and out"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cubed pork, fatback, salt, black pepper, red pepper flakes, and garlic in a large bowl.  Cover and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grind the mixture through the large die of a meat grinder.  Add the chilled vinegar and mix with your hands until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a small patty of the sausage mixture and place the rest in the refrigerator.  Pan fry patty in a skillet until cooked through.  Taste test the patty and adjust seasoning of sausage mixture if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit casings over sausage stuffing horn and tie off the end.  Stuff all of the sausage into the casings and tie into 4-inch links.  Refrigerate sausages until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly.  Grill sausages until cooked through, or when an instant read thermometer reads 150&deg;F when inserted into the middle of the sausage.  Let cool for 5 minutes, then serve.</p>"}]}