{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080124-hazan.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["classic cookbooks", "Essentials of Classic Italian Cooking", "holidays", "Marcella Hazan", "pork", "sorbet", "swiss chard"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: An Impressive Pork Loin Dinner from Marcella Hazan", "link": "https://www.seriouseats.com/recipes/2008/01/classic-cookbooks-impressive-pork-loin-dinner-swiss-chard-tangerine-sorbet-recipe.html", "description": "When I read the comments on my first post about Essentials of Classic Italian Cooking. I realized that I had underestimated the delicacy of the thumbnail biographer’s task. As an educated, experienced woman who brings home the bacon (okay, a...", "totalTime": "", "recipeYield": "six", "recipeCategory": ["Classic Cookbooks", "Mains", "Pork"], "recipeIngredient": ["1 tablespoon butter", "2 tablespoons vegetable oil", "2 1/2 pounds pork rib roast (meat detached from the ribs in one piece, ribs carved into 2 or 3 sections) or 2 pounds boneless Boston butt (will carve less neatly, but that’s what I used); do not have any fat trimmed away from either cut of meat (you’l", "Salt", "Freshly ground black pepper", "2 1/2 cups (or more) whole milk", "The broad, white stalks from 2 bunches mature Swiss chard", "Butter for smearing and dotting the baking dish", "Salt", "2/3 cup freshly grated parmigiano-reggiano", "2 bunches Swiss chard, leaves only", "Salt", "Extra virgin olive oil", "Freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter and oil over a medium high flame in a heavy-bottomed pot that will accommodate the pork snugly. When the butter foam subsides, put the meat in, fat side facing down. As it browns, turn it every few moments for even coloring all around. If you should find the butter becoming very dark, lower the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt, pepper, and 1 cup of milk. Add the milk slowly, or it will boil over. Allow the milk to come to a simmer for 20 or 30 seconds, turn the heat down to a minimum, and cover the pot, leaving the lid slightly ajar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook at a very lazy simmer for about 1 hour, turning the meat from time to time, until the milk has thickened, through evaporation, into a nut-brown sauce. (The exact time it will take depends largely on the heat of your burner and the thickness of your pot. In my case, there was such a thick layer of fat on top of the milk that I couldn’t really tell what was going on beneath it. It didn’t seem to me it was ever going to turn nut-brown, and so eventually I forged ahead anyway, which may explain my sauce’s less than successful final aspect.) When the milk reaches this stage and not before, add 1 more cup of milk, let it simmer for about 10 minutes, then cover the pot tightly. Check and turn the pork from time to time. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 30 minutes, set the lid slightly ajar. Continue to cook over minimum heat, and when you see there is no more liquid milk in the pot, add the other 1/2 cup milk. Continue cooking until the meat feels tender when prodded with a fork and all the milk has coagulated into small nut-brown clusters. Altogether it will take between 2 1/2  and 3 hours. (If, before the meat is fully cooked, you find that the liquid in the pot has evaporated, add another 1/2 cup of milk, repeating the step if necessary.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pork has become tender and all the milk in the pot has thickened into dark clusters (again, this didn’t look as if it was ever going to happen for me), transfer the meat to a cutting board. Let it settle for a few minutes, then cut it into slices about 3/8 inch thick or slightly less, and arrange them on a warm serving platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tip the pot and spoon off most of the fat—there may be as much as a cup of it—being careful to leave behind all the coagulated milk clusters. Add 2 or 3 tablespoons of water, and boil away the water over high heat while using a wooden spoon to scrape loose cooking residues from the bottom and sides of the pot. Spoon all the pot juices over the pork and serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"swisschard\"></a><h4>Swiss Chard Stalks Gratin&eacute;ed with Parmesan Cheese</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- serves 4 -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the chard stalks into pieces about 4 inches long, and wash them in cold water. Bring 3 quarts water to a boil and cook the stalks at a moderate boil until they feel tender when prodded with a fork, about 30 minutes according to author (I cooked them for only about 15). Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear the bottom and sides of a baking dish with butter and place a layer of chard stalks on the bottom, laying them end to end and trimming to fit if necessary. Sprinkle lightly with salt and grated cheese and dot sparingly with butter. Repeat the procedure, building up layers of stalks until you have used them all. The top layer should be sprinkled generously with Parmesan and thickly dotted with butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake on the top rack of the preheated oven until the cheese melts and forms a light, golden crust on top. You might begin to check after 10 or 15 minutes, but in my experience it takes 20 or 25 minutes. When the gratin comes out of the oven, let it settle for a few minutes before bringing it to the table.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"swisschardsalad\"></a><h4>Boiled Swiss Chard Salad</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- serves 4-6 -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the chard leaves well in several changes of cold water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift the leaves out of their last bath and put them in a pan with only the moisture clinging to them. Add 2 teaspoons salt, turn the heat to medium, cover, and cook until fully tender, about 15-18 minutes from the time the liquid in the pan starts to bubble.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the chard and gently press out as much moisture as possible. Transfer to a serving platter. When lukewarm or no cooler than room temperature, toss with salt, olive oil, and 1 or more tablespoons lemon juice. Serve at once.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"sorbet\"></a><h4>Frozen Tangerine Shells Filled with Tangerine Sorbet</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-serves 4-</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Ingredients </h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 tangerines</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 large or 2 small oranges</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 lemon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup granulated sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 egg white (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 tablespoons rum (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Procedure</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the tangerines in cold water. Neatly slice off their tops in one piece, leaving enough of an opening for you to extract the fruit and, later, to stuff the shell. Hold each tangerine over a bowl and plunge a citrus reamer into its heart; squeeze as much juice as possible into the bowl, being very careful to leave the shell intact. Then remove any remaining fruit or pulp from the inside of the tangerine so that you have a neat, pith-lined hollow sphere. Freeze the shells for at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate the zest of 1/2 of the orange and 1/2 of the lemon. Juice the orange and lemon into the bowl of tangerine juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the sugar and 1 cup water into a small saucepan. Turn the heat to medium and stir from time to time until the sugar has melted. Pour this syrup into a bowl. Add the grated orange and lemon zests and the juice mixture. Mix well. Allow the mixture to cool completely and chill in the refrigerator. At this point Hazan stirs in an egg white beaten just until foamy, but for various reasons I skipped this step.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Churn the chilled mixture in an ice-cream maker. If you like, stir the rum into the churned sorbet; I don’t like desserts that taste boozy, so I left it out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hazan advises freezing the sorbet for at least 1 hour before stuffing it into the shells, but I was short on time and stuffed right away. Simply spoon the sorbet into the shells, then return the stuffed tangerines to the freezer and wait 45 minutes to serve. My tasting panel thought the sorbet could have been less sweet, but then we wondered if decreasing the sugar would have given the frozen sorbet a less lovely texture; it was bright and effervescent, though nothing bubbly had been added!</p>"}]}