{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["chicken", "Essentials of Classic Italian Cooking", "Marcella Hazan", "roast chicken", "Serious Eats Essentials"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Roast Chicken", "link": "https://www.seriouseats.com/recipes/2008/02/essentials-roast-chicken-recipe.html", "description": "Roasting chicken always, always reminds me of Jeffrey Steingarten. I think the moment my crush on him bloomed into undying love was when I read his essay “As the Spit Turns” in the August 1999 issue of Vogue (reprinted in...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "Mains", "Serious Eats Essentials"], "recipeIngredient": ["A 3- to 4-pound chicken", "Salt", "Freshly ground black pepper", "2 rather small lemons [I have also used 1 large one with success, in a smallish chicken]"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Wash the chicken, inside and out, in cold water. Remove any loose bits of fat. Let the bird sit for about 10 minutes on a slightly tilted plate to let all the water drain out of it. Pat it completely dry with paper towels. Season generously with salt and pepper, rubbing it all over the body and into the cavity.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the lemons in cold water and dry completely. Roll on a counter to soften and then puncture each lemon in at least 20 places, using a toothpick, trussing needle, or fork. Put both lemons in the cavity.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Close the cavity opening with toothpicks or trussing needle and string. Close it well, but don’t make it absolutely airtight or the chicken may burst. Run kitchen string from one leg to the other, tying it at both ends. Leave the legs in their natural position without pulling them tight. If the skin is unbroken, the chicken will puff up as it cooks; the string is just there to keep the thighs from spreading apart and splitting the skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken breast-down in a roasting pan. Do not add any fat: it isn’t necessary. Put the bird in the upper third of the preheated oven. After 30 minutes, turn the chicken so that it is on its back, breast facing up. Be careful not to puncture the skin while turning. Cook for another 30-35 minutes, then turn the oven up to 400°F and cook 20 minutes more. Calculate between 20 and 25 minutes’ total cooking time for each pound of chicken. You do not need to turn the chicken again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whether your bird has puffed up or not, bring it to the table whole and leave the lemons inside until it is carved and opened. The juices that run out are perfectly delicious; be sure to spoon them over the chicken slices. The lemons will have shriveled up, but they still contain some juice; do not squeeze them, as they may squirt.</p>"}]}