{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081224Beignets.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["beignets", "desserts", "hanukkah", "hanukkah desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beignets with Lavender Sugar and Apricot Sauce", "link": "https://www.seriouseats.com/recipes/2008/12/the-sixth-night-of-hanukkah-beignets-with-lavender-sugar-and-apricot-sauce-recipe.html", "description": "There is nothing like a homemade donut. When I was a little girl, my grandmother would make beignets, French donuts, and cover them in warm honey. Donuts are traditional on Hanukkah, and are classically filled with jelly. In the winter...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Doughnuts"], "recipeIngredient": ["<strong>Pâte à Choux</strong> ", "1 stick of butter", "2 1/2 tablespoons sugar", "1/4 teaspoon salt", "1 cup water", "1 cup flour", "3 eggs", "Vegetable oil for frying", "<strong>Lavender Sugar</strong>", "1 cup sugar", "1/4 teaspoon dried edible lavender blossoms (optional)", "<strong>Apricot Sauce</strong>", "1 cup good apricot jam", "1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the pâte à choux by melting the butter in a saucepan.  Add the sugar, salt, and water, and bring to a simmer to melt the sugar and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the heat off the pan, and whisk in the flour.  Once it is incorporated, bring the pan back to the heat, and stir with a wooden spoon until the dough begins to pull away from the sides of the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the dough into a bowl, and using an electric hand mixer, beat the dough for a few seconds on medium speed to cool it down. Incorporate the eggs, one at a time, working quickly to incorporate them into the hot dough so they do not scramble. Set the dough aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the lavender sugar by putting the sugar and the lavender in a food processor, and blitzing it until the lavender is broken up throughout the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the apricot sauce by blending the apricot jam in a food processor to even out the fruity lumps of the preserves.  Pour the jam into a pan and heat on low heat with the added tablespoon of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fry the beignets, fill a pot halfway with vegetable oil, and heat over medium low heat.  To test the oil, drop a little crumb of choux pastry into the pot.  It should sink, and then start to rise, surrounded by little fizzing bubbles.  You do not want to fry the beignets too hot; they will become brown on the outside, and will remain raw on the inside.  Instead, you want them to gently simmer in the oil, surrounded by bubbles, but not browning intensely.  Drop a teaspoon of dough into the oil.  It will puff; then appear to crack, and will be cooked to a very light gold in about 8 minutes.  The crack that occurs in the dough signifies that the interior dough has cooked and created an air pocket; it is the sign you are looking for.  Once the dough has “cracked,” cook for a couple more minutes to ensure the light golden color and crisp exterior.  Be careful not to overcrowd the pan with raw beignets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beignets on paper towels, and immediately toss them hot into the lavender sugar, and roll them around to coat.  Serve with the warm apricot sauce on the side.</p>"}]}