{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["candied fruits", "chocolate cakes", "Chocolate Epiphany", "Cook the Book", "desserts", "flourless", "francois payard", "grapefruit", "hazelnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Flourless Milk Chocolate Cake with Grapefruit and Hazelnuts", "link": "https://www.seriouseats.com/recipes/2008/08/flourless-milk-chocolate-cake-with-grapefruit-hazelnuts-recipe.html", "description": "Been wondering all week about the gooey, nut-studded, fudge-drenched dessert on the cover of Chocolate Epiphany? It's a flourless milk chocolate cake with grapefruit and hazelnuts. The recipe is simple to prepare and yields extraordinary results. The mild milk chocolate...", "totalTime": null, "recipeYield": "one 9-inch cake", "recipeCategory": ["Cook the Book", "Desserts", "Grapefruit", "Nuts"], "recipeIngredient": ["<strong>For the candied grapefruit:</strong>", "1grapefruit, scrubbed thoroughly ", "1 cup plus 2 tablespoons granulated sugar ", "1 tablespoon light corn syrup ", "<strong>For the milk chocolate cake:</strong>", "Vegetable cooking spray, for the pan ", "4 1/2 ounces milk chocolate, chopped ", "6 tablespoons unsalted butter ", "2 large eggs ", "2 large egg yolks ", "1/3 cup firmly packed light brown sugar ", "1/4 cup hazelnut flour or finely ground blanched hazelnuts ", "1/3 cup hazelnuts, toasted and chopped ", "<strong>For the milk chocolate sauce:</strong>", "1 pound milk chocolate", "2 cups whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the grapefruit into quarters. Remove the pulp and as much of the white pith as possible. Place the peels in a medium saucepan, fill it with water, and bring to a boil. Drain the water, then fill the pot with fresh water and bring to a boil again. Repeat this process a third time. Drain the water completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the peels, granulated sugar, and corn syrup with 1/2 cup water in the saucepan, and place over low heat. Simmer for about 1 hour, until the peels become slightly translucent. Remove from the heat, and let them sit in the syrup until cool. You can keep the peels in the syrup, covered and refrigerated, for up to 2 weeks. Drain and finely chop 1/2 cup of the peel to add to the cake batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a rack in the center of the oven and preheat the oven to 350°F. Spray the sides and bottom of a round 9-inch cake pan with vegetable cooking spray. Cut a 9-inch round piece of parchment paper and place it at the bottom of the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium pot one-third full with water and bring it to a gentle simmer over medium heat. Place the chocolate and butter in a bowl that will fit snuggly on top of the pot but not touch the water. Reduce the heat to low and place the bowl over the pot. Stir occasionally until the chocolate is melted and the mixture is smooth. Remove from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the eggs, egg yolks, and brown sugar in a medium bowl and whisk until the mixture turns a pale yellow and increases in volume. With a silicone spatula, fold in the hazelnut flour, hazelnuts, and candied grapefruit. Fold in the chocolate until it is well incorporated. Pour the batter into the prepared pan, and bake for about 40 minutes, until a wooden skewer inserted in the center of the cake comes out clean and the sides slightly pull back from the edges of the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cake from the oven and let it cool in the pan for 5 minutes. Run a knife along the sides of the cake to release it from the pan, unmold the cake, and let it cool to room temperature on a wire rack. You can make the cake 1 or 2 days ahead. Keep it tightly wrapped in a cool, dry environment. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chocolate in a medium heat-proof bowl. Bring the milk to a boil in a small saucepan over medium-high heat. Pour the milk over the chocolate and let the heat melt the chocolate. Stir gently, then strain the mixture through a fine-mesh sieve over a bowl. Let it cool until it is lukewarm or at room temperature. You can make the sauce up to 3 days ahead. Keep it covered and refrigerated, and let it come back to room temperature before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cut the cake into slices and serve with the chocolate sauce. </p>"}]}