{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/porterhousefeatured.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["beef", "grilling", "porterhouse steaks", "steaks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Porterhouse Steak with Blue Cheese Butter", "link": "https://www.seriouseats.com/recipes/2008/07/grilling-porterhouse-with-blue-cheese-butter-recipe.html", "description": "Going through the list of All-American grilling items for Fourth of July, I was coming up short with ground not already covered.  Ribs, chicken, sausage, and, to a lesser extent, hamburgers have all had their day in the sun. So if it wasn't going to be something different, it was going to be something bigger, because that's the American way.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Cheese", "Grilling", "Mains"], "recipeIngredient": ["4 tablespoons butter, at room temperature", "3 tablespoons blue cheese", "1 small shallot, minced", "1 teaspoon chopped fresh parsley", "1 small garlic glove, minced", "2 Porterhouse steaks, 1 1/2\" thick", "Kosher salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the steaks liberally with salt and pepper and allow it to come to room temperature while preparing the grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a chimney 3/4 full of charcoal.  While the charcoal is lighting, mix the butter, blue cheese, shallot, parsley, and garlic together in a small bowl.  Season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When charcoal is fully lit and covered in gray ash, pour coals out and arrange them on one side of the charcoal grate, keeping the other side empty.  Scrub and oil the grill grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the steaks directly over the coals for 6 minutes on each side, with the tenderloin portion of the steaks always facing the cooler side of the grill.  Move the steaks to the cool side of the grill with the bone side facing the fire. Cover and continue to cook until desired doneness (about 6 additional minutes for medium-rare), flipping halfway through cooking.  Remove steaks from the grill and allow to rest for 10 minutes. Top each steak with the blue cheese butter mixture and serve.</p>"}]}