{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["escarole", "Essentials of Classic Italian Cooking", "Italian", "Marcella Hazan", "stuffed bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Cookbooks: Baked Escarole Torta", "link": "https://www.seriouseats.com/recipes/2008/02/classic-cookbooks-baked-escarole-torta-recipe.html", "description": "My biggest liability in the kitchen is my extreme pokiness at doing pretty much everything. Chopping onions, thinking through recipes, and (especially) washing vegetables—I’m just not speedy. Cookbooks that list prep times always make me laugh (a little tightly) because...", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Classic Cookbooks"], "recipeIngredient": ["2 2/3 cups unbleached flour", "1 teaspoon salt", "Freshly ground black pepper", "1/3 package active dry yeast, dissolved in 1 cup lukewarm water", "2 tablespoons lard, softened well at room temperature, or 3 tablespoons extra virgin Olive oil [I used olive oil]", "3 pounds fresh escarole", "1/3 cup extra virgin olive oil", "2 teaspoons chopped garlic", "3 tablespoons capers", "10 round, black Greek olives, pitted and quartered", "7 flat anchovy fillets, chopped into 1/2 inch pieces [I used 3 anchovy filets and still found it to be a bit much, but I am not deeply devoted to anchovies]", "3 tablespoons pine nuts "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mound the flour in a bowl (or on a work surface, if you’re feeling confident) and make a hollow in its peak. Put the salt, a few grindings of pepper, the dissolved yeast, and the softened lard (or olive oil) into its peak. Pull together and knead for about 8 minutes. It is best if the dough is kept soft, but if it is difficult to handle, either add another tablespoon or two of flour or knead it in the food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the kneaded dough into a ball and put it into a lightly floured bowl. Cover the bowl with a damp, doubled-up cloth towel and put it in a warm, protected corner until the dough has doubled in bulk, 1- 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F and prepare a rack in the uppermost position.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the dough is rising, prepare the filling. Trim bruised or discolored outer leaves from the escarole. Chop the rest into 2-inch long pieces. Soak in several changes of cold water until no grit or dirt remains.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 3-4 quarts water to a boil, add salt, and drop in the escarole. Cook until tender, about 15 minutes, depending on its youth and freshness. Drain. As soon as it is cool enough to handle, squeeze gently to remove as much moisture as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the olive oil and garlic in a large sauté pan, turn the heat to medium, and cook the garlic, stirring, until it becomes colored a pale gold. Add the escarole, turning it over once or twice to coat it well. Reduce heat to medium low and cook for 10 minutes, turning the escarole from time to time. If the pan juices are watery, turn the heat up and reduce them quickly. Stir the capers, and then the olives, into the escarole. Remove from heat. Stir in the anchovies and pine nuts. Taste for salt, pour the contents of the pan into a bowl, and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled in bulk, divide it into 2 unequal parts, one twice the size of the other. Roll out the larger piece of dough into a circular sheet large enough to line the bottom and sides of a 10-inch springform pan (it should end up about 1/4 inch thick). To simplify transferring this to the pan, roll the dough out on a piece of lightly floured wax or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear the inside of the springform pan with butter. Transfer the large circular sheet of dough to the pan, covering the bottom and letting it come up the sides. Smooth the dough, flattening and evening off any particularly bulky creases with your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour all the escarole filling from the bowl into the pan and level it off with a spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the remaining piece of dough until it is large enough to cover the top of the pan. Lay it over the filling, covering it completely. Press the edge of the top sheet of dough against the edge of the sheet lining the pan. Make a tight seal all around, folding any excess dough toward the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place on the uppermost rack of the preheated oven and bake until the torta swells slightly and the top becomes colored a pale gold, about 45 minutes. When you take it out of the oven, unlatch the pan’s spring, and remove the hoop. Allow the torta to settle a few minutes before loosening it from the bottom and transferring it to a serving platter. Serve either lukewarm or at room temperature.</p>"}]}