{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["almonds", "Amy Scherber", "Amy's Bread", "brioche", "Cook the Book", "dessert", "The Sweeter Side of Amy's Bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Almond Brioche Toast", "link": "https://www.seriouseats.com/recipes/2008/10/almond-brioche-toast-recipe.html", "description": "Instead of throwing away day-old brioche, penny-wise French bakers often make crunchy, creamy, custard-soaked and almond-encrusted toast. But at Amy's Bread in New York City, the Almond Brioche Toast is so popular that bakers must use fresh loaves in order...", "totalTime": null, "recipeYield": "9 slices of toast", "recipeCategory": ["Bread", "Breakfast and Brunch", "Cook the Book", "Desserts", "Nuts"], "recipeIngredient": ["<strong>For the Almond Syrup:</strong>", "1/2 cup (113 g/4 oz) water", "1/2 cup (100 g/2.52 oz) sugar", "1/2 teaspoon almond extract", "&nbsp", "<strong>For the Almond Cream:</strong>", "1/2 cup (84 g/2.96 oz) almond meal", "1/2 cup (55 g/1.94 oz) confectioners' sugar", "3/4 cup (173 g/6.1 oz) unsalted butter, room temperature", "3/4 cup (150 g/5.29 oz) sugar", "3 large eggs, at room temperature, slightly beaten", "1 1/4 teaspoons almond extract", "&nbsp", "<strong>For the Toast:</strong>", "1 large brioche loaf, about 10 x 5 inches", "9 tablespoons (54 g/1.9 oz) sliced almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the almond syrup: In a small heavy-duty saucepan, bring the water and sugar to a boil over medium-high heat to dissolve the sugar, stirring occasionally. Remove from the heat and allow the syrup to cool for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the syrup into a container with a tight-fitting lid and allow it to cool completely, then add the almond extract, and stir briefly. Cover and refrigerate the syrup until ready to use. It lasts for several weeks when refrigerated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the almond cream: Stir the almond meal and confectioners' sugar with a fork to combine them and break up any lumps of sugar. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a mixer fitted with a whisk or beaters, cream the butter and sugar at medium-high speed until it's light and fluffy, about 2 minutes. Add the almond meal mixture to the creamed butter and mix just to combine. Add the eggs and the almond extract to the creamed butter and mix on medium-high speed until light and fluffy, about 2 minutes. Be careful not to overmix, or the cream will break down, developing a thin, runny texture. If this happens, you'll need to chill the broken cream thoroughly to thicken it a little, and then use it directly from the refrigerator while it's still cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the almond cream to an airtight container with a lid and chill it for at least 1 hour before using. It will keep for about a week in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the Almond Brioche Toast: Preheat the oven to 400ºF and line two 12 x 17-inch sheet pans with baking parchment. Trim a thin slice of crust from each end of the brioche loaf and cut the loaf into 9 slices, each 3/4-inch thick. Place 4 slices on one prepared pan and 5 on the other.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a pastry brush, moisten the top side of each slice of bread lightly with the almond syrup, making sure to get some syrup around the outer edges of the slice. If your bread is more than a day old, you may need to be more generous with the syrup. Place about 4 tablespoons (65 g/2.3 oz) of almond cream in the center of each slice of bread. Leaving a thick pile of cream in the middle of the slice, use a small spatula or knife to spread out a thin layer of cream to it comes to within 1/4 inch of the edges. Sprinkle the center of each slice with 1 tablespoon of the sliced almonds.</p>"}]}