{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["butternut squash", "fall recipes", "holidays", "Lidia Bastianich", "thanksgiving", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lidia Bastianich's Squash Tiramisu", "link": "https://www.seriouseats.com/recipes/2008/11/lidia-bastianich-squash-tiramisu-recipe.html", "description": "More holiday recipes from Lidia Bastianich Octopus and Potato Salad Swiss Chard Crostata Broccoli Rabe with Oil and Garlic Roast Turkey Apple Strudel Cranberry-Quince Chutney...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["5 large eggs ", "5 or 6 lemons ", "2 cups sugar", "½ cup limoncello liqueur", "1 1/2 cup water", "6 cups of 1/2-inch cleaned and peeled butternut squash cubes", "1 pound (2 cups) mascarpone, at room temperature ", "40 ladyfingers (preferably imported Italian Savoiardi) or more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour just enough water in the double boiler pan so the water level is right below the bottom of the mixing bowl when it is sitting in the pan. Separate the eggs, putting yolks into the large bowl of the double boiler and the whites into another stainless bowl for whipping by hand or with an electric mixer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the zest of 2 or more of the lemons, using a fine grater, to get 2 tablespoons of zest. Squeeze out and strain the juice of these and other lemons to get 1 cup of fresh lemon juice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the base for the tiramisù, heat the water in the pan to a steady simmer. Off heat, beat the egg yolks with 1/4 cup of the sugar and ½ cup of the limoncello until well blended. Set the bowl over the simmering water and whisk constantly, frequently scraping the whisk around the sides and bottom of the bowl, as the egg mixture expands and heats into a frothy sponge, 5 minutes or longer. When the sponge has thickened enough to form a ribbon when it drops on the surface, take the bowl off the double boiler pan and let it cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour all of the lemon juice, the water and 1 cup of the sugar in a saucepan. Add the squash and bring to a boil, stirring to dissolve the sugar, and cook for 20 minutes, until the squash is cooked and soft. Drain the squash and collect the syrup. Let the syrup and squash cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another large bowl, stir the mascarpone with a wooden spoon to soften it then drop in the grated lemon zest and beat until light and creamy. Whip the egg whites with the remaining 1/4 cup sugar, by hand or by machine, until it holds moderately firm peaks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sponge (or zabaglione) is cooled, scrape about a third of it over the mascarpone and fold it in with a large rubber spatula. Fold in the rest of the zabaglione in 2 or 3 additions, fold in the cooked and drained squash. Now fold in the whipped egg whites in several additions, until the mascarpone cream is light and all is evenly blended. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour some of the cooled syrup, no deeper than 1/4-inch depth, into the pan to moisten the ladyfingers (Savoiardi). One at a time, roll a ladyfinger in the syrup and place it in the dessert pan. Wet each cookie briefly--if it soaks up too much syrup, it will fall apart. Arrange the moistened ladyfingers in neat tight rows, filling the bottom of the pan completely. You should be able to fit in about 20 ladyfingers in a single layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop half of the mascarpone cream mixture onto the ladyfingers and smooth it to fill the pan and cover them. Dip and arrange a second layer of ladyfingers in the pan and cover it completely with the remainder of the cream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smooth the cream with the spatula and seal the tiramisù airtight in plastic wrap. Before serving, refrigerate for 6 hours (up to 2 days) or put it in the freezer for 2 hours To serve, cut portions of tiramisù in any size you like and lift each out of the pan onto dessert plates.</p>"}]}