{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081120-honey-smoked-turkey.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["barbecue", "smoked turkey", "thanksgiving", "Thanksgiving turkeys", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Honey-Brined and Smoked Turkey", "link": "https://www.seriouseats.com/recipes/2008/11/honey-brined-smoked-turkey-recipe-thanksgiving.html", "description": "I thought I had the ultimate turkey the year my family took it to the fryer, but I was mistaken. I have come to realize that true turkey nirvana is reached when the bird is brined and smoked, which creates...", "totalTime": null, "recipeYield": "8-10", "recipeCategory": ["Grilling", "Thanksgiving", "Turkey"], "recipeIngredient": ["1 turkey, 12-14 lbs., washed", "7 quarts very cold water", "2 quarts of vegetable stock", "1 pound honey", "1 cup kosher salt", "1 bunch of fresh thyme", "2 tablespoons whole peppercorns", "Vegetable Oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1 quart of water, the honey and salt in a medium sauce pan over medium heat.  Stir until salt is completely dissolved and immediately remove from heat.  Pour mixture into your brining container and add 6 quarts of cold water, vegetable stock, thyme, and peppercorns and stir to combine.  Place the turkey in the brine, adding a weight to keep it completely submerged if necessary, place in the refrigerator and brine for 12 to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the turkey from the brine and pat dry with paper towels.  Place turkey on a rack over a rimmed baking sheet and allow to air-dry overnight in the refrigerator. <em>(This step is optional, but will result in a crisper skin.)</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the turkey from the refrigerator, fold the wings under the body and tie the legs together.  Brush turkey lightly with with vegetable oil and allow to come to room temperature while you prepare the smoker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fire up your smoker between 350 to 400°F.  Add 2 to 3 small chunks of light smoke wood, like apple or cherry.  When the wood is burning and producing smoke, place the turkey in the smoker.  Smoke until an instant read thermometer reads 165°F in the thickest part of the breast, about 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the turkey from the smoker and allow to cool, uncovered, for 20 to 30 minutes.  Carve and serve.</p>"}]}