{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Lynne Rossetto Kasper", "pasta", "pesto", "pistachios", "Sally Swift", "The Splendid Table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pasta with Chopping Board Pistachio Pesto", "link": "https://www.seriouseats.com/recipes/2008/06/pasta-with-chopping-board-pistachio-pesto-recipe.html", "description": "The only equipment needed to prepare today's Cook the Book recipe for Pasta with Chopping-Board Pistachio Pesto, excerpted from The Splendid Table's How to Eat Supper, is a good chef's knife and a pot. Dicing the nuts, scallions, garlic, and...", "totalTime": "", "recipeYield": "4 to 6 servings", "recipeCategory": ["Cook the Book", "Nuts"], "recipeIngredient": ["5 quarts salted water in a 6-quart pot", "<strong>The Pesto:</strong>", "1/4 teaspoon salt", "1/8 teaspoon freshly ground black pepper, or to taste", "2 large garlic cloves", "1 tight-packed cup coarse-chopped fresh chives or scallion tops", "4 tight-packed tablespoons fresh basil leaves", "2 tablespoons fine-chopped red onion", "1/3 cup shelled salted pistachios or almonds", "2 tablespoons good-tasting extra-virgin olive oil", "<strong>The Pasta and Finish:</strong>", "1 pound imported spaghetti or linguine", "1 tablespoon good-tasting extra-virgin olive oil", "2 tablespoons fine-chopped red onion", "1 cup (4 ounces) grated Asiago or Stella Fontinella cheese "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the salted water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pesto, pile the salt and pepper on a chopping board. Crush the garlic into it with the side of a large knife, and fine chop. Add the chives, basil, and onion, and continue chopping until the pieces are cut very fine. Add the nuts to the pile and continue cutting until they are coarse chopped. Directly on the board, blend in the oil. Taste for salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the pasta into the boiling water and cool and a fierce boil, stirring often, until it is tender but still a little firm to the bite. Scoop out 1 cup of the pasta water and set it aside. Quickly drain the pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Film the empty pasta pot with the 1 tablespoon olive oil. Place it over Medium heat, and sauté the fine-chopped onion in it for 1 minute. Stir in the pesto. Warm it for only a few seconds over medium heat to let the flavors blossom&mdash;do not cook it.  Stir in about 1/3 cup of the reserved pasta water to stretch the sauce. Immediately pull the pot off the heat. Add the drained pasta to the pot, and toss with the pesto and the cheese, adding more pasta water if the mixture seems very dry. Taste again for seasoning, and serve.</p>"}]}