{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["A Platter of Figs", "Cook the Book", "David Tanis", "lamb", "osso buco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Lamb Osso Bucco with Orange, Lemon, and Capers", "link": "https://www.seriouseats.com/recipes/2008/09/lamb-osso-bucco-with-orange-lemon-and-capers-recipe.html", "description": "Traditional osso buco is made with veal shanks and served sprinkled with a simple gremolata made from parsley, lemon zest, and garlic. In today's Cook the Book recipe, excerpted from A Platter of Figs, chef and author David Tanis substitutes...", "totalTime": "", "recipeYield": "8-10 servings", "recipeCategory": ["Cook the Book", "Lamb", "Mains"], "recipeIngredient": ["10 lamb shanks, cut crosswise into thirds (have the butcher do this)", "Salt and pepper", "2 large onions", "1 large carrot, peeled and chunked", "1 celery stalk, coarsely chopped", "2 bay leaves", "1 thyme sprig", "A few cloves", "3 tablespoons butter", "3 tablespoons all purpose flour", "2 tablespoons tomato paste", "1 tablespoon dried porcini (optional)", "2 cups dry white wine", "Gremolata (recipe follows)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the excess fat from the lamb shanks and season them generously with salt and pepper. Put the shanks in a large heavy-bottomed pot and cover with cold water. Add the onions, carrot, celery, bay leaves, thyme, and cloves. Bring the water to a boil, skimming any surface foam, then turn the flame to low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pot and simmer the meat until cooked through but still firm, about 1 hour. Remove the meat, the strain and reserve the broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, melt the butter over medium heat. Stir in the flour and brown carefully, stirring, until just past golden. Add the tomato paste and porcini powder, if using. Slowly whisk in 10 cups of the reserved lamb broth, 1 cup at a time, allowing the sauce to thicken after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer the sauce gently for 15 minutes. Taste and adjust the seasoning. The finished sauce will be only barely thickened but will have good color and body.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375ºF. Put the cooked lamb shanks in two low earthenware dishes, in one layer, with the bones sticking up. Mix the wine into the sauce and pour the sauce over the shanks to come halfway up each dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the lamb shanks, uncovered, until the tops are well browned, about 20 minutes. Now cover the shanks, reduce the heat to 350ºF, and bake for another 40 minutes or so, until the meat is quite tender. At this point you can serve the shanks hot from the oven, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To reheat, bring the dish to room temperature and bake, covered, at 400ºF for 15 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the lamb shanks steaming hot directly from the baking dishes. Sprinkle with gremolata liberally over the entire dishes just before bringing them to the table. Serve each diner 3 meaty bones with a good spoonful of sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Gremolata</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop only the leaves of 1 large bunch flat-leaf parsley&mdash;not too fine&mdash;and put it in a bowl. Remove the zest from 1 orange and 1 lemon with a vegetable peeler or zester. Finely mince the zest. Mash 2 garlic cloves to a fine paste with a little salt. Chop 2 tablespoons capes. Cut a few scallions into fine slivers or chop fine. Add the zest, garlic, capers, and scallions to the chopped parsley and mix well.</p>"}]}