{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["Arthur Schwarz", "brunch", "pancakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Childs' Wheat Cakes", "link": "https://www.seriouseats.com/recipes/2008/07/childs-wheat-cakes-pancake-recipe.html", "description": "My friend Arthur Schwartz wrote a wonderful book called New York City Food, which features stories and recipes from Gotham's rich culinary past. Included is this pancake recipe from the legendary Child's old-fashioned coffee shop chain. Arthur says vegetable shortening...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pancake", "Vegetarian"], "recipeIngredient": ["1 egg", "1 1/2 cups whole milk", "1 1/2 cups all-purpose flour", "2 tablespoons sugar", "1/4 teaspoon salt", "1 tablespoon plus 1/4 teaspoon baking powder", "1/4 cup melted unsalted butter or melted then cooled vegetable shortening"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, beat the egg slightly and mix in the milk.  Do not overbeat the egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl, sift together the flour, sugar, salt, and baking powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a whisk, blend the dry ingredients into the wet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the shortening until well blended.  (The mixture can stand for several hours.  Keep refrigerated until 10 minutes before baking, then return to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>LIghtly grease a griddle or a large skillet over medium heat.  (The griddle needs to be greased only for the first batch.) Take care not to overheat the pan.  A drop of water should sizzle on the surface, but not dance across it.  Try out one pancake befoer proceeding with all the batter.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into a measuring cup.  (You should have 3 cups.) Use a scant 1/4 cup batter for each pancake.  If the griddle is too hot, the pancakes will develop ray-like marks on their first side; if too hot, turn down the heat.  The perfect cakes are high and fluffy and dry.   As soon as the tops of the pancakes are covered with bubbles that are bursting, flip them over.  Cook until the second side is lightly browned, 2-3 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately.  (If necessary, keep the baked cakes hot in a 200-degree oven while baking the remainder.) </p>"}]}