{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["baked beans", "beans", "fat", "Jennifer McLagan", "salt pork", "sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Boston-Style Baked Beans", "link": "https://www.seriouseats.com/recipes/2008/10/boston-style-baked-beans-recipe.html", "description": "The following recipe is from the October 15th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Baked beans get a bad rap. That's because most people think of the canned, mushy brown...", "totalTime": null, "recipeYield": "6 servings", "recipeCategory": ["Pork", "Sides"], "recipeIngredient": ["1 pound dried white pea beans, soaked overnight in cold water", "6 cipollini or small onions, peeled", "3 whole cloves", "1 pound salt pork", "1/3 cup firmly packed brown sugar", "1/4 cup molasses", "1 tablespoon dried mustard", "1 teaspoon coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans, discarding the soaking liquid, and place them in a large saucepan. Cover the beans with water and bring to a boil. Remove the pan from the heat, skim off any scum that has risen to the surface, and drain the beans, reserving the cooking water. Set the cooking liquid aside and transfer the beans to a heavy casserole or Dutch oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 275ºF. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skewer 3 of the onions with a clove each and add them, with the remaining onions, to the beans. Cut the salt pork into 2-inch pieces and add to the beans. Mix the brown sugar, molasses, mustard powder, and salt with about 1 cup of the cooking liquid and pour over the beans and pork, stirring to mix. Add enough of the reserved cooking liquid to cover the beans and set the remaining liquid aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the beans and cook for 4 hours, checking from time to time to make sure that the beans are always covered with liquid, and adding more of the reserved cooking liquid as necessary. After 4 hours the beans should be just tender, but the cooking time will vary depending on the age of your dried beans; older ones will take longer to cook. Uncover the pan and continue to cook them for another hour to thicken the sauce and color the salt pork pieces. </p>"}]}