{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Sarah Wolf"}, "recipeCuisine": "", "keywords": ["Elizabeth Karmel", "grilling", "pork", "rib", "ribs", "Taming the Flame"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Memphis-Style Dry Ribs With Spicy Drippings", "link": "https://www.seriouseats.com/recipes/2008/06/memphis-style-dry-ribs-with-spicy-drippings-recipe.html", "description": "...", "totalTime": null, "recipeYield": "4 to 8", "recipeCategory": ["Mains", "Pork"], "recipeIngredient": ["1/4 cup kosher salt", "1/4 cup sugar", "2 tablespoons black peppercorns, coarsely ground", "1 tablespoon mustard seeds", "1 tablespoon cumin seeds", "1 tablespoon fennel seeds", "1 tablespoon sweet paprika", "2 teaspoons celery salt", "2 teaspoons red chile flakes", "2 teaspoons dried oregano", "1 teaspoon dried thyme", "1 1/2 cups apple juice", "1 1/2 cups water", "1/2 tablespoon fine sea salt", "4 slabs back ribs, about 3 pounds each", "Special equipment: disposable aluminum turkey roasting pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the rub: Combine all the spices in a small bowl. Divide the mixture in half. Put half of the rub in a spice (coffee) grinder or mortar and pestle and grind the spices to a medium consistency. Mix that with the reserved spice rub. (This will make a rub that is easily absorbed by the meat during \"rubbing\" and still has texture.) Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the mop: Mix 1 tablespoon of the dry rub with the apple juice, water, and salt until the salt is dissolved. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Build a charcoal fire or preheat a gas grill, setting up the grill for indirect heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the silver skin from the back of the ribs, if desired. Sprinkle the ribs liberally with the spice rub and let sit, covered, for 15 to 20 minutes. Place an aluminum pan on top of the cooking grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the ribs on a rib rack. Place the ribs in the aluminum pan on the center of the cooking grate over indirect medium-low heat. Pour 1 cup of the apple juice mop into the drip pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill covered (at about 325&deg;F, if your grill has a thermometer) for 1 1/2 to 2 hours or until the meat is tender and has pulled back from the ends of the rib bones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Leave ribs untended for the first 30 minutes&mdash;this means no peeking. Then, using the apple juice mixture, baste or \"mop\" the ribs every 20 minutes, adding a little more apple juice mop (about 1/4 cup) to the drip pan each time. You will do this twice. When the mop is gone and the juices have accumulated in the drip pan, baste the ribs with the drippings one more time. If the ribs start to burn on the edges, stack them on top of one another in the very center of the foil pan and lower the heat slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 10 minutes before the ribs are done, remove them from the pan and place them on the cooking grate over indirect heat to finish browning and crisp the surface crust. (If your ribs are already crispy and have a caramelized crust on the outside, this last step may not be necessary.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour the pan drippings through a fine sieve or fine-mesh strainer into a saucepan and bring to a boil, adding any leftover apple juice mop. Taste and adjust the seasonings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ribs from the grill and let them rest for 10 minutes before cutting into individual or 2 to 3 rib portions. Serve the ribs with warm drippings on the side.</p>"}]}