{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "dips", "hors d'oeuvres", "Martha Stewart", "Super Bowl dips", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: White Bean and Mustard Greens Dip", "link": "https://www.seriouseats.com/recipes/2008/12/white-bean-and-mustard-greens-dip-recipe.html", "description": "Martha Stewart does this recipe an injustice by leaving \"bacon\" out of its title. The white beans are lusciously creamy, of course, and the mustard greens pleasantly peppery, but it's the five slices of bacon, diced and crisped, per 1...", "totalTime": "", "recipeYield": "1 1/2 cups", "recipeCategory": ["Vegetarian"], "recipeIngredient": ["5 slices smoked bacon, cut into 1/4-inch dice", "2 garlic cloves, minced", "1/4 cup olive oil", "2 ounces mustard greens, cleaned, roughly chopped", "1 15-ounce can cannellini beans, drained with liquid reserved", "1 tablespoon fresh lemon juice", "Kosher salt and freshly ground black pepper", "Zest of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium skillet over medium heat, cook the bacon until it is brown and crispy. Using a slotted spoon, remove the bacon from the pan and set aside to drain on a paper towel. Pour off and discard all but 1 teaspoon of fat from the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the heat, add the garlic, and cook to soften, about 30 seconds. Add 1 tablespoon of the olive oil and the mustard greens, and reduce the heat to medium-low. Stirring occasionally, cook until the greens are tender, 15 to 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a serving bowl. Place the beans, the sage, and the lemon juice in the bowl of a food processor. Process until combined. With the machine running, add the remaining oil through the feed tube. Season with salt and pepper to taste. If necessary, thin out the bean puree with the reserved bean liquid. Stir in all but 1 tablespoon of the reserved mustard greens. Reserve 1 tablespoon of bacon for garnish. Fold in the remaining bacon and half the lemon zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to the warm serving bowl and sprinkle ith the remaining bacon, mustard greens, and lemon zest. The dip may be reheated in an ovenproof dish in a 275°F oven untill warm, 10 to 15 minutes. Serve warm.</p>"}]}