{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["beef", "hamburgers", "mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken-Fried Hamburgers", "link": "https://www.seriouseats.com/recipes/2008/10/shopsins-chicken-fried-hamburgers-recipe.html", "description": "The following recipe is from the October 1st edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! This week's recipe is not for the faint, weak, or ill at heart! Kenny Shopsin's chicken-fried...", "totalTime": null, "recipeYield": "4 servings", "recipeCategory": ["Beef", "Burger", "Mains"], "recipeIngredient": ["Peanut oil for deep frying", "1 3/4 pounds chopped meat (20 to 30 percent fat)", "Salt and pepper", "4 extra-large eggs", "1 1/2 cups heavy cream", "All-purpose flour for dredging", "Butter for the buns", "4 martin's potato buns, or whatever hamburger bun you like", "Whatever burger accoutrements you like"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a deep fryer or a large potful of peanut oil over high heat to 375ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the meat into four 7-ounce patties, flattening them slightly. Season the patties with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the eggs and cream together in a shallow bowl. Put the flour in a separate bowl or pie pan. Dredge one of the hamburger patties in the flour and brush off the excess. (This is important. If you don't brush off the excess flour, it will fall off in the fryer and you will end up with bald spots on your burger crust.) Dunk the floured patty in the egg-and-cream mixture, lift, drain, and repeat, dumping the patties back in the flour and then back in the egg and cream, until you have gone through the process a total of three times. Now you should have a reasonably heavy coating, and you'll also have a hardened coating on your fingers because for some reason it sticks to your fingers even better than it sticks to the burgers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully place the burger in the oil and repeat with the remaining burgers, being careful not to overcrowd the deep fryer or pot. Cook the burgers for 3 or 4 minutes, until the crust is golden brown. While the burgers are cooking, butter and lightly toast the buns in whatever way is convenient for you. Serve deep-fried burgers like you would any hamburger, on toasted buns with whatever s--- you like.</p>"}]}