{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080701-lentils.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["apricots", "brown rice", "Eating for Two", "grains", "iron", "lentils", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eating for Two: Brown Rice with Lentils and Apricots", "link": "https://www.seriouseats.com/recipes/2008/07/brown-rice-with-lentils-and-apricots-recipe.html", "description": "Photograph from WordRidden on Flickr I’ve always been a little smug about avoiding anemia and iron deficiency. In my mid-twenties my primary care doctor would always explain that it was not uncommon in women my age, but that I was...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Apricot", "Beans and Pulses", "Dairy-Free", "Pasta", "Salads", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 cup lentils, washed and picked over; plain old lentils are good here (as opposed to beluga or Puy)", "1 cup any brown rice, rinsed", "About 3 1/4 cups beef, chicken, or vegetable stock or water, plus more as needed (I use water)", "1 bay leaf", "About 1 teaspoon salt", "Freshly ground black pepper", "1 teaspoon wine vinegar", "3 tablespoons butter or extra-virgin olive oil", "1 medium onion, chopped", "1/2 cup diced dried apricots or other dried fruit (raisins are fine)", "Minced fresh parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the lentils and rice together in a medium saucepan. Add enough liquid to cover by at least 2 inches, about 3 cups. Turn the heat to high and add the bay leaf, about 1 teaspoon salt, some pepper, and the vinegar. When the mixture boils, turn the heat medium, skim off any foam that has formed on top, and cook, stirring infrequently. If you need to add more liquid to keep the mixture wet, do so, a little at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the lentils and rice are both tender—it will take between 30 and 45 minutes—drain them; do not rinse (it may not even be necessary to drain). Remove the bay leaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the rice and lentils cook, put 1 tablespoon butter or olive oil in a skillet over medium heat. Add the onion and cook, stirring, until it softens, about 5 minutes. Add the apricots and remaining 1/4 cup liquid. When the liquid simmers, turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the lentil/rice mixture is ready, put the remaining butter or olive oil in the lentil/rice cooking pot and turn the heat to medium. When the butter has melted or the oil is hot, add the lentils and rice back to the pot and cook, stirring, until heated through, 3 to 5 minutes. Stir in the onions and apricots and cook, stirring, for another minute. Garnish and serve.</p>"}]}