{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080407-aspbeauty-thumb.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "", "keywords": ["asparagus", "Parmigiano Reggiano", "Snapshots from Italy", "vegetables", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snapshots From Italy: Hammer Your Spears", "link": "https://www.seriouseats.com/recipes/2008/04/snapshots-from-italy-hammer-your-spears.html", "description": "Italians have an undeserved reputation for hammering vegetables to a fault, an accusation most often leveled at us by the\" tender-crisp\" camp. While I agree that cooking vegetables to the point of disintegration can be yucky, I think undercooked veggies...", "totalTime": "", "recipeYield": "2-4 servings", "recipeCategory": ["Asparagus", "Healthy and Delicious", "Sides", "Vegetarian"], "recipeIngredient": ["Asparagus", "Olive oil", "Grated Parmigiano Reggiano or Grana Padano", "Unsalted butter, cut into tiny cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I boil the asparagus in salted water until they just begin to yield to pressure, about 3 to 4 minutes. Drained, they go into a foiled-lined, shallow baking pan, spears forward and no space between them; Mom always used a pie tin, so that remains my sentimental favorite. I drizzle them with a little olive oil and roll them around to coat them, and then sprinkle them heavily with grated Parmigiano Reggiano or Grana Padano. Last, and most important, I dot them evenly with unsalted butter cut into tiny cubes. The spots where the butter melts get especially brown and almost crisp, and I like that this effect is slightly uneven.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pan in a hot, 400-degree oven, and roast the heck out of them, until they are slightly browned and bubbling. Yeah, they'll go from bright-green to that olive-colored tint of doom that tender-crispers bemoan. But trust me, a bunch of spears never had it so well.<br />\r\n</p>"}]}