{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/howtocookeverything.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["gravy", "Mark Bittman", "thanksgiving", "Thanksgiving recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mark Bittman's Turkey Gravy", "link": "https://www.seriouseats.com/recipes/2008/11/mark-bittman-turkey-gravy-recipe.html", "description": "\"Gravy\" is little more than thickened stock&mdash;essentially a reduction sauce&mdash;and when that stock comes out of a roasted turkey, it's pretty good stuff. It's no wonder people love it. Double or triple (or quadruple, if it comes to that)...", "totalTime": null, "recipeYield": "5 to 6 cups (enough for 12 servings)", "recipeCategory": ["Condiments and Sauces"], "recipeIngredient": ["6 cups stock, preferably turkey but chicken is fine", "Salt and freshly ground black pepper", "5 tablespoons butter (optional)", "1/3 cup cornstarch (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove any giblets from the bottom of your roasting pan and pour or spoon off excess fat (that's a judgment call, but leave at least some fat in there). Leave as many of the solids and as much of the dark liquid behind as possible. Put the roasting pan over 2 burners and turn the heat to high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock and cook, stirring and scraping all the brown bits off the bottom of the pan, until the liquid has reduced by about one-quarter, 5 to 10 minutes. (If you're not using cornstarch and you want a thicker gravy, continue to reduce a little more.) Turn the heat down to medium and continue to simmer for about 5 minutes, tasting and adjusting the seasoning. Strain the liquid into a saucepan, discarding the solids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over medium heat, stir in the butter if you're using it and keep warm until ready to serve. If you're using cornstarch, mix it with 1/4 cup cold water, then add to the simmering gravy, stirring constantly. It should thicken almost immediately; serve hot.</p>"}]}