{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["grains", "Italian", "Lidia Bastianich", "Lidia's Italy", "recipe newsletter", "rice", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Risotto with Spinach", "link": "https://www.seriouseats.com/recipes/2008/05/risotto-with-spinach-recipe.html", "description": "The following recipe is from the May 1st edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! In Lidia Bastianich's latest cookbook, Lidia's Italy, she shares recipes from her favorite ten places in...", "totalTime": "", "recipeYield": "6 or more", "recipeCategory": [], "recipeIngredient": ["10 ounces tender spinach leaves", "6 to 8 cups water", "4 tablespoons extra-virgin olive oil", "2 cups chopped onions", "1 teaspoon salt, plus more to taste", "2 cups Arborio or Carnaroli rice", "1 cup white wine", "<strong>For finishing</strong>", "6 tablespoons butter, in tablespoon-sized pieces", "1/2 cup grated Grana Padano or Parmigiano-Reggiano, plus more for passing", "Freshly ground black pepper to taste", "<strong> Recommended Equipment</strong>", "A 3-quart pot for hot water", "A heavy 10-inch saucepan, such as an enameled cast-iron French oven"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse and dry the spinach. Slice the leaves, a handful at a time, into 1/2-inch-wide strips. Heat the water in the pot almost to the boil. Cover, and keep it very hot on the stove, near the risotto pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the olive oil, onions, and 1/2 teaspoon salt in the saucepan, set it over medium heat, and stir well. Cook, stirring frequently, until the onions are wilted and starting to color. Pour in the rice all at once, raise the heat, and stir continuously for about 2 minutes, until the rice grains are toasted (not browned) and make a clicking sound in the pan. Pour in the wine, and keep stirring, all around the pan, until it has evaporated and the rice is dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle in 2 cups of hot water, enough to cover the rice. Cook for a minute or two, stirring, then pile the shredded spinach on top of the rice, and stir steadily as the spinach wilts and the rice gradually absorbs almost all of the moisture, 5 minutes or more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you can see the bottom of the saucepan as you stir, ladle in more water to cover the rice, and stir in the remaining 1/2 teaspoon salt. Cook, stirring frequently, as the risotto develops its creamy suspension. Again, when the liquid is almost completely absorbed, ladle in another cup or so of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the risotto has cooked for 15 to 20 minutes and incorporated 6 cups of water, taste; add more salt or more hot water as needed. When done al dente and creamy, turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop in the butter pieces, stir vigorously, then beat in the 1/2 cup of grated cheese, and grind black pepper generously on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately in warm pasta bowls. </p>"}]}