{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/chocolatyCake.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["baking", "Baking with Dorie", "cakes", "chocolate", "Dorie Greenspan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Baking with Dorie: A Seriously Chocolaty Cake", "link": "https://www.seriouseats.com/recipes/2008/01/baking-with-dorie-a-seriously-chocolaty-cake.html", "description": "The official name of the cake is Boca Negra, or black mouth, and the name aptly describes what your mouth will look like after one bite. I can't think of another cake that's this chocolaty or this easy to make.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking With Dorie", "Desserts"], "recipeIngredient": ["<strong>The White Chocolate Cream</strong>", "12 ounces white chocolate, finely chopped", "1 cup heavy cream", "1/4 cup bourbon (or more to taste)", "<strong>The Cake</strong>", "12 ounces bittersweet chocolate, coarsely chopped", "1 1/3 cups sugar", "1/2 cup bourbon", "2 sticks (8 ounces) unsalted butter, cut into 10 pieces, at room temperature", "5 large eggs, at room temperature", "1 1/2 tablespoons all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the cream at least one day in advance. Put the white chocolate in the work bowl of a food processor or in a blender container. Heat the heavy cream until small bubbles form around the edge of the pan. Pour the cream over the chocolate and process until completely smooth. Add the bourbon, taste and add up to a tablespoon more if you want. Turn into a container with a tight-fitting lid and chill overnight. (The cream can be kept in the refrigerator for a week or frozen for up to a month; thaw overnight in the refrigerator.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat the oven to 350 degrees F. Lightly butter a 9-inch round cake pan and line the bottom with parchment or wax paper; butter the paper. Put the cake pan in a shallow roasting pan and set aside until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make by hand: Put the chopped chocolate in a medium bowl and keep close at hand. In a 2-quart saucepan, mix 1 cup of the sugar and the bourbon and cook over medium heat, stirring occasionally, until the sugar dissolves and the mixture comes to a full boil. Immediately pour the syrup over the chocolate and stir with a rubber spatula until the chocolate is completely melted and the mixture is smooth. Piece by piece, stir the butter into the chocolate mixture. Make certain that each piece of butter is melted before you add another.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the eggs and the remaining 1/3 cup sugar in a medium bowl and whisk until the eggs thicken slightly. Beating with the whisk, add the eggs to the chocolate mixture and whisk until well blended. Gently whisk in the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make in a food processor: Put the chocolate in the work bowl. Bring all of the sugar and bourbon to a full boil and pour the syrup into the work bowl; process until the mixture is completely blended, about 12 seconds. With the machine running, add the butter in pieces, followed by the eggs, one at a time, and then the flour. Process an additional 15 seconds before turning the batter into the prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Baking the cake: Pour and scrape the batter into the prepared pan, running your spatula over the top to smooth it. Pour enough hot water into the roasting pan to come about 1 inch up the sides of the cake pan. Bake the cake for exactly 30 minutes, at which point the top will have a thin, dry crust. Remove the cake pan from its water bath, wipe the pan dry and cover the top of the cake with a sheet of plastic wrap. Invert the cake onto a flat plate, peel off the parchment and quickly but gently invert again onto a serving platter; remove the plastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the cake warm or at room temperature with the chilled white chocolate cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Once cooled, the cake can be covered and kept at room temperature for 1 day or refrigerated for up to 3 days. Wrapped airtight, the cake can be frozen for up to 2 months. Thaw, still wrapped, overnight in the refrigerator.</p>"}]}