{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080325-carrots.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["carrots", "gluten free", "Italian", "sides", "spring dishes", "vegetables", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snapshots from Italy: Carrots in Marsala", "link": "https://www.seriouseats.com/recipes/2008/03/snapshots-from-italy-carrots-in-marsala-recipe.html", "description": "With an abundance of spring vegetables appearing on the scene, it's easy to overlook carrots, especially when all you can find are the super-sized, woody specimens trapped in plastic bags in the grocery store. But young, tender, carrots are a springtime treat, and this simple preparation enhances their luscious savory-sweetness perfectly.", "totalTime": "", "recipeYield": "2-4 servings", "recipeCategory": ["Gluten-Free", "Italian", "Sides", "Vegetarian"], "recipeIngredient": ["1 lb. young carrots", "2 tablespoons unsalted butter", "1 teaspoon granulated sugar", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I adapted the recipe only in terms of quantity, and you can easily adjust it upward or downward. I began with about one pound of young carrots, peeled and cut on the diagonal. Melt 2 tablespoons of unsalted butter in a deep sauté pan and add the carrots, briefly sautéing over medium heat to coat them evenly with the butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1/2 cup dry Marsala to the pan, and allow it to bubble up, then add enough water to almost cover the carrots. Sprinkle over about 1 teaspoon granulated sugar and a pinch of salt. Bring the liquid to a gentle simmer, cover the pan, and cook the carrots until they are just fork-tender. Remove the cover, and turn up the heat. Continue to cook the carrots, shaking the pan occasionally until the liquid has evaporated and the carrots are nicely glazed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss them with a bit of chopped Italian parsley, and serve immediately. Try to resist eating the entire quantity in one sitting.<br />\r\n</p>"}]}