{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["apple cider", "desserts", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple Cider Ice Cream, The Perfect Fall Flavor", "link": "https://www.seriouseats.com/recipes/2008/08/apple-cider-ice-cream-recipe-fall.html", "description": "Who knew that trying to find apple cider in August would be like searching for fresh watermelon in February? Earlier this week, with my heart set on making this delicious scallop dish, I went to one farm stand and three...", "totalTime": null, "recipeYield": "about 5 cups of ice cream", "recipeCategory": ["Desserts"], "recipeIngredient": ["2 cups apple cider", "1 cup sugar", "One 3-inch cinnamon stick", "2 cups heavy cream", "2 cups milk", "6 large egg yolks", "1/4 teaspoon salt", "3 tablespoons Applejack, Calvados, or other apple liqueur, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cider, sugar, and cinnamon stick in a heavy medium saucepan and bring to a boil over high heat, swirling the pan occasionally by its handle. Boil until the cider is as thick as maple syrup and the sugar has caramelized, about 15 minutes. As the cider reduces in volume, it will bubble up to the top of the pan. When this happens, lift the pan off the heat, swirl it until the bubbles subside, and then continue cooking; reduce the heat slightly if the mixture refuses to simmer down. When it is the right consistency, the bubbles will be very thick, large, and foamy and you’ll have between 1/2 and 2/3 cup of syrup. A sure test that the syrup is ready is an instant-read thermometer. Remove the pan from the heat, tip it at an angle so that the syrup collects at one side, and insert the thermometer&mdash;the temperature should be 240ºF. Remove the cinnamon stick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the syrup is cooking, scald the cream and milk in a large heavy saucepan over medium heat. (The mixture is ready when you see small bubbles around the edge of the pan and steam rising from the surface.) A wrinkled \"skin\" may also be present; just leave it alone. Keep hot over low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As soon as the syrup is ready, pour it into the hot cream and milk while whisking vigorously. Cook over low heat, whisking constantly, until the syrup is thoroughly incorporated into the cream mixture. Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the yolks and salt just to combine. Very gradually, whisk in the hot cider syrup mixture. Scrape the mixture into the saucepan and set the pan over medium-low heat. Cook, stirring constantly but gently with a heatproof rubber spatula, going all around the sides and bottom of the pan, until the custard thickens enough to coat a metal spoon, about 10 minutes. An instant-read thermometer will register 180ºF. Do not allow the mixture to boil, or it will curdle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately remove the pan from the heat and strain it into a bowl. Cool the custard, uncovered, stirring occasionally, until it reaches room temperature. Stir in the Applejack, if using, then cover and refrigerate. It must be very cold when churned. If you want to speed this process, cool the custard in a back of ice and water, stirring it from time to time until it is very cold.</p>"}]}