{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080218-jamie.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Cook with Jamie", "Jamie Oliver", "potatoes", "straw potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: April's Rosemary Straw Potatoes", "link": "https://www.seriouseats.com/recipes/2008/02/cook-the-book-aprils-rosemary-straw-potatoes-recipe.html", "description": "Today's Cook the Book recipe jumped out at everyone here at the Serious Eats office because it was given to Jamie Oliver by the chef of one of our favorite restaurants here in New York. The \"April\" in the title...", "totalTime": null, "recipeYield": "makes 4 servings", "recipeCategory": ["Cook the Book", "Potato", "Sides", "Vegetarian"], "recipeIngredient": ["<strong>For the lemon salt:</strong>", "Zest of 1 lemon", "4 tablespoons sea salt", "&nbsp;", "<strong>For the potatoes:</strong>", "Sunflower oil", "1 3/4 lb potatoes, peeled and cut into fine matchsticks", "A few sprigs of fresh rosemary, leaves picked"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bash and mix together the lemon zest with the salt in a mortar and pestle until salt is flavored, colored, and fine. Place in a dish. Use whatever you need right away or allow it to dry out for a couple of hours before storing it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 to 3 inches of sunflower oil in a sturdy pan; bring to deep-frying temperature (350&deg;F; to avoid oil catching fire, be sure to maintain its temperature at 350&deg;F).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the julienne strips dry with some paper towels to remove any excess starch. Making sure you've got a slotted spoon or spider (which is like a flat colander with a handle) and a big pile of paper towels to one side, carefully place some of your potatoes into the pan of oil (don't overcrowd it) for a couple of minutes until golden brown and crisp. Cook potatoes in batches until they are all used up. Add the rosemary for the last 30 seconds. Remove the potatoes and rosemary to the paper towels to soak up any excess oil; dust with your lemon salt. Serve immediately.</p>"}]}