{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["cheese straws", "Lee Bros.", "Serious Eats Essentials", "The Lee Bros. Southern Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Cheese Straws", "link": "https://www.seriouseats.com/recipes/2008/03/essentials-lees-brothers-cheese-straws-recipe.html", "description": "The main reason I don’t have parties very often is that I’m one of those compulsive people who allows planning to spin out of control. I end up with five times as much food as I need but still stressed...", "totalTime": "", "recipeYield": "30 straws", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Serious Eats Essentials"], "recipeIngredient": ["1 1/2 cups (about 4 ounces) grated extra-sharp cheddar cheese", "4 tablespoons (1/2 stick) unsalted butter, softened and cut into 4 pieces", "3/4 cup all-purpose flour, plus more for dusting", "1/2 teaspoon kosher salt", "1/2 teaspoon crushed red pepper flakes", "1 tablespoon half-and-half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. In a food processor, combine the cheese, butter, flour, salt, and red pepper. Process in five 5-second pulses until the mixture resembles coarse crumbs. Add the half-and-half and process until the dough forms a ball, about 10 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface with a lightly floured rolling pin, roll the dough into an 8x10 inch rectangle that is 1/8 inch thick. With a sharp knife, cut the dough into long, thin strips, 1/4-1/3 inch wide. (The Lee Bros. say dipping the knife in flour after every few inches ensures a clean cut, but the truth is that this is a tricky business and that more than a few of the “straws” will break as you transfer them to the baking sheet. It’s better not to get all perfectionist about it, since they will taste good no matter what shape they are.) Gently transfer the strips to an ungreased cookie sheet, leaving at least 1/4 inch between them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the straws on the middle rack for 12-15 minutes, or until the ends are barely browned. (Personally, I think it is better to err on the side of overbaking here, especially if, like me, you can’t really roll anything out quite as thin as 1/8 inch). Set the cookie sheet on a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve at room temperature. Cheese straws will keep in the refrigerator, in a sealed container, for 2 days.</p>"}]}