{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Sarah Wolf"}, "recipeCuisine": "", "keywords": ["grilling", "Mario Batali", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mario Batali's Rosemary Shrimp", "link": "https://www.seriouseats.com/recipes/2008/07/mario-batalis-rosemary-shrimp-recipe.html", "description": "...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Mains", "Shrimp"], "recipeIngredient": ["1 bunch Italian parsley, leaves only (about 2 cups loosely packed)", "1 bunch basil, leaves only (about 2 cups packed)", "2 cups fresh bread crumbs", "1/2 teaspoon kosher salt", "Freshly ground black pepper to taste", "1/4 cup plus 2 tablespoons extra-virgin olive oil", "2 pounds large shrimp (21-30 per pound), peeled and deveined", "12 large,sturdy rosemary sprigs about 8 inches long for skewers", "2 lemons, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull off most of the leaves from each rosemary sprig, leaving a nice tuft of leaves at the top. Using a sharp knife, cut off the bottom of the sprig on a diagonal to give you a sharp point. Soak in water for at least two hours, or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the parsley and basil leaves into a food processor, add the bread crumbs, salt, pepper, and 1/4 cup of the olive oil, and zap until the herbs are chopped and the bread crumbs look green. Transfer to a pie plate or wide shallow bowl, add the shrimp, and toss to coat well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skewer 4 or 5 shrimp on each rosemary spring (the easiest way to do this is line up 4 or 5 shrimp at a time on a work surface and run a skewer through them; then separate them slightly so they will cook evenly). Dredge on both sides in the bread crumb mixture, place on a platter, and put in the refrigerator for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas grill or prepare a fire in a charcoal grill. Put a piastra or a griddle on the grill to preheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spritz or brush the piastra or griddle with the remaining 2 tablespoons olive oil. Place the skewers on the piastra or griddle and cook, turning once, just until the shrimp are opaque throughout and some of the crumbs are browned, 2 to 3 minutes per side. Transfer to a serving platter and serve with the lemon wedges.</p>"}]}