{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080805-flanksteak-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["beef", "condiments", "grilling", "mains", "sauces", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Chimichurri-Stuffed Flank Steak", "link": "https://www.seriouseats.com/recipes/2008/08/chimichurri-stuffed-flank-steak-recipe-beef-grilling.html", "description": "I'm a believer in grilling classics since they're usually deemed \"classics\" for a delicious reason. Give me a perfectly grilled steak and I'm happy. Top that with some chimichurri sauce--an Argentinean mixture of parsley, garlic, onion, vinegar, and oil which...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Grilling", "Mains"], "recipeIngredient": ["<strong>For the chimichurri sauce:</strong>", "1 cup packed fresh parsley leaves", "5 medium cloves of garlic, peeled", "1/2 cup extra-virgin olive oil", "1/4 cup red wine vinegar", "2 tablespoons water", "1/4 cup red onion, finely minced", "1 teaspoon salt", "1/4 teaspoon red pepper flakes", "<strong>For the steak:</strong>", "2 pounds flank steak", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process parsley and garlic in a food processor until chopped fine, about 20 one-second pulses. Transfer to medium bowl and whisk in remaining sauce ingredients until thoroughly blended.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butterfly flank steak by slicing it horizontally with the grain, half of the thickness of the steak, stopping about one inch from the edge of the meat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the steak and completely cover with chimichurri sauce. Roll the steak into a cylinder so the grain of the meat runs the length of the roll. Tie the steak closed tightly using butchers twine, with one tie about every inch along the length of the roll.  Season the outside of the steak with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate. Grill steak to desired doneness--until an instant read thermometer reads 140°F when inserted into the middle of the roll for medium--turning four times during cooking to evenly brown the outside. Remove from grill and let rest for 10 minutes. Slice between the pieces of twine, then remove the twine from each slice, and serve.</p>"}]}