{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-cowgirlcuisine.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cookbooks", "Cowgirl Cuisine", "Paula Disbrowe", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Gazpacho Risotto with Garlic Shrimp", "link": "https://www.seriouseats.com/recipes/2008/05/gazpacho-risotto-with-garlic-shrimp-recipe.html", "description": "Making your mom eggs on Mother's Day is easy. That's not to say serving her an omelet in bed or a frittata on the sun porch isn't a good idea&mdash;such gestures are always appreciated. But this year, why not try...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["12 plum tomatoes, halved", "Olive oil", "Kosher salt", "1 pound medium shrimp, shelled and deveined", "2 garlic cloves, minced ", "3 yellow bell peppers", "8 large cucumbers, peeled and cut into 2-inch chunks ", "1 1/2 cups tomato juice", "1 tablespoon sherry wine vinegar ", "2 tablespoons extra-virgin olive oil", "6 jalapeño peppers, seeded and finely chopped ", "3 tablespoons minced shallots (or 1/2 red onion finely chopped) ", "1/8 teaspoon freshly ground black pepper ", "1 3/4 cups Arborio rice", "1/2 cup dry sherry", "2 tablespoons unsalted butter", "1/4 cup chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The night or morning before serving this risotto, preheat the oven to 200F. Place the halved tomatoes, seed-pockets up, on a baking sheet. Drizzle the tomatoes with olive oil and sprinkle with salt. Roast in the oven for 8 hours, until the tomatoes are concentrated and meaty but not dry. If not using right away, place in a sealed plastic container and refrigerate until needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>An hour before serving, toss the shrimp, garlic, a light sprinkling of salt, and a drizzle of olive oil in a medium bowl. Cover and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the yellow peppers directly on a burner and char over a gas flame, turning as necessary to blacken evenly on all sides. Alternatively, place the peppers on a baking sheet and broil, turning as necessary, until the skins blacken on all sides. Place the peppers in a bowl and cover with a towel to allow them to steam for at least 15 minutes. Using your fingers or a paring knife, peel and seed the peppers, cut into 1/4-inch dice, and reserve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop each roasted tomato half into 6 pieces. Combine them with the yellow peppers in a medium bowl and toss with the sherry wine vinegar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the extra virgin olive oil in a small skillet over medium-high heat. When the pan is quite hot but not smoking, saut&eacute; the jalapeños, stirring constantly, until softened, about 3 minutes. In a 3-quart saucepan over medium-high heat, heat the remaining tablespoon of olive oil. Add the shallots, 1 teaspoon salt, and the black pepper and saut&eacute; 2 minutes, until the shallots are soft. Add the rice and stir about 2 minutes, until all the kernels are coated with oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the heat to medium and add the sherry. Stir until the sherry is absorbed. Begin adding the cucumber-tomato juice, 1/2 cup at a time, stirring constantly. Allow each addition of juice to be absorbed before adding more. Continue until the risotto is creamy and the rice grains are al dente, 25 to 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the jalapeño, tomato-yellow pepper mixture, butter, and half of the parsley. Season to taste with salt and black pepper and cover the saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a medium skillet over medium-high heat. When very hot but not smoking, add the shrimp and saute, stirring, just until pink and cooked through, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the risotto in warm shallow bowls, topped with equal portions of the seared shrimp and the remaining parsley. </p>"}]}