{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081229savoycabbage.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "savoy cabbage", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Italian Bread and Cabbage Soup with Sage Butter", "link": "https://www.seriouseats.com/recipes/2008/12/draft-cook-the-book-italian-bread-and-cabbage.html", "description": "Photograph from quinn.anya on Flickr Don't be fooled by this recipe's austere title. There's nothing austere about the crisped pancetta, grated fontina or globs of sage butter that take today's Cook the Book dish from subsistence to celebratory. Jamie Oliver's...", "totalTime": null, "recipeYield": "8", "recipeCategory": ["Soups and Stews"], "recipeIngredient": ["3 quarts good-quality chicken or vegetable stock", "1 Savoy cabbage, stalks removed, outer leaves separated, washed and roughly chopped", "2 big handfuls of kale, stalks removed, leaves washed and roughly chopped", "About 16 slices of stale country-style or sourdough bread", "1 clove of garlic, unpeeled, cut in half", "Olive oil", "12-14 slices of pancetta or bacon ", "1 4-ounce can anchovy fillets in oil", "3 sprigs of fresh rosemary, leaves picked", "7 ounces fontina cheese, grated", "5 ounces freshly grated Parmesan cheese, plus a little for serving", "Sea salt and freshly ground black pepper", "A couple of large knobs of butter", "A small bunch of fresh sage, leaves picked"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 350F. Bring the stock to the boil in a large saucepan and add the cabbage and kale. Cook for a few minutes until softened (you may have to do this in two batches). Remove the cabbage to a large bowl, leaving the stock in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the stock gently over the top till it just comes up to the top layer. Push down again and sprinkle over the remaining fontina and Parmesan. Add a good pinch of pepper and drizzle over some good-quality olive oil. Bake in the preheated oven for around 30 minutes, or until crispy and golden on top.</p>"}]}