{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feature-eastersoup.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["eggs", "Gina DePalma", "holidays", "Italian", "lamb", "Roman", "Snapshots from Italy", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snapshots from Italy: Roman Easter Soup", "link": "https://www.seriouseats.com/recipes/2008/03/snapshots-from-italy-roman-easter-soup.html", "description": "<strong>Eggs</strong> are essential ingredients in <strong>Italian Easter celebrations,</strong> playing a role that extends beyond the huge, elaborately decorated chocolate eggs that decorate every shop window in the weeks before the holiday.  Romans are likely to enjoy a light first course of <em>Brodetto Pasquale</em> at their Easter table, the local version of a soup that features eggs as well as lamb, another iconic Easter food.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Easter", "Eggs", "Italian", "Lamb", "Soups and Stews"], "recipeIngredient": ["<strong>For the broth:</strong>", "Extra-virgin olive oil", "Salt and freshly ground pepper to taste", "1 pound lean beef, cut into 10 to 12 cubes", "1 pound lamb, shoulder or breast, cut into 6 to 8 piees", "1 medium onion", "6 whole cloves", "2 medium carrots", "2 stalks celery, with leaves", "2 sprigs fresh Italian parsley", "2 sprigs fresh thyme", "1 branch fresh rosemary", "Cold water", "<strong>To assemble the soup:</strong>", "6 large egg yolks", "1 tablespoon minced fresh marjoram", "1 tablespoon minced fresh Italian parlsey", "6 toasted bread rounds", "Extra-virgin olive oil", "Juice of 1 small lemon", "Salt and freshly ground pepper to taste", "Freshly grated Parmigiano-Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy stockpot, heat a few tablespoons of olive oil. Season the beef pieces with salt and pepper, and add them to the oil. Let the beef brown on both sides. Cut the onion in half; stud each half with 3 cloves. Cut the celery and carrots into chunks add them to the pot with the onion, the herbs, and 3 quarts cold water. Let broth come to a boil, then reduce heat to a simmer. Skim off any gray foam that forms on top; simmer soup for one hour. Add the lamb pieces; simmer the broth for another hour, skimming as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow broth to cool to room temperature; strain off and discard the solids. (You can save the meat for a delicious salad: Shred the meat finely and dress with olive oil, red wine vinegar, minced red onion, chopped capers, fresh parsley, salt, and pepper—terrific on top of toasted bread rubbed with a little garlic.) The broth can be made a day ahead of time and refrigerated overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve the soup, bring the broth to a boil, then turn off the heat and let it sit in the pot for about 3 minutes. Taste for seasoning and add salt if necessary. It is important that the broth is hot, but not boiling, which would curdle the egg yolks. Place a warm, toasted round of bread, dribbled with some extra-virgin olive oil, in the bottom of each soup bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the 6 egg yolks in a warm soup tureen; whisk them lightly with the minced fresh marjoram and parsley, a few grinds of pepper, and the lemon juice. Slowly ladle in the hot broth, whisking simultaneously to prevent the egg yolks from curdling. Immediately ladle the soup into the bowls and over the bread; grate plenty of Parmigiano-Reggiano over the top.</p>"}]}