{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080722-dinnertonight-potatosalad-thumb.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["cheese", "mexican food", "Monterey Jack", "peppers", "poblano", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Poblanos with Potato and Oaxaca Cheese", "link": "https://www.seriouseats.com/recipes/2008/07/poblanos-peppers-potatoes-oaxacan-cheese-recipe.html", "description": "The spicy chili sauce and potatoes part of this recipe seemed like a great way to zazz up tacos. At first, the type of cheese didn't seem important. I pulled a recipe from Recipe Gullet that said Monterey Jack would...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cheese", "Dinner Tonight", "Potato", "Vegetarian"], "recipeIngredient": ["1/2 pound red potatoes, sliced", "2 cloves garlic", "2 poblano peppers", "1 1/2 tablespoons olive oil ", "2 ounces Oaxacan cheese (Monterey Jack will also work)", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Char the poblanos under the broiler, turning them every three minutes or so, until they have blackened on all sides. Remove the peppers, turn off the broiler, and place the peppers in a plastic bag. Let them steam for 15 minutes. Remove the skin and seeds, and roughly chop.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the sliced red potatoes in a large pot. Cover with cold water, a tablespoon of salt, and turn the heat to medium. Cook until the potatoes can be easily punctured with a fork. This will take about 15 minutes.  Reserve 1/2 cup of the water the potatoes cook in.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the reserved water into a blender. Also add the garlic and poblanos. Process the mixture until chunky.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large skillet. Pour in the pepper mixture and let cook for 5 minutes. Stir occasionally. Add the potatoes to the mixture. Let cook for seven minutes, stirring to cover the potatoes in the sauce.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shred the cheese and toss it in the skillet. Cover and continue to cook until it has melted, about a minute or so. </p>"}]}