{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081124-meatsauce.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["Meat Lite", "sausage", "tomato sauce", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Mushroom-Sausage Red Gravy", "link": "https://www.seriouseats.com/recipes/2008/11/mushroom-sausage-red-gravy-tomato-sauce-recipe.html", "description": "Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by the book coauthored by the two, Almost Meatless, due out in spring 2009. \"This...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["1 ounce dried porcini mushrooms", "1/2 pound hot Italian sausage, casings removed", "1 to 2 tablespoons olive oil", "1 large onion, chopped fine (about 1 cup)", "10 ounces button mushrooms, minced by pulsing in the food processor", "3 sprigs fresh thyme leaves, minced", "1/4 teaspoon dried oregano", "1/2 teaspoon salt", "1/4 teaspoon black pepper ", "1 cup chicken stock, homemade is best", "1 28-ounce can whole tomatoes and their juice", "1/4 cup red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 cup of hot water over the porcini mushrooms and soak until soft, about 10 minutes. Remove from soaking liquid, chop and set aside. Strain the soaking liquid through a fine mesh sieve and reserve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble the sausage into a large Dutch oven over medium heat. Cook until the sausage is starting to brown, about 5 minutes, breaking the meat into very small bits as you stir. Remove from the pan and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough olive oil to the rendered sausage fat to have two tablespoons fat in the pan. Add the onion, button mushrooms, rehydrated dried mushrooms, thyme, oregano and salt and pepper. Cook, stirring occasionally, until the mushrooms have released their juices and the juices evaporate and the onions are soft, about 10 minutes. Return sausage to the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the reserved mushroom soaking liquid, the chicken stock, the tomatoes with their juices, and red wine. Increase the heat to high, bring to a simmer, and then reduce heat to low. (You want it just hot enough to maintain a gentle bubble.) Cover partially, and cook for two hours, stirring occasionally and mashing the whole tomatoes with your spoon. After two hours the sauce should be very thick. Adjust seasoning to taste and serve over spaghetti. </p>"}]}