{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eating for Two: Potato Salad with Salmon and Green Beans", "link": "https://www.seriouseats.com/recipes/2008/04/eating-for-two-potato-salad-with-salmon-and-g.html", "description": "I am going through a period of less-than-fantastic eating not because baby is demanding unhealthy food but because I am having trouble motivating to plan and cook dinner. It's an early springtime thing, I think. It's tempting to goof off...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["3/4-1 pound smallish Yukon gold potatoes, scrubbed", "1/2 pound green beans, ends trimmed", "White wine vinegar or lemon juice", "Salt", "Pepper", "Extra virgin olive oil", "1 can salmon, about 6 ounces, drained", "2 tablespoons capers (or to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of lightly salted water to a boil. While you wait, halve the potatoes and slice 1/4 inch thick. Chop the green beans into bite-sized pieces. When the water boils, add the potatoes and cook 3-5 minutes, just until tender. Test/taste frequently near the end to get the texture just right. Remove the cooked potatoes with a slotted spoon to a colander. When the water comes back to a boil, add the green beans and cook until just done, about 3 minutes. Remove the cooked beans with a slotted spoon to the colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the dressing. How much you need depends a lot on your personal preferences. I like starting with 1 tablespoon white wine vinegar or lemon juice into which I whisk a pinch of salt and a pinch of pepper. Then I whisk in 1/4 cup olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes and beans in a bowl and toss with the vinaigrette. Add the drained salmon and capers and toss again. Taste and add more dressing, capers, salt, and pepper if necessary. This salad is also nice with hard-boiled eggs on the side.</p>"}]}