{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-cowgirlcuisine.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "cookbooks", "Cowgirl Cuisine", "mains", "Paula Disbrowe", "steaks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cowgirl Steaks with Pink Peppercorns and Red Onion Marmalade", "link": "https://www.seriouseats.com/recipes/2008/05/cowgirl-steaks-with-pink-peppercorns-and-red-onion-marmalade-recipe.html", "description": "Today's Cook the Book recipe is for thick, juicy, seared sirloin steaks. Not exactly your typical Mother's Day fare. But why shouldn't it be? Steak dinners are always special, whether eaten out at a swanky restaurant, or off a paper...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 tablespoons crushed pink peppercorns, plus more for garnish", "1 tablespoon Szechuan peppercorns", "1 tablespoon coriander seeds ", "1 teaspoon fennel seeds  ", "1 tablespoon plus 1 teaspoon kosher salt", "1/2 teaspoon dried orange peel ", "1/2 teaspoon cayenne pepper (or other ground red pepper)", "Four 6-ounce sirloin steaks, about 1 inch thick ", "Thyme sprigs, for garnish (optional) ", "<strong>Red Onion Marmalade</strong>", "2 tablespoons extra virgin olive oil", "2 large red onions, thinly sliced", "Kosher salt ", "Generous pinch of crushed red chile flakes ", "1 thyme branch (or 1 teaspoon dried thyme or herbes de Provence)", "1 fresh bay leaf ", "2 garlic cloves, minced ", "1 bottle red wine (such as Cotes du Rhone or a Spanish Crianza)", "3 tablespoons honey ", "2 tablespoons unsalted butter", "Freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the peppercorns, coriander, and fennel in a small, dry skillet over medium heat, shaking the skillet, until fragrant and slightly darkened, 2 to 3 minutes. Combine the seeds with the salt, orange peel, and cayenne in a mortar (or an electric coffee grinder used for spices) and coarsely grind. An hour before cooking, place the steaks on a baking sheet lined with parchment. Evenly coat the meat with the spice mixture, pressing it gently so it adheres; set aside to marinate at room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the marmalade: Heat the olive oil in a large skillet over medium-high heat. Add the onions and a pinch of salt and saut&eacute;, stirring, until softened, about 6 to 8 minutes. Add the chile flakes, thyme, bay leaf, and garlic and saut&eacute; a few more minutes. Add the wine and honey and bring to a boil. Reduce the heat and simmer, stirring occasionally, until the wine has reduced to about 1 cup (the mixture should be thick and sticky). Stir in the butter, taste for seasoning, and add salt and black pepper as desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, sear the steaks over a very hot (but not smoking) skillet. Do not flip the steaks until they have browned enough to release easily from the skillet, about 4 to 5 minutes. Cook the other side to the appropriate level of doneness, about 4 minutes for medium-rare. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place each steak (whole or thinly sliced) on a warmed plate alongside a generous mound of the marmalade. Drizzle the meat with any remaining liquid from the marmalade. Garnish the plates with a sprig of thyme and additional pink peppercorns, if desired.</p>"}]}