{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2008031-grater.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["cookshelf", "feta", "fettuccine", "pasta seafood", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Do You Put Cheese on Seafood Pasta?", "link": "https://www.seriouseats.com/recipes/2008/03/do-serious-eater-put-cheese-on-seafood-pasta.html", "description": "So many Italian chefs both here in the U.S. and in Italy consider it culinary heresy to put grated cheese on seafood pasta. Why is this? Robert Trachtenberg explored the topic this weekend, and he uncovered many theories, but not the definitive answer. What's your stance on cheesing seafood pasta dishes?", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Mains", "Pasta", "Shrimp"], "recipeIngredient": ["1 pound rock shrimp, peeled and deveined", "Sea salt", "Freshly ground pepper", "3 tablespoons extra-virgin olive oil, plus high-quality extra-virgin olive oil, for drizzling", "1 to 2 jalapeños, stemmed and seeded, cut into thin matchsticks", "2 cloves garlic, thinly sliced", "2 cups cherry tomato purée", "1 pound fresh fettuccine", "6 ounces mild feta (preferably French)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil for the pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the rock shrimp with salt and pepper. In a large, straight-sided sauté pan, heat the 3 tablespoons olive oil over medium heat until hot but not smoking.  Add the shrimp and sear on all sides, 6 to 8 minutes a side.  Use a slotted spoon to transfer them to a plate. Add the jalapeño(s) and garlic to the pan; sauté for about 3 minutes, until they soften.  Add the cherry tomato purée; season with 1/2 teaspoon salt and 1 teaspoon pepper. Simmer over low heat, until the tomato purée has thickened slightly, about 5 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the fettuccine to the boiling water. Cook for 1 minute less than the package directions instruct, then drain in a colander, reserving about 1/4 cup cooking liquid. Add the fettuccine and the cooking liquid to the pan of simmering tomato purée; increase heat to medium. Return shrimp to pan; toss to combine. Crumble the feta into the pan; continue to gently stir pasta and sauce for about 1 minute more.  Taste to see if the mixture needs more salt (the saltiness of the feta can vary).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the pasta in four wide, shallow bowls with drizzle of high-quality extra-virgin olive oil over the top of each serving along with some freshly ground black pepper.  </p>"}]}