{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080204-chochol.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "Chocolate Holidays", "chocolate truffles", "Cook the Book", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bittersweet Chocolate Truffles", "link": "https://www.seriouseats.com/recipes/2008/02/cook-the-book-bittersweet-chocolate-truffles-recipe.html", "description": "Who doesn't love chocolate truffles? And going through the effort to make your valentine a batch of these treats only sweetens the deal. You can make these with domestic bitter- or semisweet chocolate that doesn't list a percentage on the...", "totalTime": "", "recipeYield": "about 30 truffles", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["8 ounces bittersweet or semisweet chocolate, finely chopped ", "6 tablespoons (3/4 stick) unsalted butter, cut into small pieces ", "1 egg yolk, at room temperature 1/4 cup boiling water ", "1/3 cup unsweetened Dutch-process cocoa powder ", "<h5>Equipment Needed</h5>", "Instant-read thermometer", "Fine strainer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the truffles, place the chocolate and butter in a 4- to 6-cup heatproof bowl set in a wide skillet of barely simmering water over low heat. Stir frequently until chocolate and butter are completely melted and smooth. Remove bowl; set aside. Leave skillet on low heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the egg yolk in a small bowl. Gradually whisk in the boiling water. Place bowl in skillet; stir constantly until yolk mixture thickens slightly to consistency of light cream and registers between 160&deg; and 165&deg;F on an instant-read thermometer. Remove from skillet; scrape yolk mixture immediately over melted chocolate </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir gently, without whisking or beating, just until egg is completely incorporated and mixture is smooth. Pour through a fine strainer into a clean bowl. Cover and chill until firm, 2 hours or more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the truffles, remove truffle mixture from refrigerator; allow to soften about 30 minutes if mixture is very hard. Pour cocoa into a pie plate. Dip a melon bailer or small spoon into a glass of hot water, wipe off any excess water, and scrape across surface of chilled truffle mixture to form a rough 1-inch ball. Pinch truffle into shape with fingers if necessary; it should not be perfectly round. Deposit truffle into the cocoa. Repeat with remaining truffle mixture. Gently shake pie plate to coat truffles with cocoa. Truffles can be stored, tightly covered and refrigerated, up to 2 weeks or frozen up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Variation</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bittersweet Mint Truffles:</strong> Add 1 teaspoon peppermint extract to the melted chocolate with the egg mixture.</p>"}]}