{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cookbooks", "Lidia Bastianich", "Lidia's Italy", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Tuscan Meat and Tomato Ragù", "link": "https://www.seriouseats.com/recipes/2008/05/tuscan-meat-and-tomato-ragu-recipe.html", "description": "In this, the era of fast food restaurants, take-out dinners, and microwave ovens, it's easy to forget the pleasures of leisurely cooking. But spending all Sunday in the kitchen stirring and seasoning is one of life's greatest pleasures! Today's Cook...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Mains", "Pork"], "recipeIngredient": ["1/2 cup dried porcini ", "1 medium onion, in chunks (1 cup or more) ", "2 celery ribs, in chunks (about 2 cups) ", "1/3 cup extra-virgin olive oil ", "1 pound ground veal ", "1 pound ground pork ", "1 pound sweet Italian sausage, removed from the casing and crumbled ", "2 teaspoons salt, or to taste ", "2 cups red wine ", "3 cups (or a 28-ounce can) canned Italian plum tomatoes, preferably San Marzano, crushed by hand ", "Meat, poultry, or vegetable stock, or water, as needed ", "Freshly ground black pepper to taste ", "<strong>Recommended Equipment</strong>", "A food processor ", "A heavy-bottomed 5-quart saucepan with a cover, 12 inches or wider "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the dried porcini in a cup or so of hot water for at least 1/2 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the food processor, puree the onion and celery to a paste. Heat the oil in the saucepan over medium-high heat, scrape in the paste, and stir it for 3 or 4 minutes as it steams and starts to caramelize. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add all the meats to the pan, raise the heat, and continuously turn and loosen the chopped meat as it sears and browns. Sprinkle 2 teaspoons salt over the meat, and keep tossing and breaking up any lumps, until all the meat is colored and has started to release moisture. Cook, stirring frequently, to evaporate all the liquid in the pan, about 15 minutes or more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat is dry, pour in the wine, stir well, and bring it to the boil. Cook, frequently stirring, to evaporate the wine. Meanwhile, lift the reconstituted porcini pieces from the soaking water, squeeze them dry, and chop into bits. Stir the porcini into the sizzling meats. When the wine has almost evaporated, pour in the porcini water (but not the sediment), stir, and cook until it too has disappeared into the meat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the tomatoes into the pan, slosh the containers with 2 cups of water, and stir that in. Cook, covered, until the tomato juices are bubbling, then lower the heat and simmer the sauce, partially covered, for 2 to 3 hours&mdash;the longer it perks the better! As the sauce reduces, add stock or water as needed to keep the meat covered by liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste, and season with salt and freshly ground black pepper. Use right away or&mdash;for best flavor&mdash;let the sauce sit for a couple of hours or up to 2 days (refrigerated). Loosen sauce with water or stock, if necessary, when reheating. </p>"}]}