{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["dill", "linguine", "pasta", "recipe newsletter", "seafood", "Second Helpings of Roast Chicken", "shrimp", "Simon Hopkinson"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Linguine with Shrimp and Dill", "link": "https://www.seriouseats.com/recipes/2008/11/linguine-with-shrimp-and-dill-recipe.html", "description": "The following recipe is from the November 5th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Simon Hopkinson, author of Second Helpings of Roast Chicken, believes linguine to be \"one of the...", "totalTime": "", "recipeYield": "2 servings", "recipeCategory": ["Mains", "Pasta", "Shrimp"], "recipeIngredient": ["1 pound shell-on shrimp, fresh or frozen", "2 shallots, peeled and finely chopped", "1 clove garlic, peeled and chopped", "4 tablespoons butter", "1 tablespoon Pernod", "1 demitasse spoon [such as for stirring tea or coffee] white wine vinegar", "1 small glass of white wine", "2 ripe tomatoes, chopped", "2/3 cup whipping cream", "Salt and pepper", "Grated rind and juice of 1/2 a small lemon", "5 ounces dried linguine", "1 demitasse spoon freshly chopped dill leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the heads from the shrimp and peel their tails. Place the peeled shrimp tails in a bowl and keep cool in the fridge. Put all the shell debris to one side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently fry the shallots and garlic in the butter until softened. Add the shrimp-shell debris and turn around in the pan over a high heat for a couple of minutes. Add the Pernod and allow to sizzle for a moment, then introduce the vinegar and wine. Add the tomatoes and then simmer this mush together for 20 minutes. Tip into a blender or food processor and puree to a pink slurry. Tip into a sieve and, using the back of a ladle, force every last scrap of juice from this slurry into a saucepan. Bring the resultant juice to a simmer. As it approaches this moment, skim off the copious scum that settles upon the surface. Reduce by half and then stir in the cream. Bring back to a boil and add the lemon rind and the juice. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the linguine in a large pan of boiling salted water until tender. Drain, return to the pan, and add the sauce and peeled shrimp tails. Sprinkle over the dill and gently heat everything together while also turning all the ingredients over and into each other so as to cohere both pasta and shrimp with sauce and dill. Once you are sure that all is good and hot, serve without delay. </p>"}]}