{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/cover-madhurjaffrey-indiancooking.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "Indian", "keywords": ["An Invitation to Indian Cooking", "cauliflower", "classic cookbooks", "gluten free", "healthy and delicious", "Indian", "Madhur Jaffrey", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Classic Cookbooks: Madhur Jaffrey's Cauliflower with Ginger and Chinese Parsley", "link": "https://www.seriouseats.com/recipes/2008/03/classic-cookbooks-madhur-jaffreys-cauliflower-ginger-chinese-parsley-recipe.html", "description": "I didn’t discover Indian food until I was 21 and living in New York City for the first time, and I didn’t try cooking it until my husband and I started dating a few years later. His family, he explained,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cauliflower", "Classic Cookbooks", "Gluten-Free", "Healthy and Delicious", "Indian", "Mains", "Sides", "Vegetarian"], "recipeIngredient": ["A piece of fresh ginger, about 2 1/2 inches by 1 inch, peeled and coarsely chopped", "1 large head fresh cauliflower, or 2 small ones", "8 tablespoons vegetable oil [I only use 4, even with a large head of cauliflower]", "1/2 teaspoon ground turmeric", "1 fresh hot green chili, finely sliced, or 1/4 teaspoon cayenne pepper (optional)", "1 packed cup coarsely chopped Chinese parsley (cilantro/coriander)", "1 teaspoon ground cumin", "2 teaspoons ground coriander", "1 teaspoon garam masala", "1 tablespoon lemon juice", "2 teaspoons salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the ginger into a blender jar with 4 tablespoons of water and blend until it becomes smooth, about 1 minute. [This just doesn’t work with my blender, but it doesn’t seem to matter. I usually grate the ginger and whisk it with a little water to make a loose paste.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the thick, coarse stem of the cauliflower and remove all leaves. First break the cauliflower into large florets with your hands (if the head is loosely packed) or a knife (if it is tightly packed). Since you want to end up with small florets, not longer than 1 by 1 1/2 inches and not wider at the head than 1/2 to 1 inch, she recommends taking each large floret and beginning by slicing the stems crosswise into fairly thin rounds. Keep these, as they are quite edible. When you reach the upper end of the stem, start breaking off the small florets. Slice the stem into rounds whenever it seems too long, and keep the rounds. Wash the florets and rounds of stem in a colander and leave to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 12-inch skillet over medium heat. Add the ginger paste and turmeric. Fry, stirring constantly; after about 2 minutes, add green chili or cayenne and cilantro; after another 2 minutes, put in the cauliflower, continuing to cook and stir for 5 minutes. (If necessary, add 1 teaspoon warm water at a time to prevent sticking.) Now add the cumin, coriander, garam masala, lemon juice, salt, and 3 tablespoons warm water, cook and stir for about 5 minutes, then cover, lower the flame, and let cook slowly for 35-45 minutes (tightly packed cauliflower takes longer to cook), stirring gently every 10 minutes. The cauliflower is done when it is tender with just a faint trace of crispness along its inner spine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Lift out gently and place in serving dish—a low, wide bowl would be best. Serve with hot chapatis, pooris, or parathas, or serve with any kind of lentils and plain boiled rice. it is particularly good with Lamb Pullao and Cumcumber Raita.</p>"}]}