{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/sacklunch.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["broccoli rabe", "lentils", "mains", "sack lunch", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: Beluga Lentils and Broccoli Rabe", "link": "https://www.seriouseats.com/recipes/2008/05/beluga-lentils-and-sauteed-broccoli-rabe-rapini-recipe.html", "description": "Chefs often say that diners choose entr&eacute;es based on sides: for instance, anything paired with mashed potatoes moves faster than it otherwise would. At my house, though, I don’t pay much attention to the side dishes, maybe because there’s only...", "totalTime": "", "recipeYield": "6 as a side dish or 4 for lunch", "recipeCategory": ["Beans and Pulses", "Mains", "Sides", "Vegetarian"], "recipeIngredient": ["1 1/2 cups beluga lentils", "1/2 cup extra-virgin olive oil", "1/2 cup diced white onion", "1 teaspoon thyme leaves", "1 chile de árbol", "1/4 cup red wine", "3 sprigs basil", "Kosher salt and freshly ground black pepper", "1 1/2 pounds rapini, ends trimmed", "1/2 cup extra-virgin olive oil", "3 cloves garlic, thinly sliced", "1 teaspoon thyme leaves", "1 chile de árbol, thinly sliced on the diagonal", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the lentils and pick through them to remove any small stones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a medium saucepan over medium heat for 2 minutes. Swirl in 2 tablespoons olive oil and wait a minute. Add the onion, thyme, chile, 1 teaspoon salt, and a pinch of pepper. Cook the onion, stirring often, until soft and translucent, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lentils and 1 teaspoon salt. Cook about  2 minutes, stirring to coat the lentils in the oil and vegetables. Reduce the heat to low and add the wine. Quickly add 6 cups water and bring to a boil over high heat. Turn down the heat and simmer 25-30 minutes, until the lentils are tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the lentils over a bowl. Toss them with the remaining 6 tablespoons olive oil, the basil sprigs, 1/2 teaspoon salt, and 1/3 cup of the cooking liquid. (Add more of the liquid if the lentils seem dry.) Taste for seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Sautéed Rapini with Garlic and Chile</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of heavily salted water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blanch the rapini a couple of minutes in the rapidly boiling water, until just tender and al dente. Drain. Cool on a platter or baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large sauté pan over high heat for 2 minutes. Pour in 1/4 cup olive oil and add the garlic, shallots, thyme, and chile. Cook a few minutes, until the shallots are translucent. Add the rapini and 1 teaspoon salt. Stir well, coating the rapini with the other ingredients and bathing it in the oil. Drizzle the remaining 1/4 cup oil over the rapini and sauté 2 minutes, tossing often. Sprinkle another teaspoon salt and a pinch of black pepper over the rapini, toss, and taste for seasoning.</p>"}]}