{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080613-strawberries-thumb.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Chez Panisse Desserts", "desserts", "Serious Eats Essentials", "strawberries", "strawberry shortcake", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Essentials: Strawberry Shortcake", "link": "https://www.seriouseats.com/recipes/2008/06/chez-panisse-strawberry-shortcake-recipe.html", "description": "I'm about to type a cop-out phrase that I would immediately cut if I were editing someone else's work: I don't know if I can find words to express how I feel about strawberry shortcake.", "totalTime": "", "recipeYield": "12", "recipeCategory": ["Desserts", "Serious Eats Essentials", "Strawberry", "Vegetarian"], "recipeIngredient": ["4 pint baskets strawberries", "About 6 tablespoons sugar", "2 cups flour", "1/2 teaspoon salt", "1 tablespoon baking powder", "1/2 cup unsalted butter", "3/4 cup plus 2 tablespoons whipping cream (for shortcakes)", "1 1/2 cups whipping cream (for whipped cream)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash, dry, and hull the berries. Crush about one-quarter of them and slice the rest into the crushed berries. Toss with sugar to taste--a tablespoon or so per basket--and chill until serving time. The strawberry mixture should be very juicy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready to make the biscuits, get the berries out of the refrigerator to come up to room temperature. Mix the flour, salt (unless you are using salted butter), baking powder, and 2 tablespoons sugar. Cut in the butter until the mixture looks like cornmeal with a few larger pieces of butter in it. You can use a pastry blender, two knives, or quick rubbing fingers. (I use two knives and then fingers, and honestly, it never looks like cornmeal. It is very dry. This is okay.) Stir in 3/4 cup cream, just until most of the dry mixture has been moistened; it will still be quite dry. Turn out on a board and knead just a few times, until the dough just comes together. It might still be a little crumbly at the edges. Roll or pat 1/2 inch thick and cut into squares or circles or whatever shape you like. This recipe will make 12 individual shortcakes. You can use cookie cutters, but then you'll have scraps--I prefer simply to carve up the patted-out dough into 12 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the shortcakes on an unbuttered baking sheet. If you used cookie cutters, lightly knead together any scraps and roll again and cut. Brush the tops with the remaining 2 tablespoons cream. I like to sprinkle them with a little turbinado sugar at this point, too, but it isn't necessary. Bake in a preheated 425°F oven for 10 to 12 minutes or until the tops are lightly browned and the dough is set. Cool on a rack and serve while warm. Make the whipped cream while the biscuits cool a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Warm the shortcakes if necessary, split them, and spoon berries liberally over the bottom halves. Set the tops back on and spoon some whipped cream over them. There should be lots of berries and lots of cream.</p>"}]}