{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bobby Flay's Chocolate-Coconut Bread Pudding with Passion Fruit Sauce", "link": "https://www.seriouseats.com/recipes/2008/11/bobby-flay-chocolate-coconut-bread-pudding-with-passion-fruit-sauce.html", "description": "...", "totalTime": null, "recipeYield": "8", "recipeCategory": ["Desserts"], "recipeIngredient": ["<strong> For Passion Fruit Sauce: </strong>", "3/4 cup passion fruit juice", "1/4 cup granulated sugar", "1/4 cup freshly squeezed orange juice", "2 tablespoons white rum", "&nbsp", "<strong>For Coconut Anglaise:</strong>", "1 cup whole milk", "1 cup unsweetened coconut milk", "1/2 vanilla bean, split and seeds scraped", "4 large egg yolks", "3 tablespoons granulated sugar", "&nbsp", "<strong> For Ganache:</strong>", "6 ounces bittersweet chocolate, finely chopped", "6 ounces heavy cream", "&nbsp", "<strong> For Bread Pudding </strong>", "17 ounces brioche (crust removed before weighing), cut into 1 ½-inch dice", "3 tablespoons unsalted butter, melted", "3 cup heavy cream", "2 cups unsweetened coconut milk", "1 ¼ cups pure cane sugar", "½ vanilla bean, split and scraped", "4 whole large eggs", "2 large egg yolks", "8 ounces bittersweet chocolate (Valhrona Manjari 64 percent), finely chopped", "Chocolate ganache (recipe above)", "1 cup desiccated coconut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Make Passion Fruit Sauce: </strong> <br />\nCut the passion fruit in half and scoop out centers (seeds also) into a small saucepan. Add the sugar, orange juice and rum and cook over high heat until sugar has melted and sauce has thickened, about 5-7 minutes. Transfer to a bowl and chill in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Make Coconut Anglaise: </strong> Bring the milk, coconut milk and vanilla bean and seeds to a simmer in a small saucepan. Whisk together the egg yolks and sugar in a medium bowl until pale. Slowly whisk in the warm milk mixture until combined. Remove the vanilla bean, return the mixture to the pan over medium heat and cooking, stirring with a wooden spoon until the mixture coats the back of a wooden spoon, about 4 minutes. Immediately strain the mixture into a bowl set in a cold water bath to stop the cooking. Cover and refrigerate for at least 1 hour before serving.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Make Ganache: </strong> Place the chocolate in a small bowl. Bring the cream to a simmer in a small saucepan then pour over the chocolate. Let sit for 30 seconds then whisk until smooth, keep warm.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Make Bread Pudding: </strong> Preheat oven to 325 degrees F. Line a large baking sheet with parchment, add the bread, drizzle with the butter and toss to coat. Bake in the oven and lightly golden brown, tossing several times, about 12 minutes. Remove and let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cream, coconut milk, sugar and vanilla bean and seeds in a medium saucepan and bring to a simmer over high heat, and whisk until the sugar is dissolved. Add the chopped chocolate and whisk until melted. Strain the mixture into a clean bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the eggs and yolks in a medium bowl and slowly whisk in the warm chocolate mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cubes in a single layer in the bottom of a 9-inch x 13-inch baking dish. Pour ½ of the custard over, half of the ganache and sprinkle with half of the coconut. Press down on the bread to allow the liquid to soak in. Place the remaining bread cubes over the top, add the remaining custard and ganache and again, press down to completely submerge the bread. Top with the remaining coconut, cover and let sit for at least 1 hour before baking.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325 degrees F. Place the dish in a larger roasting pan and fill outer pan with warm water until it comes halfway up the sides of the baking dish. Back until the sides are slightly puffy and the center is slightly set (but still jiggles a bit), about 40 minutes. Remove the pan to a baking rack and let sit at least 15 minutes before serving. Spoon some of the coconut anglaise into a bowl. Drizzle with some of the passion fruit sauce and top with a large scoop of the bread pudding.</p>"}]}