{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080929-hainanese-chicken.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "rice", "singapore", "street food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Hainanese Chicken Rice", "link": "https://www.seriouseats.com/recipes/2008/09/hainanese-chicken-rice-singapore-recipe.html", "description": "Hainanese chicken rice dish from a recent Singaporean street food demo in New York. I'll be very honest: Hainanese chicken rice looks like one of the most boring dishes on this fair Earth. The white chicken pieces sit atop...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Rice"], "recipeIngredient": ["1 chicken ", "1 large piece of a ginger, peeled", "12 garlic cloves, peeled and chopped", "1 scallion", "1 1/2 cups jasmine rice", "5 tablespoons canola oil ", "4 shallots, finely chopped", "Salt ", "6 red chilies", "1 lime", "1/2 teaspoon rice vinegar", "1 teaspoon sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 5 quarts of water to a boil in a very large pot.  Sprinkle the outside and inside of the chicken with salt.  Tuck 2 cloves of garlic, one small thumb-sized piece of ginger, and the scallion into the cavity.  Tie the legs together with kitchen string, keeping the cavity closed.  When the water reaches a boil, add the chicken to the pot.  Bring the water back to a boil, then reduce the heat to very low, cover the pot, and let cook for 30 minutes.  Once done, remove the chicken and toss in enough ice water to completely cover the chicken. (At least 2 ice cube trays full should work.) The point is to cool down the chicken for 10 minutes, as much as possible.  Drain and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, start making the sauces.  Toss about 2 thumb-sized pieces of ginger, 2 teaspoons of salt, and 3 tablespoons of canola oil into a blender.  Process until smooth.  Set aside.  Wash out the blender for the second sauce.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the serrano chilies, 1 shallot, 1 thumb sized piece of garlic, 3 cloves or garlic, juice of 1 lime, 1 tablespoon water, the rice vinegar, and the sugar.  Process until blended.  Set aside.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another large pot, pour in two tablespoons of canola oil and turn the heat to medium-high.  Add 3 of the chopped shallots, and 5 chopped garlic cloves.  Cook for about 30 seconds, then dump in the rice and cook for 2 minutes, stirring constantly.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add three cups of the water leftover from cooking the chicken.  Bring to a boil, then reduce to a simmer and cook for 20 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skin from the chicken, and slice the meat into 1/2-inch thick strips.  Pile the rice on a plate, top with the chicken, and stir in the condiments as you see fit.  </p>"}]}