{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080724cornavocadosoup.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["avocado", "corn", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sweet Corn Soup with Avocado Cream", "link": "https://www.seriouseats.com/recipes/2008/07/sweet-corn-soup-avocado-cream.html", "description": "It seems like every recipe for chowder uses liberal amounts of heavy cream. That might make soup instantly rich and delicious, but it's not exactly healthy. My girlfriend loves corn chowder, but just about every recipe has too much dairy...", "totalTime": null, "recipeYield": "4 as a small course", "recipeCategory": ["Avocado", "Corn", "Dinner Tonight", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["2 tablespoons unsalted butter", "1/2 cup peeled and diced Yukon Gold potatoes", "1/2 large onion, diced", "1/2 chile de arbol (or a large pinch of red pepper flakes)", "1/2 tablespoon thyme leaves (dry is fine)", "2 cups fresh corn kernels, from about 3 ears", "Handful of cilantro, leaves chopped and sprigs reserved", "1/2 jalapeno, de-seeded and chopped", "1/2 avocado", "1/3 cup creme fraiche", "1-2 teaspoons lime juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, heat the butter over medium heat; when it foams, add the potatoes, onion, chile, and thyme and turn the heat to low.  Cook gently for 10 minutes until the potatoes begin to turn creamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the heat to high and add the corn, cilantro sprigs, half the jalapeno, a pinch of salt and a few grinds of black pepper.  Cook, coating in the butter, for a minute or so, then add ten cups of water.  Bring to a boil, then simmer for 30 minutes, or until the corn and potatoes are tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, puree the avocado with the creme fraiche and remaining jalapeno, adding lime juice, salt, and pepper to taste.  I more than doubled the lime juice called for in the recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the soup into a large bowl, discarding the chile.  Put the corn mixture into a blender with a little of the liquid and blend at low speed until pureed.  Add a cup of the liquid and blend on high, adding the liquid in stages until the soup has the consistency of heavy cream.  Taste for seasoning and adjust with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with a dollop of the avocado cream, scattered cilantro leaves, and thin slices of avocado, if desired.</p>"}]}