{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080317-arthurschwartz.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "Kosher", "keywords": ["Arthur Schwartz", "Cook the Book", "hamantaschen", "holidays", "Jewish", "Jewish Home Cooking", "pastries", "Purim"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Hamantaschen", "link": "https://www.seriouseats.com/recipes/2008/03/hamantaschen-recipe-jewish-home-cooking-arthur-schwartz.html", "description": "Purim starts tonight, and one of the traditional foods associated with the holiday is Hamantaschen. The triangular treats are said to either resemble the villain Haman's tri-corner hat or his triangular pockets (hamantaschen literally means \"Haman's pockets\"). Though originally associated...", "totalTime": "", "recipeYield": "about 36", "recipeCategory": ["Cookies", "Hanukkah", "Kosher", "Seasonal and Holiday"], "recipeIngredient": ["<strong>For the dough: </strong>", "<ul><li>3 cups bleached all-purpose flour</li> ", "<li>1 cup sugar </li>", "<li>2 teaspoons baking powder</li>", "<li>1/4 teaspoon salt </li>", "<li>10 tablespoons (1 stick plus 2 tablespoons) cold unsalted butter or pareve margarine, cut into 1/2-inch cubes </li>", "<li>2 eggs </li>", "<li>2 egg yolks </li>", "<li>1 teaspoon vanilla extract</li></ul>", "<strong>For the chocolate filling: </strong> ", "<ul><li>6 ounces semisweet chocolate</li>", "<li>1/2 cup (1 stick) butter</li> ", "<li>1/4 teaspoon salt</li>", "<li>1 teaspoon vanilla extract", "<li>1 cup sugar</li>", "<li>2 eggs, lightly beaten</li>", "<li>1/4 cup bleached all-purpose flour</li>", "<li>1/4 to 1/2 cup finely chopped walnuts (optional)</li> ", "<li>2 large egg whites, lightly beaten with</li>", "<li>2 teaspoons of sugar for the egg wash</li></ul>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<ol><li><strong>Make the dough: </strong>In the bowl of a food processor fitted with the metal blade, place the flour, sugar, baking powder, and salt. Pulse several times to combine. </li>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>Add the butter; pulse several more times, then process for a few seconds to form mealy crumbs.</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>In a small bowl, beat together the eggs, egg yolks, and vanilla. Pour this egg mixture into the processor; pulse several times to mix it in, then process for about 10 seconds. Stir the mixture up from the bottom with a rubber spatula, then process again until the dough begins to clump together, about 10 seconds more.</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>Turn out onto a lightly floured surface and, with floured hands, press dough together, divide in half, form into 2 disks. Wrap each disk with plastic wrap; refrigerate for at least 1 hour or up to 3 days. (The dough may be frozen for up to 4 months.)</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li><strong>Prepare the filling:</strong> In a small saucepan over low heat, melt the chocolate and butter together, stirring until perfectly smooth. Add the salt, vanilla, sugar, eggs, flour, and walnuts; stir until well blended. (<em>Any unused portion of the filling can be frozen for up to 4 months.</em>)</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>If baking all the hamantaschen at once, on two baking sheets, position the oven racks in the lower and upper thirds of the oven. If making only one sheet at a time, the rack should be in the center of the oven. Preheat oven to 350°F. Dab the corners of the baking sheets with butter; line them with parchment paper.</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>If the dough is coming straight from the refrigerator, let it warm slightly at room temperature (about 20 minutes) so it can be rolled out. On a lightly floured board, roll dough to 3/16 inch thick. With a 3-inch round cookie cutter, cut circles of dough, and place them on the prepared sheets.</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>Place about 2 teaspoons of filling in the center of each circle. Brush perimeter of circle with egg wash. Using a dough scraper, lift dough to partially cover the filling, spacing it at one-third intervals, like a tri-cornered hat. Brush the tops of the formed cookies with egg wash.</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>Bake 15 to 18 minutes or until the cookies are golden brown. If baking more than one sheet at a time, rotate sheets top to bottom and front to back toward the end of the baking time to ensure even browning.</li></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><li>Remove from oven; let rest on baking sheets for 2 or 3 minutes. Loosen the cookies with a thin metal spatula; transfer to wire cooling racks.</li></ol></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Notes: </strong>Cookies may be stored in an airtight container, layered between strips of waxed paper, for up to 5 days. These cookies stand up well to freezing.</p>"}]}