{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080331-sweetmelissa.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["Melissa Murphy", "The Sweet Melissa Baking Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Sweet Melissa Baking Book: Toasted Almond Lemon Bars", "link": "https://www.seriouseats.com/recipes/2008/04/the-sweet-melissa-baking-book-toasted-almond-lemon-bars-recipe.html", "description": "Today's Cook the Book recipe adapted from The Sweet Melissa Baking Book is for toasted almond lemon bars. Don't even think of skipping the toasted almonds in this recipe; adding them to the shortbread crust here gives these bars a...", "totalTime": "", "recipeYield": "12 servings", "recipeCategory": ["Brownies and Bars"], "recipeIngredient": ["<strong>For the crust</strong>", "2 cups all-purpose flour", "1/2 cup sliced blanched almonds, lightly toasted* ", "1/2 teaspoon salt", "20 tablespoons (2 1/2 sticks) cold, unsalted butter, cut into 1/4-inch pieces", "<strong>For the lemon filling</strong>", "4 large eggs", "1 3/4 cups sugar", "1/2 teaspoon almond extract", "1/2 cup all-purpose flour", "3/4 cup fresh lemon juice (about 7 lemons)", "* <strong>To toast nuts:</strong> Preheat the oven to 350ºF. Spread the almonds in a single layer on a cookie sheet. Bake for 10 to 12 minutes, or until lightly golden and you can smell them. Remove to a wire rack to cool.", "<strong>Before you start</strong>", "Position a rack in the center of your oven. Preheat the oven to 350ºF. Spray a 9x13-inch pan with nonstick vegetable cooking spray. Make a parchment \"sling\" by cutting two pieces of parchment paper, measuring 16 1/2 inches long by 12 inches wide (you can"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the crust</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor fitted with the metal blade, pulse the flour, sugar, almonds, and salt to combine. Add the cold butter in pieces and pulse until the dough comes together in a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out into the prepared pan and press evenly into the bottom and 1 1/4 inches up the sides. (This crust, once it is baked, needs to act as a liner in which to pour the liquidy lemon filling. So be sure to do a good job of pressing the dough up the sides–no cracks!) Cover the dough with a piece of parchment paper or aluminum foil, and fill with pie weights (you can use dried beans or uncooked rice as pie weights as well). Bake for 25 to 30 minutes, or until lightly golden. Carefully remove the pie weights and the liner and bake for an additional 10 to 15 minutes, or until the whole crust is golden. Remove to a wire rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the filling</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the eggs and sugar until smooth. Add the almond extract and flour, and whisk until smooth. Add the lemon juice, and whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To complete the bars</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the lemon filling into the prepared crust. Reduce the oven temperature to 325ºF. Bake for 30 minutes, or until the filling is firm and lightly golden. Remove to a wire rack to cool.</p>"}]}