{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "Fairway", "roast beef", "roast beef sandwiches", "sandwiches", "Steven Jenkins", "The Food Life"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: New York Deli-Style Roast Beef Sandwich with Coleslaw and Russian Dressing", "link": "https://www.seriouseats.com/recipes/2008/07/new-york-deli-style-roast-beef-sandwich-recipe.html", "description": "Of all the well-stocked aisles, overflowing produce bins, and plentiful culinary departments at Fairway, none is quite as impressive as the deli counter. Which stands to reason&mdash;after all, the market is in New York City, birthplace of the Jewish delicatessen....", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Beef", "Cook the Book", "Sandwiches"], "recipeIngredient": ["<strong>For the roast beef</strong>", "3 shell steaks (about 1/4 pound each)", "Kosher salt", "<strong>For the coleslaw</strong>", "3/4 to 1 cup mayonnaise", "1/4 cup sugar", "2 tablespoons cider vinegar", "1/2 head green cabbage, cored and finely shredded", "1 carrot, peeled and coarsely grated", "Kosher or sea salt and freshly ground black pepper, to taste", "<strong>For the Russian dressing</strong>", "1/2 cup mayonnaise", "1/4 cup ketchup", "1/4 cup sweet pickle relish, drained well in a sieve", "3 cornichons, thinly sliced", "8 to 12 slices seeded Jewish rye", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450ºF. Rub the steaks all over with kosher salt (about 1/2 teaspoon per steak). Place the steaks on a rimmed baking sheet and roast until the meat registers 130ºF on an instant-read thermometer, about 25 minutes. Transfer to a board and let rest until cool (about 30 minutes). If possible, don't refrigerate the meat before assembling the sandwiches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the slaw, in a large bowl whisk together the mayonnaise, sugar, and vinegar. Add the cabbage and carrot and toss well, then season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold together all the ingredients for the Russian dressing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the beef very thinly against the grain. To assemble, spread Russian dressing on one side of each slice of rye bread. Divide the sliced beef among half the slices of bread. For a deli-style look, drape the meat in a mound rather than laying it flat. Sprinkle the meat with a little salt, then top each sandwich with a generous scoop of coleslaw. Top the slaw with another small dollop of Russian dressing, close the sandwiches, and slice them in half. Provide plenty of napkins for your guests. (If your sandwich isn't a little messy, you did something wrong.)</p>"}]}