{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-quesadilla1.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["mushrooms", "quesadilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Quesadillas with Mushrooms", "link": "https://www.seriouseats.com/recipes/2008/09/quesadillas-with-mushrooms-recipe.html", "description": "No, not the ones with shredded Monterey jack and flour tortillas. I gave those up years ago. These Diana Kennedy-approved quesadillas are made from masa (the Spanish cornmeal dough in tortillas, tamales, arepas), stuffed with Oaxaca cheese and strips of...", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Mushrooms"], "recipeIngredient": ["1 cup tortilla masa harina", "3/4 cup warm water", "5 ounces Oaxaca cheese, shredded", "1 poblano chile, stem removed, and sliced thinly", "Salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the warm water, a pinch of salt, and the masa harina until doughy.  Set in a bowl, wrap with plastic, and set aside for 15 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour the oil into a skillet and turn the heat to medium.  Cook the mushrooms until they have released their liquid.  Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the masa ball into 12 little balls. Tear off a piece of plastic wrap, about 2 feet long, and set a ball of dough on top, and fold over the wrap to cover.  Flatten each ball with a tortilla press or the bottom of a large pot.  It should be about 1/8 inch thick, just a little bit thicker than a normal tortilla. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set one strip of poblano in the center, sprinkle with a little cheese, and a small handful of mushrooms.  Fold the masa in half, using the plastic wrap to .  Repeat with the other balls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a large skillet over medium high heat.  Set a few quesadillas on and cook for five minutes.  Then flip, and cook for another five minutes.  Serve immediately. </p>"}]}