{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cabbage", "Cook the Book", "Mindy Fox", "Olives and Oranges", "pasta", "rosemary", "Sara Jenkins", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Long Pasta with Bacon, Red Cabbage, Walnuts, and Rosemary", "link": "https://www.seriouseats.com/recipes/2008/09/cook-the-book-long-pasta-with-bacon-red-cabba.html", "description": "Today's Cook the Book recipe, the first to be excerpted from Olives &amp; Oranges by Sara Jenkins and Mindy Fox, looks ahead to the coming winter months. Long Pasta with Bacon, Red Cabbage, Walnuts, and Rosemary comprises basic cold-weather staples,...", "totalTime": null, "recipeYield": "6 servings", "recipeCategory": ["Bacon", "Cabbage", "Cook the Book", "Nuts", "Pasta"], "recipeIngredient": ["1 tablespoon unsalted butter", "3/4 cup chopped walnuts", "2 tablespoons chopped fresh rosemary", "2 tablespoons extra-virgin olive oil", "4 slices thick-cut bacon, cut into 1/4-inch-wide strips", "1 small head red cabbage (1 1/2 pounds), cored and very thinly sliced", "1 teaspoon fine sea salt", "1 cup heavy cream", "1 cup water", "2 cups freshly grated Parmigiano-Reggiano cheese", "1 pound spaghetti or bucatini", "Coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a medium skillet over medium-low heat. Add walnuts and rosemary and cook, stirring occasionally, until nuts are toasted, about 4 minutes. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a plate with paper towels. Add oil and bacon to a large skillet and cook over medium-low heat, stirring occasionally, until fat is rendered from bacon, about 8 minutes. Using a slotted spoon, transfer bacon to paper towels to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat under pan to medium-high. Add a large handful of cabbage and salt and cook, stirring, until cabbage is wilted and you have room in skillet to add more. Continue adding cabbage in batches and cooking until it is all wilted. Then cook, stirring occasionally, until cabbage is tender and lightly browned around edges, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cream and walnut mixture cabbage, cook for 1 minute. Add 1/2 cup water and cook, stirring, for 2 more minutes. Add remaining 1/2 water and bring to a gentle simmer; then reduce heat to medium and cook until the sauce is thick and flavors are well blended, 8 to 10 minutes. Stir in reserved bacon, remove from heat, and partially cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pasta until al dente. Drain, transfer to a large bowl, and immediately toss with cabbage sauce. Add half of cheese and toss; add remaining cheese and toss once more. Season generously with pepper and serve at once. </p>"}]}