{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080917-frittata-thumb.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["frittatas", "mint", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Frittata with Potatoes, Bacon, and Mint", "link": "https://www.seriouseats.com/recipes/2008/09/frittata-with-potatoes-bacon-and-mint-recipe.html", "description": "Ever since my last meeting with a frittata, I've been dreaming of the next. Though it can be a mighty filling dinner, I believe frittatas were meant to be brunch on a lazy Sunday. Since they taste great hot or...", "totalTime": "", "recipeYield": "2 to 3", "recipeCategory": ["Bacon", "Dinner Tonight"], "recipeIngredient": ["1/4 pound bacon", "4 eggs", "1 large russet potato, skinned and diced to 1/4 inch squares", "1 1/2 cups red onion", "1/2 cup mint, chopped", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler.  Cut the bacon into 1/2 inch pieces.  Saute them in a pan over medium heat until they are cripsy and have rendered their fat.  Remove them from the pan and add the onion and the potatoes.  Cook for 10 to 15 minutes, or until the potatoes are soft.  Remove them from the pan.  Wipe the pan clean. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a large bowl and whisk until combined.  Add the potatoes, bacon, mint and onion.  Stir until combined.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the tablespoon of oil into the now clean pan.  Turn the heat to medium high, then pour in the egg mixture.  Cook for 6 minutes.  Then place it underneath the broiler for 1 to 2 minutes, or until golden brown.  Slide onto a plate. Season with salt and pepper, carve like a pie. </p>"}]}