{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["beurre blanc sauce", "Chanterelle", "sausage", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chanterelle's Grilled Seafood Sausage with Beurre Blanc Sauce", "link": "https://www.seriouseats.com/recipes/2008/11/chanterelle-grilled-seafood-sausage-with-beurre-blanc-sauce-recipe.html", "description": "...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Fish", "Lobster and Crab", "Other Seafood", "Shrimp"], "recipeIngredient": ["<strong>For the sausage:</strong>", "One 1 1/4-pound lobster or 6 ounces of precooked lobster meat", "6 ounces shrimp (any size), peeled, deveined, coarsely chopped, and chilled", "6 ounces dry sea scallops, coarsely chopped and chilled", "8 ounces striped sea bass, skinned, any pin bones removed, cut into 1-inch chunks, and chilled", "1 1/2 teaspoons kosher salt", "1 large egg white", "1 1/4 cups plus 2 tablespoons heavy cream", "1 teaspoon brandy", "2 teaspoons ruby port", "1/8 teaspoon cayenne", "1/4 cup pine nuts, toasted in a 300 degree F oven until lightly colored, about 10 minutes", "2 feet pork casings, washed under cold running water, letting the water run through them to rinse out the salt", "<strong>For the beurre blanc sauce:</strong>", "1/2 cup finely diced shallots", "1 cup dry white wine", "1/4 cup red wine vinegar", "1/4 cup heavy cream", "1/2 pound (2 sticks) unsalted butter, cut into large cubes and chilled", "Kosher salt", "Black pepper from a mill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sausage, bring a large pot of salted water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Kill the lobster quickly by holding it to face you, then driving a knife between its eyes and pulling it down toward you, like a lever.  Separate the claws and tail from the body.  Put the claws in the boiling water for 1 minutes, then add the tail and boil for another 2 minutes.  Use tongs to remove them from the water, and let cool to room temperature.  Remove the meat from the shells (it will be slightly undercooked) and remove the digestive track.  Coarsely chop the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 2 tablespoons each of the chopped shrimp and scallops, and all of the sea bass, in a food processor fitted with a steel blade.  Add 1 teaspoon of the salt and the egg white.  Process to a mousse texture, then, with the machine still running, very slowly add 1 cup plus 2 tablespoons of the cream through the feed tube in a steady, thin stream.  Transfer the mousse to a large bowl and fold in the remaining seafood, as well as the brandy, port, cayenne, and pine nuts.  Stir in the remaining 1/2 teaspoon salt.  The filling should be fluffy, light pink, and firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a pastry bag with a 1/2-inch plain tip and fill it with the mousse.  Pipe the mixture into the pork casings by scrunching the casing onto the pastry tip and gently but tightly filling the casing.  Use a pin to puncture the casing if any air pocket develops.  Use cotton butcher’s twine to tie the sausage at 5-inch lengths, securing the links at both ends.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil, then reduce the heat to a gentle simmer.  Add all the sausage to the water and poach until firm and opaque, about 30 minutes.  Turn off the heat and hold the sausage in the pot for 5 minutes.  Use tongs to remove it from the water, drain well, and chill until ready to broil, preferably overnight.  (The sausage can be wrapped in plastic wrap and refrigerated for up to 3 days.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, to make the beurre blanc, put the shallots, wine, and vinegar in a nonreactive saucepan set over medium-high heat.  Bring to a boil and reduce, stirring frequently, until the pan is almost dry, about 15 minutes.  Whisk in the remaining 1/4 cup cream and simmer the sauce to reduce and thicken it, about 3 more minutes.  Lower the heat to medium and whisk in a few cubes of the cold butter at a time until they are all incorporated into a thick, emulsified butter sauce.  Season with salt and pepper to taste.  Keep warm in the top of a double boiler for up to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler and arrange the chilled seafood sausages on a broiler pan.  Score each sausage diagonally at 1/2-inch intervals and brush generously with the melted butter.  Broil the sausages on one side only until browned, about 3 minutes.  Move the pan down to a lower rack, turn the links over, and cook until warm all the way through, about another 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange 1 sausage on each of 4 plates and spoon some beurre blanc sauce decoratively around the plate.  Serve immediately.</p>"}]}