{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["apples", "desserts", "fall recipes", "holidays", "Lidia Bastianich", "thanksgiving", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lidia Bastianich's Apple Strudel", "link": "https://www.seriouseats.com/recipes/2008/11/lidia-bastianichs-apple-strudel.html", "description": "...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Apple", "Desserts"], "recipeIngredient": ["<strong>For the dough:</strong>", "2 cups sifted unbleached all-purpose flour, plus more for kneading the dough", "3 tablespoons extra virgin olive oil", "1/2 teaspoon salt", "1/2 cup tepid water, or as needed ", "&nbsp", "<strong>For the filling:</strong>", "1 cup golden raisins", "2 tablespoons dark rum", "1 lemon", "8 tablespoons (1 stick) unsalted butter, softened", "1 cup dry plain bread crumbs", "1 1/2 cups sugar", "1/2 teaspoon ground cinnamon", "3 pounds tart green apples, such as Granny Smith", "Olive oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the strudel dough.  Combine the flour, oil and salt in the work bowl of a food processor. With the motor running, add 1/2 cup of the water and process until the mixture forms a smooth, silky dough.  If the mixture is too dry, add more water, one tablespoon at a time, stopping the motor after each, until the dough is the proper consistency.  Turn the dough out onto a lightly floured surface and knead, adding flour as necessary to prevent the dough from sticking to your hands and the work surface, until the dough is very smooth and elastic, about 3 minutes.  Wrap the dough in plastic wrap and let it rest at room temperature 2 to 3 hours or in the refrigerator for up to 2 days. (Remove refrigerated dough to room temperature at least 1 hour before rolling the dough.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dough by hand: Pile the flour in a mound in a medium-size mixing bowl.  Make a deep well in the mound and add 1/2 cup water, the oil and salt.  Beat the wet ingredients with a fork while gradually incorporating the flour from the sides of the well.  When the dough is too stiff to mix with the fork begin kneading in the flour with your hands.  If the mixture is too dry, add more water, one tablespoon at a time, mixing well after each, until the dough is the proper consistency.  Turn the dough out onto a lightly floured surface and knead as above. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl toss the raisins with the rum. Let them stand, tossing occasionally, while preparing the strudel.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a fine grater, remove the zest--bright yellow part of the skin without the underlying white pith--from the lemon.  Squeeze the juice from the lemon, strain it if necessary and combine the juice and zest in a medium-size mixing bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-size skillet, melt 4 tablespoons of the butter over medium heat.  Add the bread crumbs and toast, stirring constantly, until lightly browned, about 5 minutes.  Remove the skillet from the heat and stir in 1/2 cup of the sugar and the cinnamon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 1 cup sugar and the rum and raisins to the bowl with the lemon juice and zest.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a paring knife, peel the apples and cut them into quarters. Cut away the seeds and cores and cut the apple quarters into 1/2-inch-thick wedges. Add the apple wedges to the bowl containing the lemon-sugar mixture as you work to prevent them from darkening. Let the apples stand, toss them occasionally, until the sugar begins to dissolve and the apples are coated with the syrup.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If necessary, remove the strudel dough from the refrigerator.  Preheat the oven to 450ºF and brush a large (about 18- x 12-inch) baking pan with olive oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a large, smooth wooden or marble surface.  With a rolling pin--preferably a long, dowel-shaped rolling pin--roll out the dough from the center to the edges into a very thin rectangle that measures about 36 x 24 inches.  The dough will give you a little fight at first, but will relax more the more you roll it.  As it gets thinner, you should be able to pull and stretch it gently with your hands to coax it into the shape you want.  Don't worry if the dough tears a little in spots--you can patch it later--or if it doesn't form a perfect rectangle.  Flour the rolling surface and pin lightly as you work to prevent the dough from sticking.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the dough with one of the longer sides facing you.  Arrange a kitchen towel or length of double-thick cheesecloth so it underlaps the entire far side of the dough rectangle by about 4 inches. (This will help you move the strudel to the baking sheet once it is formed.)  Spread the bread crumb mixture evenly over the dough leaving a clean 1 1/2-inch-wide border on all sides of the rectangle.  Dot the breadcrumbs with small pieces of the remaining 4 tablespoons butter. Arrange the apple mixture in a long mound along the side closest to you.  The mound of apples should measure about 4 inches wide and as long as the bread crumb mixture, leaving the 1 1/2-inch-wide border clean.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the clean border closest to you over the apples.  Begin rolling the strudel into a fairly tight roll, starting at one end of the apple mound, giving it a half-roll and gradually working your way down the roll.  Repeat as necessary, working your way down gradually down the roll each time. Don't worry if the roll is uneven or tears in places.  You should end up with a fairly even, lumpy looking roll that is centered, seam side down, on the kitchen towel.  Use the towel to transfer the strudel to the prepared baking sheet, bending the strudel into crescent shape if necessary to fit it on the pan.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Seal the ends of the strudel by folding the ends of the roll underneath and pressing them firmly with your fingers.  Cut off excess dough.  Brush the strudel lightly with olive oil and place in preheated oven.  Immediately reduce the oven temperature to 375ºF. Bake 30 minutes.  Check the strudel: the top should be a light golden brown.  If deeper in color than that, reduce the temperature to 350ºF.  Rotate the baking pan in the oven so the strudel cooks evenly.  Continue baking until the strudel is deep golden brown and the crust is firm, about 30 minutes.  Remove the strudel from the oven and cool 30 minutes.  With two metal spatulas, carefully lift the strudel to a wire cooling rack and let stand until completely cooled.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cut the strudel into 1-inch-thick slices and sprinkle them with powdered sugar. </p>"}]}