{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080131-doriegreenspan-waffle-small.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "chocolate", "holidays", "Valentine's Day", "waffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Chocolate-Amaretti Heartbreakers", "link": "https://www.seriouseats.com/recipes/2008/01/baking-with-dorie-chocolate-amaretti-heartbreakers-waffles.html", "description": "I know it’s a little early for Valentine’s Day, but for those of you who plan ahead and test ahead, you might want to give these little heart-shaped waffles a pre-fete run.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking With Dorie"], "recipeIngredient": ["3 large double amaretti (or 6 amaretti from 3 paper-wrapped packets)", "2 ounces bittersweet chocolate", "5 tablespoons unsalted butter", "1 1/4 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/4 teaspoon baking soda", "Pinch of salt", "3/4 cup sugar", "1/3 cup unsweetened cocoa", "1 1/2 cups whole milk", "1 teaspoon pure vanilla extract", "1/4 teaspoon pure almond extract, optional", "2 large eggs", "Confectioner’s sugar, sweetened whipped cream, ice cream and/or hot fudge sauce, optional (but why would you skip these?)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the amaretti and bittersweet chocolate in the workbowl of a food processor or blender and process until pulverized; reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your waffle iron. If you’d like to serve these warm, preheat your oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter; reserve. In a large bowl, whisk together the flour, baking powder, baking soda, salt, sugar and cocoa. In another bowl, whisk together the milk, the extracts and eggs until well blended. Pour the liquid ingredients over the dry ingredients and stir with the whisk to combine. Fold in the reserved amaretti-chocolate mixture and the melted butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly butter or spray the grids of your waffle iron, if needed. Brush or spray the grids again only if subsequent waffles stick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon out 1/3 cup of batter (or the amount recommended by your waffler’s manufacturer) onto the hot iron, spreading it evenly with a metal spatula or wooden spoon. Close the lid and bake until just set. Bake these slightly less than you do other waffles because chocolate has a tendency to burn easily. There’s no need to worry, but you do want to keep an eye on these. Transfer the finished waffles to a cooling rack while you make the rest of the batch. Right before serving, warm these briefly, about 2 minutes in the oven&mdash;or don’t. They’re good at room temperature, too.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> If you’d like to offer a full five-of-hearts waffle, just put one on a large plate, dust with confectioner’s sugar, then scoop some whipped cream or ice cream (or both?) onto the center. Hot fudge sauce is both luscious and luxurious over these. Alternatively, separate the hearts and serve with all the toppings on the side or turn these into crisp cookies (see Playing Around).</p>"}]}