{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Cook the Book", "lamb", "Michael Tong", "stews", "The Shun Lee Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Beijing Lamb Stew", "link": "https://www.seriouseats.com/recipes/2008/08/beijing-lamb-stew-recipe.html", "description": "Lamb might not be the first meat that comes to mind when considering Chinese food, but this red-cooked Beijing Lamb Stew, excerpted from The Shun Lee Cookbook, is wholly authentic. Lamb breast yields the best results, but it can be...", "totalTime": null, "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Lamb", "Mains"], "recipeIngredient": ["1 pound boneless lamb breast, chopped into 1-inch cubes", "Vegetable oil, for deep frying, plus 1/4 cup", "2 ounces (about 1 1/2 bunches) dried soybean threads", "2 scallions, white part only, trimmed and sliced into 1-inch pieces", "One 1-inch piece peeled fresh ginger, cut into pieces 1/2 inch square and 1/4 inch thick", "2 small dried hot red chilies", "2 tablespoons rice wine or dry sherry", "2 whole star anise ", "One 1 1/2-inch piece of cinnamon stick", "3 tablespoons soy sauce", "1/4 cup smashed rock sugar, or 2 tablespoons white sugar plus 2 tablespoons brown sugar", "1 medium carrot, peeled and cut into 1 1/2-inch-long wedges", "6 Chinese dried black mushrooms (about 1/2 cup), soaked, trimmed, each mushroom cut into 3 pieces", "1 cube red fermented bean curd, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large saucepan of water to boil over high heat. Add the lamb and cook to remove some of the surface fat, about 3 minutes. Drain in a colander. Place the lamb on a plate and set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the saucepan, fill it with water, and bring it to a boil over high heat. Keep the water boiling so it is ready for the bean threads.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large wok over high heat. Add enough oil to come about 1 inch up the sides of the wok, and heat it 325°F. Carefully add the bean threads, and cook until they turn golden brown, about 10 seconds. Using a wide mesh strainer, transfer them to the boiling water, turn off the heat, and let them soak until softened, about 1 minute. Drain in a colander. Place the bean threads on a cutting board, cut them into 1 1/2-inch-long pieces, and set them aside. Discard the oil from the wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1/4 cup oil to a flameproof casserole or Dutch oven and heat over high heat. Add the scallions, ginger, and dried chilies, and stir-fry until they are fragrant, about 15 seconds. Add the lamb and stir-fry until the lamb is browned, about 2 1/2 minutes. Stir in the rice wine, star anise, and cinnamon stick, then they soy sauce, rock sugar, and 3 cups of water, and bring to a boil. Reduce the heat to medium-low. Cover the wok and simmer at a gentle bubble for 40 minutes. Add the bean threads, cover, and continue simmering for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the carrot, mushrooms, and fermented bean curd, if using, to the wok. Mash the bean curd on the side of the wok and stir it into the sauce. Simmer, covered, for 15 minutes, until the lamb and carrots are tender. (The stew can be made up to 1 day ahead, cooled, covered, and refrigerated. Scrape off and discard the solidified fat from the surface. Reheat gently before serving.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skin off and discard the fat from the surface of the sauce. Remove the star anise, cinnamon, and chilies, and serve hot. </p>"}]}