{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cakes", "chocolate", "Chocolate Epiphany", "Cook the Book", "desserts", "francois payard"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Charlie's Chocolate Pudding Cake", "link": "https://www.seriouseats.com/recipes/2008/08/charlies-chocolate-pudding-cake-recipe.html", "description": "Almost everyone is a chocolate lover. But recently, more and more people are making the leap to chocolate connoisseur. This new breed of aficionado is interested in more than milk vs. semisweet, Scharffen Berger vs. Callebaut. They want to know...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>For the cake:</strong>", "Vegetable cooking spray, for the pan", "1 cup all-purpose flour, plus extra for the pan ", "12 tablespoons unsalted butter", "12 ounces 50% chocolate, chopped", "1 cup sugar", "3 large eggs", "1 1/2 cups heavy cream", "<strong>For the glaze:</strong>", "7 ounces 50% chocolate, chopped", "2 tablespoons light corn syrup", "3/4 cup plus 1 tablespoon heavy cream", "3 tablespoons unsalted butter, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cake:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a rack in the center of the oven and preheat the oven to 400ºF. Spray the sides and bottom of a 9-inch round cake pan with vegetable cooking spray. Dust it with flour, shaking off the excess, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the butter to a boil in a medium saucepan over medium-high heat. Remove from the heat and add the chocolate to the pan. Whisk until the chocolate is melted and the mixture is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk the flour, sugar, and eggs together until just combined. Stir in the chocolate mixture, then the cream. Pour the batter into the prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 18 minutes, then put a piece of aluminum foil and a baking sheet over the top of the cake, to keep it from rising too much and to keep it moist. Lower the oven temperature to 360ºF and bake for another 20 minutes. The cake will be just set around the edges, and very loose in the middle, like a pudding. Remove from the oven and let the cake cool to room temperature while still in the pan. Place it in the freezer for at least 45 minutes or refrigerate overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the glaze:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chocolate and corn syrup in a small heat-proof bowl. Bring the cream to a boil in a small saucepan over medium-high heat. Pour it over the chocolate. Whisk the chocolate mixture until smooth. Let the glaze stand at room temperature for 5 minutes, then whisk in the butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To finish the cake:</strong> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper, and place a wire cooling rack on top of the paper. Remove the cake from the freezer, and dip the bottom of the pan in hot water to unmold it. You want the pan to be just warm enough for the cake to come out smoothly, but not melt. Flip the pan out onto the rack and tap the pan until the cake pops out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the glaze over the cake, using a spatula to even out the top and help the glaze run down the sides of the cake. Carefully, with a serving spatula, lift the cake from the rack and place it on a serving platter. Allow the cake to come to room temperature for 30 minutes, which will give the glaze time to set up. Using the back of a spoon, lightly tap the top of the cake in a large \"figure eight\" swirl, going from one end of the cake to the other. Serve at room temperature. </p>"}]}