{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080918-beetrosti-thumb.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beets", "pancakes", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Beet Rösti", "link": "https://www.seriouseats.com/recipes/2008/09/beet-rosti-fried-pancakes-recipe.html", "description": "If beets aren't your thing to begin with, this recipe won't convince you otherwise. It's a butter-fried pancake made of nothing but shredded beets, flour, a bit of chopped rosemary, and good old salt and pepper. The flavor is earthy,...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Sides", "Vegetarian"], "recipeIngredient": ["2 pounds beets (3 very large or 4 to 6 medium)", "2 teaspoons coarsely chopped fresh rosemary", "Salt and freshly ground pepper to taste", "1/2 cup flour", "2 tablespoons butter", "Minced parsley or a few rosemary leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a peeler, remove the skins from the beets as you would from a potato, then grate them in a food processor or using a box grater.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the beets and rosemary, and season with salt and pepper to taste.  Add about half the flour and toss well to combine.  Add a little more flour until the mixture holds together easily in a ball, using all the flour if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a 12-inch non-stick skillet over medium heat and melt the butter in it.  As the butter begins to brown, add the beet mixture and press down with a spatula to form a round patty.  Tuck in the sides until it resembles a circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pancake over medium-high heat until the bottom is crisp, about 10 minutes.  Place a large plate over the pancake, then invert the skillet while holding the plate, so that the pancake falls onto it.  Replace the skillet on the burner and slide the pancake back into the skillet, now with the other side facing the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook until the other side is crisp, another 10 minutes.  Remove from the heat and garnish with the parsley or rosemary.  Serve warm or at room temperature.</p>"}]}