{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "Chinese", "keywords": ["chicken", "Chinese", "Cook the Book", "fried rice", "Michael Tong", "rice", "sausage", "shrimp", "The Shun Lee Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sausage, Shrimp, and Chicken Fried Rice", "link": "https://www.seriouseats.com/recipes/2008/08/sausage-shrimp-and-chicken-fried-rice.html", "description": "Later in the week we'll be excerpting some complex, innovative Chinese recipes for more accomplished home cooks. But for today, here is a light, simple version of sausage, shrimp, and chicken fried rice, excerpted from this week's Cook the Book...", "totalTime": "", "recipeYield": "4 to 6 servings", "recipeCategory": ["Chicken", "Chinese", "Cook the Book", "Fried Rice", "Gluten-Free", "Mains", "Pasta", "Shrimp"], "recipeIngredient": ["One 2-ounce Chinese sausage", "3 ounces medium shrimp, peeled and deveined", "2 ounces boneless, skinless chicken breast, minced with a cleaver or heavy knife or in a food processor", "2 large eggs, plus 1 large egg white, beaten", "1 teaspoon cornstarch", "1/2 teaspoon plus a pinch of salt", "Vegetable oil, for passing through", "1/3 cup peeled and minced onion", "2 scallions, white and green parts, trimmed and minced", "3 tablespoons thawed frozen baby green peas", "2 1/2 cups cooked white rice", "Pinch of ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the bottom of an Asian-style steamer with an inch or two of water, and bring it to a boil over high heat. (You can also use a collapsible Western-style steamer in a large saucepan.) Put the Chinese sausage on a plate, place the plate in the steamer, cover, and steam until the sausage is heated through, about 10 minutes. Transfer the sausage to a cutting board and slice it diagonally into 1/2-inch-thick pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the shrimp, chicken, egg white, cornstarch, and the pinch of salt in a medium bowl. Mix well, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large wok over high heat. Add enough oil to come 1 inch up the sides of the wok, and heat it to 300°F. Add the shrimp and chicken, and stir gently unto they turn white, about 45 seconds. Using a wide wire-mesh strainer, transfer the shrimp and chicken to a colander to drain. Discard all but 4 tablespoons of the oil from the wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the wok with the oil to high heat, and heat until the oil is shimmering. Beat the whole eggs in a small bowl, and add to the wok. Scramble the eggs until they are quite firm and not runny, about 15 seconds. Transfer to a plate. Return the shrimp and chicken to the wok, and add the onions and the scallions. Stir-fry until the scallions soften, about 15 seconds. Add the sausage and peas, and stir-fry for 15 seconds. Add the rice, white pepper, and remaining 1/2 teaspoon salt, and stir-fry until the rice is piping hot, about 3 minutes. Return the eggs to the wok and stir-fry for a few seconds. Serve immediately. </p>"}]}