{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20080912-devilsfoodcake-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["baking", "chocolate", "devil's food", "marshmallows", "ovens"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "An Oven-Less Dessert: Steamed Devil's Food Cake", "link": "https://www.seriouseats.com/recipes/2008/09/steamed-devils-food-cake-chocolate-recipe.html", "description": "Plating Devil's food cakes on opening night. On Friday, the new Brooklyn restaurant where I am the pastry chef, opened its doors for business. Though the open kitchen (responsible for all of our savory dishes) is fully outfitted and operational,...", "totalTime": "", "recipeYield": "one standard loaf-size cake", "recipeCategory": ["Desserts"], "recipeIngredient": ["3/4 cup AP flour (90g)", "6 tablespoons cocoa powder (30g)", "1/2 teaspoon baking soda", "1/8 teaspoon salt", "1 large egg", "1/2 cup sugar (105g)", "1 teaspoon balsamic vinegar", "5 tablespoons canola or vegetable oil (70g)", "6 tablespoons water (84g)", "1/4 cup mini chocolate chips (40g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease a standard metal loaf pan (9X5X2), and line the bottom with parchment or wax paper.  Place a cooling or roasting rack in the bottom of a deep metal roasting pan and fill with water to just below the level of the rack.  Position the roasting pan over two stove burners.  Turn burners to medium-high and invert a metal baking tray over roasting pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine first four ingredients and whisk to evenly distribute and break up any lumps.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl with an electric mixer, whip together egg and sugar on medium-high speed until very light and thick, about two minutes.  .</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vinegar, and whip briefly to incorporate.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continuing to whip, add oil in a slow stream, stopping the stream every so often to allow mixture to fully emulsify before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 1/3 of the combined dry ingredients (from step 2), and mix just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of the water and mix just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of remaining dry ingredients; followed by remaining water, finishing with the rest of the dry ingredients, mixing between each ingredient addition just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in chocolate chips and turn the batter into the prepared loaf pan.  Carefully remove the inverted baking sheet “lid” from the roasting pan, avoiding steam and hot water that may have collected on the underside of the pan.  Place filled loaf pan on rack inside roasting pan, re-cover the roasting pan with baking sheet, and steam cake until a thin knife or toothpick inserted in the center comes out free of uncooked batter (it may bear traces of melted chocolate chips), 20-30 minutes.  Serve immediately or re-steam cake until heated through just before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Note: For the best finished texture, it is import to follow step 5 carefully to create an emulsion, and not to overmix the batter with the additions of dry ingredients and water, which might break the emulsion or over develop the gluten in the flour, resulting in a greasier, heavier cake.</em></p>"}]}