{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["A Platter of Figs", "Cook the Book", "David Tanis", "duck", "five-spice powder", "turnips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Five-Spice Duck Legs with Buttered Turnips and Fried Ginger", "link": "https://www.seriouseats.com/recipes/2008/09/five-spice-duck-legs-with-buttered-turnips-fried-ginger-recipe.html", "description": "Today's Cook the Book recipe, excerpted from A Platter of Figs by David Tanis, is for Five-Spice Duck Legs with Buttered Turnips and Fried Ginger. Don't be put off by the fussy, fusion-sounding name; David assures that this dish is...", "totalTime": null, "recipeYield": "12 servings", "recipeCategory": ["Chicken", "Cook the Book", "Ginger", "Other Meats"], "recipeIngredient": ["12 duck legs, preferably Pekin (Long Island)", "Salt and pepper", "2 teaspoons five-spice powder, homemade (recipe follows) or store-bought", "2 large onions, finely diced", "2 tablespoons chopped ginger", "6 garlic cloves, smashed to a paste with a little salt", "8 cups chicken stock", "2 tablespoons cornstarch", "1/4 cup cold water", " Fried Ginger (recipe follows)", "Buttered Turnips (recipe follows)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the duck legs. Season the duck generously with salt and pepper, sprinkle with the five-spice powder, and massage the seasoning into the meat. Refrigerate the seasoned duck legs overnight, or at least for several hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400ºF. Heat a dry cast-iron frying pan over medium heat, and slowly brown the duck legs (in batches, or use 2 pans), skin side down. As the duck legs cook, they will give off a fair amount of fat. When the skin is nicely browned, after 10 minutes or so, remove the duck legs and set aside. Pour off all but 1/2 inch of the fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onions to the pan and cook until golden, then add the ginger, garlic, and some salt and pepper. Cook 2 minutes more, then drain the onions in a colander, reserving the perfumed fat for another purpose (such as for frying potatoes). It will keep for 2 months in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the onions in a shallow earthenware casserole. Lay the duck legs skin side up over the onions in a single layer. Put the casserole, uncovered, in the oven and let the legs roast for 10 to 15 minutes. Meanwhile, heat the chicken stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock to the casserole and continue cooking until the stock comes to a full simmer. Then reduce the heat to 375º, cover, and cook for about an hour, until the duck legs are tender when probed with a pairing knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the baking dish and keep in the oven to let the duck legs crisp for about 5 minutes. Remove the duck legs to a deep serving platter and cover loosely to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cooking liquid into a saucepan and let stand briefly, then degrease. Taste and adjust the seasoning if necessary. Bring to a simmer. Mix the cornstarch with the cold water, add to the sauce, and simmer for 2 minutes to thicken slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sauce over the duck legs. Sprinkle with the fried ginger, and serve with the buttered turnips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Five-Spice Powder</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grind 1 tablespoon each Sichuan pepper (or black peppercorns), star anise, crushed cinnamon stick, cloves, and fennel seeds in a spice grinder. Store in a glass jar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Fried Ginger</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6 ounces ginger</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups peanut or vegetable oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the ginger and cut into thin slices. A mandoline is helpful but not necessary. Cut the ginger crosswise into slivers. They should look like flimsy matchsticks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the peanut oil to 400ºF in a small, deep pot. Carefully fry the ginger a handful at a time until the slivers are barely golden, about 2 minutes. Drain on paper towels. Sprinkle the ginger lightly with salt. Leave at room temperature until needed, up to several hours. </p>"}]}