{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080527-eggs.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["condiments", "Eating for Two", "mayonnaise", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eating for Two: Julia Child's Cooked Egg Mayonnaise", "link": "https://www.seriouseats.com/recipes/2008/05/julia-child-cooked-egg-mayonnaise-recipe.html", "description": "Photograph from PPDIGITAL on Flickr I am not accustomed to being wary of food. My working assumption is that when I eat something in a restaurant it may, by accident or design, contain gross things that I don’t want to...", "totalTime": "", "recipeYield": "2 cups", "recipeCategory": ["Condiments and Sauces"], "recipeIngredient": ["2 tablespoons flour", "1/2 cup water", "1 large egg", "2 hard-boiled egg yolks", "1 tablespoon Dijon mustard", "1/2 teaspoon salt", "2 1/2 teaspoons wine vinegar", "2 1/2 teaspoons fresh lemon juice", "1 cup excellent olive oil or other fresh vegetable oil (I use 1/2 olive and 1/2 vegetable)", "Several grinds of pepper, preferably white", "More seasonings as needed: salt, vinegar, lemon juice, etc."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the flour into a 2-quart stainless-steel saucepan and, whisking constantly, gradually blend in the water to make a lump-free mixture. Whisking slowly and reaching all over the bottom of the pan, bring to a boil on top of the stove. Boil slowly 1/2 minute, whisking—beat in droplets more water if the sauce is stiff rather than very thick. Remove from heat, break the egg into the center of the sauce, and rapidly whisk it in. Put the sauce over moderate heat again and, whisking slowly, boil for 15 seconds. Scrape the sauce into the bowl of a food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the hard-boiled yolks, mustard, salt, vinegar, and lemon juice to the machine. Process 15 seconds—long enough to be sure the yolks are well incorporated, so that they will create the emulsion. Then, with the machine running, begin adding the oil in droplets. When the emulsion is established (which should happen after about 1/3 cup oil has gone in), add the oil in a thin stream of droplets. When as much oil as you wish has gone in and the sauce is thick and glossy, taste analytically for seasoning, adding salt, pepper, etc. as you feel them needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the sauce in a covered container in the refrigerator; it will keep for at least a week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>My mayonnaise broke almost immediately, when I tried to correct the seasoning. I ate it runny and then re-emulsified it the next day: Whisk up the broken sauce. Whisk a spoonful of it into a spoonful of mustard or of crushed hard-boiled egg yolk. When the spoonful of mayonnaise and mustard or yolk are smoothly combined, start whisking in the broken sauce bit by bit. Eventually it will turn thick and glossy and beautiful as ever. But, I discovered, it will still weep some oil and get a little grainy as it rests. (Harold McGee tells us that throughout time and around the world, versions of mayonnaise have been made with béchamel sauce, hard-boiled egg yolks, cooked potato, garlic, bread, and fresh cheese, but that “None of these ingredients is as effective at emulsifying and stabilizing as a raw egg yolk, so they will emulsify less oil and the sauces will tend to leak some free oil.”) If this happens—leaky oil and slight graininess, as opposed to a completely liquefied sauce—just whisk the mayonnaise before eating, and it should firm up nicely enough.</p>"}]}