{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081213HANUKKAHCeleriacPotatoPancake.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Kosher", "keywords": ["celeriac", "hanukkah", "hanukkah latkes", "latkes", "potato pancakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Celeriac Potato Pancakes with Apple Crème Fraîche", "link": "https://www.seriouseats.com/recipes/2008/12/celeriac-potato-pancakes-with-apple-creme-fraiche-hanukkah-recipe.html", "description": "I always figured that if Hanukkah Harry really existed, he would wear a latke as his yarmulke. Latkes are potato pancakes, usually about the size of a silver-dollar flapjack at IHOP--but thicker, and made from potatoes cooked golden and crisp...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Kosher", "Potato"], "recipeIngredient": ["<strong>For the Celeriac Potato Pancakes:</strong>", "1 small onion, diced", "1 clove of garlic, minced", "1 tablespoon of olive oil, plus 2 tablespoons", "1 celery root (celeriac), trimmed and peeled, and then quartered", "4 Yukon Gold potatoes, peeled, and halved longwise", "2 tablespoons chopped fresh flat leaf parsley", "1 egg", "Salt and pepper", "<strong>For the Apple Crème Fraîche:</strong>", "1 cup crème fraîche", "1 gala apple, peeled and grated and chopped", "Juice of 1/4 lemon", "12 chives, snipped, plus more for garnish", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin the celeriac potato pancake by heating 1 tablespoon of olive oil in a large sauté pan over medium heat.  Add the diced onion, and season with salt and pepper.  After 2 minutes, add the minced garlic.  Sauté another 5 minutes until the onion is translucent and soft, but not golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, feed the celeriac and potatoes through the grating attachment of a food processor.  Transfer the grated vegetables to a kitchen towel, and ring out as much moisture as possible.  Transfer the dry grated potato and celeriac to a bowl, and season with salt, pepper, and parsley, and add the onion and garlic mixture.  Mix thoroughly to combine, and distribute the flavorings.  Add the egg, and mix again just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons of olive oil to the same pan in which you sautéed the onions and garlic.  Press half the potato celeriac mixture into the bottom of the pan, spreading it out all over the bottom.  Cook on medium heat for 15 minutes.  Then, press a plate over the top of the pancake, and flip the pan so that the pancake then sits on the plate, then slide the pancake raw-side-down into the sauté pan and cook another 15 minutes.  Repeat with the other half of the potato-celeriac mixture to make the second pancake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the apple crème fraîche, peel a gala apple, and grate with a box grater on all four sides until you hit the core of the fruit.  Discard the core, dress the grated apple immediately with the juice of ¼ lemon, and chop the apple even finer.  Combine with the crème fraîche, and season with salt, pepper, and the freshly snipped chives.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the large potato-celeriac pancakes into wedges, and serve with the apple crème fraîche alongside.</p>"}]}