{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20081106-pumpkinmarshmallows.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["fall recipes", "marshmallows", "Thanksgiving recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pumpkin-Spice Marshmallows", "link": "https://www.seriouseats.com/recipes/2008/11/pumpkin-spice-marshmallows-recipe.html", "description": "Marshmallows are one of my favorite things to make. Though I've made them literally hundreds of times, the act of transforming little more than sugar and gelatin into fluffy, springy cubes of goodness never ceases to be deeply satisfying. I...", "totalTime": "", "recipeYield": "about 80 or 90 1-inch square marshmallows", "recipeCategory": ["Desserts", "Pumpkin"], "recipeIngredient": ["1 cup pumpkin puree, fresh or canned (~240g)", "½ cup cold water (115g)", "¼ cup powdered gelatin* (40g)", "½ cup cold water (115g)", "1 ¼ cups corn syrup **(380g)", "¼ teaspoon salt", "2 cups granulated sugar", "½ teaspoon ground ginger", "1½ teaspoon ground cinnamon", "¼ teaspoon ground cloves", "2 tablespoons + 2 teaspoons cornstarch (~20g)", "1 teaspoon sweet curry powder, optional***"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly spray a standard baking sheet with non-stick cooking spray, then rub gently with a paper towel to distribute the spray and leave just the merest sheen of oil on the sheet. Similarly, lightly spray a large offset spatula and set beside the prepared tray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the first three ingredients in a medium bowl and mix until well blended and smooth.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine second quantity of water, corn syrup, salt and sugar in a 4-quart saucepan and place over medium heat.  When mixture boils, brush down the sides of the pan above the upper surface of the syrup with a clean, moistened pastry brush, or cover the pot with a lid for two minutes to allow the condensation to dissolve any lingering crystals.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a candy or instant read thermometer into the syrup and continue to cook, without stirring, until syrup reaches 255F (hard ball).  Remove pan from heat and carefully stir in pumpkin-gelatin mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour this mixture into the bowl of an electric stand mixer fitted with the whisk attachment.  Quickly cover bowl with loosely draped plastic wrap or a clean kitchen towel in order to avoid splatters, and gradually increase the mixer speed to \"high\".</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip mixture for 10 minutes.  At the beginning of the final minute of whipping, sprinkle in ginger, cinnamon and cloves and continue to whip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrap mixture into prepared pan and spread out smooth with oiled offset.  Set marshmallow aside, uncovered, at room temperature for at least 4 hours to over night before cutting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before cutting the marshmallow, sift the three remaining ingredients together into a medium mixing bowl.  Cut marshmallows with a lightly oiled knife or pizza cutter and break into individual pieces.  Toss with cornstarch mixture to completely coat, shaking off excess as much as possible. Store in an airtight container with the lid slightly ajar for up to three days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* This is little more than 1 ¼ standard boxes of Knox gelatin, so be sure to purchase enough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** The author provides a recipe for a homemade sugar syrup to replace the corn syrup, but the corn syrup recipe version has been provided for brevity's sake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>***The curry powder is my addition.  I like the way it adds another layer of flavor and a subtle savory note to the finished confections.</p>"}]}