{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080928bnsquash.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["butternut squash", "fall recipes", "Meat Lite", "sausage", "squash", "thanksgiving", "Thanksgiving recipes", "Thanksgiving sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Butternut Squash and Sausage Bake", "link": "https://www.seriouseats.com/recipes/2008/09/meat-lite-butternut-squash-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by the book the two coauthored, Almost Meatless, due out in spring 2009....", "totalTime": null, "recipeYield": "serves 6 to 8", "recipeCategory": ["Mains", "Meat Lite", "Pork", "Squash"], "recipeIngredient": ["1/4 pound Italian sausage", "1/4 cup olive oil, divided ", "3 onions, quartered and sliced ", "5 thyme sprigs", "2 teaspoons dried sage", "salt and pepper", "1 small butternut squash, peeled and chopped into 1/2 cubes, (about 6 cups) seeds and scrapings reserved", "1/4 cup flour", "1/2 cup shredded smoked mozzarella", "3/4 cup chicken stock ", "3 slices white sandwich bread, cut into cubes", "2 tablespoons melted butter, optional, plus a little extra to prepare baking dish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees Fahrenheit. Butter a 9-by-12 inch baking dish.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove sausage from its casing and cook in a large skillet over medium heat until just browning, breaking up sausage with a wooden spoon as it cooks. Remove cooked sausage and refrigerate until ready to use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough olive oil to the rendered fat in the skillet to equal two tablespoons, and then add the onions, thyme and sage. Season liberally with salt and pepper. Cook over medium heat for 20 minutes, stirring occasionally, scraping the bottom of the skillet to loosen brown bits. When onions are thoroughly soft, remove and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the onions cook, simmer the squash seeds and scrapings in the chicken stock for 10 minutes, strain and keep the stock warm over low heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining two tablespoons of olive oil to the skillet. Toss the squash with the flour and arrange in a single layer in the skillet. (If the skillet isn't big enough, you'll need to do this in two batches.) Let the squash brown, undisturbed, for 4 minutes then stir the squash as it cooks for the next 4 minutes. Season liberally with salt and pepper and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the casserole, layer the onions in the buttered baking dish. Dot the onions with the sausage bits evenly, and then top with the squash. Sprinkle the smoked mozzarella over the top, and the pour the stock into the baking dish. Press the top of the casserole with a spatula to evenly distribute the liquid. Cover tightly with aluminum foil and bake for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the casserole bakes, pulse the bread crumbs with the melted butter (if using) in a food processor until you have coarse bread crumbs.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 30 minutes, pull the baking dish out of the oven, remove the foil, top casserole evenly with breadcrumbs and bake uncovered an additional 20 to 30 minutes, until the liquid is absorbed and the top is nicely browned.</p>"}]}