{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081117-cover-food-and-wine.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["butternut", "fall recipes", "food and wine", "squashes", "thanksgiving", "Thanksgiving sides"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "'Food &amp; Wine' Magazine's Buttery Squash Turnovers", "link": "https://www.seriouseats.com/recipes/2008/11/food-and-wine-magazine-buttery-squash-turnovers-recipe.html", "description": "When we talked to Food &amp; Wine Magazine editor in chief Dana Cowin about the November 2008 issue of the magazine, we asked her what her favorite Thanksgiving recipes from the issue were. This is one of them. More of...", "totalTime": "", "recipeYield": "12", "recipeCategory": [], "recipeIngredient": ["1/4 cup extra-virgin olive oil", "3 large leeks, white parts only, cut into 1-inch dice (2 cups)", "1/2 pound shiitake mushrooms, stems discarded and caps sliced 1/4 inch thick", "2 garlic cloves, chopped", "2 tablespoons thyme leaves", "salt and freshly ground pepper", "one 2-pound butternut squash--peeled, seeded and cut into 1/2-inch dice", "14 ounces all-butter puff pastry, thawed if frozen", "3/4 pound fresh goat cheese (1 1/2 cups)", "1 large egg, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°. In a large skillet, heat 2 tablespoons of the olive oil. Add the diced leeks and cook over moderate heat, stirring occasionally, until softened, about 5 minutes. Add the shiitake and cook, stirring often, until their liquid has evaporated, about 5 minutes. Stir in the garlic and the thyme and cook for 2 minutes. Season with salt and pepper and transfer to a medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large rimmed baking sheet with parchment paper and lightly oil the parchment. In a large bowl, toss the squash with the remaining 2 tablespoons of olive oil and season with salt and pepper. Spread the squash on the prepared baking sheet and bake for about 25 minutes, until softened and starting to brown. Add the squash to the leeks and mushrooms and toss.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large rimmed baking sheet with parchment paper. On a lightly floured work surface, gently roll out the puff pastry to a 12-by-16-inch rectangle about 1/4 inch thick. Cut the pastry into twelve 4-inch squares. Spoon 2 tablespoons of the shiitake-squash mixture onto each square and top with 2 tablespoons of the goat cheese. Lightly brush the edge of the squares with some of the beaten egg. Fold the squares over to form triangles and crimp the edges decoratively with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the turnovers on the prepared baking sheet about 1/2 inch apart. Brush the tops of the turnovers with the remaining beaten egg. Bake for about 25 minutes, until the pastry is golden brown. Serve warm or at room temperature.</p>"}]}