{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080403-doriegreenspan-lemontart.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "", "keywords": ["Baking with Dorie", "desserts", "lemon", "tarts", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baking with Dorie: Lemon-Lemon Lemon Cream", "link": "https://www.seriouseats.com/recipes/2008/04/lemon-lemon-lemon-cream-recipe.html", "description": "While I have been known to exaggerate now and then, I've never gone overboard in my praise for this lemon cream (think curd); I just call it extraordinary and rest assured that I haven't gone overboard. The recipe comes from...", "totalTime": "", "recipeYield": "8 servings", "recipeCategory": ["Baking With Dorie", "Desserts", "Lemon", "Vegetarian"], "recipeIngredient": ["1 cup sugar", "Finely grated zest of 3 lemons", "4 large eggs", "3/4 cup freshly squeezed lemon juice (from 4 to 5 lemons)", "2 sticks plus 5 tablespoons (21 tablespoons; 10 1/2 ounces) unsalted butter, at room temperature and cut into tablespoon-sized pieces", "1 fully-baked 9-inch tart shell"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong>  Have a thermometer, preferably an instant-read, a strainer and a blender (first choice) or food processor at the ready.  Bring a few inches of water to a simmer in a saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the sugar and zest in a large metal bowl that can be fitted into the pan of simmering water.  Off heat, work the sugar and zest together between your fingers until the sugar is moist, grainy and very aromatic.  Whisk in the eggs followed by the lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit the bowl into the pan (make certain the water doesn’t touch the bottom of the bowl) and cook, stirring with the whisk as soon as the mixture feels tepid to the touch.  You want to cook the cream until it reaches 180&deg;F.  As you whisk the cream over heat&mdash;and you must whisk constantly to keep the eggs from scrambling&mdash;you’ll see that the cream will start out light and foamy, then the bubbles will get bigger, and then, as the cream is getting closer to 180&deg;F, it will start to thicken and the whisk will leave tracks.  Heads up at this point&mdash;the tracks mean the cream is almost ready.  Don’t stop whisking and don’t stop checking the temperature.  And have patience&mdash;depending on how much heat you’re giving the cream, getting to temp can take as long as 10 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As soon as you reach 180&deg;F, pull the cream from the heat and strain it into the container of a blender (or food processor); discard the zest.  Let the cream rest at room temperature, stirring occasionally, until it cools to 140&deg;F, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the blender to high and, with the machine going, add about 5 pieces of butter at a time.  Scrape down the sides of the container as needed while you’re incorporating the butter.  Once the butter is in, keep the machine going&mdash;to get the perfect light, airy texture of lemon-cream dreams, you must continue to beat the cream for another 3 minutes.  If your machine protests and gets a bit too hot, work in 1-minute intervals, giving the machine a little rest between beats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cream into a container, press a piece of plastic wrap against the surface to create an airtight seal and chill the cream for at least 4 hours or overnight.  When you are ready to construct the tart, just whisk the cream to loosen it and spoon it into the tart shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> The tart should be served cold, because it is a particular pleasure to have the cold cream melt in your mouth.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> While you can make the lemon cream ahead (it will keep in the frige for 4 days and in the freezer for up to 2 months), once the tart is constructed, it’s best to eat it the day it is made.</p>"}]}