{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080416-pastaz.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["healthy and delicious", "mushrooms", "pasta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Tube-Shaped Pasta with Wild Mushrooms", "link": "https://www.seriouseats.com/recipes/2008/04/dinner-tonight-tubeshaped-pasta-with-wild-mus.html", "description": "I recently stumbled upon Saveur’s 10 favorite pastas and figured I had it made. I love pasta. Saveur loves pasta. We’d meet somewhere and have one hell of a dinner. And this is the one I fell for. I was...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Healthy and Delicious", "Mains", "Mushrooms", "Pasta", "Vegetarian"], "recipeIngredient": ["4 tablespoons olive oil ", "1 clove garlic, minced", "1/2 medium onion, finely chopped ", "1 pound of assorted mushrooms (chanterelles, porcini, etc.), cut into large pieces", "2 tablespoons fino sherry", "1 tablespoon parsley, chopped", "1/2 pound tube-shaped pasta (such as rigatoncini or penne)", "1 1/2 ounces Parmigiano-reggiano, freshly grated  ", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil.  Toss in about 3 tablespoons of salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour 1 tablespoon of the oil into a large skillet over medium heat.  Add the garlic and onions.  Cook for 5 minutes, stirring occasionally, or until the onions are translucent.  Remove the vegetables from the skillet and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour another tablespoon of olive oil to the now empty skillet, turn the heat to high, and then add the mushrooms.  Season with salt.  Cook for 10 to 12 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sherry in to deglaze the skillet.   Scrap the bottom with a wooden spoon, dislodging any browned bits.  Cook for 2 minutes.  Toss in the parsley, reduce the heat to medium-low. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the mushrooms are cooking, start the pasta.  Cook according to package instructions, subtracting about a minute off the finished time.  When ready, scoop out about a quarter cup of the pasta water and set aside.  Drain the pasta and then immediately toss with the mushroom sauce.  Add the water if it needs to be more substantial.  Sprinkle with Parmesan.</p>"}]}