{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/bug-sack-lunch-100x166.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["beef", "hangar steak", "sack lunch", "wraps"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sack Lunch: Chili-Rubbed Hanger Steak Wrap", "link": "https://www.seriouseats.com/recipes/2008/01/sack-lunch-chilirubbed-hanger-steak-wrap.html", "description": "I don’t work in an office anymore, but when I did, I almost always took my lunch. This was partly a function of the alarming rate at which my overly enthusiastic cooking generates leftovers and partly because a sack lunch...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["<h5>For the steak:</h5>", "2 teaspoons chili powder", "1 teaspoon ground coriander", "1 teaspoon brown sugar", "1/2 teaspoon dried oregano", "Salt and pepper", "1 1/4 to 1 1/2 pound beef hanger steak, sliced into 4 pieces", "1 1/2 teaspoons olive oil ", "<h5>For the romaine, dressing, and wrapping:</h5>", "1/4 cup reduced-fat sour cream [I used full-fat plain yogurt and liked it]", "2 tablespoons mayonnaise", "2 tablespoons fresh lemon juice", "1 teaspoon chili powder", "Salt and pepper", "1 head romaine lettuce", "1/4 cup chopped scallions", "2-4 whole wheat tortillas or other “wraps,” depending on how many lunches you want to get out of this", "1 1/2 pounds jicama (about 1 medium jicama), peeled and julienned", "1/2 small red onion, halved and thinly sliced", "1/4 cup coarsely chopped fresh cilantro", "2-3 tablespoons fresh lime juice (from 1-2 limes)", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position an oven rack 4 inches from the broiler and turn it on. Line a rimmed baking sheet or broiler pan with aluminum foil. Combine the chili powder, coriander, sugar, and oregano with 1 1/2 teaspoons salt and 1/4 teaspoon pepper. Lay the steaks on the baking sheet and rub all over with oil. Then pat on the spice mixture, again coating the steaks as evenly as you can.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the broiler is good and hot, broil the steaks without turning, 5-8 minutes for a medium-rare finish (total time will depend on the meat’s thickness; my hanger steak was about an inch thick, and I cooked it for 10 minutes, turning once in the middle when I got nervous). Remove the cooked steaks to a platter to rest for 10 minutes, loosely tented with aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the yogurt, mayonnaise, lemon juice, and chili powder with some salt and pepper. Separate the romaine into leaves (or chop into ribbons, if you prefer), wash, and dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For dinner: drizzle a handful of romaine leaves with creamy chili dressing and sprinkle with chopped scallions. Carve the steaks across the grain into 1/4-1/2 inch slices, as you like, and serve beside the salad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For lunch: Carve the meat into 1/4-1/2 inch slices. Spread a tortilla thinly with dressing, top with a romaine leaf or two, and fill with sliced steak. Four ounces of meat should be enough, and you might even prefer less. Drizzle the steak with a little more dressing, sprinkle with chopped scallions, and roll up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Jicama Slaw</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- serves 4 -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Adapted from</em> <a href=\"http://www.amazon.com/Everyday-Food-Great-Fast/dp/0307354164/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1200866000&sr=1-1\">Everyday Food: Great Food Fast</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss all ingredients together. Serve immediately or refrigerate, according to the book, for up to 6 hours. I could happily eat this slaw even after it has spent a day or two in the refrigerator, although it will, of course, be less crisp, and the cilantro will start to look a little sad. If this concerns you, you could combine everything but the lime juice in a Tupperware, bring half a lime to work, and toss with fresh lime juice right before you eat.</p>"}]}