{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-greenenchiladas.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["Dinner Tonight", "enchiladas", "Mexican", "Rick Bayless", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Dinner Tonight: Enchiladas Especiales Tacuba Style", "link": "https://www.seriouseats.com/recipes/2009/10/enchiladas-especiales-tacuba-rick-bayless-recipe.html", "description": "The enchilada sauce is basically a béchamel with a lot more kick. [Photograph: Nick Kindelsperger] I knew from the moment I put these in the oven that they'd come out perfectly. I mean, was there any choice? Every single recipe...", "totalTime": "", "recipeYield": "3 to 4", "recipeCategory": ["Chicken", "Dinner Tonight", "Mexican"], "recipeIngredient": ["2 poblano chiles", "1 cup spinach leaves, chopped", "2 cups milk", "2 cups chicken broth", "6 tablespoons butter", "3 garlic cloves, chopped", "1/2 cup flour", "3 cups cooked and shredded chicken", "12 corn tortillas", "1 cup shredded Chihuahua or Oaxaca cheese", "Salt", "Cilantro", "Vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blacken the poblano on all sides over a burner or underneath the broiler. Place in a plastic bag and let steam for about 15 minutes. Remove the blacked skin, wash away any seeds, and then coarsely chop. Toss in a blender with the spinach.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk and chicken broth into a saucepan set over medium-low heat. In a large pot melt the butter over medium heat. Toss in the garlic, and cook for about 30 seconds. Then dump in the flour. Stir for about a minute. Then raise the heat to medium high. Pour in the milk and chicken broth. Keep stirring. When mixture reaches a boil, reduce heat to medium and simmer for 5 minutes. Turn off the heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer about half of the sauce to the blender and puree with the poblano and spinach. Be careful when blending hot liquids. Remove the center part of the lid if possible. When well blended, pour the contents into the large pot with the rest of the sauce. Season with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat an oven to 350°F. Ladle about 1/4 a cup of the sauce into a baking dish, about 9-inch square. Mix the shredded chicken with a cup of the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the tortillas with some vegetable oil on both sides. Place on a baking sheet (this may require two), and set in the oven. Cook for about 3 minutes. Then remove the tortillas. Fill each one up with a bit of the chicken and sauce mixture, and then roll up and place in the baking dish with the sauce, fold side down. Pour the remaining sauce over the rolled up tortillas. Sprinkle with the shredded cheese. Place in the oven and cook for about 20 minutes, or until the cheese is beginning to brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately with a sprinkling of cilantro.  </p>"}]}