{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/090823Fresh_Pasta_With_Chard.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "", "keywords": ["breadcrumbs", "chard", "cheese", "farmers' markets", "goat cheese", "green beans", "pasta", "tagliatelle", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Meatless: Fresh Tagliatelle with Green Beans, Rainbow Chard, and Aged Goat Cheese", "link": "https://www.seriouseats.com/recipes/2009/08/fresh-tagliatelle-pasta-green-beans-rainbow-chard-aged-goat-cheese-vegetarian-recipe.html", "description": "Note: Serious Eater Michael Natkin of the vegetarian blog Herbivoracious drops by every Wednesday to share a delicious recipe to expand our vegetarian repertoire. It seems like everyone wants to eat locally these days. One of my favorite ways to...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cheese", "Legumes", "Pasta", "Seriously Meatless", "Vegetarian"], "recipeIngredient": ["<small>For the breadcrumbs:</small>", "4 slices rustic bread, either stale or lightly toasted and cooled (optionally with crusts removed)", "2 tablespoons extra virgin olive oil", "2 cloves garlic, minced", "Sea salt", "<small>For the pasta:</small>", "1 pound fresh tagliatelle", "2 bunches rainbow chard (see below for preparation)", "2 tablespoons extra virgin olive oil", "1/4 teaspoon red chili flakes", "1/2 sweet white onion, thinly sliced", "1 clove garlic, thinly sliced", "1/2 lb. green beans, trimmed and left whole", "Juice of one lemon", "Salt", "12 very thin slices aged semi-soft goat cheese", "Tiny leaves of basil (or if only large leaves, thinly sliced)", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grind the bread in a food processor until fairly uniform, but not all the way to a sandy consistency. In a skillet, heat the olive oil over  a medium flame. Add the garlic and saute for 20 seconds. Add the breadcrumbs and cook for about 5 minutes, stirring frequently, until toasty and fragrant. Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the chard thoroughly in 3 changes of water. Strip the leaves from the stems and roughly chop the leaves. Trim off the thickest part of the stems and finely dice the rest--they are delicious when thoroughly cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your largest skillet over a high flame. Add the olive oil, chili flakes, garlic, and onion and about 1/4 teaspoon of salt and saute for about 2 minutes. Add the chard stems and 1/4 cup of water, cover, and reduce heat to medium. Cook about 5 minutes. Add the chard leaves, a little more water and salt, re-cover and cook 5 more minutes. At this point, the stems should be tender and the leaves well wilted. If not, cook a bit longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the green beans and lemon juice to the saute, and at the same time, drop the pasta in the boiling water, leaving the heat all the way up. The pasta should take about 3 minutes. Test a piece then and if it is al dente, reserve 1/2 cup of the cooking water and drain. Do not overcook the pasta--it should be resilient, not spongy!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the noodles into the saute pan and give everything a good toss. If it seems a bit dry, add a little of the reserved pasta water. Taste and add salt as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, divide the pasta among 4 heated bowls. Top with the breadcrumbs, cheese, basil leaves and a grind of black pepper.</p>"}]}