{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091228-dt-beef-stroganoff.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beef stroganoff", "Dinner Tonight", "noodles", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Beef Stroganoff", "link": "https://www.seriouseats.com/recipes/2009/12/quick-beef-stroganoff-recipe.html", "description": "[Photograph: Blake Royer] Sometimes a craving for some classic dish from childhood will hit me like a ton of bricks. Swedish meatballs, tuna and pea casserole, fettucine alfredo&mdash;none of them have any mercy on me. So when I recently began...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Dinner Tonight", "Mains", "Pasta"], "recipeIngredient": ["<ul class=\"skinnyList\"><li>6 tablespoons butter", "</li><li>1 pound tender beef, such as top sirloin or tenderloin, cut thin into 1/2-inch wide strips", "</li><li>1/3 cup chopped shallots (or substitute onion and a clove of garlic)", "</li><li>1/2 pound cremini mushrooms, sliced", "</li><li>Salt to taste", "</li><li>Pepper to taste", "</li><li>1/8 teaspoon nutmeg", "</li><li>1/2 teaspoon dry tarragon or 2 teaspoons of chopped fresh tarragon", "</li><li>1 tablespoon brandy or cognac (optional)", "</li><li>1 cup sour cream, at room temperature", "</li><li>3/4 pound egg noodles</li></ul>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet with plenty of room for the beef strips to brown without crowding (work in batches if necessary), heat half the butter over medium-high heat.  When the foam subsides and the butter is very hot, add the beef strips in a single layer.  The pan should be hot enough to brown the beef quickly, but not hot enough to burn the butter.  Turn once to brown the other side, then season well with salt and pepper.  Remove the beef strips to a bowl, leaving the fat and juices in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium and add the shallots.  Cooking until soft, for a couple minutes, as they soak up the juices.  Scrape them into the bowl with the beef.  In the meantime, bring a pot of salty water to boil and prepare to cook the egg noodles until tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining butter to the pan and increase the heat to medium-high.  When the butter foam subsides, add the mushrooms, tarragon, nutmeg, and a pinch of salt and pepper.  Cook until the mushrooms are soft and golden.  Begin cooking the noodles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a few tablespoon of water and the brandy or coganc (if using) to deglaze the pan (gently scape up any browned bits).  Lower the heat and add the sour cream, making sure it does not boil or it will separate.  Stir in the beef and shallots, and add water if necessary to thin the sauce to a good consistency.  Season to taste with salt and pepper and serve over the noodles.</p>"}]}