{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "cherries", "Cindy Mushet", "Cookies", "holiday baking", "oatmeal", "The Art and Soul of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cherry Oatmeal Cookies", "link": "https://www.seriouseats.com/recipes/2009/12/cherry-oatmeal-cookies-recipe.html", "description": "These oatmeal cookies were rich and buttery&mdash;\"healthy\" is probably the last word that I would ever use to describe them, and for cookies that's a big plus.", "totalTime": "", "recipeYield": "about 50 cookies", "recipeCategory": ["Cherry", "Cook the Book"], "recipeIngredient": ["1 stick (4 ounces) unsalted butter, softened (65° to 68°F)", "1/2 cup (4 ounces) firmly packed light brown sugar", "1/4 cup plus 1 tablespoon (2 ounces) granulated sugar", "1 large egg", "1 teaspoon pure vanilla extract", "1 cup (5 ounces) unbleached all-purpose flour", "1/4 teaspoon baking soda", "1/4 teaspoon baking powder", "1/4 teaspoon salt", "3/4 cup (3 1/4 ounces) old-fashioned rolled oats", "3/4 cup (3 1/2 ounces) dried sour cherries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and position an oven rack in the center of the oven. Line the baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the butter, brown sugar, and granulated sugar in the bowl of the stand mixer and beat on medium speed until smooth and blended, about 2 minutes. You can also use a hand mixer and a medium bowl, although you may need to beat the mixture a little longer to achieve the same results. Scrape down the bowl with the spatula. Add the egg and vanilla and blend well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the flour, baking soda, baking powder, and salt. Add to the butter mixture all at once. Turn the mixer to the lowest speed and blend slowly, just until there are no more patches of flour. Scrape down the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the oats and cherries and blend on low just until combined. Remove the bowl from the mixer and stir gently a few times with the spatula to make sure there are no more patches of unincorporated flour or butter lurking near the bottom of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the small ice cream scoop or a spoon, portion tablespoon-size mounds onto the prepared baking sheets, spacing them about 2 inches apart. Bake the cookies one sheet at a time, rotating the sheet halfway through, for 13 to 16 minutes, until the cookies are golden brown at the edges and still a bit pale in the center. Transfer to a cooling rack and let the cookies cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Storing tips:</strong>  Keep the cooled cookies in an airtight container at room temperature for 3 to 4 days.</small></p>"}]}