{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["choucroute", "Cook the Book", "Donald Link", "Real Cajun", "sauerkraut", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Choucroute", "link": "https://www.seriouseats.com/recipes/2009/04/choucroute-recipe.html", "description": "This Cajun take on the classic Alsatian choucroute from Donald Link's Real Cajun might have a fancy French name and a lot of ingredients, but it's really nothing more than a variation on the classic combination of hot dogs and...", "totalTime": null, "recipeYield": "8 to 10", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["4 duck confit legs, at room temperature", "4 tablespoons duck fat", "5 ounces slab bacon, cut into 1/3-inch slices, then into 1-inch pieces", "1 large onion, diced", "2 teaspoons salt", "1 teaspoon crushed juniper berries", "1/2 teaspoon grated nutmeg", "8 bay leaves", "3/4 cup Creole (or whole-grain) mustard", "1 bottle Riesling (or Gewurtztaminer) or other medium-dry white wine", "2 1/2 pounds sauerkraut", "2 Granny Smith apples, peeled, cored, and sliced into 2-inch chunks", "2 large Yukon Gold potatoes (about 1 pound) peeled and cut into 2-inch chunks", "3 pounds sausage (any combination of fresh, smoked, andouille, etc.), sliced into 1-inch rounds or left whole", "8 ounces tasso or other smoked ham, cut into 1-inch cubes", "1 quart chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bones from the duck legs by gently twisting the bone until you can pull it out without breaking up the meat; set aside at room temperature.  Preheat oven to 300&deg F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the duck fat in a large Dutch oven over medium-high heat.  When the fat is very hot, sear the duck legs over medium-high heat for 3 to 4 minutes on the skin side only.  Using a slotted spatula, transfer the duck to a plate and set aside.  Add the bacon to the same pan, reduce the heat, and render until it is not quite crisp or colored.  Add the onion, salt, juniper berries, nutmeg, bay leaves and</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>mustard and stir to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the Riesling into the onion mixture, bring to a boil, reduce the heat, and simmer until the liquid reduces by half, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the Sauerkraut, apples, potatoes, sausage, tasso and chicken broth.  Return the mixture to a simmer, then place the duck legs on top and gently press them into the choucroute so that the skin side is just above the surface.  Cover and bake for 2 to 3 hours, until the meat and potatoes are tender and the flavors have melded.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note: </strong>The cooked duck skin will dry sitting at room temperature, which will make it easier to crisp and render in the pan.</small></p>"}]}