{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090319-breakfasttoast-thumb.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["Italian", "Seriously Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Cinnamon Breakfast Toasts", "link": "https://www.seriouseats.com/recipes/2009/03/seriously-italian-cinnamon-breakfast-toasts-recipe.html", "description": "Editor's note: On Thursdays, Babbo pastry chef Gina DePalma checks in with Seriously Italian. After a stint in Rome, she's back in the States, channeling her inner Italian spirit via recipes and intel on delicious Italian eats. Take it away,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Italian"], "recipeIngredient": ["3 large eggs, at room temperature", "1/2 cup granulated sugar", "1/2 cup light olive oil or vegetable oil", "1 teaspoon pure vanilla extract", "2 1/4 cups unbleached, all-purpose flour, plus additional for rolling the dough", "1/4 cup fine cornmeal or instant polenta", "1/2 teaspoon salt", "3 teaspoons baking powder", "4 teaspoons ground cinnamon", "<strong>Optional toppings</strong> ", "1 tablespoon milk", "1 tablespoon raw or demerara sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the eggs, sugar and oil in the bowl of an electric mixer.  Using the whisk attachment, beat them together on medium speed for one minute, until light and foamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the egg mixture is beating, whisk together 2 cups of the flour with the cornmeal, salt, baking powder and cinnamon until thoroughly blended.  Add the dry ingredients to the bowl and beat them together until a thick dough is formed.  Remove the bowl from the mixer, and discard the whisk.  Use a spatula to fold the remaining 1/4 cup of flour into the dough.  Let the dough sit for five minutes so the flour can absorb the moisture from the eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the dough is sitting, lightly grease a cookie sheet with non-stick vegetable spray, line it with parchment paper, and lightly grease the parchment. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and fingers, and divide the dough in half.  Roll each half into a log, about 1 1/2 inches wide and place the logs on the prepared cookie sheet, evenly spaced. The dough will be tacky, but easy manage; you can continue to shape the logs them after placing them on the cookie sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a pastry brush to brush away any excess flour.  If you want add a bit more sweetness to the toasts, brush them with the milk and sprinkle the raw or demerara sugar on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the logs for 20 to 25 minutes, or until they are puffy, golden brown and firm to touch.  Remove the cookie sheet from the oven and turn the temperature down to 300 degrees. Let the logs cool for 15 minutes on the tray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a serrated knife to slice the logs on the bias about ½ of an inch thick and lay them flat on the cookie sheet.  Return the slices to the oven and bake for an additional 15 to 20 minutes, or until the slices are browned and toasted.  Allow the toasts to cool completely and store them in an air-tight container.</p>"}]}