{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Asian", "keywords": ["Cook the Book", "JoAnn Cianciulli", "L.A.'s Original Farmer's Market Cookbook", "noodles", "singaporean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Mee Goreng", "link": "https://www.seriouseats.com/recipes/2009/06/cook-the-book-mee-goreng-recipe.html", "description": "Although they are worlds apart, the hawker centres of Singapore, Malaysia, and Hong Kong have a lot in common with Farmers Market in L.A. They are both vast complexes of stalls selling inexpensive prepared food to people on the go....", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Asian", "Cook the Book", "Noodles"], "recipeIngredient": ["2 small russet potatoes", "Kosher salt", "3/4 pound thin yellow egg noodles", "6 tablespoons vegetable oil", "1 large onion, chopped", "4 garlic cloves, minced", "1 tablespoon peeled and minced fresh ginger", "2 large eggs, beaten", "1/2 teaspoon turmeric", "1/2 teaspoon sweet paprika", "Freshly ground white pepper", "1/4 cup dark soy sauce", "1 cup fresh bean sprouts", "4 green onions, white and green parts, sliced, plus more more garnish", "4 fried eggs (optional)", "Crispy fried shallots for garnish (see Note)", "1 lime cut into wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes in a large pot and cover with cold water.  Add 1/2 teaspoon of salt and bring to a boil, uncovered.  Simmer until there is no resistance when a fork is inserted into the potatoes, about 20 minutes.  Drain the potatoes in a colander.  When they are still hot, carefully peel off the skins with a paring knife; use a kitchen towel to hold them.  Cut into 1/2-inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot of boiling salted water, cook the noodles until just tender but still firm to the bite (al dente), about 7 minutes.  Take care not to overcook.  Rinse under running cool water and drain well.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a wok or a large skillet over medium heat and coat with oil.  When the oil gets hazy, add the onion, garlic, and ginger.  Cook and stir until the vegetables are tender but not browned, about 5 minutes.  Add the potatoes and continue to cook and stir for 2 minutes to combine and heat through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push the vegetables to the sides of the pan and pour the eggs into the center.  Scramble the eggs lightly until set, breaking them up into pieces with a spatula.  Incorporate the vegetables into the eggs; season with the turmeric, paprika, and salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the drained noodles to the wok, stirring and tossing quickly to separate the strands.  Pour in the soy sauce, tossing well to coat the noodles and keep them from sticking (drizzle with 1 to 2 tablespoons of water, if necessary).  Add the bean sprouts and green onions; cook and stir until softened slightly, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the noodles among 4 plates, top with a fried egg, if using, and garnish with sliced green onion and fried shallots.  Serve with the lime wedges.</p>"}]}