{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "green beans", "holiday recipes", "Matt and Ted Lee", "orange", "recipe newsletter", "Simple Fresh Southern", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Skillet Green Beans with Orange", "link": "https://www.seriouseats.com/recipes/2009/11/skillet-green-beans-with-orange-recipe.html", "description": "The following recipe is from the November 18 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Green beans always find their way to the holiday table. Unfortunately, sometimes they can be more...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Legumes", "Orange", "Sides", "Vegetarian"], "recipeIngredient": ["1 large navel orange", "2 teaspoons canola oil", "1 pound green beans, ends trimmed", "3/4 teaspoon kosher salt, plus more to taste", "1 tablespoon white wine vinegar, champagne vinegar, or rice vinegar", "2 tablespoons extra-virgin olive oil", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely grate the zest of the orange, and reserve it. Segment the orange, and keep the segments and juice in a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large cast iron skillet or saute pan, heat the canola oil over high heat, swirling it around the pan so it coats the bottom thinly and evenly. When the oil begins to smoke, add the beans (in batches if necessary&mdash;don't crowd the pan) and scatter 1/2 teaspoon of the salt over them. Cook, stirring only every 1 1/2 to 2 minutes, until the beans are half blistered and blackened, about 8 minutes. Transfer the beans to a serving platter or bowl. Lift the orange segments out of their juice (reserve the juice), and scatter them over the beans. Sprinkle 1/4 teaspoon of the orange zest over the beans and oranges.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the vinegar, olive oil, and remaining 1/4 teaspoon salt to the bowl of orange juice, and whisk until thoroughly combined. Pour the dressing over the beans. Toss, and season to taste with salt, black pepper, and the remaining orange zest.</p>"}]}