{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-bibimbop.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Korean", "keywords": ["beef", "Bibimbap", "Korean", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Bibimbap", "link": "https://www.seriouseats.com/recipes/2009/03/dinner-tonight-korean-bibimbap-recipe.html", "description": "I'm not sure whether I love the flavors of bibimbap or just twirling around the ingredients in the big bowl. It's such a thrill, and the results are always delicious. But I figured it was something to be indulged in...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Dinner Tonight", "Korean", "Rice"], "recipeIngredient": ["2 tablespoons soy sauce", "3 tablespoons sesame oil", "2 teaspoons sugar", "1 clove garlic, minced", "1/2 teaspoon ginger, grated", "1/2 pound thinly sliced rib-eye", "1 cup short grain rice", "2 eggs", "1/2 zucchini, thinly sliced", "1 cup mushrooms, thinly sliced", "Handful bean sprouts", "1/2 cup carrots, julienned", "1/4 cup red pepper paste", "2 tablespoons rice wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the soy sauce, 1 tablespoon of the sesame oil, sugar, garlic, and ginger in a large bowl.  Add the beef and stir until coated.  Set aside for 30 minutes.  Also, cook the short grain rice according to the instructions on the package.  It should take about 20 minutes or so. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour 1/2 tablespoon of the sesame oil into a large skillet over medium heat.  Toss in the mushrooms and cook until they are tender and soft.  Set aside.  Then another 1/2 tablespoon of the sesame oil to the skillet and add the sliced zucchini.  Cook it until it is tender, about 5 minutes or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a few cups of water to a boil in a medium sauce pan.  Add the bean sprouts and cook for about a minute.  Then drain in a colander. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a large skillet over high heat.  When very hot add the beef.  Cook, stirring often until browned on all sides.  Then set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rest of the sesame oil into a non-stick skillet over medium heat.  Crack the two eggs in and cook until the whites have set, but the yolk is still very runny. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Time to construct.  First, lay out the beef, mushrooms, zucchini, bean sprouts, and raw carrots. Add a handful of rice to a large bowl, then add a little bit of each of the ingredients around the edges of the bowl.  Top with a fried egg.  Repeat with the another bowl.  Serve with the red pepper paste and rice wine vinegar to taste.  When ready, break the yolk and twirl around the contents until well mixed.</p>"}]}