{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091221-sicilianpizza.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Italian", "keywords": ["anchovies", "Cook the Book", "dough", "Italian", "La Cucina", "pizza", "pizza dough", "The Italian Academy of Cuisine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sicilian Pizza", "link": "https://www.seriouseats.com/recipes/2009/12/sicilian-pizza-recipe-la-cucina.html", "description": "When discussing pizza most people automatically assume that Sicilian-style means a square pie with thick, chewy dough. The traditional pizzas of Sicily are square, but this is where the similarities with their U.S. counterparts end. Sicilian pizza, or sfincione, is...", "totalTime": null, "recipeYield": "1 pizza", "recipeCategory": ["Cook the Book", "Italian", "Pizza"], "recipeIngredient": ["<strong>For the dough:</strong>", "3 cups all-purpose flour, plus more as needed", "2 1/4 teaspoons active dry yeast dissolved in 2 tablespoons of water", "<strong>For the seasoning (the <em>conza</em>):</strong>", "3 medium onions, sliced", "2 tablespoons olive oil, plus more for the pan", "6 plum tomatoes, peeled", "2 garlic cloves", "6 anchovies, boned and chopped, or as desired", "1/2 pound cheese (caciocavallo or, in its absence, pecorino Romano) thinly sliced", "1 tablespoon chopped oregano", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form a well with the flour, add the yeast and it's water, a dash of salt, and enough additional water to make a soft dough (3/4 to 1 cup).  Knead until the dough becomes solid and homogeneous, then form into a ball, cover, and let rise for several hours.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the <em>conza</em>: Heat 2 tablespoons of the olive oil over low heat and add the onions.  Cover the pan to create steam and keep the onions from darkening.  Add the tomatoes and whole garlic cloves.  Continue cooking until the sauce is fragrant and dense.  Remove and discard the garlic cloves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F.  Grease a baking sheet with olive oil.  Make a layer of dough about 2 inches high on the pan.  Push into the dough as many pieces of anchovy as desired; also push in some of thin slices of cheese.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with the <em>conza</em> and sprinkle with cheese and oregano.  Generously drizzle with more olive oil and bake for approximately 15 minutes, until the cheese has melted and the dough is crisp on the bottom.</p>"}]}