{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090319-lavendercupcakes.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["cakes", "cupcakes", "desserts", "flowers", "French", "French in a Flash", "lavender"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Crème Fraîche Cupcakes with Provence Lavender Icing", "link": "https://www.seriouseats.com/recipes/2009/03/french-in-a-flash-creme-fraiche-cupcakes-with-provence-lavender-icing-recipe.html", "description": "These cupcakes are made with boxed cake mix enhanced with crème fraîche and glazed with lavender blossom-flavored icing.", "totalTime": "", "recipeYield": "about 20 cupcakes", "recipeCategory": ["Desserts", "French"], "recipeIngredient": ["1 box classic white cake mix (recommended: Duncan Hines)", "2 egg whites", "1/4 cup vegetable oil", "8 ounces crème fraîche", "3 cups powdered sugar", "1 tablespoon dried edible lavender blossoms", "5 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.  Line two muffin tins with cupcake papers that you think complements the color of lavender.  I used pastel pink and blue.  Prim and lovely.  Purple, if you find it, would of course be ideal.  Treat your cupcakes as if they were Parisians: they should dress to their advantage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the cake mix, egg whites, vegetable oil, and crème fraîche with a hand-held mixer on a low speed, until the cake mix just disappears into the batter.  Then, turn up the speed to medium, and combine for 3 more minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the cupcake liners, 3/4 of the way up.  Set the muffin tins on a baking sheet, and bake for 20 minutes, until the cupcakes are golden and puffed up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the lavender glaze.  Stir together the sugar, lavender, and water until you have a smooth icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cupcakes have baked, let them cool slightly in the muffin tins, then transfer them to a cooling rack to cool completely.  If you ice them while they are still hot, the icing will melt, run off the cupcakes, and the only thing that will taste of sweet lavender is you counter top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cupcakes are completely cool, and not a moment before, drizzle them with the lavender icing.  Allow the glazed cupcakes to sit and set for 15 minutes, then serve, preferably with some Marquis Grey Tea. (Just put some lavender into a tea ball, and then drop it along with some Earl Grey tea bags into a tea pot full of hot water.  You can also do this alongside Chamomile Tea&mdash;even more calming for an upset stomach.)</p>"}]}