{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091019cakespyfrida.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["art", "breads", "fall recipes", "pan de muerto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Frida Kahlo's Pan de Muerto", "link": "https://www.seriouseats.com/recipes/2009/10/cakespy-frida-kahlos-pan-de-muerto-recipe.html", "description": "Note: Jessie Oleson (aka Cakespy) drops by every Monday to share a delicious dessert recipe. [Photographs and original art: Jessie Oleson] Have you ever looked at a Frida Kahlo's enigmatic self-portraits and wondered what secrets might lurk behind her signature...", "totalTime": "", "recipeYield": "about 30 mini loaves", "recipeCategory": ["Bread", "Cakespy", "Halloween"], "recipeIngredient": ["7 cups all-purpose flour, sifted, plus extra for flouring your work surface", "1 3/4 cups granulated sugar", "1 1/4 cups unsalted butter, at room temperature", "2 packages active dry yeast, dissolved in 5 tablespoons warm milk", "12 eggs", "1 teaspoon salt", "2 teaspoons cinnamon", "2 teaspoons vanilla extract", "1/2 cup confectioners' sugar", "1/3 cup orange juice", "2 tablespoons grated orange or lemon zest", "Gel icing and sprinkles, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put sifted flour and granulated sugar in a large bowl; mix lightly to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut in the butter using your hands until it is well incorporated (you may have little pebble-sized nuggets which form; this is OK.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form a little well in the center of the mixture and pour in the yeast and milk mixture, cinnamon, salt, and vanilla. Add the eggs 2 or 3 at a time, mixing by hand or with an electric mixer after each addition. Once all of the ingredients have been added, work the dough with your hands until it pulls away from the sides of the bowl. If it is too sticky, add a little bit more flour until the dough is easily handled. Shape the dough into a ball, and lightly grease the surface; place it back in the bowl and cover with plastic wrap. Allow it to sit at room temperature for about 2 hours, or until it has doubled in size. Once the dough has doubled in size, put it in the refrigerator for at least 2 hours (or even overnight).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20091019frida1.jpg\" src=\"https://www.seriouseats.com/recipes/images/20091019frida1.jpg\" width=\"500\" height=\"322\" class=\"mt-image-none\" style=\"\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into balls roughly the size of peaches, but make sure to leave a sizeable chunk of dough to the side so that you can form various embellishments and decorations to put on each mini loaf. Traditionally, you would shape and decorate the dough in a way that reminds you of deceased ancestors, but if you want to honor Frida for the fantastic recipe, go ahead and roll the ball of dough into an oval, adding two \"wings\" of dough on top to form her traditional hairstyle, two dots for eyes, a thin rope for her mouth, and--<em>most importantly</em>--a thick rope in the shape of a \"v\" for her prominent brow.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place your masterpieces on greased or parchment-lined baking sheets and let them sit for about an hour--they will probably rise a bit more. Bake at 350 for about 30 minutes, or until golden on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While your loaves are cooling, make the glaze (it's optional) by bringing orange juice, orange or lemon zest and sugar to a boil for about 2 to 3 minutes or until it has started to thicken and reduce a bit. Apply directly to the still-warm bread using a pastry brush.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, add additional Frida-inspired flair by using sprinkles and gel icing to accentuate her signature features on the mini loaves once they have cooled.</p>"}]}