{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090109mediterranean_diet_cookbook.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fattoush", "healthy and delicious", "Lebanese", "Nancy Harmon Jenkins", "pita", "salads", "sumac"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fattoush, Lebanese Pita Bread Salad", "link": "https://www.seriouseats.com/recipes/2009/01/nancy-harmon-jenkins-fattoush-pita-bread-salad-recipe.html", "description": "If you made panzanella with pita instead of Italian bread, you'd have fattoush. Once just a thrifty way of making use of stale pita bread, Lebanese fattoush has grown into a desirable dish in its own right. The secret, notes...", "totalTime": "", "recipeYield": "6 servings", "recipeCategory": ["Healthy and Delicious"], "recipeIngredient": ["2 small Arab flatbreads (pita)", "1 small head of romaine lettuce", "8 radishes, sliced or cut in half", "8 scallions, both white and green parts, sliced", "1 or 2 cucumbers, preferably pale-skinned Middle Eastern or Armenian cucumbers, peeled and sliced", "1 or 2 plain brine-pickled cucumbers, not sweetened or heavily flavored with garlic or dill, sliced", "3 medium tomatoes, cut into thick chunks", "1/3 cup finely chopped flat-leaf parsley", "1/3 cup finely chopped fresh mint or 2 teaspoons dried, crumbled", "1 or 2 garlic cloves, to taste", "1 teaspoon sea salt", "1/4 cup fresh lemon juice", "1/4 cup extra-virgin olive oil", "Freshly ground black pepper", "2 tablespoons coarsely ground sumac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split each of the breads in half horizontally so that you have 4 thin rounds of bread. Toast the breads lightly under the broiler, just enough to turn them pale golden and crisp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break up the crisp toast into small pieces and put in the bottom of a large salad bowl. Pile the salad vegetables on top, in the order listed, sprinkling the parsley and mint over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush the garlic with the flat blade of a knife and chop it coarsely. In a separate small bowl, mash the garlic with the salt, using the back of a spoon. Stir in the lemon juice and oil, beating with a fork to mix well, and pour the dressing over the salad. Grind the black pepper over the top and sprinkle the sumac on last. Take the salad bowl to the table and toss the ingredients together just before serving to keep the bread from getting soggy before it is served.</p>"}]}