{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091201-dt-broccoli-salad.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["broccoli", "chives", "salads", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Broccoli Salad with Bacon, Chives, and Tomato", "link": "https://www.seriouseats.com/recipes/2009/12/broccoli-salad-with-bacon-chives-tomato-recipe.html", "description": "[Photograph: Blake Royer] After that weekend, we're probably all ready for a break. I could avoid turkey for months without a problem (my last four posts have all involved the bird in one form or another, and I think I...", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Bacon", "Broccoli", "Dinner Tonight", "Salads", "Tomato"], "recipeIngredient": ["2 heads of broccoli, about 1 1/2 pounds", "4 slices thick-cut bacon, cut into matchsticks", "2 roma tomatoes, halved, seeded and finely chopped", "1 bunch fresh chives (15 to 20), finely chopped", "1 clove garlic, peeled and minced or pressed", "2 teaspoons Dijon mustard", "6 tablespoons extra virgin olive oil", "2 tablespoons white wine vinegar", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salty water to boil.  In the meantime, trim the woody end from the broccoli heads and break it up into small florets. Slice them into 1/4-inch thick pieces so they cook quickly and evenly.  When the water comes to a boil, blanch the broccoli for 1-2 minutes, until they are starting to get tender but still have bite in the middle.  Drain in a colander and spread out on a kitchen towel to steam dry, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, cook the bacon in a large skillet with a splash of olive oil over medium-low heat until the fat renders into the pan and the bacon is crisp but still slightly chewy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the fat collected in the bacon pan into a bowl and add the garlic, dijon, and vinegar.  Whisk well to combine into an emulsion, then add the olive oil slowly in a stream, whisking constantly.  Season to taste with salt and pepper and taste also for acidity, adding more vinegar or oil if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the broccoli with the tomatos, bacon, and dressing.  Top with chives and serve.</p>"}]}