{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Bouchon Bakery", "Cookies", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bouchon Bakery's Langues de Chat", "link": "https://www.seriouseats.com/recipes/2009/01/bouchon-bakerys-langues-de-chat-recipe.html", "description": "Read more about Bouchon Bakery's Langues de Chat on Serious Eats: New York as part of our series of recipes from famous restaurants in New York City....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["4 tablespoons of unsalted butter", "", "Pinch of kosher salt", "1/2 teaspoon pure vanilla extract", "2 large egg whites", "1/2 cup all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the whisk attachment, cream the butter, sugar, and salt.  Add the vanilla and one egg white and mix to combine.  Add the remaining egg white and mix until just incorporated.  Fold in half the flour, then fold in the remaining flour until smooth and completely combined.  Refrigerate the batter for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put racks in the upper and lower thirds of the oven and preheat the oven to 350&deg;F.  Line two baking sheets with Silpats or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chilled batter in a pastry bag fitted with a 1/4-inch plain tip.  Pipe the batter into thin strips about 2 1/2 to 3 inches long on the baking sheets, leaving room between them because they will puff in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for about 3 minutes, then switch the position of the sheets and bake for 3 to 5 minutes longer, or until the cookies are golden brown.  Remove them from the oven and cool on racks.  Store in an airtight container for up to 2 days. </p>"}]}