{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091130quinoapilaf.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["kale", "Meat Lite", "pilafs", "quinoa", "sweet potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Meat Lite: Quinoa Pilaf with Sweet Potatoes, Kale, and Bacon", "link": "https://www.seriouseats.com/recipes/2009/12/quinoa-pilaf-with-sweet-potatoes-kale-and-bac.html", "description": "[Photograph: Joy Manning] After a very meaty and indulgent Thanksgiving, I ended the weekend feeling the need for some healthier fare. I now have a week full of meatless and almost-meatless meals planned, and this easy pilaf kicked things off...", "totalTime": "", "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Kale", "Meat Lite", "Pork", "Quinoa", "Sweet Potatoes and Yams"], "recipeIngredient": ["2 to 4 slices of bacon, diced", "1/4 large onion, cut in half and sliced thin", "1 cup quinoa", "1 1/2 cup water", "1 teaspoon salt, divided", "1 medium sweet potato (about 10 ounces), cut into 1/4-inch cubes", "1 small bunch kale (about 8 ounces), chopped coarsely", "2 tablespoons olive oil", "4 scallions, green parts only, sliced thin, for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 475°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan with a tight fitting lid, cook the bacon over medium heat until the bacon is crisp and the fat is rendered, about 10 minutes. Reserve the bacon bits.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the onions into the hot bacon fat and sauté, stirring occasionally, until the onions soften, about 5 minutes. Add the quinoa and toss until coated with the fat and the grains are slightly toasted, about 2 minutes more. Add the water and 1/2 teaspoon of the salt, bring to a boil, stir once, cover, reduce to low and let cook undisturbed until the water is absorbed and the quinoa is tender, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the quinoa is cooking, toss the sweet potatoes and kale with the olive oil and salt and spread in a single layer on a baking sheet. Bake until the potatoes and kale begin to brown in places and the potatoes are tender, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the quinoa is cooked, stir in the potatoes, kale, and bacon. Top with fresh scallion slices and reserved bacon bits.  </p>"}]}