{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/091106Brussel_Sprouts_Pumpkin_Seeds.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "holiday recipes", "pepitas", "Seriously Meatless", "vegetables", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan Roasted Brussels Sprouts with Candied Pepitas and Cider Vinegar", "link": "https://www.seriouseats.com/recipes/2009/11/pan-roasted-brussels-sprouts-with-candied-pepitas-cider-vinegar-recipe.html", "description": "Note: Michael Natkin of the vegetarian blog Herbivoracious drops by every Wednesday to share a delicious recipe to expand our vegetarian repertoire. [Photograph: Michael Natkin] Every family has a collection of Thanksgiving side dishes that absolutely have to be there...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Pumpkin", "Seriously Meatless", "Sides", "Vegetarian"], "recipeIngredient": ["1/2 cup hulled green pumpkin seeds (pepitas)", "2 tablespoons sugar", "5 tablespoons unsalted butter, divided", "1/2 medium white onion, finely diced", "1.5 pounds Brussels sprouts, trimmed and quartered", "2.5 tablespoons good tasting apple cider vinegar", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet over medium low heat, toast the pumpkin seeds until lightly brown and aromatic. Add the sugar and a big pinch of salt and stir until the sugar melts and caramelizes. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet over medium-high. Melt two tablespoons of the butter. Add the onion and saute for 2 minutes. Add the brussel sprouts and two big pinches of salt. Toss in the butter, and then spread out into an even layer. Turn them occasionally, but allow them to caramelize on the bottom. Keep cooking until they are quite tender when piereced with a fork. Taste and adjust salt. Remove with a slotted spoon to your serving bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to low and add the apple cider vinegar. Use a spatula to scrape all of the delicious crusty bits into the vinegar. Break the remaining three tablespoons of butter up and whisk them into the vinegar. Add a pinch of salt. Add the sprouts back in and toss them in the sauce. Return to the serving bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, break up the pumpkin seeds (they will have stuck together from the sugar) and stir 2/3 of them into the sprouts. Garnish with the remaining 1/3.</p>"}]}