{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090428-mark-miller-tacos.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fall recipes", "Mark Miller", "Mexican", "spicy", "taco", "tacos", "Tacos by Mark Miller", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Roasted Tomatoes and Pumpkin Seed Pesto", "link": "https://www.seriouseats.com/recipes/2009/04/roasted-tomatoes-and-pumpkin-seed-pesto-tacos-recipe.html", "description": "These roasted tomato and pumpkin seed pesto tacos from Mark Miller's Tacos are not exactly standard Mexican fare. They are a combination of Italian, Spanish and Mexican ingredients that happen to work perfectly together. Italian Roma tomatoes, olive oil and...", "totalTime": "", "recipeYield": "8 tacos", "recipeCategory": ["Cook the Book", "Pumpkin"], "recipeIngredient": ["1 pound small Roma tomatoes, cored", "2 teaspoons kosher salt", "1/2 teaspoon sugar", "6 poblano chiles, oil roasted, peeled, cored, and seeded", "3/4 cup pumpkin seeds, lightly toasted", "3/4 teaspoon green chile powder", "2 teaspoons lemon-infused olive oil", "1 tablespoon fresh lime juice", "1 cup loosely packed, coarsely chopped fresh cilantro leaves", "8 (5 1/2-inch) soft yellow corn tortillas", "Garnish: chopped fresh basil or mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 200&deg;F. Line a baking sheet with parchment paper. Halve the tomatoes across their midsections and gently squeeze the halves to release seeds and excess juice (the tomatoes will cook faster). Slice the tomatoes thinly. In a bowl, toss the slices with 1/2 teaspoon of the salt and the sugar. Spread the slices in a single layer (so the tomatoes are evenly exposed to the heat) on the prepared baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast for at least 2 hours, or until the tomatoes are about three-fourths dehydrated and the flesh is the consistency of a roasted bell pepper. The slices will shrink by about half during roasting; no need to turn them. Remove from the oven and set aside until at cool room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the prepared poblano chiles into 1/4-inch-thick strips (rajas); set aside. Meanwhile, to prepare the pesto, in the work bowl of a food processor fitted with the metal blade, combine the pumpkin seeds, chile powder, olive oil, lime juice, cilantro, and remaining 1 1/2 teaspoons salt. Process until the consistency is a little rougher than peanut butter, or as you prefer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, lay the tortillas side by side, open face and overlapping on a platter. Divide the pesto equally between the tortillas and top with roasted tomato slices, chile strips, salsa, and basil. Grab, fold, and eat right away. Or build your own taco: lay a tortilla, open face, in one hand. Spoon on some pesto, top with tomato slices, chile strips, salsa, and basil, and eat right away.</p>"}]}