{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090124BouillabaisseBroth.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["bouillabaisse", "Chilean sea bass", "fish", "French", "French in a Flash", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Chilean Sea Bass with Bouillabaisse Broth", "link": "https://www.seriouseats.com/recipes/2009/02/french-in-a-flash-chilean-sea-bass-with-bouillabaisse-broth-recipe.html", "description": "<strong>Bouillabaisse</strong> is a fish stew from the port city of Marseille (where my mother was born), flavored and stained with saffron.  It is hearty but light, exotic but comforting, all at once.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Fish", "French"], "recipeIngredient": ["1 tablespoon of olive oil, plus more for sautéing the fish", "1 small onion, thinly sliced", "1/2 fennel bulb, thinly sliced, with fronds reserved for garnish", "Salt and pepper", "1 clove garlic, sliced", "1 can (14.5 ounces) petite diced tomatoes, drained", "1/2 cup white wine", "2 1/2 cups fish stock", "1 teaspoon saffron", "1 bay leaf", "1 dozen rock shrimps, peeled and deveined", "1 dozen mussels", "4 fillets (4- to 6-ounce) Chilean sea bass", "<strong>For the Rouille with Baguette Toasts</strong>", "1/2 day-old baguette, sliced 1/4-inch thick", "1 cup mayonnaise", "2 cloves garlic", "Zest and juice of 1/2 lemon", "5 filets roasted red pepper from a jar", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of olive oil over medium-low heat in a heavy-bottomed, wide pot with sides high enough to contain 3 cups of liquid&mdash;I use my risotto pan.  When the oil is warm, add the sliced onion and fennel to the pot, and season with salt and pepper.  Allow the vegetables to sweat for 2 minutes, and then add in the sliced garlic.  Cook the vegetables for another 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, add in the can of drained petite diced tomatoes and the white wine.  Raise the heat to high, and allow the wine to reduce slightly for about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the fish stock to the pot, and add in the saffron and the bay leaf.  When the stock comes to a boil, reduce the heat to low, and allow the stock to simmer uncovered for 10 minutes.  It is this part of the process from which \"bouillabaisse\" gets its name: the first part of the word means \"to boil,\" and the second, \"to lower.\"  The saffron will bloom in the simmering liquid, and will steep like tea in the stock, causing it to turn its trademark marigold color.  Season again lightly with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 10 minutes have passed, add in the rock shrimp and the mussels, and stir them around in the bouillabaisse broth.  They should take no more than 3 minutes to cook; the shrimp will turn from grey to coral in color, and the mussels will open.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the stock is simmering, cook the sea bass.  Begin by seasoning the sea bass well with salt and pepper on both sides.  Then cover the bottom of a large nonstick sauté pan with olive oil&mdash;a typical pan will require about 2 tablespoons.  Heat the oil on medium-high heat, and when the oil starts to shimmer, add the four filets of fish.  Cook for about 3-4 minutes per side, until golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Rouille with Baguette Toasts:</strong> To toast the baguette, arrange the slices in a single layer on a baking sheet, and run into a 350-degree oven until dry and golden, about 10 minutes, but keep an eye on them!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the rouille, combine the mayonnaise, garlic, lemon juice and zest, and roasted red pepper in a mini food processor, and season with salt and pepper.  Blend until puréed and combined.  Rouille, which translates to \"rust,\" because of the color it traditionally takes on from saffron and peppers, can be served alongside the bouillabaisse with these little baguette toasts&mdash;perfect for dipping and shoveling in the broth.</p>"}]}