{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090714pastarawsauce.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["Italian", "Meat Lite", "pasta", "penne", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Penne with Bacon and Raw Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2009/07/penne-with-bacon-raw-tomato-sauce-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. When tomatoes start appearing at my farmers' market,...", "totalTime": "", "recipeYield": "serves 2", "recipeCategory": ["Bacon", "Meat Lite"], "recipeIngredient": ["1 garlic clove, minced", "1/4 teaspoon salt", "1/8 teaspoon red pepper flakes", "1 large heirloom tomato, peeled and diced (about 1 cup)", "10 basil leaves, torn", "2 tablespoons extra virgin olive oil", "1 teaspoon red wine vinegar", "10 grinds black pepper", "8 ounces penne", "2 ounces bacon (about 2 slices), diced", "1/4 cup minced shallot", "Parmesan cheese, grated, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a mortar and pestle or the back of a knife, grind the garlic, salt and red pepper flakes to a paste. Combine the paste, the tomato with its juices, the basil leaves, the olive oil, the vinegar and the salt in a mix bowling and cover. Set aside for three hours or up to overnight.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a large pot of water on to boil, and while you wait, fry the bacon over medium heat until the fat is rendered and the pieces are crisp. Remove and reserve the bacon pieces and drain all but 1 tablespoon of fat from the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shallots to the bacon fat and fry until the shallots have softened. By now, the water will have come to a boil and you will be cooking the pasta and shallots at the same time. Drain the pasta when it's al dente, reserving 1/4 cup of the starchy cooking liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta and the reserved water to the frying pan and stir, removing any cooked on bits from the bottom. Add the reserved bacon and raw tomato sauce, stirring to combine. Cook just until the sauce is warm. Serve with grated Parmesan cheese.  </p>"}]}