{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091214-nastybits-tomatillos.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["green chile", "New Mexico", "pork neck", "posole", "tomatillos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Pork Neck Posole", "link": "https://www.seriouseats.com/recipes/2009/12/nasty-bits-new-mexican-pork-neck-posole-offal-recipe.html", "description": "[Photographs: Chichi Wang] White flint corn. Home for me is Northern New Mexico. This time of year the canyons are blanketed in snow, the streams frozen solid in quiet ravines. New Mexicans, an ornery but kindhearted bunch, keep warm by...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Pork", "The Nasty Bits"], "recipeIngredient": ["1 pound dried white flint corn", "2 1/2 to 3 pounds pork neck bones, chopped into 2 to 3 inch sections", "3 cups hulled, untoasted pumpkin seeds", "1 1/2 pounds fresh tomatillos", "1/2 cup chopped green chile, or 8 jalapeño peppers, stemmed and seeded", "1 medium onion, roughly chopped", "2 bay leaves", "1 teaspoon Mexican oregano", "4 tablespoons lard", "Salt to taste, about 1 tablespoon", "<strong>For the condiments:</strong>", "Diced onion", "Dried oregano", "Slices of avocado", "Chopped cilantro", "Tortillas "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the dried white corn overnight in a bowl of water. The following day, bring a large pot of water to boil. Cook the corn at a steady boil for 3 or 4 hours, until the corn kernels have \"bloomed,\" and are fully tender. Drain and set aside.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the pork neck bones in cold water. Place the neck bones in a large dutch oven or stockpot with 6 quarts of water. Bring the water to a boil, skimming the impurities that rise to the top. Add the salt, bay leaves and oregano. Reduce the heat to medium-low and simmer the pork bones for 1 1/2 hours, until very tender.       </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, wash and prep the tomatillos: Remove the husks from the fruits and rinse under cold water. Bring another pot of water to boil. Add a tablespoon or so of salt. Add the tomatillos and simmer for 8 minutes. Drain the tomatillos and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast iron skillet over high heat, until the surface is hot but not smoking. Add all of the pumpkin seeds at once, stirring frequently until the seeds pop and turn golden brown. Remove the seeds from the pan and set aside.         </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor or powerful blender, pur&eacute;e the tomatillos along with the pumpkin seeds and the chopped onion, and the green chile, adding 1/2 cup of water as a lubricant. Sieve the pur&eacute;e through a fine mesh strainer and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a pan with a few tablespoons of lard, until the surface is sizzling hot; add the pumpkin seed puree and stir around constantly. The pur&eacute;e will darken and thicken in the process. Remove from the heat and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pork has been simmering for 1 1/2 hours, add the cooked pumpkin seed pur&eacute;e and the cooked corn kernels. Cook for one hour longer, until the meat is fork-tender. Serve piping-hot with fresh tortillas, accompanied by condiments if desired. Leftover posole may be refrigerated for several days. </p>"}]}