{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "greek", "How to Roast a Lamb", "Michael Psilakis", "pork", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pork Soffrito with Spicy Peppers and Cabbage", "link": "https://www.seriouseats.com/recipes/2009/11/pork-soffrito-with-spicy-peppers-cabbage-recipe.html", "description": "\"The final dish is a happy meeting of opposites: hot and cold, sweet and sour, cooked and raw.\" This Pork Soffrito with Spicy Peppers and Cabbage is a one-plate meal that combines ingredients I never would have thought to add...", "totalTime": "", "recipeYield": "2", "recipeCategory": [], "recipeIngredient": ["1/2 pound pork tenderloin, cut into 1-inch rounds", "1/4 cup cracked, brined <em>tsakistes</em> green olives, pitted and pulled into pieces", "1/4 head savoy cabbage, sliced paper-thin", "1/2 fennel bulb, sliced paper-thin", "1/4 of a red onion, sliced paper-thin", "1 orange, peeled with a knife and separated into pith-free segments", "1 tablespoon roughly chopped parsley ", "Vinaigrette of your choice, or extra-virgin olive oil and fresh lemon juice", "Sea salt, kosher salt, and cracked black pepper", "All-purpose flour", "2 tablespoons extra-virgin olive oil", "1 shallot, finely chopped", "1 tablespoon capers", "1 pepperoncini (pickled yellow pepper), sliced", "1/2 cup white wine", "1 tablespoon fresh lemon juice", "1 1/2 tablespoons cold, unsalted butter", "Caperberries, for garnish (optional)", "1 tablespoon chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pound each slice of pork between two sheets of plastic wrap to an even thickness of less than 1/4 inch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine the next seven ingredients (olives through 1 tablespoon of dill), for the salad.  Toss about 1/4 cup of vinaigrette, or 3 tablespoons of extra-virgin olive oil, and 1 1/2 tablespoons fresh lemon juice.  Season with salt and pepper and toss well with clean hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season both sides of the tenderloin generously with kosher salt and pepper and dust lightly with flour.  Place your largest skillet over medium-high heat and add the 2 tablespoons olive oil.  When it is hot, add the pork to the pan and saute it for just under 1 minute on each side, until pale golden.  Transfer to a platter and reserve.  Reduce the heat and add the shallot, capers, and pepperoncini and cook until slightly softened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Deglaze the pan with the white wine; reduce to a simmer and add the 1 tablespoon lemon juice.  Reduce the liquid by two thirds.  Add the butter and swirl to melt into the juice.  Add the remaining dill and season with sea salt and pepper.  Return the pork to the pan and remove from the heat.  Swirl the pan to coat the pork with the sauce.  Transfer to a platter with all of the juices and goodies from the pan, and pile the tossed salad on top.</p>"}]}