{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090720SmokedSaltCaramels.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["candy", "caramels", "smoked salt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoked Salt Caramels", "link": "https://www.seriouseats.com/recipes/2009/07/smoked-salt-caramels-candy-recipe.html", "description": "In France, caramels are often flavored with fleur de sel, flakes of sea salt, that balance and emphasize the sugary sweetness of the caramel. Even macarons made with caramel are finished with fleur de sel. So I thought, why not...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Candy"], "recipeIngredient": ["1/2 cup sugar", "1/4 cup light corn syrup", "1 1/2 cups heavy cream", "5 tablespoons unsalted butter", "1 teaspoon smoked salt, plus extra for sprinkling", "1 leftover vanilla pod"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange parchment paper in the bottom of an 8 by 8 baking dish.  Grease with flavorless oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, deep pot, heat the sugar, corn syrup, and 1/2 cup water over medium heat.  Meanwhile, in saucepot, heat the cream, butter, vanilla pod, and 1 teaspoon of smoked salt until it just simmers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Swirl the sugar mixture until it turns the color of caramel.  Careful, one minute it’s so clear you think you can walk away, the next, it’s burnt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stand back and add the warm cream mixture.  It will bubble up violently.  Stir with a wooden spoon until the mixture reads 248 degrees F on a candy thermometer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into the prepared baking dish, and refrigerate until firm.  Roll one side tightly until you come to the middle.  Separate that roll from the rest of the caramel.  Then roll the remainder.  You’ll have 2 logs.  Cut each log into 8 equal pieces, and top lightly with more smoked salt.</p>"}]}