{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Mexican", "keywords": ["Mark Miller", "Mexican", "mole", "recipe newsletter", "taco", "tacos", "Tacos by Mark Miller", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Turkey with Mole", "link": "https://www.seriouseats.com/recipes/2009/04/turkey-with-mole-tacos-recipe.html", "description": "The following recipe is from the April 29 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! I think that turkey gets a bad wrap. Relegated to Thanksgiving, Christmas and a few dull...", "totalTime": null, "recipeYield": "8 tacos", "recipeCategory": ["Chicken", "Mexican", "Turkey"], "recipeIngredient": ["1 1/4 pounds boneless, skinless turkey breast, cut into 1/3-inch by 2 1/2-inch strips ", "1 (8 1 /4-ounce) jar mole sauce, such as Dona Maria ", "5 tablespoons vegetable oil ", "6 cloves garlic, roasted ", "1 teaspoon kosher salt 3 cups chicken stock ", "2 cups water ", "8 ounces tomatoes, blackened and cut into 1/4-inch dice (see Note)", "1 tablespoon plus 1 teaspoon balsamic vinegar ", "1 teaspoon chipotle purée ", "1/3 cup dark raisins (do not use golden raisins) ", "2 ounces Mexican chocolate (such as Ibarra) ", "1 1/2 ounces bittersweet chocolate (at least 70 percent cacao) ", "8 (5 1/2-inch) soft yellow corn tortillas, for serving ", "Garnish: toasted sesame seeds "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the turkey strips and half of the mole sauce. Cover and marinate overnight in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, drain the turkey strips, reserving the mole marinade. In a large, heavy skillet, heat 2 tablespoons of the oil over medium heat and lightly sear the turkey strips on both sides; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refry the sauce: In a large, heavy nonstick skillet, heat 1 tablespoon of the oil over high heat until almost smoking. Add the sauce, remove from the heat, and stir to blend. Stir in the Mexican and bittersweet chocolates, and add the sauteed turkey, the reserved mole sauce, and the remaining half jar of mole sauce. Decrease the heat to medium-low and gently simmer, covered, for about 1 1/2 hours, turning the turkey strips every 20 minutes or so. The turkey should be cooked through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the turkey from the sauce and set aside. Refry the sauce: In a large, heavy nonstick skillet, heat the remaining 1 tablespoon of oil over high heat until almost smoking.  Add the sauce, remove from the heat, and stir to blend.  Remove from the heat and pass through a medium-mesh sieve.  When the turkey is cool, shred it with your hands and mix with the  sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately or keep warm in the pan until ready to serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, lay the tortillas side by side, open face and overlapping on a platter. Divide the filling equally between the tortillas and top with crema (or sour cream) and sesame seeds. Grab, fold, and eat right away. Or build your own taco: lay a tortilla, open face, in one hand. Spoon some filling, top with sesame seeds and crema, fold and eat right away.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>Remove the stem of the tomato, but otherwise keep the tomato whole.  Blacken the tomatoes in a single layer in a dry cast-iron or wide, heavy-bottomed skillet over medium-high heat or on a baking sheet under a broiler until charred and blistered on all sides, about 20 minutes in a skillet or 5 minutes under a broiler.</p>"}]}