{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090917-italian-dough.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["breads", "Italian", "nuts", "Seriously Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Walnut Bread from Umbria", "link": "https://www.seriouseats.com/recipes/2009/09/seriously-italian-walnut-bread-from-umbria-pan-nociato-recipe.html", "description": "Previously Lavender Honey Spice Cake » All Seriously Italian recipes » Few things fill me with more satisfaction than baking a loaf or two of my own bread. Mind you, I'm not an expert, but I've got a stable...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Italian"], "recipeIngredient": ["1 package of active dry yeast", "1 1/4 cups warm water", "3 1/2 to 4 cups unbleached, all-purpose flour, plus additional for the bench", "a heaping 1/2 cup golden raisins", "3/4 cup red wine", "1 large egg", "2 tablespoons extra-virgin olive oil", "1 teaspoon kosher salt", "2 tablespoons granulated sugar", "1 cup walnut pieces, toasted, cooled and coarsely chopped", "1/3 cup pine nuts, coarsely chopped", "1 teaspoon finely chopped fresh rosemary", "1 egg for wash "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, dissolve the yeast in 3/4 cup of warm water; add a pinch of sugar to the bowl and let it bubble up for a few minutes.  Whisk in 1/2 cup of the flour. Cover the sponge with plastic wrap and let it proof for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the raisins and red wine in a small saucepan over medium heat just until the wine begins to simmer. Turn off the heat and let the raisins plump in the wine as the entire mixture cools to room temperature.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sponge has proofed, scrape it into the bowl of an electric mixer fitted with a paddle attachment. Add the remaining 1/2 cup of water to the bowl along with the raisins and wine, the egg, and the extra-virgin olive oil and mix briefly on low speed to combine the ingredients and break up the egg. Add the flour, salt, and sugar to the bowl and mix on medium speed to form a soft dough.  Add the cheese, nuts, and rosemary to the bowl and beat again for about a minute, then switch to the dough hook. Knead the bread on medium speed for about 3 to 4 minutes, adding more flour if necessary, until the dough has formed a ball and is glossy and elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the mixer bowl and place it on a floured board. Dust it lightly with flour and continue to knead by hand for 2 to 3 minutes until the dough is springy, elastic, and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough in a large bowl or container greased with extra-virgin olive oil. Cover with plastic or a fitted lid and place the dough in the refrigerator to rise overnight, 10 to 12 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The following day, the dough should be tripled in bulk.  Remove it from the refrigerator and allow it to come to room temperature, about 3 to 4 hours.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently deflate the dough and divide it into three equal pieces.  Form each piece into a tight ball, and place on a baking sheet that has been sprinkled with a bit of cornmeal. Cover the dough balls with plastic and allow them to rise for 30 to 40 minutes, or until almost doubled in bulk. Gently score the tops with an \"X.\" Beat the egg lightly with a tablespoon of water and brush the breads with the egg wash. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the breads for about 10 minutes, then lower the heat of the oven to 325&deg;F and continue to bake until they are evenly deep, golden brown, and sound hollow when thumped with your finger, about 20 to 30 more minutes.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The breads are best enjoyed after they have cooled completely, and will keep wrapped for 3 or more days. </p>"}]}