{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091019Kalepasta.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["kale", "Meat Lite", "pancetta", "pasta", "spaghetti", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Meat Lite: Spaghetti with Tomato-Braised Kale", "link": "https://www.seriouseats.com/recipes/2009/10/meat-lite-spaghetti-with-tomato-braised-kale-recipe.html", "description": "Editor's note: Philly food writers Joy Manning and Tara Mataraza Desmond drop by weekly with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. [Photograph: Dan Call] Everyone loves a plate of pasta,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["2 ounces thick sliced pancetta, diced", "1 medium onion, diced (about 1 cup)", "5 sundried tomatoes, minced", "1 medium bunch kale (about 8 ounces) stems removed and sliced thin, and leaves sliced crosswise into thin ribbons, parts separated ", "1/2 teaspoon hot pepper flakes", "1/2 teaspoon salt", "3 garlic gloves, minced", "1/2 cup white wine", "8 ounces dried spaghetti ", "1 1/2 ounces Parmesan or Romano cheese, grated, plus more for serving. "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan over medium heat, cook the pancetta until the fat is rendered and the pork is crisp. Add the onions, kale stems, sundried tomatoes, red pepper flakes, and salt to the fat. Cook, stirring often, until the onions and kale begin to soften, about 12 minutes. Add the garlic and kale leaves, and cook, stirring constantly, until the leaves start to wilt and the garlic becomes fragrant, about 90 seconds. Add the white wine and stir, scraping browned bits from the bottom of the pan. Add the tomato puree, bring to a boil then turn heat to low. Simmer, covered, for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add spaghetti and boil for about half the recommended cooking time. Using tongs, move the pasta into the kale and tomato sauce, along with about 1 cup of pasta cooking liquid. Add the cheese and stir to combine. Cover, and simmer until the pasta is finished cooking, about 10 minutes. Top with additional cheese, if desired.</p>"}]}