{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091117-fallpickles-ctb.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beets", "canning", "Cook the Book", "grapes", "Matt and Ted Lee", "pickles", "preserving", "Simple Fresh Southern", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pickled Grapes with Rosemary; Gingered Pickled Beets", "link": "https://www.seriouseats.com/recipes/2009/11/fall-pickles-pickled-grapes-rosemary-chiles-gingered-pickled-beets-recipes.html", "description": "[Photograph: Caroline Russock] Summer might be the height of pickling and preserving season, but a recent trip to the market left me with plenty of fruits and vegetables that were just waiting to be put up. The inspiration for...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Grapes", "Pickling"], "recipeIngredient": ["6 cups stemmed mixed red and green seedless grapes (about 2 pounds)", "2 cups distilled white vinegar or white wine vinegar", "2 tablespoons kosher salt", "2 teaspoons sugar", "3 cloves garlic, crushed and peeled", "Leaves from 1 four-inch long sprig rosemary", "1/2 teaspoon crushed dried red chile flakes ", "One 2-inch piece fresh ginger, peeled and sliced into about 8 thin disks (1/4 cup)", "1 cup distilled white vinegar", "2 teaspoons kosher salt", "1 teaspoon sugar", "1 1/4 pound red beets, peeled and very thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pack the grapes into 3 pint-size glass containers with lids. Pour the vinegar and 1 cup water into a saucepan, set it over medium-high heat, and add the salt, sugar, garlic, rosemary, and chile flakes. When the mixture starts to simmer, remove the pan from the heat and divide the hot brine among the pints of grapes. Cover loosely and let cool to room temperature. Cover tightly and chill in the refrigerator for about 1 hour before serving. The pickles will keep in the refrigerator for about 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Gingered Beet Pickles</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 cup water into a medium saucepan over medium-high heat, and add the ginger, vinegar, salt, and sugar. When the brine simmers, add the beets, and when it returns to a simmer, continue to cook for 4 minutes. Remove the pan from the heat, cover loosely, and let cool to room temperature. Transfer to a quart-size glass container with a lid, and seal tightly. Chill further in the refrigerator for 1 hour or until ready to serve. The pickles will keep in the refrigerator for about 2 weeks. </p>"}]}