{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091123cakespypkncookie1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "chocolate chip cookies", "Cookies", "holiday baking", "thanksgiving alternative pies", "Thanksgiving pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Pumpkin Pie in a Chocolate Chip Cookie Crust", "link": "https://www.seriouseats.com/recipes/2009/11/cakespy-pumpkin-pie-in-a-chocolate-chip-cookie-recipe.html", "description": "<strong>Pumpkin pie and chocolate chip cookies</strong> are pretty much baked good soulmates. They're both considered all-American desserts, both are the result of bakers making do with ingredients available at the time, and both seem to inspire a primal instinct in bakers who are constantly seeking out the best recipe.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakespy", "Pies, Tarts, and Crumbles", "Pumpkin"], "recipeIngredient": ["<strong>For the crust:</strong>", "<em><strong>Note: </strong>this will likely yield more crust than you need; the extra dough can be baked as cookies.</em>", "3/4 cup granulated sugar", "3/4 cup packed brown sugar", "1 cup butter, softened", "1 egg", "2 1/4 cups all-purpose flour", "1 teaspoon baking soda <em>(note: after feedback in the comments, one tester tried the recipe witout baking soda, and it turned out fine)</em>", "1/2 teaspoon salt", "1 package (12 ounces) semisweet chocolate chips", "<strong>For the filling:</strong>", "3/4 cup granulated sugar", "1 teaspoon ground cinnamon", "1/2 teaspoon salt", "1/2 teaspoon ground ginger", "1/4 teaspoon ground cloves", "2 eggs", "1 can (15 ounces) pureed pumpkin", "1 (12 ounce) can evaporated milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the cookie crust. Mix sugars, butter and egg in large bowl. Stir in flour, baking soda and salt (the dough will be stiff). Gently fold in the chocolate chips with a wooden spoon, stirring only until incorporated. Let the dough rest in the refrigerator for two hours. Using floured hands, press the cookie dough very firmly into a well-greased 10-inch pie plate, ensuring that it is of an even thickness and goes all the way up the sides of the plate. It works best to make the crust fairly thick, perhaps half and inch, so that it doesn't get too crispy. There will probably be some extra cookie dough after you press the crust; feel free to use the dough to bake as cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pumpkin pie filling. Mix sugar, cinnamon, salt, ginger and cloves in small bowl. Beat eggs in a separate, larger bowl. Stir in the pumpkin and sugar-spice mixture. Gradually stir in evaporated milk, until the entire mixture is fully incorporated and homogeneous. Pour directly into the cookie dough crust. It should fill the crust to the very top--be very careful when putting it in the oven to prevent spilling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in your 350&deg;F oven for 45 minutes. Reduce temperature to 325 and bake for for 20-30 minutes or until  pick inserted near center comes out clean (it's ok if it is a bit longer, just make sure the middle has set). The sides of the crust will be crispy and a bit darker than you'd probably bake a cookie. It is OK though--the pumpkin filling will soften it a bit. Cool on wire rack for at least 1 hour so the filling can set. Top with whipped cream before serving.</p>"}]}