{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091218-steamedcake-bamboo.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Asian", "keywords": ["cakes", "chocolate", "desserts", "holiday baking", "Seriously Asian", "steamed cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: Steamed Chocolate Cake", "link": "https://www.seriouseats.com/recipes/2009/12/seriously-asian-steamed-chocolate-cake-recipe.html", "description": "[Photographs: Chichi Wang] Previously Holiday Dumpling Making » All Seriously Asian recipes » Why is this cake sitting in a bamboo steamer? Because it's been steamed rather than baked for moist, chocolate-y perfection. Check out the stats on this cake:...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Asian", "Desserts"], "recipeIngredient": ["1/2 cup sugar", "4 tablespoon water", "3 tablespoons butter", "4 ounces unsweetened chocolate ", "1 tablespoon rum", "5 eggs, separated", "1/2 cup cake flour", "1 tablespoon rice flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a serrated bread knife, chop the chocolate into fine slivers.  Have ready an 8-inch cake pan, fitted with parchment paper on the bottom.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a double boiler or a glass bowl propped on top of a pot of simmer water, combine the sugar, water, and butter.  Let heat for 3 to 4 minutes, until fully melted.  Remove the top from the heat and immediately add the chopped chocolate.  Set aside for 5 minutes, letting the chocolate melt undisturbed.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tablespoon of rum to the chocolate mixture, stirring to mix all the ingredients together.  At this point the chocolate should be fully melted; the mixture should be smooth and glossy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the yolks, one by one, to the bowl, mixing well after each addition.  Add the cake flour and the rice flour, mixing until the flour is just incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, beat the egg whites until they form stiff peaks - on high speed in the bowl of a stand mixer, with a hand-held mixer, or by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix 1/5 of the beaten egg whites into the batter, stirring well to incorporate.  Then gently fold in the rest of the egg whites, taking care not to deflate the mixture.  Pour the cake batter into the pan.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have ready a bamboo steamer or steamer insert with at least 2 inches of water underneath.  Bring the water to a gentle simmer.  Carefully place the cake pan into the steamer.  If you are using a metal pot, wrap the lid in a towel before closing the pot, so that the condensation from the lid doesn't drop onto the cake pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam for 8 minutes, until the surface and edges of the cake are set but the middle is still soft and custardy when pricked with a knife or skewer.  Remove the cake from the steamer and let cool to room temperature, covered with a tea towel.  Refrigerate the cake for at least 2 hours, and up to 4 days.  The cake should be covered in an airtight container to prevent drying out.    </p>"}]}