{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090127pears.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Baking Unplugged", "Cook the Book", "fall recipes", "Nicole Rees", "pears", "puff pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pear Tarte Tatin with Lemon and Anise", "link": "https://www.seriouseats.com/recipes/2009/01/nicole-rees-baking-unplugged-pear-tarte-tatin-with-lemon-and-anise-recipe.html", "description": "<p><strong>Nicole Rees</strong>' spin on tarte tatin is no harder to make than the original, but uses pears instead of apples, and incorporates the unexpected flavors of lemon zest and anise. It's an impressive dinner party dessert that uses the frozen convenience of ready-rolled puff pastry to lovely effect.</p>", "totalTime": "", "recipeYield": "6 servings", "recipeCategory": ["Cook the Book", "Pear"], "recipeIngredient": ["1 sheet prepared frozen puff pastry (half of a 17.3-ounce box), thawed", "3 medium pears, peeled, cored, and each cut lengthwise into 8 pieces", "1 tablespoon freshly squeezed lemon juice", "1/4 cup unsalted butter", "1/4 of 1 vanilla bean", "1 teaspoon grated lemon zest", "1 teaspoon anise seed, crushed with the flat side of a heavy knife", "1/4 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. On a lightly floured surface, roll the sheet of puff pastry into an 11\" square. Trim the square into a 10 1/2\"-diameter circle, discarding the scrap or saving for another use. Place the pastry circle in the refrigerator on a baking sheet until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss the pear slices with the lemon juice. Melt the butter in a 9\" heavy ovenproof skillet over medium heat. Cut the vanilla bean in half lengthwise and scrape out the seeds. Add the vanilla bean seeds, the lemon zest, and the anise seeds to the skillet and cook for 1 minute. Remove from the heat and add the pear slices to the skillet, arranging them in a fan around the outer edge and fitting in as many as possible. Fill in the center of the skillet with remaining pear slices. Sprinkle with the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drape the puff pastry circle over the pears, tucking the pastry in between the skillet and the fruit. Bake for 25 to 30 minutes or until the pastry is puffed and deeply golden. Cool in the pan on a wire rack for 3 minutes. Place a serving plate over the skillet and carefully invert the skillet to unmold the Tarte Tatin onto the plate. Serve immediately. </p>"}]}