{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Food Matters: A Guide to Conscious Eating", "Mark Bittman", "salads", "spinach", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Spinach and Sweet Potato Salad with Warm Bacon Dressing", "link": "https://www.seriouseats.com/recipes/2009/03/spinach-and-sweet-potato-salad-recipe.html", "description": "Sweet potatoes and a bacon dressing add welcome warmth and depth to this spinach salad from Food Matters: A Guide to Conscious Eating. The recipe only calls for two slices of bacon, so don't feel guilty about the porky treat....", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Bacon", "Cook the Book", "Salads", "Spinach", "Sweet Potatoes and Yams"], "recipeIngredient": ["2 large sweet potatoes, peeled and cut into bite-size pieces", "1/4 cup olive oil", "Salt and freshly ground pepper", "2 thick slices of bacon", "1 red bell pepper, cored and chopped", "1 small red onion, halved and thinly sliced", "1 tablespoon peeled, minced fresh ginger", "1 teaspoon ground cumin", "Juice from one orange", "1 pound fresh spinach leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 400°F. Put the sweet potatoes on a baking sheet, drizzle with 2 tablespoons of the oil, sprinkle with salt and pepper, and toss to coat. Roast, turning occasionally, until crisp and brown outside and just tender inside, about 30 minutes. Remove and keep them on the pan until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes cook, put the bacon in a nonreactive skillet and turn the heat to medium. Cook, turning once or twice, until crisp. Drain on paper towels and pour off the fat, leaving any darkened bits behind in the pan. Put back on medium heat, and add the remaining oil to the pan. When it's hot, add the bell pepper, onion, and ginger to the pan. Cook, stirring once or twice, until no longer raw, then stir in the cumin and the reserved bacon. Stir in the orange juice and turn off the heat. (The recipe can be made up to an hour or so ahead to this point. Gently warm the dressing again before proceeding.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the spinach in a bowl large enough to comfortably toss the salad quickly. Add the sweet potatoes and the warm dressing and toss to combine. Taste and adjust seasoning, and serve.</p>"}]}