{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Spanish", "keywords": ["Andy Pforzheimer", "Cook the Book", "olives", "Sasa Mahr-Batuz", "spanish", "tapas", "The Barcelona Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Roasted Olives", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-roasted-olives-barcelona-tapas-recipe.html", "description": "Each time that I find myself grocery shopping for a dinner party, I make sure to pick up a few snacks for cocktail hour. Being a creature of habit, my pre-dinner nibbles are inevitably Marcona almonds and olives. The almonds...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Olives", "Snacks", "Spanish"], "recipeIngredient": ["1 red bell pepper", "1 tablespoon olive oil", "4 cup assorted olives with pits (such as kalamata, Niçoise, Arbequina, Cerignola, picholine, and oil-cured black olives), drained and patted dry", "7 sprigs fresh thyme, quartered", "4 sprigs fresh rosemary, quartered", "6 whole cloves garlic, peeled", "Julienned zest of one orange", "1/4 teaspoon hot red pepper flakes", "1/4 cup red wine vinegar", "1/4 cup sherry vinegar", "3/4 extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450&deg F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the bell pepper with the tablespoon of olive oil.  Lay the pepper on a baking sheet and roast for 12 to 15 minutes, or until the side of the pepper resting on the baking sheet is wrinkled and almost black.  Turn the pepper over and continue roasting for 7 to 8 minutes longer, or until the pepper is nicely charred on all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pepper to a small bowl and cover the bowl with plastic wrap.  Let the pepper steam as it cools in the bowl for about 10 minutes.  Remove from the bowl, rub off the charred skin, open the pepper, and scrape out the seeds and membranes.  Cut the pepper into very thin strips (about 1/8 inch thick).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven heat to 425&deg F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, mix together the olives, julienned red pepper, thyme, rosemary, garlic, orange zest, and red pepper flakes.  Toss well.  Add the red wine vinegar and sherry vinegar to the olives and stir to distribute evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the olives on a jelly roll or shallow roasting pan.  Roast for about 35 minutes, stirring frequently, or until the olives are tender.  To test for doneness, taste an olive to see if the meat separates easily from the pit.  If so, the olives are done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the olives cool in the pan.  When cool, drizzle with the extra-virgin olive oil and stir to mix.  Serve right away or refrigerate in a container with a tight-fitting lid for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the olives from the refrigerator at least 2 hours before serving to let them reach room temperature.  Stir well before serving.</p>"}]}