{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091206beantoast.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["beans", "eggs", "Sunday Brunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Bean Toasts with Herbs and Eggs", "link": "https://www.seriouseats.com/recipes/2009/12/sunday-brunch-bean-toasts-with-herbs-and-eggs-recipe-breakfast.html", "description": "[Photo: Robin Bellinger] My practically bare refrigerator recently managed to produce bean toasts with herbs and eggs. Stale bread plus herbs left over from Thanksgiving cooking plus egg whites left over from making ice cream plus the end of a...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Vegetarian"], "recipeIngredient": ["4 half-inch thick slices country bread", "Olive oil", "1/2 small onion cut into 1/4-inch dice", "1 big clove garlic, peeled and crushed ", "2 teaspoons finely chopped herbs, such as rosemary, thyme, and sage", "1 cup cannellini beans, drained", "1 tablespoon butter", "Salt", "Pepper", "2 eggs", "Pecorino romano or Parmesan to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the oven to a low heat, just enough to keep plates warm. Put a 10-inch skillet, preferably nonstick, over high heat. Brush both sides of each slice of bread with olive oil. When the skillet is hot, toast the bread until it is golden brown, about 3 minutes per side, working in batches. Keep a close eye on the toast as it can blacken quite quickly. As each slice is finished, remove it to an ovenproof dish in the warm oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the bread is toasted, turn the flame to medium-low, add a tablespoon of olive oil, and stir in the onions. Cook until they are soft and beginning to brown. If this seems to be going too slowly, you can turn up the heat, but your skillet will probably be quite hot from the toasting. When the onions are soft and brownish, add the garlic and herbs and stir for half a minute or so. Then stir in the beans and the butter and cook over low heat until warmed through. Season with salt and pepper. Remove the warm beans to an ovenproof dish in the warm oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scramble or poach your eggs. Assemble the toasts: top each slice with eggs and then beans. Use a vegetable peeler to shave some cheese on top.</p>"}]}