{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091130-cookieman.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "Cindy Mushet", "Cookies", "holiday baking", "sugar cookies", "The Art and Soul of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Classic Sugar Cookies", "link": "https://www.seriouseats.com/recipes/2009/11/classic-sugar-cookies-recipe.html", "description": "The holidays are full of great cookies but no <em>one</em> cookie represents the season better than <strong>the sugar cookie.</strong>", "totalTime": "", "recipeYield": "40 to 50 cookies", "recipeCategory": ["Cook the Book", "Cookies"], "recipeIngredient": ["2 1/4 cups (11 1/4 ounces) unbleached all-purpose flour", "3/4 cup (5 1/4 ounces) plus 2 tablespoons sugar", "1/4 teaspoon salt", "2 sticks (8 ounces) cold unsalted butter, cut into 1/2-inch pieces", "2 large egg yolks", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour, 3/4 cup of the sugar, and the salt in the bowl of the stand mixer and beat on low speed for 15 seconds, just to blend the ingredients.  You can also use a hand mixer and a medium bowl, though it may take a little longer to achieve the same results.  Add the butter and mix on low until the butter is broken into tiny pieces, 2 to 3 minutes.  Turn the mixer to medium-low and mix until the mixture forms small clumps about the size of peas, 2 to 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the egg yolks and vanilla.  Add the egg mixture to the butter mixture and blend on medium-low until the dough comes together to form several large clumps. Turn the dough out onto a work surface and knead several times, just to bring it together. Divide the dough in half and shape each half into a disk about 1/2 inch thick. Wrap the disks in plastic and refrigerate for about 30 minutes, or until cold but still pliable. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one disk of dough between two sheets of parchment or waxed paper and roll 1/8 inch thick.  If the dough cracks when you start to roll, it may be too cold,  Let it stand for 10 minutes, then try again-this dough rolls most easily when it is at cool room temperature.  Ads you roll, the parchment will wrinkle, especially on the bottom.  When this happens, peel off the top parchment paper, smooth out any wrinkles, and place it back on the dough.  Flip the dough and repeat with the paper on the other side.  You may need to do this several times during the rolling process.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> The dough may also be rolled out on a lightly floured work surface, but be sure to brush off and excess flour from the top and bottom of the dough before chilling and baking (the parchment paper method is easier and cleaner).  Place the rolled out dough, with the parchment still attached, on a baking sheet and transfer to the refrigerator to chill for 30 minutes.  Repeat with the remaining disk of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the parchment from the top and bottom of one piece of rolled out dough and place the dough on your work surface.  Line the baking sheet with new parchment paper.  Use cookie cutters to cut the dough into desired shapes and transfer to the parchment-lined sheet, spacing the cookies about 1 1/2 inches apart.  Stack the cookies on the sheet pan with a piece of parchment paper between each layer.  Scraps of dough can be gently kneaded then rerolled, but the more they are rerolled, the less tender the cookies, so strategically place your cookie cutters to leave as few scraps as possible.  Repeat with the remaining sheet of dough.  Chill the cut shapes while the oven preheats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F and position an oven rack in the center.  Sprinkle the cookies on each baking sheet with some of the remaining 2 tablespoons of sugar (you may not use it all) just before they go into the oven.  Bake one pan at a time, rotating the sheet about halfway through, for 10 to 13 minutes, until light golden brown.  Transfer to a rack to cool completely.  Repeat with the remaining cookie shapes.  Decorate the cookies as desired or leave them plain and simple.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Storing tips:</strong>  The cookies can be stored in an airtight container, layered between sheets of parchment or waxed paper, at room temperature for up to 1 week.</small></p>"}]}