{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090302kneadlessly_simple.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["baking", "breadmaking", "breads", "Cook the Book", "Kneadlessly Simple", "Nancy Baggett", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Four Grain-Honey Bread", "link": "https://www.seriouseats.com/recipes/2009/03/kneadlessly-simple-nancy-baggett-four-grain-honey-bread-recipe.html", "description": "According to Nancy Baggett, author of Kneadlessly Simple, four grain-honey bread is the perfect whole wheat \"gateway\" loaf for avowed white bread fans. The combination of cornmeal, oats, brown rice, wheat flour, and honey delivers a mild and soothing flavor,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 cups (10 ounces) unbleached white bread flour, plus more as needed", "1 cup (5 ounces) whole wheat flour", "1/2 cup white or  yellow cornmeal, preferably stone-ground, plus more for garnish", "1/3 cup rolled oats, plus more for garnish", "1/3 cup cooked and cooled brown rice", "Generous 1 1/2 teaspoons salt", "3/4 teaspoon instant, fast-rising, or bread machine yeast", "1/2 cup clover honey or other mild honey", "1 1/4 cups ice water, plus more if needed", "Corn oil or other flavorless vegetable oil for coating dough top and baking pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First rise:</strong> In a large bowl, thoroughly stir together the bread flour, whole wheat flour, cornmeal, oats, brown rice, salt, and yeast. In another bowl or measuring cup, thoroughly whisk the honey into the ice water. Vigorously stir the mixture into the bowl with the flours, scraping down the bowl sides and mixing just until the dough is thoroughly blended. If the ingredients are too dry to mix together, gradually add in just enough more ice water to facilitate mixing; don't over-moisten, as the dough should be stiff. If necessary, mix in more bread flour to stiffen it. Brush or spray the top with oil. Tightly cover the bowl with plastic wrap. If desired, for best flavor or for convenience, refrigerate for 3 to 10 hours. Then let rise at cool room temperature for 12 to 18 hours; if convenient, stir once during the rise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Second rise:</strong> Vigorously stir the dough. Using a well-oiled rubber spatula, fold the dough in towards the center, all the way around the bowl. Dust an oiled 9x5-inch loaf pan with 1 tablespoon each cornmeal and rolled oats, tipping it back and forth to coat the pan sides. Turn out the dough into the pan. Brush or spray the top with oil. Smooth out the top and press the dough into the pan with oiled fingertips or a rubber spatula. Sprinkle 1/2 tablespoon each cornmeal and rolled oats over the top. Press down to imbed. Cut four or five 3-inch-long, 1/4-inch-deep evenly spaced slashes diagonally across loaf top. Cover the pan with nonstick spray-coated plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Let rise using any of these methods:</strong> For a 2- to 4-hour regular rise, let stand at warm room temperature; for a 1 1/2- to 2 1/2-hour accelerated rise, let stand in a turned-off microwave oven along with 1 cup of boiling-hot water. Or, for an extended rise, refrigerate for 4 to 24 hours, then let stand at room temperature. Remove the plastic when the dough nears it, then continue the rise until the dough extends 1/2 inch above the pan rim.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking preliminaries:</strong> 15 minutes before baking time, put a rack in the lower third of the oven; preheat to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Bake on the lower rack for 50 to 60 minutes, or until the loaf is well browned and firm on top; cover with foil if necessary to prevent over-browning. Continue baking for 10 to 15 minutes longer, testing until a skewer inserted in the thickest part comes out with just a few particles on the end (or until the center registers 207 to 209&deg;F on an instant-read thermometer). Bake for 5 to 10 minutes more to ensure the center it done. Cool in the pan on a wire rack for 10 minutes. Turn the loaf onto the rack; cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving and storing:</strong> Cool thoroughly before slicing or storing in a plastic bag or foil. The bread will keep at room temperature for 2 to 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}