{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feat-20090122BakedPotatoNachos.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["nachos", "potato chips", "snacks", "Super Bowl Nachos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Super Bowl Snacks: Loaded Baked Potato Potato Chip Nachos", "link": "https://www.seriouseats.com/recipes/2009/01/loaded-baked-potato-potato-chip-nachos-super-bowl-recipe.html", "description": "This year, I wanted to outdo myself. And I think I did. I combined two of my favorite all-American junk food concoctions: <strong>nachos, and the loaded baked potato.</strong> Why should chips and cheese be relegated exclusively to flavors of the Southwest?", "totalTime": null, "recipeYield": "4 to 8", "recipeCategory": ["Snacks"], "recipeIngredient": ["1 seven-ounce bag of kettle-cooked potato chips", "1 medium russet potato, peeled, and cut into 1-inch cubes", "1/2 cup whole milk", "1 tablespoon butter", "Salt and pepper", "4 strips thick-cut bacon", "1 cup grated extra sharp cheddar cheese", "2 to 3 scallions, sliced", "1/4 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the peeled and cubed potato in a small sauce pan, and just cover it with cold water and a pinch of salt.  Place the lid on the pot, crank the heat up to high, and cook the potatoes until they are fork tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the mashed potato topping, drain the potatoes and put them back in their hot pot (but not on a lit burner), just so a bit of the excess moisture will evaporate.  Then pass the potatoes through a ricer, and add the butter and milk to the potatoes and mix to combine.  Season with salt and pepper.  If you do not have a ricer, don't despair.  Just add the butter and milk to the chunks of potatoes and mash with a potato masher.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the bacon bits, slice each thick-cut strip of bacon in half lengthwise, and then cut the thin strips about every quarter inch to create little squares.  Put the bacon pieces into a small sauté pan over medium to medium-high heat, and cook until crisp, but not crisp all the way through, because they will continue to crisp slightly when you melt the cheese in the oven, and you don't want them to burn.  Drain on a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill an oven-safe wide plate with the chips.  You don't need to use all of each topping; really, when building nachos, it depends on which chips and which dish you end up choosing.  So just dollop away to your preference.  Begin first with the mashed potatoes, then the extra sharp cheddar cheese, then the bacon bits, and lastly the scallions.  Place the plate on a baking sheet, and bake for 10 minutes in the 400°F oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lastly, dollop some sour cream over the top of the nachos, and serve straight from the oven, hot and gooey and really, really good.</p>"}]}