{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091004oatmeal_and_figs.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["figs", "healthy and delicious", "oatmeal", "steel-cut oats", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Sunday Brunch: Oatmeal with Honeyed Figs", "link": "https://www.seriouseats.com/recipes/2009/10/sunday-brunch-oatmeal-with-honeyed-figs-steel-cut-oats-breakfast-recipe.html", "description": "[Photo: Robin Bellinger] My husband recently accused me of eating steel-cut oats every morning, which I started doing about six months ago, because they are \"trendy.\" My knee-jerk protest died in a splutter as I recalled that I adopted this...", "totalTime": "", "recipeYield": "3 to 4", "recipeCategory": ["Breakfast and Brunch"], "recipeIngredient": ["1 cup milk", "1 tablespoon unsalted butter", "1 cup steel-cut oats", "1/4 teaspoon salt", "5 ounces (1 cup) dried figs, quartered and stemmed", "1 1/2 teaspoons honey", "1/8 teaspoon vanilla", "1/8 teaspoon cinnamon", "Brown sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 3 cups water and the milk to a simmer in a 2-quart saucepan over medium heat. Meanwhile, melt the butter in a skillet over medium heat, then add the oats and toast, stirring constantly, until golden and fragrant with a butterscotch-like aroma, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the toasted oats into the simmering liquid, reduce the heat to medium-low, and simmer gently until the mixture thickens, about 20 minutes. Stir in the salt and continue to simmer, stirring occasionally, until the oats absorb almost all the liquid and the oatmeal is creamy, about 10 minutes longer. Let the oatmeal stand for 5 minutes before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oatmeal stands, make the topping. Bring the figs, honey, vanilla, cinnamon, and 1 1/2 tablespoons water to a simmer in a small saucepan over medium-high heat. Cook until the liquid reduces to a glaze, about 4 minutes. Sprinkle each bowl of hot oatmeal with a little spoonful of brown sugar, if you like, and top with honeyed figs before serving.</p>"}]}