{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091230-pistachiomacaroons.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "baking", "Cookies", "Dede Wilson", "desserts", "holiday baking", "macarons", "pistachios", "Unforgettable Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pistachio Macarons", "link": "https://www.seriouseats.com/recipes/2009/12/pistachio-macaroons-recipe.html", "description": "My experience with French macarons is sadly limited. Sure there were a few wonderful ones in France and a handful of lesser-good versions from New York bakeries, but all in all, I haven't eaten more than two dozen in my life.", "totalTime": null, "recipeYield": "20 sandwich-style cookies", "recipeCategory": ["Cook the Book", "Cookies", "Desserts", "Nuts"], "recipeIngredient": ["<strong>Macarons</strong>", "3/4 cup unshelled unsalted raw green pistachios, rubbed clean of papery skin", "1 1/4 cups confectioners' sugar", "3 large egg whites", "Pinch of salt", "1/4 cup sugar", "Pastry bag and 1/2-inch plain round decorating tip", "<strong>Filling</strong>", "1 cup sifted confectioners' sugar", "1/4 cup unshelled unsalted raw green pistachios, rubbed clean of papery skin", "6 tablespoons (3/4 stick) unsalted butter, at room temperature, cut into pieces", "1/4 teaspoon almond extract", "1.4 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the macarons:  </strong>Line 2 jelly-roll pans with parchment paper; set aside.  Put the nuts in a food processor fitted with the metal blade attachment and pulse on and off several times to begin the grinding process.  Add the confectioners' sugar and process until they are as finely ground as possible.  Scrape into a fine-mesh strainer set over a bowl and shake and press as much of the fine powder as possible through the strainer.   Return what is left in the strainer to the food processor and grind again.  Repeat the straining and processing one or two more times.  You should be able to grind almost all of it into a fine powder; there might be a scant tablespoon of coarse nut-sugar mixture left in the strainer, which you should discard.  Set the fine powder aside.  Do not bother to wash the food processor; it will be used for the filling, and any leftover nut particles are fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean, grease-free bowl of a stand mixer, whip the egg whites on low speed using the wire whip attachment until frothy.  Increase the speed to medium-high and add the salt.  When soft peaks form, add the sugar gradually.  Continue whipping until stiff peaks form.  Remove 2 tablespoons of the pistachio powder and set aside.  Fold in the remaining pistachio powder into the meringue in two batches until evenly combined,  Dollop about 2 tablespoons of batter onto a prepared pan.  It should not completely hold its shape, nor should it puddle out into a flat disk, but rather should be somewhere in between.  It should relax and soften slightly, losing any pointed \"kiss\"-like peak on top.  Add the reserved pistachio powder if necessary to achieve proper texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scape the batter into a pastry bag fitted with the tip and pipe mounds, about 1 1/4 inches across, at least 2 inches apart on the pans.  Rap the pans firmly (and flatly) on the counter to release any air bubbles.  Allow to sit at room temperature for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the upper and lower third of the oven.  Preheat the oven to 325%deg;F.  Bake for 10 to 12 minutes, or until the cookies are dry on the top.  They should be smooth and gently domed; the insides will still be soft and a little moist and they should have developed a ruffled ring, or \"foot\" around the bottom of each cookie.  Cool completely on the pans set on racks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the filling:  </strong>Grind the confectioners' sugar and nuts together in a food processor fitted with the metal blade attachment until as fine as a powdery as possible (no need to sift).  Add the butter with the machine running until creamy and combined.  Pulse in the extracts.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sure that the macarons are completely cooled.  Use a small offset spatula to spread a small amount of filling on one cookies bottom, then sandwich together with another cookie (matching the cookies by size, if there is some variation).  Macarons may be served immediately, but I like to let them sit overnight at room temperature in an airtight container.  Their flavor and texture seem to improve.  Store at room temperature for up to 4 days in an airtight container.  You may also experiment with freezing them.  Many baker do, but I think they suffer a little. </p>"}]}