{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["cereal", "Cook the Book", "Food Matters: A Guide to Conscious Eating", "fruit", "Mark Bittman", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fruit and Cereal Bites", "link": "https://www.seriouseats.com/recipes/2009/03/fruit-and-cereal-bites-recipe.html", "description": "The following recipe is from the March 11th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! I'm one of those people who is guilty of never eating breakfast&mdash;unless cold pizza counts. It's...", "totalTime": "", "recipeYield": "about 3 dozen bite-size balls", "recipeCategory": [], "recipeIngredient": ["1 1/2 cups dried fruit", "2 tablespoons vegetable oil", "2 tablespoons honey (optional)", "Fruit juice or water, as needed", "1 cup ready-to-eat breakfast cereal, like granola", "Crumbled shredded wheat, whole grain flakes, finely ground nuts, cocoa, or shredded unsweetened coconut for rolling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the dried fruit, oil, and honey if you are using it in a food processor and puree until smooth, adding fruit juice a little at a time to keep the machine running. You'll need to stop once or twice to scrape down the sides of the bowl. (Add small amounts of water or fruit juice if the fruit is dried out and is not processing.) Fold in the cereal until evenly distributed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take a heaping tablespoon of the mixture and roll it into a ball. Then if you like, roll the ball around in your topping of choice. Put the ball between layers of waxes paper in a tightly covered container and refrigerate until set, about 45 minutes. Eat immediately, or store in the fridge for up to several days. You can also wrap the balls individually in wax paper like candies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fruit and Cereal Bars:</strong> Line an 8-inch by 8-inch pan with foil. Follow the recipe through Step 2. Spread the mixture in the pan, pushing it into the corners and evening the top. Refrigerate to set as above. If you like, dust the top with any of the toppings. Then cut into squares.</p>"}]}