{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090601rusticfruitdesserts.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apples", "cheddar", "cobblers", "Cook the Book", "Cory Schreiber", "desserts", "Julie Richardson", "Rustic Fruit Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Apple Cobbler with Cheddar Biscuits", "link": "https://www.seriouseats.com/recipes/2009/06/apple-cobbler-with-cheddar-biscuits-recipe.html", "description": "Apples and cheddar are a fantastic combination, combining both sweet and savory, creamy and crunchy.  One of my go-to late night snacks is a grilled cheddar sandwich with slices of tart Fuji apple.  If you are a fan of apple pie served with a cheddar slice, then this recipe was written for you.", "totalTime": null, "recipeYield": "8 to 10", "recipeCategory": ["Apple", "Cook the Book", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 tablespoon unsalted butter, at room temperature, for dish", "<strong>For fruit filling:</strong>", "1 cup packed (7 1/2 ounces) medium brown sugar", "3 tablespoons cornstarch", "1/2 teaspoon fine sea salt", "1 teaspoon ground cinnamon", "8 large apples, peeled, cored, and sliced 1/4 inch thick (3 1/2 pounds prepped)", "Juice of 1 lemon", "1/4 cup (2 ounces) unsalted butter", "<strong>For biscuits:</strong>", "2 cups (10 ounces) all-purpose flour", "2 tablespoons granulated sugar", "2 teaspoons baking powder", "1/2 teaspoon fine sea salt", "2 cups (4 ounces) grated extra-sharp Cheddar cheese", "1 1/3 cups cold buttermilk, or more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the lower third of the oven and preheat the oven to 375&deg F.  Butter a 3-quart baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the fruit filling, with your hands, rub the brown sugar, cornstarch, salt, and cinnamon together in a large bowl.  Add the apples and toss to evenly coat.  Gently stir in the lemon juice.  Let the apples sit for 15 minutes to release some of their juices.  Mix the filling more than one time before scraping the contents into the prepared pan.  Cut the butter into small cubes and scatter over the apples.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan with foil and bake in the lower third of the oven for 20 minutes.  This gives the apples a jump start on cooking while you make the biscuits.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the biscuits, whisk the flour, 1 tablespoon of the sugar, the baking powder, and the salt together in a bowl.  Add the cheese and toss until evenly coated.  Make a well in the center of the bowl and add the buttermilk.  With a rubber spatula or fork, or by hand, stir just until the dry ingredients are moistened.  The dough will be shaggy and moist.  If the dough seems dry, add a bit more buttermilk, no more than 1 tablespoon at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the baking pan out of the oven and remove the foil.  In 1/4 cup portions, place the dough atop the fruit, distributing the biscuits evenly.  (You should end up with about 9 biscuits.)  Sprinkle the remaining 1 tablespoon of sugar over the biscuits.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the cobbler to the oven (this time without the foil) and bake for an additional 30 to 40 minutes, or until the apples are tender, the juices are bubbling, and the biscuits are golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage:</strong> This dessert is best served the day that it is made, but any leftovers can be wrapped in plastic wrap (or foil) and kept at room temperature for 2 to 3 days.</p>"}]}