{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090204shortribs.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["beef", "Mary Goodbody", "Osteria", "Osteria di Tramonto", "Rick Tramonto", "short ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Red Wine-Braised Short Ribs", "link": "https://www.seriouseats.com/recipes/2009/02/red-wine-braised-short-ribs-recipe.html", "description": "Photograph from cerolene on Flickr A slow braise is warming from the moment you preheat the oven to that last, luscious bite of the fork-tender meat, and your kitchen smells deliciously inviting through it all. It's just the season for...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Beef", "Braising and Stewing", "Cook the Book"], "recipeIngredient": ["Four 12- to 14-ounce boneless beef short ribs", "Kosher salt and freshly ground black pepper", "1/4 cup vegetable oil", "2 carrots, cut into large dice", "2 celery ribs, cut into large dice", "1 yellow onion, cut into large dice", "2 tablespoons tomato paste", "One 750-ml bottle dry red wine", "2 cups port", "3 sprigs fresh thyme", "1 sprig fresh rosemary", "1 bay leaf", "2 quarts veal stock or chicken stock", "2 tablespoons sherry vinegar", "2 tablespoons chopped fresh flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the short ribs in a single layer in a shallow baking pan and season generously on both sides with salt. Cover and refrigerate for 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the salt off the ribs and pat them dry with paper towels. Season the ribs with pepper and a light sprinkling of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a casserole or braising pan over high heat. When the pan is hot, put the oil in the pan. When the oil is hot, sear the short ribs on both sides until golden brown. Lift the short ribs from the pan and set aside. If the oil is dark, discard it and replace with fresh oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium high and add the carrots, celery, and onion to the pan. Cook, stirring, for about 8 minutes, or until the vegetables brown and caramelize.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the tomato paste. Reduce the heat to medium and cook for 2 to 3 minutes. Add the wine and port. raise the heat to medium-high, and cook for about 5 minutes, or until the liquid reduces by half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the short ribs to the pan and add the thyme, rosemary, and bay leaf. Pour the stock into the pan. Bring to a boil over medium-high heat. Lay a sheet of parchment paper (or aluminum foil) directly on the food and transfer the pan to the oven. Cook for about 2 hours, until the meat is fork tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and discard the parchment paper or foil. Add the vinegar. Let the short ribs come to room temperature in the braising liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift the short ribs from the liquid and set aside on a large plate or bowl, covered, to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the braising liquid through a fine-mesh sieve or chinois into a saucepan. Bring to a simmer over medium-high heat, reduce the heat to low, and cook for about 15 minutes, or until reduced by a quarter. Using a skimmer or large spoon, skim off any fat that rises to the surface. Season to taste with salt and pepper and pour the sauce over the ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately or allow to cool to room temperature and then cover and refrigerate for up to 5 days. (If you are serving immediately and the ribs and sauce are not hot enough, reheat gently over medium-low heat for about 10 minutes.) Top each short rib with 1/4 to 1/2 cup of sauce and garnish with the chopped parsley.</p>"}]}