{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090209baked_hot_choc.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["chocolate", "Cook the Book", "desserts", "hot chocolate", "John Scharffenberger", "Robert Steinberg", "Scharffen Berger", "The Essence of Chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Baked Hot Chocolate", "link": "https://www.seriouseats.com/recipes/2009/02/baked-hot-chocolate-the-essence-of-chocolate-heidi-friedlander-recipe.html", "description": "Photograph from kevinmarsh on Flickr Today's Cook the Book recipe comes to us from Heidi Friedlander, contributor to Scharffen Berger's The Essence of Chocolate, and pastry chef at Cleveland's popular Moxie. Baked in mugs or cups and dolloped with whipped...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Desserts", "Hot Chocolate and Cocoa"], "recipeIngredient": ["9 ounces 62% semisweet chocolate, finely chopped", "6 tablespoons (3 ounces) unsalted butter, cut into cubes", "4 large eggs", "1/4 cup granulated sugar", "Whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and preheat the oven to 350 degrees F. Arrange ovenproof coffee cups or mugs or 8-ounce ramekins in a baking or roasting pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate and butter in the top of a double boiler set over gently simmering water, and whisk occasionally until the chocolate has melted and the mixture is smooth. Remove from the heat and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the eggs and sugar together in the bowl of a stand mixer then set over the simmering water and stir until warm to the touch. Place the bowl on the stand mixer and, using the whisk attachment, b eat for 3 to 5 minutes until light and fluffy. Remove from the mixer, and fold the eggs into the chocolate mixture until it is light and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the batter into the cups. Add enough very hot water to the baking pan to come halfway up the sides of the cups. Bake for 15 to 20 minutes. The baked hot chocolates will be done when the tops lose their glossy finish. A wooden skewer inserted in the top will emerge clean, but batter toward the bottom of the cup will still be very moist.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the cups from the pan. The cakes can be served warm, at room temperature, or covered and refrigerated for up to 1 day. To reheat, bring to room temperature and place in a preheated 350-degree F oven for 5 minutes, or until warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve topped with a dollop of whipped cream.</p>"}]}