{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "Kosher", "keywords": ["apples", "Arthur Schwartz", "cakes", "Jewish", "nuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple Nut Cake", "link": "https://www.seriouseats.com/recipes/2009/09/arthur-schwartzs-pareve-apple-cake.html", "description": "...", "totalTime": null, "recipeYield": "one 8-inch square cake", "recipeCategory": ["Apple", "Desserts", "Kosher", "Rosh Hashanah"], "recipeIngredient": ["<strong> For the topping: </strong> 1/2 cup coarsely chopped walnuts or pecans", "3/4 cup sugar", "1 tablespoon ground cinnamon or a combination of ground cinnamon, nutmeg, mace, and ginger", "<strong> For the Cake </strong>: ", "3 eggs", "3/4 cup sugar", "1/3 cup vegetable oil", "3/4 cup matzo cake meal", "5 medium apples, peeled, cored, halved, and cut into 1/4-inch thick slices (about 5 cups), preferable Golden Delicious, Crispin (Mutzu), or other apples that keep their shape when cooked", "1/3 cup raisins (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position an oven rack in the center of the oven. Preheat the oven to 350°F. Lightly oil an 8-inch square glass baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the topping, mix together the walnuts, sugar, and cinnamon in a small bowl; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the cake batter, in a bowl, with a hand-held electric mixer, beat the eggs on medium speed until well mixed. Beat in the sugar, about 2 tablespoons at a time, beating until the mixture is thick and foamy. Beat in the oil, adding it in a steady stream. Scrape down the bowl with a rubber spatula.  With the spatula, stir in the matzo cake meal, blending well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour half of the batter into the prepared pan.  Sprinkle about half the topping mixture evenly over the batter. Top with half the apples and all the raisins. Scrape the remaining half of the batter over the apples, spreading it out to cover the apples. Arrange the remaining apples on top of the batter. Sprinkle evenly with the remaining topping mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 1 hour and 15 minutes, or until the sides of the cake pull away very slightly from the baking dish and the topping has begun to caramelize.  (A cake tester is not reliable. It will not come out clean due to the moist richness of this cake.) Let sit in the baking dish for several hours until completely cool before cutting into serving portions. This cake is yet another Yiddish food that imp0rovves with age. Keep the cake in its dish, covered tightly with plastic, and the next day the topping will have become a moist, candy-like coating.</p>"}]}