{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "French toast", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: French Toast and Canadian Bacon Sandwiches", "link": "https://www.seriouseats.com/recipes/2009/01/sunday-brunch-french-toast-and-canadian-bacon.html", "description": "The name of this recipe, adapted from James Vilas' must-have porcine tome The Bacon Cookbook says it all. Vilas suggest you use the purists' Canadian bacon known as peameal bacon, but any old Canadian bacon will do just fine. If...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon", "French Toast", "Sandwiches"], "recipeIngredient": ["8 tablespoons (1 stick) plus 3 tablespoons butter ", "Eight to ten 1/4-inch-thick slices Canadian bacon", "12 large eggs", "1 cup whole milk", "Salt and cayenne pepper to taste", "8 to 10 slices white loaf bread, crusts removed", "Maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, melt the 3 tablespoons of butter over moderate heat, add the bacon slices, brown lightly, about 2 minutes on each side, and keep warm on a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl, whisk together 6 of the eggs with the milk, salt, and cayenne till well blended. In another bowl, whisk the remaining 6 eggs till frothy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each slice of bread in half digonally. Soak each slice momentarily in the milk mixture, then, using two forks or large spoons, carefully coat both sides of each slice in the beaten egg, placing the slices on a plate as they are coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat about 1/3 of the stick of butter over moderate heat, add about 1/3 of the coated slice, cook about 3 minutes on each side till golden, and transfer the toaste to a plate with a spatula. Repeat the procedure with the remaining butter and slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the Canadian bacon into approximately the same size triangles as the toast, arrange the sandwiches on a large heated platter, and drizzle them liberally with maple syrup.</p>"}]}