{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091008-srslyitalian1.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["fall recipes", "farro", "grains", "Italian", "Seriously Italian", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Zuppa di Farro", "link": "https://www.seriouseats.com/recipes/2009/10/seriously-italian-zuppa-di-farro.html", "description": "\"Like pasta, farro absorbs and unifies with whatever flavors you add to it.\" [Photographs: Gina DePalma, unless otherwise noted.] Previously Punctuating Flavors with Ricotta Salata » All Seriously Italian recipes » The onset of chilly, blustery days is the perfect...", "totalTime": "", "recipeYield": "about 5 to 6 quarts of soup", "recipeCategory": ["Italian", "Soups and Stews"], "recipeIngredient": ["2 cups farro ", "3 tablespoons olive oil ", "1 medium clove of garlic, peeled and smashed ", "1 medium onion, diced ", "2 ounces pancetta or guanciale, diced ", "1/2 teaspoon dried thyme or 2 sprigs fresh thyme ", "2 or 3 crumbled sage leaves ", "1 bay leaf ", "1 cup canned plum tomatoes, crushed and chopped ", "Salt and pepper to taste  ", "6 to 8 cups of good-quality beef stock  ", "Torn parlsey leaves, Extra-Virgin Olive Oil and grated Parmigano-Reggiano or Grana Padano for garnish  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the farro in a large bowl and cover it with one quart of cold water.  Let the farro soak for two hours, then drain it, discarding the water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large stockpot and add the garlic clove.  Let the garlic sizzle and cook in the oil until it begins to turn golden brown, then remove it.  Add the diced onion and pancetta to the oil, stirring it well. Season this mixture with a pinch of salt and stir, sautéing on low heat until the onions and pancetta soften and turn translucent at the edges.  Stir in the herbs and sauté for another minute.  Do not allow the mixture to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes to the pot and stir, then add the farro, 4 cups of the stock, and 1 cup of water. Bring the mixture to a gentle simmer, then cover the soup and lower the heat. Simmer the soup covered for 45 minutes, stirring every 10 to 15 minutes.  As the moisture absorbs, add more stock to the pot, a cup or so at a time, keeping the grains loose and suspended in liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the farro is tender, the soup is done.  Allow it to cool for about 30 minutes in the pot.  Remove about 2 cups of the soup to a blender container and puree it smooth.  Stir the pureed mixture into the soup, and add more stock if necessary.  The soup should not be thick or gloppy, but loose and liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the soup to the heat before serving; garnish with parsley, a dribble of olive oil and a grating of cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Leftovers advice:</strong> Store extra soup for up to three days.  The soup will continue to absorb moisture as it sits, so you may have to thin it to the proper consistency with water or additional stock before reheating.</p>"}]}