{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091113-lambburger-ctb.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "feta", "greek", "How to Roast a Lamb", "lamb", "Michael Psilakis", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lamb Burger", "link": "https://www.seriouseats.com/recipes/2009/11/lamb-burger-recipe.html", "description": "[Photograph: Caroline Russock] Michael Psilakis' Lamb Burger might not be a traditional burger, but it is one awesome sandwich. The burger consists of a 70/30 mix of ground lamb and pork seasoned with charred onions, fresh parsley, and dill, Dijon...", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Burger", "Cook the Book", "Lamb", "Sandwiches"], "recipeIngredient": ["2 (1/4-inch-thick) slices Spanish or sweet onion", "Blended oil (90 percent canola, 10 percent extra-virgin olive oil), as needed", "Kosher salt and cracked black pepper", "7 ounces ground lamb", "3 ounces ground pork", "1 tablespoon Dijon mustard", "1/2 teaspoon ground coriander", "1 tablespoon finely chopped parsley ", "1 tablespoon finely chopped dill", "1 scallion, green part only, finely chopped", "1/2 teaspoon ground cumin", "1/2 teaspoon ground fennel", "About 2 ounces pork caul fat", "2 kaiser rolls or sesame buns, or the roll or bread of your choice, brushed with olive oil and toasted", "<em>Htipiti</em> (<a href=\"#htipiti\">recipe follows</a>) or lemon wedges and extra-virgin olive oil", "1/2 Spanish or sweet onion, thickly sliced", "Extra-virgin olive oil", "Kosher salt and cracked black pepper", "1 cup crumbled feta cheese ", "2 fire-roasted red bell peppers, home-roasted for store-bought, cut into strips", "1 to 2 pepperoncini (pickled yellow peppers) to taste, sliced", "1/2 teaspoon dry Greek oregano", "2 pinches ground coriander", "2 pinches ground cumin", "4 small picked sprigs parsley", "4 small picked sprigs dill", "1 tablespoon snipped chives or scallion greens, sliced", "1/4 teaspoon grated lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the onion slices with a little oil and season with kosher salt and pepper. On a hot grill pan or cast-iron skillet, grill until tender. Separate the onion into rings and chop fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine the chopped grilled onion, lamb, pork, mustard, coriander, parsley, dill, and scallion. Season liberally with kosher salt and pepper. With clean hands, combine the mixture evenly and divide in half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a 4- to 5-inch ring mold on a clean work surface (if one side is wider, place the wider side down). Lay a piece of caul fat over the top with a few inches overhanging all around. Place half the lamb mixture in the center and press down to form a thick, flattened disk. Wrap the overhanging caul fat up and over the top, overlapping a bit but trimming off extra bits and pieces. Smooth the caul fat so that it is flat to the surface. Repeat to make the second burger, and place them on a piece of parchment.  Cover with another piece of parchment and refrigerate for a couple of hours if not using immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a charcoal or gas grill, ridged cast-iron grill pan, or cast-iron skillet, until hot.  Brush the burgers lightly with olive oil and season with kosher salt and pepper. Place the side with the caul fat down first, grill, and turn over until firm and char-marked on both sides, to your desired doneness. Transfer to the bun of your choice and top with a spoonful of <em>Htipiti</em> (or drizzle with some lemon juice and extra-virgin olive oil).  Serve with french fries (optional).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"htipiti\"></a><h4><em>Htipiti:</em> Roasted Red Pepper and Feta Spread</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em> - makes 1 quart -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the onion slices with a little olive oil and season with kosher salt and pepper. On a hot grill pan or in a cast-iron skillet, grill the onions until tender and slightly char-marked. Separate into rings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, combine all of the remaining ingredients and process until very smooth. Taste for seasoning, but be careful not to add too much salt, as the feta is very salty.</p>"}]}