{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090921gourmettoday.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Dijon", "Gourmet", "Gourmet Today", "John Willoughby", "Ruth Reichl", "short ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Cook the Book: Braised Short Ribs with Dijon Mustard", "link": "https://www.seriouseats.com/recipes/2009/09/braised-short-ribs-dijon-mustard-gourmet-today-recipe.html", "description": "To celebrate the first week of fall, I decided to break out the old Dutch oven and do some braising. Thumbing through the pages of Gourmet Today by Ruth Reichl and John Willoughby, I opted for Braised Short Ribs with...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Beef", "Braising and Stewing", "Cook the Book"], "recipeIngredient": ["1 (750-ml) bottle dry red wine", "4 pounds beef short ribs, cut into 2 1/2-inch lengths by the butcher", "Salt and freshly ground black pepper", "2 tablespoons olive oil", "10 shallots, trimmed, leaving the root ends intact, and halved lengthwise", "3 tablespoons whole grain Dijon mustard", "6 plum tomatoes, halved lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the wine in a 2-quart heavy sauce pan, uncovered, until reduced to about 1 cup, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pat the ribs dry and sprinkle with 1 tablespoon salt and 1/2 teaspoon pepper.  Heat the oil in a 5-quart heavy pot over moderately high heat until hot but not smoking.  Add the ribs in 2 batches and cook, turning occasionally, until browned on all sides, about 8 minutes per batch.  Transfer with tongs to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to moderate, add the shallots to fat remaining in pot, and cook, stirring occasionally, until browned, about 5 minutes.  Transfer with a slotted spoon to another bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir reduced wine and mustard into the juices in the pot.  Add the ribs, meat side down, cover tightly, and simmer, for 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently stir shallots and tomatoes into the braised rib mixture and continue to simmer, covered, without stirring, until meat is very tender, about 1 hour more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully transfer the ribs, shallots, and tomatoes to a platter.  Skim off fat from cooking liquid.  Liquid should coat a spoon and measure about 1 cup; if necessary, boil to reduce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the sauce with salt and pepper and pour over ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong> The shallots can be browned and the ribs braised in the wine and mustard up to 1 day ahead.  Cool, uncovered, skim off some of the fat from the surface of the braising liquid.  Bring the rib mixture to a boil, covered, then gently stir in the shallots and tomatoes.  Reduce the heat and simmer until the meat is very tender, about 40 minutes.</small></p>"}]}