{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/bottega.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bottega Favorita", "caponata", "Cook the Book", "eggplant", "Frank Stitt", "Italian", "sicilian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bottega Caponata", "link": "https://www.seriouseats.com/recipes/2009/05/bottega-caponata-recipe-sicilian-italian.html", "description": "There are many things I ate in Sicily that I cannot replicate at home. Pasta con le Sarde, with its bizarre but awesome combination of sardines, currants, and fennel; Cassata, the tooth-achingly sweet cake made of ricotta, sponge cake, and...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["About 1/2 cup olive oil", "2 large globe eggplants, or 3 small Japanese eggplants, cut into 1-inch cubes", "2 garlic cloves, crushed", "1 dried red chile pepper", "4 thyme springs", "1/2 cup loosely packed basil leaves, chopped (reserve 2 basil stems)", "1 large red onion, cut into 1-inch dice", "Kosher salt and freshly ground black pepper", "2 tablespoons good quality red wine vinegar or sherry vinegar, or to taste", "2 red bell peppers, cored, seeded, and cut into 1-inch squares", "1 yellow bell pepper, cored, seeded, and cut into 1-inch squares", "1 green bell pepper, cored, seeded, and cut into 1-inch squares", "2 cups crushed seeded canned San Marzano tomatoes", "3 celery stalks, cut into 1-inch pieces, blanched in boiling water until just tender, cooled in ice water, and drained", "3 tablespoons capers", "1/2 cup Picholine or large Greek or Sicilian olives, halved and pitted", "1 tablespoons sugar, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast-iron skillet over high heat for about 3 minutes. Add 1 tablespoon of the olive oil to coat the bottom of the pan. Working in batches, add the eggplant in a single layer and cook, undisturbed, until deep brown on the first side. Turn and cook, turning occasionally, until well browned on all sides and tender. Transfer the eggplant to a paper towel-lined plate to cool. Add more oil to the pan as needed as you cook the remaining batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the olive oil in a large saute pan over medium heat. Toss in 1 garlic clove, the dried chile, 1 thyme sprig, and a basil stem. Add the onion, and cook for 5 minutes. Season with a pinch of salt and a few grinds of pepper, and add 1 tablespoon of the vinegar. Cook for another 5 minutes, or until the onion is translucent and tender but has not taken on any color. Transfer the onion to a large bowl; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the pan, add 1 more tablespoon olive oil, and heat over medium-high heat. Add the remaining garlic clove, 1 thyme sprig, and a basil stem, then add the bell peppers and cook for 5 minutes. Add a pinch of salt, pepper, and the remaining tablespoon of vinegar and cook for 6 to 7 minutes, or until the peppers are tender; be careful not to let them brown. Transfer to the bowl with the onions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggplant, tomatoes, celery, capers, and the olives to the onions and peppers, mix well, and taste. Adjust the seasonings by adding sugar, vinegar, salt and pepper as necessary. The caponata should have a subtle sweet-and-sour flavor.  Sprinkle with the chopped basil, remaining thyme leaves, and a few tablespoons of olive oil and stir to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or at room temperature.</p>"}]}