{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110610clafoutiprimary.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["baking", "brunch", "Cook the Book", "eggs", "Nicole Rees"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Brunch Clafouti", "link": "https://www.seriouseats.com/recipes/2009/01/brunch-clafouti-recipe.html", "description": "Essentially a fruit-studded baked custard, clafouti is typically eaten as a dessert. But its egginess, writes <strong>Nicole Rees</strong>, author of <a href=\"http://www.amazon.com/exec/obidos/0470149116/?tag=serieats-20\">Baking Unplugged</a>, also makes it ideal for brunch. The dish is especially suited to lazy Sunday mornings because it requires nothing more than a minute or two of whisking, and twelve minutes in the oven.", "totalTime": "", "recipeYield": "3 to 4 servings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1/2 cup all-purpose flour", "1/4 cup sugar, divided (if using cranberries, double the sugar)", "1/4 teaspoon salt", "3 large eggs", "1 cup (scant) whole or 2% milk", "1/2 teaspoon vanilla extract", "1/8 teaspoon almond extract (optional)", "1 tablespoon unsalted butter", "1 1/2 cup fresh fruit, such as pitted cherries or raspberries", "3 tablespoons brandy, amaretto, Grand Marnier, or Cointreau—whatever you have on hand", "Powdered sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F. Place an ovenproof 9-inch or 10-inch skillet over medium heat for a minute or two to get hot. Meanwhile, in a medium bowl, whisk together the flour, 2 tablespoons of the sugar, and the salt. Gradually whisk in the eggs until the mixture is smooth and lump free. Whisk in the milk and extracts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in the hot skillet, swirling to coat evenly. Sprinkle the remaining sugar over the butter and then add the fruit to the pan. Increase the heat to medium-high and saute, shaking the pan frequently, until the fruit softens and the juices and sugar form a thick syrup, about 3 minutes for most fruit, longer for cranberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat and add the brandy to the pan, shaking the pan to coat the fruit evenly. Pour the egg batter into the pan. Bake in the upper third of the oven for 10 to 12 minutes, until puffed on the sides and fully cooked in the center (check with the tip of a knife). Serve warm with a dusting of powdered. </p>"}]}