{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "Vietnamese", "keywords": ["Andrea Nguyen", "Into the Vietnamese Kitchen", "recipe newsletter", "salads", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spicy Cabbage and Chicken Salad", "link": "https://www.seriouseats.com/recipes/2009/01/spicy-cabbage-and-chicken-salad-recipe.html", "description": "The following recipe is from the January 7th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! After the excesses of the holiday season, this fat-free Vietnamese slaw is the perfect recipe with...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Salads", "Vietnamese"], "recipeIngredient": ["1 teaspoon salt", "2 boneless, skinless chicken breasts, 1/2 pound total", "1 small red onion, thinly sliced", "About 3/4 cup distilled white vinegar", "1 small head green cabbage, about 1 pound, quartered through the stem end, cored, and cut crosswise into 1/4-inch-wide ribbons", "1 carrot, peeled and finely shredded", "2 tablespoons finely chopped fresh cilantro", "<strong>For the dressing:</strong>", "1 or 2 Thai or serrano chiles, chopped", "1 clove garlic, chopped", "1/2 teaspoon sugar", "Pinch of salt", "3 tablespoons fish sauce", "6 tablespoons unseasoned Japanese rice vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a saucepan half full with water, add the salt, and bring to a rolling boil over high heat. Drop in the chicken breasts. When the water starts bubbling at the edges of the pan, remove the pan from the heat and cover tightly. Let stand for 20 minutes. The chicken should be firm yet still yield a bit to the touch. Remove the chicken from the pan and reserve the light stock for another use or discard. When cool enough to handle, shred with your fingers into thin pieces, pulling the meat along its natural grain. Put the chicken in a large bowl and let it cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the onion in a small bowl and add the white vinegar just to cover. Set aside for 15 minutes; the vinegar will reduce the harshness of the onion. Drain well and add to the bowl with the chicken, along with the cabbage, carrot, and Vietnamese coriander. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dressing, using a mortar and pestle, mash the chiles, garlic, sugar and salt together into a fragrant orange-red paste. This releases and combines the oils from the chile and garlic. Scrape the paste into a bowl and add the fish sauce and rice vinegar, stirring to dissolve the sugar and salt and to combine well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, pour the dressing over the salad and toss to mix well. The salad will wilt slightly. Taste and adjust the flavors to your liking, balancing the sour, sweet, salty, and spicy. Transfer to a serving plate, leaving any unabsorbed dressing behind, and serve.</p>"}]}