{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091018_fall_fruit_compote.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["compote", "fruit", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Fall Fruit Compote", "link": "https://www.seriouseats.com/recipes/2009/10/sunday-brunch-fall-fruit-compote-breakfast-fruit-salad-recipes.html", "description": "[Photo: Robin Bellinger] In casting about for a fruit salad that outshines your typical melon-grape-sad-strawberry combination, I came across this fall fruit compote in Chez Panisse Desserts. It's awfully sweet, and so maybe not quite right to serve as fruit...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Fruit"], "recipeIngredient": ["1/2 cup plus 2/3 cup sugar", "1/2-inch piece vanilla bean", "1 quince (about 10 ounces)", "1 strip lemon zest", "1 pound firm, ripe Bosc pears", "10 ounces ripe figs, black or green", "1/4 to 1/3 half-pint basket raspberries", "Lemon juice to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Poach the quince first: Make a syrup of 1 cup water, 1/2 cup sugar, and the bit of vanilla bean in a non-corroding saucepan. Quarter, core, and peel the quince, cut it into 1/2-inch slices, and add it to the syrup. Bring to a simmer, cover, and cook, barely simmering, for about 2 1/2 hours, until the slices are a deep rose color. Don't stir: instead, push them gently under the liquid from time to time so the slices don't break up. When cooked, chill the quince slices in their poaching liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Poach the pears: Make a syrup of 2 cups water, 2/3 cup sugar, and the strip of lemon zest. Halve, peel, and core the pears. Put them into the simmering syrup and cook, barely simmering and covered, for 20 to 30 minutes, or until they are tender and translucent but not falling apart. Chill them in all but 1 cup of their syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Poach the figs: Take 1 cup of the syrup the pears were poached in and heat it to a simmer. Rinse the figs, cut off any tough tips from their stem ends, add to the syrup, and again barely simmer for 10 to 12 minutes, or until they are heated through. (Be careful not to overcook; I did, and they got a bit mushy.) Then chill the figs in their syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve the compote, slice the pears lengthwise into pieces about 1/3 inch thick. Arrange the poached fruits and the raspberries as prettily as you can. Add enough of the quince syrup to the pear syrup to turn it pale pink and add lemon juice to taste. Pour some of the syrup over the fruit and serve cold.</p>"}]}