{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090102intothevietnamesekitchen_cover.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "Vietnamese", "keywords": ["Andrea Nguyen", "bánh mì", "Cook the Book", "Into the Vietnamese Kitchen", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Banh Mi with Daikon and Carrot Pickle", "link": "https://www.seriouseats.com/recipes/2009/01/banh-mi-with-daikon-and-carrot-pickles-recipe.html", "description": "A baguette sandwich commonly made with pâté, cilantro and pickled vegetables, the banh mi is a happy collision of Asian and French flavors. Fill it with any strongly flavored cooked meat or even firm tofu. Andrea Nguyen's banh mi how-to,...", "totalTime": "", "recipeYield": "1 sandwich", "recipeCategory": ["Cook the Book", "Sandwiches", "Vietnamese"], "recipeIngredient": ["1 petite baguette roll or 7-inch section from a regular baguette", "Mayonnaise", "Maggi Seasoning sauce or light (regular) soy sauce", "Liver pâté, boldly flavored cooked meat, and/or firm tofu, sliced and at room temperature", "3 or 4 thin, seeded cucumber strips, preferably English", "2 or 3 sprigs cilantro, coarsely chopped", "3 or 4 thin slices jalapeno chile", "1/4 cup Everyday Daikon and Carrot Pickle (recipe follows)", "1 large carrot, peeled and cut into thick matchsticks", "1 pound daikons, each no larger than 2 inches in diameter, peeled and cut into thick matchsticks", "1 teaspoon salt", "2 teaspoons plus 1/2 cup sugar", "1 1/4 cups distilled white vinegar", "1 cup lukewarm water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slit the bread lengthwise, leaving it attached on the back side. Using your fingers or a bread knife, hollow out the insides, making a trough in each half. Discard the insides or save for another use, such as bread crumbs. If the bread is soft, crisp it briefly in a toaster oven preheated to 325F, and then let it cool for a minute before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously spread the cut sides of the bread with mayonnaise and then drizzle with Maggi or soy sauce. Layer the meat, cucumber, cilantro, chile, and pickle on the bottom half. Close the sandwich, cut in half crosswise for easy eating, and enjoy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Everyday Daikon and Carrot Pickle</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 3 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the carrot and daikons in a bowl and sprinkle with the salt and 2 teaspoons of the sugar. Use your hands to knead the vegetables for about 3 minutes, expelling the water from them. They will soften and liquid will pool at the bottom of the bowl. Stop kneading when you can bend a piece of daikon so that the ends touch but the daikon does not break. The vegetables should have lost about one-fourth of their volume. Drain in a colander and rinse under cold running water, then press gently to expel extra water. Return the vegetables to the bowl if you plan to eat them soon, or transfer them to a 1-quart jar for longer storage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the brine, in a bowl, combine the 1/2 cup sugar, the vinegar, and the water and stir to dissolve the sugar. Pour over the vegetables. The brine should cover the vegetables. Let the vegetables marinate in the brine for at least 1 hour before eating. They will keep in the refrigerator for up to 4 weeks.</p>"}]}