{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["Beyond the Great Wall", "Cook the Book", "rice puddings", "Tibetan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tibetan Rice Pudding", "link": "https://www.seriouseats.com/recipes/2009/03/tibetan-rice-pudding-recipe.html", "description": "The following recipe is from the March 18 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Known as de-sil in Tibetan, this rice pudding uses broken rice. Widely available in Asian markets,...", "totalTime": null, "recipeYield": "6, makes about 6 cups", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["3 cups water", "1 cup broken rice", "Pinch of salt", "3 cups whole milk", "1/2 cup packed dried apples, preferably organic, chopped into 1/2-inch or smaller pieces", "3 tablespoons clover honey or other flower honey, or more to taste", "2 tablespoons butter, or to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a boil in a small heavy pot. Place the rice in a sieve and rinse with cold water to clean it, then sprinkle into the boiling water. Bring back to a boil, then lower the heat to medium-low and cook, covered, until most of the water is absorbed and the rice is soft, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt, then stir in the milk and apples. Raise the heat and bring back nearly to a boil, then reduce to the heat to very low, cover, and simmer for 45 minutes to 1 hour, stirring occasionally with a wooden spoon to make sure the rice is not sticking; after about 30 minutes, add the honey and stir it in. When cooked, the pudding will be very thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving; stir in the butter, if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Note on Reheating</h5> "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If left to stand for any time after cooking, the pudding will thicken even more. To reheat it or to loosen the texture. place over low heat, and stir in up to 1 cup more milk (as well as the optional butter). Stir frequently as the pudding warms, to prevent sticking.</p>"}]}