{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090302-walnut.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["bread", "breadmaking", "Cook the Book", "Kneadlessly Simple", "Nancy Baggett", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: French Walnut Bread", "link": "https://www.seriouseats.com/recipes/2009/03/kneadlessly-simple-nancy-baggett-french-walnut-bread-recipe.html", "description": "In Nancy Baggett's Kneadlessly Simple index, this recipe rates a \"Super Easy\": short ingredient list, one-stage mixing, and no hand-shaping. The fussiest part of the whole process is toasting the walnuts to intensify their flavor. French walnut bread, or pain...", "totalTime": null, "recipeYield": "1 large loaf, 12 to 14 slices", "recipeCategory": ["Bread", "Cook the Book", "Nuts"], "recipeIngredient": ["2 cups (10 ounces) whole wheat flour, plus extra as needed", "2 cups (10 ounces) unbleached all-purpose white flour or white bread flour", "1 teaspoon granulated sugar", "2 teaspoons table salt", "3/4 teaspoon instant, fast-rising, or bread machine yeast", "2 cups ice water, plus more if needed", "Walnut oil or flavorless vegetable oil for coating dough top and baking pot", "1 1/2 cups fresh, fine-quality walnut halves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First rise:</strong> In a large bowl, thoroughly stir together the whole wheat and white flour, sugar, salt, and yeast. Vigorously stir in the water, scraping down the bowl and mixing until the dough is well blended and smooth. If the mixture is too dry to incorporate all the flour, a bit at a time, stir in just enough water to blend the ingredients; don't over-moisten, as the dough should be very stiff. Brush or spray the top with oil. Tightly cover the bowl with plastic wrap. If desired, for best flavor or for convenience, you can refrigerate the dough for 3 to 10 hours. Then let rise at cool room temperature for 12 to 18 hours.</p>\n\n<p>Meanwhile, reserve 4 perfect walnut halves for garnish. Spread the remainder on a baking sheet and lightly toast, stirring several times, in a preheated 325°F oven for 10 to 15 minutes, or until fragrant and just lightly browned. Let cool. Chop finely (in a food processor, if desired).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Second rise: </strong>Vigorously stir the cooled walnuts into the dough. If it is not stiff, stir in enough more whole wheat flour to make it hard to stir. Using an oiled rubber spatula, lift and fold the dough in towards the center, working all the way around the bowl, Invert it into a well-oiled, then flour-dusted, 3 quart (or larger) heavy metal pot (or use a flat-bottomed round casserole with a lid). Brush or spray the top with oil, then smooth out the surface with an oiled rubber spatula or fingertips. Cut 1/2-inch-deep slashes to form an x in the center top; well-oiled kitchen shears work best. Put the 4 untoasted walnut halves in the angles of the \"x\" for garnish: press down very firmly to embed them. Cover the pot with its lid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Let rise using any of these methods: </strong>For a 1 1/2- to 2 1/2-hour regular rise, let stand at warm room temperature; for a 1- to 2-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water; or for an extended rise, refrigerate for 4 to 24 hours, then set out at room temperature. Continue until the dough doubles from its deflated size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking preliminaries: </strong> 15 minutes before baking time, place a rack in the lower third of the oven; preheat to 400°F. Lightly dust the dough top with whole wheat flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Bake on the lower rack, covered, for 45 minutes. Remove the lid and continue baking for 20 to 30 minutes, or until the top is well browned and a skewer inserted in the thickest part comes out with just a few particles clinging to the bottom (or until the center registers 207 to 210°F on an instant-read thermometer). Then bake for 5 minutes more to ensure the center is done. Cool in the pan on a wire rack for 10 minutes. Remove the loaf to the rack, running a knife around the edges to loosen it, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving and storing:</strong> The loaf tastes and slices best at room temperature. Cool completely before storing airtight in plastic or foil. The bread will keep at room temperature for up to 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}