{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apples", "beer", "Cook the Book", "desserts", "fritters", "Karen DeMasco", "The Craft of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Apple Fritters", "link": "https://www.seriouseats.com/recipes/2009/10/apple-fritters-karen-demasco-recipe.html", "description": "The batter has two leavening agents, beer and whipped egg whites, which make for light and airy fritters. The apple slices sit in a cinnamon and sugar mixture for just enough time to absorb the flavors without turning mushy. These fritters have all the wonderful appley qualities of an apple-filled doughnut minus that cloyingly sweet gooey apple filling.", "totalTime": null, "recipeYield": "10", "recipeCategory": ["Apple", "Breakfast Sweets", "Cook the Book", "Desserts", "Doughnuts"], "recipeIngredient": ["3/4 cup plus 2 tablespoons unbleached all purpose flour, sifted", "1/4 cup plus 7 tablespoons sugar", "1 1/4 teaspoons ground cinnamon", "Kosher salt", "2 large eggs, separated", "1 1/2 teaspoons unsalted butter, melted", "1 teaspoon pure vanilla extract", "1/2 cup beer (lager or pilsner)", "1 large firm baking apple, such as Granny Smith, Mutsu, or Crispin", "Peanut oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk together the flour, 1/4 cup of the sugar, 1/2 teaspoon of the cinnamon, and 1 teaspoon salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the egg yolks, butter, and vanilla.  Whisk in one third of the flour mixture then  one  third of the beer to the egg yolk mixture, just to combine.  Add the rest of the flour mixture and beer in two additions; whisk well to combine.  Set the batter aside to rest for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the batter is resting, peel, core, and slice the apple into ten 1/8-inch-thick rings.  Spread out the rings on a large plate.  Stir together 1 tablespoon of the sugar and 1/4 teaspoon of the cinnamon, and sprinkle the mixture over the apple slices.  Let the slices sir for 20 minutes to soften and absorb the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the egg whites to soft peaks, and gently but thoroughly fold them into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide, shallow bowl, whisk together the remaining 6 tablespoons sugar, remaining 1/2 teaspoon cinnamon, and a pinch of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a high-sided skillet or wide pot with 2 inches of oil, and heat the oil to 375&degF.  In batches, dip the apple rings into the batter to coat both sides, and fry, turing once, until the fritters are golden and crisp, about 3 minutes.  Drain on paper towels, immediately toss in the cinnamon-sugar mixture, and serve warm.</p>"}]}