{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["baking", "breadmaking", "breads", "cheddar", "Cook the Book", "Kneadlessly Simple", "Nancy Baggett"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cheddar and Chile Bread", "link": "https://www.seriouseats.com/recipes/2009/03/kneadlessly-simple-nancy-baggett-cheddar-and-chile-bread-recipe.html", "description": "Cheddar and chile bread rounds off a week of Nancy Baggett's Kneadlessly Simple bread recipes. It's a wonderfully savory, Tex-Mex-inspired bread, shot through with morsels of cheese and chile. The best part? The fuss-free, easily mixed ingredients have earned the...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 1/2 cups (17.5 ounces) unbleached white bread flour, plus more as needed", "1 tablespoon granulated sugar", "1 1/2 teaspoons table salt", "1 teaspoon instant, fast-rising, or bread machine yeast", "2 tablespoons corn oil, canola oil, or other flavorless vegetable oil, plus extra for coating dough top and baking pan", "1 2/3 cups ice water, plus more if needed", "8 ounces (3 lightly packed cups) coarsely grated very sharp cheddar cheese, preferably white cheddar", "1/2 cup very well-drained and patted dry chopped canned green chiles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First rise:</strong> In a large bowl, thoroughly stir together the flour, sugar, salt, and yeast. In another bowl or measuring cup, whisk the oil into the water. Thoroughly stir the mixture into the bowl with the flour, scraping down the sides until the ingredients are thoroughly blended. If the mixture is too dry to incorporate all the flour, a bit at a time, stir in just enough more ice water to blend the ingredients; don't over-moisten, as the dough should be stiff. If necessary, stir in enough more flour to stiffen it. Brush or spray the top with oil. Cover the bowl with plastic wrap. If desired, for best flavor or for convenience, you can refrigerate the dough for 3 to 10 hours. Then let rise at cool room temperature for 15 to 20 hours. IF convenient, stir the dough once partway through the rise. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Second rise:</strong> Vigorously stir the dough, gradually sprinkling over and incorporating the cheese and chiles. Fold them in very thoroughly to ensure they are evenly distributed. If necessary, thoroughly stir in enough more flour to yield a very stiff dough. Using a well-oiled rubber spatula, fold the dough in towards the center, working all the way around the bowl. Invert the dough into a well-greased 9x5-inch loaf pan. Evenly brush or spray the dough top with oil. Using well-oiled kitchen shears or a serrated knife, make a 1/4-inch-deep slash lengthwise down the center of the loaf. Cover the pan with nonstick spray-coated plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Let rise using any of these methods:</strong> For a 1 1/2- to 2 1/2-hour regular rise, let stand at warm room temperature; for a 1- to 2-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water; or for an extended rise, refrigerate for 4 to 24 hours, then set out at room temperature. Continue the rise until the dough nears the plastic. Remove it and continue until the dough reached 1/2 inch above the pan rim.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking preliminaries:</strong> 15 minutes before baking time, place a rack in the lower third of the oven; preheat to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Reduce the heat to 400°F. Bake for 30 to 40 minutes, until the top is nicely browned; cover the top with foil as needed. Continue baking for 20 to 30 minutes longer, or until a skewer inserted in the thickest part comes out with just a few particles clinging to the bottom (or until the center registers 204 to 206°F Fahrenheit on an instant-read thermometer). Then bake for 5 minutes more to be sure the center is done. Cool in the pan on a wire rack for 10 minutes. Turn out the loaf onto the rack; cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving and storing:</strong> Cool thoroughly before slicing or storing. Store airtight in plastic or aluminum foil. The bread will keep at room temperature for 2 to 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}