{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["Cook the Book", "eggs", "frisée", "Sisha Ortuzar", "Tom Colicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fried Eggs with Bacon, Gorgonzola, and Frisee", "link": "https://www.seriouseats.com/recipes/2009/04/draftcook-the-book-fried-eggs-with-bacon-gorg.html", "description": "Inspired by the classic frisée aux lardons, this recipe takes the salad and translates it into an elegant sandwich. For me, it's just another excuse to eat a bacon, egg, and cheese (BEC) sandwich for dinner. (I've done it before,...", "totalTime": "", "recipeYield": "4 sandwiches", "recipeCategory": ["Bacon", "Cook the Book"], "recipeIngredient": ["8 thick slices bacon", "4 ciabatta rolls", "4 tablespoons gorgonzola dolce or other mild blue cheese", "2 cups frisee lettuce", "1 teaspoon extra-virgin olive oil", "1 teaspoon red wine vinegar", "Kosher salt and freshly ground black pepper", "2 tablespoons unsalted butter", "8 large eggs, preferably pasture-raised"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy ovenproof skillet over medium-high heat, cook the bacon until golden brown and crisp on both sides. Transfer to paper towels to drain. Slice the ciabatta rolls in half. Evenly spread 1 tablespoon of the gorgonzola on each bottom slice of bread and place all the bread slices into the oven. While the bread is toasting, toss the frisee in the oil and vinegar, and add salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-hot skillet, melt the butter and fry the eggs, two to four at a time (depending on the size of your skillet). Flip the eggs halfway through and cook until the yolks are solid around the edges and oozy in the middle. Season the eggs with salt and pepper. Once the bread is toasted and the cheese has melted, remove the bread from the oven. Place the eggs on top of the gorgonzola, followed by the bacon, and finally the dressed frisee. Close the sandwiches and serve.</p>"}]}