{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "French", "keywords": ["Balthazar", "brunch", "croutons", "French", "frisée aux lardon", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Balthazar's Frisee aux Lardons", "link": "https://www.seriouseats.com/recipes/2009/07/frisee-aux-lardons.html", "description": "A frisée aux lardons salad is one of my favorite bacon-and-egg combinations. I know I bore my friends when I order it just about every time I go to the quintessential New York downtown brasserie Balthazar (where the exemplary cooking...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "Breakfast and Brunch", "Eggs", "French", "Salads"], "recipeIngredient": ["6 slices of stale brioche", "4 heads of frisee, cored, rinsed, spun dry, and torn into bite-size pieces", "1 tablespoon plus 1/2 cup sherry vinegar", "1/2 pound slab bacon (rind removed), cut into 1/2-inch lardons", "1/2 cup olive oil", "1/2 teaspoon salt, plus more to taste", "1/4 teaspoon freshly ground black pepper, plus more to taste", "3 tablespoons fine herbs (parsley, chervil, chives, and tarragon finally chopped together) ", "6 large eggs", "Sea salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the crusts from the bread cut into 1/2-inch cubes. Place on a sheet tray and bake in the oven until golden brown, about 10 minutes. Shake the pan halfway through to toast evenly. Combine the croutons in a large bowl with the clean frisee.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pan for poaching the eggs: Fill a wide-straight-sided saute pan with water (about two-third fulls) and add the tablespoon of vinegar. Over a medium-high flame, bring to a gentle simmer, and adjust the heat to maintain it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a dry skillet or saute pan over medium heat, brown the lardons well on all sides, about 10 minutes. Add the minced shallots and continue to cook for 2 to 3 minutes, to soften and lightly brown them. Without pouring off the fat, add the 1/2 cup of vinegar to the pan. Bring to a boil, using a wooden spoon to scrape any delicious bits that have caramelized on the surface of the pan. When the vinegar has reduced by half, about 3 minutes, turn off the flame. Add the olive oil, salt and pepper, and stir well to combine. Pour this warm vinaigrette with bacon into the bowl of frisee, along with the croutons and fine herbes. Toss well to combine. Divide the salad almong 6 serving plates, piled into small heaps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs, one at a time, into a small saucer and then slide them into the simmering water. Poach for 4 minutes, resulting in a set white and a cooked but runny yolk. With a slotted spoon, scoop out the poached eggs, one at a time, drain, and position on top of each pile of frisee. Sprinkle with crunchy sea salt (kosher salt will do in a pinch-ha, ha) and a few turns of a peppermill. Serve immediately. </p>"}]}