{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091216-apricot-glazed-pork-tenderloin.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["apricot", "grill", "grilling", "holiday recipes", "pork", "pork tenderloin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Apricot-Glazed Pork Tenderloin", "link": "https://www.seriouseats.com/recipes/2009/12/grilling-apricot-glazed-pork-tenderloin-recipe.html", "description": "Each week Joshua Bousel of The Meatwave drops by with a recipe for you to grill over the weekend. Fire it up, Joshua! [Photograph: Joshua Bousel ] I've noticed a very strong \"glazed\" theme with my recipe choices over the...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Apricot", "Grilling", "Pork"], "recipeIngredient": ["2 pork tenderloins (about 12 ounces each), trimmed of silver skin and excess fat", "1 tablespoon olive oil", "Coarse salt and ground pepper", "1 jar (10 to 12 ounces) apricot jam, (about 1 cup)", "1/4 cup spicy brown mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. While the charcoal is lighting, whisk together jam and mustard in a small saucepan. Cook over medium heat until jam melts, 3 to 4 minutes; remove from heat. Transfer half to a small bowl for brushing. Cover pan to keep remaining sauce warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the charcoal is lit and covered with gray ash, pour out and spread coals evenly over the charcoal grate. Clean and oil the cooking grate. Rub pork with oil; season with salt and pepper. Place the tenderloin on the grill and cook until it registers 150 degrees on an instant-read thermometer, turning 4 times during cooking to brown all sides, about 15-20 minutes. In the last 5 minutes of cooking, brush the pork with the reserved sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pork loosely with foil; let rest 5 minutes before slicing. Serve drizzled with warm sauce. </p>"}]}