{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["asparagus", "brunch", "diabetes", "eggs", "hard-cooked eggs", "salads", "Tom Valenti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Asparagus Salad With An Egg White Dressing", "link": "https://www.seriouseats.com/recipes/2009/06/sunday-brunch-asparagus.html", "description": "I was very moved recently by a Talk thread involving a member of the Serious Eats community being diagnosed with type 2 diabetes. One of the many heartfelt comments mentioned in Tom Valenti's (and Andrew Friedman's) new You Don't Have...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Asparagus", "Breakfast and Brunch", "Eggs", "Salads", "Vegetarian"], "recipeIngredient": ["20 large asparagus spears (about 1 pound), peeled with ends trimmed", "5 large hard-cooked eggs", "1/4 cup minced red onion", "2 tablespoons full-fat mayonnaise", "1 rib celery, finely diced", "1 tablespoon freshly squeezed lemon juice", "1 tablespoon chopped fresh flat-leaf parsley leaves", "2 teaspoons Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hard-cook the eggs. To do so, put them in a small, heavy-bottomed pot and cover them with cold water. Set the pot over high heat and bring to a boil. Turn off the heat and cover the pot for 15 minutes. Drain the hot water and run cold water over the eggs until cooled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium-size pot of water to a boil over high heat. Fill a large bowl halfway with ice water</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the asparagus in the boiling water until al dente, about 8 minutes. Use tongs to remove the asparagus from the pot and transfer it to the ice water to stop the cooking and preserve the color. Once the asparagus has cooled, drain it and pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the eggs, cut them in half, and separate the whites from the yolks. Mince all of the whites and 2 of the yolks and set them aside separately. (Discard the remaining 3 yolks or save them for another use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the onion, mayonnaise, celery, lemon juice, parsley, mustard, and 1 tablespoon of water in a bowl and whisk together until blended. Gently  stir the egg whites into the dressing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, put 5 asparagus stalks on each of 4 plates. Spoon the dressing over the asparagus and garnish with the minced egg yolks. </p>"}]}