{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110611orbitcakepr.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["cakes", "chocolate", "Cook the Book", "david lebovitz", "John Scharffenberger", "Robert Steinberg", "Scharffen Berger", "The Essence of Chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: David Lebovitz's Orbit Cake", "link": "https://www.seriouseats.com/recipes/2009/02/david-lebovitz-scharffen-berger-chocolate-orbit-cake-recipe.html", "description": "<strong>John Scharffenberger</strong> loves this cake and includes it in <a href=\"http://www.amazon.com/Essence-Chocolate-Recipes-Baking-Cooking/dp/1401302386/?tag=serieats-20\"><em>The Essence of Chocolate</em></a> because it places the flavor of good chocolate front and center. With only four ingredients, the recipe really is idiot-proof, and the resulting cake is almost like a ganache pudding, just solid enough to slice.", "totalTime": null, "recipeYield": "12 to 14", "recipeCategory": ["Bake the Book", "Cakes", "Chocolate", "Cook the Book", "Desserts"], "recipeIngredient": ["14 tablespoons (7 ounces) unsalted butter, cut into 1/4-inch cubes, plus more for the pan", "10 ounces 62% semisweet chocolate, finely chopped", "5 large eggs", "1 cup granulated sugar", "Whipped cream to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and preheat the oven to 350 degrees F. Lightly butter a 9 by 2-inch round cake pan and line the bottom with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the butter and chocolate in the top of a double boiler set over gently simmering water. Whisk occasionally until the chocolate has melted and the mixture is smooth. Remove from heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the eggs and sugar. Gradually whisk in the melted chocolate mixture, and continue whisking until thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan. Place the pan in a larger baking pan, and cover the top of the cake pan with foil. Add enough very hot water to the baking pan to come halfway up the sides of the cake pan, and bake for 1 hour and 15 minutes to 1 hour and 30 minutes, or until the cake has set. To test, touch the center of the cake lightly with your fingers: the surface will be slightly tacky, but your fingers should come away clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the cake pan from the water bath and place on a cooling rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan with plastic wrap and refrigereate for at least 2 hours or up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, run a knife around the edges of the cake to loosen the sides. Warm the bottom of the cake pan with a hot towel or over a gas burner, moving the pan constantly to heat the bottom evenly and loosen the cake. Invert onto a serving plate. Peel off the parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut into thin slices and serve each slice with a dollop of whipped cream.</p>"}]}