{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-lettucecups.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "healthy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Minced Chicken in Lettuce Cups", "link": "https://www.seriouseats.com/recipes/2009/02/minced-chicken-in-lettuce-cups-recipe.html", "description": "After bumbling through the fridge for a few seconds, I laid eyes on a half-chicken and some Boston lettuce. Though the inspiration was quick, locating a recipe for \"chicken lettuce cups\" wasn't so easy. Suffice to say, when searching for...", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["2 pounds chicken, skin removed and bones removed", "1 1/2 tablespoons canola oil", "1 tablespoon ginger, minced", "1 tablespoon oyster sauce", "1/2 cup water chestnuts, drained and finely chopped", "2 scallions, white part diced and green part chopped", "1 cup cremini mushroom, chopped", "8 leaves Boston, bibb, or iceberg lettuce", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely dice the chicken.  I found a meat cleaver to work best, though a chefs knife will work, too. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a work or large iron skillet set over high heat.  Add the ginger and scallion whites and stir-fry until fragrant, about 15 seconds.  Dump in the chicken and mushrooms.  Continue stirring, breaking up the chicken pieces, and cook for about a minute, or until the chicken is white and no longer raw.  Pour in the oyster sauce and cook for 2 more minutes, stirring frequently. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat and add the scallion greens and chopped water chestnuts.  Stir until everything is combined.  Season with salt if necessary.  Fill each lettuce cup with a little bit of the mixture and serve.   </p>"}]}