{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090303olives.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["baking", "breadmaking", "breads", "Cook the Book", "herbs", "Kneadlessly Simple", "Nancy Baggett", "olives"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Rustic Cyprus-Style Herbed Olive Bread", "link": "https://www.seriouseats.com/recipes/2009/03/cook-the-book-kneadlessly-simple-rustic-cyprus-style-herbed-olive-bread-recipe.html", "description": "Photograph from prakhar on Flickr Think herbed olive bread and you probably think rosemary. But this Cypriot version from Kneadlessly Simple goes in a different direction entirely, with chopped fresh cilantro, mint, and chives. The resulting loaf has a bright...", "totalTime": "", "recipeYield": "1 large loaf, 14 to 15 wedges or slices", "recipeCategory": ["Bread", "Cook the Book", "Olives"], "recipeIngredient": ["4 1/4 cups (21.25 ounces) unbleached all-purpose white flour, plus more as needed", "1 3/4 teaspoons table salt", "3/4 teaspoon instant, fast-rising, or bread machine yeast", "2 cups ice water, plus more if needed", "3 tablespoons chopped fresh cilantro leaves", "2 tablespoons chopped fresh mint leaves", "2 tablespoons chopped fresh chives or finely chopped scallion tops", "1/4 cup good-quality olive oil, plus more for brushing dough tops", "1/4 cup thoroughly drained, chopped (pitted) Kalamata olives", "About 3 tablespoons cornmeal for dusting baking pot"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First rise:</strong> In a large bowl, thoroughly stir together the flour, salt, and yeast. In another bowl or measuring cup, vigorously whisk together the water, cilantro, mint, and chives. Stir the mixture into the bowl with the flour until the dough is just lightly mixed. Then add the olive oil, scraping down the bowl sides and mixing until thoroughly blended. The dough should be very stiff; if necessary, add in enough more flour to stiffen it. Gently stir in the olives until evenly distributed throughout. Brush the top with oil. Tightly cover the bowl with plastic wrap. If desired, for best flavor or for convenience, you can refrigerate the dough for 3 to 10 hours. Then let rise at cool room temperature for 12 to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Second rise:</strong> Using an oiled rubber spatula, lift and fold the dough in towards the center all the way around until thoroughly loosened fro the bowl; don't deflate any more than necessary. Evenly brush the inside of a 3 1/2- to 4-qart Dutch oven or other heavy pot or large, deep, flat-bottomed ovenproof casserole with olive oil. Add the cornmeal, then tip the pot back and forth to distribute it on the sides. Invert the dough into the pot; don't worry if it's ragged-looking or lopsided. Shake the pot to center the dough. Brush the surface with olive oil. Top the pot with its lid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Let rise using any of these methods:</strong> For a 1 1/2- to 2 1/2-hour regular rise, let stand at warm room temperature; for a 1- to 1 1/2-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water; or for an extended rise, refrigerate for 4 to 24 hours, then set out at room temperature. Let rise until the dough has doubled from its deflated size. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Reduce the oven temperature to 425 degrees F. Bake on the lower rack, covered, for 55 to 60 minutes or until crisp and lightly browned. Brush the loaf with olive oil and continue to bake, uncovered, testing until the top is well browned and a skewer inserted in the thickest part comes ou with just a few crumbs on the tip (or until the center registers 207 to 208 degrees F on an instant-read thermometer), 12 to 15 minutes longer. Bake for 5 to 10 minutes more to ensure that the center is done. Cool in the pot on a wire rack for 15 minutes. Run a knife around the loaf and remove it to the rack; let cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving and storing: </strong>This loaf tastes good warm, but will cut better when cool. Cool completely before storing. To maintain the crisp crust, store draped with a clean tea towel or in a heavy paper bag. Or store airtight in a plastic bag or foil: The crust will soften, but can be crisped by heating the loaf, uncovered, in a 400-degree F oven for a few minutes. The bread will keep at room temperature for up to 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}