{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bolognese", "brisket", "Cook the Book", "Mark Peel", "New Classic Family Dinners", "pastas", "sauces", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bolognese Sauce", "link": "https://www.seriouseats.com/recipes/2009/11/bolognese-sauce-recipe.html", "description": "Bolognese is my favorite sauce for pasta, and from fall until spring I'll always have a batch on hand. It's an all day project that involves lots of chopping, browning, and slow simmering, but it's one that I enjoy immensely....", "totalTime": null, "recipeYield": "3 cups", "recipeCategory": ["Condiments and Sauces", "Cook the Book"], "recipeIngredient": ["<h5>Marinade</h5>", "3 pounds beef chuck or brisket, in 1 piece", "1 medium onion, coarsely chopped", "1 large carrot, peel and coarsely chopped", "2 stalks celery, coarsely chopped", "1/4 cup coarsely chopped fresh flat-leaf parsley", "2 cups red wine", "1 1/2 teaspoons cracked black peppercorns", "<h5>Sauce</h5>", "5 pounds tomatoes, or four 28-ounce cans plus 1 cup of liquid from the cans", "6 tablespoons extra virgin olive oil", "4 fat garlic cloves, halved, green shoots removed, and minced", "Kosher salt", "Freshly ground black pepper", "Canola oil", "3 ounces pancetta, diced", "2 cups homemade chicken stock (or 1 cup of canned broth and 1 cup of water)", "3 tablespoons extra virgin olive oil", "1 large carrot, peeled and cut into 1/4-inch dice", "2 large celery stalks, cut into 1/4-inch dice", "1 medium onion, cut into 1/4-inch dice", "4 fat garlic cloves, halved, green shoots removed, and thinly sliced", "A bouquet garni made with a handful each of parsley and thyme sprigs, and 2 bay leaves", "1 6-ounce can tomato paste, dissolved in 1/2 cup water (if using fresh tomatoes only)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the meat across the grain into roughly 2-inch pieces.  Toss with the coarsely chopped onion, carrot, celery, parsley, 1 cup of the red wine, and 1 teaspoon of the cracked pepper in a large bowl. Cover and refrigerate for 12 to 24 hours, stirring once after a few hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, preheat the oven to 400&deg;F. If using fresh tomatoes, cut the tomatoes in half at the equator. If using canned whole tomatoes, remove the liquid from the cans (do not discard the liquid in the cans), but do not cut.  Toss either fresh or canned tomatoes in a large bowl with 3 tablespoons olive oil, 4 minced garlic cloves, 1 teaspoon salt, and 1/4 teaspoon pepper. Place on a baking sheets and pour on the juice from the bowl, but not from the can. Fresh tomatoes should be cut side down. Roast for 45 minutes to an hour, until the tomatoes are soft and beginning to blister (45 minutes for canned tomatoes). Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, remove the meat from the stew and allow to cool until you can handle it. Shred the meat, using your fingers or 2 forks. Do not shred too finely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If possible, refrigerate the meat in a covered bowl and the stew in its pot over night. The next day, lift off the fat from the top of the stew and discard. If you do not have the extra day, use a ladle to skim off the fat from the top of the liquid in the pot and discard. Put the contents of the pot through a food mill fitted with a medium or fine screen (fine enough to keep out the tomato seeds) and return to the pot. Stir the meat back into the sauce and bring to a simmer over medium-low heat.</p>"}]}