{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090709-tongue.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["beef tongue", "offal", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "The Nasty Bits: Tongue Tied", "link": "https://www.seriouseats.com/recipes/2009/07/the-nasty-bits-tongue-lengua-en-salsa-verde.html", "description": "As a Nasty Bits lover, I'm willing to argue that those who dislike offal simply haven't had it prepared correctly. It's a large contention, I admit, and I'm sure my opponents will insist that it's not a matter of preparation,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Offal", "The Nasty Bits"], "recipeIngredient": ["1 pound (11 medium) fresh tomatillos, husked and washed", "Fresh hot green chiles to taste (2 jalapenos or 3 serranos)", "6 sprigs cilantro, roughly chopped", "1 small onion, chopped", "2 cloves garlic, chopped", "A few tablespoons lard", "Beef or chicken broth, as needed", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the tongue: Bring a large pot of water to boil; salt the water somewhat heavily, as you would for pasta. Wash the tongue, and place it in the boiling water. Put a bowl, or a weight of some sort, on top of the tongue to ensure that it will be entirely submerged in the water during cooking. Simmer for 2.5 to 3 hours.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tongue from the water and let it cool down for a bit.  Peel away the white casing surrounding much of the meat. The white layer is edible, but not very tasty. Depending on how much tongue you would like, slice it into segments about 1 inch long. One tongue will yield many servings.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, prepare the tomatillo sauce: Wash and dehusk the tomatillos. If you prefer the sauce to be milder, remove the seeds from the chiles.  Boil the tomatillos and chiles in salted water until tender, approximately 10 to 15 minutes.  Drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tomatillos and chiles in a blender or food processor, along with the cilantro, onion and garlic. Process until smooth, but still retaining a bit of texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a tablespoon of the lard in a skillet over medium heat.  When the skillet is hot enough to make a drop of the sauce sizzle, pour all of it in and stir constantly for about 5 minutes, until it becomes darker and thicker. Add the broth, return to a boil, reduce the heat and simmer until thick enough to coat a spoon, about 10 minutes.  Season with salt, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a few more tablespoons of lard in a skillet, and add the pieces of tongue. Brown lightly on all sides. Taste a piece and season with more salt if needed.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatillo sauce to the tongue, and simmer for a few minutes. Add a bit of stock if you see that the mixture is becoming too dry.  The dish will be ready when the tongue has absorbed some of the flavor and spiciness of the sauce. Serve immediately, with tortillas on the side.  </p>"}]}