{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feat-20090412-french-flash.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["choucroute", "French in a Flash", "sausage", "savoy cabbage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Choucroute Nouvelle", "link": "https://www.seriouseats.com/recipes/2009/04/french-in-a-flash-choucroute-nouvelle-recipe.html", "description": "In the avian world, it's the boys who must put on a show to attract a mate. But when my boyfriend, the avian biologist, comes over from England to see me, roles are reversed. It's I, the girl, who spreads...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cabbage", "French"], "recipeIngredient": ["12 links assorted large sausages (Andouille, Toulouse, Sweet Italian, etc.)", "2 tablespoons butter", "About 1 bottle Riesling", "Salt and pepper", "1 tablespoon apple cider vinegar", "1 tablespoon Riesling", "1 head Savoy cabbage, quartered, cored, and cut into 1/2-inch strips", "1 1/2 tablespoons butter, plus 1 tablespoon", "1 tablespoon olive oil", "20 chives, quartered", "2 tablespoons chopped fresh flat leaf parsley", "1 teaspoon whole grain mustard", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a sauté pan with high sides on medium heat.  Arrange the sausages in the pan, and brown for 2 minutes, until a little crust appears on the bottom sides.  While they're cooking, use the point of a sharp knife to stab each sausage three times along its length, leaving little nostrils for the sausages to \"breathe\" through while they cook.  At the end of the 2 minutes, flip the sausages and create the same holes on the reverse side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough Riesling to cover the sausages about 2/3 the way up.  You don't need to wait for the other side to brown.  Reserve at least 1/4 cup of the wine.  Turn the heat up to high.  Season the cooking liquid with salt and pepper.  Flip the sausages every so often as they cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow most of the wine to boil off.  After about 40 minutes, there will be very little liquid left, and it will be stained with sausage juices and thick.  The sausages will begin to brown in the butter from the beginning of the cooking process, so knock the heat down to medium.  Once they are sufficiently browned on one side, flip the sausages over, and brown for another couple of minutes on the other side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sausages are crisp and golden on both sides, remove them from the pan to a plate.  Add in the 1/4 cup of Riesling you reserved earlier, and whisk the pan sauce to a smooth consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Plate the choucroute by mounding the braised Savoy cabbage (recipe follows) in a large, wide bowl.  Then slice all the sausages in half on an angle and arrange them on top.  Pour the pan sauce down over the whole thing, and garnish with fresh flat leaf parsley.  Serve with Dijon mustard and cornichons, and, of course, warm baguette and another cool bottle of Alsatian Riesling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Mustard-Braised Savoy Cabbage for Choucroute</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil, then add the apple cider vinegar, Riesling, and a handful of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the strands of cabbage to the water, and blanch for 3 minutes.  Drain in a large colander, and run under cold water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the same pot to the stove over low heat, and add 1 1/2 tablespoons butter and the olive oil.  When the butter is melted, add the chives, parsley, and cabbage, and raise the heat to medium-high.  Season with salt and cracked black pepper.  Saute for 5 minutes until most of the excess water has evaporated.  Stir in the mustard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the braised cabbage in a large bowl, and top with the remaining tablespoon of butter.  Toss to coat as the butter melts, and top the Savoy cabbage with the sausage halves and their pan sauce.</p>"}]}