{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090820-meatless-thumb.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "", "keywords": ["entrees", "grilling", "poblanos", "salads", "Seriously Meatless", "tofu", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Meatless: Grilled Entree Salad of Poblanos, Zucchini and Tofu", "link": "https://www.seriouseats.com/recipes/2009/08/grilled-entree-vegetarian-salad-poblanos-zucchini-tofu.html", "description": "Note: Serious Eater Michael Natkin of the vegetarian blog Herbivoracious drops by every Wednesday to share a delicious recipe to expand our vegetarian repertoire. In these dog days of summer, everyone likes to eat a little lighter and keep hot...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Seriously Meatless", "Tofu", "Vegetarian"], "recipeIngredient": ["<small>For the dressing</small>", "1 medium or 2 small ripe tomatoes or a handful of cherry tomatoes", "3 tablespoons cider vinegar", "1/2 clove garlic", "1 teaspoon salt", "1/2 cup extra virgin olive oil", "<small>For the salad</small>", "8 very small or 4 small zucchini, halved lengthwise", "2 poblano peppers (you might want to do extra to save for another dish)", "1 pound extra firm tofu, cut into 8 slabs and patted dry", "1/4 cup vegetable oil", "1 large or two small heads tender lettuce (butter, red leaf, etc), washed and thoroughly dried", "2 medium cucumbers (I used lemon cukes), sliced", "1 1/2 cups cherry tomatoes, halved", "1/2 small sweet onion, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender, combine the tomatoes, vinegar, garlic, and salt. Blend until smooth. Stop and add 1 tablespoon of the olive oil, and blend. Add the rest of the olive oil in two increments, blending in between. Taste and adjust seasoning; it may need more salt or vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a medium-hot grill (preferably with hardwood charcoal). Grill the poblano peppers, rotating occasionally, until black and blistered. Remove to a bowl and cover until cooled. Peel, seed, and cut into strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the zucchini with oil and grill on both sides until tender. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small cast iron skillet on the grill. Let it heat up for a few minutes. Add two tablespoons of oil. Add the tofu in a single layer, making sure it is patted dry. Cook until quite crispy on one side, then flip and cook the other side.  Remove to paper towels. When it cools a bit, make several diagonal incisions in each slab without cutting all the way through. Brush a bit of dressing into the cuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the salad, divide the lettuce among 4 plates. Top with the zucchini, poblano strips, cucumbers, cherry tomatoes onions and the tofu. Spoon on more dressing and hit with a final sprinkle of salt and pepper.</p>"}]}