{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091113-grilledsardines.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fish", "greek", "How to Roast a Lamb", "Michael Psilakis", "potatoes", "salads", "sardines"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Sardines with Chopped Salad and Skordalia Soup", "link": "https://www.seriouseats.com/recipes/2009/11/grilled-sardines-with-chopped-salad-skordalia-soup-recipe.html", "description": "[Photograph: Caroline Russock] After a week of recreating recipes from How to Roast a Lamb by Michael Psilakis, it occurred to me that I haven't had such consistently healthy meals in a long time. During normal weeks I'll go through...", "totalTime": "", "recipeYield": "4 as an appetizer", "recipeCategory": ["Cook the Book", "Fish", "Potato", "Salads", "Soups and Stews"], "recipeIngredient": ["<strong>For the Skordalia:</strong>", "1 Idaho potato, peeled and quartered", "3 cloves garlic, sliced", "3 tablespoons distilled white vinegar", "3 tablespoons extra-virgin olive oil", "Kosher salt and cracked black pepper", "<strong>For the Grilled Sardines and Salad:</strong>", "8 to 12 fresh sardines, scaled and gutted, heads off", "1 tablespoon strained or Greek Yogurt", "1 1/2 tablespoons distilled white vinegar", "1/4 recipe <a href=\"http://www.seriouseats.com/recipes/2009/11/cook-the-book-greek-salad.html\">Greek Salad</a>", "2 to 3 tablespoons <a href=\"http://www.seriouseats.com/recipes/2009/11/octopus-with-chickpea-salad-recipe.html\">Red Wine-Black Pepper Vinaigrette</a> or 2 tablespoons extra-virgin olive oil and 1 tablespoon fresh lemon juice", "Kosher salt and coarsely cracked black pepper", "Pinch dry Greek oregano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the <em>Skordalia</em>, cook the potato in boiling salted water until very tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small food processor, puree the garlic and vinegar until very smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potato through a ricer into a bowl and stir in the garlic-vinegar mixture.  Stir in the olive oil, 1 teaspoon salt, and a generous grinding of pepper.  The <em>Skordalia</em> should be the consistency of applesauce.  Whisk the <em>Skordalia</em> with the yogurt and vinegar to a thick paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the grilled sardines, open each sardine's central cavity, as you would a book.  Using your thumb, push out any of the innards that may remain.  Then work your thumb in between the rib cage and the flesh, starting at the tail end and working your way down toward the head to release the ribcage and spine.  Repeat on the other side and remove the skeleton.  With tweezers, pull out any pinbones that extend beyond the outside edges on either side.  Leave the back fin in place.  Dry the sardines well with paper towels and hold in the refrigerator on a rack, uncovered, until ready to grill.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble and dress the little chopped Greek Salad (if using olive oil and lemon juice instead of the vinaigrette, be sure to season well).  Place a nice big smear of the <em>Skordalia</em>-yogurt mixture on each of the 4 plates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a charcoal or gas grill, or ridged cast-iron grill pan, until very, very hot.  Season the sardines on both sides with salt and pepper.  Grill with the skin side down for 30 to 40 seconds, then turn over for 1 second only, and transfer to warm plates on top of the <em>Skordalia</em>.  Top each sardine with a sprinkle of Greek oregano and a little of the chopped salad.</p>"}]}