{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090525-ctb-endangered-recipes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beets", "borscht", "Cook the Book", "Endangered Recipes", "Lari Robling", "soups", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Borscht", "link": "https://www.seriouseats.com/recipes/2009/05/borscht-recipe.html", "description": "I have never been a picky eater. Growing up, I would eat anything; raw oysters, rare steaks, brussels sprouts, lima beans, no problem. Thinking back, there is only one food that I can remember refusing to eat, and that was...", "totalTime": "", "recipeYield": "3 quarts", "recipeCategory": ["Cook the Book", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["1/4 cup olive oil", "1 large onion diced (about 1 1/2 cups)", "1 carrot, peeled and coarsely grated (about 1 cup)", "1 parsnip, peeled and coarsely grated (about 1 cup)", "1 pound potatoes, peeled and coarsely grated (about 2 medium potatoes)", "2 tablespoons tomato paste", "1 tablespoon sugar", "2 pounds beets, peeled and coarsely grated (about 2 quarts)", "1 pound sauerkraut, rinsed and drained (about 3 cups), plus more for serving", "2 quarts water", "1 teaspoon salt", "1/4 teaspoon black pepper", "1 teaspoon dried dill or 1 tablespoon chopped fresh dill", "For garnish: sour cream, lemon slices, fresh dill sprigs "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stock pot, heat olive oil; add in onion and saute until translucent. Add carrot and saute for about 1 minute. Add parsnip and potatoes and saute another minute. Add tomato paste and sugar and stir well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add beets, 1 pound sauerkraut, water, salt, and pepper. Blend well and bring to a boil. Reduce heat, cover, and simmer for 1 1/2 hours, stirring occasionally. Add the dill and taste the soup. Adjust seasonings if necessary, adding a little more salt or pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, place a tablespoon or two of the sauerkraut in the bottom of the bowl, add the soup, and garnish with sour cream, lemon slice, and fresh dill sprig.</p>"}]}