{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091029-grilled-pumpkin-ravioli.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["fall recipes", "grill", "grilling", "pasta", "ravioli", "thanksgiving", "Thanksgiving turkey alternatives"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Grilling: Pumpkin Ravioli with Brown Butter and Sage Sauce", "link": "https://www.seriouseats.com/recipes/2009/10/grilling-pumpkin-ravioli-with-brown-butter-and-sage-sauce-recipe.html", "description": "This meal offers complex flavors ranging from the sweet and creamy pumpkin filling to the nutty and earthy sauce.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pasta", "Pumpkin"], "recipeIngredient": ["1 small pumpkin, about 3 lbs, halved and seeded", "1 large shallot, finely diced", "12 tablespoons of butter", "1/4 lb fresh ricotta", "1/8 teaspoon cayenne pepper", "Pinch of nutmeg", "Kosher salt", "Freshly ground pepper", "1 batch of pasta dough rolled out to the second or third smallest setting on your pasta roller, or wonton wrappers", "1 large egg, beaten", "10 to 12 Fresh sage leaves", "Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a chimney 3/4 full of charcoal. While the charcoal is lighting, halve and seed the pumpkin. Melt 2 tablespoons of the butter and brush it on the exposed flesh of the pumpkin, then season lightly with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the charcoal is fully lit and covered in gray ash, pour coals out and arrange them on one side of the charcoal grate, keeping the other side empty.  Place the pumpkin halves over the cool side of the grill, cover, and cook at 350 degrees until a paring knife can be inserted in the middle of the pumpkin with no resistance, about 45-60 minutes. Remove the pumpkin from the grill and let sit until cool enough to handle. Scoop out the flesh of the pumpkin halves into a bowl and discard the skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 4 tablespoons of the butter in a large skillet over medium heat. Add the shallot and cook until softened, but not browned, about 7 minutes. Add in the pumpkin, ricotta, cayenne, and nutmeg and cook until heated through. Remove from the heat and season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fresh pasta sheets, place a tablespoon of the pumpkin filling along one side of the pasta sheet at regular intervals. If using wonton wrappers, place a tablespoon of the filling in the middle of each wrapper. Brush the beaten egg around the filling and fold over the other side of the pasta or wonton wrapper. Using your fingers, remove as much air from around the filling as possible and press down to seal the pasta. If using fresh pasta sheets, cut the pasta into squares or circles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Add a tablespoon of salt, drop in the raviolis and cook for 3 to 4 minutes. Drain well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, melt the remaining 6 tablespoons of butter over medium heat. Add the sage leaves and cook until butter begins to brown. Add in the raviolis and toss to coat well in the sauce. Remove the ravioli to a plate, sprinkle with Parmesan cheese and serve.</p>"}]}