{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090623SpaghettiPistachioPistou2.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fava beans", "French", "French in a Flash", "pasta", "pistachio", "pistou", "spaghetti", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Spaghetti with Pistachio Pistou, Fava Beans, and Mint", "link": "https://www.seriouseats.com/recipes/2009/06/french-in-a-flash-spaghetti-with-pistachio-recipes.html", "description": "This is the story of the ugly duckling. I wrote last week that I was a vegetarian growing up, and this is how it happened. One night, I was staying at my father's house, and he had already gone to...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beans and Pulses", "French", "Nuts", "Pasta", "Vegetarian"], "recipeIngredient": ["1 pound dry spaghetti", "1 clove of garlic", "The leaves from 3 or 4 sprigs of mint, plus extra for garnish", "1 1/4 cups shelled toasted unsalted pistachios", "1/3 cup shredded Parmesan, plus extra to top the pasta", "1 tablespoon unsalted butter, room temperature", "3/4 cup shelled blanched fava beans", "Salt and pepper", "<h5>A Note on Some Ingredients</h5>", "<strong>Fava beans</strong> or broad beans can be hard to find in America.  I recommend looking for the pod version in farmers' markets and the frozen, shelled version in the freezer section at good, broad-thinking health-oriented markets or Middle Easter markets.  If you can't find them, try substituting with baby green lima beans or even sweet peas.  To prepare the whole fava beans, start with 500 grams of fava bean pods.  Snap off the tops, and slide the beans out.  With both the frozen and the fresh, blanch in salted boiling water for 2 minutes, then shock in an ice bath.  Squeeze the green bean from inside the pale green bean skin (you won't need to do this with the little frozen ones).  All ready to go."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta until it is al dente in a large pot of well salted, vigorously boiling water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the pistou by smashing together the garlic, mint, salt, and pepper in a food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add in the toasted pistachios (make sure they're not hot from toasting), and whirl until the nuts are nearly powder.  Drizzle in the olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add in the Parmesan and butter, and pulse until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta, reserving 1 cup of cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the pasta with the pistou and the fava beans, moistening as necessary with the reserved cooking water.  Top with sliced mint leaves, extra chopped pistachios, and Parmesan.</p>"}]}