{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091202-tuiles.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "Cindy Mushet", "Cookies", "holiday baking", "holiday sweets", "The Art and Soul of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Tuiles", "link": "https://www.seriouseats.com/recipes/2009/12/tuiles-cookies-recipe-holiday-baking-sweets.html", "description": "[Photograph: Maren Caruso] I have never actually eaten a homemade tuile. It's always been more of a restaurant cookie, usually garnishing another dessert. Aside from its fancy name (French for \"tile\"), the tuile is an elegant and easy-to-bake cookie that...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["1/2 cup plus 2 tablespoons (4 1/4 ounces) sugar ", "1/2 cup (1 3/4 ounces) sifted cake flour ", "2 large egg whites ", "3/4 teaspoon pure vanilla extract ", "1/2 stick (2 ounces) unsalted butter, melted "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sugar and cake flour in the medium bowl and whisk to blend. Whisk in the egg whites and vanilla until well blended. Whisk in the melted butter until a smooth, thin batter is formed. Cover and refrigerate for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and position an oven rack in the center. Line the baking sheet with the silicone mat. Drop about 1 tablespoon of batter onto the mat. With the offset spatula, spread the batter into a thin circle about 4 inches in diameter. Make 3 more circles, spacing them 3 to 4 inches apart. Alternately, set a stencil on the mat and use the spatula to fill the center, scraping off any excess, so the cookie is the same thickness as the stencil around it. Remove the stencil and repeat with more batter. Bake the tuiles for 7 to 9 minutes, until the edges are golden brown but the center is still pale.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cookies to a rack and let cool for 1 to 2 minutes, until they can be loosened and lifted from the sheet without tearing. Use the small spatula to loosen the edges and help you lift each warm cookie off the pan and quickly shape them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For tuiles:</strong> Drape the warm cookies, smooth side down, over the top of a lightly sprayed or oiled rolling pin or dowel (at right). Let cool for 1 minute, then remove and set aside. Repeat until all the cookies are shaped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For bowls:</strong> Gently drape the warm cookies over on upside-down custard or coffee cup and use your fingers to press the warm cookie snugly against the mold. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For cigarettes:</strong> Turn the warm cookies over so the smooth side is facing upward. Roll them loosely around a pencil, small dowel, or the handle of a wooden spoon or similar kitchen utensil that has been lightly sprayed or oiled (at right). Allow the cookies to cool completely before transferring them to an airtight container. Bake additional cookies on a silicone mat on a cool baking sheet (or reuse the same sheets by rinsing under cold water, then wiping dry). </p>"}]}