{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090726RusticRoastDuck.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["duck", "French", "French in a Flash", "potatoes", "roasting"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Rustic Roast Duck with New Potatoes, Sugar Snaps, and Spring Onions", "link": "https://www.seriouseats.com/recipes/2009/07/french-in-a-flash-rustic-roast-duck-recipe.html", "description": "\"Too often, we think of French haute cuisine without remembering the old, rustic heart that beats beneath it.\" A Split Personality France is a two-faced country. About a month ago, I ordered duck confit at an English French restaurant. It...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Duck", "French", "Other Meats", "Potato"], "recipeIngredient": ["1 1/2 pounds Jersey Royal potatoes, or other small boiling potatoes, sliced in thirds", "1/2 pound sugar snap peas", "7 scallions, trimmed and cut in thirds", "1 teaspoon fresh thyme", "1 tablespoon olive oil, plus 1 teaspoon", "2 duck legs, thighs attached", "Herbes de Provence", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the vegetables by slicing the potatoes and scallions into thirds.  In a roasting pan, toss together the potatoes with the fresh thyme, 1 scant tablespoon olive oil, and salt and pepper.  Put into the oven to begin softening.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the duck.  Trim the duck of any excess fat, and reserve.  Rub both duck legs with 1 teaspoon of olive oil total, just to give it a light coating.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the duck liberally on both sides with herbes de Provence, and season well with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a sauté pan on medium-high heat, and add in the reserved duck fat so that it begins to render.  Place the duck legs skin side down into the hot pan, and sear just about 4 minutes until the skin is nice and golden.  Flip the duck, and sear another minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the oven, and toss the scallions and sugar snap peas in with the potatoes, coating the green vegetables with the seasoned potato oil.  Place the duck legs skin side up on the bed of vegetables, and roast for 30-35 minutes, or just until the juices run clear.  Garnish with stems of fresh thyme.</p>"}]}