{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091117-gumbo-spatula.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["cajun", "gumbo", "necks", "offal", "poultry", "sausages", "soups", "stews", "The Nasty Bits", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Turkey Neck Gumbo", "link": "https://www.seriouseats.com/recipes/2009/11/the-nasty-bits-turkey-neck-gumbo-recipe.html", "description": "\"It always feels so rewarding to add another type of neck to one's repertoire of necks.\" [Photographs: Chichi Wang, unless otherwise noted] I like to cook stews. I have a penchant for storied, time-consuming stews with a higher-than-average rate of...", "totalTime": "", "recipeYield": "7 to 8", "recipeCategory": ["Offal", "Soups and Stews", "The Nasty Bits", "Turkey"], "recipeIngredient": ["3 pounds turkey necks, fresh, smoked or a combination thereof", "1 1/4 cups vegetable oil", "1 1/2 cups all purpose flour", "1 medium onion, cut into small dice", "5 celery stalks, cut into medium dice ", "1 poblano chile, stemmed, seeded, and cut into small dice", "1 jalepeno pepper, stemmed, seeded, and finely chopped", "2 green bell peppers, cored, seeded, and cut into medium dice", "3 garlic cloves, minced", "1 tablespoon salt", "1 1/2 teaspoons ground black pepper", "1 teaspoon cayenne pepper", "1 1/2 teaspoons chili powder", "1 teaspoon paprika", "3 quarts chicken or turkey stock", "1 pound andouille sausage, slice into 1-inch chunks", "1 pound okra, sliced into 1/2 - inch segments"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a heavy cleaver, chop the turkey necks into 3-inch segments and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the roux: heat the 1 1/4 cups of vegetable oil in a large Dutch oven over medium-high heat. When the oil is hot but not smoking, whisk in the 1 1/2 cups flour and reduce the heat to medium. Cook, whisking constantly and slowly until the roux has thickened and is very dark brown. This process should take 40 minutes to one hour.  At some point, you may want to switch from a whisk to a spatula or wooden spoon for ease of use. 20 minutes into cooking, reduce the heat to low and take care that nothing sticks to the bottom of the pot; this may require that you use both a whisk and a spatula to periodically check the bottom of the pot.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the roux has darkened to the appropriate shade of brown, add the onion, bell pepper, celery, jalapeno and poblano, garlic, salt, black pepper, cayenne, chili powder, and paprika. The vegetables will steam and sizzle when they hit the roux. Allow the roux to cool briefly.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock to the pot and bring the mixture to a boil, incorporating the roux into the liquid. Reduce the heat to low and simmer for about 30 minutes.   Continually skim off the oil that rises to the surface.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the turkey necks and simmer for another hour. Add the sausage and simmer for approximately half an hour longer. At this point, the turkey meat will be fork-tender and the sausage will just have cooked through. Taste the broth. If it still has a strong roux flavor (that is, too floury or pasty), add a few more cups of stock or water.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a few tablespoons more of oil in a skillet set over medium-high heat. Add the okra and saut&eacute;e, stirring or flipping the okra for about 6 to 8 minutes until it's lightly browned and the slime has cooked off. Add the okra to the gumbo and simmer for an additional 15 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The gumbo is finished when there is no more oil that can be skimmed from the top.  Serve with rice.</p>"}]}