{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091102newclassicfamilydinners.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["anchovies", "Cook the Book", "Mark Peel", "New Classic Family Dinners", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Steak with Anchovy Butter", "link": "https://www.seriouseats.com/recipes/2009/11/cook-the-book-steak-with-anchovy-butter.html", "description": "I cannot remember the last time that I cooked a steak at home. It's one of those things that I think about doing all of the time, but once I make my way up to the front of the line...", "totalTime": null, "recipeYield": "4 to 6 main course servings", "recipeCategory": ["Beef", "Cook the Book"], "recipeIngredient": ["<h5>Anchovy Butter</h5>", "1 fat garlic clove, cut in half, green shoot removed", "3 anchovy filets, soaked in water for 15 minutes (30 minutes if salt-packed), rinsed and patted dry", "1/8 teaspoon kosher salt", "1 tablespoon extra virgin olive oil", "2 tablespoons coarsely chopped fresh flat-leaf parsley", "1/2 cup (1 stick) unsalted butter, at room temperature", "A few grinds of the pepper mill", "<h5>Steak</h5>", "2 pounds steak (individual steaks or larger steaks), at or just below room temperature", "Kosher salt and freshly ground black pepper", "1 tablespoon canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic, anchovy filets, salt, and olive oil in a mortar and pestle and mash to a smooth paste.  Add the parsley and grind with the pestle until well blended with the garlic and anchovies.  Work in the butter and add a few grinds of the pepper mill.  Set aside.  Taste and adjust the salt (add up to another 1/8 teaspoon).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a heavy skillet over high heat.  Pat the steaks dry and season generously on both sides with salt and pepper.  With your fingertips, press the seasonings into the steaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pan is hot, add the canola oil.  Heat just to below smoking and add the steaks, in batches if necessary to avoid crowding the pan.  Cook for 3 minutes on each side for rare 1-inch-thick steaks, 4 to 5 minutes for thicker steaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the steaks from the pan and immediately dollop 4 to 6 heaped tablespoons of the butter over the top.  Let the meat rest for a couple of minutes, then slice and serve at once.</p>"}]}