{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091027tummy-arepa.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["arepas", "offal", "pork stomach", "The Nasty Bits", "Venezuelan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Stomach-Stuffed Arepas", "link": "https://www.seriouseats.com/recipes/2009/10/the-nasty-bits-stomach-stuffed-arepas-recipe-offal.html", "description": "[Photos: Greg Takayama] To those who claim there's nothing better than a juicy steak, I offer the stomach as this week's counter-argument. Nose-to-tail eating affords a whole range of enticing textures. We often judge food by its taste, but texture...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Offal", "Pork", "The Nasty Bits"], "recipeIngredient": ["1 pork stomach ", "1 onion, peeled and washed", "a bouquet garni (thyme, parsley, marjoram, etc)", "1 jalapeño pepper, washed and halved", "½ teaspoon peppercorns", "salt to taste, approximately 1 teaspoon", "vegetable oil for charring", "equal parts water and Harina P.A.N (scale according to your needs; the ratio is always 1:1)", "a pinch of salt", "butter and oil for pan-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to boil.  Add the stomach and let boil for 2 or 3 minutes to get rid of some of the impurities.   Remove the stomach from the pot and set aside to cool.  When sufficiently cool, cut into 3 or 4 smaller segments for ease of stewing.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized pot, arrange the stomach along with the rest of the ingredients (except the oil, for frying).  Add enough water to cover the stomach.  Bring the pot to a boil, then reduce the heat to low and simmer gently, uncovered, for 2 to 3 hours.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the stomach from the broth and let cool.  Reserve the stock for another use.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cooled, cut the stomach into slivers.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat a cast iron until extremely hot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brown the slivers until the edges are golden brown and crispy.  Once in a while, stir the slivers around in the pot to prevent sticking.  Serve immediately.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4> Arepas</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring your quantity of water to a boil.  Place the Harina P.A.N. in a mixing bowl and carefully add the boiling water and pinch of salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly stir the water around with the Harina P.A.N. to distribute the liquid evenly.  Knead with your hands until the mixture comes together in a cohesive ball, with very little cracking.  Like Play-Doh, the dough should be moist, but not wet and sticky.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break off a lump of the dough the size of a small plum, and roll it into a ball using your palms. Gently flatten and pat it down in your hands until the dough is about half an inch thick and 3-4 inches in diameter, tapering the edges to be slightly thinner than the center. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the rest of the arepas, covering the rounds of dough with saran wrap to prevent drying out.  Leftover dough may be wrapped and kept in the refrigerator for several days.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a cast iron skillet or oven-proof pan over low heat. Add the butter and oil.  Very slowly pan-fry the rounds of dough, flipping only once per arepa.  When done, the surface will be lightly golden-brown.  The process should take 10 to 15 minutes minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When arepas are lightly been browned, place your pans into the oven and bake the rounds for 20 minutes or more, until the dough is golden brown and very crisp on both faces.  Slice in half with a bread knife to make a pocket for your stuffing.  The arepas may be kept warm, in a bowl covered with a towel.  </p>"}]}