{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090227MushroomSaute.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French", "French in a Flash", "pies", "scallops", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Coquilles St. Jacques Pot Pies with Roasted Lemon", "link": "https://www.seriouseats.com/recipes/2009/03/french-in-a-flash-coquilles-st-jacques-pot-pies-with-roasted-lemon-recipe.html", "description": "Coquilles St. Jacques are a French classic: sea scallops squatting in their own half shell beds, blanketed in a cozy, creamy sauce flavored with shallots and mushrooms and maybe some white wine. For an American version, I make them into pot pies.", "totalTime": "", "recipeYield": "4 individual pot pies", "recipeCategory": ["French", "Mains", "Other Seafood"], "recipeIngredient": ["20 sea scallops", "2 tablespoons butter, plus 1/2 tablespoon", "2 shallots, sliced", "1 clove garlic, chopped", "4 ounces of mixed, chopped mushrooms, including cremini, shitake, and oyster", "3 tablespoons flour", "1/3 cup dry vermouth", "1/2 cup dry white wine", "1/2 cup fish stock or clam juice", "1 cup half and half", "1/3 cup chopped fresh flat leaf parsley", "2 sheets thawed frozen puff pastry", "Egg wash, made from 1 egg and 2 tablespoons milk, beat together", "Herbs for decorating the pastry, including a few leaves of: sage, basil, chervil, parsley, thyme, or whatever you like", "2 lemons", "Olive oil for drizzling", "As always, salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a sauce pot, melt 2 tablespoons of butter.  Add in the shallots, garlic, and mushrooms, and season with only pepper--not salt just yet.  Adding salt now would cause the mushrooms to weep their moisture (wouldn't you, if you were salted and in a hot pot?), and if they weep, they won't caramelize and maximize their flavor. Cook the vegetables on medium-high heat for about 5-7 minutes, until the mushrooms really start to sear and caramelize. Then, season them with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 1/2 tablespoon butter to the pot, and then the 3 tablespoons flour. Whisk to combine, and scare away any lumps. Lower the heat to medium-low, and stir to make a mushroomy roux. Cook for 1 minutes, to chase away that raw flour taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decant in <em>maman's</em> vermouth, and stir until the flour absorbs it. Add in the wine and clam juice next, and finally the half and half.  Whisk like you mean it. Season again with salt, and a good bit of black pepper. Cook over medium heat until the sauce thickens. </p>\r\n\r\n<p>The way to tell if a béchamel sauce has thickened is to dip a wooden spoon into the sauce. Run your finger down the back of the spoon. If you leave a distinct stripe, the sauce is thickened. If the sauce just pours back over the spot you touched, it is still too loose. If you find that your sauce never seems to want to achieve its maximum béchamel potential, make a <em>beurre manié</em>, or \"handled butter,\" by combining 1/2 tablespoon butter with one tablespoon flour with a fork. Stir it into the sauce, and that should help it thicken up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, grease 4 <a href=\"http://www.crateandbarrel.com/family.aspx?c=550&f=7387&q=gratin&fromLocation=Search&DIMID=400001&SearchPage=1\">individual gratin dishes</a>. I use nonstick cooking spray, but if you're not lazy, you could use butter. Place 5 scallops in each of the gratin dishes, and season with salt and pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the puff pastry just slightly, and use a saucer to cut out rounds that just fit over the tops of the gratin dishes, with a slight bit of room to overhang.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour one ladle full of the hot mushroom cream sauce into each gratin dish, smatter with the grassy parsley, and then cover with one circle of puff pastry, gently pushing the pastry onto the gratin dishes, sealing in the scallops. Take a paring knife and cut 4 little steam vents apple pie-style into the center of the pastry.  Brush the pastry with egg wash, and arrange whole fresh herb leaves on top to decorate, as pictured. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pot pies onto baking sheets. I also like to serve roasted lemons with the pies. I cut off the extremities of the lemon, and then cut the lemon in half. I sit them on their smaller flat sides on the baking sheets with the pies, their broader flat sides facing up, and drizzle them with just a kiss of olive oil. Bake at 425&deg;F for 15 minutes, until the pastry is puffed and golden and the sauce is bubbling like a cauldron underneath.</p>"}]}