{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090828chardomelet.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "chard", "eggs", "omelets", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Chard and Onion Omelet", "link": "https://www.seriouseats.com/recipes/2009/08/sunday-brunch-chard-and-onion-omelet.html", "description": "[Credit: Robin Bellinger] One New Yorker cartoon that lives in my memory shows a man teasing his wife, “You’ll buy anything if it says poids net.” If you suffer from Francophilia, as the cartoon woman and I do, you will...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Omelettes"], "recipeIngredient": ["3 tablespoons olive oil", "1 large red or white onion, quartered and thinly sliced crosswise", "1 bunch chard, leaves only, chopped", "Salt and freshly ground pepper", "1 clove garlic", "6 to 8 eggs, lightly beaten (8 large eggs would not fit with the other ingredients in my 10-inch frying pan, which slopes into the bottom quite a lot)", "2 tablespoons chopped parsley", "2 tablespoons chopped basil", "2 teaspoons chopped thyme", "1 cup grated Gruyère ", "2 tablespoons freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the oil in a 10-inch oven-proof skillet. Add the onion and cook over low heat, stirring occasionally, until completely soft but not colored, about 15 minutes. Add the chard and continue cooking, stirring occasionally, until all the moisture has cooked off and the chard is tender, about 15 minutes. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, mash the garlic in a mortar with a few pinches of salt (or chop them finely together), then stir it into the eggs along with the herbs. Stir the chard-onion mixture into the eggs, then stir in the Gruyère and half the Parmesan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Heat the remaining oil in the skillet and, when it’s hot, add the eggs. Give a stir and keep the heat at medium-high for about a minute, then turn it to low. Cook until the eggs are set but still a little moist on top, 10 to 15 minutes. Add the remaining Parmesan and broil 4 to 6 inches form the heat until browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve trouchia in the pan or slide it onto a serving dish and cut into wedges. The gratinéed top and golden bottom should be equally presentable.</p>"}]}