{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/galegandbrunchcover.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "dessert", "Gale Gand", "jelly", "peanut butter", "turnovers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Peanut Butter and Jelly Turnovers", "link": "https://www.seriouseats.com/recipes/2009/04/sunday-brunch-peanut-butter-and-jelly-turnove.html", "description": "Here's another recipe that I've adapted from my new favorite brunch cookbook, Gale Gand's Brunch! I like what Gale wrote in the headnote for this recipe in her book: \"Peanut butter and jelly is one of my favorite classic combinations\"...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Nuts"], "recipeIngredient": ["One 16-ounce box frozen all-butter puff pastry, thawed overnight in the refrigerator", "All-purpose flour, for rolling", "1 large egg, beaten", "3/4 cup creamy peanut butter", "3/4 cup jelly or jam of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the puff pastry sheets out on a work surface and roll them out into 10-inch squares, using flour if the pastry sticks. Cut each sheet into four 5-inch squares. Use a pastry brush to brush beaten egg along all four edges of each square. Place 1 heaping tablespoon peanut butter and 1 heaping tablespoon jam in the center of each puff pastry and fold it in half diagonally, pressing the edges together to enclose the filling and working out any air. Use a fork to seal the edges completely by pressing the tines down to make a crimped pattern.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the pastry triangles on a baking sheet. Brush the surface of the turnovers with beaten egg. Bake until golden brown, about 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the turnovers from the oven and transfer them to a wire rack to cool slightly. Drizzle the turnovers from the oven and transfer them to a wire rack to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with glasses of really cold milk. </p>"}]}