{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090219-spicybrownie.jpg", "author": {"@type": "Person", "name": "Gretchen VanEsselstyn"}, "recipeCuisine": "", "keywords": ["brownies", "Chile Pepper magazine", "desserts", "Serious Heat", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Heat: Hot Brownie Sundae", "link": "https://www.seriouseats.com/recipes/2009/02/serious-heat-hot-brownie-sundae-recipe.html", "description": "Editor's note: On Thursdays, Gretchen VanEsselstyn of Chile Pepper Magazine drops by to drop some serious heat. Today, serious heat in an unexpected place. Here at Chile Pepper, we use hot sauce in everything--even dessert. These are some of our...", "totalTime": "", "recipeYield": "12; zest factor: medium to hot", "recipeCategory": ["Brownies and Bars", "Serious Heat"], "recipeIngredient": ["<strong>For the brownies:</strong>", "7 tablespoons butter, plus extra for greasing the pan", "3 tablespoons Dutch-processed cocoa powder, plus more for dusting", "1/4 cup milk", "1 tablespoon vinegar-based hot sauce, such as Tabasco or Texas Pete", "6 ounces bittersweet or semisweet chocolate", "1 ounce unsweetened chocolate", "3/4 cup flour", "Pinch of salt", "1/4 cup walnuts, chopped ", "1/4 cup bittersweet or semisweet chocolate chips", "3 eggs", "11/4 cups sugar", "<strong>For the fudge sauce:</strong>", "4 1/2 ounces chocolate, chopped", "1/4 cup sugar", "1 tablespoon honey", "1 tablespoon hot sauce", "1/4 cup plus 2 tablespoons heavy cream", "2 tablespoons (1/4 stick) butter", "Pinch of salt", "Vanilla ice cream, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°. Butter a 9-inch square baking dish, and dust with cocoa powder. In a measuring cup, combine milk and hot sauce, and stir well. Set aside to sour. In a double boiler, melt butter and both chocolates; remove from heat. In large bowl, sift together flour, cocoa powder and salt. Combine flour mixture with walnuts and chocolate chips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a mixer, beat together eggs and sugar until pale and fluffy, about 2 to 3 minutes. Pour reserved melted chocolate into the egg mixture, and mix until well incorporated. Slowly stream in the soured milk mixture. Gently stir in the flour mixture until just combined. Pour batter into the pan, and bake until a skewer inserted into the middle comes out clean, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chopped chocolate in a heatproof bowl. In a medium pot over medium-high heat, combine sugar, honey and hot sauce, and bring to a boil. Cook until mixture turns a dark amber color, about 1 to 2 minutes. Carefully whisk in cream. Then  whisk in butter and salt until smooth. Remove from heat, and pour mixture over chocolate. Allow to sit 1 minute to melt; stir until smooth. Keep warm, or reheat gently over low heat. Drizzle sauce over brownie and ice cream to serve. </p>"}]}