{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090309-foodmatters-cover.jpg", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["baking", "breads", "Cook the Book", "Food Matters: A Guide to Conscious Eating", "Mark Bittman", "quick bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Hybrid Quick Bread", "link": "https://www.seriouseats.com/recipes/2009/03/mark-bittman-hybrid-quick-bread-recipe.html", "description": "Making bread is always a fun and rewarding endeavor. I've heard those who regularly make and knead their own bread even develop some pretty muscular forearms in the process. While I'm all for getting toned while making bread, sometimes I...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": [], "recipeIngredient": ["1/4 cup olive oil, plus more for the pan", "2 cups whole wheat flour, plus more if needed", "1 cup all-purpose white flour, plus more as needed", "1 1/2 tablespoons baking powder", "1 teaspoon baking soda", "1 1/2 teaspoons salt, preferably coarse or sea salt, plus more for sprinkling", "3/4 cup yogurt or buttermilk", "3/4 cup warm water", "2 tablespoons honey (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process for a few seconds, until the dough is a well-defined, barely sticky, easy-to-handle ball. If it is too dry, add the remaining water 1 tablespoon at a t ime and process for 5 or 10 seconds after each addition. If it is too wet (this is unlikely), add 1 or 2 tablespoons of whole wheat flour and process briefly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a round and put it on the cookie sheet or press into the prepared pan, all the way to the edges. Bake for 20 minutes then sprinkle the top with a little coarse sea salt, and continue baking for another 35 to 40 minutes, until the loaf is firm and a toothpick inserted in the center comes out clean. Let cool completely, then cut the bread into slices or squares and serve or store for up to a day.</p>"}]}