{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090212-coeur-assembly.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["cream cheese", "desserts", "French", "French in a Flash", "strawberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Sweet Valentine's Coeur a la Creme with Strawberry Sauce", "link": "https://www.seriouseats.com/recipes/2009/02/french-in-a-flash-sweet-valentines-coeur-a-la-creme-recipe.html", "description": "They say absence makes the heart grow fonder. I say cream and cream cheese make the heart grow creamier. Sugar makes the heart grow sweeter. Some people have funny valentines, but I have French ones, and this year, I am...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Desserts", "French", "Strawberry"], "recipeIngredient": ["8 ounces cream cheese, room temperature", "2 cups heavy cream, cold", "3/4 cup powdered sugar", "1 vanilla bean, scraped of its seeds", "1 teaspoon lemon zest", "1 pound frozen whole strawberries", "1/2 cup water", "1 tablespoon lemon juice", "6 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the Coeur à la Crème mold by lining it with 2 paper towels.  Use a pastry brush to lightly brush the bit of paper towel that touches the bottom of the mold with water.  This will allow you nestle the paper into the shape of the heart more easily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the whisk attachment, beat the cream cheese until light and fluffy&mdash;just about 1 minute.  Add in the cream, and beat until just before the mixture looks like whipped cream.  Add in the sugar, vanilla seeds, and lemon zest, and whip until the mixture does resemble whipped cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decant the cream cheese mixture into the paper towel-lined heart-shaped mold.  Fold the excess paper towel over the top, and set the mold inside a shallow bowl to catch the liquid that will drain out.  Chill in the fridge overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, put the strawberries, water, lemon juice, and sugar in a sauce pan on high heat, and simmer for 10 minutes, until the sugar is dissolved and the strawberries are soft. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a immersion blender, or a regular blender, to puree the sauce.  Strain it through a sieve, and cover.  Chill until cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert the creamy heart in a large, shallow bowl.  Pour some strawberry sauce all around the outside, so the heart is floating in a pool of red sauce.</p>"}]}