{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090807-cfs-theumb.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "chicken fried steak", "Dinner Tonight", "gravy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken Fried Steak with Cream Gravy", "link": "https://www.seriouseats.com/recipes/2009/08/chicken-fried-steak-with-cream-recipe.html", "description": "I'm not sure exactly where the urge came from, or even whether I've had chicken fried steak in the past decade, but for some reason a week ago it started to sound really good. For help I turned to Lisa...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Chicken", "Deep Frying", "Dinner Tonight"], "recipeIngredient": ["1 1/2 pound top-round steak, cut into 4 even pieces", "3 eggs", "1/2 cup buttermilk", "2 cups flour", "1/2 teaspoon salt, plus more for seasoning", "2 teaspoon black pepper", "1/2 teaspoon cayenne", "Vegetable oil", "1 1/2 cups milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 200&deg;F. Using a meat mallet, flatten the pieces of round until each is roughly ¼-inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In one large bowl mix together the flour, 1/2 teaspoon salt, 1 teaspoon black pepper, and the cayenne. Crack the eggs into another bowl and whisk together with the buttermilk. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour enough vegetable oil into a large cast-iron skillet to come up halfway up the side. Turn the heat to medium.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one piece of the flattened meat to the flour mixture and toss until coated. Remove and shake off excess flour. Dip into the egg mixture, and then remove and let the excess drip off. Toss beef back in the flour and coat both sides. Set dredged beef on a sheet pan repeat with remaining pieces of beef.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil is hot, add as many pieces of beef as will fit in one layer, usually two. Cook until the bottom of each has turned a nice golden brown, about 4 minutes. Flip and cook until the other side is golden, another 4 minutes. When done, transfer the chicken-fried steaks to a wire rack set on a sheet pan. Set sheet pan to the oven to keep warm. Repeat frying process with the rest of the pieces of beef.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now it's time to make the gravy. Remove all but 2 tablespoons of the oil from the skillet. Heat over medium and add two tablespoons of the flour from the dredging process. Stir constantly with a whisk until the roux starts to turn a dark brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to low, and slowly stir in the milk, making sure to get rid of any of the clumps of flour. Season with salt and plenty of pepper and cook until slightly thickened. It should easily coat the back of a spoon. You can thin it out by adding some more milk or water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the chicken-fried steak with the cream gravy right on top.  </p>"}]}