{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090814-srslyasian1.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Japanese", "keywords": ["beef", "fish", "marinating", "marination", "miso", "salmon", "scallops", "Seriously Asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Seriously Asian: The Magic of Miso Marination", "link": "https://www.seriouseats.com/recipes/2009/08/miso-marination-asian-marinades-beef-fish.html", "description": "\"I don't like to play favorites because all of my miso tubs fill specific needs, but I'm a sucker for the Saikyo miso.\" Though we live in modern times, some of our best foods are echoes of bygone days, when...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Japanese", "Salmon"], "recipeIngredient": ["Approximately 1 1/2 pounds of your choice of seafood or meat", "1/3 cup miso", "1/4 cup mirin", "3 tablespoons sake"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Miso Marination is such versatile technique that you have several options at each stage. First, the protein: Try it with salmon, Chilean sea bass, Sablefish, scallops, or beef.  A pound and a half of whatever you choose should feed approximately four people.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the marinade.  Use a combination of sweet white miso and darker miso pastes, adjusting the proportions according to taste and the type of protein you are using.  Mix the miso, mirin, and sake into a smooth paste.  If you are running short on sake and mirin, you may replace the sake with white wine or vermouth, and the mirin with sugar.  Use about 4 tablespoons of sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously lather your fish or meat with the miso marinade, making sure that it clings to the meat or seafood.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate for at least five hours and up to two days!  This is a handy step in the process, because you can prepare the ingredients well in advance.  However, do not leave the items marinating for too long, or else they will dry out and become too salty.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before cooking, wipe all of the marinade from the seafood or meat.  Do not rinse, but blot dry with paper towels.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pan-fry, broil, or grill the miso-marinated item.  If using fish, seek out a slab with the skin still attached.  Heat a skillet and add a tablespoon of oil.  Place the fish, skin side down, on the skillet and cook until the skin is crisp, about two to three minutes.  Pan-fry the other sides until golden brown. Proceed similarly with steak, adjusting the cooking times to how well-done you like your beef.  For scallops, cook until the center is barely done (or, for sashimi-grade scallops, leave the center raw).  Be aware when cooking that the sugar content in the mirin will cause the food to brown very easily, so you do not need to preheat your skillet for a long time.  Serve with a high-quality Japanese short-grain rice.</p>"}]}