{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Italian", "keywords": ["Bottega Favorita", "bruschetta", "Frank Stitt", "Italian", "peas", "recipe newsletter", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crushed Sweet Pea and Ricotta Bruschetta", "link": "https://www.seriouseats.com/recipes/2009/05/crushed-sweet-pea-and-ricotta-bruschetta-recipe.html", "description": "The following recipe is from the May 13 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Dating back to 15th-century Italy, bruschetta started out as nothing more than grilled bread rubbed with...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Italian", "Legumes", "Vegetarian"], "recipeIngredient": ["4 slices (about 2 inches thick and 3 inches long) focaccia or ciabatta", "1/2 cup sweet peas, fresh or frozen, rinsed and blanched in boiling water until tender, shocked in ice water, drained (frozen peas may be rinsed in hot water)", "Sea salt and freshly ground black pepper", "1 shallot, finely chopped and softened in a pan with 1/2 tablespoon olive oil, about 1 minute", "Grated zest and juice of 1 lemon", "1/2 cup fresh ricotta cheese (drained if very wet)", "1/2 cup fresh radishes, washed, dried, and finely sliced", "1/2 cup pea tendrils or fresh mint sprigs", "Agrumato lemon oil* or extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a fire in a grill or fire up the broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill or broil the focaccia slices for 30 seconds per side, until golden brown and crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the peas in a medium bowl and crush with a potato masher or the back of a large spoon. Season with salt and pepper and add the softened shallot and a little lemon juice. Taste and adjust seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the bruschettas are still warm, spread a layer of ricotta across each piece. Spoon some of the crushed peas on top and place them on a serving plate. Garnish with the lemon zest, sliced radishes, and pea tendrils (or mint).  Drizzle each with the Agrumato lemon oil or extra virgin olive oil before serving.  </p>"}]}