{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-baconandparsnip.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Babbo", "Dinner Tonight", "parsnips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pasta with Parsnips and Bacon", "link": "https://www.seriouseats.com/recipes/2009/12/pasta-with-parsnips-and-bacon-babbo-recipe.html", "description": "[Photographs: Nick Kindelsperger] This is loosely adapted from a Babbo recipe I found on Epicurious, and by \"loosely\" I mean I changed three of the five ingredients listed&mdash;salt, pepper, and Parmesan weren't on the official list. The recipe calls for...", "totalTime": null, "recipeYield": "3 to 4", "recipeCategory": ["Bacon", "Dinner Tonight", "Pasta"], "recipeIngredient": ["1/4 pound bacon or pancetta, chopped", "2 tablespoons butter", "2 pounds parsnips, peeled, quartered lengthwise, and cut crosswise into 1/4-inch-thick rounds", "8 ounces pasta (fresh pasta if you have it)", "1/4 cup chopped green onion (or parsley)", "Salt and pepper", "Grated parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Meanwhile, add the chopped bacon to a large skillet over medium-high heat. Cook until the bacon is browned, stirring often, about 5 minutes. Remove the bacon with a slotted spoon and let drain on a couple paper towels. Pour off all but 2 tablespoons of the bacon fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to medium and add the butter to skillet with the bacon fat. Add the parsnips and cook for about 12 minutes, stirring often. They should be lightly browned and very tender. Turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pasta according to the directions on the box. When done, reserve 2 cups of the cooking water and then add the pasta directly to the skillet with the parsnips. Turn heat to high and add about 1 1/2 cups of the cooking water, the bacon, and the green onions. Cook for 1 minute, stirring often. Add more of the cooking water if it looks too dry. Season with salt and pepper to taste.</p>"}]}