{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090702-grilled-pizza.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["grilling", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Pizza", "link": "https://www.seriouseats.com/recipes/2009/07/a-new-foolproof-method-for-grilling-pizza-how-to-recipe.html", "description": "On Fridays, Joshua Bousel drops by with a recipe for you to grill over the weekend. Fire it up, Joshua! Before you run out and grab all those burgers and hot dogs for tomorrow's great Fourth of July cookout, let...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Grilling", "Mains", "Pizza"], "recipeIngredient": ["Your favorite pizza dough, <a href=\"https://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">homemade</a> or picked up from your local pizzeria", "Your favorite pizza or marinara sauce", "Toppings of your choosing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a chimney 3/4 full of charcoal.  When charcoal is fully lit and covered in gray ash, pour coals out and arrange them on one side of the charcoal grate, keeping the other side empty.  After heating up for a minute, clean and oil the cooking grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break off a piece of dough about the size of your fist and stretch to a personal sized pie, about 12 inches.  Immediately place the dough on the grill on the hot side, directly over the fire.  Watch the dough closely, when it crisps and becomes golden brown, remove from the grill to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange your sauce and toppings on the grilled side of the dough.  Place the pizza back on the cool side of the grill and cover.  Checking the pizza every few minutes, continue to grill until the toppings are cooked to your liking.  Check the bottom of the dough, if it needs a little bit more time to brown or cook, move the pizza to the hot side of the grill again and cook until the bottom is nicely browned and crisp.  Remove from the grill and enjoy.</p>"}]}