{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Argentine", "beef", "beef pies", "Cook the Book", "Francis Mallmann", "pies", "potatoes", "Seven Fires"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Beef and Potato Pie", "link": "https://www.seriouseats.com/recipes/2009/06/argentine-beef-and-potato-pie-recipe.html", "description": "Those who visit Argentina often say that it has a very European feel. This might have something to do with the fact that more than 86 percent of the Argentine population is of European decent. Much like the United States,...", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Beef", "Cook the Book", "Potato"], "recipeIngredient": ["1 tablespoon extra virgin olive oil", "2 onions, chopped", "2 carrots, peeled and chopped", "2 pounds ground sirloin", "2 bay leaves", "2 teaspoons chopped fresh rosemary leaves", "2 teaspoons chopped fresh oregano leaves", "1 1/2 teaspoons ground cumin", "1 1/2 teaspoons <em>pimentón dulce</em> (sweet Spanish smoked paprika)", "1 teaspoon crushed red pepper flakes", "1 tablespoon dried mustard", "1 cup dry red wine", "1 pound ripe tomatoes, thinly sliced", "1 cup pitted Kalamata olives", "Coarse salt and freshly ground black pepper", "4 large Idaho (baking) potatoes, peeled and cut into 2-inch chunks", "1 cup whole milk", "6 large egg yolks", "2 hard-boiled eggs", "1 1/2 teaspoons sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the olive oil, onions, and carrots in a large cast-iron skillet and saute over medium-high heat, stirring, for about 5 minutes, until vegetables soften and begin to brown.  Crumble in the ground sirloin and cook for about 4 minutes, breaking up the meat with a fork, until it loses it's pink color.  Stir in the bay leaves, rosemary, oregano, cumin, <em>pimentón</em>, pepper flakes, and mustard.  Add the red wine and let it bubble gently for 5 minutes to evaporate the alcohol.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the tomatoes and olives and season to taste with salt and pepper.  Reduce the heat to low and simmer for 20 minutes, or until the meat is very tender and the liquid is reduced but not totally evaporated.  (It is important that the finished dish be moist.)  Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the potatoes in a medium pot with cold water to cover, add salt to taste, and bring to a boil over high heat.  Reduce the heat slightly and boil for 15 minutes, until the potatoes are very tender when pierced with  a fork.  Drain the potatoes thoroughly in a colander, and pass through a food mill or ricer back into the pot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the milk to a boil, and beat it into the potatoes with a wooden spoon.  One by one, beat in the egg yolks, and continue beating until well blended, fluffy, and yellow.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat an <em>horno</em> (a wood-fired oven) or home oven (with the rack positioned in the lower third of the oven) to approximately 375&deg F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the hard boiled eggs 1/3 inch thick and arrange them over the meat mixture.  Spoon the mashed potatoes on top and smooth the surface with a spatula.  Use the tines of a fork to press a pattern of fine decorative ridges over the entire surface of the potatoes.  Sprinkle with sugar, if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 30 to 35 minutes, until the potatoes are nicely browned on the top.</p>"}]}