{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091117cakespythanksgiving.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["apple pies", "Cakespy", "holiday baking", "pecan pies", "pies", "Thanksgiving pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: The Pumpkin-Apple-Pecan Pie", "link": "https://www.seriouseats.com/recipes/2009/11/cakespy-pumpkin-apple-pecan-thanksgiving-pie-thanksgiving-recipe.html", "description": "What if pumpkin, apple, and pecan pie could be combined into one triple threat, a veritable Turducken of a Thanksgiving pie?", "totalTime": "", "recipeYield": "makes one 10-inch pie (see note)", "recipeCategory": ["Cakespy", "Pies, Tarts, and Crumbles", "Pumpkin"], "recipeIngredient": ["<strong>For pumpkin filling:</strong>", "1 15-ounce can pumpkin puree", "1 1/2 cups half and half", "2 eggs", "1/2 cup granulated sugar", "1/4 cup firmly packed brown sugar", "1 teaspoon fresh ginger", "1 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "Pinch of salt", "A healthy handful of marshmallows or whipped cream for topping (optional)", "<strong>For apple filling:</strong>", "2 pounds tart, firm apples (4 to 5 large ones)", "3/4 cup granulated sugar", "1/2 cup firmly packed brown sugar", "1 teaspoon ground cinnamon", "1 tablespoon freshly squeezed lemon juice", "<strong>For apple crumb topping:</strong>", "1 1/2 cups quick-cooking oats", "1 cup flour", "3/4 cup light brown sugar", "1 teaspoon cinnamon", "1/4 tsp. baking soda", "1 1/2 sticks unsalted butter, cut into 1/2-inch cubes and chilled", "<strong>For pecan filling:</strong>", "1 cup light corn syrup", "3/4 cup firmly packed brown sugar", "2 tablespoons unsalted butter", "1 teaspoon vanilla extract", "3 eggs, at room temperature", "1 1/2 cups pecan halves, lightly toasted", "<strong>For the crust:</strong>", "<em>- makes one rather thick pie crust -</em>", "2 1/2 cups all-purpose flour, plus extra for rolling", "1 cup unsalted butter, very cold, cut into 3/4 inch cubes", "1 teaspoon salt", "1 teaspoon sugar", "4 to 8 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pie crust. Put the flour, salt and sugar into a food processor and pulse once or twice. Add the butter and process until the mixture looks grainy. Then slowly, while pulsing, add the water until you can form the dough by pressing it between your fingers (Note: if you don't have a food processor, this can all be done by hand as well). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the loose dough onto a piece of plastic wrap. Using the wrap, fold the loose dough towards the middle and press with the back of your hands to form dough. If you are going to save some of the dough to make mini pies as suggested above, separate dough into two pieces, reserving 2/3 for the main pie and 1/3 for the mini pies. Wrap and chill for at least 4 hours before using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using aluminum foil, form dividers which will divide the pie plate into a sort of peace sign design.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready, roll it out with a rolling pin to an approximately 13- to 14-inch circle (slightly larger than you'd usually use for a pie, because you will need the extra crust to shape around the dividers in the pie plate). Transfer this to the pie plate, gently shaping the dough around the dividers, and trim the edges and shape them in any way you'd like. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blind bake the crust for about 10 to 15 minutes at 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the apple filling. Peel and core the apples and slice them 1/4 to 1/2 inch thick; this should yield about 8 cups. Toss the sliced apples with the sugars, cinnamon, and lemon juice, and then set aside for an hour or so, until they begin to release some of their juices. While this sets, you can make the crumb topping and other fillings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the apple crumb topping. In a large bowl, mix the oats with the flour, light brown sugar, cinnamon, and baking soda. Using a pastry blender or two knives (or your very clean hands!) cut in the butter until the mixture resembles coarse meal. Press the mixture into clumps; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pumpkin filling. Combine the pumpkin, half and half, eggs, granulated and brown sugars, ginger, cinnamon, cloves, and salt in a large bowl and whisk until the mixture is smooth and fully incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pecan filling. Put the corn syrup and brown sugar in a heavy saucepan over medium heat and cook, stirring occasionally, until the sugar dissolves. Remove from heat and add the butter and vanilla. Let the mixture cool, then add the eggs; whisk until smooth. Make this filling last.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour pumpkin filling into one of the three sections; spoon apple filling into another section. Put the pie in the oven for about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pie from the oven and add the pecan filling. Add enough pecans to the remaining section so that the bottom of the section is covered; pour the pecan filling mixture on top until the section is filled. </p>"}]}