{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2009121csmadmenginger.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "Cookies", "gingerbread", "holiday baking", "Mad Men", "TV"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Gingerbread Mad Men", "link": "https://www.seriouseats.com/recipes/2009/12/cakespy-gingerbread-mad-men-cookies-recipe.html", "description": "Introducing Gingerbread Don, Joan, and Betty: the perfect holiday cookies between <em>Mad Men</em> seasons.", "totalTime": "", "recipeYield": "24 to 36 cookies, depending on size", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["1/3 cup butter", "1 cup brown sugar, packed", "1 1/2 cups dark molasses", "2/3 cup cold water", "5 1/2 cups flour (the original recipe called for 7 cups, but around 5 1/2 my mixer was clearly protesting so I left it at that--and they seemed fine)", "1 teaspoon baking soda (original recipe calls for 2 teaspoons)", "1 teaspoon salt", "1 teaspoon ginger", "1 teaspoon cloves", "1 teaspoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix butter, sugar, and molasses thoroughly. Stir in water and mix until incorporated (it will be wet and strangely lumpy, but this goes away when you add the flour).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour and other remaining dry ingredients in a bowl. Stir into the wet mix a little at a time until fully incorporated. The mixture will be extremely thick. Form into a ball and wrap in plastic wrap; let chill for at least two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 350°F. Roll dough 1/4 inch thick on a (very lightly) floured board. Using a gingerbread man cookie cutter, cut the cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make slight variations by hand to personalize them for <em>Mad Men</em> characters. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the men:</strong> Gently shape the legs to be longer and flatter at the end, and stretch the arms a little bit. <strong>For the women:</strong> Be sure to flatten the fat middle part of the gingerbread men&mdash;after all, they are all shapely ladies. For Gingerbread Joan in particular, you might want to add a little beehive hairdo.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, using a knife, cut out shapes for some <em>Mad Men</em>-style accessories: martini glasses, collins glasses, hats or briefcases, a cloud shape for a puff of cigarette smoke. Be sure to bake these smaller pieces on a separate tray because they won't need to bake as long.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the large cookies for 10 to 12 minutes or until no imprint remains when touched lightly; bake the small accessory cookies for about 6 to 7 minutes. Let them cool completely before icing them. </p>"}]}