{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090525Quinoa%26Zucchini.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["fall recipes", "grilling", "healthy", "healthy and delicious", "quinoa", "salads", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Healthy &amp; Delicious: Quinoa and Grilled Zucchini", "link": "https://www.seriouseats.com/recipes/2009/06/healthy-delicious-quinoa-grilled-zucchini-salad-recipe.html", "description": "From the tiniest two-person barbecue to the most massive of community cookouts, grill season hath officially begun, folks. And while burgers and dogs may abound, it's important not to forget our beloved vegetables. They're healthier, cheaper, and much less likely...", "totalTime": "", "recipeYield": "4 to 6 side servings, or 2 to 3 main servings", "recipeCategory": ["Healthy and Delicious", "Vegetarian"], "recipeIngredient": ["1 avocado, ripe", "Juice of 1 lime", "1/4 cup lightly packed cilantro", "1 clove garlic", "1/4 cup plain low-fat yogurt", "3/4 cup water", "1/2 to 3/4 teaspoon kosher sea salt", "Pepper to taste ", "3 large eggs", "1 large zucchini, cut into 3/4-inch thick coins", "1 tablespoon extra-virgin olive oil", "A few pinches of kosher salt", "2 cups quinoa, cooked, room temperature", "2 tablespoons pine nuts, toasted", "1/4 cup goat cheese, crumbled", "A bit of chopped cilantro for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the cilantro-avocado dressing by blending the avocado, lime juice, cilantro, garlic, yogurt, water, and salt in a blender (or us a hand blender). Add pepper and additional salt if needed to taste. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hard boil the three eggs. Place the eggs in a pot and cover with cold water by a 1/2 inch or so. Bring to a gentle boil. Now turn off the heat, cover, and let sit for exactly seven minutes. Have a big bowl of ice water ready and when the eggs are done cooking place them in the ice bath for three minutes or so--long enough to stop the cooking. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the eggs are cooling start preparing the zucchini by tossing it with olive oil and salt in a medium bowl. Prepare your grill (medium-high heat). If you are worried about the zucchini coins falling through the grill you can thread them onto kabob skewers (stab through the green skin). Grill until zucchini are tender and cooked through, roughly 5 minutes on each side. Remove from the grill and cut each zucchini coin into quarters.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack and peel each egg, cut each egg into quarters lengthwise, removing and discarding the yolk. Assemble the salad by tossing the quinoa with about 2/3 cups of the avocado vinaigrette. Salt and pepper to taste. Top with the grilled zucchini, pine nuts, eggs, goat cheese, and a bit of chopped cilantro for garnish. I serve this family-style, but you could do individual platings.</p>"}]}