{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090724berries.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["berries", "Canal House Cooking", "Christopher Hirsheimer", "Cook the Book", "desserts", "Melissa Hamilton", "pudding", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Little Summer Puddings", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-little-summer-puddings.html", "description": "<strong>These puddings might be the ultimate hot day dessert.</strong>  They use fresh ripe summer berries, the prep time is next to none, and the majority of the work is done by the berries sitting in your fridge, simply releasing their juices.  The best part is that the stove is not involved.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Bake the Book", "Cook the Book"], "recipeIngredient": ["4 cups fresh raspberries", "1/4 cup sugar", "12 slices white bread, crusts removed", "1 1/2 cups milk", "1 cup softly whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the raspberries in a bowl and sprinkle the sugar over them.  Shake the bowl to mix them together without crushing the berries.  Set aside to macerate for half an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You will need four 6-8-ounce ramekins for your pudding molds.  Cut a circle out of each slice of bread, using a ramekin as a template.  Pour the milk into a wide dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with one circle of bread at a time, quickly dip the bread into the milk until just moist but not soggy, then press it into one of the ramekins, lining the bottom.  Cover the layer of bread with a generous layer of berries.  Make another layer with the moistened bread and berries, then add a third circle of moistened bread.  The ramekin should be filled to (or even swollen above) the rim.  Layer the remaining 3 ramekins in the same fashion, using the remaining bread and berries.  Spoon any juices over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the filled ramekins on a small tray or baking dish, loosely cover each one with plastic wrap or parchment paper, and set a heavy dish directly on top of them as a weight to press the layers together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate the puddings until the bread and berries have completely melded together, about 4 hours.  They'll keep well in the refrigerator for up to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, uncover the ramekins and run a small knife around the inside edges.  Invert each pudding onto a dessert plate and unmold it gently.  Sprinkle the puddings with some sugar and put a nice spoonful of whipped cream on top.</p>"}]}