{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091109Potato%20Sausage%20Pizza.JPG", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["Meat Lite", "pizza @pizzarecipes", "potatoes", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Potato and Sausage Pizza", "link": "https://www.seriouseats.com/recipes/2009/11/potato-and-sausage-pizza-recipe.html", "description": "[Photograph: Tara Mataraza Desmond] A few weeks ago I gave a friend a verbal whupping for calling a concoction he'd made of vegetables and melted cheese atop a piece of naan a pizza. On any given day, this guy...", "totalTime": null, "recipeYield": "2 to 4", "recipeCategory": ["Mains", "Meat Lite", "Pork", "Potato"], "recipeIngredient": ["4 small golden potatoes", "3 tablespoons extra virgin olive oil", "1 link (about 2.5 ounces) of Italian Sausage, mild or spicy", "4 cloves garlic, sliced thin", "3 large shallots, peeled and sliced very thin", "1 pound ball of prepared, risen and ready to roll pizza dough", "4 ounces grated Fontina cheese (about 1 1/4 cups)", "Coarse salt and freshly ground black pepper to taste", "1/4 cup grated Parmigiano-Reggiano "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 500°F.  Slice the potatoes 1/8-inch thick on a mandolin (if you have rock star knife skills and feel confident in your ability to bang out paper-thin slices by hand, go for it. Either way, watch your fingers.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the olive oil in a large skillet over medium-high heat.  Remove the sausage from its casing and crumble the meat into the hot pan. Cook the meat about 5 to 7 minutes, breaking it up into smaller bits with a wooden spoon as it browns.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium, add the garlic and shallots to the pan and saute with the sausage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stretch the dough out and press it onto your preferred pizza-baking surface (mine is a 14-inch cast iron pizza pan).  Drizzle the remaining olive oil over the dough and then set half of the potato slices in one layer across the dough.  Put the other half of the potatoes in the pan with the sausage and cover with a lid or foil.  Transfer the dough to the hot oven and bake for  5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pizza from the oven and sprinkle half the Fontina over the first layer of pototes. Then spread the sausage, garlic, shallots and remaining potatoes on top. Season with salt and pepper. Add the rest of the Fontina and the Parimigiano-Reggiano. Return the pizza to the oven and bake 10 to 15 minutes more, until the cheese is bubbly, the crust is golden and the potatoes are tender.</p>"}]}