{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090828-fivespice.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bite-Size Desserts", "Carole Bloom", "chocolate", "Cook the Book", "cupcakes", "desserts", "five-spice powder", "spices"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bittersweet Chocolate Five-Spice Cupcakes", "link": "https://www.seriouseats.com/recipes/2009/08/bittersweet-chocolate-fivespice-cupcakes-recipe.html", "description": "By <strong>adding Chinese five-spice powder</strong> to a basic chocolate cupcake recipe, Bloome has created a grown-up version of the childhood classic. It's more of a thinking man's cupcake.", "totalTime": "", "recipeYield": "2 dozen cupcakes", "recipeCategory": ["Bake the Book", "Cook the Book"], "recipeIngredient": ["2 tablespoons (1/2 ounce) unsweetened Dutch process cocoa powder", "3 tablespoons boiling water", "1 1/2 teaspoons pure vanilla extract, divided", "4 ounces (8 tablespoons, 1 stick) unsalted butter, softened", "1/2 cup (3 1/2 ounces) granulated sugar", "2 extra-large eggs, at room temperature", "10 ounces bittersweet chocolate (70 to 72% cacao content), finely chopped, divided", "1/2 cup (2 1/4 ounces) cake flour", "1 1/4 teaspoon five-spice powder, divided", "1/2 teaspoon baking powder", "1/8 teaspoon kosher or fine-grained sea salt", "1/2 cup heavy whipping cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat the oven to 325&deg;F. Line the cavities of the mini muffin pans with mini cupcake paper baking cups and place the pans on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cocoa powder in a small mixing bowl.  Add the boiling water and use a heat-resistant spatula to stir together until it forms a smooth paste.  Add 1 teaspoon of vanilla and stir together to blend thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter in the bowl of an electric mixer with the flat beater attachment or in a large mixing bowl using a hand-held mixer on medium speed until it's light and fluffy, about 2 minutes.  Gradually add the sugar and beat until creamy, about 1 minute.  One at a time, add the eggs, beating well after each addition and stopping frequently to scrape down the sides and bottom of the bowl with a rubber spatula.  The mixture may look curdled as the eggs are added, but as you stop and scrape down the bowl, the mixture will smooth out.  Add the cocoa paste and mix until smooth.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 4 ounces of chocolate in the top of a double boiler over low heat or in a microwave-safe bowl on low power for 30-second bursts.  Stir with a heat-resistant spatula after each burst to ensure even melting.  Remove the top of the double boiler, if using, and wipe the sides and bottom very dry.  Add the melted chocolate to the batter and blend completely on low speed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over a medium-size bowl, sift together the cake flour, 3/4 teaspoon of five-spice powder, and the baking powder.  Add the salt and toss together to blend.  Add to the batter in 2 stages, blending well after each addition.  Stop and scrape the sides and bottom of the bowl with the spatula.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into a 2-cup liquid measuring cup.  Fill each cupcake paper three-fourths full.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cupcakes for 16 minutes, until a cake tester inserted into the center comes out slightly moist.  Remove the baking sheet from the oven and transfer the mini muffin pans to racks to cool.  Gently lift the cupcakes from the pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting:</strong> Place the remaining 6 ounces of chopped chocolate in a medium-size bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, warm the cream over medium heat until it boils.  Pour the cream over the chopped chocolate.  Let it stand for 30 seconds to 1 minute, then stir together using a rubber spatula, whisk, or immersion blender until very smooth.  Add the remaining 1/2 teaspoon of vanilla and mix completely.  Cover the bowl with plastic wrap and chill until thick but not stiff, 30 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip the ganache in the bowl of an electric stand mixer with the flat beater attachment or in a large mixing bowl using a hand-held mixer on medium speed until it holds soft peaks, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a small offset spatula, a rubber spatula, or a spoon to spread the top of each cupcake with the ganache frosting.  Or fit a 12- to 14-inch pastry bag with a large open star tip and fill it partway with the ganache.  Pipe a large rosette on top of each cupcake.  Serve the cupcakes at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note on storing the cupcakes:</strong> Store the unfrosted cupcakes between layers of waxed paper in an airtight plastic container at room temperature up to 4 days.  To freeze up to 4 months, wrap the container tightly in several layers of plastic wrap and aluminum foil.  Use a large piece of masking tape and an indelible marker to label the contents.  If frozen, defrost the cupcakes overnight in the refrigerator and bring to room temperature before frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The frosted cupcakes can be kept tightly covered in the refrigerator up to 3 days.  Serve at room temperature. </small></p>"}]}