{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081229jamieathome.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Jamie at Home", "Jamie Oliver", "lamb", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Indian Lamb and Carrot Salad", "link": "https://www.seriouseats.com/recipes/2009/01/jamie-oliver-indian-lamb-and-carrot-salad-recipe.html", "description": "Jamie Oliver's warmly spiced Indian lamb and carrot salad is a \"salad\" in the same way that the Thai larb--ground chicken tossed with sweet basil and pungent shallots--is a salad, i.e. not really. But the pairing of carrot ribbons...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 1/4 pounds good-quality coarsely ground lamb", "2 teaspoons garam masala", "Sea salt", "1 pound carrots (mixed colors if possible), peeled", "1 tablespoon sesame seeds", "A small bunch of fresh cilantro, leaves picked", "A small bunch of fresh mint, leaves picked", "1 teaspoon cumin seeds", "3 shallots or 1 small red onion, peeled", "Zest and juice of 1 lemon", "1 heaped teaspoon freshly grated ginger", "Extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large frying pan and fry your ground lamb until all the fat comies out of it. Add the garam masala and a good pinch of salt and give it a stir. Keep frying until the meat is crispy. Shave the carrots into long thin strips with a peeler or a mandolin slicer and keep them to one side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a small frying pan over a moderate heat and toast the cumin seeds for 30 seconds--they will start to smell nutty and gorgeous. Put them into a pestle and mortar and grind them up. Put the pan back on the heat and toast the sesame seeds until golden. Transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice your peeled shallots or onion wafer thin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make your dressing, put the lemon zest and juice into a bowl and add the shallots or onion, grated ginger, ground cumin and a pinch of salt. Whisk everything together with about 5 tablespoons of extra virgin olive oil. Pour the dressing over the carrots, add the cilantro and mint leaves, and mix it all together using your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the crispy lamb between four plates and put the dressed salad on top. Sprinkle with toasted sesame. Serve with naan bread, yogurt and lemon wedges, if desired.</p>"}]}