{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090915-oxtail-main.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["dairy cows", "oxtail", "The Nasty Bits", "veal", "veal oxtail"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: The Tale of Veal", "link": "https://www.seriouseats.com/recipes/2009/09/braised-pink-veal-oxtail-recipe.html", "description": "[Photographs: Chichi Wang] To make a stew, there must be gelatin and bone. To find the highest concentration of the two, look no further than tail. I've written before on the perfection of pigs' tails, but bovine tails make for...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Mains", "The Nasty Bits"], "recipeIngredient": ["1/4 cup extra virgin olive oil", "1 tablespoon fat, rendered", "1/4 chopped parsley", "1/2 teaspoon chopped garlic", "2/3 cup chopped onion", "2/3 cup chopped carrot", "2 1/2 pounds veal oxtail or oxtail, severed at each joint", "1 1/2 cups dry white wine or vermouth", "1/2 cup imported Italian plum tomatoes, such as San Marzano", "1 cup water", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use an enameled cast iron pot or heavy pot that can withstand acidic ingredients.  Put in the olive oil, the fat, the parsley, garlic, onion, and carrot, and turn the heat to medium.  Cook for 10 minutes, stirring.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to medium high, and add the oxtail.  Brown the oxtail, turning the pieces until you have browned all the surfaces.  Add the wine, and let it simmer for 20 to 30 seconds.  Then add the tomatoes, roughly chopped, in addition to the water, salt, and pepper.   Turn all the ingredients to coat well.  Bring to a steady simmer.  Cover the pot with a lid slightly ajar, and cook for 2 to 3 hours, turning the oxtail occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The dish is ready when the oxtail is fork tender and almost falling off the bone.  Tip the pot and spoon off as much of the fat as you can.  Serve immediately, with rice or pasta if desired.</p>"}]}