{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091113-seasian-scallops.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Thai", "keywords": ["curries", "Seriously Asian", "shrimp", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Scallops in Green Curry Sauce", "link": "https://www.seriouseats.com/recipes/2009/11/scallops-in-green-curry-sauce.html", "description": "Scallops in green curry sauce is a classic combination; I used small but perfectly juicy bay scallops. A garnish of thinly sliced kaffir lime leaves infused the broth with a refreshing hint of citrus. Adapted from From Kebabs to Curries...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Mains", "Shrimp", "Thai"], "recipeIngredient": ["1 pound scallops ", "2 tablespoons vegetable oil ", "4 tablespoons coconut cream ", "1 cup coconut milk, left undisturbed for a few hours  ", "4 to 5 tablespoons <a href=\"http://www.seriouseats.com/recipes/2009/11/green-curry-paste.html\">green curry paste</a>, or to taste", "1/2 cup water  ", "1/2 teaspoon salt ", "1 to 2 teaspoons fish sauce, or to taste ", "1/2 teaspoon brown sugar ", "Basil or kaffir lime leaves, to garnish  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the oil in a heavy pan. Add the scallops and brown on one side, so that the other side is left uncooked. Remove the scallops and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the sauce: Open the can of coconut milk and skim off the top layer of thick cream, about 4 tablespoons worth. Stir the remaining milk to reincorporate the coconut cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large, nonstick lidded pan and set over medium heat. When the oil is hot but not smoking, add the coconut cream and the green curry paste. Stir the paste around until it is lightly browned and the oil has separated from the coconut in the cream. You have just cracked the coconut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the liquids: the coconut milk and about 1/2 cup of water to thin it out. You can add more or less water, depending on your preference for the consistency. Add the salt, fish sauce, and sugar. Stir and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pot and simmer for another 5 minutes or so over low heat. This may all be done in advance and kept covered for 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the scallops to the curry broth. Simmer briefly, about 10 to 20 seconds, until the scallops are just cooked through. Finely chop the kaffir or basil leaves, and add to the pot. Serve immediately.</p>"}]}