{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-beefmiroton.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "French", "keywords": ["beef", "French", "leftovers", "roast beef", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Beef Miroton", "link": "https://www.seriouseats.com/recipes/2009/04/dinner-tonight-beef-miroton-leftover-roast-beef-recipe.html", "description": "Once again, I was faced with some leftover roast beef. My first reaction will always probably be roast beef hash, but I'd just made that a few weeks ago. Was there any other dish dish that could utilize the roast...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Dinner Tonight", "French", "Mains"], "recipeIngredient": ["3/4 pounds waxy potatoes", "1 pound red onions, thinly sliced", "2 tablespoons butter", "1 tablespoon flour", "1 cup beef or chicken broth", "Salt", "1/2 pound roast beef or pot roast, sliced 1/4-inch thick", "1/2 tablespoon red wine vinegar", "2 tablespoons bread crumbs", "Sprinkling of chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.  Place the potatoes in a small pot and cover with cold water.  Bring to a boil, and then reduce to a simmer and cook for 15 to 20 minutes or until a knife can slip in with just slight resistance.  Remove from the water and drain.  Let cool for 5 minutes, and then cut into 1/4 inch rounds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add 1 tablespoon of the butter to a large pot over medium heat.  Add the onion and cook until well browned.  Stir occasionally to prevent from burning.  This should take about 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the flour onto the onions, and cook for 2 minutes more, stirring occasionally. Pour in the broth and add a sprinkling of salt. Bring to a boil, scraping the bottom of the pot with a wooden spoon to dislodge any browned bits. Then remove the pot from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a small casserole pan, about 8-inch square, and add the potato slices so the overlap slightly.  Lay the slices of meat in a single layer on top of the potatoes. Dump the onion mixture on top and spread it out. Drizzle on the red wine vinegar and sprinkle on the bread crumbs.  Melt the rest of the butter in a pot, and then pour it on top of the breadcrumbs.  Place in the oven and cook for 20 to 25 minutes, or until browned and bubbling. Serve with sprinkling of parsley, and season with salt and lots pepper.</p>"}]}