{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091207ciderpork.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["apples", "carrots", "cider", "fennel", "fennel slaw", "holiday recipes", "pork", "pork tenderloin", "The Crisper Whisperer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Cider-Braised Pork Tenderloin with Fennel, Carrot, and Apple Slaw", "link": "https://www.seriouseats.com/recipes/2009/12/the-crisper-whisperer-cider-poached-pork-tend.html", "description": "Note: You may know Carolyn Cope as Umami Girl. She stops by on Tuesdays with ideas on preparing fruits and vegetables. [Photograph: Carolyn Cope] I recently discovered this killer method of preparing pork tenderloin. Ironically, it's killer largely because it's...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Apple", "Condiments and Sauces", "Crisper Whisperer", "Mains", "Pork"], "recipeIngredient": ["3 cups apple cider", "3 whole cloves ", "2 bay leaves", "1 cup chicken stock", "2 1-pound pork tenderloins", "Salt and pepper", "1 fennel bulb, stems and fronds discarded ", "2 large carrots, peeled if desired and trimmed", "1 Granny Smith apple, cored (no need to peel)", "1/4 small red onion", "1/4 cup of the reduced syrup (see step 2 below)", "2 tablespoons apple cider vinegar", "2 tablespoons olive oil", "1 teaspoon Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide pan, combine the apple cider, cloves, and bay leaves. Bring to a boil over medium-high heat. Simmer vigorously for 10 minutes. Add the chicken stock. Generously season the pork tenderloins with salt and pepper. Add the pork to the pan, cover, and lower the heat to maintain a gentle simmer. Cook, flipping the pork every 5 minutes or so, until the pork reaches an internal temperature of 145°F. Remove the pork to a plate to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise the heat to high and boil the sauce, uncovered, until it is reduced to about 2/3 cup and develops a syrupy consistency (about 10 to 15 minutes). You will notice larger bubbles forming as the syrup thickens. Carefully pour the syrup into a bowl and remove the cloves and bay leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sauce is reducing, prepare the slaw. Quarter and core the fennel bulb and slice it very thinly with a knife or mandoline. Cut the carrots and apple into very thin matchsticks (the julienne blade of a mandoline works well here). Very thinly slice the onion. Combine these ingredients in a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dressing, whisk together 1/4 cup of the reduced syrup, the vinegar, oil, and mustard and a few good grinds of black pepper until emulsified. Toss the slaw with half the dressing, and slice the pork tenderloin. To serve, divide the slaw among four plates, top with a few slices of tenderloin, and drizzle with additional dressing if desired.</p>"}]}