{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091003SC-spaghetti.jpg", "author": {"@type": "Person", "name": "Carey Jones"}, "recipeCuisine": "", "keywords": ["basil", "pasta", "pasta sauces", "Scarpetta", "Scott Conant", "spaghetti", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Scarpetta's Spaghetti With Tomato and Basil", "link": "https://www.seriouseats.com/recipes/2009/10/scarpettas-spaghetti-with-tomato-and-basil-scott-conant.html", "description": "No flashy technique, unusual spices, or kitchen wizardry required. This simply perfect pasta requires just a few unexpected ingredients and a respect for the process.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pasta", "Tomato"], "recipeIngredient": ["3 ounces spaghetti, high-quality dried or fresh", "Salt", "6 ounces tomato sauce (recipe follows)", "4 large leaves of basil", "1/2 tablespoon butter, unsalted", "2 tablespoons freshly grated Parmigiano Reggiano", "1 tablespoon extra virgin olive oil", "8 ripe plum tomatoes", "1/4 of a can San Marzano tomatoes", "2 tablespoons extra virgin olive oil", "Pinch of red chili flakes", "Pinch of kosher salt", "1/4 cup extra virgin olive oil", "6 cloves garlic, whole", "2 stems of basil, leaves on", "Pinch of red chili flakes", "<strong>Note: </strong>Vary the ratio of canned to fresh tomatoes according to the season. If fresh, flavorful tomatoes are available, use all fresh; if tomatoes lack some flavor, supplement with canned. "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large pot of water on the stove. Heavily season with salt, until it tastes as salty as a broth would. Bring to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll basil leaves into a cylinder and thinly cut lengthwise into a chiffonade. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the spaghetti in the water and remove when it is just shy of <em>al dente</em>&mdash;depending on the pasta, 3 minutes for fresh, 10 minutes for dried. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pasta is cooking, place the sauce into a sauté pan and heat slowly. Allow the sauce to reduce slightly. Add the pasta to the sauté pan along with a bit of pasta water, to add starch and seasoning. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta to the sauce, and allow to finish cooking, over medium high heat. The sauce should coat the pasta and look cohesive. When you shake the pan, the sauce and pasta should move together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat and add the basil, cheese, butter, and extra virgin olive oil. Toss until well incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the seasoning and serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Tomato Sauce</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>yields 2 cups</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a pot of water on the stove and bring to a boil. Prepare an ice bath by placing ice in a bowl and filling with cold water. Core tomatoes with a paring knife, and discard cores. Score the bottom of each tomato with an \"X.\"  When water has come to a boil, place tomatoes in water and leave for 15 seconds, until skin begins to split away. Transfer to ice bath. When cool, peel with paring knife. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut tomatoes in half lengthwise. Remove seeds with your thumb, and set seeded tomatoes aside. Reserve seeds and excess juices.  If using canned tomatoes, seed in the same way.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a new pot, place 2 tablespoons of extra virgin olive oil over medium heat. When the oil is hot, carefully transfer tomatoes to the pot. Add a pinch of salt and chili flakes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the tomatoes to cook for a few minutes until they begin to soften, then smash them with a potato masher. If the consistency is particularly thick, strain excess tomato juices for seeds and add to pot. Allow tomatoes to cook 30 to 45 minutes over medium heat, smashing and stirring occasionally. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tomatoes are cooking, prepare the basil-garlic oil.  Take a small saucepan and place the remaining 1/4 cup of extra virgin olive oil in the pan. Add garlic cloves, basil, and chili flakes. Slowly heat to allow the flavors to transfer to the oil. When the garlic is lightly browned, remove from the heat. Allow to cool for 5 minutes. Strain the oil and combine with the tomato mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the sauce from the heat and adjust the seasoning with additional salt, as needed. </p>"}]}