{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Mexican", "keywords": ["chiles", "Cook the Book", "ground beef", "guajillo chiles", "Mark Miller", "Mexican", "spicy", "taco", "tacos", "Tacos by Mark Miller"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Classic Ground Beef with Guajillo Chiles", "link": "https://www.seriouseats.com/recipes/2009/05/cook-the-book-classic-ground-beef-with-guajillo-chiles-recipe.html", "description": "Before I ever experienced any kind of authentic Mexican food (Taco Bell excluded), I was pretty sure that tacos came from a box. This magical yellow box was decorated with cacti and terracotta tiles and had everything that you needed...", "totalTime": "", "recipeYield": "10 tacos", "recipeCategory": ["Beef", "Cook the Book", "Mexican"], "recipeIngredient": ["1 tablespoon vegetable oil", "1 small white onion, cut into 1/4-inch dice", "1 garlic clove, minced", "12 ounces tomatoes, seeded and cut into 1/4-inch dice", "5 dried guajillo chiles, rehydrated, stemmed and finely chopped (see note)", "1 large serrano chile, stemmed and cut into 1/4-inch dice", "1 tablespoon chopped fresh cilantro", "1/2 teaspoon cumin seed, toasted and ground", "1/2 teaspoon dried Mexican oregano, toasted and ground", "3 tablespoons water", "Kosher salt and freshly ground black pepper", "1 1/4 pounds lean ground beef (15 percent fat)", "Juice of 1/2 lime", "10 (5 1/2-inch) crispy yellow corn tortilla shells, for serving", "Garnish: Shredded iceberg lettuce and grated mild cheddar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy skillet, heat the oil over medium-high heat; add the onion and garlic and saute until the onion is softened, 3 to 4 minutes. Add the tomatoes, guajillo and serrano chiles, cilantro, cumin, oregano, and the 3 tablespoons of water. Season with salt and pepper. Cook the tomato mixture down until the consistency of a thick marinara sauce. Crumble in the ground beef, mashing and stirring it to combine with the sauce, increase the heat to high and cook, covered, until the meat has lost its pink color and the filling is moist, but not liquid, about 12 minutes. The meat should be soft like meatloaf. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat, stir in the lime juice, and serve right away, or keep warm in the pan until ready to serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, divide the lettuce, filling, salsa, and cheese equally between the crispy shells and arrange in a taco holder. Or, lean the filled shells in a row, propped upright, on a platter. Eat right away. To build your own, spoon some lettuce and filling in a crispy shell, top with cheese and salsa, and eat right away. </p>"}]}