{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091025quiche.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["onions", "quiches", "Sunday Brunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Onion Custard Pie", "link": "https://www.seriouseats.com/recipes/2009/10/sunday-brunch-onion-custard-pie.html", "description": "[Photo: Robin Bellinger] I can't say why The Art of Simple Food calls this an onion custard pie instead of a quiche, but I think the name switcheroo may have helped me get over an instinctive aversion to quiche that...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Quiche", "Vegetarian"], "recipeIngredient": ["10 ounces pie dough", "4 tablespoons butter", "4 onions, peeled and sliced thin", "Salt", "Pepper", "1 1/2 cups half-and-half", "2 eggs", "2 egg yolks", "1/2 cup grated Gruyère cheese", "Pinch cayenne pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the chilled pie dough into a 12-inch round. Line a 9-inch pie pan with the dough, folding the edges in to make double-thick sides. Press the sides in well and prick the bottom all over with a fork. Refrigerate for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°. To keep the dough from shrinking while it bakes, line the shell with a piece of foil or parchment paper, then fill the tart with a layer of dried beans or other pie weights. Bake for 15 minutes, or until lightly golden around the edge. Take the tart out of the oven; remove the foil and the weights. Return to the oven and cook for another 5 to 7 minutes, until the pastry is an even light golden brown. (I went for 10 more minutes here and think it would have been fine to go even a bit longer.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy bottomed skillet, melt the butter over a medium flame. Then add the onions and cook until soft and golden, 20 to 30 minutes. Season with salt and pepper. Taste to make sure the onions are already delicious by themselves. Cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together the remaining ingredients. When the onions are cool, spread them in the baked tart shell, pour in the custard mixture, and bake at 375 for 35 to 40 minutes, until the top is puffed and golden brown. Let the pie sit at room temperature for 10 minutes or so to firm up before you cut into it.</p>"}]}