{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090330-urbanitalian.jpg", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "Italian", "keywords": ["Andrew Carmellini", "Cook the Book", "Gwen Hyman", "Italian", "potatoes", "Urban Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Potatoes Girarrosto-Style", "link": "https://www.seriouseats.com/recipes/2009/04/potatoes-girarrosto-style-recipe.html", "description": "One of the most comforting things in life is a big plate of potatoes, and this version from Urban Italian is no exception. They saved Andrew Carmellini's soul and will quite possibly save yours too. While working as a broke...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Italian", "Potato", "Vegetarian"], "recipeIngredient": ["4 Idaho potatoes", "1/2 cup extra-virgin olive oil", "2 medium onions, cut in half and sliced", "3 cloves garlic, finely chopped", "2 tablespoons butter", "1/4 teaspoon red pepper flakes", "1 tablespoon fresh rosemary leaves, chopped", "1 heaping tablespoon fresh thyme leave", "1/4 teaspoon coarse-ground black pepper", "1/2 teaspoon sea salt", "1/4 cup chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are cool, roughly cut them into large chunks with a small knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven (leaving the oven on) and cook over high heat on the stovetop for 2 minutes to caramelize the potatoes and onions, being sure to shake the pan or stir the contents every 30 seconds or so to avoid burning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the oven and continue baking for another 5 to 10 minutes, pulling the pan out periodically to shake the potatoes around with a spoon. Bits of potato on the bottom of the pan will brown up so they look almost like hash browns. Scrape these little flavor-and-crispiness bombs off the bottom and mix them in with the rest of the potatoes. When the potatoes are finished baking, they will be golden and crispy, with lots of brown bits.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and return it to the stove over medium-high heat. Add the garlic, butter, red pepper flakes, rosemary, and thyme. Stir, and season very liberally with salt and pepper. The potatoes should be crispy and crunchy on the outside, soft on the inside—think Italian hash browns. Cook for a few more minutes so the flavors meld. Remove the pan from the heat and add the chopped parsley. Serve immediately.</p>"}]}