{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090223-roastedchix.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["chicken", "healthy and delicious", "Marcella Hazan", "roast chicken"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Healthy &amp; Delicious: Marcella Hazan's Lemon Roasted Chicken with Carrots and Potatoes", "link": "https://www.seriouseats.com/recipes/2009/02/marcella-hazans-lemon-roasted-chicken-with-carrots-potatoes-recipe.html", "description": "Editor's note: On Mondays, Kristen Swensson of Cheap, Healthy, Good swings by these parts to share healthy and delicious recipes with us. Generally speaking, I'm a healthy eater. Sure, I dig the occasional tire-sized doughnut, but produce and lean meats...", "totalTime": "", "recipeYield": "servings vary", "recipeCategory": ["Chicken", "Healthy and Delicious", "Mains"], "recipeIngredient": ["1 pound thick carrots, peeled and cut into 1 inch pieces", "1 1/2 pounds red or Yukon gold potatoes, scrubbed and cut into 1-1/2 inch pieces", "1 three- to four-pound chicken", "Salt", "Black pepper, ground fresh from the mill", "2 small lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove giblets. Wash chicken thoroughly in cold water, both inside and out. Remove all the bits of fat hanging loose. Let the bird sit for about 10 minutes on a slightly tilted plate to let all the water drain out of it. Pat it thoroughly dry all over with cloth or paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle a generous amount of salt and black pepper on the chicken, rubbing it with your fingers over all its body and into its cavity.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the lemons in cold water and dry them with a towel. Soften each lemon by placing it on a counter and rolling it back and forth as you put firm downward pressure on it with the palm of your hand. Puncture the lemons in at least 20 places each, using a sturdy round toothpick, a trussing needle, a sharp-pointed fork, or similar implement.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place both lemons in the birds cavity. Close up the opening with toothpicks or with trussing needle and string. Close it well, but dont make an absolutely airtight job of it because the chicken may burst. Run kitchen string from one leg to the other, tying it at both knuckle ends. Leave the legs in their natural position without pulling them tight. If the skin is unbroken, the chicken will puff up as it cooks, and the string serves only to keep the thighs from spreading apart and splitting the skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chicken into a roasting pan, breast facing down. Arrange the carrots and potatoes around it. Do not add cooking fat of any kind. This bird is self-basting, so you need not fear it will stick to the pan. Place it in the upper third of the preheated oven. After 30 minutes, stir the carrots and potatoes and turn the chicken over to have the breast face up. When turning it, try not to puncture the skin. If kept intact, the chicken will swell like a balloon, which makes for an arresting presentation at the table later. Do not worry too much about it, however, because even if it fails to swell, the flavor will not be affected.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook for 30 to 35 minutes more, then turn the oven thermostat up to 400°F. Stir the potatoes and carrots again, ensuring they are covered with the chicken juice, and cook for 20 minutes more. Calculate between 20 and 25 minutes total cooking time for each pound. There is no need to turn the chicken again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whether your bird has puffed up or not, bring it to the table whole and leave the lemons inside until it is carved and opened. The juices that run out are perfectly delicious. Be sure to spoon them over the chicken slices. The lemons will have shriveled up, but they still contain some juice; do not squeeze them, they may squirt.</p>"}]}