{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["barbecue sauces", "grilling", "molasses", "pork", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Pork Burgers with Molasses Barbecue Sauce", "link": "https://www.seriouseats.com/recipes/2009/02/grilled-pork-burgers-with-molasses-barbecue-sauce-recipe.html", "description": "...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Burger", "Pork", "Sandwiches"], "recipeIngredient": ["5 strips thick-cut bacon", "2 cloves garlic, crushed", "2 small Hungarian wax peppers (also known as banana peppers) or other mild chili peppers, chopped", "1 tablespoon ground cumin", "1 tablespoon lemon pepper", "1/2 pound spicy pork sausages", "1/4 pound ground pork", "1 tablespoon mayonnaise", "3 cups water", "2 tablespoons cider vinegar", "1/4 light unsulphured molasses", "1 plum tomato, chopped", "3 scallions, white part only, finely chopped", "1 clove garlic, minced", "1/2 teaspoon crushed red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the bacon and garlic in a heavy-bottomed skillet over medium heat. When the bacon is about halfway done, add the chopped pepper and saute until soft, about 4 minutes. Stir in the cumin and lemon pepper and cook for 2 minutes more. Remove from heat and let cool for a few minutes. Pour off, then discard the bacon drippings. Pour the contents of the pan into a food processor fitted with a steel blade and pulse until the bacon and peppers are finely chopped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a charcoal or gas grill to medium-high. Split the sausage casings with a knife and crumble contents in a large bowl. Add the ground pork then add half the bacon-pepper mixture, and using your hands or a wooden spoon, mix until the ingredients are evenly distributed. Form into 4 burgers of equal size. Grill or broil the burgers, flipping once, brushing the cooked side with 1 tablespoon of the barbecue sauce until the juices run clear, 4 to 5 minutes on each side. While the burgers are cooking, mix the remaining bacon-pepper mixture with the mayonnaise. Serve the burgers on corn bread or onion rolls, topped with the warm Molasses Barbecue Sauce<span class=\"hideme\">, found after the jump</span>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Molasses Barbecue Sauce</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all the ingredients in a heavy-bottomed saucepan. Bring to a boil, reduce heat to simmer and, stirring periodically to avoid burning. Cook until the quantity is reduced by half, about 15 minutes. Serve warm over the burgers.</p>"}]}