{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090915zingermansguidetobetterbacon.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apples", "Ari Weinzweig", "chicken", "coffee", "Cook the Book", "roast chicken", "Thanksgiving mains", "Thanksgiving recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lex's Roast Chicken with Bacon and Spicy Coffee Rub", "link": "https://www.seriouseats.com/recipes/2009/09/lexs-roast-chicken-with-bacon-and-spicy-coffee-rub-recipe.html", "description": "I set out to make Lex's Roast Chicken with Bacon and Spicy Coffee Rub from Ari Weinzweig's Zingerman's Guide to Better Bacon a few days after Labor Day weekend. The weather had cooled down to the point where I was...", "totalTime": "", "recipeYield": "serves 4", "recipeCategory": ["Apple", "Bacon", "Cook the Book"], "recipeIngredient": ["1 1/4 pounds sliced <a href=\"http://bentonshams.com/order/index.php?cPath=24&osCsid=18b084a113488596ef9ca876f54d065b\">Benton's</a> bacon (about 12 slices)", "2 large Spanish onions (about 1 1/2 pounds), cut in half lengthwise and sliced into thin half circles", "4 stalks celery, cut into 1/8-inch slices", "1 1/4 pounds tart apples (about 3 medium), 1/2-inch dice, skins on", "1 scant cup dried currants ", "1 clove fresh garlic, minced", "1/2 teaspoon dried thyme or 1 tablespoon fresh thyme", "1 teaspoon hot red pepper flakes (preferably Marash)", "1 tablespoon lemon zest", "1 teaspoon coarse sea salt", "2 teaspoons freshly ground Tellicherry black pepper", "1/4 cup parsley, chopped, rinsed, and squeezed dry", "1/2 loaf leftover counrty bread, such as a good crusty white loaf, sliced 3/4-inch.  If the bread you are using is still fresh and soft, slice it and let it dry on the counter for a few hours before using.", "1 roasting chicken (3 to 4 pounds), split in half and backbone removed", "5 tablespoons <a href=\"http://www.zingermansroadhouse.com/2008/03/13/zingerman's-spicy-coffee-spice-rub/\">Zingerman's Spicy Coffee Rub</a> (or you can make your own, see Note)", "1/4 cup fresh-squeezed lemon juice."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange 6 of the bacon slices in a 1/2-inch deep baking sheet.  Bake for 20 minutes, or until the bacon is crisp and most of it's fat is rendered.  Remove the baking sheet carefully from the oven.  Drain the bacon on paper towels and reserve for another use.  When the fat cools a bit, pour into a Pyrex measuring cup.  You should have about 1/2 cup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/4 cup of the fat in a large skillet over low heat.  Add the onion and celery.  Cover and sweat, stirring occasionally, for 15 minutes or until soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the apple, currants, garlic, thyme, red pepper flakes, lemon zest, salt, and black pepper.  Stir to mix.  Cook, covered, until the onions and celery are translucent, about 5 to 7 more minutes.  Remove from heat, stir in the parsley, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly brush the bottom and sides of a 15-inch oval roasting pan with 1 tablespoon of the rendered bacon fat.  Arrange the bread slices to cover the entire bottom of the baking dish.  (If the bread is too big to fit easily, simply cut the slices into smaller pieces so that they tile the entire bottom of the dish properly.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer the onion mixture atop the bread.  Place the chicken, skin side up, over the onion mixture and bread.  Rub it with 2 tablespoons of bacon fat and 4 tablespoons of the coffee rub.  Pour the lemon juice over the chicken, then lay the remaining bacon slices across the top of the chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the entire dish in the oven and cook, uncovered.  After 45 minutes or so, check that the bacon has crisped on top of the chicken.  Once it has, pull it off the chicken and lay it directly onto the bread mixture so that the chicken can brown.  Change the oven function to broil, but continue at 400&deg;F.  The chicken should be done in 15 to 20 minutes; the skin should be nicely crisped and it's juices should run clear when the bird is pricked with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven.  Sprinkle the whole dish with 1 tablespoon Coffee Spice Rub and let stand for a few minutes.  Remove the chicken to a cutting board and cut into quarters.  Draw a sharp knife through the bacon, bread, and onion mixture to break it up.  Spoon some of the mixture onto each plate and place the chicken on top.</p>"}]}