{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090728-tripe-soup-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Mexican", "keywords": ["low carb", "menudo", "Mexican", "soups", "spicy", "The Nasty Bits", "tripe"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Menudo Rojo, or Red-Chile Tripe Soup", "link": "https://www.seriouseats.com/recipes/2009/07/menudo-mexican-soup-red-chile-tripe-recipe.html", "description": "Honeycomb tripe Here is a list, off the top of my head, of textures that many eaters dislike: gooey, slimy, rubbery, and gelatinous. A gooey consistency may be prized in the center of a molten chocolate cake, but in the...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Mexican", "Offal", "Soups and Stews", "The Nasty Bits"], "recipeIngredient": ["<strong>For the soup</strong>", "2 pounds beef honeycomb tripe", "1 tablespoon salt", "1 large lime", "6 cloves garlic, peeled and chopped", "1/2 medium onion, chopped", "2 teaspoons dried oregano", "4 medium (about 1.3 ounces total) dried <em>chiles cascabeles norteño</em>, or California/ New Mexico chiles, stemmed, seeded, and deveined", "1/2 teaspoon cumin seeds, freshly ground", "1 teaspoon salt", "<strong>For the condiments</strong>", "Limes", "Chopped onion", "Dried oregano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the tripe:  Wash the tripe thoroughly in warm water.  Place it into a large bowl, sprinkle with the lime juice and salt, and scrub vigorously.  Let stand 30 minutes; then wash the tripe again in warm water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tripe into small pieces, approximately 2 inches in length by 1/2-inch wide. Place the tripe in a large stockpot, cover with water, and bring to a boil. Simmer for 10 minutes and then drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tripe and 3 quarts water. Bring to boil; reduce heat to medium low. Add garlic, onion, and oregano. Partially cover and simmer until tripe is very tender, 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To start the chile infusion: During the last half hour of simmering, heat a heavy skillet. Tear the chiles into pieces and toast them for a few seconds on each side, until they blister and darken slightly. Place the pieces in a bowl and submerge in boiling water. Cover with a lid and soak for 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the chiles in the bowl and place them into a blender with the remaining cloves of garlic and the ground cumin. Add a ladle of the simmering  broth, and blend until smooth. Add the chile-broth back into the soup, and simmer for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the piping-hot soup with the condiments, to be used according to personal taste.</p>"}]}