{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bite-Size Desserts", "cakes", "candy", "Carole Bloom", "chocolate", "chocolates", "mint", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bittersweet Chocolate Peppermint Candy Bark", "link": "https://www.seriouseats.com/recipes/2009/08/bittersweet-chocolate-peppermint-candy-bark-recipe.html", "description": "The following recipe is from the August 26 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! I have a borderline unhealthy fascination with Christmas. I love the twinkling lights, piles of presents,...", "totalTime": null, "recipeYield": "about 3 dozen 1-inch pieces", "recipeCategory": ["Desserts"], "recipeIngredient": ["1 cup (7 ounces) red-and-white-striped round peppermint candies", "8 ounces bittersweet chocolate (62% to 72% cacao content), finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap the candies and place them in the work bowl of a food processor fitted with a steel blade. Pulse until the candies are finely chopped, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 6 ounces of the chocolate in the top pan of a double boiler set over hot water. Stir often with a rubber spatula to help melt the chocolate evenly. Or place the chocolate in a microwave-safe bowl and melt on low power for 30-second bursts. Stir with a rubber spatula after each burst. Remove the top pan of the double boiler, if using, and wipe the bottom and sides very dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the remaining 2 ounces of chocolate in 2 to 3 stages, making sure each batch has melted before adding the next. Stir in the chopped peppermint candies and coat them thoroughly with chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with waxed or parchment paper. Pour the chocolate mixture onto the baking sheet and use an offset spatula to spread it to a thickness of about 1/4-inch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill the bark in the refrigerator until set, about 30 minutes.  Remove the bark from the refrigerator and gently peel off the paper. Break the bark into 1-inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note on storing the bark:</strong> Store the bark between layers of waxed paper in an air tight container in the refrigerator up to a month. To freeze up to 2 months, wrap the container tightly in several layers of plastic wrap and aluminum foil. Use a large piece of masking tape and an indelible marker to label and date the contents. If frozen, defrost the bark overnight in the refrigerator and bring to room temperature before serving.</small> </p>"}]}