{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090319-pork-souvlaki.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["greek", "grilling", "Mediterranean", "pita", "pork", "Serious Grilling", "souvlaki"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Pork Souvlaki with Pita and Tzatziki", "link": "https://www.seriouseats.com/recipes/2009/03/grilling-pork-souvlaki-with-pita-and-tzatziki-recipe-greek.html", "description": "Out of all the Greek establishments in my neighborhood, my absolute favorite gyro and souvlaki joint is BZ Grill in Astoria, only two short blocks away. The proximity has left me little reason to cook the staples at home, but...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Grilling", "Pork"], "recipeIngredient": ["<strong>For the marinade</strong>", "1/2 cup olive oil", "1 small red onion, finely chopped", "2 garlic cloves, minced", "4 tablespoons fresh lemon juice", "2 tablespoons red wine vinegar", "2 teaspoons Greek oregano", "Salt and Pepper", "<strong>For the Tzatziki</strong>", "2 cups of Greek yogurt", "1 English cucumber, peeled and grated", "4 cloves of garlic, minced", "2 tablespoons lemon juice", "2 tablespoons extra-virgin olive oil", "1 1/2 lbs pork loin, trimmed of silver skin and excess fat, cut into 1-inch cubes", "Wooden skewers, soaked in water for 30 minutes before use", "Pocketless Pita"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all of the marinade ingredients together in a small bowl.  Place pork cubes in a Ziploc bag and pour in the marinade.  Seal the bag and toss to coat pork evenly with the marinade, then open the bag and reseal, removing as much air as possible.  Place the pork in the refrigerator for at least two hours to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all the tzatziki ingredients together in a bowl until well combined.  Cover and place in the refrigerator for at least two hours to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal.  While the charcoal is lighting, thread the pork cubes onto the skewers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly.  Grill the pork skewers until they browned on all sides and cooked through, about 8 to 12 minutes, turning 4 times during cooking.  Remove the skewers to a plate and allow to rest for 5 minutes.  While the pork rests, grill the pita until lightly browned on both sides, about 1 minute per side.  Remove the pita from the grill and quarter.  To serve, place pita slices on a plate, lay the souvlaki on top, and place a dollop of tzatziki on the side.</p>"}]}