{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090528seriouslyitalian.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["Italian", "Seriously Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Insalata di Riso", "link": "https://www.seriouseats.com/recipes/2009/05/seriously-italian-insalata-di-riso-recipe.html", "description": "Editor's note: On Thursdays, Babbo pastry chef Gina DePalma checks in with Seriously Italian. After a stint in Rome, she's back in the States, channeling her inner Italian spirit via recipes and intel on delicious Italian eats. Take it away,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Italian", "Salads"], "recipeIngredient": ["To feed a crowd of 8 to 10, use 1 1/2 to 2 cups of raw rice.  Cook the rice in 3 quarts of rapidly boiling, salted water until it is tender, but retains a bit of chewiness.  Drain the rice well, run it under cold water, and leave it in a colander suspende", "For the rest of the salad, you can any combination of the following ingredients, as much or as little as you prefer:", "Mortadella or prosciutto cotto, cut in 1/4-inch cubes", "Any semi-soft cheese, such as fontina, fresh asiago, young pecorino or soft provolone, cut in 1/4-inch cubes", "Diced celery, ribs and leaves", "Finely chopped red onion", "Pitted or stuffed green and/or black olives, halved and sliced", "Marinated hot peppers, chopped", "Roasted red peppers, sliced thin", "Fresh or roasted cubanelle peppers, diced", "Chopped hard-boiled eggs", "Frozen or fresh peas, cooked tender and shocked in ice water", "Finely chopped capers", "Thinly sliced scallions", "Marinated artichoke hearts, chopped", "Marinated mushrooms, quartered", "Cherry tomatoes, cut in quarters or eigths", "Fresh, flat-leaf or Italian parsley, chopped fine", "Julienned fresh basil leaves", "Minced fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the rice in a large bowl and add the rest of whatever ingredients you are using.  Gently toss the entire mixture together with your hands to combine the ingredients thoroughly.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dress the salad with red wine vinegar, or fresh lemon juice, and plenty of extra virgin olive oil to taste; season generously with kosher or sea salt and freshly ground black pepper. Allow the salad to chill and marinate for 4 to 6 hours or overnight before serving. Store leftovers in the refrigerator in an air-tight container for up to three days.</p>"}]}