{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090913tortillasoup.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "Mexican", "keywords": ["easy", "fall recipes", "Mexican", "quick", "soups", "The Crisper Whisperer", "tomatillos", "tortilla soup", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Quick Tortilla Soup", "link": "https://www.seriouseats.com/recipes/2009/09/the-crisper-whisperer-quick-tortilla-soup-1.html", "description": "In the Crisper Featured Veg: Tomatillos Flavor affinities: Lime, cilantro, tomatoes, green chilies, onion, garlic Prepare: Remove husk, wash well Cook: Dice and eat raw, simmer, roast The first time our CSA delivered tomatillos a few years ago I...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Crisper Whisperer", "Mexican", "Soups and Stews"], "recipeIngredient": ["2 tablespoons olive oil", "1 medium onion, diced", "About 1 cup diced green or red peppers", "A few tomatillos, diced", "A few garlic cloves, minced", "1 jalapeño or other hot pepper, minced (or to taste)", "About 2 cups diced tomatoes", "", "1/4 cup chopped cilantro", "1/2 teaspoon salt", "3 tablespoons cornstarch", "Juice of 1/2 lime", "Meat from 1/2 cooked chicken, shredded", "Tortilla chips", "Chopped cilantro", "Sliced avocado", "Sliced scallions", "Crumbled cotija (or, in a pinch, French feta) or shredded Monterrey Jack cheese", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot, heat the olive oil over medium heat. Add the onion and peppers along with a good pinch of salt and cook, stirring occasionally, until beginning to soften. Add the tomatillos, garlic and jalapeño and continue to cook, stirring occasionally, for a few minutes longer. Add the diced tomatoes and cook for a few minutes more. Add the chicken stock, cilantro and salt, raise the heat to high, and bring to a boil. When the soup reaches a boil, reduce the heat and simmer for five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve the cornstarch in a couple of Tablespoons of water to make a slurry. Pour the slurry into the pot in a slow stream, stirring to mix it into the soup. Raise the heat to high, bring the soup to a boil once again for just a moment, and then remove the soup from the heat. Stir in lime juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a handful of shredded chicken and a handful of tortilla chips into each of four wide bowls. Ladel some soup overtop. Garnish generously with cilantro, avocado, scallions, cotija or jack cheese and lime wedges.  </p>"}]}