{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090109mediterranean_diet_cookbook.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["beans", "Cook the Book", "greek", "Nancy Harmon Jenkins", "The New Mediterranean Diet Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Greek Baked Beans", "link": "https://www.seriouseats.com/recipes/2009/01/greek-baked-beans-nancy-harmon-jenkins-recipe.html", "description": "Nancy Harmon Jenkin's recipe for Greek-style baked gigante beans makes a whole lotta beans, but any leftovers are easily frozen to use later in soups or stews. Jenkins also suggests that you mash up the tomatoey, honey-sweetened beans to the...", "totalTime": null, "recipeYield": "8 to 10 servings", "recipeCategory": ["Cook the Book", "Sides"], "recipeIngredient": ["1 pound Greek gigantes (giant) beans, soaked overnight and drained", "1/3 cup extra-virgin olive oil", "2 medium red onions, finely chopped", "2 cups raw ripe plum tomatoes, peeled and chopped, or use canned plum tomatoes, drained and chopped", "3 tablespoons honey", "2 tablespoons tomato concentrate, or tomato extract, or sun-dried tomato paste", "2 bay leaves", "1/4 cup fresh herbs, minced (dill is preferred by Greeks, but you could also use un-Greek basil, or a tablespoon of mint and a tablespoon of thyme)", "1/4 cup red wine vinegar", "Sea salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the beans in a large saucepan with water to cover to a depth of about 1 inch. Bring to a boil, then lower the heat to simmer, cover the pan, and simmer very gently for 40 to 50 minutes, or until the beans are starting to soften but not yet ready to eat. Periodically, skim off any foam that rises to the top. When the beans are ready, remove from the heat but do not drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the oven at 325 degrees. Using 3 tablespoons of the oil, cook the onions in a skillet over medium-low heat, stirring frequently, until the onions are very soft and starting to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using 3 tablespoons of the oil, cook the onions in a skillet over medium-low heat, stirring frequently, until the onions are very soft and starting to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, transfer the hot beans from the saucepan to an oven dish, preferably a bean pot--a terra cotta or ceramic dish that is taller than it is wide (lacking such a pot, you could also use an ordinary casserole or souffle dish, but a bean pot is preferable). Stir in the remaining olive oil, the onions, and the chopped or crushed tomatoes. Dissolve the honey and tomato concentrate in about 1 cup of the hot bean water and add to the beans, mixing carefully and tucking the bay leaves in with the beans. There should be just enough liquid in the pot to barely cover the beans--add a little more if necessary, but make sure it is boiling hot. Cover the pot securely with aluminum foil (and the pot lid if available), transfer to the preheated oven, and bake for about 1 1/2 hours. Check the beans from time to time and add a little more boiling bean liquid or plain water if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bean pot from the oven. The beans should be meltingly tender at this point. Stir in the fresh herbs and the vinegar, along with salt and pepper. Return the bean pot, uncovered, to the oven and let the beans bake for another 15 minutes to absorb all the flavors.</p>"}]}