{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091109-howtoroastalamb.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "eggplant", "greek", "How to Roast a Lamb", "Michael Psilakis", "onions", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sweet and Sour Eggplant and Onion Stew", "link": "https://www.seriouseats.com/recipes/2009/11/cook-the-book-sweet-and-sour-eggplant-and-oni.html", "description": "Middle Eastern flavors have been bouncing around the Mediterranean for centuries and worked their way into Greek cuisine long ago. Cinnamon found its way into Greek cooking through the Turks, who brought it with them during their occupancy. Greece declared...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Dairy-Free", "Healthy and Delicious", "Vegan", "Vegetarian"], "recipeIngredient": ["15 small, whole cipolline onions or shallots", "2 tablespoons extra-virgin olive oil", "1 clove garlic, smashed", "1/4 cup red wine vinegar", "2 1/4 cups water", "3/4 cup smooth tomato sauce, homemade or store bought", "1 1/2 tablespoons tomato paste", "2 cinnamon sticks", "3 large springs thyme", "1 teaspoon dry Greek oregano", "1 1/2 tablespoons granulated sugar", "Kosher salt and cracked black pepper", "Blended oil for deep frying (50 percent canola or sunflower, 50 percent extra-virgin olive oil)", "1 1/2 large eggplants, sliced crosswise 1 inch thick, then cut into 1-inch chunks "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the onions are large, cut them in half.  Warm a large skillet over medium-high heat and add the oil.  Add the cipolline and garlic, and pan-roast until slightly golden, shaking the pan.  Deglaze the pan with vinegar, then add the water, tomato sauce, tomato paste, cinnamon sticks, thyme, oregano, and sugar.  Season generously with salt and pepper.  Bring up to the boil and then reduce the heat.  Partially cover the pan and braise gently until the onions are just fork-tender, up to 20 minutes.  The juice will be quite thick.  Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a pot of blended oil or deep fryer for deep-frying; heat the oil to 350&deg;F to 375&deg;F.  Salt and pepper the eggplant, and deep-fry until nicely browned.  Drain on paper towels to get rid of the excess oil; season again with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the fried eggplant into tho onion mixture and taste for sugar and vinegar.  Remove the remains of the thyme and cinnamon sticks, if you like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you prefer not to deep-fry the eggplant, you can saute it in thick, round slices in olive oil until golden brown, then drain and quarter them into wedges.</p>"}]}