{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "diabetes", "shrimp toast", "snacks", "starters", "Tom Valenti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Asian Shrimp Toast", "link": "https://www.seriouseats.com/recipes/2009/06/sunday-brunch-shrimp-toast.html", "description": "Asian Shrimp Toast is one of those decadent foods I find irresistible. I even like the way it sounds rolling off my tongue: Asian Shrimp Toast. Isn't Shrimp Toast always Asian? Anyway, Tom Valenti in You Don't Have to Be...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["8 ounces shrimp (about 8 large shrimp), peeled, deveined, and coarsely chopped", "1/4 cup chopped napa cabbage", "1/4 cup coarsely chopped scallion greens", "1/2 teaspoon garlic", "1/2 teaspoon soy sauce", "1/2 teaspoon Asian (dark) sesame oil", "1 large egg white", "2 tablespoons whole milk", "6 thin slices white bread", "2 tablespoons canola oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sure all the ingredients are cold. For the best results, also chill the food processor bowl and steel blade in the refrigerator or freezer briefly before using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the shrimp, cabbage, scallion, garlic, soy sauce, sesame oil, and egg white in the food processor fitted with the steel blade. Pulse until everything is incorporated. Drizzle in the milk and pulse until just combined. Spread the shrimp mixture over 1 side of each slice of bread, pressing down gently to ensure the shrimp adheres to the bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 teaspoon of canola oil in a heavy-bottomed, nonstick pan over medium-high heat. Arrange 1 slice of bread, with the shrimp mixture side down, in the pan and fry until the egg white is cooked and the shrimp mixture is firmly melded to the bread, about 3 minutes. Use a rubber spatula to turn the bread over and cook on the other side until toasted, about 2 minutes longer. Transfer the toast to a plate and lossely cover with aluminum foil to keep warm. Repeat with the remaining slices of bread and shrimp mixture, adding 1 teaspoon of oil to the pan before each toast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the toasts diagonally into 4 pieces each. Arrange on a plate or platter and serve.</p>"}]}