{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090721-gizzards-board.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["confit", "duck fat", "duck gizzards", "ducks", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Nasty Bits: Gizzards Galore", "link": "https://www.seriouseats.com/recipes/2009/07/the-nasty-bits-duck-gizzards-confit.html", "description": "\"My duck routine is always carried out for the sake of confit, an illustrious ritual that begins and ends with fat.\" When I need a bit of fun and relaxation after a long day's work, I'll buy a few ducks....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Offal", "The Nasty Bits"], "recipeIngredient": ["1 1/2 pounds large duck gizzards", "2 teaspoons coarse kosher salt", "1 medium shallot, chopped", "1 teaspoon minced fresh garlic", "1 1/2 teaspoons lightly crushed black peppercorns", "1 1/2 teaspoons dried thyme leaves or herbes de Provence", "4 cups rendered duck fat, or a combination of duck fat and lard", "1 cup homemade confit of duck gizzards", "Freshly ground pepper", "6 ounces mixed greens (arugula, radicchio, frisée, mache, etc)", "1 to 2 tablespoons red wine vinegar", "½ teaspoon Dijon mustard", "salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the gizzards and pat dry.  Cut or pull away any extraneous fat or membranes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine the gizzards with the salt, shallots, garlic, peppercorns, and herbs.  Cover with plastic wrap and let cure in the refrigerator overnight, or up to 12 hours.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090721-gizzards-bowl.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090721-gizzards-bowl.jpg\" width=\"500\" height=\"333\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The following day, rinse the gizzards and place them into a heavy pot, of small to medium size. Pour the fat over the gizzards and place the pot over low heat. Slowly heat the fat, over the course of forty minutes, to a temperature of 225&deg;F. The fat should be barely simmering; do not raise the heat, or else the gizzards will be tough when cooked through. Cook slowly for 2 to 3 hours, until the gizzards are extremely tender. <em>Alternatively</em>, place the gizzards in an ovenproof bowl or casserole dish, and cook in the oven at 225°F for 2 to 3 hours.  <em>Alternatively</em>, cook the gizzards in a slow cooker, partially covered, for approximately 6 hours on low temperature.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the gizzards from the fat.  Use at once, or store in glass canning jars, with enough fat to completely submerge the gizzards.  If necessary, add more fat, lard, or olive oil to cover. Refrigerate until you are ready to use. The gizzards will keep up to 2 weeks in the fat in the refrigerator, or freeze in plastic tubs or bags.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To use: Bring the jar of gizzards to room temperature.  Steam the jar to soften the fat and then remove the gizzards, reserving the fat for use in cooking.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090721-gizzards-jars.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090721-gizzards-jars.jpg\" width=\"500\" height=\"375\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4> Confit of Duck Gizzards with a Salad of Mixed Greens</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em> adapted from The Cooking of Southwest France by Paula Wolfert</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice the gizzards and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse and dry the greens; then tear into bite-size pieces.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gizzards in a medium skillet with a few teaspoons of the duck fat.  Gently cook over low heat until hot, about 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the gizzards from the skillet. Pour the vinegar into the skillet and deglaze, stirring to get all the brown bits from the bottom of the pan.  The vinegar should be thoroughly mixed with the duck fat; add a bit of Dijon mustard if you like, to help along the emulsification. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the contents of the skillet over the salad greens and toss to mix.  Add salt and freshly ground black pepper to taste.  Arrange the greens on plates with the gizzards scattered liberally throughout.  </p>"}]}