{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090724-tofu-cooking.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Lion's Head with Cabbage", "Seriously Asian", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "A Tofu Throwdown: Lions Head Meatballs vs. Tofu and Orzo", "link": "https://www.seriouseats.com/recipes/2009/07/a-tofu-throwdown-lions-head-with-cabbage-recipe.html", "description": "So the thing about writing a snobbish article about the proper way to cook tofu, and using your favorite professor as an example, is that at some point you will have to answer to said professor. \"Tofu with olives and...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pork", "Tofu"], "recipeIngredient": ["<strong>For the meatballs:</strong>", "8 ounces firm tofu, draned", "10 ounces ground pork", "1 green onion, minced", "1 large egg, beaten", "1/2 teaspoon salt", "1 tablespoon cornstarch", "vegetable oil, for frying", "<strong>For the sauce:</strong>", "3 cups pork or chicken stock", "1/4 cup Shao Xing rice wine", "1/4 cup soy sauce", "2 green onions, trimmed and cut in half", "1-inch piece of fresh ginger, cut into 3 segments", "1 tablespoon sugar", "1/2 teaspoon ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the meatballs: Using a cleaver, mash the tofu and then mince it finely. Using your hands or chopsticks, lightly mix the ground pork, green onion, egg, salt, and cornstarch until the ingredients are just combined. Add the tofu and mix very briefly. Take care not to overwork the mixture, which will result in tough tofu-meat balls.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands, pick up a large segment of the tofu-pork mixture and toss it against the side of the bowl. Repeat a few times; this throwing process ensures that the balls will not come apart when fried in oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a wok with approximately 2 inches of oil. Form the tofu-meat balls into 6 very large balls, or smaller ones according to your preference.  Fry until the surface is golden-brown, about 3 minutes. Drain the balls and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To start the sauce, combine the stock, rice wine, soy sauce, scallions, ginger, sugar, and pepper in a separate saucepan. Add the meatballs and cabbage and simmer over medium-low heat for about 15 to 20 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a cornstarch slurry, dissolving 1 tablespoon of starch into 3 tablespoons of water. Add the slurry to the pan and simmer until the sauce thickens slightly, about 30 seconds. Serve immediately. Leftover tofu-meat balls will keep well for many days; out of the casserole, the balls also taste delicious in noodle soup.  </p>"}]}