{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["660 Curries", "cocktails", "Cook the Book", "curries", "curry", "eggs", "Indian", "Raghavan Iyer", "tamarind"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Halved Eggs with Garlic, Curry Leaves, and Tamarind", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-halved-eggs-with-garlic-curry-recipe.html", "description": "If you can think of an ingredient, chances are that there is a recipe that utilizes it in Raghavan Iyer's 660 Curries. I would have never thought to incorporate hard-cooked eggs into a curry recipe, but it makes perfect sense....", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 tablespoons firmly packed fresh cilantro leaves and tender green stems", "8 to 10 medium-size to large fresh curry leaves", "4 medium-size cloves garlic", "1 or 2 fresh green Thai, cayenne, or serrano chiles, to taste, stems removed", "2 tablespoons unrefined sesame oil or canola oil", "1 teaspoons black or yellow mustard seeds", "2 medium-size to large shallots, thinly sliced", "1/2 teaspoon ground turmeric", "1 teaspoon coarse kosher or sea salt", "1/2 teaspoon tamarind paste or concentrate", "4 extra-large or jumbo eggs, hard-cooked, peeled, and cut in half lengthwise", "2 teaspoons rice flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pile the cilantro, curry leaves, garlic, and chiles into a mortar.  Pound the ingredients with a pestle, scraping the interior of the mortar to contain the herbs in the center for a more concentrated pounding, until the mixture forms a paste.  (Alternatively, place the ingredients in a food processor and process until minced.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a medium-size skillet over medium-high heat.  Add the mustard seeds, cover, and cook until the seeds have stopped popping (not unlike popcorn), about 30 seconds.  Then add the paste and the shallots and stir-fry until lightly browned, 1 to 2 minutes.  Sprinkle in the turmeric, which will instantly color everything sun-yellow.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the rice flour into the thin sauce, stirring to prevent any lumps from forming.  The sauce will immediately start to thicken; cook for about 1 minute.  Pour the sauce over the eggs and serve.</p>"}]}