{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090928shrimpspinachwrap.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["sandwiches", "shrimp", "spinach", "The Crisper Whisperer", "wraps"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Shrimp, Spinach, and Swiss Wrap", "link": "https://www.seriouseats.com/recipes/2009/09/the-crisper-whisperer-shrimp-spinach-shrimp-wrap-recipe.html", "description": "Note: You may know Carolyn Cope as Umami Girl. She stops by every Tuesday during prime veggie season to help us cook through seasonal surplus with ease. [Photograph: Carolyn Cope] For a few fleeting years a short while back, a...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Crisper Whisperer", "Sandwiches", "Shrimp", "Spinach"], "recipeIngredient": ["2 Tablespoons olive oil, divided", "1 medium yellow onion", "5 cloves garlic", "10 ounces raw spinach", "8 ounces raw shrimp, shelled and deveined", "4 thin slices Swiss cheese", "1/4 cup ginger-miso dressing (the thicker the better&mdash;you might buy it from your favorite sushi restaurant) ", "2 burrito-size tortillas or sandwich wraps", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the onion in half from tip to root and slice it crosswise into half-moons. Roughly chop the garlic. Wash the spinach in several changes of water, dry thoroughly and roughly chop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide skillet, heat one Tablespoon of the olive oil over medium-low heat. Add the onion and garlic and sauté until the onion has softened but not browned. Add the spinach along with a good pinch of salt, raise the heat to medium-high, and cook until the spinach has wilted and released some liquid. Remove the spinach mixture to a colander and press with a spatula to drain off any excess liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the heat and add the remaining one Tablespoon olive oil. Sprinkle the shrimp generously with salt and pepper and arrange in a single layer in the skillet. Cook until just pink on the underside, then flip. About a minute before the shrimp is cooked through, lay the cheese slices over the shrimp in the skillet. Continue to cook until the shrimp is just cooked through and the cheese has started to melt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the wraps, lay each tortilla on a plate and place half the spinach mixture in a horizontal strip in the center of each, leaving 2 to 3 inches of naked tortilla at the left and right ends. Divide the shrimp, cheese and dressing between the wraps, layering it all on top of the spinach mixture. Fold the left and right edges of the tortilla over the filling. Then, starting with the edge closest to you, roll the tortilla away from you to form a burrito-shaped wrap. Slice in half crosswise and serve warm.</p>"}]}