{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090807-asian-caramelsauce.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Vietnamese", "keywords": ["caramel", "pork", "sauces", "Seriously Asian", "spareribs", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: Caramel Sauce", "link": "https://www.seriouseats.com/recipes/2009/08/caramel-sauces-pork-spareribs-grilled-lemongrass-recipe.html", "description": "If there's one thing I like as much as taking apart ducks, it's making caramel. Burnt sugar and burnt butter are perhaps the most alluring scents in my kitchen, though the term \"burnt\" is used loosely here. More accurately, the...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pork", "Vietnamese"], "recipeIngredient": ["3/4 cup water", "1 cup sugar", "2 pounds pork spareribs, cut crosswise through the bone into two long strips", "3 cloves garlic, minced", "1 small shallot, minced", "2 teaspoons brown sugar", "1/2 teaspoon freshly ground black pepper", "2 tablespoons caramel sauce", "2 tablespoons soy sauce", "3 tablespoons fish sauce", "1 tablespoon canola oil, or another neutral oil", "1 thick stalk of lemongrass, trimmed and minced (about 6 tablespoons)", "3 pounds pork spareribs, cut crosswise through the bone into two long strips", "1/2 large yellow onion, minced", "1 tablespoon sugar", "1 teaspoon black pepper", "6 tablespoons fish sauce", "6 tablespoons caramel sauce", "2 scallions, green part only, chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Select a small, heavy saucepan, such as an enameled cast iron pan.  Fill the sink with enough cold water to come halfway up the sides of the saucepan.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 1/4 cup of the water and all the sugar in the saucepan and place over medium-low heat. (If you are using a thinner pot, place over low heat to avoid scorching.)  To ensure that the sugar melts evenly, stir with a metal spoon.  After two minutes when the sugar is relatively smooth, stop stirring and let the mixture cook undisturbed.  Small bubbles will form at the edges of the pan and grow larger, migrating towards the center.  After approximately 7 minutes from when you started cooking, the bubbles will cover the entire surface and the mixture will be simmering vigorously.  At this point, the liquid should be completely clear.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The color will turn from light yellow to a handsome auburn, and finally, to a darker brown.  When the bubbles on the caramel become very orange, the caramel will turn the color of black coffee or molasses:  at this point, immediately plunge the pot into the sink of cold water to stop the cooking.  Rotate the pot around, checking the color and consistency of the syrup.  (You may even want to remove the pot 10 seconds before the syrup turns the color of coffee, just to be safe.)  Add the remaining 1/2 cup of water and wait for a few minutes.  After the bubbling subsides, return the pan to the stove over medium heat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the caramel, stirring until it dissolves into the water.  Remove from the heat and let cool for 10 minutes before pouring into a small heatproof glass jar.  Cool completely.  The liquid should be slightly viscous, while the flavor will be bittersweet.  Cover and store the sauce indefinitely in the cupboards.  Makes about one cup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090807-seriouslyasian-grilled.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090807-seriouslyasian-grilled.jpg\" width=\"500\" height=\"333\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Grilled Lemongrass Pork Spareribs </h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small>Adapted from <em><a href=\"http://www.amazon.com/dp/1580086659/?tag=serieats-20\">Into the Vietnamese Kitchen</a></em> by Andrea Nguyen</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the thick white membrane from the underside of the ribs.  Cut the strips of spareribs between the bones, into individual chunks each containing one bone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the marinade:  combine the garlic, shallot, brown sugar, and pepper and a mortar and pestle and pound to a rough paste.  Add the caramel sauce, soy sauce, fish sauce, oil, and lemongrass, mixing well.  In a large bowl, combine the marinade with the ribs and mix well to coat all of the meat.  Cover the bowl and refrigerate for 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the refrigerator 30 minutes before cooking.  Prepare a medium charcoal fire on your grill, or preheat a gas grill to medium.  Alternatively, position a rack in the upper third of the oven and preheat to 475°F.   Arrange the ribs on a baking sheet lined with foil.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the ribs on the grill rack, or slip the baking sheet into the oven.  Cook for 12 to 15 minutes, or until browned and a little charred on the edges.  Monitor the progress, making sure the ribs cook evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the ribs immediately, garnishing with cucumbers or pickled vegetables if desired.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090807-seriouslyasian-simmered.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090807-seriouslyasian-simmered.jpg\" width=\"500\" height=\"333\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Pork Spareribs Simmered in Caramel Sauce </h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small>Adapted from <em><a href=\"http://www.amazon.com/dp/1580086659/?tag=serieats-20\">Into the Vietnamese Kitchen</a></em> by Andrea Nguyen</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the thick white membrane from the underside of the ribs.  Cut the strips of spareribs between the bones, into individual chunks each containing one bone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the onion, sugar, pepper, and 3 tablespoons of the fish sauce and mix well.  Add the ribs and toss to coat evenly.  Cover and refrigerate for at least 2 hours or overnight.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the refrigerator 45 minutes before cooking.  Prepare a hot charcoal fire on your grill, or preheat a gas grill to high.  Remove the ribs from the marinade and reserve the marinade. Sear the ribs on the grill, turning to cover all sides, for approximately 10 minutes.   Alternatively, broil the ribs on a foil-lined baking sheet for about 8 minutes on each side, or until lightly charred.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the seared ribs, along with their juices and the reserved marinated, to a heavy pot and add the remaining 3 tablespoons of fish sauce and the caramel sauce.  Add water to just cover the ribs.  Bring the pot to a boil, and then lower the heat to a steady simmer.  Cooked covered for 45 minutes; then uncover and cook at a slightly higher heat for 20 minutes, until the ribs are tender and easily pierced through.  The sauce will have reduced.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat and let stand a few minutes so that the fat can rise to the surface.  Skim it off and return the pot to the heat.  Taste the sauce:  add extra fish sauce if needed.  Garnish with green onion, if desired.  Serve immediately.</p>"}]}