{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090309-foodmatters-cover.jpg", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Food Matters: A Guide to Conscious Eating", "Mark Bittman", "salad", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Thai Beef Salad", "link": "https://www.seriouseats.com/recipes/2009/03/thai-beef-salad-recipe.html", "description": "There are only two ounces of meat per person in this recipe, but don't worry—you won't miss a thing. A mix of spicy, sweet, and sour flavors make for a food party in your mouth. I love using flank or...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["8 ounces skirt or flank steak, leftover or raw", "6 cups torn salad greens (mixed greens are nice)", "1 cup torn fresh herb leaves (mint, cilantro, Thai basil, or a combination)", "1/4 cup minced red onion", "1 medium cucumber, peeled if necessary, cut in half lengthwise, seeded, and diced", "1 small fresh hot red chile, like Thai, or to taste, minced", "Juice of 2 limes", "1 tablespoon sesame oil", "1 tablespoon fish sauce (nam pla, available at Asian markets) or soy sauce", "1/2 teaspoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are beginning with raw meat, start a gas or charcoal grill or heat a broiler; the rack should be about 4 inches from the heat source. Grill or broil the beef until medium rare, turning once or twice, 5 to 10 minutes, depending on the thickness; set it aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the lettuce with the herbs, onion, and cucumber. Combine all of the remaining ingredients with 1 tablespoon of water (the dressing will be thin) and use half of this mixture to toss the greens. Remove the greens to a platter, reserving the dressing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the beef thinly, reserving its juice; combine the juice with the remaining dressing. Lay the slices of beef over the salad, drizzle the dressing over all, and serve.</p>"}]}