{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090929-nastybits-chickenduck.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["chicken", "chicken feet", "duck feet", "offal", "poultry", "shiitake mushrooms", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: From Beak to Claw, Chicken and Duck Feet Steamed with Shiitake", "link": "https://www.seriouseats.com/recipes/2009/09/from-beak-to-claw-chicken-and-duck-feet-steamed-with-shiitake-recipe.html", "description": "\"The ghoulish shade of its skin, so unlike the golden-brown hue that we associate with a perfectly roasted bird, appeared more macabre than appetizing.\" [Photographs: Chichi Wang] I learned to speak English by watching a lot of old movies. Carey...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Duck", "Mushrooms", "Offal", "The Nasty Bits"], "recipeIngredient": ["1 whole chicken, preferably with head and feet still attached", "1 pound duck feet, nails clipped", "1 teaspoon salt", "2 tablespoons rice wine, such as Shaoxing or sake", "6 dried shiitake mushrooms", "2 cups water", "A few 2-inch long segments of green onion, plus more green onion, thinly sliced, to top", "6 to 8 thin slices of ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the chicken: Wash the chicken and clip its nails if the feet are intact.  Remove the head and neck with one chop at the base of the neck.  Remove the feet with one chop to each spindly leg. Halve the chicken lengthwise; then separate it into the wings, legs, and thighs. For the body, chop the chicken into 3- or 4-inch pieces.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to a vigorous boil. Place the chicken and the duck feet into the water and boil rapidly for 30 seconds or so to remove any impurities.  Strain the pieces of poultry and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, soak the dried shiitake mushrooms in 2 cups of cold or lukewarm water.  When the mushrooms have been reconstituted, remove them from the broth and reserve the broth for later use. Cut the mushrooms into half-inch sections.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a bowl or insert to be placed inside your steamer or wok.  Place the duck feet into the bowl, along with the mushroom broth and the pieces of ginger. Bring the water at the base of the vessel to boil, with the bowl or insert already in place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam the duck feet for 15 minutes; add the pieces of chicken.  Steam the chicken and duck feet for 40 minutes more. Finally, add the pieces of shiitake mushroom and the green-onion segments, and steam for a final 15 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the hot bowl from the steamer and quickly skim off the fat at the surface of the broth. Top with some thinly sliced green onions. Serve immediately, accompanied by rice or noodles.</p>"}]}