{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090602-bulgur.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["asparagus", "brie", "bulgur", "Italian", "Meat Lite", "Pennsylvania", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Bulgur 'Risotto' with Roasted Asparagus", "link": "https://www.seriouseats.com/recipes/2009/06/bulgur-risotto-roasted-asparagus-recipe.html", "description": "Note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. Photograph by sassyradish on Flickr People often ask me...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["4 to 6 cups homemade chicken stock", "1 bunch (16 spears, about 1 pound) asparagus, woody stems removed and reserved", "1 tablespoon butter, melted", "1 tablespoon olive oil", "1/2 teaspoon kosher salt", "4 ounces pancetta, cut into 1/4-inch cubes", "1 large shallot, minced (about 1/4 cup)", "1 1/2 cup bulgur wheat", "1 ounce sun-dried tomatoes, chopped", "4 ounces of brie, rind removed, cut into small cubes", "Lemon wedges, for squeezing over finished risotto is desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Add your woody asparagus stems to the chicken stock, and bring to a simmer while you roast the asparagus. Toss the asparagus with the butter, oil, and salt, and arrange in one layer on a rimmed baking sheet and roast for about 15 minutes, until the spears become tender and have browned. Cut into 2-inch pieces and set aside. Remove the woody asparagus from the simmering stock and discard. Keep it hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the asparagus is roasting, fry the pancetta in a large sauté pan over medium heat until the fat has rendered and the cubes are brown and crisp, about 10 to 15 minutes. Remove the cubes, leaving 2 tablespoons of pork fat in the pan. Add the shallots and cook until softened, about 8 minutes. Add the bulgur, and stir to coat the grains in the fat and to toast them slightly, about 2 minutes. Add 1 cup of stock and bring to a simmer, stirring occasionally, until the stock has been absorbed. </p>"}]}