{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "cocoa", "dessert", "hot chocolate", "Simon Hopkinson", "snacks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch:  Hot Chocolate Simon Hopkinson Style", "link": "https://www.seriouseats.com/recipes/2009/01/draft-hot-chocolate-simon-hopkinson-style.html", "description": "If you've been following Erin Zimmer's search for the best hot chocolate in New York (<a href=\"http://newyork.seriouseats.com/2008/12/nyc-new-york-best-hot-chocolate-grom.html\">here's a taste</a>) you must be in the mood to make your own serious hot chocolate at home. I know I am, so I was thrilled to come across Simon Hopkinson's easy recipe for hot chocolate in his terrific new book <em>Second Helpings of Roast Chicken</em>. His recipe only made two servings, which is clearly not enough hot chocolate, so I've doubled it.", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["2 1/2 cups whole milk", "9 ounces bitter dark chocolate, broken into bits (I like Guittard)", "6 tablespoons best-quality non-alkalized cocoa powder, like Scharffenberger", "A generous pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scald the milk, then remove from the heat and stir in all the other ingredients. Leave for a few moments so that the chocolate melts, then return to the heat and gently whisk to blend everything together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring back to a gentle simmer, whisk vigorously, and then decant into if possible previously heated mugs. If not, unheated mugs will do.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with a bowl of whipped cream on the side, for spooning in, if so desired (most serious eaters will indeed desire the whipped cream)</p>"}]}