{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090716-chilemorita-thumb.jpg", "author": {"@type": "Person", "name": "homesicktexan"}, "recipeCuisine": "", "keywords": ["barbecue", "chile morita", "dips", "salsas", "Serious Salsa", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Salsa: Chile Morita Salsa", "link": "https://www.seriouseats.com/recipes/2009/07/serious-salsa-chile-morita-salsa.html", "description": "Now, you might think bringing salsa to a barbecue seems out of place. But this wasn't just any barbecue--we were going to be serving barbacoa, which in Texas means slow-smoked cow head. (I could go into the details on how...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Salsa"], "recipeIngredient": ["2 dried chile moritas", "1 pound of tomatillos, husks removed", "1 clove of garlic, unpeeled and cut in half", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the moritas and cook them in a hot dry cast-iron skillet until they inflate and start to pop a little (about two minutes). Into the cast-iron skillet, pour water over the chiles and allow them to soften and become plumper, which will take about half an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, stir the whole tomatillos in another skillet until they blister and black spots appear. Immediately transfer them to a blender. Place the garlic, moritas and a pinch of salt in the blender, and puree until smooth. It will be a deep red color with lots of seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> You can find dried moritas at most Mexican grocery stores. If you are unable to find them, you can use chipotle chiles. If the chipotles are dry, follow the same instructions as for the moritas. But if they are canned and packed in adobo sauce, then forgo the frying and re-hydrating and just add them to the blender along with the other ingredients.</p>"}]}