{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "cheddar", "Gale Gand", "goat cheese", "hash browns", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Cheese and Chive Hash Brown Potato Cakes", "link": "https://www.seriouseats.com/recipes/2009/07/sunday-brunch-cheese-and-chive-hash-brown-pot.html", "description": "I just can't seem to resist any new hash brown recipe I come across. That's especially true if the recipe is called a hash brown potato cake. I just love the way those words sound strung together: hash-brown-potato-cake. I've adapted...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Breakfast and Brunch", "Potato"], "recipeIngredient": ["3 large potatoes, preferably Yukon Gold", "2 large egg white", "1/2 cup rice flour", "1/2 cup crumbled fresh goat cheese or shredded cheddar cheese", "2 tablespoons chopped fresh chives", "1 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "Canola oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate the potatoes in a food processor, and then rinse them in a colander until the water runs clear. Squeeze them dry, first with your hands and then in a kitchen towel. Put them in a large bowl and stir in the egg whites, rice flour,  cheese, chives, salt, and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons canola oil in a large nonstick saute pan on medium-high heat. Scoop 1/2 cup of the potato mixture into the pan and flatten it with the bottom of the measuring cup (or whatever you use to scoop). Repeat, spacing out the cakes but filling the pan as much as possible. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the cakes on one side until golden brown, 3 to 4 minutes. Then flip them and fry on the other side until golden brown, 2 to 3 minutes. Remove them from the pan and drain on paper towels. Keep the cakes warm in a 200-degree oven while you fry with the remaining potato mixture. Serve hot. </p>"}]}