{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091228-unforgettabledesserts.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "baking", "chocolate chip cookies", "cocoa nibs", "coffee", "Cookies", "Dede Wilson", "desserts", "holiday baking", "Unforgettable Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chocolate Chunkocino Cookies", "link": "https://www.seriouseats.com/recipes/2009/12/chocolate-chunkocino-cookies-recipe.html", "description": "After baking up a batch I realized that there was nothing embarrassing about these cookies, save for their unfortunate name. The dough is not that different from the Toll House version, just a bit more brown sugar and less white. The cacao nibs and ground coffee lend a wonderfully <strong>adult bitter richness.</strong> And the extended chill in the fridge makes for cookies that are nice and crunchy on the outside, but chewy and just underdone enough in the center to make them a guilty pleasure.", "totalTime": "", "recipeYield": "about 28 cookies", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["12 ounces bittersweet chocolate, cut into chunks, such as Valrhona Caraibe (66%)", "1 1/2 cups all-purpose flour", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1/2 cup (1 stick) unsalted butter, at room temperature, cut into pieces", "1/2 cup firmly packed dark brown sugar", "1/2 cup sugar", "2 tablespoons cacao nibs, such as Scharffen Berger", "1 tablespoon finely ground coffee, such as French or Italian roast", "1 teaspoon vanilla extract", "1 large egg, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sat aside about 1/2 cup of the chocolate chunks for later use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour, baking soda, and salt together in a small bowl to aerate and combine; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, beat the butter with the flat paddle attachment on medium-high speed until creamy, about 2 minutes. Add both sugars gradually and continue beating on high speed until light and fluffy, about 2 minutes more, scraping down the bowl once or twice; beat in the nibs, ground coffee, and vanilla. Beat in the egg. Add the flour mixture, mixing just until some floury streaks still remain. Add the larger amount of chocolate chunks and beat until just combined. Chill the dough for at least 2 hours or overnight. The dough may be frozen for up to 1 month, wrapped well in plastic and placed in a zipper-top plastic bag; defrost in the refrigerator overnight before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the upper and lower third of the oven. Preheat the oven to 325&deg:F. Line 2 jelly-roll pans with parchment paper; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop by generously rounded tablespoon (I use a <a href=\"http://www.cooksworld.com/Merchant3/merchant.mv?Screen=PROD&Store_Code=CW&Product_Code=2040&Category_Code=icecreamandcookiescoops\">Zeroll #40 scoop</a>) 2 inches apart on the prepared pans. Using the reserved chocolate chunks, press pieces of chocolate on top of each cookie. Bake for 10 to 12 minutes, until light golden brown. The cookies will be a little soft in the center and firmer around the edges. Cool on the pans set on racks for 5 minutes, then slide the parchment onto the racks to cool the cookies completely. Store at room temperature for up to 3 days in an airtight container in single layers separated by parchment paper. </p>"}]}