{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091106-seasian-cookinglobster.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Thai", "keywords": ["cracking the coconut", "lobster", "Madhur Jaffrey", "Seriously Asian", "Thai curry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: Thai Curries, Part One: Lobster in Yellow Curry Sauce", "link": "https://www.seriouseats.com/recipes/2009/11/thai-curries-part-one-yellow.html", "description": "[Photographs: Chichi Wang] Taking a hiatus from my usual spoilsport-y self, I caved into the pressure of Halloween and served a menu built around orange foodstuffs. To start, a persimmon and daikon salad. To end, a kabocha cheesecake. The entrée...", "totalTime": "", "recipeYield": "3-4", "recipeCategory": ["Lobster and Crab", "Thai"], "recipeIngredient": ["14-ounce can of coconut milk, left undisturbed for several hours", "4 tablespoons vegetable oil", "6 tablespoons <a href=\"http://www.seriouseats.com/recipes/2009/11/yellow-curry-paste.html\">yellow curry paste</a>", "1 teaspoon hot curry powder, or 1/2 teaspoon cayenne pepper", "Salt to taste, about 1 teaspoon", "2 live lobsters, about 1 1/2 pounds each", "3 to 4 kaffir lime leaves, or 6 basil leaves as a garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the sauce: Open the can of coconut milk and skim off the top layer of thick cream, about 4 tablespoons worth. Stir the remaining milk to reincorporate the coconut cream.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large, nonstick lidded pan and set over medium heat. When the oil is hot but not smoking, add the coconut cream and the yellow curry paste. Stir the paste around until it is lightly browned and the oil has separated from the coconut in the cream. You have just cracked the coconut.  Now, add the curry powder and stir a few times. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the liquids: the coconut milk and about 1/2 cup of water to thin it out. You can add more or less water, depending on your preference for the consistency.  Add salt to taste.  Stir and bring to a simmer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pot and simmer for another 5 minutes or so over low heat.  This may all be done in advance and kept covered for 2 to 3 hours.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the lobster: Twist off the tail from the head of the body.  Then twist off the legs and set aside. Twist off the front claws. Using a cleaver or a heavy knife, hack the claws into 3 sections and set aside. Do the same for the tail, cutting it into 3 or 4 sections. For the head, reach inside and remove the stomach sac. Now split the head into two, lengthwise. Reserve the tomalley in a small bowl.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve, bring the curry sauce back to a simmer.  Put in all the lobster pieces and stir gently. Bring the curry sauce to a simmer and cover the pot, cooking gently for 10 minutes. Occasionally, stir the lobster around and spoon the sauce over the lobster. Simmer just until the lobster meat is cooked through, taking care not to overcook the meat. Towards the last two minutes of cooking, add the tomalley and stir gently. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the kaffir or basil leaves, and add to the pot.  Serve immediately.  </p>"}]}