{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090519PurplePotatoTrout.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French", "French in a Flash", "potatoes", "trout"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Purple Potato-Crusted Trout a la Francaise", "link": "https://www.seriouseats.com/recipes/2009/05/purple-potatocrusted-trout-a-la-francaise-recipe.html", "description": "\"The key to dressing like a French woman is to remember that every woman is a sun in the blue sky. Clouds only diminish; moons only eclipse.\" For all the finery of Paris's Baroque buildings, for all the playful hues...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Fish", "French", "Potato"], "recipeIngredient": ["4 1/2-pound filets of trout", "1/4 cup olive oil", "Salt and pepper", "4 medium or 8 small purple potatoes, sliced chip fine on a mandolin", "6 tablespoons unsalted butter", "Juice of 1 lemon", "Zest of 1 lemon", "1/4 cup whole fresh parsley leaves", "<h5>A Note on Some Ingredients</h5>", "I love the thin, flakey filet of <strong>trout</strong> for this dish, but you could use any flakey white fish.  Tilapia or snapper would be especially nice.", "If you cannot find <strong>purple potatoes</strong>, sometimes called Peruvian purple potatoes or blue potatoes, just use a simple new potato instead."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 500&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub both sides of each filet with just shy of 1 tablespoon of olive oil, and season with salt and pepper.  Spray a foil-lined baking sheet with nonstick spray, and lay the filets skin-side down on the pan. Tile the top of the trout with the slices of purple potato, overlapping them like shingles. Season the potato with salt and pepper as well, and drizzle with the remaining oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast for 12 minutes, then broil for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the lemon brown butter sauce.  Melt the butter in a small sauté pan over medium heat.  Allow the butter to begin to foam and froth, and finally it will begin to turn golden around the edges.  Once this starts to happen, the butter will burn very quickly, so you don't want to walk away.  Just when the butter turns golden, take the pan off the heat, stand back, and add the lemon juice.  Season with salt and pepper, and add the lemon zest, and parsley.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Present the fish on a platter, and spoon some of the sauce à la française on top.</p>"}]}