{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090607barcelona.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Spanish", "keywords": ["Andy Pforzheimer", "Cook the Book", "crepes", "desserts", "dulce de leche", "Sasa Mahr-Batuz", "spanish", "The Barcelona Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Crepas Salguero", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-crepas-salguero.html", "description": "I've alway thought of making dulce le leche at home as a bit of molecular gastonomy. It's pretty easy, just simmer a can of sweetened condensed milk on your stove top for a few hours and the contents of the...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Crepe", "Desserts", "Spanish"], "recipeIngredient": ["<strong>Crepes</strong>", "Two 12-ounce cans condensed milk", "1 cup all-purpose flour", "1 cup milk", "1/2 cup water", "1 large egg", "1 tablespoons butter, melted", "2 tablespoons sugar", "<strong>Chocolate Sauce</strong>", "1 pound semisweet or bittersweet chocolate, coarsely chopped, or 1 pound semisweet or bittersweet chocolate chips", "1 1/2 cups heavy cream", "1/2 cup brewed coffee", "2 cups whipped cream, sweetened if desired, for serving", "2 pints vanilla ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the <em>dulce de leche</em>:  Remove the labels from the cans of condensed milk and submerge them in a large pot filled with water.  Bring to a boil over high heat, reduce to a rapid simmer for about 4 hours.  Add water as needed.  Check often to make sure that the can are always covered with water by at least 1 inch; otherwise they could explode.  Remove the cans from the water and let them cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, mix together the flour, milk, ware, egg, and melted butter.  Whisk by hand for about 2 minutes.  Add the sugar and whisk for 2 minutes longer.  Strain through a fine-mesh sieve into a bowl and let the crepe batter rest for about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the chocolate sauce:  Put the chocolate in a microwave-safe bowl and microwave for 2 1/2 to 3 minutes, or until softened and shiny.  The chocolate will not melt completely.  Add the cream and coffee and stir until smooth.  Set aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 9-inch nonstick pans over low heat.  If you have seasoned 9-inch crepe pans, use them.  Spray lightly with vegetable oil spray and ladle 3 tablespoons of crepe batter into the pans.  Tip and roll the pans to spread the batter evenly over the bottom of the pans and cook for about 2 minutes.  Using a spatula, flip the crepes and cook for 2 minutes longer, or until lightly browned.  Lift the crepes from the pans and stack on a plate.  These crepes do not stick to one another.  Continue cooking the crepes until you have 16.  Expect to throw out the first crepe in each pan; this is typical, as anyone who has made crepes knows.  The first one never works, and after it has flopped, the pan is seasoned appropriately so that the rest are prefect.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the cans of boiled condensed milk.  The milk will be caramel brown and thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the crepes out on a work surface.  Spread a thick stripe - about 2 tablespoons - of the <em>dulce de leche</em> (the boiled condensed milk) down the center of each crepe.  Top the </em>dulce de leche</em> with an equal-sized stripe of whipped cream.  Roll the crepes like a cigar and put 2 crepes on each plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle about 3 tablespoons of the chocolate sauce over the crepes and serve with ice cream.</p>"}]}