{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091210-seriouscookies-cookies.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "bars", "cinnamon", "Cookies", "desserts", "holiday baking", "holidays"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Serious Cookies: Swiss Cinnamon Crisps", "link": "https://www.seriouseats.com/recipes/2009/12/serious-cookies-swiss-cinnamon-crisps-recipe.html", "description": "[Photographs: Gina DePalma] When it comes to holiday baking, I find that is always necessary to balance the more intricate and time consuming cookies with those that require little effort, no waste and optimal taste. These Swiss Cinnamon Crisps fit...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["3 cups unbleached all-purpose flour", "1 teaspoon kosher salt", "1 tablespoon ground cinnamon", "1 cup (2 sticks, 8 ounces) unsalted butter, softened", "1/2 cup light or dark brown sugar (I used dark)", "3/4 cup granulated sugar", "1 egg", "1 teaspoon pure vanilla extract", "Finely grated zest of 1 lemon", "<strong>Topping:</strong>", "1 egg", "2 tablespoons milk", "1/4 cup granulated sugar", "1 tablespoon ground cinnamon "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the flour, salt, and cinnamon together and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the butter and both sugars in the bowl of an electric mixer and use the paddle attachment on medium speed to cream them together until light and fluffy, about 1 minute. Beat in the egg, vanilla, and lemon zest, stopping once to scrape down the sides of the bowl, until the egg is completely incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On low speed, slowly beat in the flour mixture, then increase the speed to medium and beat the dough until it comes away from the sides of the bowl.  Shape the dough into a large disc and wrap it in a sheet of plastic; refrigerate for at least one hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to bake the cookies, remove the dough from the refrigerator to slightly soften it while you preheat the oven to 350&deg;F and position the racks to the center of the oven. Spray two cookie sheets or rimmed sheet pans lightly with non-stick cooking spray and line them with parchment paper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the topping by whisking together the milk and egg well in small bowl. In another bowl, stir the 1/4 cup granulated sugar and 1 tablespoon ground cinnamon. Set both aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into three pieces; work with one piece at a time, keeping the other pieces in a cool part of the kitchen. On a lightly floured board, roll the dough into a rectangle shape, 1/8th of an inch thick. Using a sharp knife or fluted pastry wheel, cut the dough into long strips and then into rectangles about 1 1/2 to 2 inches long; squares work well too. (Alternatively, use your favorite cutters to stamp out the cookies into desired shapes).   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the dough strips 1/2-inch apart on the baking sheet. Using a pastry brush, glaze the top of each cookie with the egg and milk mixture and sprinkle them generously with the cinnamon sugar mixture.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies 10 to 12 minutes, or until they are nicely golden brown. Rotate the baking sheets halfway through the baking time to ensure even browning.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the cookies to cool for one minute on the sheet, and then slide them onto a wire rack to cool completely. Repeat as necessary with the remaining pieces of dough.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the cookies up to 2 weeks in an airtight container.</p>"}]}