{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090109mediterranean_diet_cookbook.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Mediterranean", "Nancy Harmon Jenkins", "soups", "The New Mediterranean Diet Cookbook", "turkish", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Turkish Yogurt Soup with Mint", "link": "https://www.seriouseats.com/recipes/2009/01/nancy-harmon-jenkins-turkish-yogurt-soup-with-mint-recipe.html", "description": "Tart and refreshing, today's Cook the Book recipe is Turkey's take on lemony avgolemono. Nancy Harmon Jenkins' yogurt soup with mint starts with the same chicken broth as the Greek favorite, but uses yogurt instead of lemons to deliver tang....", "totalTime": null, "recipeYield": "6 to 8 servings", "recipeCategory": ["Cook the Book", "Soups and Stews"], "recipeIngredient": ["6 cups chicken stock", "3 cups plain yogurt (low-fat or non-fat if you prefer)", "1 egg yolk", "1 cup cold water", "1 1/2 tablespoons unbleached all-purpose flour", "1 cup chopped cooked chicken (use some of the chicken with which you made the stock)", "1/4 cup cooked hulled wheat, farro, or rice", "Sea salt and freshly ground pepper", "A handful of fresh mint leaves, torn in pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the chicken stock to a simmer over medium heat while you prepare the yogurt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tip the yogurt into a bowl and beat lightly with a wire whisk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate small bowl, whisk the egg yolk with a little of the cold water, then whisk in the flour. Mix carefully so there are no lumps, adding water from time to time until you have added all the water. Now beat the egg mixture into the yogurt, again whisking thoroughly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the stock is simmering, beat the yogurt mixture into the soup, a little at a time. The yogurt should not come to a boil but it should cook at just below a simmer while the stock thickens to a cream. This will take about 10 minutes but at no time should the soup come to a boil. When the soup is the consistency of light cream, add the cooked chicken and wheat, farro, or rice. Taste and add salt and freshly ground pepper, preferably white pepper. As soon as the chicken and grains are hot, the soup is ready to be served, garnished with the torn mint leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Caution: Do not let the soup come to a rolling boil for fear the egg will curdle and spoil the texture. If you must reheat the soup, be very careful not to overdo it. Whisk the soup fairly constantly as it is reheating.</p>"}]}