{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091227french%20toast.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["French toast", "grilled cheese", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Apple-Gruyère French Toast", "link": "https://www.seriouseats.com/recipes/2009/12/sunday-brunch-apple-gruyere-french-toast-recipe.html", "description": "[Photograph: Robin Bellinger] I don't love French toast, but as soon as I saw Melissa Clark's challah-based recipe for apple-gruyère French toast with red onion, I knew I had to try it. These are a few of my favorite things,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["French Toast"], "recipeIngredient": ["Two 1 3/4-inch-thick slices challah bread from middle of loaf", "2 ounces grated Gruyère cheese (about 3/4 cup)", "1/4 small red onion, very thinly sliced (I used a mandoline)", "2 large eggs, lightly beaten", "3/4 cup whole milk", "1/4 teaspoon kosher salt", "1/4 teaspoon ground black pepper", "2 tablespoons extra virgin olive oil", "1 small apple, cored, quartered and very thinly sliced (I used a mandoline here, too)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put one slice of bread on your work surface, the bottom crust nearest you. Cut into bottom crust, parallel to work surface, to make a pocket. Do not cut all the way to top of slice; bread should remain attached there. Gently stuff half the cheese and onion slices in pocket. Repeat with other slice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk together the eggs, milk, salt and pepper. Pour custard into a wide, shallow dish. Soak stuffed bread in custard, turning once halfway through, until most of the liquid has been absorbed, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large skillet over medium heat. Add half the apple slices in a single layer and cook for 1 minute. Place bread slices in pan, covering apples. Arrange remaining apple slices on top of bread; cook 1 minute more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium low (or perhaps low, if you are using a cast-iron skillet or cooking on a powerful burner), cover and cook for 5 minutes. (Since my skillet does not have a cover, I used aluminum foil to make a little lid.) Peek underneath halfway through to make sure the bottom of the bread is not browning too much; if it seems to be, lower the flame or move on to the next step right away, depending on how far gone it is. Uncover and increase heat to medium; cook until bottoms are golden, about 2 minutes. Carefully turn bread and apples and cook until bread is golden and cheese is melted, 3 to 5 minutes. </p>"}]}