{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090928-brownies-cut.jpg", "author": {"@type": "Person", "name": "Tam Ngo"}, "recipeCuisine": "", "keywords": ["baking", "Bay Area", "brownies", "chocolate", "coffee", "salt", "San Francisco", "Scharffen Berger", "supermarkets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "4"}, "name": "Recreating the Adult Brownies from Andronico's", "link": "https://www.seriouseats.com/recipes/2009/09/adult-brownie-chocolate-salt-coffee-andronicos-supermarket-san-francisco-recipe.html", "description": "The Adult Brownie from the Bay Area-based supermarket chain Andronico's doesn't contain alcohol, tobacco, or any other \"adult\" ingredients. It's just a super dense, fudgy chocolate brick spiked with sea salt and coffee. And it's incredibly addictive.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts"], "recipeIngredient": ["12 tablespoons (1 1/2 stick or 6 ounces) unsalted butter, cut into cubes", "8 ounces Valrhona Lacté (41% cocoa) / milk chocolate, coarsely chopped", "8 ounces Valrhona Grand Cru Noir Manjari (64% cocoa) / dark milk chocolate, coarsely chopped", "1 1/2 cup granulated sugar", "4 large eggs, room temperature", "2 tablespoons vanilla", "1/2 cup all-purpose flour, sifted", "1 teaspoon fleur de sel or sea salt", "1 tablespoon instant coffee powder ", "3 ounces dark chocolate, cut into large chunks (optional)", "Softened butter, cocoa powder for dusting pan", "<a href=\"http://www.flickr.com/photos/tamngo/3960913631/in/set-72157594563899384/\"><img alt=\"20090928-brownies.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090928-brownies.jpg\" width=\"500\" height=\"375\" class=\"mt-image-none\" style=\"\" /></a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a baking rack in the lower third of the oven and preheat to 325°F. Cut a piece of parchment with handles for an 8\" x 8\" x 2\" anodized pan. Butter the top side of the parchment and dust with cocoa powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Create a double boiler on very low heat: in a large metal bowl overlapping a small pot of gently simmering water, place the chocolate and cubed butter. Stir occasionally until just melted. Remove from heat and stir until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the chocolate mixture has cooled to touch, use a large rubber spatula or wooden spoon and beat sugar and vanilla into the chocolate mixture. Next, beat in the eggs, one at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour, salt, and coffee and mix vigorously by hand for 5 minutes. At this point, the batter will be glossy and pull away from the sides of the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you prefer your brownies extra chunky, gently fold chocolate chunks into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into the prepared pan and tap the pan on a counter top to even out the batter. Bake for 22 minutes, take out the pan, and tap the pan on the counter twice to further even out and condense the batter. Rotate and reinsert the pan to bake for another 22 minutes (or until a skewer inserted in the center comes out moist but free of uncooked batter).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and place on a cooling rack for 10 minutes. Remove the brownies from the pan using the parchment handles and place the brownies on the rack. Cool completely before cutting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Notes</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Flour:</strong> A 1/2 cup of flour yields a fluffier brownie. Reducing the recipe to a 1/4 cup of flour results in a more compressed brownie that tastes slightly more bitter of dark chocolate. The brownies will also seem oilier coming out of the oven but the oil is reabsorbed by the brownie the longer it's allowed to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate:</strong> Use the best you can get your paws on. <a href=\"http://www.valrhona.com/\">Valrhona</a>'s great for its nice balance of the creamy and bitter&mdash;its flavors bloom in the mouth in a languid, pleasing way. <a href=\"http://www.chocolates-elrey.com/\">El Rey</a> is also a fine substitute for its fruitier notes. <a href=\"http://www.callebaut.com/\">Callebaut</a> is good and though bland, it has great mouthfeel. (Unfortunately, the taste of Scharffen Berger chocolate is strangely wooden and flat.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Eggs:</strong> Using large eggs results in a denser brownie, while extra large eggs yield a puffier, fluffier brownie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mixing method:</strong> To create a crackly, durable brownie top, it is important to put aside the electric beater and mix the batter by hand. (I especially enjoy the contrast between my brownie-gut and my brownie-buff arms after this upper body work-out.) </p>"}]}