{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090511PainauChocolatInside-thumb.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["baking", "cinnamon rolls", "French", "French in a Flash", "pain au chocolat", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Pain au Chocolat Cinnamon Rolls with Crème Fraîche Icing and Walnuts", "link": "https://www.seriouseats.com/recipes/2009/05/french-in-a-flash-pain-au-chocolat-cinnamon-rolls-recipe.html", "description": "Flaky, buttery chocolate croissants take the form of muffins, and are flavored like cinnamon buns, replete with crunchy toasted walnuts, cinnamon sugar, and, of course, the requisite frosting, made rich and tangy with a dollop of crème fraîche.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "French", "Nuts"], "recipeIngredient": ["1/4 cup white sugar", "1/4 cup brown sugar", "1 tablespoon cinnamon", "2 sheets bought frozen puff pastry, thawed but cold", "2 tablespoons melted unsalted butter, cooled", "6 tablespoons chopped toasted walnuts", "1/2 cup dark chocolate chips", "1 cup powdered sugar", "2 tablespoons crème fraîche", "2 tablespoon half and half", "<h5>A Note on Some Ingredients</h5>", "Think ahead when using store-bought <strong>puff pastry</strong>.  The best way to do so is by tossing the pastry from the freezer to the fridge before you go to sleep.  It will be perfect in the morning.", "To toast <strong>nuts</strong>, I usually scatter the nuts on a baking sheet and place them in an oven between 300 and 350°F for 10 minutes.  You can also toast them in a dry pan. When you can smell them and they begin to get golden cheeks, they're ready. I often toast more then I need, then store them in the freezer to keep them from spoiling.", "Use great quality dark <strong>chocolate chips</strong> here.  You'll notice the difference. They are the star of the show.", "As I always say, if you want to make your own <strong>crème fraîche</strong> cheaply at home, simply stir together equal parts heavy cream and sour cream, and let stand in the fridge overnight. "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the 2 sugars and the cinnamon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out both sheets of puff pastry slightly, into two identical squares.  Brush the pastry all over with the cooled melted butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter half the cinnamon sugar all over one puff pastry square, and the other half all over the other. Do the same with the walnuts, and the chocolate chips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the sweetened puff pastry squares up into logs, as if you were making a jelly roll. Using a serrated knife, trim just the edges off the sides of the logs. Then cut each log into 6 identical Pain au Chocolat Cinnamon Rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a 12-cup muffin pan with nonstick cooking spray.  Into each muffin cup, place one cinnamon roll, swirl-side up.  Bake for 25-30 minutes.  Check them at 25 minutes, and they should be golden and puffed.  If not, allow them to go for a few more minutes, but you want to pull them before golden turns to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the glaze.  In a bowl, whisk together the powdered sugar, crème fraîche, and half and half until the glaze has a smooth, even consistency.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cinnamon rolls are done in the oven, transfer them to a plate and allow them to cool slightly.  When they are still warm, but no longer hot, drizzle the crème fraîche icing all over the tops of the Pain au Chocolat Cinnamon Rolls. Allow the glaze to set for about 5 minutes, and serve still warm.</p>"}]}