{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090804-burgerandfries.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["beef", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Burger and Fries", "link": "https://www.seriouseats.com/recipes/2009/08/hubert-keller-burger-and-fries-recipe.html", "description": "Photograph by Bill Milne This \"burger\" consists of a meat patty encapsulated in a \"bun\" of crispy shredded potatoes. While I would usually stray from a knife-and-fork burger, I welcome the idea of meat coated in a mass of crispy...", "totalTime": "", "recipeYield": "4", "recipeCategory": [], "recipeIngredient": ["1 1/2 pounds coarsely ground chuck, chilled", "2 1/2 pounds russet potatoes, peeled", "Sea salt and freshly ground black pepper", "1 large egg white, beaten", "3 tablespoons olive oil, plus more as needed", "1 handful baby greens or Fried Herbs (<a href=\"#friedherbs\">recipe below</a>)", "1/2 pint basket cherry tomatoes, quartered", "Red Wine, Thyme, and Shallot Sauce (<a href=\"#redwine\">recipe below</a>)", "Pick over the herbs, reserving the leaves and discarding the stems. Pat the leaves dry with paper towels. Heat the oil in a deep saucepan over medium-high heat to 350°F. Have a splatter guard ready. Toss the herbs into the oil and immediately place the g", "<a name=\"redwine\"></a><h4>Red Wine, Thyme, and Shallot Sauce</h4>", "<em>- makes about 1 cup -</em>", "<h5>Ingredients</h5> ", "2 teaspoons olive oil", "2 tablespoons very finely chopped shallot", "1 garlic clove, very finely chopped", "1/2 cup dry red wine", "1 1/2 Quick Chicken Stock or packaged low-sodium chicken broth", "1 1/2 teaspoons finely chopped fresh thyme", "1 tablespoon ruby port", "1 1/2 teaspoons cornstarch", "Sea salt and freshly ground black pepper", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Handling lightly to keep the texture light and juicy, divide the meat into 4 evenly sized patties about 1 inch thick. The burgers can be shaped and refrigerated, covered, for several hours or overnight. Let the meat come to room temperature before cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a mandoline, julienne the potatoes into the finest possible strips. Put them in a bowl and season with salt and pepper to taste. Toss to mix well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, preheat the oven to 450&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the burger patties in potatoes only just before cooking. Brush the patties with the beaten egg white. Enclose the potatoes in a clean kitchen towel and press to rid them of excess water. Divide the potatoes into 8 equal piles. Spread one pile on a work surface, top with a patty, and then spread another pile of potatoes on top and all around the meat. Gently but firmly press the potatoes around the meat, working the patty between your hands to form a tight package and to completely cover the meat with the potatoes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large, ovenproof, nonstick skillet over medium-high heat until very hot. Place the burgers in the skillet and cook without moving them until the potatoes begin to turn golden brown and crisp, about 3 minutes. Regulate the heat to prevent burning. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the burgers and place in the oven for 8 to 9 minutes for medium-rare. Add more oil to the skillet as needed so the potatoes do not stick or burn. (It might be helpful here to use a meat thermometer. It should register 125°F for medium-rare meat.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To build the burgers,</strong> center the burgers on warm plates. Garnish with a pinch of baby greens or fried herbs. Scatter a few cherry tomatoes and greens around the burgers and serve immediately with the sauce on the side, or spoon a circle of sauce around the burgers. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"friedherbs\"></a><h4>Fried Herbs</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 1 1/2 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, heat the olive oil over medium heat. Add the shallot and cook, without browning, stirring occasionally, until the shallot is tender and translucent, about 5 minutes. Add the garlic, stir, and cook for another minute. Add the wine, bring to a boil, and cook until the pan is nearly dry, about 5 minutes. Swirl the pan as the wine reduces in order to see clearly to the bottom of the pan. Stir in the stock and thyme and return the sauce to a gentle simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the port and cornstarch. Whisk this mixture into the sauce and continue to simmer gently, uncovered, for 6 to 10 minutes. Taste for seasoning and adjust with salt and pepper. The sauce can be made a day ahead and refrigerated, covered. Reheat gently over low heat. Just before serving, swirl in the butter. </p>"}]}