{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baking", "buttermilk", "Cook the Book", "desserts", "Karen DeMasco", "The Craft of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Glazed Buttermilk Cake Doughnuts", "link": "https://www.seriouseats.com/recipes/2009/10/glazed-buttermilk-cake-doughnuts-recipe.html", "description": "The <strong>buttermilk and lemon zest</strong> added a slight tang, the cinnamon and nutmeg brought to mind the fall flavors, and the glaze made these little guys sparkle.  Doughnuts tend to brighten any day, and this was no exception.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Doughnuts"], "recipeIngredient": ["3/4 cup buttermilk", "1 large egg", "3 large egg yolks", "1/3 cup grapeseed oil", "3 3/4 cups cake flour, plus extra for dusting", "1 cup granulated sugar", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1 1/2 teaspoon cinnamon", "1/4 teaspoon freshly grated nutmeg", "1 teaspoon kosher salt", "Finely grated zest of 1 lemon", "Nonstick cooking spray", "2 cups confectioners' sugar", "Peanut oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bow, whisk together the buttermilk, egg, egg yolks, and grapeseed oil.  Sift 2 cups of flour into another bowl and set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, combine the remaining 1 3/4 cups flour, the granulated sugar, baking powder, baking soda, cinnamon, nutmeg, salt, and lemon zest.  Mix on low speed just to combine.  Add the buttermilk mixture and continue mixing just until the dough comes together.  Remove the bowl from the mixer, and using a spatula, gently fold in the reserved flour.  The dough will be very sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a 12 x 14-inch sheet of waxed paper.  Place a second sheet of waxed paper on top, and roll out the dough between the paper to an 8 x 10-inch oval, about 3/4 inch thick.  Set the dough, still between the sheets of waxed paper, on a baking sheet and freeze until it is firm enough to cut, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the freezer and remove the waxed paper.  Dust the dough with flour and replace the waxed paper.  Flip the dough over; remove an discard the bottom sheet of waxed paper.  Now the dough is loosened from the waxed paper and is easy to cut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat a baking sheet with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a floured 3-inch round cutter or inverted drinking glass, cut out doughnuts.  Cut out the centers with a floured 1-inch cutter.  Transfer the doughnuts to the prepared baking sheet.  Re-roll the scraps and repeat to make a total of 13 doughnuts and 13 holes.  Cover with plastic wrap and chill in the refrigerator for at least 30 minutes or up to 1 day (if making the dough ahead, bring it to room temperature just before frying.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before frying the doughnuts and holes, prepare the glaze; in a wide, shallow bowl, whisk together the confectioners' sugar and 1/4 cup hot water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large high-sided skillet or a wide pot, heat 2 inches of oil to 350&degF.  Working in batches of 3, fry the doughnuts, carefully turning them with a wire skimmer or slotted spoon halfway though, until golden brown, about 1 1/2 minutes per side.  Transfer the doughnuts to paper towels to drain, and then immediately dip one side of each doughnut into the glaze.  Transfer them, glaze side up, to a rack set over a baking sheet, and let sit until the glaze sets, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the doughnut holes for 1 minute per batch.  Drain, dip in the glaze, and transfer to the wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the doughnuts warm or at room temperature on the day they are fried.</p>"}]}