{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091229-greentea.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "baking", "Cookies", "Dede Wilson", "desserts", "holiday baking", "matcha", "shortbread", "tea", "Unforgettable Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Matcha Tea Leaf Shortbreads", "link": "https://www.seriouseats.com/recipes/2009/12/matcha-tea-leaf-shortbreads-recipe.html", "description": "With my tea obsession in full swing I was thrilled to see this recipe for <strong>Matcha Tea Leaf Shortbreads</strong> in <strong><em><a href=\"http://www.amazon.com/Unforgettable-Desserts-Dede-Wilson/dp/0470186496/serieats-20\">Unforgettable Desserts</a></em></strong> by <strong><a href=\"http://dedewilson.blogspot.com/\">Dede Wilson</a>.</strong> They are little shortbreads cut into the shapes of leaves with the addition of <a href=\"http://en.wikipedia.org/wiki/Matcha\">matcha</a>, a powdered form of green tea incorporated into the dough.", "totalTime": "", "recipeYield": "about 80 two-inch cookies", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 1/4 cups all-purpose flour", "1/4 teaspoon salt", "1 cup (2 sticks) unsalted butter, at room temperature, cut into pieces", "1 to 2 tablespoons matcha (powdered green tea), to taste", "1/2 cup sugar", "1 tablespoon coarse sanding sugar, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line 2 jelly-roll pans with parchment paper; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour and salt together in a small bowl to aerate and combine; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, beat the butter with the flat paddle attachment on medium-high speed until creamy, about 3 minutes.  Add the matcha and beat until the mixture is a uniform green color and very creamy.  Add the sugar gradually and continue beating on high speed until very light and fluffy.  Turn the machine off, add one third of the flour, then turn the machine on low speed.  Gradually add the remaining flour, mixing just until blended, scraping down the sides of the bowl once or twice.  The mixture will look crumbly; if you squeeze it between your fingers, it will come together.  Gather it together into a ball with your hands while its still in the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the dough to a 1/4-inch thickness between two sheets of lightly floured parchment paper.  Peel off the top parchment and cut the dough in half.  Sprinkle the sanding sugar evenly over one half of the cookie dough and gently, with hardly any pressure, roll over it with a rolling pin to help it adhere.  Using a 2 x 1-inch leaf-shaped cookie cutter, cut out as many cookies as possible from both doughs and place on prepared pans 1 inch apart.  Use the back of a sharp paring knife to make vein patterns in each cookie.  Refrigerate for 1 hour or up to overnight, if desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the upper and lower third of the oven.  Preheat the oven to 325&deg:F.  Bake for 17 to 25 minutes, or until the cookies are dry and firm to the touch; their color will not change.  They should retain their shape if you try to pick one up and there should also be a fragrant butter and matcha scent eminating from the oven.  Cool, on the pans set on racks for a couple of minutes, then carefully transfer the cookies to racks to cool completely.  Store at room temperature for up to 2 weeks in an airtight container.</p>"}]}