{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090806-mushrooms.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["beef", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mushroom Beef Burger", "link": "https://www.seriouseats.com/recipes/2009/08/mushroom-beef-burger-recipe.html", "description": "Photograph from ne* on Flickr / CC BY-SA 2.0 Grilled mushrooms in the patty and grilled mushrooms in the mayonnaise-based topping makes for a very mushroomy burger. Keller suggests serving it with a side of asparagus seasoned with olive oil,...", "totalTime": null, "recipeYield": "4 servings", "recipeCategory": ["Beef", "Burger", "Sandwiches"], "recipeIngredient": ["About 1/2 cup olive oil", "1 tablespoon plus 1/4 teaspoon finely chopped fresh thyme", "1 teaspoon freshly grated lemon zest", "1/2 pound (about 5 medium) portobello mushrooms, stems removed", "Sea salt and freshly ground black pepper", "1 pound asparagus", "2 pounds coarsely ground chuck, chilled", "1/2 cup finely chopped red onion", "1 tablespoon Dijon mustard", "1/2 cup mayonnaise", "4 ciabatta buns", "4 large slices (about 6 ounces) Brie cheese", "1 large ripe tomato, thickly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow container, whisk together 3 tablespoons of the olive oil, 1 tablespoon of the thyme, and the lemon zest. Add the mushrooms and turn to coat them on all sides, Set aside to marinate for about 30 minutes. The mushrooms will absorb all the marinade. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the asparagus, bring a pot of water to a boil and add salt. Trim the spears to an even 4-inch length. If the skin is tough, peel the bottom 2 inches of the stalks. Blanch the asparagus in the boiling water for about 2 minutes, drain, and spread out on a baking sheet to cool. Toss with a little olive oil and season with salt and pepper. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Build a medium-hot fire in a barbecue or place a grill pan over medium-high heat. Grill the mushrooms, turning as needed, and brushing with a little olive oil if they seem dry, until they are well browned and tender, about 10 minutes. Remove to a chopping board, let cool, and cut them into small dice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the meat with two-thirds of the mushrooms, the onion, mustard, and 1 1/2 teaspoons pepper. Knead gently until the ingredients are evenly mixed. Handling lightly to keep the texture light and juicy, divide the meat into 4 evenly sized patties about 1 inch thick. The burgers can be shaped and refrigerated, covered, for several hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, mix together the remaining mushrooms with the remaining 1/4 teaspoon thyme and the mayonnaise. Cover and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, heat 2 more tablespoons of the olive oil in a large skillet or grill pan over medium-high heat until very hot or build a medium-hot fire in a barbecue. Generously season the meat on both sides with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the burgers in the skillet, turning once or twice, for 7 to 10 minutes for medium-rare. Do not press down on the patties. With a large spoon, baste the burgers several times with the fat in the pan. (You can also preheat the oven to 450&deg;F and cook the burgers on top of the stove until they are brown on both sides, and then finish them in the oven.) To grill the burgers, oil the grate, arrange the patties on it, and cover. Cook as above. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the burgers cook, toast the buns in a toaster oven or under the broiler, about 5 inches from the heat, until lightly toasted. Or toast them on the outer perimeter of the grill rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the last minute or two of cooking, drape a slice of cheese over each burger to melt. Then remove them to a warm platter, keep warm, and let rest for several minutes before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To reheat the asparagus, in another large skillet, heat 1 tablespoon olive oil over medium-high heat until hot. Add the asparagus and cook, turning often, until tender and lightly browned, about 3 minutes. You can also reheat the spears on the grill, turning them frequently. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To build the burgers, spread each bun bottom with about a tablespoon of the mushroom mayonnaise. Arrange several asparagus spears on the bun bottoms, then the tomato slices, and then the burgers. Add another dollop of mushroom mayonnaise. Cover with the bun tops and serve immediately. </p>"}]}