{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["Baking Unplugged", "bread pudding", "Cook the Book", "desserts", "Nicole Rees", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Anytime Bread Pudding", "link": "https://www.seriouseats.com/recipes/2009/01/nicole-rees-baking-unplugged-anytime-bread-pudding-recipe.html", "description": "The following recipe is from the January 28th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Nicole Rees, author of Baking Unplugged, calls this dish \"anytime\" bread pudding because she loves to...", "totalTime": "", "recipeYield": "9 servings", "recipeCategory": [], "recipeIngredient": ["2 cups milk", "1/2 cup raisins", "1 1/2 cups heavy whipping cream", "1 cup sugar", "1/4 cup dark rum", "2 teaspoons vanilla extract", "Pinch of freshly grated nutmeg", "4 large eggs", "1 (1-pound) artisan bread loaf, preferably sourdough, cut into 1-inch squares (about 6 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, heat the milk with raisins over medium heat until the milk is very warm but not boiling. Pour into a large bowl and whisk in the cream, sugar, rum, vanilla, and nutmeg. Whisk in the eggs until smooth. Stir in the bread chunks, making sure that all the pieces are submerged. Let stand at room temperature, covered, stirring occasionally, until most of the liquid is absorbed, 45 minutes to 1 hour. (Alternatively, you may place the bread-custard mixture into the prepared baking dish, cover with plastic wrap, place a plate on top of the plastic wrap, weight down with a few cans, and refrigerate overnight. Allow to warm up for 30 minutes at room temperature before baking.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Butter a 9\"-square baking dish. Spoon the bread mixture into the baking dish and cover with a sheet of butter aluminum foil. Set the baking dish in a shallow roasting pan. Place the roasting pan in the oven; pour enough hot water into the pan to come halfway up the side of the baking dish. Bake for 30 minutes or until the center is a little wobbly in the center when juggled. Remove the foil and bake for 20 minutes more. Do not overbake&mdash;bread pudding will set upon cooling. Cool for 15 minutes on a wire rack. Serve warm or cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Sour Cherry Amaretto Bread Pudding</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Substitute 1/2 cup sour dried cherries for the raisins, reduce the vanilla extract to 1 1/2 teaspoons, add 1/2 teaspoon almond extract, and substitute 1/4 cup amaretto for the dark rum.</p>"}]}