{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091201-frogs-pieces.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Cantonese", "fermented black beans", "frog", "frog legs", "stir fry", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Frankenstein's Frog, Stir-Fried", "link": "https://www.seriouseats.com/recipes/2009/12/the-nasty-bits-stir-fried-frogs-with-bell-peppers-in-black-bean-sauce-recipe.html", "description": "[Photographs: Chichi Wang, unless otherwise noted] I couldn't decide whether to dispense with the frogs at the store or take them home alive. It's not often that I'm presented with the opportunity to slaughter my own dinner. The thought of...", "totalTime": "", "recipeYield": "4 as a main course", "recipeCategory": ["Mains", "Other Seafood", "Stir Frying", "The Nasty Bits"], "recipeIngredient": ["2 cups oil for <a href=\"http://www.seriouseats.com/recipes/2009/08/seriously-asian-passing-through-method-stir-frying.html\">passing through</a>", "2 frogs, skinned and gutted, or a dozen frog legs", "<strong>For the marinade</strong> ", "1 teaspoon Shaoxing rice wine or sake", "2 teaspoons cornstarch", "1 egg white", "1/2 teaspoon salt", "A pinch of ground white pepper", "<strong>For stir-frying</strong> ", "2 tablespoons of lard, or more vegetable oil", "2 medium-sized bell peppers, cut into 1/4 inch long slices", "1 tablespoon fermented black beans, crushed slightly", "1 green onion, sliced into 2-inch segments", "1/2 inch section of ginger, thinly sliced", "3 cloves garlic, crushed ", "1 jalapeno pepper, thinly sliced", "1 teaspoon salt, or to taste", "1/4 cup stock, chicken or vegetable", "<strong>For the slurry</strong>", "2 teaspoons starch", "2 teaspoons cold water", "1/2 teaspoon fermented black beans, chopped finely"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the frog: Partition the legs into the thigh and lower calves. Cut the body cavity in two, crosswise, leaving the arms intact. Then, taking the part with the arms attached, chop the body in half to produce two identical sections. Blot with a paper towel to get rid of any excess blood, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To marinate the frog: Beat the egg white until it is frothy, and combine it with the alcohol, cornstarch, salt, and pepper in a medium-sized bowl. Add the frog sections and mix gently so that each piece is coated in the marinade. Let stand for at least 30 minutes, or preferably for several hours in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In your wok, pour enough oil to come up approximately 1 to 1.5 inches on the sides. Over medium high heat, bring the oil to 325 degrees. In rapid succession, slip each piece directly from the marinade into the hot oil. Cook until the meat is lightly golden brown, about two minutes, turning once after sixty seconds. Using a wide-mesh strainer, gently transfer the pieces of frog to a colander or rack to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour out all but 1 tablespoon of the oil in the wok, and add 2 tablespoons of lard. Briefly, let the wok gather more heat for ten to twenty seconds. Add the sliced bell peppers and jalapenos; stir-fry for two minutes until the bell peppers are still crisp but beginning to soften around the edges.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the garlic, ginger, green onion, and fermented black beans. Stir-fry for about 10 to 20 seconds, until the garlic is lightly browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the slurry: In a small bowl, dissolve the cornstarch into the water, adding the finely chopped fermented black beans at the end. Have the bowl on hand. You may need to briefly re-mix the slurry right before you use it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pieces of frog back to the wok and pour in all of the stock. Simmer over low heat for about 10 seconds; then add the cornstarch slurry and stir it around the pan to mix it evenly with the rest of the ingredients. Let simmer gently for about 30 to 60 seconds, until the vegetables and frog are evenly coated with the stock, which will have thickened with the cornstarch slurry. Serve immediately.</p>"}]}