{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090928potatosausagespinachquiche.JPG", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["eggs", "leeks", "Meat Lite", "potatoes", "quiches", "sausage", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Potato Crusted Sausage, Leek and Spinach Quiche", "link": "https://www.seriouseats.com/recipes/2009/09/potato-crusted-sausage-leek-and-spinach-quiche-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. Photograph: Tara Mataraza Desmond I love this kind...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mains", "Meat Lite", "Pork", "Potato", "Quiche", "Spinach"], "recipeIngredient": ["1 1/2 pounds Russet potatoes", "1/4 cup grated Parmigiano-Reggiano", "1/4 cup all purpose flour", "1/2 teaspoon coarse salt", "1/4 teaspoon freshly ground black pepper", "1 tablespoon butter", "1 tablespoon olive oil", "1 leek, white and light green parts thinly sliced", "4 ounces mild Italian sausage (1 link), casing removed", "2 cups baby spinach, roughly chopped", "4 ounces mozzarella cheese, grated or cubed", "5 eggs", "1/4 cup milk", "Coarse salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450°F. Butter a 9-inch pie dish. Peel the potatoes and grate them with the shredder disc of a food processor or with a box grater.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the grated potatoes with the Parmigiano-Reggiano, flour, salt and pepper.  Press the potato mixture into the buttered pie dish, pushing it up along the sides.  Transfer to the oven and bake for 30 minutes to dry the potatoes a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the crust begins to bake, prepare the filling. Put the butter and oil in a large sauté pan over medium heat.  Add the leeks and sweat them for about 10 minutes, until they begin to soften.  Crumble the sausage into the leeks and cook for about 7 minutes, breaking the meat up into little pieces as it cooks.  Add the spinach and sauté 3-5 minutes, just until it begins to wilt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the potato crust from the oven and reduce the oven temperature to 350° F.  Spoon the sausage mixture in an even layer across the potato crust.  Sprinkle the cheese on top of the sausage mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the eggs and milk together.  Season with salt and pepper and pour over the sausage and cheese layers.  Transfer to the oven and bake for 25 minutes, until the egg is set and the potato edges are dark brown and crisp.  Let sit for 10 minutes before slicing and serving.</p>"}]}