{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091214longcookedbroccoli.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["broccoli", "sides", "The Crisper Whisperer", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Alice Waters' Long-Cooked Broccoli", "link": "https://www.seriouseats.com/recipes/2009/12/alice-waters-long-cooked-broccoli-recipe.html", "description": "Broccoli stems are not glamorous, but they are meant to be eaten. I can't help but feel that there's something wrong with a society that throws them away. If we're looking to be less wasteful, they're an awfully good place to start. Try this Alice Waters recipe, where the stems steal the show (sorry, florets).", "totalTime": null, "recipeYield": null, "recipeCategory": ["Broccoli", "Crisper Whisperer", "Dairy-Free", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1 1/2 pounds broccoli ", "1/4 cup olive oil", "6 garlic cloves, peeled and chopped", "Pinch of dried chili flakes", "A few good pinches of salt", "1 cup water", "Juice and zest of 1 lemon", "2 to 4 tablespoons grated parmesan or pecorino cheese, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the broccoli, cut the florets into small pieces. Trim the ends off the stems. Peel the stems with a paring knife and thinly slice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot with a heavy bottom, heat the olive oil over medium heat. Add the broccoli, garlic, chili flakes and salt. Cook, stirring occasionally, for a few minutes, until the garlic is very fragrant. Add the water and bring to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to maintain a bare simmer, cover the pot, and cook, stirring occasionally until the broccoli is very tender and falling apart, about an hour. You may need to add more water if the broccoli starts to dry out. After an hour or so, stir vigorously with a spoon to create the texture of a coarse purée. Stir in the lemon juice and zest and the cheese if using. Serve as a bed for grilled fish, shellfish or chicken, as a side dish, mixed with brown rice or pasta, or as a topping for crostini.  </p>"}]}