{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090826-italian-beef-thumb.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["beef", "Italian", "salads", "salsas", "sauces", "Seriously Italian", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: A Tale of Beef, Three Ways", "link": "https://www.seriouseats.com/recipes/2009/08/seriously-italian-a-tale-of-beef-three-ways-recipes.html", "description": "Pull up a chair and read a story, about one cut of meat, one pot, a few vegetables and entirely delicious results&mdash;three tasty, varied dishes that span the north and south of Italy, making the most of a tight budget...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Italian", "Mains", "Salads", "Soups and Stews"], "recipeIngredient": ["2 pounds chuck roast, short ribs, or brisket", "3 or 4 veal bones with marrow (optional)", "2 medium carrots, peeled and cut in 1-inch chunks", "1/2 a large onion, cut in large dice", "2 ribs celery, cut in 1-inch chunks", "1 large clove of garlic, smashed and peeled", "1 cup canned plum tomatoes, diced or crushed", "1/2 a large leek, cleaned thoroughly and cut in 1/2-inch slices", "5 or 6 whole black peppercorns", "2 or 3 whole allspice berries", "2 bay leaves", "3 sprigs of fresh thyme", "Kosher salt to taste ", "1 bunch Italian (flat-leaf) parsley, leaves only ", "4 salt-packed anchovies, filleted and rinsed", "1 bunch mint, leaves only", "Fronds from 1 fennel bulb ", "2 tablespoon capers, preferably salt-packed, rinsed and drained", "1 hard-boiled egg, roughly chopped ", "4 cornichons ", "2 tablespoons white-wine vinegar ", "1 cup extra virgin olive oil ", "Freshly ground black pepper", "Shredded boiled beef", "Finely chopped celery, ribs and leaves", "Finely chopped red onion", "Minced fresh parsley", "Finely chopped cornichon", "A generous pinch of dried Italian oregano or fresh oregano, finely minced", "A pinch of red chili flakes", "Red Wine Vinegar", "Extra-Virgin Olive Oil", "Kosher salt and freshly ground black pepper to taste "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse any blood off the beef and pat it dry with a paper towel.  Place the vegetables, spices and herbs in a stockpot with 3 quarts of cold water. Bring the mixture to a boil, and add the beef and optional bones,making sure that it is completely submerged in the liquid; season partially with kosher salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the contents of the pot back to a boil, skimming off any foam that forms on the surface. Cover the pot and lower the heat so the mixture is at a slow, steady simmer and cook for 3 hours, or until the beef is soft and a small corner of it falls away easily when pinched. Turn off the heat and let the entire contents of the pot cool to room temperature, about 6 to 7 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the broth with more salt and freshly ground pepper to taste. To serve as soup, reheat the broth as desired, and serve with or without the vegetables over a miniature cut of pasta or cooked rice, passing grated Parmigiano Reggiano, Grana Padano, or Pecorino Romano to sprinkle on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Chapter Two: Lesso di Manzo con Salsa Verde</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090826-italian-salsaverde.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090826-italian-salsaverde.jpg\" width=\"500\" height=\"333\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Traditional Bollito Misto is a specialty of Lombardia and Piemonte, a hearty mix of assorted meats, poultry and large cuts of vegetables simmered together and served with the resultant rich broth and accompanied by an assortment of sweet, savory, and spicy sauces and condiments.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serving cool slices of poached beef from Bollito di Manzo (above) with a dollop of pungent <strong>salsa verde</strong> is a popular and simple adaption of its more complex cousin.  Recipes for salsa verde vary by region and household, but they all share a few key ingredients: plenty of fresh parsley, salted anchovy, capers, egg, vinegar and extra virgin olive oil.  I really love Mario Batali's version from <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/0060734922/serieats-20\">Molto Italiano</a>,</em> which I have adapted here.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When serving the beef poached, <strong>it is important to chill it in the broth overnight for easier slicing</strong>&mdash;it will fall apart if you attempt it right out of the pot. After chilling the beef, be sure to always slice it against the grain to keep it tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The cool poached beef with salsa verde makes a perfect mid-week meal. All you need is a nice salad, some crusty bread, and a bottle of medium-bodied red wine to round things out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Salsa Verde</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small>Adapted from <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/0060734922/serieats-20\">Molto Italiano</a></em> by Mario Batali.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all ingredients in a blender and blend until smooth.  Serve spoonfuls of the salsa verde on top of or alongside slices of the cool poached beef. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Chapter Three: Lesso di Manzo in Insalata</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090826-italian-salad.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090826-italian-salad.jpg\" width=\"500\" height=\"334\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The boiled beef journey ends with this tasty <strong>beef salad;</strong> my mom would make it with whatever beef was leftover from the soup and plop it in a glass jar, letting it marinate in the refrigerator for a week or so before cracking it open. It was her mother's recipe, seasoned with plenty of the dried Calabrian oregano that flavored so much of Nonni's cooking. I always felt like a grown-up when sharing this salad with her, either on a crusty piece of toast or piled on a saltine. If the timing worked out, Mom would serve it as part of an antipasto spread, positioned between the caponata and roasted peppers on the lazy Susan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>There are no measurements here&mdash;just toss the ingredients together as you please.</strong> The longer it sits, the better it will taste; the shreds of beef soak up the vinegar and oil, so feel free to add a splash of both before serving, as well as an extra pinch of salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Lesso di Manzo in Insalata</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss all the ingredients together well; place in a jar or air-tight container and store for at least two days. Adjust the seasoning and moisten with additional vinegar and oil before serving it at room temperature. It is excellent with some slices of Caciocavallo cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Prologue</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Every drop and morsel was enjoyed, and everyone lived happily ever after, will full tummies and change in their pockets. The End.</p>"}]}