{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090924-dt-rattatoullie-with-grilled-bread.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "ratatouille", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Ratatouille with Grilled Bread", "link": "https://www.seriouseats.com/recipes/2009/09/dinner-tonight-ratatouille-with-grilled-bread-recipe.html", "description": "I was first drawn to this recipe for the novelty factor: It called for four vegetables, four burners, and four pots. Though ratatouille is traditionally a stewed mixture of tomatoes, onions, eggplants, zucchinis, and peppers, in The River Cottage Cookbook...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Vegetarian"], "recipeIngredient": ["Olive oil", "5 garlic cloves, 4 finely chopped, 1 split", "3/4 pound eggplant, cut into 1 inch cubes", "3/4 pound small zucchini, sliced 1/2 inch thick", "3/4 pound cherry tomatoes, left whole", "3/4 pound onions, red or white, in fairly thick slices", "A few basil leaves, torn", "Salt and freshly ground black pepper to taste", "4 slices crusty bread, such as a baguette length split lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather 4 medium-sized pans and cover the bottom of each with olive oil. Choose one with higher sides to hold all the ingredients after cooking, and cook the eggplant in this one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil over medium-low heat and add a clove of chopped garlic to each pan, cooking until fragrant, about a minute. Add a vegetable to each pot. Cook the eggplant gently until it softens and turns creamy; the onions until soft and beginning to caramelize; the tomatoes until the skins split but they are still holding their shape; the zucchini over low heat until tender, then higher heat to brown them. Season each vegetable to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the vegetables are ready, combine them in one pot and stir carefully to combine. Season again to taste, and add the basil.  Heat for 1-2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, toast or grill the bread slices and rub the remaining split clove of garlic over their surfaces. Drizzle with them with olive oil and serve with the ratatouille.</p>"}]}