{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["burger", "pork", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Bacon Attack! (Or, the Bacon^4 Burger)", "link": "https://www.seriouseats.com/recipes/2009/10/the-bacon-attack-bacon-4-burger-recipe.html", "description": "Note: Read my breakdown of the burger's components to see how I came up with this recipe....", "totalTime": null, "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Burger", "Pork", "Sandwiches"], "recipeIngredient": ["8 ounces pork butt, trimmed of gristle, and cut into 1-inch cubes", "8 ounces good-quality slab bacon, trimmed of rind, cut into 1-inch cubes", "1/4 pound bacon, cut into 1/4-inch lardons", "&nbsp;", "<strong>For the Buns:</strong>", "3 tablespoons sugar", "3/4 teaspoon salt", "10 ounces (2 cups) all-purpose flour", "2 tablespoon active dry yeast", "2/3 cup warm water", "4 slices crisp cooked bacon, crumbled", "1 large egg", "&nbsp;", "<strong>To Serve:</strong>", "Crisp cooked bacon", "Cheese", "4 tablespoons <a href=\"http://www.seriouseats.com/recipes/2009/10/baconnaise-meat-mayos-mayonnaise-recipe.html\">baconnaise</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place feed shaft, blade, and 1/4-inch die of meat grinder in freezer until well-chilled. Meanwhile, place meat and bacon chunks on rimmed baking sheet, leaving space between each piece and place in freezer for 10 minutes until meat is firm, but not frozen. Combine meat in large bowl and toss to combine. Pass meat through grinder twice. Form into four patties, about 4-inches wide and 1/2-inch tall. Refrigerate until ready for use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Buns:</strong> Combine sugar, salt, flour, and yeast in the bowl of a stand mixer fitted with a paddle attachment. Mix to combine. Add water and mix on low speed until a dough forms. Continue mixing for 10 minutes. Add crumbled bacon and mix to combine. Turn dough out ont floured surface</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F and set oven rack to upper-middle position. On well-floured work surface, divide dough into 6 to 8 even pieces (depending on if you want large or small buns) and shape each into a ball. Place on greased baking sheet about 2 inches apart and flatten slightly with palm of well-floured hand. Spary with non-stick spray, cover with plastic, and let rest 15 minutes until slightly risen. Meanwhile, whisk egg white until slightly frothy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake buns for 4 minutes. remove from oven, brush with egg white, and return to oven until golden brown and well-risen, about 4-8 minutes longer. Set on wire rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice buns. Brush lightly with bacon fat or butter (or leave plain), then place under broiler or in toaster oven until golden brown, about 1 minute. Cook patties in well-seasoned cast-iron or non-stick skillet over medium-high heat until well-browned and crisp on first side, about 2-3 minutes. Flip patties and cook on second side until cooked through, about 2 minutes longer. Transfer patties to burger bun bottoms, top with bacon, spread burger bun tops with baconnaise, close sandwiches, and serve.</p>"}]}