{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091103-pigs-tongue-on-board-2.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["confit", "lentils", "pork tongue", "The Nasty Bits", "Umbrian lentils"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Confit of Pork Tongue with Warm Lentil Salad", "link": "https://www.seriouseats.com/recipes/2009/11/the-nasty-bits-tongue-and-lentils.html", "description": "[Photographs: Chichi Wang] If beef tongue is something of a monstrosity, then pork tongue is the smaller, subtler of the two. Even so, at five or more inches in length, the tongue of a pig is not to be sneezed...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beans and Pulses", "Offal", "Pork", "The Nasty Bits"], "recipeIngredient": ["scant 1 tablespoon coarse kosher salt, or 2 teaspoons per pound of meat", "1 onion, cut into 1-inch dice", "1/4teaspoon dried thyme", "1/2 head of garlic, cut crosswise and studded with one clove", "3 to 4 cups rendered fat (duck fat or lard, or a combination)", "Salt for sprinkling", "1 cup French lentils de Puy or Umbrian lentils, rinsed and drained", "1/2 onion, plus the remaining half separated into layers", "1 clove", "1 sprig of thyme", "2 tablespoons Cognac, Armagnac, or rum", "1/2 medium shallot, peeled and diced", "1 tablespoon red wine or sherry vinegar", "1/2  teaspoon Dijon mustard", "4 cup walnut or olive oil", "Salt and pepper to taste", "2 pork tongues"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse and dry the tongues.  Place the tongues in a bowl along with the salt, onions, and thyme.  Cover with plastic wrap and refrigerate for 16 to 24 hours or so.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The following day, briefly rinse the tongues with cold water to remove the salt.  Set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a heavy pot, preferably enameled cast iron, melt the fat under low heat.  Slip the tongues into the fat and slowly bring to the fat to 190°F to 200°F, using a candy thermometer to monitor the temperature.  It should take an hour or so to bring it up to this temperature.  Do not let the temperature get much higher than 210°F, or the texture of the tongues will become stringy.   Slip in the half head of garlic.  Cook the tongues for a total of 2 to 2 1/2 hours.  The surface of the fat should be barely simmering. The tongues are done when the meat is easily pierced with a skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Alternatively</em>, preheat the oven to 300 F.  Melt the fat over the stovetop as directed; then slip in the tongues and garlic.  Cover the pot and cook for 2 to 2 1/2 hours.  Remove the pot from the oven and allow the tongues to cool in the fat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the tongues cool for an hour in the fat.  In the meantime, set out a glass jar or casserole dish capable of holding the tongues.  If using a dish, make sure it has a lid that can seal the edges.  Sprinkle 1/2 teaspoon of salt into the bottom of the dish to prevent the meat juices from turning sour during storage.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the tongues to the jar or dish.  On the stovetop, bring the fat to a a very slow bubbling point and skim off the foam that rises.  Let the fat bubble for about 5 minutes.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very carefully pour the fat over the tongues, covering the entire mass.  Let cool, uncovered, to room temperature.  Seal with the lid and let the fat congeal.  Refrigerate, or store in a cool cellar for several months or at least 1 to 2 weeks.  The tongues may be kept for up to six months in their jars. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to use, slowly melt the fat in the jars, allowing for the removal of the tongues.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tongues thinly, about 1/4 inch per slice.  Heat a cast iron skillet over medium heat.  Add a bit of duck fat or lard and brown the tongue on each side for a minute or so.  Serve immediately.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4> Confit of Pork Tongue with Warm Lentil Salad</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20091103-finished-dish-1.jpg\" src=\"https://www.seriouseats.com/recipes/images/20091103-finished-dish-1.jpg\" width=\"500\" height=\"375\" class=\"mt-image-none\" style=\"\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small>Adapted from <em><a href=\"http://www.amazon.com/dp/076457602X/?tag=serieats-20\">The Cooking of Southwest France</a></em> by Paula Wolfert.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the lentils in a saucepan with 1 quart of water.  Bring to a boil.  Add the onion half, the clove, and thyme.  Reduce the heat and simmer for 20 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the Cognac and continue to cook until the lentils are tender but not mushy, about 10 to 15 minutes longer.  Drain and pick out the onion and clove.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, prepare the vinaigrette:  In a mixing bowl, whisk together the shallots, walnut oil, and mustard.  Season with salt and pepper to taste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lentils to the dressing and mix to coat evenly.  Stud the lentils with the other half of the raw onion.  Set aside for several hours to allow the onion juices to penetrate the lentils.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before serving, preheat a cast iron skillet. Add a bit of duck fat or lard and brown the tongue on each side for a minute or so.  At the same time, add the lentils and cook over moderate heat, using the lentils to deglaze the bits of meat from the pan.  Plate the lentils with the tongue.  Add salt and some additional vinegar to the lentils as needed.  </p>"}]}