{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090913-grilling-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["chicken", "grill", "grilling", "kebabs", "peppers", "skewer", "spicy", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Grilling: Yogurt-Marinated Chicken Kebabs with Aleppo Pepper", "link": "https://www.seriouseats.com/recipes/2009/09/grilling-yogurt-marinated-chicken-kebabs-with-aleppo-pepper-recipe.html", "description": "Moist and wonderfully flavored, these chicken skewers are among some of the best I've ever had. The spice comes from the crushed red pepper and the tang from the vinegar and lemon.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "Grilling"], "recipeIngredient": ["1 1/2 tablespoons Aleppo pepper or 2 teaspoons dried crushed red pepper plus 2 teaspoons Hungarian sweet paprika (and additional Aleppo pepper or paprika for sprinkling)", "1 cup plain whole-milk Greek-style yogurt (8 ounces)", "3 tablespoons extra-virgin olive oil", "2 tablespoons red wine vinegar", "2 tablespoons tomato paste", "2 teaspoons coarse kosher salt", "1 teaspoon freshly ground black pepper", "6 garlic cloves, peeled, flattened", "2 unpeeled lemons; 1 thinly sliced into rounds, 1 cut into wedges for serving", "2 1/4 pounds skinless boneless chicken (thighs and/or breast halves), cut into 1 1/4-inch cubes", "Bamboo skewers, soaked in water for 30 minutes before using"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using Aleppo pepper, place in large bowl and mix in 1 tablespoon of warm water. Let stand until thick paste forms, about 5 minutes. If using dried crushed red pepper and paprika combination, place in large bowl and stir in 2 tablespoons warm water and let stand until paste forms, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add yogurt, olive oil, red wine vinegar, tomato paste, 2 teaspoons coarse salt, and 1 teaspoon black pepper to spice mixture in bowl; whisk to blend. Stir in garlic and lemon slices, then chicken. Cover and place in the refrigerator for at least 1 hour to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate. While the fire is lighting, thread chicken pieces onto skewers, dividing equally. Sprinkle each skewer with salt, pepper, and additional Aleppo pepper or paprika. Grill chicken until golden brown and cooked through, turning skewers occasionally, 10 to 12 minutes total. Transfer skewers to platter. Surround with lemon wedges and serve. </p>"}]}