{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090607barcelona.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Spanish", "keywords": ["aioli", "Andy Pforzheimer", "Cook the Book", "potatoes", "Sasa Mahr-Batuz", "spanish", "tapas", "The Barcelona Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Catalan Potatoes Bravas", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-catalan-potatoes-bravas.html", "description": "Whenever I see patatas bravas on the menu of a tapas place, I smile. My rudimentary knowledge of Spanish immediately translates this dish to \"brave potatoes,\" and images of heroic, life-saving potatoes come to mind—handsome firefighting russets and dashing life...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Potato", "Spanish"], "recipeIngredient": ["1 1/2 pounds waxy potatoes, such as Yukon Gold, red-skin, or fingerling potatoes", "Kosher salt", "1/4 cup extra virgin olive oil", "2 large Spanish onions, thinly sliced", "6 cloves garlic, chopped", "2 teaspoons sweet smoked paprika (<em>pimentón de la  vera dulce</em>)", "1 teaspoon hot smoked paprika (<em>pimentón de la vera picante</em>)", "1 teaspoon ground cumin", "1/4 teaspoon cayenne", "Freshly ground black pepper ", "One 35-ounce can plum tomatoes", "1 1/2 tablespoons sherry vinegar", "1 cup olive oil", "Sea salt, for garnish", "Barcelona Aioli (recipe follows), for serving", "6 cloves garlic", "1/2 cup plus 1 tablespoon extra virgin olive oil", "1 cup mayonnaise", "Juice of 1/2 lemon", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450&deg F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes in a large pot and add enough cold water to cover by an inch.  Add 4 tablespoons of salt and bring to a boil over high heat.  Reduce the heat slightly and simmer for about 20 minutes, or until just fork tender.  Drain the potatoes and set aside to cool.  When cool, cut the potatoes into wedges or, if using fingerling potatoes, cut them in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large saucepan, heat the extra virgin olive oil over medium heat.  Add the onions and cook for about 10 minutes, or until they soften but have not colored.  Add the garlic and cook gently for 6 to 8 minutes, or until the garlic is tender and aromatic.  Stir in both paprikas, the cumin, and the cayenne.  Season to taste with pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the tomatoes and their juice in a bowl, and using your hands, crush the tomatoes slightly.  Add the tomatoes, their juice, and the vinegar to the saucepan and season to taste with salt and pepper.  Bring to a simmer over medium heat and cook for about 20 minutes, or until the sauce is heated through.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the tomato sauce cool a little and then, working in batches, puree it in a blender until smooth.  As one batch is pureed, transfer it to a bowl or a container with a tight-fitting lid.  Use the tomato sauce right away or refrigerate for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss the cooled potatoes with the 1 cup of olive oil and season to taste with salt and pepper.  Spread the potatoes and the oil in a shallow baking pan and roast for 12 to 15 minutes, or until the potatoes are nicely browned on one side.  Rotate the pan and turn the potatoes over.  Roast for 8 to 10 minutes longer, or until browned and crisp on the other side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon a liberal amount of cooled tomato sauce in the center of each of 4 serving plates.  Mound the potatoes on top of the sauce and garnish with sea salt.  Serve with the aioli on the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the oven to 250&deg F and line a baking sheet with several layers of paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Barcelona Aioli</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 1 1/4 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine the garlic cloves and 1/2 cup of the olive oil and bring to a simmer over medium heat.  Cook for 5 to 7 minutes, or until the garlic is tender and honey gold.  Watch the garlic carefully so that it does not overcook.  Lift the garlic cloves from the oil with a slotted spoon and set aside on paper towels to cool.  Discard the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor fitted with the metal blade, puree the garlic cloves, mayonnaise, lemon juice, and remaining tablespoon of olive oil until smooth.  Taste, season with salt and pepper, and pulse to mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the aioli into a lidded storage container and chill for up to 3 days.</p>"}]}