{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090819-pigsears-thumb.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["hugh fearnley-whittingstall", "pig ears", "The Nasty Bits", "The River Cottage Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "The Nasty Bits: Pig's Ears Two Ways", "link": "https://www.seriouseats.com/recipes/2009/08/red-braised-pigs-ears-pigs-ears-on-a-hot-griddle-recipe.html", "description": "\"Searing the ear in my skillet was the most fun I've had with cast iron in a long time.\" Photographs by Chichi Wang One of the greatest things about working with offal is that you and your butcher will never...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Pork", "The Nasty Bits"], "recipeIngredient": ["<strong>Ingredients for Pig's Ear on a Hot Griddle</strong>", "2 pig's ears ", "1 onion, peeled and halved", "1 carrot, washed", "An assortment of herbs, such as thyme, majoram, and oregano, washed and bundled", "Approximately 1 tablespoon salt, or to taste", "Pepper to taste", "&nbsp;", "<strong>Ingredients for Red-Braised Pig's Ear</strong>", "2 pig's ears ", "1/4 cup Shaoxing Rice Wine, or sake", "3 Tablespoons dark Chinese soy sauce", "2 Tablespoons sugar", "1 star anise", "1/2 cinnamon stick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Procedure for Pig's Ear on a Hot Griddle</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to boil. Place the pig's ears in the water and par-boil for a few minutes to remove any scum and impurities.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pig's ears from the water and place them into a medium-sized pot. Add enough water to cover both the ears. Add the onion, carrot, and aromatics, and bring the pot to a boil. Add salt and pepper. Reduce to a gentle simmer and cook for 2.5 hours, occasionally checking to see that the ears are immersed in the water. The ears will be very soft--a fork should easily pierce through the skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the ears cool until they are no longer hot and sticky on the surface.  As a by-product of the simmering, a flavorful pork stock may be reserved for another use. In the meantime, heat a cast iron or griddle until blistering hot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ear into the skillet and press down upon it, making sure that the majority of the surface makes contact with the pan.  Continuously press down on the ear, until the side is thoroughly charred and crispy at points.  Turn the ear over and do the same on the other side.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, like steak, for the diners to cut and eat on the plate.  Accompany with a good quality Dijon mustard.  Two ears should feed two to four people, depending on their appetite for ears.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Procedure for Red-Braised Pig's Ear</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to boil. Place the pig's ears in the water and par-boil for a few minutes to remove any scum and impurities.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pig's ears from the water and place them into a small pot. Add enough water to cover the ear. Add the wine, soy sauce, sugar, star anise, and cinnamon stick, and bring the pot to a boil. Reduce to a gentle simmer and cook for 2.5 hours, occasionally checking to see that the ear is immersed in the water. When done, the ear will be very soft and very dark brown in color. A chopstick should easily pierce through the skin. At the end of the braising, the soy sauce mixture will have been reduced into a syrupy mass, which can be reserved for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the ear sit at room-temperature; then chill in the refrigerator until totally solid and cooled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ear onto a cutting board and slice lengthwise into slivers.  Serve cold.  One red-braised ear should easily feed six people as a Chinese-style, cold dish appetizer.</p>"}]}