{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "The Blue Label Burger Blend", "link": "https://www.seriouseats.com/recipes/2009/10/the-blue-label-burger-blend-recipe.html", "description": "Note: Read my guide to different cuts of beef for a look into the development of this blend....", "totalTime": null, "recipeYield": "1 pound of burger meat", "recipeCategory": ["Beef", "Burger", "Sandwiches", "The Burger Lab"], "recipeIngredient": ["6 ounces beef sirloin, trimmed of gristle, and cut into 1-inch cubes", "5 ounces beef brisket, trimmed of gristle, and cut into 1-inch cubes", "12 ounces bone-in oxtail, fat and meat carefully removed from bone and trimmed of silverskin, bones discarded or reserved for another use (about 5 ounces of combined meat and fat)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Procedure (Meat Grinder):</strong> Place feed shaft, blade, and 1/4-inch die of meat grinder in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece and place in freezer for 10 minutes until meat is firm, but not frozen.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine meat in large bowl and toss to combine. Grind meat and refrigerate immediately until ready for use. Handle as gently as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Procedure (Food Processor):</strong> Place bowl and blade of food processor in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece, and place in freezer for 10 minutes until meat is firm, but not frozen.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine meat in large bowl and toss to combine. Working in two batches, place meat cubes in food processor and pulse until medium-fine grind is achieved, about 8 to 10 one-second pulses, scraping down processor bowl as necessary. Refrigerate until ready to use.</p>"}]}