{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091015-dt-ricotta-carbonara.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["Dinner Tonight", "Italian", "pastas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pasta Carbonara with Ricotta", "link": "https://www.seriouseats.com/recipes/2009/10/dinner-tonight-pasta-carbonara-with-ricotta-recipe.html", "description": "[Photograph: Blake Royer] I've said it before, and I'll say it again: real pasta carbonara doesn't have a lick of heavy cream in it. It's not alfredo sauce with bacon. The only dairy is a little bit of grated cheese,...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Italian", "Pasta"], "recipeIngredient": ["1 pound spaghetti or other pasta", "4 tablespoons olive oil", "4 slices thick-cut bacon, about 5 ounces", "4 eggs", "1/2 cup ricotta cheese at room temperature", "2 ounces Pecorino Romano cheese, grated (do not substitute Parmesan)", "3/4 cup shelled fresh peas, or frozen", "Black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium skillet with high sides (enough to hold the cooked pasta) or a saucepan, heat the olive oil over medium-low heat. Add the bacon pieces and turn the heat to low. Cook them gently as the fat begins to render and mix with the olive oil, turning the pieces occasionally, for 20 minutes or so as the edges begin to turn golden but the center remains chewy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a pot of salty water to boil. Boil the pasta until cooked through but still chewy. If using fresh peas, add them about 3 minutes before the pasta is done cooking; if using frozen, add them 1 minute before.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pasta is cooking, lightly beat the eggs with the ricotta, breaking up any curds. Add most of the cheese to the mixture, and plenty of black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pasta and peas are nearly done, turn the heat up to high on the bacon to gently crisp the edges, then remove from the heat. Drain the pasta and add it to the pan with the bacon. Toss quickly to coat the noodles, then pour the beaten egg mixture over everything and fold it quickly into the noodles. The egg should cook gently from the heat of the pasta, while the ricotta will form tiny curds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve in warmed bowls with the remaining cheese and more black pepper.</p>"}]}