{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091019spice-h.jpg", "author": {"@type": "Person", "name": "Tam Ngo"}, "recipeCuisine": "Vietnamese", "keywords": ["Asian", "beef", "broths", "noodles", "oxtails", "phở", "Seriously Asian", "soups", "Vietnam", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Phở Đuôi Bò (Vietnamese Noodle Soup with Oxtail)", "link": "https://www.seriouseats.com/recipes/2009/10/pho-duoi-bo-vietnamese-noodle-soup-with-oxtail-recipe.html", "description": "Phở đuôi bò. [Photographs: Tam Ngo] Since we'll be stuck in dark drizzle for months to come, let's talk about phở, a perfect food for chasing away the doldrums of winter. Phở bò is a Vietnamese beef noodle soup;...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Soups and Stews", "Vietnamese"], "recipeIngredient": ["<strong>Spices:</strong>", "10 star anise", "10 whole cloves", "5 inches of cassia bark or cinnamon stick", "10 green cardamom pods", "2 teaspoons Sichuan peppercorn", "2 teaspoons coriander seeds", "2 slices of dried tangerine peel", "<strong>Aromatics:</strong>", "1 1/2 lb yellow onions, outer skin peeled", "1 lb daikon, peeled and cut into 4-inch segments", "1/2 lb carrots, peeled and halved", "4 ounces ginger, peel-on and lightly smashed", "<strong>Meat and Bones:</strong>", "7 1/2 pounds oxtail, cut in cross-sections of roughly the same size and thickness", "<strong>Broth Seasoning:</strong>", "2 tablespoons sea salt", "1/4 + 1/8 cup fish sauce", "yellow rock sugar, to taste", "<strong>Mise en Place:</strong>", "1 1/2-2 pounds (1/4-inch wide) pho noodles, fresh or dried", "1 medium sweet yellow onion, sliced paper-thin", "scallions, cut into thin rings", "cilantro, chopped", "oxtail meat, brought to room temperature, removed from bones, and broken into chunks", "<strong>Broth Seasoning:</strong>", "pho broth (recipe above)", "2-inch knob of ginger, lightly smashed and thickly sliced", "fish sauce", "yellow rock sugar", "<strong>Tableside Garnishes:</strong>", "spearmint (hung lui) ", "Thai basil (rau que)", "thorny cilantro (ngo gai)", "3/4 pound bean sprouts ", "3-4 red Thai bird chilis, deseeded and thinly sliced", "2 limes, cut into wedges", "fish sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Toast Spices:</strong> Toast the spices in a wide skillet over a low flame for approximately 2 minutes. Remove them from heat as they become fragrant. Cool before wrapping the spices in cheesecloth and tying off with twine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Roast Aromatics:</strong> Balance ginger knobs on the cooking grate of a gas stove. On medium-low heat, use tongs or chopsticks to char the ginger against the open flame of the stove. After 4 minutes, they should soften and brown. Do the same for the onions. These aromatics are what sweeten the broth so don't worry too much about blackening the entire surface. Allow the aromatics to cool, then peel the skins, rinse, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Parboil Meat and Bones:</strong> Place oxtail sections in the large stockpot and cover with cold water. Boil vigorously over high heat for 2 to 3 minutes. (This frees the oxtail of marrow and other impurities that cloud the flavor of the soup.) Drain and rinse the oxtail. Scrub the stockpot of scum and return the oxtail to the cleaned pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare Broth with Oxtail:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the oxtail stockpot, add 7 1/2 quarts of cold water along with the spice sachet, onions, ginger, daikon, carrots, sea salt, and fish sauce. Over high heat, bring the ingredients to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the flame, and keep the broth bubbling lightly at the lowest possible simmer. Simmer for 7 to 8 hours until the meat is deeply aromatic and shrugs off the bone in hunks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the oxtail and submerge them in a clean pot of cold water for approximately 10 minutes. (This prevents the meat from drying out as it cools.) Drain the sections and bring them to room temperature. Then, secure them in plastic and refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard all remaining solids, aromatics, and the spice sachet. Use a chinois or a fine strainer double-lined with cheesecloth to strain the broth into a second, clean stockpot. Cool the pot of broth in a sink of cold water, then store in the refrigerator overnight to allow the flavors to develop. The fat will separate to the top and the gelatin-rich broth will congeal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Day 2: Bowl Assembly</strong> To ensure the spring of the noodles don't get sodden in the broth, arrange the dry ingredients (noodles, onions, and oxtail meat) in bowls and seat guests before ladling on the liquid. Guests will enjoy plunging through the heady steam as the soup is slurped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Tableside Garnishes:</strong> Rinse, drain, spin (or pat) dry the final garnishes before arranging on a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mise en Place:</strong> If using dry pho noodles, submerge the noodles in hot water for 20 minutes until softened; drain. (If using fresh noodles, simply rinse the noodles under cold water and drain.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean stockpot, bring 4 quarts of water to a boil. Place the noodles in a long-handled strainer and blanch just until the noodles lose their stiffness. (Depending on the noodle and its thickness, this can take anywhere between 10 seconds to 2 minutes.) Drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each serving bowl a quarter of the way up with noodles. Top with oxtail meat, onions, scallions, and cilantro. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Broth Seasoning:</strong> Remove the stockpot of broth from the refrigerator. Scoop off the white crust of fat but reserve some for flavor. Place the pot of gelatinous broth on heat. The broth will liquefy as it's brought to a rolling boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refresh the flavor of the broth by adding ginger slices. Adjust the flavor of the broth with fish sauce and yellow rock sugar. (If the broth tastes a little strong, don't worry. The noodles and herbal garnishes will temper the flavor.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving Guests:</strong> Ladle the broth into each prepared bowl and fully submerge the noodles. (The proportion of broth to noodles should be roughly 3:1.) Serve immediately. Invite guests to hand-shred tableside garnishes into their bowls and to add lime, fish sauce, and/or chili pepper to taste.</p>"}]}