{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091007cakespycandycorn.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy corn", "Cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Tri-Color Candy Corn Cookies", "link": "https://www.seriouseats.com/recipes/2009/10/tricolor-candy-corn-cookies-halloween-baking-recipe.html", "description": "But is it possible to create a version of candy corn that maintains the iconic look while still tasting delicious? (Note: I am mostly asking the candy corn haters.) Yes, by combining it with another famous triple-hued treat, <strong>the tri-color cookie. </strong>These white, yellow, and orange tri-color cookies take the best of both worlds, with the cakey, almond-kissed and chocolate-coated taste of a confection found in Italian bakeries, but the unmistakable look of candy corn. Kind of like a trick and a treat, all at once.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakespy", "Halloween"], "recipeIngredient": ["8 ounces almond paste", "3/4 cup sugar", "3/4 cup butter, at room temperature", "3 eggs", "1 cup all-purpose flour, sifted", "1/4 teaspoon salt", "3/4 cup apricot preserves ", "1 teaspoon stale turmeric, for yellow food coloring (or 10 drops yellow food coloring)", "2-3 drops annatto-based orange food coloring (or 2 drops of red and 10 drops of yellow food coloring)", "4 ounces semisweet chocolate", "1 heaping teaspoon vegetable shortening"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease three small (4x8-inch or so) loaf pans. After greasing, insert a piece of parchment paper so that it runs lengthwise along the pan, leaving room on both ends so that small tabs of parchment poke up the sides. This will make removing the cakes easier later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, mix together the almond paste, sugar, and butter. Mix on medium speed in an electric mixer, or until well-blended. It will be a thick mixture, and there may be small lumps of almond paste remaining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs in one at a time, mixing well after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixing speed to low, and add the flour and salt bit by bit, mixing well after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take two small bowls and add about 1 cup of the batter to each bowl, leaving about 1 cup still in the mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now it's time to add color to the batter that is in the two bowls. For the yellow cake layer, you can add either 10 drops of yellow food coloring, or you can take a natural approach as I did by using 1 teaspoon of <em>stale</em> turmeric (the more stale, the less flavorful it will be; for these sweet treats, you want the color of the spice rather than the flavor). For the orange cake layer you can add either 2 drops of red and 10 drops of yellow food coloring, or you can use 2 to 3 drops of a natural annatto-based food coloring which will yield an orange hue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon each batch of batter into your three prepared baking pans. Using a spatula, spread the batter down in each pan until even; wash the spatula between spreading each batch of batter to avoid the colors getting mixed. The batter should be about 1-inch thick in each pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for about 20 to 25 minutes, or until a toothpick inserted in the center comes out clean. Let them cool for about 30 minutes. Level off the tops of each layer (if necessary) so that they are smooth and flat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the orange layer on clean surface. Spread about half of the apricot preserves on top, and then place the yellow layer directly on top. Spread remaining preserves on top of the yellow cake, and then place the white layer on top. Put the three-layer confection in the refrigerator for about a half hour to set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from refrigerator. If you would like to prepare the cookies as rectangles, simply shave off any uneven edges on the sides so that the cake is a long, smooth rectangle (these will be <em>large</em> cookies). However, if you would like your cookies to mimic the shape of candy corn, carefully slice each side of the cake at an angle so that you are left with one tall triangle which tapers down in the following color order: white, yellow, orange. Keep the long slices that you've taken off, as these are still very eatable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the chocolate topping. In a double boiler, heat chocolate and vegetable shortening over low heat, stirring frequently until melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cookie log on a piece of aluminum foil, and pinch the sides up&mdash;you will use this as a sort of vessel to contain any poured chocolate from spilling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the chocolate mixture on top of the layers cookies slowly to ensure that you cover as much of it as possible. Using a spoon, you can capture the chocolate which pools at the bottom of the foil and use that to fill in any uncovered areas on the cake. It should be coated all over the top and sides. If you have made your cake in a triangular candy corn shape, you will probably have chocolate topping left over: you can use this to frost the tops of the castaway slices, if you've saved them (they can then later be sliced to resemble the more classic tricolor cookies).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate until the chocolate is firm, about 1 to 2 hours. </p>"}]}