{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alton Brown", "Good Eats The Early Years", "holiday recipes", "mashed potatoes", "potatoes", "sides", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mashers", "link": "https://www.seriouseats.com/recipes/2009/11/mashers-alton-brown-mashed-potatoes-recipe.html", "description": "A few week's back we shared Mark Peel's recipe for Mashed Potatoes, Finally Revealed, a cream and butter-laden preparation that is the key to the smoothest restaurant caliber mashed potatoes. It turned out to be one of the the most...", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Cook the Book", "Mashed Potatoes", "Sides"], "recipeIngredient": ["2 pounds russet potatoes, rinsed, peeled, and cut into 1/2-inch chunks", "2 pounds red \"boiling\" potatoes, rinsed, peeled, and cut into 1/2-inch chunks", "2 teaspoons kosher salt, divided", "3/4 cup low-fat buttermilk", "1/4 cup heavy cream", "6 cloves garlic, peeled and smashed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all spud hunks in a 4-quart saucepan and add just enough cold tap water to cover. (You can put the potatoes in the water and refrigerate them for up to 8 hours before cooking.) Add 1 teaspoon of salt to the pot, cover, and bring to a boil over high heat. (This will take about 15 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the buttermilk, cream, and garlic in a 2-quart saucepan and bring to a bare simmer over low heat, watching to make sure that the mixture doesn't boil over. Keep the mixture barely bubbling until the potatoes are done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the spud water boils, ditch the lid, drop the heat to a simmer, and cook until the spuds are easily crushed with tongs, 15 to 20 minutes. Drain the potatoes, then return them to the pan and the heat. Toss and shake gently for 30 seconds or so to knock off surface moisture. (The drier the spuds the better.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move the pan to a trivet, hot pad, or towel on the countertop and sprinkle with the remaining 1 teaspoon salt. Pour on about a quarter of the buttermilk mixture and start mashing.</p>"}]}