{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091119-collardgreenschorizopoblanos-ctb.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chiles", "chorizo", "collard greens", "Cook the Book", "greens", "Matt and Ted Lee", "sausages", "Simple Fresh Southern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Collard Greens with Poblano Chiles and Chorizo", "link": "https://www.seriouseats.com/recipes/2009/11/collard-greens-with-poblano-chiles-and-chorizo-recipe.html", "description": "[Photograph: Caroline Russock] Saut&eacute;ed greens are a dish that rarely requires a recipe. No matter what green you have on hand, the process is relatively similar: Heat oil or butter, allium of your choice (onions, garlic, and shallots are popular...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cook the Book", "Leafy Greens"], "recipeIngredient": ["2 teaspoons peanut or canola oil", "8 ounces fresh chorizo, casings removed, cut into roughly 1-inch pieces; or 4 ounces cured chorizo, or other smoked sausage, finely diced", "3 poblano chiles, seeded and sliced into thin 2- to 3-inch strips (about 3 cups)", "2 teaspoons finely chopped garlic", "1 1/2 pounds collard greens (about 1 bunch), ribs removed, leaves thinly sliced (1 packed quart)", "1 teaspoon kosher salt, plus more to taste", "2 tablespoons red wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a 12-inch skillet or saute pan and set over high heat, and when it shimmers, add the chorizo. Cook, chopping up the (fresh) sausage with the back of a spoon, until the sausage has rendered most of it's fat, about 2 minutes. Add the poblanos, and continue to cook until they have softened slightly and the chorizo is cooked through, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the garlic, half the collards, the salt, and 2 tablespoons water to the skillet. Cook, turning the collards with tongs and adding more greens as those in the pan wilt, until all the collards are in the skillet. Continue to cook until the collards have softened and become dark green, about 6 minutes. Add the vinegar and continue to cook the collards, turning them occasionally, until the vinegar has completely evaporated and the pan is dry, about 3 minutes more. Season to taste with salt, if necessary, and divide the collards, poblanos, and chorizo among 4 warm serving plates. Serve immediately.</p>"}]}