{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-chickenandricesoup.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "cilantro", "Dinner Tonight", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken and Rice Soup with Ginger Dipping Sauce", "link": "https://www.seriouseats.com/recipes/2009/11/chicken-and-rice-soup-with-ginger-dipping-sauce-recipe.html", "description": "I was initially attracted to this recipe from Viet World Kitchen because it reminded me an awful lot of the Singaporean dish, Hainanese Chicken Rice. I'm kind of obsessed with that dish but rarely find the time to make it....", "totalTime": "", "recipeYield": "3 to 4", "recipeCategory": ["Dinner Tonight", "Ginger", "Soups and Stews"], "recipeIngredient": ["3/4 cup long-grain rice", "2 scallions", "10 cups chicken stock", "3 inches fresh ginger, peeled", "2 chicken leg quarters", "Salt", "Handful cilantro, chopped", "5 tablespoons fresh lime juice", "2 1/2 tablespoons sugar", "2 tablespoons fish sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rice into a large pot. Add enough water to cover the rice by an inch, and stir for a few seconds. Pour off this milky-colored water. Repeat this process two more times until the water that drains off is mostly clear, and not off-white.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take 1-inch of the ginger and cut it into thick slices, then add it to the pot. Cut the white part off of the scallion, and add it to the pot (save the green parts for a later use). Add the chicken legs and then pour in the chicken stock. Turn the heat to high and bring to a boil. Reduce heat to medium and cook at a vigorous simmer for 5 minutes. Turn the heat to medium-low, stir the contents, and partially cover. Cook for 15 minutes and then remove the chicken. Dunk the chicken in an ice bath for a few minutes. Pat them dry and set aside. Partially cover the pot again, and cook for 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, finely mince the remaining ginger. Add to a bowl along with the sugar, fish sauce, and lime juice. Stir until the sugar dissolves. Set aside for 30 minutes before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the soup is done, remove the ginger and scallion whites from the pot. Season with salt to taste. Chop the green parts of the scallions. Ladle the soup into a bowl and garnish with the scallion greens and cilantro. Slice the chicken into 1-inch segments and serve along the bowl along with some of the ginger and lime juice dipping sauce. </p>"}]}