{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091213CeleryRoot.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["celery root", "chicken", "Meat Lite", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Creamy Celery Root  Soup (with or Without Chicken)", "link": "https://www.seriouseats.com/recipes/2009/12/meat-lite-creamy-celery-root-soup-with-or-without-chicken-recipe.html", "description": "[Photograph: Joy Manning] This simple soup comes together with a minimum of fuss, partly because it's based on so few ingredients. Though the list is short and simple, the final bowl of soup delivers unexpectedly complex flavors thanks to...", "totalTime": null, "recipeYield": "makes 6 cups", "recipeCategory": ["Chicken", "Mains", "Meat Lite", "Soups and Stews"], "recipeIngredient": ["1 tablespoon butter", "2 bone-in, skin on chicken thighs", "1 teaspoon salt, divided", "1/4 teaspoon black pepper", "1 celery root, peeled and diced ", "1 medium leek, white and light green parts only, quartered and sliced", "5 cups chicken, turkey, or vegetable stock (homemade is best)", "2 tablespoons minced fresh tarragon", "1/4 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter over medium-high heat in a Dutch oven, season the chicken thighs with 1/2 teaspoon of the salt and the pepper, add to the pot and cook about five minutes per side, until the skin is brown. Remove and discard the skins, and transfer to a plate, and reserve. Do not drain the chicken fat from the pot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the celery root to the pot and cook, stirring occasionally, until golden brown, about 10 minutes. Add the sliced leeks and the remaining 1/2 teaspoon salt and cook another 10 minutes. Add the stock and the reserved chicken thighs, bring to a boil and reduce to a simmer. Cook, covered, for about 30 minutes.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull the chicken pieces from the soup, and use two forks to pull the meat from the bones. Shred the meat and then chop the shreds into bite-size pieces. Return the chicken meat to the soup and add the tarragon and the cream. Taste, adding additional salt and pepper if desired, and ladle into bowls. Serve with sliced baguette and softened butter.</p>"}]}