{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091204-artandsoulbaking-small.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "almonds", "Cindy Mushet", "Cookies", "holiday baking", "The Art and Soul of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Almond-Chocolate Spritz Cookies with Orange Blossom Water", "link": "https://www.seriouseats.com/recipes/2009/12/almond-chocolate-spritz-cookies-recipe.html", "description": "The orange blossom water lends faint citrus and floral background notes. I decided to forgo the chocolate filling in favor of a plum jam center, figuring the jam would pair nicely with the almond and orange flavors. As is the mark for all good cookies, most of them were gone before they even had a chance to cool.", "totalTime": "", "recipeYield": "about 50 cookies", "recipeCategory": ["Cook the Book", "Nuts"], "recipeIngredient": ["1/2 cup (5 ounces) firmly packed almond paste (do not substitute marzipan) ", "3/4 cup (5 1/4 ounces) sugar ", "1 3/4 sticks (7 ounces) unsalted butter, softened (65° to 68°F) ", "1 large egg plus 1 yolk ", "1 teaspoon orange blossom water or pure vanilla extract ", "2 cups (10 ounces) unbleached all-purpose flour ", "Pinch of salt ", "<strong>Chocolate Filling</strong>", "2 ounces semisweet or bittersweet chocolate (up to 56 percent cacao), finely chopped ", "1 tablespoon heavy whipping cream "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the dough: Place the almond paste and sugar in the bowl of the stand mixer (or in the food processor). Beat on medium speed for 1 1/2 to 2 minutes (or process for 45 seconds), until the almond paste is broken into tiny pieces. Add the butter and continue to beat for another 2 minutes (or process for 1 minute), until the mixture is well blended and slightly lighter in color. Scrape down the sides of the bowl with the spatula. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg and yolk and blend well (or process for 15 seconds). Add the orange blossom water and beat another 15 seconds to blend (or process for 5 seconds). Scrape down the sides of the bowl. Add the flour and salt. Turn the mixer to the lowest speed and blend slowly (or process for 10 to 15 seconds), just until there are no more patches of flour. Remove the bowl and stir gently a few times with the spatula to make sure there are no patches of unincorporated flour or butter lurking near the bottom of the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the dough: Line the baking sheets with parchment paper. Immediately spoon half of the dough into the pastry bag fitted with the star tip. Pipe rosettes on a prepared baking sheet, spacing the cookies about 1 inch apart. (Alternatively, use the cookie press according to the manufacturer's instructions.) The rosettes should be about 1/2-inch thick and about 1 3/4 inches in diameter. Repeat with the remaining dough. Chill the sheets in the refrigerator for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and position two oven racks in the upper and lower thirds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies, switching the sheets between the racks and rotating each front to back halfway through, for 15 to 20 minutes, until the cookies are rich, golden brown around the edges and across the bottom. Transfer to a cooling rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately use the rounded handle end of the wooden spoon (or another kitchen utensil) to make a depression in the center of each cookie about 1/2 inch across. Be careful not to push so hard that you crack the cookie or break through to the baking sheet below. Let the cookies cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the cookies: Place the chopped chocolate and cream in the microwave-safe bowl and microwave on low for 30 seconds. Stir the mixture. Heat again for 30 seconds and stir until smooth. If there are still lumps, heat again for 30 seconds. Once smooth, spoon a little chocolate into each depression in the cookies. Allow the filling to cool and set completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the cookies: Place the chopped chocolate and cream in the microwave-safe bowl and microwave on low for 30 seconds. Stir the mixture. Heat again for 30 seconds and stir until smooth. If there are still lumps, heat again for 30 seconds. Once smooth, spoon a little chocolate into each depression in the cookies. Allow the filling to cool and set completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Storing tips:</strong>  These cookies are at their best the first or second day. Keep them in an airtight container, layered between sheets of parchment or waxed paper to keep them from sticking to each other, for up to 4 days.</small></p>"}]}