{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090507AsparagusParmesanPainPerdu.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["asparagus", "brunch", "French", "French in a Flash", "pain perdu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Asparagus Parmesan Pain Perdu with Homemade Tomato Jam", "link": "https://www.seriouseats.com/recipes/2009/05/french-in-a-flash-asparagus-parmesan-pain-per.html", "description": "What's in a name? According to Shakespeare, not a whole lot. But does Shakespeare really know everything? To me, there are two kinds of names that are of the utmost fascination in the culinary world: the dishes a nation names...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["16 asparagus tips", "1 teaspoon olive oil", "1 teaspoon fresh rosemary leaves", "Salt and pepper", "1 cup half and half", "2 eggs", "1 cup grated Parmesan cheese, plus extra for sprinkling", "4 1 to 1-1/2 inch slices of dense white peasant bread", "4 teaspoons unsalted butter", "1 pint halved grape tomatoes", "1 tablespoon olive oil", "2 tablespoons sugar", "Juice of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F.  Toss the asparagus tips with 1 teaspoon of olive oil, the rosemary, and salt and pepper.  Scatter on a baking sheet, and roast for about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk the half and half, eggs, and Parmesan together in a pie plate, and season with mixture of salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take 4 cooked asparagus tips, and line them up, facing in alternating directions, on one piece of bread.  Dip the bread in the egg mixture, and, holding the asparagus flat to one side of the bread, flip it over so the asparagus side is also coated.  Press the asparagus into the soggy bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a sauté pan over medium-low heat.  Melt 2 teaspoons of butter in the pan, and place 2 pieces of bread, asparagus side down, into the pan.  Sauté low and slow, about 4 minutes per side, pressing down so the bread browns evenly.  Flip when golden, and brown another 4 minutes on the other side.  While it's cooking on the second side, sprinkle the asparagus side with about a teaspoon or so of Parmesan.  Keep warm in a 200&deg;F oven.  Repeat for the next two slices.  Serve with tomato jam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Tomato Jam</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-makes just enough for 4 slices of Parmesan Pain Perdu-</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all the ingredients in a sauce pot over high heat.  Bring to a boil, then reduce the heat to medium-low and simmer for 30 minutes, until most of the liquid has evaporated.</p>"}]}