{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090723lobster.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Canal House Cooking", "Christopher Hirsheimer", "Cook the Book", "lobster", "mayonnaise", "Melissa Hamilton", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cold Lobster with Homemade Mayonnaise", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-cold-lobster-with-homemade-mayo-mayonnaise-recipe.html", "description": "Photo from davehoban147 on Flickr Roasting a perfect chicken, making a vinaigrette, simmering a flavorful stock—these are basics that most good home cooks have down pat. You don't need an Escoffier-level knowledge of sauces, or the ability to tourné a...", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Cook the Book", "Lobster and Crab"], "recipeIngredient": ["Two 1 1/2-pound live lobsters", "1 lemon, halved ", "<strong>For the Mayonnaise</strong>", "1 large egg yolk", "1/4 clove garlic, finely minced", "Salt ", "Juice of half a lemon", "1/2 cup canola oil", "1/2 cup good smooth \"buttery\" olive oil", "2 tablespoons finely chopped fresh chervil or tarragon leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add water to a large pot to a depth of 2-3 inches.  Be sure that the pot is big enough to accommodate a large colander.  Bring the water to a boil over high heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the lobsters in the colander and place the colander inside the pot.  Cover the pot and steam the lobsters for 15 minutes.  Remove the colander with the lobsters and allow them to cool.  Refrigerate the lobsters until fully chilled, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the mayonnaise, whisk together the egg yolk, garlic, a pinch of salt, and half of the lemon juice in a medium bowl.  Combine the oils in a measuring cup with a spout.  Add the oil to the yolk about 1 teaspoon at a time, whisking constantly.  The mixture will thicken and emulsify.  After you have added about 1/4 cup of the oil, you can begin to slowly drizzle in the remaining oil as you continue to whisk until you have a thick, glossy mayonnaise.  Season with salt and thin with a little lemon juice if you like.  Transfer the mayonnaise into a serving bowl.  Cover and refrigerate until ready to use.  If using herbs, stir them into the mayonnaise just before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the lobsters on a cutting board, belly side down.  Using a large kitchen knife, cut each lobster in half lengthwise.  Crack the claws and knuckles with a nutcracker or by thwacking the back of the knife against the shells.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange each lobster on a plate, cut side up, and add a lemon half to each plate.  Pass the mayonnaise at the table.</p>"}]}