{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090820-italian-rosemary.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["condiments", "Italian", "onions", "rosemary", "Seriously Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Onion and Rosemary confettura", "link": "https://www.seriouseats.com/recipes/2009/08/seriously-italian-onion-and-rosemary-confettura-recipe.html", "description": "\"In the midst of so many other big flavors, rosemary's tendency to overwhelm is muted to a pleasant back note.\" Previously Zabaione, My Way » All Seriously Italian recipes » This past weekend I was given my annual windfall of...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Condiments and Sauces", "Italian"], "recipeIngredient": ["3 pounds peeled and trimmed onions (yellow, white, red, or a mix)", "1/2 cup olive oil", "1 ounce fresh rosemary, or about 6 long, full branches<a href=\"#note\">*</a>", "3 bay leaves", "3 to 4 teaspoons kosher salt", "Freshly ground black pepper", "1/2 cup balsamic vinegar", "1/4 cup red wine vinegar", "1/4 cup white wine", "1/2 cup honey", "1/4 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the onions in half and slice them thinly crosswise; you should have about 10 heaping cups of onions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a heavy 5 or 6-quart stock pot with a tight-fitting lid and add the onions, turning them over repeatedly in the oil to coat them.  Add the rosemary and bay leaves, burying them in the onions. Season the onions with 2 teaspoons of kosher salt and a few grinds of black pepper, and lower the heat to a simmer. Cover the pot and cook the onions for 15 to 20 minutes, until they have softened and released their liquid, and the rosemary has wilted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the lid and add the vinegars, wine, honey, and sugar, stirring well. Season the mixture with 1 more teaspoon of salt and a few more grinds of black pepper. Maintain the heat at a steady simmer and continue to cook the onions for an additional 15 to 20 minutes, stirring the mixture often with a wooden spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the liquid has reduced by about half, pick out and remove the rosemary stems and bay leaves and continue cooking for another 15 minutes. Taste the confettura and season with additional salt and pepper if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As the liquid continues to reduce, you must be careful to keep stirring to prevent the confettura from scorching. Continue cooking the mixture until it is soft, sticky, and moves from the bottom of the pan as you stir  Be careful not to let it caramelize.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the mixture to cool slightly, then spoon it carefully into clean jars and keep the confettura refrigerated for up to two months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"note\"></a><strong>* Note:</strong> The rosemary will shed its leaves into the confettura. If you prefer not to have the wilted leaves in your finished confettura, tie the rosemary in cheesecloth to make a sachet.</p>"}]}