{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090430-stuffed-poblanos.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["beans", "black beans", "grilling", "peppers", "poblano peppers", "spicy", "stuffed peppers", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Grilling: Stuffed Poblanos with Black Beans and Cheese", "link": "https://www.seriouseats.com/recipes/2009/05/grilling-stuffed-poblano-chile-peppers-with-black-beans-cheese-recipe.html", "description": "Editor's note: On Fridays, Joshua Bousel drops by with a recipe for you to grill over the weekend. Fire it up, Joshua! My recent failure at grilling stuffed peppers left a lingering desire for some that could fulfill my craving....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beans and Pulses", "Grilling", "Mains", "Vegetarian"], "recipeIngredient": ["1 cup uncooked white long grain rice", "1 1/2 cups water", "3 3/4 teaspoons kosher salt", "8 medium poblano peppers", "1 cup cooked black beans", "1 teaspoon toasted cumin seeds", "3/4 cup sour cream", "3/4 cup crumbled Cotija cheese (about 4 ounces)", "1/2 cup chopped cilantro (about 1/2 bunch)", "1 cup chopped fresh tomatoes (about 2 small tomatoes)", "2/3 cup chopped scallions (about 1/2 bunch)", "1 jalepeño, finely chopped", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rice in a colander or a fine mesh strainer and rinse under cold running water until the water runs clear. Combine rice, water, and 3/4 teaspoon of the salt in a medium saucepan and bring to a boil over high heat. Cover the pan and reduce heat to low; cook until water has been completely absorbed, about 10 minutes (rice will be slightly undercooked). Remove the lid and set the pan aside to let rice cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beans in a large mixing bowl. Using a potato masher or the back of a fork, lightly mash them (some whole beans will remain).  Stir cumin, sour cream, Cotija, cilantro, tomatoes, scallions, jalapeño, pepper, and remaining salt into mashed beans and mix until evenly combined. Gently mix in cooled rice. Taste mixture and, if necessary, season with salt and freshly ground black pepper. (Note that the filling should be quite salty to compensate for there being no salt on the peppers.)  Stuff each pepper with the filling and replace caps, securing with a toothpick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate. Place stuffed peppers on their sides and close the lid. Roll each pepper a quarter turn every 7 minutes or so to cook all four sides. The peppers are finished once the filling is hot, the skins are well-charred, and the flesh is soft to the touch, about 30 minutes.  Remove from the grill and serve.</p>"}]}