{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090305-crespelle-thumb.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["crepes", "desserts", "Italian", "pancakes", "Seriously Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Snow Day Crespelle", "link": "https://www.seriouseats.com/recipes/2009/03/seriously-italian-snow-day-crespelle-recipe.html", "description": "Editor's note: On Thursdays, Babbo pastry chef Gina DePalma checks in with Seriously Italian. After a stint in Rome, she's back in the States, channeling her inner Italian spirit via recipes and intel on delicious Italian eats. Take it away,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Crepe", "Desserts", "Italian"], "recipeIngredient": ["1/2 cup milk", "1/2 cup orange juice, or club soda, or in a real pinch, plain water", "1 large egg", "2 1/2 tablespoons butter, melted, or 2 tablespoons olive or vegetable oil", "2 tablespoons sugar", "1/4 teaspoon salt", "1 teaspoons pure vanilla extract (or 1 tablespoon white, light or dark rum, brandy, cognac, grappa, Amaretto, or Frangelico)", "1 cup all-purpose flour ", "<h5>Optional Flavorings</h5> ", "A few dashes of cinnamon and/or nutmeg; grated orange, lemon or tangerine zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the ingredients except the flour in a blender and whirl briefly to combine them.  Add the flour and blend until you have a silky-smooth, velvety consistency.  You may have to stop once and scrape any flour that sticks to the sides of the blender.  Let the batter sit for a few minutes; any lumps will float to the top and can be re-blended, removed or strained out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat and grease a 8- or 10-inch nonstick or cast iron sauté pan, or a crepe pan if you have one. Add enough batter to the pan and quickly swirl it around and to evenly coat the bottom of the pan; if it is too difficult to swirl the batter, thin it out with a bit of water or orange juice. (You'll get a better sense of how much batter to use after making the first one).  Place the pan back over the heat; when the edges have started to turn golden, loosen the cresepella with a small offset spatula or a butter knife and flip it with your fingers to cook the other side for another 30 seconds or so. Repeat with remaining batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can fill and serve the crespelle up as you go, or make an entire batch, layering them between sheets of parchment paper, keeping them warm in a low oven.  Fill them as desired and dust with powdered sugar.</p>"}]}