{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090305-fries-thumb.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["cheap", "disco fries", "Eat for Eight Bucks", "gravy", "oven fries", "poutine", "roasted garlic"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Eat for Eight Bucks: Gravy Cheese Oven Fries with Roasted Garlic", "link": "https://www.seriouseats.com/recipes/2009/03/eat-for-eight-bucks-gravy-cheese-oven-fries-recipe.html", "description": "Shopping List 3 large russet potatoes (about 1 3/4 pounds) - $1.78 16 ounces beef/chicken/vegetable stock - $1.59 4 ounces Gruyère cheese - $3.95 2 heads garlic - $0.70 Pantry items: Flour, butter, olive oil Total cost: $8.02 When...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Eat for Eight Bucks", "French Fries"], "recipeIngredient": ["3 large russet potatoes (about 1 3/4 pounds), peeled or scrubbed, cut lengthwise into 1/2-inch-wide planks, each plank cut lengthwise into 1/2-inch-wide strips", "2 tablespoons plus 1 teaspoon olive oil", "2 bulbs (heads) garlic, intact", "2 tablespoons butter", "2 tablespoons all-purpose flour", "16 ounces low-sodium beef, chicken, or vegetable stock ", "Kosher salt and freshly ground black pepper", "4 ounces Gruyère cheese, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F. Place potato batons in a rimmed baking sheet. Drizzle with 2 tablespoons olive oil and toss to coat thoroughly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove papery, outermost skin from garlic, but keep the bulb intact. Slice off top 1/2 inch of bulb, exposing each clove; discard trimmings. Drizzle each bulb with 1/2 teaspoon olive oil and rub with fingers to ensure top is evenly coated. Wrap and seal each bulb in aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast potatoes and garlic parcels on top rack of oven. After 20 minutes, turn potatoes with spatula. Roast until potatoes are tender and golden around the edges and garlic cloves are soft when pressed, about 20 minutes more. Sprinkle fries and garlic with kosher salt.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While potatoes and garlic are roasting, prepare gravy. In a saucepan, over medium heat, combine flour and butter. Stir until incorporated and cook, stirring frequently, until mixture is the color of peanut butter, about 3 minutes. Add the stock in small increments, whisking to incorporate after each addition. Bring to a boil, then reduce heat to medium-low and simmer until mixture has thickened, 15 to 20 minutes. Season well with salt and pepper. Remove from heat and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pile fries on a rimmed plate and top with grated Gruyère cheese and hot gravy (reheat if necessary). Place one bulb of roasted garlic on each plate. To eat, squeeze the cloves from their skins and smear onto fries. </p>"}]}