{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091228glazedcarrots.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "French", "keywords": ["carrots", "French", "glazed vegetables", "root vegetables", "The Crisper Whisperer", "vegetables", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: How to Glaze Root Vegetables", "link": "https://www.seriouseats.com/recipes/2009/12/the-crisper-whisperer-how-to-glaze-root-veget.html", "description": "Note: You may know Carolyn Cope as Umami Girl. She stops by on Tuesdays with ideas on preparing fruits and vegetables. [Photograph: Carolyn Cope] One of the first lessons you learn in culinary school is the unyielding power of mispronounced...", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Crisper Whisperer", "French", "Sides", "Vegetarian"], "recipeIngredient": ["<ul class=\"skinnyList\"><li>5 medium carrots peeled and cut into 1-inch pieces (or other root vegetables, to yield about 2 cups)", "</li><li>1 tablespoon butter", "</li><li>1 teaspoon sugar", "</li><li>1/4 to 1/2 cup water", "</li><li>Salt and pepper", "</li><li>2 tablespoons chopped parsley and/or chives, for garnish</li></ul>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a <em>cartouche</em> by cutting a circle of parchment the size of your sauté pan with a circular hole in the center. <a href=\"http://www.wonderhowto.com/how-to/video/how-to-make-a-cartouche-147277/\">This</a> is a good tutorial, except that you should snip off the pointy end of the triangle to make a hole in the center for steam to escape. (If this sounds like poorly pronounced French to you right now, it will make more sense after watching the short video.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a medium, heavy-bottomed sauté pan (preferably not non-stick) over medium-high heat. Add the carrots and toss to coat with butter. Sprinkle with the sugar and some salt and pepper. Pour in water to go about halfway up the carrots, not more than 1/2 cup. Cover with the <em>cartouche</em> and adjust the heat to maintain a brisk simmer. Cook for about 10 minutes, or until the carrots are just tender on the outside and still a bit too firm in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the <em>cartouche</em>, return the heat to medium-high, and cook the carrots uncovered, shaking the pan occasionally, until they brown in spots and the liquid is reduced to just enough glaze to coat the carrots, about 5 minutes. Garnish with chopped parsley or chives (or other herbs of your choice) and serve.</p>"}]}