{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090804-nastybits-thumb.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["black bean sauce", "Cantonese", "chicken feet", "dim sum", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Nasty Bits: No Mean Feet", "link": "https://www.seriouseats.com/recipes/2009/08/cantonese-chicken-feet-jalapenos-black-bean-sauce-dim-sum-recipe.html", "description": "I'm fond of all poultry feet. Goose and duck feet have ample amounts of webbing; when stewed, they are delicate and tender with a hint of chewiness that resembles the texture of simmered sheets of bean curd. While goose and duck feet are more prized in Chinese cuisine, I prefer the meatiness of a chicken's foot.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "The Nasty Bits"], "recipeIngredient": ["1 pound chicken feet (about 1 dozen)", "1/4 cup sugar", "1 1/2 quarts oil", "2-inch piece of fresh ginger", "3 pieces star anise", "<strong>For the marinade:</strong>", "2 cloves garlic, finely minced", "3 tablespoons black bean sauce", "2 tablespoons oyster sauce", "2 tablespoons soy sauce", "1 tablespoon Shao-xing rice wine, sake, or vermouth", "2 tablespoons sugar", "1 teaspoon finely ground white pepper", "1 ounce dried red chile pepper, broken up, or 1 jalapeño, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash feet thoroughly in cold water. With kitchen shears, clip off the toenails.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very carefully dry each individual foot, so as to minimize the splattering of oil later on. Place the feet in a dry bowl and toss to coat with the sugar. The sugar will help the feet to brown in the oil.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the pot of oil to 300°F. If you do not have a candy thermometer, test the oil by dropping in one chicken's foot. The feet should take approximately 5 to 8 minutes to reach a light golden brown color. Every few minutes, very carefully move the feet around with a metal tong, to promote even frying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have ready a large bowl of ice water. As soon as the feet are done frying, remove them with a metal tong and immediately plunge them into the bowl of ice water. At first, the feet will float on the surface, but eventually they will soak up the water and sink into the bowl. Let sit for ten or so minutes. You will notice that the feet will start to puff up, looking very wrinkled and bloated.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to boil and add toss in the ginger and star anise. Add the feet and simmer for 1.5 to 2 hours. The feet will be very tender and engorged by the time they are done cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>During the last half hour of simmering, combine all the marinade ingredients in one medium bowl. Gently mix the simmered feet with the marinade, and let cool before refrigerating. Marinade the feet overnight, or for up to twenty-four hours. The next day, steam the feet along with their marinade for fifteen minutes, using a bamboo steamer or a metal insert. Serve piping-hot.</p>"}]}