{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/091225Zucchini_Stuffed_With_Israeli_Couscous.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "", "keywords": ["entrees", "hanukkah sides", "Israel", "Israeli couscous", "side dish", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Zucchini Stuffed with Israeli Couscous", "link": "https://www.seriouseats.com/recipes/2009/12/zucchini-stuffed-with-israeli-couscous-recipe.html", "description": "Note: Michael Natkin of the vegetarian blog Herbivoracious drops by on Wednesdays to share a delicious recipe and expand our vegetarian repertoire. If you haven't had Israeli couscous before, you are in for a treat. Known as P'titim in Israel,...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Seriously Meatless", "Vegetarian", "Zucchini"], "recipeIngredient": ["4 medium zucchini", "5 tablespoons olive oil, divided", "2 leeks, white parts and light green sliced thin and thoroughly cleaned", "2 tablespoons butter", "8 ounces Israeli couscous (do not substitute regular couscous!)", "1 3/4 cups vegetable broth (a clear type, not a thick soup)", "1 bay leaf", "2 cloves garlic, thinly sliced", "1 28 ounce can crushed tomatoes", "Zest of one lemon (Meyer lemon if possible)", "1/8 teaspoon chili flakes", "1/2 cup homemade breadcrumbs, toasted in a skillet with butter", "Handful of flat-leaf (Italian) parsley leaves", "1/2 cup feta cheese, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Cut the zucchini in half lengthwise, remove a bit off each end, and hollow them out with a tablespoon, reserving the pulp. Leave walls about 1/4\" thick. Brush with olive oil, sprinkle with a bit of salt, and roast (in a casserole that you will later finish the dish in) for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large skillet, heat two tablespoons of the olive oil over a medium high flame. Fry the leeks with a big pinch of salt until softened. Roughly chop the reserved zucchini flesh and add to the pan. Cook until all the water is released and cooked off, and the zucchini has browned a little. Taste and adjust salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, melt the butter over medium heat. Toast the couscous in the butter, stirring occasionally, until lightly browned. Add the vegetable broth, bring to a simmer, reduce heat to low, cover, and cook until the liquid is absorbed. Stir in the leek mixture. Taste and adjust seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, heat two tablespoons of olive oil over a medium high flame. Cook the garlic for one minute. Add the tomatoes, lemon zest, and chili flakes and a big pinch of salt and bring to a simmer. Taste and adjust salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the zucchini from the casserole and ladle in the sauce. Return the zucchini. Fill with the couscous mixture and bake about 15 minutes, until the sauce is bubbling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish with the breadcrumbs, parsley leaves and feta and serve.</p>"}]}