{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090904-deviledeggsthumb.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "", "keywords": ["appetizers", "deviled eggs", "eggs", "potlucks", "Seriously Meatless", "Super Bowl sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Meatless: Devilishly Handsome Eggs with Smoked Paprika", "link": "https://www.seriouseats.com/recipes/2009/09/deviled-eggs-vegetarian-mayo-sumac-recipe.html", "description": "Note: Serious Eater Michael Natkin of the vegetarian blog Herbivoracious drops by every Wednesday to share a delicious recipe to expand our vegetarian repertoire. This week's dish will make you the popular kid at the Labor Day bash. Want to...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Deviled Eggs", "Gluten-Free", "Seriously Meatless", "Vegetarian"], "recipeIngredient": ["1 dozen eggs plus 1 for the mayo", "1 cup extra-virgin olive oil", "Juice of 1 lemon, divided", "1/4 cup minced white onion", "1/3 cup minced fresh flat-leaf parsley", "2 teaspoons smoked paprika (pimenton de la vera or agridulce)", "2 teaspoons Dijon mustard", "Salt", "Sumac powder for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dozen eggs in a large pot of cold water and add a tablespoon of salt. Over maximum heat, bring the eggs to a full boil, then immediately turn off the heat, cover, and let sit for exactly 10 minutes. Drain and cover with cold water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the eggs, cut them in half lengthwise, and pop out and reserve the yolks. For neatness, use a damp paper towel to wipe off any yolk stuck to the outsides and flat surfaces of the eggs; it is fine if a bit clings inside the hole.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the remaining egg into the jar of a blender. Add a big pinch of salt and 1/2 of the lemon juice. Whiz for a few seconds. Remove the center insert from the lid and begin drizzling in the cup of olive oil. Start slowly and then you can go a little more quickly once it emulsifies. It probably won't be quite as stiff as store-bought mayonnaise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mash the egg yolks thoroughly with a fork.  Add the onion, parsley, smoked paprika, the remaining lemon juice, and a nice pinch of salt. Mash some more--you won't be able to get it completely smooth but do the best you can. Then start adding the mayonnaise, starting with 1/2 cup and then a tablespoon at a time until it reaches the right consistency. You want it rather soft and smooth, but not so thin it can't hold a shape. If you have leftover mayonnaise, it is delicious for dipping fresh vegetables. Or on toast. I like it on toast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Either spoon the filling into the eggs, or for bonus points, fill a pastry bag and pipe it in with a large star tip. Garnish with the sumac or additional paprika. Refrigerate until serving time.</p>"}]}