{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090622farmersmarketcookbook.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["L.A.'s Original Farmer's Market Cookbook", "potatoes", "Thanksgiving recipes", "turkey", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Magee's Roast Turkey, Parsley Potatoes, and Stewed Zucchini", "link": "https://www.seriouseats.com/recipes/2009/06/magees-roast-turkey-parsley-potatoes-stewed-zucchini-recipe.html", "description": "Photograph from chrisfreeland2002 on Flickr This recipe comes from the first Farmer's Market restaurant, Magee's Kitchen. According to JoAnn Cianciulli, author of L.A.'s Original Farmer's Market Cookbook, Blanche Magee would bring ham sandwiches and salads to the farmers selling their...", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 whole bone-in turkey breast (6 to 7 pounds) preferably free-range", "Kosher salt and freshly ground black pepper", "1/4 all-purpose flour", "2 1/2 pounds small red or white new potatoes, peeled", "1 teaspoon kosher salt", "1/4 cup (1/2 stick) unsalted butter, melted", "1/2 finely chopped parsley", "2 tablespoons corn oil", "1 onion, chopped", "1/2 teaspoon sugar", "1/4 teaspoon garlic powder", "1 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "1 can (28 ounces) diced tomatoes, with juice", "1/2 teaspoon dried basil", "8 to 10 small green zucchini, cut into 1-inch slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg F and remove the top rack so the turkey fits.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the turkey breast with cold water and pat dry with paper towels.  Sprinkle the skin generously with salt and pepper.  Put the turkey, breast-side up, in a large roasting pan.  Cook until an instant-read thermometer inserted in the thickest part of the breast registers 160 to 165&deg F, about 2 hours.  If the turkey begins to get too dark before it is cooked through, cover loosely with aluminum foil.  Transfer the turkey to a cutting board and let rest for 15 minutes before carving, so the juices can settle back into the meat.  In the meantime, make the gravy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a glass measuring cup or small bowl, combine the flour with 1/4 cup cool water and stir to mix well.  Add to the roasting pan and stir into the juices, scraping up any browned bits from the bottom of the pan.  Place the pan over high heat and bring to a boil, then reduce to medium-low and simmer until the gravy thickens slightly, about 3 minutes.  Remove from the heat and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve the turkey and serve with the gravy, potatoes, and zucchini.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Parsley Potatoes</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes in a large pot and add cold water to cover.  Add the salt and bring to a boil over high heat, uncovered.  Reduce the heat to medium and simmer until there is no resistance when a fork is inserted into the potatoes, about 30 minutes.  Drain the potatoes well in a colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the potatoes out in a shallow baking pan.  Brush with the melted butter and sprinkle evenly with the parsley.  The parsley potatoes can be held in a warm oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Stewed Zucchini</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a pot over medium-low heat and coat with the oil.  When the oil is hazy, add the onion, sugar, garlic powder, 1/2 teaspoon of the salt, and the pepper.  Cook slowly until the onion is soft but not browned, about 10 minutes.  Carefully pour in the tomatoes with their juice and add the basil.  Stir the sauce to combine the ingredients.  Simmer gently, uncovered, stirring occasionally, for 30 minutes, to allow the flavors to marry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a simmer.  Add the zucchini and cover.  Cook until tender, 3 to 4 minutes.  Stir in the remaining 1/2 teaspoon of salt, then drain.  Arrange the zucchini on a platter and spoon the desired amount of tomato sauce on top.</p>"}]}