{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090922BellPeppers.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["casseroles", "eggplant", "Italian sausage", "Meat Lite", "peppers", "sausage", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Eggplant, Tomato, and Pepper Casserole", "link": "https://www.seriouseats.com/recipes/2009/09/eggplant-tomatoes-peppers-italian-sausage-casserole-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. [Photograph: PHIGONGGOI on Flickr] The story of this...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Eggplant", "Mains", "Meat Lite", "Pork"], "recipeIngredient": ["2 1/2 pound potatoes, sliced thin", "1 1/2 pound eggplant, sliced thin", "1/2 cup plus 2 tablespoons olive oil, divided", "4 ounces hot Italian sausage, casings removed and crumbled ", "2 medium onions, (about 2 cups) diced, and divided", "5 garlic cloves, minced", "1 can (28-ounce) whole tomatoes, pureed with their juice", "1/2 cup basil leaves, coarsely torn", "3 bell peppers, any color, quartered and sliced thin", "1/2 teaspoon salt, divided", "3/4 cup sharp provolone cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven 425°F and line as many half sheet pans as you have with as many silpats as you have. (Or line them with that nifty non-stick aluminum foil.) Using about 1/2 cup of the oil, brush each side of the eggplant and potato slices and arrange in a single layer on your pans. Roast in shifts, putting only two trays in the oven at a time, until the vegetables are soft and golden at the edges, about 20 minutes per batch. If your oven's heat isn't perfectly even, rotate halfway through. Set the potatoes and eggplant aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes and eggplant roast, start the sauce by browning the sausage in 1 tablespoon of the oil in a medium saucepan over medium-low heat. When the sausage has rendered its fat and is starting to brown, add 1 cup of the onions and the garlic and cook until softened, about 5 minutes. Add the tomatoes, basil, 1/4 teaspoon of the salt, and bring to a simmer, and reduce to low. Simmer for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As the sauce simmers, heat the remaining tablespoon of oil in a sauté pan and the remaining cup of onion, the sliced peppers, and the remaining 1/4 teaspoon of salt and cook, stirring occasionally until the peppers are very soft, about 10 minutes. Reduce oven to 400°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush a 9-by-13-inch baking dish with oil, and put down a layer of potato slices with about one-third of the potatoes. Top with half the tomato sauce, half the eggplant slices, one-third of the cheese, and half the sautéed peppers. Put down a second layer of potatoes and repeat. Top with remaining one-third of potatoes and the remainder of the cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with aluminum foil; bake for 20 minutes. Remove foil; bake 10 minutes more, just until the top is golden-brown. Let sit for 10 minutes before cutting.</p>"}]}