{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090820-grilled-gazpacho.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["gazpacho", "grill", "grilling", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Gazpacho", "link": "https://www.seriouseats.com/recipes/2009/08/grilling-gazpacho-soup-recipe.html", "description": "On Fridays, Joshua Bousel drops by with a recipe for you to grill over the weekend. Fire it up, Joshua! [Joshua Bousel] The extreme heat and humidity we have going on here in New York hasn't exactly left me with...", "totalTime": "", "recipeYield": "serves 6", "recipeCategory": ["Gazpacho", "Grilling", "Healthy and Delicious", "Mains", "Vegetarian"], "recipeIngredient": ["4 scallions", "2 to 3 cloves garlic", "1 medium red onion, peeled and quartered", "1/3 cup extra virgin olive oil", "2 1-inch thick slices of country style white bread or French bread", "5 vine-ripened tomatoes (about 2-1/2 pounds)", "1 red bell pepper", "1 green bell pepper", "1 cucumber, peeled", "1/4 cup mixed chopped fresh herbs (including basil, oregano, tarragon, and/or flatleaf parsley)", "2 tablespoons red wine vinegar (or to taste)", "1/2 to 1 cup cold water, or as needed", "salt and freshly ground black pepper", "2 bamboo skewers, soaked in water for 30 minutes prior to using"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop the scallion greens and set aside for garnish. Skewer the scallion whites on bamboo skewers or toothpicks. Skewer the garlic cloves and onion quarters the same way. Lightly brush the scallion whites, garlic, and onion quarters with olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate.  Place scallions, garlic, onion, tomatoes, bread, and peppers on the grill.  Grill scallions, garlic, onions, and bread until nicely browned, about 2-3 minutes per side.  Grill the tomatoes and bell peppers until charred, about 2 minutes per side for the tomatoes and 4 minutes per side for the peppers.  Transfer to a plate to cool. Scrape the charred skins off the tomatoes and peppers with a paring knife. (Don't worry about removing every last bit.) Core and seed the peppers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the garlic and place them in a blender along with the scallion whites, onions, toast, tomatoes, bell peppers, cucumber, herbs, vinegar, and remaining olive oil and puree until smooth. Thin the gazpacho to pourable consistency with water if needed and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gazpacho in the refrigerator to chill for at least 1 hour, preferably until very cold.  Just before serving, correct the seasoning, adding salt or vinegar to taste. To serve, ladle the gazpacho into bowls and sprinkle with the chopped scallion greens.</p>"}]}