{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090127provencaltomatosoup.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["goat cheese", "soups", "tomato soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Provençal Tomato Soup with Chèvre", "link": "https://www.seriouseats.com/recipes/2009/01/provencal-tomato-soup-with-goat-cheese-chevre-recipe.html", "description": "I've long been on a search for a spectacular tomato soup recipe that doesn't achieve greatness by adding lots of heavy cream, the most common way to temper the acidity of tomatoes. I already love the variation using bread that...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Dinner Tonight", "Gluten-Free", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["2 teaspoons Provençal spice blend (or equal parts dried basil, thyme, oregano, and fennel seeds)", "Extra virgin olive oil", "3 medium onions, chopped", "3 garlic cloves, minced", "1/4 cup tomato paste", "1/3 cup dry vermouth", "1 can (28 ounces) whole tomatoes, crushed by hand  (or 2 pounds fresh tomatoes, peeled, seeded, and chopped)", "4 cups chicken or vegetable broth", "1/4 teaspoon ground cinnamon", "4 ounces fresh goat cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the bottom of a heavy soup pot (5 to 6 quarts) with olive oil.  Over medium-high heat, cook the onions with a pinch of salt until golden, 5 to 8 minutes, stirring often.  In the meantime, lightly crush the spice mix to release the flavors in a small bowl. Add to the onions with garlic and cook until the aromas open, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the tomato paste and continue stirring until no lumps remain.  Add the vermouth and cook for a minute, then add the tomatoes.  Bring to a boil, cook for two minutes, then add the broth.  Bring to a simmer, cover, and cook for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the cinnamon and season to taste with salt and pepper.  Ladle the soup into bowls and top with crumbled goat cheese.</p>"}]}