{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090310radicchiorisotto.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["pancetta", "radicchio", "rice", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Radicchio Risotto", "link": "https://www.seriouseats.com/recipes/2009/03/radicchio-risotto-recipe.html", "description": "Greens like escarole, endive, and the belovedly bitter radicchio are staples in winter, providing a sturdy counterpoint to warm, rich flavors as bold elements in a salad, such as frisee against crispy bacon or radicchio against crusty Jerusalem artichokes. But...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Dinner Tonight", "Rice"], "recipeIngredient": ["6 tablespoons extra virgin olive oil", "2 ounces pancetta, minced", "1 pound radicchio, coarsely chopped", "Kosher salt and freshly ground black pepper", "1 cup chopped onion", "1 1/2 cups Carnaroli or Arborio rice", "2/3 cup white wine", "5 cups hot chicken broth", "2 tablespoons unsalted butter", "1/4 cup freshly grated Parmesan cheese", "Aged balsamic vinegar for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm a 12-inch skillet over medium-low heat and add 2 tablepoons of oil with the pancetta.  Cook for about 2 minutes, until the pancetta releases its fat and begins to crisp, then add the radicchio with a pinch of salt and pepper.  Stir to coat with the fat and cook until wilted down, 6 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat a large heavy pot over medium heat and add the remaining olive oil.  Saute the onion until soft, about 8 minutes, then add the rice.  Stir until the edges of the rice kernels turn translucent, then add the wine and stir until it evaporates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the warm broth little by little, stirring occassionally, as it is absorbed slowly.  Keep the risotto constantly at a lazy bubble, adjusting the heat as necessary.  Halfway through, stir in the racicchio-pancetta mixture. Total rice cooking time should be about 20 minutes, ending with a somewhat soupy and not-too-stiff consistency.  Season to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the butter and Parmesan and remove from the heat.  Cover and let sit for 2 minutes, then serve immediately.</p>"}]}