{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091203-dt-farro-salad-with-roasted-veg.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["farro", "Italian", "salads", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Italian Farro Salad with Roasted Vegetables", "link": "https://www.seriouseats.com/recipes/2009/12/dinner-tonight-italian-farro-salad-with-roasted-vegetables-recipe.html", "description": "[Photograph: Blake Royer] Though farro is not the easiest ingredient to find these days, according to Wikipedia it's an ancient grain, and one of the first domesticated crops in the Near East, eaten widely for thousands of years. Now, you...", "totalTime": null, "recipeYield": "4-6", "recipeCategory": ["Dinner Tonight", "Italian", "Salads", "Vegetarian"], "recipeIngredient": ["1 pound farro, bulgar wheat, or spelt", "3 or 4 zucchini, a mixture of yellow and green, cut into wide half-moons", "2 bulbs fennel, cored and thickly sliced, fronds reserved for garnish", "1 red onion, peeled and cut into wedges", "2 red peppers, deseeded and cut into chunks", "2 small eggplants or 1 large, cut into chunks", "4 garlic cloves, peeled", "Extra virgin olive oil as needed", "Small handful of chopped flat-leaf parsley, or another herb such as basil, mint or oregano", "Juice from 1 lemon, or to taste", "Sea salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. In a roasting tray or baking sheet, spread the chopped vegetables out and drizzle generously with olive oil, making sure there is plenty of room for the vegetables to caramelize. Sprinkle with salt and roast for 30-40 minutes, shaking the pan occasionally. Remove to cool slightly and sprinkle with the fresh herbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, cover the farro or other grain with cold water in a large saucepan. Bring to a boil and cook until tender, 20-30 minutes. Drain well, then dress with olive oil, lemon juice, salt, and pepper to taste. Toss with the roasted vegetables and season again to taste. Cover with chopped fennel fronds and serve.</p>"}]}