{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cornmeal", "fish", "Mark Peel", "New Classic Family Dinners", "trout"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cornmeal-Crusted Pan-Fried Trout", "link": "https://www.seriouseats.com/recipes/2009/11/cornmeal-crusted-pan-fried-trout-recipe.html", "description": "After a week of labor-intensive recipes from New Classic Family Dinners by Mark Peel, I was ready for something that required a little less work. I had originally picked up some trout to make Peel's take on matelote, a fish...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Fish"], "recipeIngredient": ["4 small trout, scaled, heads removed, boned, and butterflied, pinbones removed (The fish department should do this.  Make sure that the tail and skins are intact, and the two filets are joined at the tail.)", "Kosher salt and freshly ground black pepper", "6 tablespoons fine cornmeal (if you only have polenta or coarse cornmeal, you can grind it to a fine powder in a clean spice mill)", "1/4 cup all-purpose flour", "1 tablespoon plus 1 teaspoon finely chopped fresh flat-leaf parsley", "1/4 cup canola oil", "1 tablespoon plus 1 teaspoon butter", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large, heavy cast-iron skillet over medium-high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open up the trout, pat dry, and season with salt and pepper.  Mix together the cornmeal, flour, 1 teaspoon salt, 1/2 teaspoon pepper, and the parsley in a wide bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the trout into the cornmeal mix on the cut side only.  Make sure it is thoroughly coated.  If not cooking right away, place the fish on a platter in one layer, uncovered, in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons of canola oil to the hot pan and when it is just below smoking, carefully add 1 or 2 trout-however many will fit in your pan-skin side up.  After 1 minute, add 2 teaspoons of butter to the pan.  Watch the skin, and when you see it begin to dimple and curl (this will take about 2 minutes), turn the fish.  Cook on the skin side for 30 seconds to a minute, just until the fish begins to curl.  Remove from the pan and keep warm in a low oven while you repeat with the remaining oil, butter, and fish.  Serve hot, with lemon wedges.</p>"}]}