{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091027-dt-croque-madame.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["croque madame", "croque monsieur", "Dinner Tonight", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Croque Madame", "link": "https://www.seriouseats.com/recipes/2009/10/dinner-tonight-croque-madame.html", "description": "[Photograph: Blake Royer] Sometimes I wonder if my fascination with putting fried eggs on everything will ever abate. Is it a childish notion, or lazy cooking habit? Whether it's my recent meal of lentils, greens, and eggs, or a black...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Sandwiches"], "recipeIngredient": ["4 slices crusty sourdough bread", "4 ounces Gruyère or other aged Swiss-style cheese such as Comté, very thinly sliced", "1/3 pound smoked ham, such as Black Forest, very thinly sliced", "2 large eggs", "3 tablespoons butter", "a few chives, thinly sliced", "flaky salt", "freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay half the bread slices out and lay the cheese on top of them, followed by the ham.  Top with the remaining bread, and spread a tablespoon of butter on the sides facing up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a panini press or ridged grill pan and lay the sandwiches (cooking in batches if necessary) buttered side down.  Butter the outside of the second bread slice with an additional tablespoon of butter. If using a grill pan, weigh the sandwich down with a heavy skillet, such as cast iron, or close the panini press. Cook over medium-low heat until the bread is golden and crisp, then flip to cook the other side if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat the remaining tablespoon of butter in a medium non-stick skillet over medium-high heat.  When it begins to foam, add the eggs and season them with flaky salt, then cover and cook until the whites are set but the yolk is still runny, 2-3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center each egg on a sandwich and top with fresh pepper and chives.</p>"}]}