{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110307ramosfizzprimary.jpg", "author": {"@type": "Person", "name": "Paul Clarke"}, "recipeCuisine": "", "keywords": ["cocktail", "gin", "orange flower water"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ramos Fizz", "link": "https://www.seriouseats.com/recipes/2009/06/time-for-a-drink-ramos-fizz.html", "description": "In the ranks of New Orleans-born coolers, the <strong>Ramos Fizz</strong> (aka Ramos Gin Fizz) is royalty. Created in 1888 by bar owner Henry C. Ramos, the fizz that bears his name takes the already appealing Silver Fizz--a mixture of gin, lemon, sugar and seltzer, with an egg white to add foam and body--and advances it several steps along the decadence line, adding cream, lime juice and a few drops of aromatic orange-flower water (no, not orange juice--the perfume-like stuff usually sold in small blue bottles).", "totalTime": "", "recipeYield": "makes 1 cocktail", "recipeCategory": ["Gin"], "recipeIngredient": ["2 ounces gin", "1 ounce cream", "1 egg white", "1/2 ounce lemon juice", "1/2 ounce lime juice", "2 teaspoons sugar, to taste", "2-3 drops orange flower water ", "Seltzer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine everything except seltzer in a cocktail shaker. Tradition dictates that the drink be shaken very hard for at least one and preferably two full minutes with ice. You can cheat by either whisking the mixture with a milk-frother or whisk (or tossing a spring from a Hawthorne strainer into the shaker and using that to whip the ingredients) until foamy, and then shaking with ice for a good 20 seconds, or you can buckle down and take the fully authentic ride, while working off the calories you’ll be taking in from the cream and sugar. Strain into a chilled Collins glass and add an ounce or two of chilled seltzer, to taste.</p>"}]}