{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090610ChaussonAuxPommes.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["apples", "chaussons aux pommes", "desserts", "French", "French in a Flash", "pastries", "turnovers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Chaussons aux Pommes with Cinnamon Crème Fraîche", "link": "https://www.seriouseats.com/recipes/2009/06/french-in-a-flash-chaussons-aux-pommes.html", "description": "Like slippers, <em>Chaussons aux Pommes</em> are harbingers of home and of comfort. Though it is an old-sounding word, it expresses timeless human emotion far more effectively and evocatively than the more modern \"turnover\" ever could. Mine start simply with Golden Delicious apples, done French--as in, without cinnamon. They are folded into a simple pocket of bought puff pastry. The American apple-cinnamon duo is completed with a slightly sweet, certainly spicy cinnamon crème fraîche in which to dip the warm <em>chausson</em> before munching it down burning from the oven.", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Apple", "French", "Pastry"], "recipeIngredient": ["3 Golden Delicious apples", "3 tablespoons sugar, plus extra for sprinkling", "1 tablespoon flour", "Pinch of salt", "juice of 1/4 lemon", "4 sheets of frozen puff pastry, thawed but cold (from 2 boxes, preferably pure butter)", "1 egg, beaten for an egg wash", " ", "For the Cinnamon Crème Fraîche: ", "1/2 teaspoon cinnamon", "3 tablespoons powdered sugar", "1/2 cup crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees. Peel and core the apples, and slice them into 1/2-inch slices.  Toss with the 3 tablespoons sugar, 1 tablespoon flour, a pinch of salt, and the juice of 1/4 lemon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the puff pastry, using bench flour to prevent sticking, so that you can cut 2 circles the size of tea saucers out of opposite corners of each sheet of puff pastry: you will have 8 circles in all.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the apples among the pastries, and place them on one half of each circle.  Be careful not to over stuff.  If you have extra apples, fold them into the remaining scraps of puff pastry for a chef's snack.  Or if you have extra pastry, cut it into strips and sprinkle with cinnamon sugar and bake alongside the <em>chaussons</em>.  For the <em>chaussons</em>, use a pastry brush to paint the egg wash all along the rim of the pastry.  Fold over into little semi-circles, and press the edges together.  Crimp with a fork.  Slice 4 vents in the top of the pastry.  Brush with egg wash, and sprinkle with sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the <em>chaussons</em> to 2 baking sheets, and bake for 20 minutes.  The pastry will be golden, buttery, and flakey, and the apples will be gooey, oozing, and sweet.  Serve warm with cold cinnamon crème fraîche (recipe follows).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the Cinnamon Crème Fraîche, stir together cinnamon, powdered sugar, and Crème Fraîche. Chill. </p>"}]}