{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090323-ctb-ten.jpg", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grilling", "panzanella", "Sheila Lukins", "Ten"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Tomato Bread Salad", "link": "https://www.seriouseats.com/recipes/2009/03/draftcook-the-book-grilled-tomato-bread-salad.html", "description": "From the Pickup Sticks (aka stuff on sticks) category in Ten comes a grilled tomato bread salad great for a warm, sunny day. Essentially panzanella grilled on a stick, it's a nice alternative to the typical meatfest buffet at barbecues....", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["8 12-inch metal skewers", "4 cups cubed French or peasant bread (1-inch cubes)", "6 tablespoons extra-virgin olive oil, or more if desired", "1 teaspoon dried thyme leaves", "Salt and freshly ground black pepper, to taste", "3 red onions, cut into 1/2-inch-thick slices", "8 ripe plum tomatoes", "2 cucumbers, peeled, halved lengthwise, seeded, and cut into 1-inch pieces (about 2 cups)", "1/2 cup fresh basil leaves, slivered", "2 tablespoons red wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a barbecue grill to high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bread cubes in a bowl and drizzle 2 tablespoons of the olive oil over them. Sprinkle with the thyme, add salt and pepper to taste, and toss well. Thread the bread on six skewers, leaving some space between the cubes. Set the skewers aside</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush 1 tablespoon of the remaining olive oil over both sides of the onion slices, and grill the onions directly on the grill grate until they have some light grill marks and are softened and have light grill marks, about 5 minutes total. Set the onion slices aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 4 plum tomatoes on each of two metal skewers and brush them lightly with 1 tablespoon of the oil. Grill, turning the skewers, until the tomatoes have softened and have light grill marks, about 5 minutes total. Slide the tomatoes off the skewers onto a plate and set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the skewered bread cubes until they are nicely toasted, about 1 1/2 minutes per side (grill on all four sides). Slide the bread cubes into a separate bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the reserved grilled onion slices into quarters and add them to the bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a serrated knife, cut the grilled tomatoes into quarters and add them to the bread. Add the cucumbers and the basil. Drizzle the remaining 2 tablespoons olive oil over the vegetables, adding more if desired, and then drizzle the vinegar over them. Toss well. Taste, and adjust the seasonings if needed. Serve immediately.</p>"}]}