{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090102intothevietnamesekitchen_cover.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "Vietnamese", "keywords": ["Andrea Nguyen", "casseroles", "chicken", "Cook the Book", "dutch oven", "Into the Vietnamese Kitchen", "rice", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken and Vegetable Clay Pot Rice", "link": "https://www.seriouseats.com/recipes/2009/01/vietnamese-chicken-and-vegetable-clay-pot-rice-recipe.html", "description": "While traditionally made in a clay vessel, today's Cook the Book recipe is just as easily made in a Dutch oven. In fact, Andrea Nguyen, author of Into the Vietnamese kitchen, prefers it that way, because a beautiful, crunchy crust...", "totalTime": null, "recipeYield": "3 or 4 as a light main dish, or 6 with 2 or 3 other dishes", "recipeCategory": ["Chicken", "Cook the Book", "Mains", "Rice", "Vietnamese"], "recipeIngredient": ["1/2 teaspoon salt", "1/4 teaspoon white pepper", "1/2 teaspoon sugar", "2 tablespoons oyster sauce", "2 teaspoons light (regular) soy sauce", "3/4 pound boneless, skinless chicken thighs, cut into 1/2-inch cubes", "5 tablespoons canola or other neutral oil", "1 small yellow onion, finely chopped", "2/3 cup chopped celery (pea-sized pieces)", "2/3 cup chopped carrot (pea-sized pieces)", "5 or 6 dried shiitake mushrooms, reconstituted, trimmed, and chopped into pea-sized pieces", "1/2 cup frozen peas, preferably petite peas, thawed", "2 cups long-grain rice", "2 2/3 cups chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, stir together the salt, white pepper, sugar, soy sauce, and oyster sauce. Add the chicken and use chopsticks to mix well. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat 2 tablespoons of the oil over medium heat. Add the onion and saute for about 1 minute, or until fragrant. Add the celery, carrot, and mushrooms and continue to saute for about 2 minutes, or until half cooked. Add the chicken and saute gently for 3 to 4 minutes, or until the chicken is cooked through. Remove from the heat, stir in the peas, and set the pan aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the rice and let it drain from 10 minutes in a sieve positioned over a bowl. Meanwhile, bring the stock to a near simmer in a small saucepan and then cover to keep it hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed 5-quart Dutch oven or similar pot, heat the remaining 3 tablespoons oil over medium-high heat. Firmly shake the sieve holding the rice to expel any hidden water, and then add the rice to the pot. Stir constantly with a large spoon for about 3 minutes, or until the grains are opaque and feel light. Add the stock and expect dramatic boiling. Immediately give the rice and stock a big stir, then lower the heat to medium so the contents simmer and cover the pot. Put your ear by the pot and you will hear gentle bubbling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>During the next 5 minutes, encourage the grains to absorb the stock and cook evenly. To do this, periodically remove the lid, give the rice a big, quick stir, and then replace the lid. I typically stir the rice 3 times, usually about 30 seconds after the steam plumes begin shooting from under the lid. The rice will first swim in stock and then progressively become less easy to move. Small craters will form on the surface, too. When you stir the third time, the rice should stick a bit to the pan and most of the stock will have been absorbed. (If it has not reached this point, continue cooking for a minute or so and check again.) At this point, level the rice and turn the heat to low. Cover and cook for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover and add the vegetables and chicken and any juices from the skillet, distributing them evenly over the rice. Replace the lid and continue cooking for 10 minutes longer. Uncover and stir the contents, scraping the bottom to combine all the ingredients. Replace the lid, remove from the heat, and let the rice sit for 10 minutes to allow the flavors to meld.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fluff the rice with chopsticks or a fork and then spoon it into 1 or 2 serving bowls or platters. If a little crust has formed on the bottom of the pot, scoop it out and serve the shards separately for anyone who enjoys their crisp, nutty taste.</p>"}]}