{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090925-dumplings-thumb.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["Andrea Nguyen", "Asian", "dumplings", "lamb", "Seriously Asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: All About Dumplings", "link": "https://www.seriouseats.com/recipes/2009/09/lamb-dumplings-recipe-asian-cooking.html", "description": "\"There's a difference between the pleasantly doughy boiled dumpling and the chewier, semi-translucent steamed dumpling.\" I may be from Shanghai, but I think I make some pretty mean dumplings for a Southern gal. From buns, bread, and noodles, the Northern...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Lamb"], "recipeIngredient": ["2 pounds ground lamb, or a combination of lamb and fatty pork", "1 egg", "1 medium onion or one leek, washed ", "1 bunch green onions, washed and finely chopped ", "A few leaves of washed napa cabbage or bok choy, optional", "1 to 2 teaspoons Shaoxing rice wine ", "1 teaspoon vegetable or canola oil", "1 teaspoon salt, or to taste", "1 teaspoon garam masala, or to taste", "1/2 teaspoon cumin, or to taste", "2 cups All Purpose Flour, plus additional for sprinkling", "3/4 cups boiling water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the vegetables:  For onions, halve the onion and parboil it in boiling water for one to two minutes, until the layers of the onion have just turned translucent but are not soggy.  Let cool; then finely chop.  For leeks, separate into two sections - the white, tenderer section and the upper green, tougher section.  For the green sections, parboil for one minute and then finely chop.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a few leaves of Napa cabbage or bok choy for additional moisture. To prepare, parboil for thirty seconds to one minute, until the vegetables are slightly softened but not yet translucent.  Finely chop.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all of the ingredients in a large bowl, mixing thoroughly with your hands or a wooden spoon.  Let the filling rest for thirty minutes before using to fully allow the meat to develop its flavors.  The filling may also be kept in the refrigerator for up to 24 hours, or frozen indefinitely.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the dumplings: divide the dough into four or five sections to prevent the unused portions from drying out.  Cover the unused portions with a wet tea towel.  With your palms, roll each section into a cylindrical shape, and cut into sections approximately ½ inch thick and 1 inch in diameter.  Flatten each section with your palm, pushing it into a broad circle.  With your rolling pin, roll into a circle approximately 2.5 to 3 inches in diameter, tapering the edges to be thinner than the center of the circle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place approximately 1 tablespoon of filling into the center of each wrapper.  Gather the wrapper together by pinching the two sides together, making pleats on just one side of the wrapper in the same direction, until you have enclosed the filling entirely.  Sprinkle a board or plate with flour.  Place finished dumplings on the plate or board and cover with a moist tea towel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam the dumplings for 7 to 9 minutes over medium-high heat, until the skins are semi-translucent.  If boiling, bring a large pot of water to a vigorous boil and cook for 5 to 8 minutes, until the skins have just turned opaque.  Serve immediately with vinegar and chili-paste on the side.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Dumpling Dough</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes approximately 40 dumplings -</em> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small>Adapted from <em><a href=\"http://www.amazon.com/dp/1580089755/?tag=serieats-20\">Asian Dumplings</a></em> by Andrea Nguyen.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure out the flour and set aside in a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to boil in a medium-sized pot.  When the water is boiling, immediately add all of the flour to the pot and stir vigorously with chopsticks or a wooden spoon.  Within twenty seconds, the flour and water will begin to form into a shaggy mass.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the flour has been evenly moistened by the water, turn onto a floured board and begin kneading.  With the back of your hand, knead vigorously for five to seven minutes until the dough is supple and elastic.  It should not take much effort (no more than two minutes) to gather the wet mess into a cohesive dough.  If needed, sprinkle in some extra water.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let rest for 30 minutes before use.  Wrapped tightly in plastic wrap, the dough can also be kept in the refrigerator for up to 24 hours.  </p>"}]}