{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091222-nasty-bits-rabbit-200px.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["chanterelles", "chicken liver", "eggs", "liver", "offal", "omelets", "The Nasty Bits", "truffle oil"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits:  Chicken Liver Omelet", "link": "https://www.seriouseats.com/recipes/2009/12/the-nasty-bits-chicken-liver-omelet.html", "description": "[Photographs: Chichi Wang] Gimme More! Rabbit and Garlic Soup &#187; Frankenstein's Frog, Stir-Fried &#187; All Nasty Bits coverage &#187; Eaters who revel in other types of offal simply don't like liver. Liver prejudices abound for good reason: The much-maligned organ,...", "totalTime": "", "recipeYield": "1 to 2", "recipeCategory": ["Chicken", "Mains", "Offal", "Omelettes", "The Nasty Bits"], "recipeIngredient": ["2 chicken livers", "1/2 cup milk", "2 cloves garlic, minced", "2 large fresh chanterelles, chopped", "2 tablespoons unsalted butter", "Salt to taste", "3 tablespoons sherry", "1 tablespoon water", "2 large eggs", "1 teaspoon truffle oil, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the livers in the milk for at least 30 minutes, preferably a few hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the livers, discarding the milk.  Remove any tough connective tissues with scissors or a small knife.  Briefly rinse the livers under cold water; pat dry with paper towels.  Slice each liver into 2 or 3 sections, approximately 1 inch in length.         </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow skillet, heat one tablespoon of butter; when the butter foam begins to ebb, add the mushrooms.  Stir the mushrooms around the pan briefly; sauté for a few minutes until brown.  When the mushrooms are almost done, add the garlic and stir to mix.  Season to taste with salt and remove from the heat, placing the mushrooms in a bowl.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat another tablespoon of the butter in the same skillet until very hot but not smoking.  Add all of the sections of liver and sauté, stirring occasionally until the surface of the liver is browned but the interior is still pink, about 1 minute.  Quickly remove from the heat and place in the bowl with the mushrooms.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sherry and water to the pan.  Deglaze the pan with a wooden spoon, scraping up the bits of liver that are stuck to the pan.  Bring the liquid to a boil and reduce by half.  Pour the liquid over the livers and mushrooms and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, beat the eggs briefly.  Add the truffle oil and grate the nutmeg over the bowl.  Add salt and pepper to taste.  Add the liver and mushrooms to the bowl.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a medium-sized, heavy skillet over high heat.  Add a tablespoon of butter, swirling the pan to distribute the butter.  Pour in the egg mixture and shake the skillet back and forth.  Cook for one to two minutes, shaking occasionally to prevent sticking.  The bottom of the eggs should be lightly browned, but the top should be barely set.  Remove from the heat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, quickly scatter another nub of butter on top of the eggs.  Fold the omelets in half and slip onto a warm plate.  Garnish with parsley.  Serve immediately.</p>"}]}