{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20080528-new-potato-and-summer-squash-salad.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["fall recipes", "grilled potato", "grilling", "new potatoes", "potatoes", "salads", "summer squash", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: New Potato and Summer Squash Salad", "link": "https://www.seriouseats.com/recipes/2009/05/grilling-grilled-new-potato-summer-squash-salad-recipe.html", "description": "Grilling potatoes is no easy feat. Larger potatoes I sometimes will boil first to avoid charring the outside while waiting for the middle to cook, and the smaller, new potatoes I'll cook over a two zone fire, browning them over...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Grilling", "Potato Salad", "Salads", "Sides", "Vegetarian"], "recipeIngredient": ["10 medium-size new potatoes, unpeeled and quartered", "3 to 4 small yellow summer pattypan squash, cut in half", "1 bunch of green onions or spring onions", "A big splash of olive oil", "2 lemons, cut in half", "1/4 cup rice vinegar", "1/4 cup olive oil", "Clove of garlic, mashed and chopped", "A couple drops of toasted sesame oil", "Salt", "Half a head of red leaf lettuce, washed and cut into bite-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a chimney 3/4 full of charcoal.  While the fire is lighting toss the potato halves, squash, and green onions with a bit of olive oil and a pinch of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the rice vinegar, olive oil, garlic, sesame oil, and a couple pinches of salt in a small bowl.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When charcoal is fully lit and covered in gray ash, pour coals out and arrange them on one side of the charcoal grate, keeping the other side empty.  Clean and oil the cooking grate.  Place potato halves, squash, green onions, and lemons, cut side down, directly over the fire.  Move and flip vegetables for even browning.  When potatoes are browned on all sides, move to the cooler side of the grill.  When squash, green onions, and lemons have browned, remove to a platter.  Continue to grill potatoes, covered, until cooked through.  Remove potatoes to the platter with the other vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the lettuce with a splash of the dressing, and turn it out onto a large platter. Now toss the vegetables (but not the lemons) with a big splash of the dressing and arrange it on top of the lettuce sprinkled with the reserved grilled green onion segments. Garnish with the lemon and serve.</p>"}]}