{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090326caldoverde.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["cabbage", "chorizo", "potatoes", "soups", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Caldo Verde", "link": "https://www.seriouseats.com/recipes/2009/03/caldo-verde-recipe.html", "description": "Caldo Verde is somewhat similar to a soup I made awhile back called Caldo Gallego. Both hail from similar parts of Europe and are decidedly inexpensive, peasants soups. Both feature dried chorizo prominently, which leaks its richly red oil into...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Dinner Tonight"], "recipeIngredient": ["1 tablespoon olive oil, plus more for drizzling", "1 onion, peeled and chopped", "1 carrot, peeled and chopped", "1 stick celery, chopped", "2 cloves of garlic, peeled and finely chopped", "Salt and freshly ground pepper", "2 large floury potatoes, peeled and cut into cubes", "Half a medium green cabbage (about 1 pound), cored and sliced very thinly", "4 to 6 thick pieces of dried chorizo sausage"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot or saucepan, heat the olive oil over medium heat.  Add the onion, carrot, and celery, along with a pinch of salt.  Cover and cook, stirring occasionally, until the vegetables are soft.  Add the potatoes along with 5 cups of water.  Bring to a boil, then simmer until the potatoes are tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the soup to blender to puree, or use a stick blender or a food mill.  Add the cabbage to the soup and simmer until tender.  Taste for seasoning.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle into bowls, top with sliced chorizo and a drizzle of olive oil, and serve.</p>"}]}