{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091111cakespysweetpotato.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["holiday baking", "pies", "sweet potatoes", "tarts", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Sweet Potato Tarte Tatin", "link": "https://www.seriouseats.com/recipes/2009/11/cakespy-sweet-potato-tarte-tatin-recipe.html", "description": "It starts with delicately slivered sweet potatoes&mdash;just enough to provide flavor without becoming a starchy bulk&mdash;then pairs them with a thick, rich caramel sauce and buttery puff pastry, all of which is combined, baked upside down, then flipped post-baking for a sophisticated and (especially when topped with a generous scoop of vanilla ice cream) supremely satisfying dessert.", "totalTime": "", "recipeYield": "about 6", "recipeCategory": ["Cakespy", "Potato", "Sweet Potatoes and Yams"], "recipeIngredient": ["1 sheet all-butter store-bought puff pastry, thawed", "3/4 cup brown sugar, firmly packed, plus 1 tablespoon for pastry (the original recipe calls for white sugar, so you could use either)", "1 stick unsalted butter, cut into 16 pieces", "2 teaspoons vanilla extract", "1⁄8 teaspoon salt", "11⁄2 pounds sweet potatoes (try to buy potatoes of relatively even width and few bulges), peeled, ends removed, and sliced into 1/8-inch thick rounds", "1 large egg", "1 tablespoon milk", "Ice cream and nuts for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 375&deg;F. Line a baking sheet with parchment paper. Place the puff pastry sheet on your work surface and cut out a 10-inch circle (I did this by placing a 10-inch plate on top and cutting around it). Set the circle onto the prepared baking sheet. Prick the pastry all over with a fork and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 3/4 cup of brown sugar in a small saucepan and cover with 1/4 cup of water. Gently stir with a spoon to make sure all of the sugar is wet (it should have the consistency of wet sand), place a cover on slightly askew, and bring to a boil over medium-high heat. Keep the mixture covered until the syrup is clear and producing syrupy-looking medium-size bubbles, 3 to 4 minutes. Remove the cover and continue to cook until the sugar is a light butterscotch color (darker if you're using brown sugar) and its temperature reaches 320&deg;F. Turn off the heat (the sugar will continue to cook in the pan even though the heat is off). Once the temperature reaches 350&deg;F (this will take only a few minutes), whisk in the butter, one piece at a time, waiting until each addition is completely incorporated before adding the next. Stir in the vanilla and the salt, and pour the caramel into a 10-inch cast iron skillet (if you don't have a cast iron skillet, you can pour it into a pie plate; you might need to bake it for a few minutes longer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the caramel with the sliced potatoes, starting in the center and overlapping in a spiraling outward circle as you go. Top with the puff pastry circle. Beat the egg and the milk together and brush over the pastry, and then sprinkle with the remaining 1 tablespoon of sugar. Bake until the edges are deep amber and the pastry is puffed and golden, 40 to 45 minutes. Remove from the oven and cool for 10 minutes before inverting onto a large plate (make sure the diameter of the plate is larger than 10 inches!). Slice into wedges and serve with or without ice cream and whatever other garnish you'd like (pecans or almonds work very nicely).</p>"}]}