{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091130theartansoulofbaking.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Mexican", "keywords": ["A Cookie a Day 2009", "chocolate", "Cindy Mushet", "Cookies", "holiday baking", "Mexican", "The Art and Soul of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mexican Chocolate Crackle Cookies", "link": "https://www.seriouseats.com/recipes/2009/12/draftcook-the-book-mexican-chocolate-crackle.html", "description": "As I was putting together the dough for these <strong>Mexican Chocolate Crackle Cookies</strong> there was no doubt in my mind that they were going to be incredible.  You can't go wrong with the combination of chocolate, cinnamon, coffee, almonds, and a touch of chile. <strong>It's like a mole cookie.</strong>", "totalTime": null, "recipeYield": "about 45 cookies", "recipeCategory": ["Chocolate", "Cook the Book", "Cookies", "Desserts", "Mexican"], "recipeIngredient": ["3 tablespoons (1 1/2 ounces) unsalted butter, cut into 1/2-inch pieces ", "1 tablespoon coffee liqueur or cooled brewed coffee ", "6 ounces 70 percent cacao bittersweet chocolate, finely chopped ", "2 large eggs ", "1/2 cup (3 1/2 ounces) plus 1/2 cup (3 1/2 ounces) granulated sugar ", "3/4 cup (3 3/4 ounces) unbleached all-purpose flour ", "1/2 cup (3 ounces) whole almonds, toasted and cooled completely ", "3/4 teaspoon ground cinnamon ", "1/2 teaspoon baking powder ", "1/4 teaspoon ancho chile powder (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 inches of water to a boil in the bottom of the double boiler. Place the butter, liqueur, and chocolate in the top of the double boiler (off the heat). Turn off the heat, then set the chocolate over the steaming water. Stir occasionally with the spatula until the chocolate is melted and the mixture is smooth. Remove and let cool slightly while you whip the eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the eggs and 1/2 cup of the granulated sugar in the bowl of the mixer and whip on high speed until very light in color and thick, 5 to 6 minutes. You can also use a hand mixer and a medium bowl, though you may need to beat the mixture a little longer to achieve the same results. Scrape the melted chocolate mixture into the eggs and whip until blended, about 1 minute. Scrape down the sides of the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour, nuts, cinnamon, baking powder, and chile powder (if using) in the food processor and process until the nuts are very finely chopped, 60 to 90 seconds. Add the flour mixture to the egg mixture and beat on low speed just until combined. Stir gently a few times with the spatula to make sure there are no patches of unincorporated flour or butter lurking near the bottom of the bowl. Cover the dough with plastic and refrigerate for 1 to 2 hours, until firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F and position an oven rack in the center. Line the baking sheets with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the chilled dough into tablespoon-size balls using the ice cream scoop or a spoon. Place the remaining 1/2 cup of granulated sugar in one small bowl and the confectioners' sugar in the other. Roll each dough ball in the granulated sugar and then in the confectioners' sugar. Be sure to coat the dough generously with the confectioners' sugar&mdash;in this instance, more is better. Space the cookies about 1 1/2 inches apart on the prepared baking sheets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies one sheet at a time, rotating the sheet halfway through the baking time, for 11 to 14 minutes, until the cookies are puffed and cracked. If you nudge a cookie, it should slide on the sheet rather than stick. It is better to slightly underbake these cookies than to go too far--when overbaked they are dry and unpalatable. Transfer to a cooling rack and let cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Storing tips:These cookies are best the same day they are baked. Any leftovers can be stored in an airtight container at room temperature for 3 to 4 days.</strong>  </small></p>"}]}