{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "Kosher", "keywords": ["Arthur Schwartz", "brisket", "Jewish", "meat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pot-Roasted Brisket", "link": "https://www.seriouseats.com/recipes/2009/09/arthur-schwartzs-pot-roasted-brisket-rosh-hashanah-recipe.html", "description": "Published with permission from Arthur Schwartz....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Kosher", "Mains", "Rosh Hashanah"], "recipeIngredient": ["2 very large cloves garlic, finely chopped", "1 8 to 10-pound brisket\t  \t ", "1 1/2 teaspoons coarse sea salt\t ", "1/2 teaspoon freshly ground black pepper\t", "4 pounds onions, halved and sliced\t  \t ", "3 medium carrots, sliced into 1/4-inch thick rounds\t  \t ", "2 large, outside ribs celery, sliced 1/4-inch thick\t  \t ", "4 small bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub 1 chopped clove of garlic into each side of the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Salt and pepper the meat on both sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the onions, carrots and celery on the bottom of the pan. Put the meat over the vegetables. Put 2 bay leaves under the meat, 2 on top of the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan tightly with aluminum foil and cook in a preheated 350°F oven for 4 hours, until meat is just tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let meat rest 20 minutes, then slice: Cut the second cut off of the first cut and trim off and discard the layer of fat between them. Slice both cuts across the grain, either straight down or at a slight diagonal angle. Skim any fat off the juices left in the pan, and serve the onions and vegetables with the juices as a sauce for both the meat and any starch accompaniment. If desired, you can puree some of the vegetables to make a thicker sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If preparing ahead for serving another day, refrigerate until several hours before serving time. Skim hardened fat off the surface of the liquid that has collected around the meat, and off the surface of the meat. Allow the meat to come to room temperature before final heating.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About an hour before serving, using a long-bladed, preferably serrated knife (I use a bread knife), slice the meat about 1/4-inch thick. It will require a sawing motion and a strong arm. Do not disturb the conformation of the meat. Return the meat to the roasting pan as if it was still a whole brisket.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Baste with pan juices and heat, uncovered, for 45 minutes to 1 hour, basting a few times during that period. The surface of the meat should have browned nicely, and the slices of meat should be heated through and fork tender. Trim excess fat off the meat on the plate, as it is eaten.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serving suggestion: Serve with kasha (buckwheat groats): Follow the directions on the back of the box, and top each helping with onions and juices from the pot roast. Or prepare kasha varnishkes: cooked buckwheat groats tossed with bow-tie macaroni and flavored with sauteed onions. Or serve with mashed potatoes flavored with schmaltz (chicken fat) and, if available, gribenes (the cracklings and blackened onions left from rendering the chicken fat), also topped with pan juices and onions. A green vegetable is up to you. </p>"}]}