{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090226-dt-salad-thumb.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["blue cheese", "Dinner Tonight", "figs", "prosciutto", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Warm Prosciutto, Fig, and Blue Cheese Salad", "link": "https://www.seriouseats.com/recipes/2009/02/dinner-tonight-warm-prosciutto-fig-and-blue-cheese-salad-recipe.html", "description": "Prosciutto, figs, and blue cheese&mdash;after eating them together, I'm almost ready to declare them a platonic pairing. Maybe not quite deserving our respect for, say, basil with tomato, but remarkable nonetheless. Salty and meaty prosciutto sets the savory tone, then...", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Cheese", "Dinner Tonight", "Salads"], "recipeIngredient": ["6 thin slices prosciutto, roughly chopped", "2 figs", "2 ounces (two large handfuls) mesclun salad mix", "1 1/2 ounces blue cheese", "1/4 cup plus 2 tablespoons olive oil", "2 tablespoons sherry or other vinegar", "Freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the top and bottom of the figs, then quarter them lengthwise. Cut into medium chunks. In a large serving bowl, add the vinegar.  Dribble in a little olive oil, whisking constantly and vigorously to create an emulsion.  Continue adding the vinegar in a slow stream, whisking constantly until all but the remaining two tablespoons are added.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining olive oil in a non-stick skillet over medium heat. Add the prosciutto and crisp in the oil, stirring often, about 1 minute. Add the figs and toss well, then continue cooking for an additional minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Judge how much dressing is in the bowl compared to how much salad you have, pouring some away if necessary since it can always be added back in. Add the salad to the serving bowl and toss well. Add the contents of the skillet and toss again. Serve immediately with the blue cheese crumbled on top and freshly ground black pepper.</p>"}]}