{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090122-baconsandwichcookies-thumb.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["Cookies", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bacon-Oatmeal Cookie Sandwiches: A Lunchbox Favorite with a Twist", "link": "https://www.seriouseats.com/recipes/2009/01/bacon-oatmeal-cookie-sandwiches-recipe.html", "description": "A while back, I got it in my head to run a dessert special featuring a chewy, cream-filled oatmeal cookie sandwich, the likes of which you might remember, individually wrapped in cellophane, nestled in your elementary school lunchbox. Considering the...", "totalTime": "", "recipeYield": "25-30 sandwiches, 4-5 dozen cookies", "recipeCategory": ["Bacon", "Desserts", "Pork"], "recipeIngredient": ["1 cup, plus 2 tablespoons bacon fat, room temperature<a href=\"#note1\">*</a> (224 grams)", "1 1/2 cups sugar (300 grams)", "2 large eggs", "1 teaspoon vanilla extract", "4 1/2 teaspoons molasses (30 grams)", "4 1/2 teaspoons honey (30 grams)", "1 1/2 cups all-purpose flour (180 grams)", "1 teaspoon baking soda", "1/2 teaspoon salt", "3 cups quick oats<a href=\"#note2\">**</a> (240 grams)", "1 1/2 cups bacon bits* (~85 grams) ", "1 cup raisins, chocolate chips or walnut pieces – optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325&deg;F. With a hand held or stand mixer, cream fat with sugar until creamy and light. (N.B.:You will not be able to achieve the same level of fluffiness in this step with bacon fat as you would with a recipe using butter or shortening. Trying to do so will result in frustration and, possibly, a greasy, over-worked&mdash;e.g. melted&mdash;mess.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add eggs one at a time, beating well after each addition.  Add vanilla, molasses and honey, and beat to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, combine the flour, baking soda and salt, and whisk to incorporate.  Add this mixture to the butter mixture and beat to incorporate.  Scrape down the sides and bottom of the bowl, and beat briefly to insure that mixture is homogeneous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the oats, bacon bits and raisins, chocolate chips or walnuts, if using.  Mix until well distributed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop dough by the heaping tablespoonful onto parchment- or Silpat-lined baking trays, leaving 1 1/2 or 2 inches between cookies.  Bake for 10-12 minutes, rotating tray once during baking.  Cool cookies completely before filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"note1\"></a>* It takes about a pound of bacon, give or take, to acquire the prescribed quantities of fat and bits.  Cut the bacon into small pieces and cook over low heat, allowing plenty of time for the fat to render out before the pieces color too much.  Pour bacon into a fine mesh sieve set over a heat-proof bowl.  Once the fat has drained into the bowl, set aside and allow to cool to room temperature.  Turn bacon bits out onto paper towels.  Bits and fat can be stored in the refrigerator for up to a week before use, just be sure to bring the fat to room temperature before making the cookie dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"note2\"></a>** You can use the same quantity of old-fashioned oats in this recipe, but I’ve found that the cookies have a little more structure, a slightly nicer texture and bake into more attractive&mdash;less lumpy and irregular&mdash;circles with the quick oats.</p>"}]}