{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090212-borscht-thumb.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beets", "borscht", "Dinner Tonight", "low carb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Dinner Tonight: Vegetarian Borscht", "link": "https://www.seriouseats.com/recipes/2009/02/dinner-tonight-vegetarian-borscht-recipe.html", "description": "Who's ready for another cheap soup recipe?  This one is as economical and simple as they come, is ready in minutes, and is far richer and warming than it has any credit being.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Dinner Tonight", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["1 pound beets (beetroot), peeled and cut into matchsticks", "2 medium onions, sliced into half-moons", "2 large carrots, peeled and cut into matchsticks", "3/4 pound white cabbage, cut thinly into shreds", "2 tablespoons olive oil", "5 cups vegetable stock", "Juice of 1/2 a lemon", "Salt to taste", "Coarsely ground black pepper", "Sour cream (optional, omit for vegan soup)", "Finely chopped parsley or chives (optional, for garnish)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and cut the onions, carrots, and beets (alternatively, shred the carrots and beets using the shredding blade of a food processor) and saut&eacute; over medium heat in the olive oil with a pinch of salt in a large soup pot.  Reserve a small amount of beet to grate and add near the end to enliven the color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring the vegetable stock to a boil.  When the vegetables are soft (about 5 minutes), add the shredded cabbage and the hot stock.  Bring to a boil and simmer 15-25 minutes, until the vegetables are tender. With a few minutes left, add the reserved grated beet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season to taste with salt and pepper, then squeeze in the lemon juice, aiming for a pleasing but subtle sour taste.  Serve with freshly grated black pepper, a dollop of sour cream, and chopped parsley, if desired.</p>"}]}