{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baking", "Cook the Book", "desserts", "Karen DeMasco", "pudding", "rice", "rice pudding", "The Craft of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Jasmine Rice Pudding", "link": "https://www.seriouseats.com/recipes/2009/10/jasmine-rice-pudding-recipe.html", "description": "\"Karen DeMasco has come up with a rice pudding that surpasses the cafeteria tray by leaps and bounds.\" Rice pudding is mostly served in places where dessert is more of an afterthought than the main event. It's the go-to dessert...", "totalTime": null, "recipeYield": "5", "recipeCategory": ["Desserts", "Rice"], "recipeIngredient": ["1/2 cup jasmine rice", "2 cinnamon sticks, broken", "Zest from 1/2 lemon, removed in strips with a vegetable peeler", "2 cups whole milk", "1/2 cup sugar", "1 teaspoon kosher salt", "1/2 cup crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the rice, cinnamon sticks, and lemon zest.  Set the pan over medium-low heat and cook, stirring occasionally, until the rice has a nutty fragrance, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 cup water, increase the heat to medium, and cook, stirring occasionally, until most of the water has been absorbed, about 4 minutes.  Add 1 cup of the milk  and cook, stirring occasionally, until the rice kernels are visible and most of the milk has been absorbed, about 6 minutes.  Add the remaining 1 cup of milk and cook until the kernels are visible again and most of the milk has been absorbed, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the sugar and salt, and continue cooking until the liquid is mostly absorbed, about 3 minutes.  Remove the pan from the heat and stir in the crème fraîche.  Serve immediately, or chill over an ice bath and then refrigerate, covered, for up to 2 days.  (The lemon zest and cinnamon sticks will continue to impart flavor.  Remove just before serving.)  Serve the rice pudding chilled, or reheat it gently in a saucepan, adding more milk if necessary to adjust the consistency.</p>"}]}