{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090209-cake2.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["almonds", "cakes", "desserts", "Italian", "Seriously Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Seriously Italian: Almond Olive Oil Cake for Valentine's Day", "link": "https://www.seriouseats.com/recipes/2009/02/almond-olive-oil-cake-recipe-torta-di-mandorla-italian-desserts.html", "description": "Chocolate on Valentine's Day seems like too obvious a choice. Can we give some love to the almond instead? The nut's flavor profile teases, going from subtle and sweet when raw to deep, warm and toasty when baked.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts", "Italian", "Nuts"], "recipeIngredient": ["1 cup all-purpose flour", "1/2 cup blanched or natural almond flour", "1 1/2 teaspoons baking powder", "1 teaspoon kosher salt", " 3 large eggs", "3/4 cup granulated sugar", "1/2 cup plus 1 tablespoon extra-virgin olive oil", " 1/2 teaspoon pure vanilla extract", " 1/4 teaspoon pure almond extract", " ", "Grated zest of 1 medium lemon or 1/4 a medium orange", "1/2 cup orange juice", " ", "<strong>For Glaze: </strong>", "2 tablespoons unsalted butter", "1 cup confectioner's sugar", "3 tablespoons whole milk", "A few drops of fresh lemon juice", " ", "1/2 cup sliced, blanched almonds, toasted and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.  Grease and flour a 9-inch round cake pan or springform pan and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the flour, almond flour, baking powder and salt to thoroughly combine them and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a large mixing bowl and whisk them lightly to break up the yolks.  Add the sugar to the bowl and whisk it in thoroughly in both directions for about 30 seconds.  Add the olive oil and whisk until the mixture is a bit lighter in color and has thickened slightly, about 45 seconds.  Whisk in the extracts and zest, followed by the orange juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the dry ingredients to the bowl and whisk until they are thoroughly combined; continue whisking until you have a smooth, emulsified batter, about 30 more seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan, and bake the cake for 30 to 45 minutes, rotating the cake pan halfway through the cooking time to ensure even browning.  The cake is done when it has begun to pull away from the sides of the pan, springs back lightly when touched, and a cake tester inserted in the center comes out clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the cake to cool for ten minutes in the pan, then gently remove it from the pan and allow it cool completely on a rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cake cools, make the glaze.  Melt the butter over medium heat in a small, heavy saucepan.  When the bubbles subside, lower the heat and watch the butter carefully, swirling it in the pan occasionally to distribute the heat.  When the butter begins to turn a light tan color and smells slightly nutty, turn off the heat and let the butter sit.  It will continue to darken as it sits. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the butter cools, sift the confectioner's sugar into a medium bowl. Whisk in the milk until completely smooth but thick, then slowly whisk in the butter.  Taste the glaze and add a few drops of lemon juice to balance the sweetness. Stir in the toasted almonds.  Spread the almonds and glaze onto the top and sides of the cake and let it sit until set and dry. </p>"}]}