{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["appetizer", "asparagus", "brunch", "eggs", "frittata", "smoked salmon", "Tom Valenti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Asparagus and Smoked Salmon Frittata", "link": "https://www.seriouseats.com/recipes/2009/06/sunday-brunch-asparagus-and-smoked-salmon-fri.html", "description": "Springtime is asparagus time in most parts of the world, so it's a perfect moment to make an asparagus and smoked salmon frittata recipe, which I've adapted from Tom Valenti's terrific new cookbook, You Don't Have to Be Diabetic To...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Asparagus", "Breakfast and Brunch", "Eggs"], "recipeIngredient": ["8 spears pencil-thin asparagus (about 1/2 pound, ends trimmed)", "1 teaspoon olive oil", "3 large eggs plus 3 large whites", "Pinch of coarse sea salt or kosher salt", "Pinch of freshly ground pepper", "2 ounces very thinly sliced smoked salmon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Fill a large bowl halfway with ice water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the asparagus in the boiling water until tender, about 1 minute. Use tongs to remove the asparagus from the pot and transfer it to the ice water to stop the cooking and preserve the color. Once the asparagus has cooled, drain it and pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a 12-inch, ovenproof, heavy-bottomed, nonstick pan over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the eggs, egg whites, and 3 tablespoons of water in a large bowl, add the salt and pepper, and whisk together. Pour the egg mixture into the pan and cook until the eggs begin to set up, about 3 minutes. Arrange the asparagus spears in the pan like the spokes of a wheel; they should sink about halfway into the eggs, resting on the cooked bottom of the frittata. Transfer the pan to the oven and bake the frittata until the eggs are completely set, about 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and drape the slices of salmon over the frittata in a single layer; this will warm the salmon just enough to meld the flavors of the fish and the frittata. Use a rubber spatula to carefully slide the frittata out onto a large plate or platter. Using a serrated knife, cut the frittata into 8 wedges, making sure to include an asparagus spear in each wedge, and serve. </p>"}]}