{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091222-dt-shallow-poached-salmon.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Alice Waters", "fish", "poach", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Shallow-Poached Salmon", "link": "https://www.seriouseats.com/recipes/2009/12/dinner-tonight-shallow-poached-salmon-fillets-recipe.html", "description": "[Photograph: Blake Royer] I had a beautiful piece of salmon, and I didn't want to mess it up. I was looking for a simple technique that would let the flavor of the salmon remain prominent and leave it tender and...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Mains", "Poaching", "Salmon"], "recipeIngredient": ["4 five-ounce salmon fillets (or equivalent weight in salmon steaks)", "1/4 cup dry white wine", "2 sprigs parsley", "2 sprigs thyme (or substitute another herb such as fennel, basil, tarragon, chervil, or marjoram)", "4 tablespoons butter", "Salt and pepper to taste", "Lemon juice to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the salmon pieces with salt and set aside.  Choose a heavy pan just large enough to fit the salmon snugly in one layer and add the wine, herbs, and just enough water to come halfway up the salmon pieces (but do not add them yet).  Season with a good pinch of salt and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once boiling, immediately turn the heat to very low so it's barely simmering.  Add the fish pieces and cook for 3 1/2 minutes (add an extra minute or two if using steaks), then carefully turn the pieces over and cook for 3 minutes more to finish.  Ensure that the water never gets hot enough to boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the fish pieces to a warm plate then turn the heat to high to reduce the liquid by half.  Whisk in the butter and season to taste with salt and lemon juice, if necessary.  Pour the sauce over the fish and garnish with a little chopped parsley.</p>"}]}