{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090108wiltedgreenscannelinibeans.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Alice Waters", "beans", "Chez Panisse", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Cannellini Beans with Wilted Greens", "link": "https://www.seriouseats.com/recipes/2009/01/cannelini-beans-with-wilted-greens-recipe-chez-panisse.html", "description": "I received a copy of Chez Panisse Vegetables for Christmas and I can already feel it: this will be a book I'll return to again and again. There's something honest about a vegetables-focused cookbook with sections divided into: carrots, artichokes,...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Vegetarian"], "recipeIngredient": ["3 14-oz cans cannellini beans, drained and rinsed", "3 cups chicken stock or water", "1 large bunch hearty greens, such as kale, chard, or mustard greens", "6 cloves garlic", "6 tablespoons olive oil, plus more for drizzling", "1 tablespoon chopped fresh rosemary", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the stock or water to boil and add the drained and rinsed beans.  Simmer until the beans are soft and creamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, wash and roughly chop the greens.  In a very large skillet or pot large enough to hold all the beans, heat the olive oil over medium heat and saute the garlic and rosemary with a good pinch of salt until the garlic softens, about 2 minutes.  Add the beans and at least 1 cup of the remaining cooking stock or water cooking liquid.  Reserve the rest to moisten the dish if needed.  If desired, smash some of the beans to thicken the dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chopped greens and stew with the beans until tender and wilted, mixing them into the dish.  Add more bean liquid or fresh water as needed to keep it moist. Aim for a soupy consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust for seasoning, (I went with loads of black pepper and a few more pinches of salt), then serve with a drizzle of olive oil and more fresh black pepper.</p>"}]}