{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090428-mark-miller-tacos.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Mexican", "keywords": ["Asian", "Cook the Book", "fish", "Mark Miller", "Mexican", "slaws", "spicy", "taco", "tacos", "Tacos by Mark Miller", "tempura"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Baja-Style Tempura Fish Tacos", "link": "https://www.seriouseats.com/recipes/2009/04/baja-style-tempura-fish-tacos-recipe.html", "description": "Fish tacos from Pinche Taqueria. Fish tacos are sold all over the southwest coast of California. San Diego even has a fast food chain entirely devoted to them. One of the best tacos I've ever eaten was made in a...", "totalTime": "", "recipeYield": "10 tacos", "recipeCategory": ["Cook the Book", "Fish", "Mexican"], "recipeIngredient": ["<strong>Chile-Lime Marinade</strong>", "1 1/2 cups water", "1/2 cup fresh lime juice", "10 cloves garlic, sliced", "2 serrano chiles, seeded and stemmed", "2 teaspoons Mexican oregano, ground", "1 tablespoon fine sea salt", "2 pounds young shark fillet, cut into 4 by 3/4 inch strips", "<strong>Baja Tempura Batter</strong>", "3/4 cup plus 1 tablespoon ice water", "2 1/2 teaspoons yellow mustard (optional)", "1 cup bleached all-purpose flour", "Vegetable oil for deep-frying", "10 (5 1/2-inch) soft white corn tortillas, for serving", "<strong>Garnish</strong>", "Baja Cabbage Slaw (recipe follows)", "Lime wedges", "Pickled jalapeno slices.", "1/2 head small (5-inch diameter) green cabbage", "2 tablespoons regular mayonnaise (not light)", "3/4 teaspoons fresh lime juice", "2 drops jalapeno Tabasco sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make marinade, in a large bowl, combine 1 1/2 cups water, lime juice, garlic, chiles, oregano, and salt.  Add the fish strips and let marinate for at least 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the shark pieces and pat them dry with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have a plate lined with paper towels ready.  In a large, heavy-bottomed pot, heat at least 2 to 3 inches of oil over medium heat until it reaches 360&deg F on a deep-fat thermometer.  Remove the batter from the refrigerator and stir once more.  Dredge the fish pieces in the batter, a few at a time, to evenly coat.  Drop them in the hot fat, 2 pieces at a time, adding 2 more pieces every 30 seconds (fry no more than 4 pieces at a time).  Monitor the temperature of the hot oil throughout frying, letting the oil return to proper temperature, if necessary, between batches; to ensure crispness, it must remain a constant 360&deg F to 380&deg F.  If too low, the fish will be oily; if to high, the pieces will burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry them until crisp, light golden brown, and floating in the oil, about 2 1/2 minutes per batch.  With a fine-mesh skimmer, transfer the fish tempura to the paper-towel lined plate to absorb the excess oil.  Repeat with the remaining pieces of fish.  During the frying, be sure to remove any pieces of floating batter, or they will burn and darken the oil, which will transfer a burned flavor to the tempura.  Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, lay the tortillas side by side, open faced and overlapping on a platter.  Divide the slaw and filling equally between the tortillas and top with salsa and garnish.  Grab, fold, and eat right away.  Or build your own taco: lay tortilla, open face, in one hand.  Spoon on some slaw, then filling, top with salsa, fold, and eat right away.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Baja Cabbage Salw</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 2 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Adapted from</em> Tacos <em>by Mark Miller</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the outer leaves of the cabbage.  Cut a V-shaped wedge around the tough inner core and remove the core and discard.  Halve the cabbage to make 2-quarter sections.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a large, sharp knife, slice each section crosswise into a thin julienne (about 1/8-inch thick) or julienne with a hand-held Japanese mandoline.  Transfer the julienned cabbage in to a large bowl.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, mix together the mayonnaise, lime juice, and Tabasco.  Toss the mayonnaise mixture with the cabbage, refrigerate, and use within a few hours.</p>"}]}