{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091123PumpkinPancettaSoup.JPG", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["holiday recipes", "Meat Life", "pancetta", "pork", "sides", "soups", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Pumpkin Pancetta Soup", "link": "https://www.seriouseats.com/recipes/2009/11/meat-lite-pumpkin-pancetta-soup-recipe.html", "description": "[Photograph: Tara Mataraza Desmond] Even though I've had this Pumpkin Pancetta Soup on my Thanksgiving menu for weeks, and I'm only just getting to it now in the midst of the Great Pumpkin Shortage panic of 2009, I remain undaunted...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Meat Lite", "Pumpkin"], "recipeIngredient": ["6 ounces thinly sliced pancetta", "Two 2 1/2 to 3 pound sugar pie pumpkins", "1 large sweet onion, peeled and cut into large chunks", "4 cloves garlic, peeled", "8 sage leaves", "1 cup water", "Coarse salt and freshly ground black pepper", "1 quart stock (chicken, turkey or vegetable)", "1 tablespoon cider vinegar", "1 cup whole milk", "Sour cream or crème fraiche, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375° F.  Lay the pancetta in one layer on the bottom of a large roasting pan. Transfer the pancetta to the oven and bake until crispy, about 20 minutes. Remove from the oven and set aside. Reserve the roasting pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the pumpkins in half and scrape out the seeds and fibers.  Spread the seeds on a baking sheet covered with a silicone mat or parchment paper, and discard the fibers. Arrange the four pumpkin halves in the large roasting pan. Add the onion chunks in the spaces between the pumpkin and inside the pumpkin core. Put the garlic cloves and sage leaves inside each pumpkin core. Pour the water into the pan around the pumpkins. Season the pumpkins liberally with salt and pepper. Cover the pan tightly with the roasting pan lid or foil and transfer to the oven. Roast for 1 hour and 15 minutes, or until the pumpkin and onions are very tender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pumpkin cooks, add the seeds to another rack in the oven and roast them for 15-20 minutes or until they are crisp and just starting to brown. Set them aside to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the vegetables are tender, let them cool slightly. Scrape the pumpkin pulp away from its shell and add it to a food processor. Process until very smooth. Scrape the puree into a large pot or Dutch oven. Put the onions, garlic, 2 of the sage leaves, and any liquid from the roasting pan in the processor next and process until very smooth. Add the onion pur&eacute;e to the pot with the pumpkin pur&eacute;e, or push it through a mesh strainer into the pumpkin. This is optional, but straining the onion puree makes for an ultra-smooth soup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock and the cider vinegar to the pur&eacute;e in the pot and simmer for about 30 minutes. Reduce the heat and add the milk. Simmer an additional 10 minutes (do not boil) and then add salt and pepper to taste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the soup simmers, re-crisp the pancetta in a hot oven or a convection toaster for about 5 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the soup into mugs or bowls, top with pancetta (whole or crumbled) and a sprinkling of the toasted seeds.  Add a dollop of sour cream or crème fraiche if you like. </p>"}]}