{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091122baked%20eggs.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Baked Eggs", "eggs", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Baked Eggs with Spinach", "link": "https://www.seriouseats.com/recipes/2009/11/sunday-brunch-baked-eggs-with-spinach-recipe.html", "description": "[Photo: Robin Bellinger] Somehow I had never made or even eaten baked eggs until about a month ago. They're a new hit around here, even though I'm pretty sure I'm overcooking them. Sometimes the yolk seems almost like a hard-boiled...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Eggs"], "recipeIngredient": ["2 pounds spinach, fresh (washed and trimmed) or frozen", "3 tablespoons butter or olive oil", "8 eggs", "Salt and pepper", "1/2 cup grated cheese (preferably Parmesan, but cheddar and Gruyere work, too)", "1/2 cup plain bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°. Bring a large pot of water to a boil; salt it. Boil the spinach for about a minute, or until it is bright green and tender. Drain well. When it is cool enough to handle, squeeze the moisture from it and chop. (Here is where I admit that I used frozen spinach and simply let it thaw completely, squeezed it, chopped it up, and sautéed it in some butter before proceeding. I did not want to boil water.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter or oil in a 9x13 inch baking dish and put the dish in the oven. When the butter melts or the oil is hot, toss the spinach in the dish, stirring to coat it with fat. Spread the spinach in the dish and use the back of a spoon to make 8 little nests in the spinach. Crack 1 egg into each. Top with salt, pepper, cheese, and bread crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 to 20 minutes, or until the eggs are just set and the whites solidified. Scoop out some spinach with each egg and serve on toast or toasted English muffins.</p>"}]}