{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090911-sa-thumb.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "bok choy", "garlic", "greens", "oyster sauce", "Seriously Asian", "spinach", "stir frying", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: Stir-Frying Vegetables", "link": "https://www.seriouseats.com/recipes/2009/09/stir-fried-greens-with-garlic-bok-choy-with-oyster-sauce-recipe.html", "description": "Principles of Stir-Fry, Part Four Previously Principles of Stir-Fry, Part One » Principles of Stir-Fry, Part Two » Principles of Stir-Fry, Part Three » All Seriously Asian coverage » My mother has a way of transforming vegetal chaos into order....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chinese", "Garlic", "Spinach", "Stir Frying", "Vegetarian"], "recipeIngredient": ["1 bunch leafy greens, such as water spinach, amaranth, or ong choy", "2 cloves garlic", "A few tablespoons vegetable oil or lard", "1/2 teaspoon salt, or to taste", "A few tablespoons of stock or water, if needed", "1 head bok choy, or 10 small heads of baby bok choy", "1 quart water or stock ", "1 clove garlic", "A few tablespoons vegetable oil or lard", "3 tablespoons oyster sauce", "1/2 teaspoon salt, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash, pick, and sort through the greens.  For tougher stalks, remove some of the sinews by snapping the stalks into one-inch segments, pulling off the tough strands as you go.  Arrange the vegetable matter into three piles as you pick:  the leaf pile, the stalk segments pile, and the unwanted sinews pile.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the leaves, chop coarsely into strips, approximately  inch in width.      </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the wok until smoking.  Swirl in the oil or the lard.  Add the garlic cloves, stirring around for a moment</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stalks and stir-fry for 30 to 40 seconds, until the stalks are almost tender.  Add the chopped leaves and stir-fry until they are wilted and tender, about one minute.  If necessary, splash a bit of water or stock into the wok if the vegetable is not exuding much of its own juices.  Salt to taste.  Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090911-sa-cookbokchoy.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090911-sa-cookbokchoy.jpg\" width=\"500\" height=\"333\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Stir Fried Bok Choy with Oyster Sauce</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash, pick, and sort through the bok choy.  For mature bok choy, separate the stalk portion from the greens, arranging into two piles as you go:  the leaf pile and the stalk pile.  Leave the baby bok choy intact.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the leaves, chop coarsely into strips, approximately one inch in width. Chop the stalks into one-inch long segments, about 1/2 inch thick.  Leave the baby bok choy leaves intact, attached to their stems.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To blanch the bok choy:  Bring the water or stock to boil.  If you are using water, add a teaspoon of salt.  For mature plants, add the stalk segments and blanch for 40 to 60 seconds, until the segments are still opaque and very crisp.  If they have turned translucent, they have been overcooked.  Remove from the water and set aside.  The leafy segments of the mature plant do not need to be blanched.  For baby bok choy, blanch the entire heads for 30 to 40 seconds, until the segments are still opaque and very crisp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the wok until smoking.  Swirl in the oil or the lard, and add the garlic clove, stirring around for a moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For mature bok choy:  Add the stalks and stir-fry for 30 to 40 seconds, until the stalks are almost tender.  Add the chopped leaves and stir-fry until they are wilted and tender, about one minute. (For baby bok choy, add the heads and stir-fry for 40 to 90 seconds, until tender but still crisp.) Swirl in the oyster sauce and stir around, letting the sauce soak into the bok choy for a few seconds. Salt to taste.  Serve immediately. </p>"}]}