{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090901-nastybits-thumb.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["offal", "pigs' tails", "pork", "Ryan Skeen", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Deep-Fried Pig's Tail", "link": "https://www.seriouseats.com/recipes/2009/09/crisp-fried-pigs-tails-recipe.html", "description": "I want to make the case that pigs' tails contain everything desirable in the pig, and in exactly the right proportions. Unlike oxtail, the tails of pigs come with the skin intact so that each segment is a perfect cross-section of skin, fat, tendon, and meat.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mains", "Offal", "Pork", "The Nasty Bits"], "recipeIngredient": ["2 pounds pig's tails, cut into approximately 4 inch sections ", "2 quarts oil for deep frying", "1/2 cup of flour, or enough to coat the tails", "<strong>For braising:</strong>", "3 cloves garlic, smashed", "Half an onion, roughly chopped", "3 tablespoons soy sauce", "1/2 cup of rice wine or white wine of your choice for braising", "1 teaspoon salt ", "<strong>To dress the pigs' tails:</strong>", "A splash of soy sauce ", "A splash of red wine or sherry vinegar", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wok or pot, heat the quarts of oil to 350°F. Carefully rinse and pat dry all the pigs' tails. Gently slip them into the oil and fry for 3 to 4 minutes, until the tails are golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tails into a braising pot and cover with water. Add the garlic, onion, soy sauce, wine, and salt. Simmer for an hour, and let cool. Reserve the stock for another use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat the oil until it is 350°F.  Pat the tails dry with a paper towel or clean cloth, taking care that no residual stock is sticking to the surface.  Roll each tail segment around in the flour, until it is evenly coated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With one hand, very quickly slip the tail segments into the pot, using your other hand to maneuver the lid of the pot as you go along. Fry for another 3 minutes, until the tails are golden brown and crisped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tossing evenly, dress the tails in a mixture of soy sauce and vinegar with salt and pepper to taste. The tails will have absorbed only a bit of the dressing, but it is enough. Have a bit of the dressing handy on the side, for dipping.</p>"}]}