{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "empanadas", "Francis Mallmann", "Seven Fires"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Empanadas Mendocinas", "link": "https://www.seriouseats.com/recipes/2009/06/cook-the-book-empanadas-mendocinas.html", "description": "Every culture has their own version of dough stuffed with some kind of filling. Pierogi, arepas, gyoza, pelmeni, ravioli, manti, jiaozi&mdash;insert dumpling here. Large or small, boiled, baked or fried, give me any variation and I'm happy. In Argentina, the...", "totalTime": "", "recipeYield": "enough for 24 empanadas", "recipeCategory": ["Beef", "Cook the Book"], "recipeIngredient": ["1 pound well-marbled stewing beef, such as sirloin tip or triangle (tri-tip)", "Coarse salt and freshly ground black pepper", "10 tablespoons (1 1/4 sticks) unsalted butter", "1/4 cup high-quality lard", "3 medium onions, quartered and thinly sliced", "1 tablespoons crushed red pepper flakes", "1 tablespoon ground cumin", "1 tablespoon <em>pimentón dulce</em> (sweet smoked Spanish paprika)", "4 scallions, minced, white and green parts kept separate", "2 tablespoons extra virgin olive oil", "1/4 cup oregano leaves, coarsely chopped", "3 large hard-boiled eggs, coarsely chopped", "1/2 cup green olives, coarsely chopped", "Empanada dough (recipe follows)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim and discard any gristle from the meat, but leave the fat. With a sharp knife, chop the meat into 1/8-inch pieces. Transfer the meat to a bowl and season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 6 tablespoons of the butter and 1 tablespoon of the lard in a large skillet over medium-low heat. Add the onions and saute until they are translucent, about 8 minutes; do not allow them to brown. Add the red pepper flakes, cumin, <em>pimentón</em>, and the white part of the scallions and saute for 2 minutes more. Turn off the heat and stir in the scallion greens.  Season to taste with salt and black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large  skillet over high heat. Brown the meat in batches, and spread the browned meat out on a tray, so it doesn't steam. When all of the meat is browned, combine in a bowl with the onion mixture, the remaining 3 tablespoons lard, and the oregano. Adjust the seasoning, cover with plastic wrap, and chill until firm.  (The filling can be made up to 1 day ahead.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble and cook the empanadas, cut one piece of the dough in half; keep the other half covered with plastic until ready to use. With a rolling pin, roll the dough out on a floured work surface into a rectangle about 8 by 22 inches, and 1/8 inch thick or less, or roll through a pasta machine, starting on the widest setting and decreasing settings as you continue until the dough strips are 1/8 inch thick or less. On a floured surface, using a biscuit cutter or water glass, cut the dough into 3 1/2-inch circles; you should be able to make 6 circles. Transfer the circles to a floured baking sheet and cover with plastic wrap. Repeat with the remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat an <em>horno de barro</em> (a wood-fired oven) or home oven (with the racks positioned in the upper and lower thirds of the oven) to approximately 350&deg F. Remove the filling from the refrigerator. Oil two large baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the remaining two tablespoons of butter into small pieces, and set out a cup of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To assemble empanadas the traditional way,</em> lay a circle of dough in the palm of your hand. Place a heaping tablespoon of filling onto one half of the circle, leaving a 1/3-inch border, and top the filling with a pinch each of the chopped egg and chopped olives and a dot of butter. With your finger or a pastry brush, moisten the edges of the dough with water, then fold the dough over the filling in a half-moon shape and pinch the edges together, forming pleats to seal the dough. Transfer to one of the oiled baking sheets. Repeat with the remaining dough circles and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Alternatively,</em> lay the circles of dough in rows on a floured surface. Spoon the filling onto one half of each circle and top with the egg, butter, and olives. Brush the edges with water, fold over as above, and press with the back of a fork to seal the edges. Transfer to the baking sheets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 to 17 minutes, until lightly browned.  Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Emapnada Dough</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the <em>sulmuera </em> (water boiled with salt, a seasoning solution often used in Argentine cookery), bring the water and salt to a boil in a small saucepan over high heat. Add the lard and stir until it melts, then transfer to a large bowl. Allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands, gradually add 5 1/2 to 6 cups of the flour, about 1 cup at a time, until you can gather the dough into a ball. Sprinkle 1/2 cup of flour on a work surface to prevent sticking and knead the dough, adding more flour until it will not absorb any more; you want a stiff, dry dough. Divide the dough in half, shape into disks, and wrap in plastic. Chill for at least 1 hour, or up to 24 hours. (The dough can also be frozen, well wrapped, for up to 1 month.)</p>"}]}