{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090611-dt-chickensaffronrice.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "rice", "saffron"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken and Rice with Saffron", "link": "https://www.seriouseats.com/recipes/2009/06/dinner-tonight-chicken-and-rice-with-saffron-recipe.html", "description": "How to describe saffron? The task has stumped food writers for ages. Its flavor is nothing like anything else, rendering comparisons useless. It's more heady and fragrant than it is strong on the tongue, yet at the same time it's...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Rice"], "recipeIngredient": ["2 pounds chicken thighs with skin and bone", "2 tablespoons unsalted butter", "2 tablespoons olive oil", "1 large onion, chopped", "3 garlic cloves, minced", "1 cup medium- or long-grain white rice", "1 cup chicken broth thinned with 3/4 cup water", "1/4 teaspoon crumbled saffron threads", "1 Turkish or 1/2 California bay leaf", "1 cup frozen peas (not thawed)", "chopped flat-leaf parsley to garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the chicken well and pat completely dry. Season with salt and pepper. In a large (12-inch) skillet, heat the butter and olive oil over medium-high heat until the butter foams and subsides, then add the chicken and brown well on all sides, 10-12 minutes.  Transfer chicken to plates and discard all but 2 tablespoons of oil from the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower heat to medium and add the onion, garlic, and a pinch of salt and pepper.  Cook, stirring often, until golden, 5-6 minutes.  Add rice and stir well to coat with fat, cooking for an additional minute.  Add broth, water, saffron, and bay leaf, and bring to a boil, then turn down to a simmer.  Taste for seasoning.  Return chicken to pan, nestling into the rice until half-submerged.  Pour in any juices from the plate and cover.  Cook for 20-25 minutes, until the liquid is absorbed and the rice is nearly tender.  If it is not yet tender, add boiling water as needed to keep moist.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat and stir in the peas.  Allow to rest, covered with a kitchen towel, until the rice absorbs any remaining liquid and becomes fluffy.  Discard bay leaf. Serve with parsley to garnish, if desired.</p>"}]}