{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090731-pickles%20on%20plate.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Japanese", "keywords": ["carrot", "cucumber", "daikon", "napa cabbage", "pickles", "pickling", "Seriously Asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: In a Pickle", "link": "https://www.seriouseats.com/recipes/2009/07/seriously-again-in-a-pickle-japanese-pickling.html", "description": "Clockwise from top: Napa Cabbage, Daikon, and Carrots; Cucumber; Daikon and Carrot. I don't know why I chose late July of all times to start a biscuit-baking, cannelés-experimenting week, but I did. The temperature in my non air-conditioned apartment must...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cucumber", "Japanese", "Pickling"], "recipeIngredient": ["3 medium to large sized cucumbers ", "1 teaspoon salt", "2-inch piece of kelp", "1-inch square of yuzu citron or lemon rind", "3 cups water", "1 cup white vinegar, or 1 ½ cups rice vinegar", "¾ cup sugar", "2 tablespoons coarse or kosher salt", "1 napa cabbage", "1 daikon", "1 small carrot ", "2 jalapeño peppers", "2 garlic cloves, minced ", "4 inches of daikon (3 inches in diameter), peeled and quartered lengthwise ", "1 medium carrot, halved lengthwise", "1 teaspoon salt", "¼ cup mirin", "¼ cup rice vinegar", "2 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice the cucumbers.  For large cucumbers, peel and de-seed before slicing.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cucumbers into a bowl and sprinkle with the salt.  Knead with your hands, mixing thoroughly to draw the water out of the vegetable.  In a minute, a fair amount of the water will have been drawn out, leaving the cucumbers feeling slick and supple.  Drain to discard the excess liquid.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the cucumbers to the bowl and add the kelp and citrus rind.  Let stand, lidded with a light weight, for one hour at room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, pick out a portion from the bowl and shake slightly to remove the excess liquid.  Add a few drops of soy sauce or sesame oil, if desired.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Pickled Napa Cabbage, Daikon, and Carrots</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>adapted from Chinese Cuisine by Susanna Foo</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, vinegar, sugar and salt in a medium saucepan.  Bring to a boil.  Remove from the heat and let the mixture cool.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the leafy upper half of the cabbage and reserve for another use.  You will only need the bottom ends with the thicker ribs.  Cut each ribbed leaf in half lengthwise.  Cut again into 1/8 inch strips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the daikon crosswise into thin, round slices, then cut each slice into a fine julienne.  Soak in ice water for 5 minutes; drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the carrot into a fine julienne.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the stems from the peppers and slice crosswise into thin slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the vegetables into a large bowl and pour the vinegar mixture all over, mixing well.  The brine should immerse most of the vegetables; if not, add a bit of water to cover.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and weight it down with a pot of water or a heavy can.   Refrigerate for at least 8 hours, or preferably for a day before using.  Immersed in the brine, the relish will keep for up to two weeks in the refrigerator.  This recipe can also be halved or quartered.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Quick Pickled Daikon and Carrot</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em> from The Japanese Kitchen by Hiroko Shimbo</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, toss the vegetables with the salt.  Cover the vegetables with plastic wrap and weight it down with a pot of water or a heavy can.   Let stand for five to six hours at room temperature.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the vegetables from the bowl and place them into a sealable plastic bag, along with the mirin, sugar, and rice vinegar.  Leave the vegetables in the bag at room temperature for three to four hours, shaking the bag every so often to distribute the liquid evenly.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate the vegetables in the plastic bag overnight, or for up to 3 days.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cut the vegetable strips into 1/4-inch slices.  Serve plain or drizzled with a bit of soy sauce.  </p>"}]}