{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090616AioliAsparagusFront.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["aioli", "asparagus", "French", "French in a Flash", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Chilled Asparagus Mélange with Fines Herbes Aïoli", "link": "https://www.seriouseats.com/recipes/2009/06/french-in-a-flash-chilled-asparagus-aioli-recipe.html", "description": "One of the most wonderful things my boyfriend has ever said to me was, \"Kerry, you make vegetables exciting.\" Sexier words have never been spoken. You may not know this about me, but I was vegetarian for twelve years growing...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Asparagus", "French"], "recipeIngredient": ["A total of 2 pounds of asparagus, including white, purple, thick, and pencil", "2 cloves garlic", "2 tablespoons flat leaf parsley", "2 tablespoons chives", "2 tablespoons tarragon", "2 tablespoons chervil", "Zest of 1 lemon", "Juice of 1/2 lemon", "1 cup mayonnaise", "Salt and pepper", "Lime wedges", "<h5>A Note about Aïoli</h5>", "Aïoli is a Provençal sauce made from garlic, egg yolks, olive oil, and lemon. It is, in its most iconic state, served in the dish also known as aïoli, which is boiled vegetables, fish, and egg, all served with the sauce. It is, and remains, all about t"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the stalks of any thick asparagus, and all the white asparagus.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to boil, and salt it well. Blanch each type of asparagus separately. Pencil takes 30 seconds, thicker takes about 60 seconds, white 60-90 seconds. Immediately shock each bundle in ice water until completely cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the aïoli by whirling together the garlic and the herbs, lemon zest and juice, and salt and pepper in a food processor. Then add the mayonnaise, and blend until it is a smooth sauce flecked with tiny bits of green.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the chilled asparagus with the aïoli sauce, and squeeze wedges of lime over the entire dish. Finish with flaked sea salt or fleur de sel.</p>"}]}