{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-broccoliraberedpepperandargulasandwich.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["broccoli rabe", "mozzarella", "roasted red peppers", "sandwiches", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Broccoli Rabe, Roasted Red Pepper, Mozzarella, and Arugula Sandwich", "link": "https://www.seriouseats.com/recipes/2009/02/broccoli-rabe-roasted-red-peppers-mozzarella-sandwiches-recipe.html", "description": "Although I've had some incredibly good meatless sandwiches in my life, whenever I make them at home they tend to come out overstuffed, messy, and muddled. With the meat gone, I often add too many vegetables that don't play well...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Sandwiches", "Vegetarian"], "recipeIngredient": ["1/2 bunch broccoli rabe, chopped", "1 tablespoon olive oil, plus more for drizzling", "2 cloves garlic, sliced", "Pinch red pepper flakes", "1/4 cup water", "1 red bell pepper, stem removed", "2 ciabatta rolls, sliced in half", "Handful arugula", "1 ball fresh mozzarella, sliced", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 tablespoon of olive oil into a large skillet over medium heat.  Toss in the garlic cloves and cook until they begin to color.  Add the red pepper flakes and and broccoli rabe and cook until the broccoli rabe is bright green and the leaves have wilted, just a few minutes.  Pour in 1/4 cup of water.  Turn the heat to medium-low, cover, and braise for 8 minutes, or until the stems are very tender.  Remove cover and let the water evaporate.  Turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the broiler.  Place the red pepper on a baking sheet and stick underneath the broiler.  Turn every minute or so until the pepper is blackened on all sides and very tender.  Place in a plastic bag and let steam for 15 minutes.  Then rub off the blackened skin, remove the seeds, and slice into long strips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Construct the sandwich.  Place some of the roasted red pepper strips down first on the bottom slice of ciabatta, then a little handful of the broccoli rabe, a few slices of mozzarella, and finally a handful of arugula.  Drizzle some good olive oil on top and season with a pinch of salt, and top other slice of ciabatta.</p>"}]}