{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-porkchopsingreenchilesauce.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fall recipes", "mole", "pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pork Chop with Mole Verde (Pipian de Chuletas de Puerco)", "link": "https://www.seriouseats.com/recipes/2009/08/pork-chop-with-mole-verde-pipian-de-chuletas-de-puerco-recipe.html", "description": "The sauce is the story here. That's what you'll spend the most time and money on with this Aaron Sanchez recipe from his La Comida Del Barrio cookbook. It's essentially a simple tomatillo salsa accentuated with pumpkin seeds and roasted...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pork"], "recipeIngredient": ["1 medium onion, peeled and cut in half", "4 cloves garlic", "20 small tomatillos, husked and rinsed", "1 jalapeno", "3/4 cup olive oil", "1 poblano pepper", "1 cup hulled green pumpkin seeds", "2 cups coarsely chopped cilantro", "2 tablespoons dried epazote", "2 quarts chicken broth", "2 tablespoons lard", "1 1/2 tablespoons salt", "4 bone-in pork chops, about 1/2 inch thick", "1 1/2 teaspoons ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large skillet over medium-high heat. Toss the onion halves, garlic, tomatillos, and jalapenos with 1/2 cup of the oil.  Add about half of this mixture, or as many that will fit in one layer, to the skillet. Cook, turning occasionally until slightly blackened on all sides.  Repeat with the other half. Toss the cooked ones in a large bowl except the jalapeno, which needs to have its stem and seeds removed. Then add it to the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After they cool for a little bit, blend everything up in batches. Transfer the pureed sauce to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Coat the poblano in 2 tablespoons of the oil and then set underneath the broiler. Cook, turning occasionally, until blackened on all sides. Transfer to a plastic bag and let steam for 15 minutes. Then remove the blackened skin, stem, and seeds. Roughly chop the flesh.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the poblano, pumpkin seeds, cilantro, epazote, and 2 cups of the broth to the blender and puree until smooth. Combine with the tomatillo sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lard to a large pot or dutch oven set over medium heat. Carefully pour in the chile mixture (it might splatter). Cook for 5 minutes, stirring occasionally. Pour in the remaining stock and 1 tablespoon salt. Cook for 10 minutes.</p>"}]}