{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090114grapefruit-feature.jpg", "author": {"@type": "Person", "name": "Amanda Clarke"}, "recipeCuisine": "", "keywords": ["cakes", "desserts", "gelatin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Puckering Up for Grapefruit: Grapefruit Gelatin and Angel Food Cake", "link": "https://www.seriouseats.com/recipes/2009/01/grapefruit-gelatin-angel-food-cake-recipe.html", "description": "I find it a cheerful coincidence that as our bodies begin to demand reprieve from the overindulgences of the holiday season, the cleansing, refreshing, heaven-sent antidote that is citrus is just reaching its peak of abundance and quality. Though I...", "totalTime": null, "recipeYield": "6-10", "recipeCategory": ["Desserts"], "recipeIngredient": ["43 leaves gelatin (75 grams or about 11 envelopes of powdered gelatin) ", "1/2 cup sugar (105 grams)", "1 cup water (225 grams)", "Zest of 4 grapefruit, finely grated", "Zest of 5 limes, finely grated", "6 cups grapefruit juice (1350 grams) <a name=\"note2\"></a>** It takes a lot of grapefruits and a lot of juicing to acquire 6 cups of fresh juice, so I cheat a little, juicing only the 4 fresh grapefruits that I've already zested and topping off that fresh juice with quality, unsweetened purchased juice.", "1 2/3 cups confectioners' sugar (200 grams)", "1 1/4 cups all-purpose flour (150 grams)", "12 large egg whites (~360 grams)", "1/8 teaspoon cream of tartar", "1/2 teaspoon salt", "1 cup granulated sugar (210 grams)", "1 vanilla bean, scraped, pod reserved for another use", "Zest of 1 grapefruit, finely grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a little cool water into an 8x8, 9x9 or 9x13 pan (the larger the area of the pan, the thinner the finished gelatin will be). Lightly wipe away most of the water with a clean kitchen towel, leaving just a thin film of water over the inner surface of the pan.  Drape a large sheet of plastic wrap over the pan and gently press plastic into the corners of the pan, gently smoothing it against the sides and bottom of the pan as you go.  Set pan aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with a few cups of ice and very cold tap water.  Soak the gelatin leaves in the ice water for about 5 minutes, until soft and pliable.  Wring out as much water as possible and place the gelatin in a medium saucepan. </p>\n\n<p>Note: Leaf gelatin is much easier to use in this quantity.  If using powdered gelatin, mix with the sugar before sprinkling over the surface of the 3 cups of liquid.  Do not stir.  Leave the gelatin to bloom for 5 to 10 minutes before adding the zest and gently heating and stirring the mixture until the gelatin is completely dissolved.  From there, follow the recipe as written.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add to the saucepan: the cup of water, the sugar, zests, and 2 cups of the juice.  Place pan over medium-low heat, stirring often until all gelatin is melted.  Cover pot and set aside for about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly stir in the remaining grapefruit juice.  Strain the mixture through a fine sieve, pressing on the solids in the sieve to extract as much liquid as possible.  Discard solids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the gelatin mixture into the plastic wrap-lined pan and carefully transfer the pan to the refrigerator to chill completely.  Once the gelatin is set, gently lift it out of the pan using the plastic wrap as handles.  Using a metal offset spatula or the back of a knife dipped in hot water, cut the gelatin into neat cubes.  These may be served immediately or kept in a tightly sealed container in the refrigerator for one week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Angel Food Cake</strong> <em>- makes 1 standard angel food cake, 8-12 servings -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Sift together confectioners' sugar and flour twice and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine egg whites, cream of tartar and salt in a large mixing bowl or the bowl of a heavy duty stand mixer.  Add about 1/4 of the granulated sugar and beat the whites (with a whisk attachment if using a stand mixer) on medium-low speed.  Once the whites are thoroughly foamy, increase the speed to medium and gradually add about half of the remaining sugar. Increase the speed to medium-high as the whites become shiny and opaque, and gradually add all but the last tablespoon or so of the remaining sugar. Rub the vanilla-bean scrapings into the remaining sugar. Whip whites until glossy and dense but still supple&mdash;medium-firm peaks. In the very last stage of beating the whites, add the vanilla sugar and whip just until well incorporated.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the whites out into a very large, wide mixing bowl, and gently fold in about 1/3 of the sifted dry ingredients (flour and confectioner's sugar), just until they are well-distributed, not uniformly incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the zest over the surface of this mixture, and using just two or three strokes, gently fold the zest into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of the remaining dry ingredients and gently fold just to distribute. Add the remaining dry ingredients and gently fold until well incorporated and no veins of dry remain. (Because angel food cakes get all of their volume and texture from beaten egg whites, it's important to treat the whites gently as you incorporate the dry ingredients.  Don't worry if veins of dry ingredients or zest remain visible after the first few additions.  Wait until the final addition of dry to fold everything in thoroughly.  This will prevent a lot of lost volume.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn this mixture into an ungreased standard tube pan. Bake for 40-50 minutes until cake springs back to the touch and a toothpick inserted in the center comes out clean.  If the tube pan has \"feet,\" immediately invert the pan onto its feet and allow to cool completely.  If the pan does not have feet, invert it over a heavy bottle (sliding the hollow center of the tube pan over the neck of the bottle), and allow the cake to cool completely.<a href=\"#note4\">**</a>  Once the cake has cooled, gently run a thin knife around the outside and center of the cake and gently shake out of the pan.  Slice and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: ** No matter how well-made an angel food cake is, if you cool it in the same orientation as you baked it, gravity will do what gravity does and compress the cake as it cools, undoing all your hard work.  Inverting the cake to cool will insure the tallest, most delightful result.</p>"}]}