{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091109-seasian-tripe-board.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Cooking of Southwest France", "lamb", "offal", "pork", "stews", "The Nasty Bits", "tripe"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Lamb Tripe Stew", "link": "https://www.seriouseats.com/recipes/2009/11/the-nasty-bits-lamb-tripe-stew-recipe.html", "description": "[Photographs: Chichi Wang] Pig's stomach and beef tripe are fairly common finds in ethnic markets, but it's not everyday that I come across lamb tripe. Sitting next to an assortment of livers, the packages of lamb tripe were neatly stacked...", "totalTime": "", "recipeYield": "serves 6", "recipeCategory": ["Lamb", "Offal", "Pork", "Soups and Stews", "The Nasty Bits"], "recipeIngredient": ["3 pig's feet or 4 pig's snouts", "Coarse kosher salt", "1 teaspoon Herbes de Provence", "2 pounds beef honeycomb or lamb tripe", "3 tablespoons white wine vinegar", "2 medium carrots, sliced", "1 medium onion, sliced", "1 leek, cleaned and sliced", "1 rib of celery, sliced", "1 bouquet garni: parsley, thyme, and bay leaf", "1 bottle dry white wine", "1 tablespoon tomato paste", "1/4 teaspoon saffron threads", " ", "<strong>For the rope of dough:</strong>", "3/4 cup flour", "1 teaspoon vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Two days in advance, scrub the pig's feet or snouts and dry. Rub with 1 tablespoon of salt and the mixed herbs. Cover loosely with plastic wrap and refrigerate overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The following day, soak the tripe in 3 cups of cold water, along with the vinegar, for 1 hour. Rinse and drain. Place the tripe in a deep kettle, cover with cold water, and bring slowly to a boil. Simmer for 15 minutes; drain. As soon as the tripe is cool enough to handle, cut it into 1 1/2 inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 210 F.  Place the vegetables in a 7-9 quart casserole, preferably earthenware or enameled cast-iron. Add the tripe, herb bouquet, wine, tomato paste, and saffron.  Rinse the pig's feet or snouts and add to the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough water and oil to the 3/4 cup of flour make a thick paste that's moist and not sticky, and capable of being formed into a long rope. Seal the pot with a ribbon of this paste, taking care to press the dough against the lid of the vessel. Place the pot on the center oven shelf to cook for 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Twelve hours later or the following morning, strain the contents: If you used trotters, debone the feet and set aside the meat. Using a strainer, press down on the vegetables with the back of a spoon to extract all the juices before discarding.  Leave the snouts as they are. Cut the pork into smaller pieces. Place the tripe and the meat into a deep bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the fat to rise to the surface of the cooking liquid. Skim off and discard all the fat. Place the degreased liquid in a deep saucepan and boil, skimming, until reduced it has been reduced to 3 cups of thick, meaty broth. Pour the broth over the tripe and pig's feet. Serve while piping-hot, with plenty of good crusty bread on the side to sop up the meat juices.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If not serving immediately, cover the bowl and refrigerate for up to 3 days.  </p>"}]}