{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090821sardinesandwich.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "lunch", "sandwiches", "sardines", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Sardine Sandwiches with Tomato Jam and Fresh Cheese", "link": "https://www.seriouseats.com/recipes/2009/08/sardine-sandwiches-with-tomato-jam-and-fresh-cheese-recipe.html", "description": "[Robin Bellinger] This deliciously unusual sandwich comes from Clotilde Dusoulier's Chocolate and Zucchini—the book, not the blog! Making your own tomato condiment may sound a bit fussy, but it’s actually very little trouble (and, more important, totally worth it). Although...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Fish", "Sandwiches"], "recipeIngredient": ["1 tablespoon extra virgin olive oil", "2 small shallots, minced (onion will do in a pinch)", "1 garlic clove, minced or pressed", "1 14-ounce can whole tomatoes, drained and chopped", "1/4 teaspoon pimentón", "1/4 teaspoon fine sea salt", "1/4 teaspoon freshly ground pepper", "1/4 teaspoon light brown sugar", "1 tin sardines packed in olive oil, about 4 ounces; I prefer skinless and boneless here", "6 slices multigrain sandwich bread", "1/4 cup fresh goat cheese, ricotta, or cream cheese", "1 packed cup arugula (or mixed greens or baby spinach)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a small saucepan over medium heat. Add the shallots and garlic and cook for 2 minutes, until soft and fragrant, stirring regularly. Add the tomatoes, pimentón, salt, pepper, and sugar. Lower the heat to medium-low and cook for 30 minutes, uncovered, stirring from time to time, until the mixture is thick and the juices have evaporated. Transfer to a bowl to cool. (This can be prepared up to a day in advance.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the sardines and mash roughly with a fork. Slice the crusts off the bread and discard or save for bread crumbs. Toast the slices until golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Build the sandwiches: toast, cheese, tomato jam, sardines, arugula, toast. Use a sharp bread knife to halve diagonally.</p>"}]}