{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091120-curries-porkcurry.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Thai", "keywords": ["curries", "Seriously Asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork in Penang Curry Sauce", "link": "https://www.seriouseats.com/recipes/2009/11/pork-in-penang-curry-sauce.html", "description": "Adapted from From Curries to Kebabs: Recipes from the Indian Spice Trail by Madhur Jaffrey....", "totalTime": "", "recipeYield": "4-5", "recipeCategory": ["Mains", "Pork", "Thai"], "recipeIngredient": ["14-ounce can of coconut milk, left undisturbed for several hours ", "2 tablespoons vegetable oil ", "5 to 6 tablespoons <a href=\"http://www.seriouseats.com/recipes/2009/11/penang-curry-paste.html\">Penang curry paste</a> ", "8 fresh kaffir lime leaves, cut into fine slivers (optional) ", "1 pound pork shoulder, cut into 1 1/2 inch cubes with the fat and skin left intact ", "2 tablespoons fish sauce, or to taste ", "1 teaspoon brown sugar, or to taste  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the sauce: Open the can of coconut milk and skim off the top layer of thick cream, about 4 tablespoons worth. Stir the remaining milk to reincorporate the coconut cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large, nonstick lidded pan and set over medium heat. When the oil is hot but not smoking, add the coconut cream and the curry paste. Stir the paste around until it is lightly browned and the oil has separated from the coconut in the cream. You have just cracked the coconut. Now, add 6 lime leaves and stir a few times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the seasonings: the coconut milk, about 1/2 cup of water to thin out the mixture, the fish sauce, and then sugar. You can add more or less water, depending on your preference for the consistency. Stir and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cubes of pork and gently simmer for 40 to 50 minutes, until the pork is tender and the sauce has reduced by two-third to one-half of its original volume. Garnish with the rest of the kaffir lime leaves. Serve immediately with rice. Leftovers reheat well, simmered gently for a few minutes to re-warm the pork.</p>"}]}