{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090124-dt.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["mushrooms", "pasta", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Spaghetti alla Boscaiola (Spaghetti with Tomato Sauce and Mushrooms)", "link": "https://www.seriouseats.com/recipes/2009/01/spaghetti-alla-boscaiola-tomato-sauce-mushrooms-recipe.html", "description": "Sometimes a simple meal is best. This basic, no-nonsense dish is the kind that can be whipped up in 20 minutes and, I believe, is best eaten on the couch with a mindless television program. The sauce uses mostly pantry...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Mushrooms", "Pasta"], "recipeIngredient": ["1 pound spaghetti", "3 tablespoons olive oil, plus a little for drizzling at the end", "1 14-ounce can plum tomatoes", "3 cloves garlic, minced", "10 ounces mushrooms, sliced", "handful parsley, chopped", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour half of the oil into a large skillet over medium heat.  Add the garlic and cook until it fragrant, about a minute or two.  Dump in the can of tomatoes and turn the heat to medium-high.  Break up the tomatoes with a wooden spoon.  Cook until the sauce has thickened, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tomatoes are cooking, pour the rest of the oil into another skillet and add the sliced mushrooms.  Cook over medium heat until they begin to release water, about 5 minutes. Turn heat to low, season with salt, and sprinkle with the chopped parsley. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to a boil.  Add the spaghetti and cook according to the directions on the box until al dente.  Transfer to the skillet with the tomato sauce, toss until coated.  Add the mushrooms, and toss.  Serve with a sprinkling of cheese, a drizzle of good olive oil, and season with salt and pepper to taste.  </p>"}]}