{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090806-roasted-garlic-and-oregano-chicken.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["chicken", "garlic", "grilled potato", "grilling", "oregano", "potatoes", "vinaigrettes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Chicken with Roasted Garlic-Oregano Vinaigrette and Fingerling Potatoes", "link": "https://www.seriouseats.com/recipes/2009/08/grilling-chicken-with-roasted-garlic-oregano-vinaigrette-fingerling-potatoes-recipe.html", "description": "Each week Joshua Bousel of The Meatwave drops by with a recipe for you to grill over the weekend. Fire it up, Joshua! Chicken tends to be my go-to item when I want something to grill after work but haven't...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "Garlic", "Grilling", "Potato"], "recipeIngredient": ["<small>For the chicken and potatoes:</small>", "12 fingerling potatoes", "4 bone-in chicken breasts", "Freshly ground black pepper", "Kosher salt", "Olive oil", "Fresh oregano sprigs, for garnish", "<small>For the vinaigrette:</small>", "8 cloves of garlic", "1/4 cup white wine vinegar", "1 teaspoon honey", "2 tablespoons fresh oregano leaves", "1/2 teaspoon  kosher salt", "1/2 teaspoon red chili flakes", "3/4 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes in a medium saucepan, cover with salted cold water, and bring to a boil.  Reduce the heat and simmer until a paring knife inserted into the potatoes comes out with some resistance, 8 to 10 minutes.  Drain well, and when cool enough to handle, slice in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place garlic cloves in heavy duty tin foil, drizzle with olive oil, seal, and place directly in the coals. Cook until gloves are browned and very soft, about 20-30 minutes.  Remove from the grill and squeeze cloves out of the skin when cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic, vinegar, honey, oregano, and chili flakes in a blender and blend until smooth.  With the motor running, slowly add the oil and process until emulsified.  Pour into a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the chicken and potatoes with olive oil and season with salt and pepper.  Place chicken on the grill, skin side down and grill until browned and crisp, about 6 to 7 minutes.  Flip chicken and continue cooking until an instant read thermometer reads 165°F in the thickest part of the breast.  A few minutes before the chicken has finished, place the potatoes on the grill, cut side down, and cook until lightly golden brown, about 2 to 4 minutes.  Turn over and continue grilling for a minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken and potatoes to a platter and immediately drizzle with the roasted garlic-oregano vinaigrette.  Let rest for 5 minutes, garnish with oregano sprigs and serve.</p>"}]}