{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091123-nastybits-pots.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Brian Polcyn", "confit", "gizzards", "gravy", "holiday recipes", "Michael Ruhlman", "rilettes", "rillettes", "The Nasty Bits", "turkey", "turkey gizzards"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Turkey Gizzards", "link": "https://www.seriouseats.com/recipes/2009/11/the-nasty-bits-turkey-gizzards-confit-rillettes-chinese-red-braise-recipes.html", "description": "[Photographs: Chichi Wang] Compared to chicken, turkey gizzards are gargantuan. One turkey gizzard fits snugly in the palm of my hand. Around Thanksgiving, most stray gizzards are marshaled into the gravy. Being an offal lover, I'd rather eat the components...", "totalTime": "", "recipeYield": "enough for 4 half-pint crocks", "recipeCategory": ["Braising and Stewing", "Offal", "The Nasty Bits", "Turkey"], "recipeIngredient": ["1.5 to 2 pounds turkey gizzards", "2 celery stalks", "1 medium onion", "1 carrot", "3 bay leaves", "1/2 teaspoon thyme, or herbs of your choice such as oregano, majoram, etc.", "6 or so black peppercorns", "1 teaspoon salt, or to taste", "1 1/2 quarts chicken stock or water", "1/4 cup fat", "<strong>Red Braised Turkey Gizzards</strong>", "1 pound turkey gizzards", "1/4 cup soy sauce", "3 tablespoons Shao Xing rice wine, or sake", "3 lumps rock sugar, or 3 tablespoons brown sugar", "1-inch piece of ginger, scrubbed clean", "2 star anise", "A 2-inch piece of cinnamon", "A few chili peppers, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil, and place the gizzards in the boiling water. Let the gizzards cook for one minute to get rid of any impurities. Drain the gizzards and rinse under cold water.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gizzards in a medium-sized pot and cover with water. Add the remaining ingredients: the water or stock, the aromatics and herbs, and peppercorns.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a simmer, cover, and cook for 3 hours or until the gizzards are fork-tender.     </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the gizzards from the stock and let cool to slightly above room temperature. Strain the stock and set aside. The majority of the stock can be used in a gravy; reserve some of the liquid for use in the rillettes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gizzards in the bowl of a stand mixer fitted with the paddle attachment. Mix on low speed, slowly adding enough of the reserved stock, until the meat shreds thoroughly and the mixture takes on a moist and spreadable texture, about 1 to 3 minutes. Taste and more add salt and pepper. Since the rillettes will be served at room temperature, the paste should be slightly saltier than what you would normally expect from a warm preparation. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the mixture into individual ramekins or crocks. Refrigerate until chilled, then pour about 1/8 inch of rendered fat on top to seal the ramekins. If you are running low on fat, use a bit of olive oil to bulk up the mixture. Refrigerate for up to 3 weeks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the rillettes from the refrigerator 2 hours before serving; they are best at room temperature.  Serve with bread or toast.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Red Braised Turkey Gizzards</strong> (makes enough for an appetizer that serves 6 or more)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gizzards in a medium-sized pot and cover with water. Add the remaining ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil, then reduce the heat to a steady simmer and cook for 1 1/2 hours or until the gizzards are fork-tender. Towards the end of the cooking time, the liquid will have reduced into a syrupy sauce. Take care that the sauce doesn't burn.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the gizzards cool to room temperature. Before serving, slice them thinly on a bias. Serve as a snack or appetizer, accompanied by noodles or rice. Leftover gizzards may be refrigerated, whole, for up to a week. Do not slice until you are ready to serve, as the flavor degrades of a thin-sliced gizzards degrades more quickly.  </p>"}]}