{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/IMG_9845.JPG", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "chiles", "curries", "Dinner Tonight", "lemongrass", "red chiles", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sweet and Spicy Chicken Curry", "link": "https://www.seriouseats.com/recipes/2009/12/sweet-and-spicy-chicken-curry-recipe.html", "description": "\"The final color will depend on what kind of chiles you use.\" [Photograph: Nick Kindelsperger] I love big holiday meals as much as the next guy&mdash;pass the mashed potatoes and macoroni and cheese please!&mdash;but that's just not the way I...", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["4 fresh red chiles, stemmed, seeded, and chopped", "3 dried red chiles, stemmed and seeded", "1 stalk of fresh lemongrass, hard outer layers removed, and white parts thinly sliced", "2 garlic cloves, chopped", "4 small shallots, half of them chopped, the other half thinly sliced", "1/2 tablespoon water", "1/4 cup plus 1/2 tablespoon of Canola oil ", "2 whole chicken legs, split into legs and thighs", "Salt and pepper", "1/2 14-ounce can unsweetened coconut milk ", "1 tablespoon fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the fresh chiles, dried chiles, lemongrass, garlic, the chopped shallots, and the water into a food processor and blend until it is a paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 1/2 tablespoons of the oil into a large skillet over medium-high heat. Sprinkle the chicken pieces with salt and pepper and then place in the skillet. Cook for 10 minutes, flipping halfway through, until they get nicely browned on both sides. Turn heat to medium and remove the chicken pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump the paste into the skillet. Cook for 7 minutes, stirring occasionally, until all the water has evaporated. Pour in the coconut milk, stir well, and then return the chicken to the skillet. Cover the skillet, turn heat to medium-low, and cook until the chicken is cooked and the sauce has thickened, about 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rest of the oil into a small skillet. Turn the heat to medium and add the sliced shallots. Cook, stirring occasionally, until the shallots are golden brown. This should take about 10 minutes. Remove the shallots and drain on some paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the skillet. Divide the chicken between a few plates. Add the lemon to the sauce, stir well, and then spoon the sauce over the chicken pieces and sprinkle with the fried shallots. Season with salt and pepper to taste.  </p>"}]}