{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090323cassoulet.JPG", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["beans", "cassoulet", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Moderately Meaty Cassoulet", "link": "https://www.seriouseats.com/recipes/2009/03/meat-lite-moderately-meaty-cassoulet-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. I order cassoulet a lot at restaurants, and...", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["1 pound dried white beans, such as great northern", "1 tablespoon table salt", "1 smoked ham shank or hock ", "2 sprigs rosemary", "3 sprigs thyme, plus another 1 teaspoon minced thyme leaves (divided)", "1 onion, halved, 1 half left intact, the other half minced (divided)", "5 garlic cloves, peeled and lightly crushed", "1 bay leaf", "1 whole head of garlic", "3 tablespoons olive oil, divided", "6 ounces Kielbasa, cut into 1/2-inch cubes", "1 pound button or cremini mushrooms, minced", "Salt and pepper to taste", "5 slices stale white bread, crusts removed, and pulsed to crumbs in the food processor"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the beans with cold water by two inches, and dissolve 1 tablespoon table salt into the water. Soak overnight and then drain and rinse before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your over to 250°F. In a large Dutch oven, combine the beans, ham shank or hock, rosemary, thyme sprigs, onion half, lightly crushed garlic cloves, bay leaf, and 8 cups cold water. Bring to a boil on the stovetop, then transfer to the oven and cook until the beans are tender, about two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the beans come to a boil, trim the stem end off the whole head of garlic, coat with about 2 tablespoon of the olive oil, sprinkle with salt and pepper, and wrap loosely in aluminum foil or in a ramekin. Put in the oven to roast while the beans cook. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining tablespoon of oil in a large skillet over medium-high heat and add the kielbasa, and cook until it's beginning to brown, about 5 minutes. Add the minced onion, mushrooms, and minced thyme. Cook, stirring frequently, until the mushrooms have given off their liquid and it has evaporated, the onions have softened, about 10 to 15 minutes more. Reserve and refrigerate until the beans have finished cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the beans are finished, remove and reserve the ham hock or shank. Remove and discard the rosemary and thyme sprigs, the half onion, the bay leaf and the garlic cloves. Drain the beans, straining and reserving 1 1/2 cups of the cooking liquid. Reduce the cooking liquid in a medium saucepan by half. Remove the roasted head of garlic, reserving the oil, and when cool enough to handle, squeeze out the garlic paste. Whisk the garlic paste into the reserved cooking liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If your ham bone has some good looking meat on it that you'd like to add to your dish, shred it into bite size morsels and add to your beans. Add the reserved onion-mushroom mixture to the beans and stir to combine, then transfer it into a 9-by-13 inch baking dish. Pour the reduced cooking liquid and garlic paste over the top. Sprinkle the bread crumbs on top, drizzle with reserved garlic oil, and bake in a 350°F oven for 30 minutes, broiling the last few minutes to crisp the top. </p>"}]}