{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090813zucchinicornfritters.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["corn", "CSAs", "fall recipes", "The Crisper Whisperer", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "The Crisper Whisperer: Zucchini and Corn Fritters Rule the World. For Reals", "link": "https://www.seriouseats.com/recipes/2009/08/what-to-do-with-zucchini-and-corn-fritters-recipe.html", "description": "Note: If you're a CSA member or gardener, you're probably all too familiar with the phenomenon of having too much X, Y, or Z (zucchini seems to be the culprit right now). This post marks the debut of Carolyn Cope's...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Corn", "Crisper Whisperer", "Mains", "Vegetarian", "Zucchini"], "recipeIngredient": ["4 cups shredded zucchini", "1 teaspoon salt", "3 eggs", "2 ears corn", "1 small onion, diced small", "3 scallions, white and green parts, thinly sliced", "1/4 cup cilantro, minced", "3/4 cup flour", "A few good grinds of black pepper", "Canola, grapeseed or other neutral oil, for pan-frying", "Sour cream or Greek yogurt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shred the zucchini on the large holes of a box grater or with the shredding disc of a food processor. Place the shredded zucchini in a colander in the sink or over a bowl and sprinkle with the salt. Toss to combine. Let drain while you prepare the rest of the ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a large bowl and scramble lightly. Cut the kernels from the corn cobs and add the kernels to the bowl along with the diced onion, sliced scallions, chopped cilantro, flour and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick up the shredded zucchini in small handfuls and squeeze out and discard as much liquid as you can. Add the zucchini to the bowl. Mix well to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large frying pan to a depth of about 1/4-inch. Heat the oil over medium-high heat until hot but not smoking. Drop large, heaping spoonfuls of the zucchini mixture into the pan to form disc-shaped fritters. Cook in batches without crowding (about 3 or 4 at a time, depending on the size of your pan) until golden brown on the underside (about 2 minutes) and then flip and cook until golden brown on the second side. Remove to paper towels to drain. Add a bit more oil between batches if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with a dollop of sour cream or Greek yogurt. The fritters should be crisp on the outside and slightly custardy on the inside.</p>"}]}