{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090306-beemster.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Brussels, Beemster, and Bacon Gratin", "link": "https://www.seriouseats.com/recipes/2009/03/brussels-beemster-and-bacon-gratin-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. beemster.us On most days, if I had the...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon", "Meat Lite"], "recipeIngredient": ["1 pound brussels sprouts", "2 1/2 cups whole milk", "3 tablespoons butter", "1 scant cup small-diced onion (about 1 small onion)", "2 garlic cloves, sliced", "2 tablespoons all-purpose flour", "4 ounces Canadian bacon, roughly chopped", "6 ounces (about 1 1/2 cups) Beemster, grated", "4 ounces (about 1 cup) Gouda, grated* ", "Freshly grated nutmeg", "Coarse salt", "Freshly ground black pepper", "*The gouda helps keep the sauce creamy and smooth. Substitute Havarti or Fontina if you prefer."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Trim the stem end of each sprout and cut in half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the milk in a medium saucepan over medium-high heat and bring to a simmer.  Add the Brussels sprouts to the milk and simmer for 10 minutes, until they are tender but not at all mushy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sprouts simmer, melt 2 tablespoons of the butter in a large sauté pan over medium heat.  Add the onions and sweat them for 2 to 3 minutes.  Add the garlic, sauté about 30 seconds.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the last tablespoon of butter. Once it melts into the onions and garlic, sprinkle the flour in and whisk well to eliminate lumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the sprouts from the hot milk and set them aside.  Slowly whisk the hot milk into the ingredients in the sauté pan.  Continue whisking until all the milk is incorporated, lump-free.  Stir in the Canadian bacon, all but 1/2 cup of the Beemster, and the Gouda.  When the cheese has melted into the sauce, add the Brussels sprouts. Season the sauce with nutmeg, salt and pepper to taste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into a baking dish or divide between medium ramekins (about 6 ounces).  Sprinkle the reserved cheese across the top.  Transfer the gratin to the oven and bake for 15 minutes.  Broil for 5 minutes to brown the top before serving.</p>"}]}