{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091103cakespyosgood.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "cherries", "desserts", "holiday baking", "pie crusts", "pies", "raisins", "Thanksgiving pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Cherry Almond Osgood Pie", "link": "https://www.seriouseats.com/recipes/2009/11/cakespy-osgood-pie-raisins-cherries-vinegar-recipe.html", "description": "First things first: what <em>is</em> <strong>Osgood Pie,</strong> anyway? Said to have taken its name from the phrase \"Oh So Good Pie,\" it's an old-time recipe in the tradition of chess and vinegar pies, comprised of a <strong>thick, custardy filling</strong> made of eggs, vinegar, sugar, raisins and spices.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakespy", "Cherry", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For filling:</strong>", "4 eggs", "1 cup dried cherries", "2 cups sugar", "3 tablespoons vinegar", "2 tablespoons butter", "1 teaspoon cloves", "1 teaspoon cinnamon", "1 teaspoon nutmeg", "1/2 cup slivered almonds (optional)", "<strong>For pie crust:</strong>", "<em>- makes one rather thick pie crust -</em>", "2 1/2 cups all-purpose flour, plus extra for rolling", "1 cup unsalted butter, very cold, cut into 3/4 inch cubes", "1 teaspoon salt", "1 teaspoon sugar", "4 to 8 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pie crust. Put the flour, salt and sugar into a food processor and pulse once or twice. Add the butter and process until the mixture looks grainy. Then slowly, while pulsing, add the water until you can form the dough by pressing it between your fingers (Note: if you don't have a food processor, this can all be done by hand as well). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the loose dough onto a piece of plastic wrap. Using the wrap, fold the loose dough towards the middle and press with the back of your hands to form dough. Wrap and chill for at least 4 hours before using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready, roll it out with a rolling pin to an approximately 12-inch circle; transfer this to a pie plate and trim the edges and shape them in any way you'd like.</p>\r\n\r\n<p><strong>Note:</strong> If you like a thinner pie crust, you could either divide this pie dough into two parts and get two pie crusts out of it, or you could use the extra dough to make pie dough cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of the (unbaked) pie crust with the dried cherries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the yolks and whites of the eggs. To the yolks add the sugar, butter, spices, and vinegar; mix thoroughly and then add to this mixture the well-beaten egg whites. Mix well and pour into the crust, directly on top of the cherries. If you're using the almonds, you can apply them directly on top of the custard; you can configure them in a pretty design (if you want a circle design like I did, start by lining the almonds from the outside in) or simply crush them and sprinkle them on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 45 minutes to an hour; because the top will start to brown lightly early on in the baking process, you will want to test that the inside has set by inserting a pick; if it comes out clean, it's done. Let cool for at least two hours so that filling can set before serving. This pie tastes even better the day after it's baked.</p>"}]}