{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/ctb-asiangrill.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bánh mì", "carrots", "condiments", "Cook the Book", "Corinne Trang", "cucumber", "daikon", "pickles", "The Asian Grill", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pickled Daikon, Carrot, and Cucumber", "link": "https://www.seriouseats.com/recipes/2009/04/pickled-daikon-carrot-and-cucumber-recipe.html", "description": "These simple pickles from The Asian Grill are served at some Chinese restaurants before the meal to whet the appetite; they're also perfect when paired with the pork patty recipe featured earlier this week in a homemade banh mi. Pickling...", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Cucumber", "Pickling", "Vegetarian"], "recipeIngredient": ["2 to 3 large carrots, peeled and julienned", "1 small daikon, peeled, halved lengthwise, and julienned", "1 English (hothouse) cucumber, peeled, halved lengthwise, seeded and cut into 1/4-inch-by-2-inch-long slices", "2 tablespoons kosher salt", "6 tablespoons sugar", "1 cup rice vinegar", "1 or 2 Thai chilies, stemmed, halved lengthwise and seeded (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss the carrots, daikon, and cucumber with the salt. Let stand for 1 hour. Drain, squeezing the vegetables to get rid of their excess water. Put the vegetables in a resealable plastic bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the sugar and rice vinegar until the sugar is completely dissolved. Add the vegetables, along with the chili(es) (if using). Seal the bag, squeezing any air out. Let stand for at least 1 hour.The longer the vegetables marinate, the more pickled they will taste. Eat as an accompaniment to any grilled protein. It cuts the fat and introduces a nice crunch texture to the tender meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Notes: </strong>The thinner the cut of the vegetable, the softer it will become while pickling. For instant 1-hour pickles, cut the vegetables thin so that they will absorb flavor but still have some crunch (they will be slightly wilted). If you want to make the pickles ahead of time, cut them thick (1/4 inch or more) and pickle them for at least 3 days or up to 1 week, refrigerated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The longer the vegetables sit in the pickling liquid, the softer texture and the more pronounced the flavor.</p>"}]}