{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-duckwithorangechipotleglaze.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chipotle", "chipotle sauce", "duck", "duck breasts", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Broiled Duck Breasts with Orange Chipotle Sauce", "link": "https://www.seriouseats.com/recipes/2009/07/broiled-duck-breasts-with-orange-chipotle-sauce-recipe.html", "description": "I think the last time I had duck was in March of 2008, which is not something I'm particularly proud to admit. For my return I decided to try this recipe from Gourmet, which paired broiled duck with a wonderful-sounding...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Mains", "Other Meats"], "recipeIngredient": ["1 1/4 cups fresh orange juice", "2 tablespoons fresh lime juice", "1 1/2 tablespoons maple syrup", "1/2 tablespoon canned chipotle chiles in adobo, chopped", "1/2 cinnamon stick", "1 whole clove", "1/2 teaspoon salt", "2 Long Island duck breasts halves, with skin", "salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the orange juice, lime juice, maple syrup, chipotle chiles, cinnamon, clove, and 1/2 teaspoon of salt to a medium sized saucepan.  Bring mixture to a boil and then reduce to a simmer.  Cook until reduced to 1/2 cup.  It should take about 20 to 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, position a roasting pan with rack at least 6 inches away from the top of the broiler.  You might have to adjust the broiler racks to get it in the right position.  Fill the roasting rack with 1 cup of water.  Then preheat the broiler. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the duck breasts with some paper towels.  Cut diagonal slits through the skin of the duck every 1-inch or so, making sure not to cut any of the actual meat.  Season both sides with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the duck breasts thinly at a 45 degree angle.  Fan out on a plate.  Pour any of juices that have accumulated on the cutting board into the orange sauce.  Stir well, and then pour the sauce over the duck.  Serve with some vegetables of some kind.  I had some lovely rainbow chard. </p>"}]}