{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090512porkchopwithbraisedfennel.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["fennel", "pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pork Chops with Braised Fennel and Caramelized Onions", "link": "https://www.seriouseats.com/recipes/2009/05/pork-chops-with-braised-fennel-and-caramelized-onions-recipe.html", "description": "One thing I love about braised fennel—besides the fact that gentle cooking brings out its sweetness and tones down the anise-y flavor—is that it retains a good sharpness along with its richness. I love braising vegetables because they cook in...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pork"], "recipeIngredient": ["2 large fennel bulbs, trimmed and sliced", "1 cup chicken stock", "4 tablespoons butter", "3 cloves garlic, peeled and chopped", "2 tablespoons fennel seeds", "3 tablespoons vegetable oil", "4 pork chops", "2 large red onions, peeled and finely sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, heat the 2 tablespoons of oil over medium-low heat and add the onion.  Cook, stirring occasionally, until sweet and caramelized, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, combine the fennel, stock, butter, garlic, fennel seeds, and a pinch of salt and pepper in a large shallow pan.  Bring to a boil and simmer, covered, for 10 minutes.  Remove the cover and continue cooking until the fennel is mostly soft but not mushy and the liquid is mostly evaporated.  Adjust for seasoning to taste.  To finish cooking, turn the heat to medium-high and cook off the remaining liquid, allowing the fennel to brown a little bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>. In a third skillet, heat the remaining tablespoon of oil.  Season the pork chops and cook to desired doneness, depending on thickness, 3 to 5 minutes per side on medium-high.  Remove the chops to rest, and add a splash of water to deglaze the pan.  Pour the pan drippings into the fennel mixture.  Serve the chops on a bed of fennel, topped with the onions.</p>"}]}