{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/ctb-asiangrill.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Corinne Trang", "salmon", "sushi", "The Asian Grill"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Wild Salmon Sushi Rolls", "link": "https://www.seriouseats.com/recipes/2009/04/grilled-wild-salmon-sushi-rolls.html", "description": "I love sushi but not everyone else does. Corinne Trang's recipe for Grilled Wild Salmon Sushi Rolls from The Asian Grill is a great way to introduce Japanese flavors to those who might be a little squeamish around raw fish....", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Cook the Book", "Salmon"], "recipeIngredient": ["Vegetable oil for grilling", "1 pound Alaskan wild salmon fillets, skin on, steaks, or tuna steaks", "1 1/4 cups soy sauce", "2 cups short- or medium-grain sushi rice", "4 tablespoons rice vinegar, plus more for forming rice", "4 tablespoons sugar", "1/4 cup wasabi powder", "2 tablespoons spring or filtered water", "6 sheets nori", "18 fresh purple or green shiso leaves", "1 small seedless cucumber, julienned", "1 cup clover sprouts or arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush oil on the skin of the salmon and place the fillet skin side down on a plate.  Brush with some of the soy sauce on the flesh side.  Refrigerate for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot, combine the rice and water to cover.  Stir to level.  Cover the pot and cook over medium-low heat until the rice has absorbed all of the water, about 20 minutes.  Turn off the heat and fluff the rice with a spoon.  Allow to rest, covered, for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small bowl, whisk together the 4 tablespoons rice vinegar and the sugar until the sugar has completely dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cooked rice to a Japanese round wooden rice container and spread it out in a thin layer.  While fanning (using a traditional bamboo paddle, a hand held fan, a card, or anything that works) the rice to cool it, work in the vinegar mixture.  Moisten hands with rice vinegar to keep the rice from sticking to them while dividing it into 6 equal portions.  Let stand at room temperature, covered with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare an indirect fire in a charcoal or gas grill.  Grill the salmon, skin side down, on the cooler side of the grill until the skin is golden and crisp, about 5 minutes.  Meanwhile, brush some oil on the flesh side.  Turn and grill on the other side for 3 minutes more. Transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the wasabi powder and 2 tablespoons water until well combined. The wasabi should not stick to your hands when rolled into a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover a bamboo sushi mat with a layer of plastic wrap.  (This will help keep the mat clean and make it easier to remove the sushi roll.)  Place a sheet of nori on top of the covered mat, shiny side down.  Take 1 portion of rice and spread it evenly over two-thirds of the nori sheet closest to you. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, smear a thin layer of wasabi paste in a single line along the width of the roll. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, overlap 3 shiso leaves on top, then some cucumber and sprouts.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finally, flake about 2 tablespoons of salmon with skin and add it across the top. Using the bamboo mat, grab hold of the thick end of the roll and roll it over the ingredients tightly. The last third of the nori sheet should be left.  Roll the ingredients all the way to the end of the nori sheet.  Remove each nori roll from the plastic and cut crosswise into 6 equal pieces.  Serve with soy sauce and wasabi paste on the side.</p>"}]}