{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091225-nigellaxmas-thumb.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "baking", "Cookies", "decorations", "desserts", "holiday baking", "Nigella Christmas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Edible Christmas Tree Decorations", "link": "https://www.seriouseats.com/recipes/2009/12/edible-christmas-tree-decorations-cookies-recipe.html", "description": "These <strong>Edible Christmas Decorations</strong> from <a href=\"http://www.nigella.com\">Nigella Lawson's</a> <strong><em><a href=\"http://www.amazon.com/Nigella-Christmas-Family-Friends-Festivities/dp/14013233671/serieats-20\">Nigella Christmas</a></em></strong> are another sweet way to (pardon the pun) spruce up your tree.  They also make wonderful additions to any tin of cookies since they serve two purposes: to be tasty and look festive on a tree.", "totalTime": null, "recipeYield": "approximately 35 to 40", "recipeCategory": ["Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the cookies:</strong>", "2 cups all-purpose flour, plus more for dusting", "Pinch of salt", "1 teaspoon baking powder", "1 teaspoon cinnamon", "1/4 teaspoon ground cloves", "1-2 teaspoons freshly ground black pepper", "1 stick (8 tablespoons) soft butter", "1/2 cup packed dark brown sugar", "2 large eggs beaten with 1/4 cup runny honey", "<strong>For the icing and trimmings:</strong>", "2 cups confectioners' sugar", "2 tablespoons meringue powder", "Edible gold or silver sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, salt, baking powder, cinnamon, cloves and pepper in a food processor and, with the motor on, add the butter and sugar, then, slowly, the beaten eggs and honey, through the feed tube, though don't use all of this liquid if the pastry has come together before it's used up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form two fat discs and put one, covered in plastic wrap or in a resealable bag, in the refrigerator while you get started on the other.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F and line two cookie sheets with parchment paper.  Then dust a work surface with flour, roll out the disc, also floured, to about 1/4 inch, and cut out your Christmas decorations with cutters of your choice, which could include fir-tree shapes, angels, stars, snowflakes, and so on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Re-roll and cut out some more, setting aside the dough scraps from thus first disc, well covered, while you get on with rolling out the second.  When you've got both sets of leftover clumps of dough, roll out and cut out again, and keep doing so till all the dough's used up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now take a small piping nozzle and use the pointy end to cut out a hole just below the top of each cookie (through which the ribbon can be later threaded). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the pastry shapes on the lined cookie sheets and bake for about 20 minutes: it's hard to see when they're baked, but you can feel; if the underside is no longer doughy, they're ready. Transfer to a wire rack and leave to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together the confectioners' sugar with the meringue powder and 3 tablespoons water, beating it until it's thick enough to be able to cover the cookies with a just-dripping blanket of white.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully ice the cold decorations, using a teaspoon (the tip for dripping, the back for smoothing), and scatter sparkles for sprinkles as you like.  When the icing is set, thread the ribbon through the holes and hang on your tree.</p>"}]}