{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090622farmersmarketcookbook.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Korean", "keywords": ["beef", "cabbage", "Cook the Book", "JoAnn Cianciulli", "Korean", "L.A.'s Original Farmer's Market Cookbook", "short ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Kalbi with Korean Slaw", "link": "https://www.seriouseats.com/recipes/2009/06/la-korea-kalbi-with-korean-slaw-recipe.html", "description": "If you are anything like me, food shopping makes you hungry. I've tried eating before I go to the market but I invariably get hungry halfway through my trip. In a prefect world I would be able to do some...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Cabbage", "Cook the Book", "Korean"], "recipeIngredient": ["1 large onion, quartered", "6 garlic cloves, coarsely chopped", "1 cup sugar", "2 teaspoons ground black pepper", "1 cup soy sauce", "1/2 cup dry red wine such as Merlot", "2 tablespoons sesame oil", "4 pounds Korean-cut bone-in beef short ribs (see <a href=\"#note\">Note</a>)", "Vegetable oil for brushing", "1 teaspoon toasted sesame seeds", "Korean Slaw (<a href=\"#slaw\">recipe follows</a>)", "Cooked white rice for serving ", "1/4 head red cabbage, cored and cut cross-wise into shreds", "1 head green cabbage, cored, quartered, and cut into shreds", "1 carrot, grated", "3 tablespoons canola oil", "1 tablespoon sesame oil", "1 cup white vinegar", "2 tablespoons sugar", "2 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the onion and garlic in a food processor and pulse until finely chopped.  Transfer the mixture to a large bowl. Add the sugar, pepper, soy sauce, wine and sesame oil. Stir to combine and dissolve the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the ribs in a large plastic bag, pour in the marinade, squeeze out any air, and seal closed. Marinate in the refrigerator for at least 1 hour or up to overnight, turning the bag a couple of times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large grill pan on two burners over medium-high heat, prepare a fire in a charcoal grill, or preheat a gas grill to medium-high.  (You can also use your oven broiler.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ribs from the marinade. Brush the grill grates lightly with the oil. Place the ribs on the grill meaty-side down and cook, turning as needed, until well browned but still pink inside, about 5 minutes total. Set the ribs aside to rest for 5 minutes. Sprinkle with the sesame seeds. Serve with the Korean Slaw and white rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"note\"></a><strong>Ingredient Note on Short Ribs:</strong> Korean-style short ribs, also known as flanken or crosscut, are sliced crosswise across the bones instead of between the ribs. You end up with a strip of meat about 8 inches long that has 3 slivers of rib bones lining the bottom. This cut not only helps the meat to absorb the marinade but also makes eating easier, especially with chopsticks. Korean-style short ribs can be found at most butchers and Asian markets. If not available, butterfly the meat by slicing each rib lengthwise almost to the bone and opening it up like a book.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Korean Slaw</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the red cabbage in a bowl of cold water for 30 minutes to draw out some if the color so it doesn't bleed into the slaw.  Drain, dry well, and put into a large bowl.  Add the green cabbage and carrot; toss with your hands to combine. Drizzle in both oils, tossing well to coat the vegetables. Combine the vinegar, sugar, and salt in a bottle or jar and shake to blend well. Pour the vinegar mixture over the slaw and toss to combine.</p>"}]}