{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091103BlackBeans.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["beans", "black beans", "chorizo", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Meat Lite: Black Beans and Rice, My Way", "link": "https://www.seriouseats.com/recipes/2009/11/meat-lite-black-beans-rice-my-way-recipe-dry.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. I love beans, but the perfectly cooked legume...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beans and Pulses", "Meat Lite", "Rice"], "recipeIngredient": ["1 cup dried black beans (3 cups cooked)", "1 two-ounce link chorizo, diced", "1/2 onion, coarsely chopped", "2 large jalapeños, coarsely chopped", "1 poblano chile, coarsely chopped", "4 garlic cloves", "2 tablespoons vegetable oil", "1 1/4 teaspoon salt, divided", "1 tablespoon cumin", "1 cup white rice", "1/4 cup chopped cilantro leaves", "1 lime, juiced", "Chopped red onion, for garnish, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 250°F. Place the beans and the chorizo in a Dutch oven and cover the beans with cold water by about 2 inches. Bring to a rolling boil, cover, and transfer to the oven. How long the beans will take depends a lot upon their age. Taste them after an hour, and every 20 minutes after that. (Yesterday, my beans took about an hour.) When they taste done, put the pot back in the oven, kill the heat, and let them cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans, reserving the cooking liquid. Pulse the onion, jalapenos, poblanos, and garlic in a food processor until finely minced. Heat the oil over medium-high in a large sauce pan, and add the minced vegetables, salt, and cumin. Cook, stirring often, until the vegetables soften somewhat, about 5 minutes. Add the cooked beans, cilantro, and 2 cups of the reserved cooking liquid. Bring to a boil, reduce to a simmer. Simmer uncovered, stirring occasionally while you cook the rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 1 1/2 cups water and 1/2 teaspoon salt to a boil; add the rice, reduce heat to low, and cook, covered, for 15 minutes. Remove from heat and let stand for 5 minutes more. Fluff with a fork and then spoon some rice into each bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the beans from the heat and stir in the lime juice. Spoon over the rice and top with the chopped red onion and serve.</p>"}]}