{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091208-nastybits-garlicshallots.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Fergus Henderson", "garlic", "Julia Child", "rabbit", "soups", "stews", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Rabbit and Garlic Soup", "link": "https://www.seriouseats.com/recipes/2009/12/the-nasty-bits-rabbit-stew-garlic-soup-recipe.html", "description": "[Photographs: Greg Takayama] While there's nothing particularly nasty about rabbits, many eaters are discouraged by the idea of cooking that which you can buy at a pet store. Every time I remove rabbits from their packaging, I'm struck by the...", "totalTime": "", "recipeYield": "ten to twelve", "recipeCategory": ["Garlic", "Other Meats", "Soups and Stews", "The Nasty Bits"], "recipeIngredient": ["¼ cup olive oil", "2 rabbits, chopped into sections", "sea salt and ground pepper", "2/3 pound smoked bacon, cut into 2-inch chunks", "24 shallots, whole", "80 garlic cloves, skin on", "1 1/3 cups dry sherry", "2 1/2 cups white wine", "1 quart chicken stock", "2 bay leaves", "bundle of parsley and thyme ", "For the emulsion:", "3 eggs, separated into yolks and whites", "3 to 4 tablespoons olive oil for the emulsion", "additional olive oil for pan-frying the egg whites", "a strainer", "rounds of toasted bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse and dry the rabbit pieces; sprinkle salt and pepper to taste.  Heat the olive oil over medium heat in a dutch oven.  Add the rabbit pieces, browning on both sides.  Remove the rabbit from the pot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bacon and shallots, allowing to the shallots to sweat for 10 minutes in the fat.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the rabbit to the pot and add the garlic, sherry, wine, stock, bay leaves, and herbs.  Bring to boil; then reduce to a simmer.       </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, preheat the oven to 350 to 375 F.  Place a lid, not completely closed but slightly askew, on the pot.  Place the pot in the oven for 1 ½ hours, or until the rabbit is tender.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the rabbit cool in the broth to prevent its flesh from drying out.  Remove the pieces of rabbit and de-bone, setting aside the most tender sections for the soup.  Strain the soup through a fine mesh sieve, pressing down on the garlic and shallots to extract all of the flavor.   Set aside, keeping the broth piping hot over low heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, make the emulsion:  Beat the egg yolks in a bowl for a minute until they are thick and sticky.  Drop by drop, beat in the olive oil.  Set aside.  The emulsion may be kept at room temperature for an hour while the rest of the soup is being assembled.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a pan with a few more tablespoons of olive oil; add the egg whites and let fry for a minute or two on each side, until the surface is nicely browned.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the soup:  Just before serving, beat a ladleful of the hot rabbit broth into the egg mixture by droplets.  Gradually add the rest.  The thickness and flavor of the soup will vary according to how much broth you add to the egg yolks; taste frequently and stop adding broth when you settle upon a thickness you like.  Serve the thickened broth in bowls, nestled with the shredded rabbit meat, the egg whites, and toasted rounds of bread.  </p>"}]}