{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090430Gougeres.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French", "French in a Flash", "gougeres", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Parmesan and Gruyère Gougères with Jambon de Bayonne, Arugula, and Dijon-Chive Butter", "link": "https://www.seriouseats.com/recipes/2009/04/french-in-a-flash-parmesan-and-gruyere-gouger.html", "description": "\"Sometimes revenge isn't sweet: It's very, very savory.\" I like nothing better than a picnic. I like eating outside so much that, I admit, I sit outside on park benches munching sandwiches through trembling fingers all winter long. But when...", "totalTime": "", "recipeYield": "8-10 sandwiches", "recipeCategory": ["French", "Sandwiches"], "recipeIngredient": ["8-10 Parmesan and Gruyère Gougères (recipe follows)", "Dijon-Chive Butter (recipe follows)", "8-10 thin slices of Jambon de Bayonne, Proscuitto di Parma, or Serrano Ham", "1 cup of baby arugula leaves", "20 chives, halved", "1 stick butter", "1 cup water", "1 cup flour", "1 teaspoon sugar", "3/4 teaspoon salt", "3 large eggs", "3 ounces shredded gruyère (about 1 1/2 cups), plus extra for topping the gougères", "1 ounce shredded Parmagiano Reggiano (about 1/2 cup), plus extra for topping the gougères", "Coarsely cracked black pepper", "8 chives, snipped", "3 tablespoons butter, room temperature", "1/2 teaspoon Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the gougères are mostly cool, but still just a bit warm, slice them in half horizontally, revealing the air-pocket within.  Spread each half lightly with the Dijon-Chive butter.  Place one folded slice of ham on the bottom of each gougère, and top with a small handful of baby arugula leaves and chive halves.  Place the gougère lid on top, and <em>voila</em>, your perfect ham and cheese sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Parmesan and Gruyère Gougères</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-makes 8-10 gougères-</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make pâte à choux, or choux pastry, place the stick of butter and the cup of water in a medium sauce pot and put the lid on it.  Bring to a boil.  Take the pot off the heat, then add the salt, sugar, and flour all at once, and stir vigorously with a wooden spoon until the flour is absorbed into the butter-water mixture.  Lower the heat to medium-low, and return the pan to the heat, stirring the dough continuously for about 30-60 seconds, until the dough comes away from the sides of the pot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the dough out of the pot and into a large mixing bowl.  Let stand and cool for about 3 minutes.  Then add one egg at a time, and use a hand mixer to incorporate the eggs into the dough.  At the very end, add in 3 ounces of Gruyère and 1 once of Parmesan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use an ice cream scoop to mound the gougères onto a parchment-lined baking or cookie sheet.  You should end up with 8-10 gougères, depending on your scoop.  Then top with the remaining Gruyère and Parmesan, and sprinkle with just a touch of coarse cracked black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the gougères at 400&deg;F for 10 minutes.  Then lower the heat to 350&deg;F and bake another 35-40 minutes, until they are golden, puffed, and hard to the touch.  You don't want to take them out too early--if you have to return them to the oven, chances are, they'll deflate a bit.  Place the gougères on a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Dijon-Chive Butter</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir everything together until combined.</p>"}]}