{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090601-figs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Cory Schreiber", "desserts", "figs", "galette dough", "galettes", "honey", "Julie Richardson", "pastry doughs", "Rustic Fruit Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fig and Honey Cream Galette", "link": "https://www.seriouseats.com/recipes/2009/06/fig-and-honey-cream-galette-dough-recipe.html", "description": "This recipe for a <strong>Fig and Honey Galette</strong> is adapted from <strong><em><a href=\"http://www.amazon.com/Rustic-Fruit-Desserts-Crumbles-Pandowdies/dp/1580089763/?tag=serieats-20\">Rustic Fruit Desserts</a></em> by <a href=\"http://www.bakerandspicebakery.com/team.php\">Julie Richardson</a> and  <a href=\"http://wildwoodrestaurant.com/cory.htm\">Cory Schreiber</a>.</strong>  A galette is basically a rustic pie, minus the pie pan. All you have to do is roll out the crust, add the filling, fold the edges over, and bake until the crust is golden brown.", "totalTime": null, "recipeYield": "8 to 10", "recipeCategory": ["Cook the Book", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 recipe Galette Dough (below)", "<strong>For the pastry cream:</strong>", "Seeds scraped from 1/2 vanilla bean", "3/4 cup half-and-half", "2 egg yolks", "1/4 cup honey", "2 tablespoons granulated sugar", "1/4 teaspoon fine sea salt", "1 1/2 tablespoons cornstarch", "2 tablespoons unsalted butter", "8 to 10 large figs, stemmed and quartered", "2 tablespoons granulated sugar", "Creme fraiche, for serving ", "1 3/4 cups (8 3/4 ounces) all-purpose flour", "1 tablespoon granulated sugar", "3/4 teaspoon fine sea salt", "3/4 (6 ounces) cold unsalted butter", "3 tablespoons ice water, or more as needed", "1 teaspoon freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pastry cream, put the vanilla bean seeds into a sauce pan.  Add the half-and-half and vanilla bean pod and cook over medium heat until hot, but not boiling.  Separately, whisk the egg yolks, honey, sugar, and salt together in a bowl and continue whisking until slightly thickened and lighter in color.  Add the cornstarch and whisk until combined.  Slowly pour half of the hot liquid into the yolk mixture, stirring constantly until well blended.  Pour the yolk mixture back into the sauce pan and cook over medium heat, until the mixture begins to thicken and bubble.  Strain the mixture through a fine-mesh sieve, then whisk in the butter.  Discard the vanilla bean pod.  Stir occasionally until cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper or grease it generously with cooking spray.  Roll the dough into a 13-to 14-inch circle, then transfer to the prepared baking sheet.  It should overhang the sheet a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the cooled pastry cream over the dough, leaving a 2-inch border around the edge.  Arrange the fig quarters in a circular pattern, skin side down and stem end facing into the center, again leaving a 2-inch border around the edge.  Sprinkle the sugar over the figs.  Fold the outer edge of the dough over the outermost figs, pleating the dough as necessary.  Put the galette in the refrigerator for 1 hour to chill and relax the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position an oven rack in the lower third of the oven and preheat the oven to 375&deg F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the galette in the bottom third of the oven for 50 to 60 minutes.  Cool for 30 minutes before serving, topped with a dollop of creme fraiche.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage:</strong> Covered with a tea towel, this galette will keep at room temperature for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Galette Dough</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes one 10-inch galette crust -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, sugar, and slat into a bowl, stir to combine, then put the bowl in the freezer for about 10 minutes, until super cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the butter into 1/2-inch cubes, then add it to the flour mixture and toss until each cube of butter is coated with the flour mixture.  Cut the butter into the flour using a pastry blender, food processor, electric mixer, or your hands, just until the ingredients become coarse and crumbly and the butter is slightly smaller than a pea.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the water and lemon juice together, then drizzle over the dough, tossing with a fork to distribute the liquid.  The pastry will be shaggy but should hold together when squeezed in the palm of your hand; if not, add an additional teaspoon or two of ice water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump the pastry onto a lightly floured work surface and press down on the dough, folding it over on itself a few times until it holds together.  Try not to handle it too much or it will get warm and may become over developed.  Flatten the pastry out into a disk approximately 1 inch thick.  Wrap in plastic wrap and chill for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage:</strong> If wrapped well, the disk will keep for 3 days in the refrigerator, or up to 3 months in the freezer.  Defrost the frozen dough in the refrigerator over night.</p>"}]}