{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["alcohol", "Andy Pforzheimer", "Bloody Marys", "cocktails", "Cook the Book", "Sasa Mahr-Batuz", "The Barcelona Cookbook", "vodka"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Gazpacho Borracho", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-gazpacho-borracho-vodka-cocktail-recipe.html", "description": "Aside from a year of Spanish classes in high school, all of my knowledge of the Spanish language has come from working in restaurants. I can't carry on a basic conversation, but I can dissect a menu like a champ....", "totalTime": null, "recipeYield": "1", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["Freshly ground black pepper", "6 tablespoons Barcelona Gazpacho (recipe follows) or other tomato-based gazpacho", "", "Dash of Tabasco sauce", "1 rib celery or 1 slice cucumber for garnish", "<strong>For the soup:</strong>", "3 pounds very ripe tomatoes, cored and chopped", "2 red bell peppers, seeded, cored, and coarsely chopped", "1 English cucumber, peeled, seeded and coarsely chopped", "1/2 cup extra virgin olive oil", "6 cloves garlic, coarsely chopped", "1/2 day-old round loaf Italian bread, crust removed and bread cut into 1-inch cubes (about 4 cups)", "1/4 cup sherry vinegar, or more to taste", "1 teaspoon ground cumin", "1/4 teaspoon ground cayenne ", "1/2 teaspoon kosher salt, or more to taste", "Freshly ground black pepper", "4 cups tomato juice", "<strong>For the garnish:</strong>", "1/4 day-old round loaf Italian bread, crust removed and bread cut into 1-inch cubes (about 2 cups) ", "3/4 cup extra virgin olive oil, plus about 2 tablespoons for drizzling", "4 scallions, both white and green parts, thinly sliced", "1 red bell pepper, seeded, cored, and cut into 1/2-inch dice", "1 green bell pepper, seeded, cored, and cut into 1/2-inch dice", "1/2 English cucumber, seeded, and cut into 1/2-inch dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill an 8-ounce highball glass with ice and sprinkle with pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the gazpacho and vodka into a shaker filled with ice.  Add the Tabasco and shake 10 to 12 times.  Strain into the glass, garnish with celery or cucumber, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Barcelona Gazpacho</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- serves 4 to 6 -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the soup: In a large mixing bowl, combine the tomatoes, peppers, and cucumber. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saute pan, heat the olive oil and garlic over medium heat and bring to a simmer.  Simmer very gently for about 15 minutes, or until the garlic is browned and tender.  Transfer to the mixing bowl and add the bread cubes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the ingredients together and then add the vinegar, cumin, cayenne, and salt.  Season with black pepper and set aside for about 1 hour to marinate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches, blend the marinated vegetable and bread mixture in a blender or a food processor fitted with the metal blade until pureed.  Transfer the puree to a large bowl and continue until it is all pureed.  If it is too dry, add a few tablespoons of tomato juice to thin it out to suit your taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain into another bowl and then stir in the tomato juice.  Taste the soup and adjust the seasonings with salt and vinegar if needed.  Cover and refrigerate in a container with a thigh-fitting lid for up to three days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the garnish: Preheat the oven to 425&deg F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the bread cubes in a medium bowl and pour the olive oil over them.  Toss to mix so that the bread absorbs the olive oil and spread the bread cubes in a single layer on a jelly-roll or similar baking pan and bake for about 4 minutes.  Rotate the pan, turn the croutons over, and continue baking for about 4 minutes longer, or until they are golden brown and crisp.  When done, let the croutons cool on a baking sheet.  These will keep in a tightly lidded container for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle 1 1/2 to 2 cups of the soup into each chilled soup bowl.  Garnish each with about 1 1/2 tablespoons of the scallions, peppers, and cucumber.  Top with about 2 tablespoons of croutons and a drizzle of olive oil.  Serve immediately.   </p>"}]}