{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/feat-lunarnewyear.jpg", "author": {"@type": "Person", "name": "Tam Ngo"}, "recipeCuisine": "Vietnamese", "keywords": ["Asian", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Banh Chung for Lunar New Year", "link": "https://www.seriouseats.com/recipes/2009/01/banh-chung-recipe-lunar-new-years-rice-cakes-vietnamese.html", "description": "In areas with a sizable Vietnamese community, you can find <strong>banh chung</strong> around Lunar New Year. Stacked in neat bricks, sometimes even warm, the sign of a good banh chung is one that's meaty, hefty, and tightly rolled. Here's a recipe and how-to.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Lunar New Year", "Rice", "Vietnamese"], "recipeIngredient": ["5 1/4 cups long-grain sticky rice (soaked overnight and drained before assembly)", "1 14-ounce cans of coconut juice (not coconut cream)", "1 1/2 tablespoon sea salt", "Cold water", "2 2/3 cup dried, hulled, and split yellow mung beans (soaked overnight and drained before assembly)", "cold water", "1 1/4 pounds boneless pork chop (or pork butt), with some skin and fat ", "1 medium-sized Vidalia or Spanish onion, minced", "3 tablespoons of sea salt", "3 teaspoons black pepper, freshly ground", "1 tablespoon sugar", "1 tablespoon canola oil or other neutral oil (if frying cakes)", "Serve with the following: ", "Pickled Shallots (recipe follows)", "<h5>Ready the Ingredients (The Night Before)</h5>", "<strong>1. </strong>Soak the bamboo leaves, placing them in a large roasting pan and adding water to cover. Put a plate on top of the leaves to keep them submerged. ", "<strong>2. </strong>Cut the pork into pieces the size of a deck of cards (3-inches long, 2-inches wide, and 1/2-inch thick). Each piece should have some fat and skin. Add the onion, fish sauce, pepper, and pork to a bowl and mix well. Let marinate overnig", "<strong>3. </strong>Soak the rice in coconut juice and let it sit for a 1/2 hour. Then, cover it with three inches of water and let it sit overnight.", "<strong>4. </strong>Place the mung beans in a bowl and rinse under cold water until the water is clear. Drain, then add enough cold water to cover beans by 1 inch. Let soak overnight.", "<img alt=\"20090123-leaves.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090123-leaves.jpg\" width=\"500\" height=\"329\" /><p class=\"caption\">Metal frames, bamboo leaves, and banana leaves.</p>", "<h5>Ready the Ingredients (The Morning of Assembly)</h5>", "<strong>5. </strong>Drain the mung beans. Fill the Chinese steamer bottom halfway with water. (If the tray holes are larger than 3/16-inch in diameter, line the tray with parchment paper and leave a few holes uncovered for heat circulation.) Bring to a ro", "Put mung beans in the steamer tray and spread them out evenly. Place the tray in the steamer of boiling water and cover. Steam for about 8 minutes, or until the mung beans are tender. Remove the tray from the steamer bottom and set aside until the beans c", "<strong>6. </strong>Process the cooled beans in a food processor until it reaches a fluffy consistency. It should look like fine cornmeal but should hold together when you pinch a small bit between your fingers. At this point, the ground beans are ready t", "<strong>7. </strong>Drain the rice in a colander and return it to the bowl. Gradually mix in the salt, sprinkling it over the rice and using your hands to distribute it well.", "<strong>8. </strong>Drain the bamboo leaves, rinse, and set aside. ", "<strong>9. </strong>If you are using frozen banana leaves, defrost them by soaking them in hot water and rinsing thoroughly. Pat them dry and cut them into sheets of 5\" x 12\". Set aside.", "<h5>Assemble and Boil the Cakes</h5>", "<strong>10. </strong>To make each cake, put a 12\" x 18\" inch sheet of heavy duty aluminum foil on your work surface, with the shortest side closest to you. Place the mold on the center of the foil. You will need 4 bamboo leaves to form the frame—the cor", "<strong>11. </strong>Next, line the interior of the mold with banana leaves, shiny side up and facing you. (This allows the green of the banana leaves to dye the rice while cooking). Place a banana leaf so that one of its shortest sides lays flush with th", "<img alt=\"20090123-scooping.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090123-scooping.jpg\" width=\"500\" height=\"224\" /><p class=\"caption\">Layering the ingredients inside the leaf and metal frame.</p>", "<strong>12. </strong>To add the edible ingredients, first scoop up 1 cup of the prepared rice and pour it into the mold. Use the back of a large spoon to distribute the rice evenly, taking care to push the rice all the way to the inner edges of the mold. ", "<img alt=\"20090123-alhands.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090123-alhands.jpg\" width=\"500\" height=\"338\" /><p class=\"caption\">Wrapping banh chung.</p>", "<strong>14. </strong>Repeat steps 10 through 13 for the remaining 3 cakes. (Save any leftover rice and steam it as you prefer.)", "<img alt=\"20090123-rawbanhchung.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090123-rawbanhchung.jpg\" width=\"500\" height=\"335\" /><p class=\"caption\">Banh chung before cooking.</p>", "<strong>15. </strong>Fill a 12-quart stockpot half full with water. Place the cakes in the pot, stacking, and/or standing them up. Add enough water to cover the cakes. To keep the cakes from floating, place a heavy ceramic plate on top to gently weigh the", "To maintain a gentle boil, keep a separate kettle of boiling water on the stove to replenish the stockpot as needed; it is okay if the water drops to an occasional simmer. When the cakes no longer float (about 3 hours into cooking), remove the ceramic pla", "<strong>16. </strong>After the seven hours, use tongs to transfer the cooked cakes to a pot of cold water. Once they are cool, transfer the cakes to a baking sheet, placing the seam-free, neater-looking, square side down. Put another baking sheet on top o", "<img alt=\"20090123-cookedbanhchung.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090123-cookedbanhchung.jpg\" width=\"500\" height=\"186\" /><p class=\"caption\">Banh chung after cooking.</p>", "<h5>Serve the Cakes</h5>", "<strong>18. </strong>There are three ways to enjoy banh chung: soft, which allows you to fully appreciate the pale green color and subtle tea flavor of the banana leaf; fried into chewy crispiness; or grilled, which reduces the use of oil and creates a ge", "<strong>To cut and serve the cake soft:</strong> ", "First, undo the plastic wrap and keep it spread out underneath the cake. Remove and discard the bamboo leaves (but keep the banana leaves intact). Return the cake to the plastic wrap, open side up (as it was when you were assembling the cake). Peel off th", "Cut the cake into 8 equal triangular wedges (think of an asterisk). Because a knife drags through the sticky rice and yanks out the prized morsels within, twine is best for cutting through the cake. Cut 4 lengths of twine about 20-inches long and arrange ", "<strong>To cut a cold cake and serve it soft:</strong>", "If the cake is firm from refrigeration, unwrap the plastic wrap and bamboo leaves. With a knife, cut an asterisk pattern through the banana leaves and cake. Microwave the pieces until soft and serve.", "<strong>To fry and serve a cake:</strong>", "Nicely cut wedges are not necessary if you are frying the cake. Use a knife to quarter the cake, then cut each quarter into 1/2-inch thick slices. ", "In a 10-inch non-stick skillet, heat 1 tablespoon of oil over medium heat. Add half of the slices and fry, undisturbed, for about 6 minutes (or until the rice has softened). Use a spatula to press and mash the chunks to form a large pancake. Then, continu", "Flick the pancake with a quick and confident jerk of the skillet handle (or slide the pancake onto a plate and then invert the pancake back into the skillet). Increase the heat to medium-high and fry the second side for about 4 minutes (or until crispy an", "Slide the pancake onto a plate, cut into wedges, and serve. Repeat with the remaining slices to make a second pancake.", "<strong>To grill a cake:</strong>", "Nicely cut wedges are not necessary if you are grilling the cake. Use a knife to quarter the cake, then cut each quarter into 1/2-inch thick slices. ", "Lightly brush or spray the broader surfaces of the cake with enough oil to keep them from sticking to the grill. A charcoal grill or propane grill will give the cakes a light and even crust. ", "<h5>Note:</h5>", "To refresh a thawed banh chung, bring it to room temperature. Rewrap it in foil and tie it with twine as you did with the original assembly. Boil the cake in a large pot of water for 1 hour, adding water as needed to keep the cake submerged. Remove the ca", "<h4>Wooden Frame</h4>", "<h4>Pickled Shallots</h4>", "<em>- makes about 2 cups -</em>", "Lovely to look at, these rosy shallots are also wonderful to eat. Their tanginess and mild bite cut the richness of foods like beef or pork kho. These shallots are a must for Tet celebrations.", "Use small shallots that are each no larger than 1-inch in diameter. They should be firm and without sprouts or mold. If shallots are not available, red pearl onions may be substituted.", "<h5>Ingredients:</h5>", "10 ounces (about 2 cups) small shallots, unpeeled", "boiling water", "2 tablespoons salt, dissolved in 1 cup water", "1/2 cup sugar", "1 cup distilled white vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the shallots in a small heatproof bowl and cover them with boiling water. Let stand for 2 to 3 minutes, during which the skins will loosen and wrinkle. Pour off the hot water and add cold water to cool the shallots quickly. Drain shallots in a colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the peeled shallots to the bowl and pour in the salt solution. There should be enough for the shallots to float a bit. Let them stand overnight or up to 24 hours to remove some of their harshness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Under cold running water, drain and rinse the shallots well. In a small saucepan, combine the sugar and vinegar and bring to a rolling boil. Stir occasionally until the sugar has dissolved. Add the shallots. When the liquid returns to a simmer, immediately remove the pan from heat. Use a slotted spoon to transfer the shallots to a 1-pint jar. Pour in the hot vinegar solution and fill to the rim. Set aside to cool uncovered. Then, cover and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the shallots to mature 5 days before serving. They will keep refrigerated for several weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Related</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://holybasil.wordpress.com/2008/02/03/banh-ch%C6%B0ng-vietnamese-new-year-cake/\">Holy Basil Takes on Banh Chung, Step-by-Step</a> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.epicurious.com/recipes/food/views/Vietnamese-Rice-Cakes-in-Banana-Leaves-233845\">Banh Chung Recipe by Mai Pham</a></p>"}]}