{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090323-honey.jpg", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["Cook the Book", "honey", "pork", "Sheila Lukins", "spareribs", "Ten"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Honey Spareribs", "link": "https://www.seriouseats.com/recipes/2009/03/cook-the-book-honey-spareribs.html", "description": "&copy;iStockphoto.com/ivanmateev \"I love ribs and ribs love me.\" That was the opening line for the best song about ribs I've ever heard, penned by a younger yours truly along with a vegetarian friend. You might wonder what kind of...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 racks pork spareribs (each 3 to 4 pounds), partially split by the butcher; or 2 racks baby back ribs (each about 2 pounds)", "Coarse (kosher) salt and freshly ground black pepper, to taste", "2 cups honey", "3 scallions (white bulbs and 3 inches green), thinly sliced, for garnish", "Maldon (flaky) sea salt or coarse (kosher) salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the rack of ribs, meaty side up, in a large baking pan, and sprinkle them generously with salt and pepper. Bake for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and brush 1/2 cup of the honey over the ribs. Bake for 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain any cooking liquid from the pan. Brush the ribs with another 1/2 cup of the honey and bake until the ribs are cooked through and browned and glistening, 15 minutes. Then remove the pan from the oven and let the ribs cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ribs on a cutting board and  cut them apart, slicing between the bones. Arrange them on a platter, and sprinkle the scallions over them. Pour the remaining 1 cup honey into a bowl and serve it with the ribs, along with a bowl of the sea salt, for sprinkling.</p>"}]}