{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090428-mark-miller-tacos.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chiles", "Cook the Book", "eggs", "Mark Miller", "Mexican", "potatoes", "spicy", "taco", "tacos", "Tacos by Mark Miller"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Potatoes with Chile Rajas and Scrambled Eggs", "link": "https://www.seriouseats.com/recipes/2009/04/potatoes-with-chile-rajas-and-scrambled-eggs-recipe.html", "description": "This recipe for potatoes with chile rajas and scrambled eggs from Mark Miller's Tacos is my idea of the perfect breakfast. In fact, I make a variation of potato and egg tacos at least once a week for a quick...", "totalTime": "", "recipeYield": "12 tacos", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 large poblano chiles, oil-roasted, peeled, cored and seeded (see note)", "2 serrano chiles, oil-roasted, peeled, cored, and seeded (see note)", "1 1/2 cups clarified unsalted butter", "1/2 cup vegetable oil", "1 1/2 pounds small Yukon gold potatoes (with skin), cut into 1/4-inch dice", "1 white onion, cut into 1/4-inch dice", "1 teaspoon green chile powder", "1/2 teaspoon kosher salt", "12 large eggs ", "4 tablespoons unsalted butter, melted", "12 (5 1/2 -inch) soft white corn tortillas, for serving", "Garnish: chopped green onions (green part only) or chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the prepared poblano and serrano chiles into 1/4-inch strips (rajas); set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have a bowl lined with paper towels ready.  In a large, heavy bottomed pot, add 1 1/2 cups clarified butter plus the 1/2 cup vegetable oil and heat over medium-high heat until it reaches 350&deg;F on a deep-fat thermometer. Add the potatoes and fry until golden, stirring them once or twice, about 12 minutes (they will lose about one-third of their volume). The temperature will drop when you add the potatoes; when it returns to 350&deg;F, decrease the heat slightly. Be careful no to burn the potatoes or the oil&mdash;the butter-oil mixture should show small, not large, bubbles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes fry, in a skillet, heat the remaining 2 tablespoons clarified butter over low heat and saute the diced onion until it begins to caramelize, about 10 minutes. When the onion is fully cooked, increase the heat to medium-high and cook a little more to brown the pieces.  When the potatoes are done, transfer them to the paper towel-lined bowl to drain off any excess oil. When they are drained, but still hot, transfer to a serving bowl, dust with chile powder and salt, then add the cooked onions and poblano and serrano chile strips and toss to mix all together; keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, lay the tortillas side by side, open face and overlapping on a platter.  Divide the potato mixture equally between the tortillas and top with scrambled eggs, chopped green onion, and crema (or sour cream).  Grab, fold, and eat right away.  Or build your own taco: lay a tortilla, open face, in one hand. Spoon some of the potatoes and eggs, top with green onion and crema (or sour cream), fold and eat right away.</p>"}]}