{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090929RissolesZoom.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["berries", "desserts", "French in a Flash", "pastries", "puff pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Summer Berry Rissoles", "link": "https://www.seriouseats.com/recipes/2009/10/french-in-a-flash-summer-berry-rissoles-recipe.html", "description": "Whenever I think of rissoles I think of Rizzo from Grease, and that they, like her, are a little bit naughty. They are stuffed balls of all-butter puff pastry, deep-fried in oil&mdash;talk about grease. But done right, they are...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts", "French"], "recipeIngredient": ["2 sheets frozen puff pastry, thawed", "1/2 cup raspberries", "1/2 cup blueberries", "2 teaspoons flour", "2 teaspoons sugar", "1 egg, beaten", "Vegetable oil for frying", "Powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a pot halfway with vegetable oil, and begin heating it to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using some bench flour, roll the cold but thawed puff pastry out into a square that is about 12 inches on each side. Cut 4 equal strips across the pastry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the berries with the flour and the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Making the rissoles is just like making ravioli. One strip of dough will be the base, on which you place your filling. Another strip of dough will blanket over the filling, and then you will stamp out the ravioli. So, begin with 2 strips of dough. Brush each lightly with beaten egg, to help the top and bottom pastries stick together. In your mind, divide the base strip of dough into 4 squares. Alternating, place either 2 raspberries or 3 blueberries in the center of each of those squares. Place the top layer of dough, egg wash-side down, over the dough dotted with berries. Use your fingers to create little pockets, and press the dough lightly all around and between the filling, so any air gets out, and so the dough sticks firmly together. Flour a 2 1/2-inch ravioli stamp, and stamp out the little round, scalloped rissoles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil reaches 350&deg;F, fry the rissoles in two batches for 5 to 6 minutes, until golden and flaky. Drain on paper towel, and dust generously with powdered sugar, like Tinkerbell scattering fairy dust. Eat them when they're still too hot.</p>"}]}