{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090109-carneasada-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Tex-Mex", "keywords": ["beef", "grilling", "Mexican", "taco", "tacos", "tex-mex"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Tacos Carne Asada", "link": "https://www.seriouseats.com/recipes/2009/01/grilling-tacos-carne-asada-recipe.html", "description": "I've just returned from another holiday spent deep in the heart of Texas&mdash;well not too deep, Houston to be exact. While there, you'll usually find me at Ninfa's on Navigation, enjoying some fajitas with a Mexican coke, finished with sweet...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Grilling", "Mains", "Mexican", "Tex-Mex"], "recipeIngredient": ["2 pounds flank or skirt steak, trimmed of excess fat", "<strong>For the marinade</strong>", "4 garlic cloves, minced", "1 jalapeno, minced", "1 large handful fresh cilantro leaves, finely chopped", "Kosher salt and freshly ground black pepper", "2 limes, juiced", "1 orange, juiced", "2 tablespoons white vinegar", "1/2 cup olive oil", "<strong>For serving</strong>", "16 (7-inch) corn tortillas", "Shredded romaine or iceberg lettuce", "Chopped white onion", "Shredded Jack cheese", "1/2 cup Pico de Gallo", "2 limes, cut in wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mortar and pestle or bowl, mash together the garlic, jalapeno, cilantro, salt, and pepper to make a paste. Put the paste in a glass jar or plastic container. Add the lime juice, orange juice, vinegar, and oil. Shake it up really well to combine. Place the steak in a large ziploc bag.  Pour the marinade over the steak and seal the bag, removing as much air as possible.  Place steaks in the refrigerator and to marinate for 2-8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the steak from the refrigerator and allow to come to room temperature while you prepare the grill. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill steaks immediately over high heat, until browned on both sides and cooked until desired doneness, about 3-5 minutes per side for medium.  Remove steaks to a cutting board and allow to rest for 5 minutes.  Slice steaks against the grain into 1/4 inch strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm tortillas on the grill until pliable.  Assemble tacos by stacking 2 warm tortillas and adding the beef, lettuce, onion, cheese, pico de gallo, and garnish with lime wedges.</p>"}]}