{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "Italian", "keywords": ["beans", "Italian", "mains", "recipe newsletter", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Risotto with Salami and Beans", "link": "https://www.seriouseats.com/recipes/2009/01/risotto-with-salami-and-beans-recipe.html", "description": "The following recipe is from the January 14th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Nancy Harmon Jenkins' recipe for risotto with salami and borlotti beans is as hearty and as...", "totalTime": "", "recipeYield": "6 to 8 servings", "recipeCategory": ["Italian", "Mains", "Rice"], "recipeIngredient": ["3/4 cup borlotti or other speckled beans, soaked overnight", "4 cups chicken or vegetable stock", "1 large onion, halved and thinly sliced", "1 garlic clove, crushed", "2 tablespoons extra-virgin olive oil", "1/3 to 1/2 pound salami, skin removed, chopped coarsely", "1 1/2 cups Italian short-grain, such as arborio, vialone nano, or carnaroli rice", "1/2 cup well-flavored dry white wine", "Sea salt and freshly ground black pepper", "2 tablespoons freshly grated parmigiano reggiano cheese, or more if you wish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the drained beans to a saucepan with 2 1/2 cups of water. Bring to a simmer and cook gently, covered, until the beans are tender&mdash;about 40 minutes. Add a little more boiling water from time to time if necessary to keep the beans from scorching. When the beans are done, set aside, but do not drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the stock to a gently simmer and keep just below the boiling point while you prepare the risotto.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heavy-duty saucepan, combine the onion and garlic with the oil and cook, stirring, over medium-low heat until the onion slices and garlic are softened. Stir in the chopped salami and the rice. Cook, stirring occasionally, for about 5 minutes or until the bits of salami are softened and the rice is well coated with the fat in the pan. Add the white wine, raise the heat slightly, and cook more rapidly, until the rice has absorbed the wine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the beans with their cooking liquid and continue cooking until most of the bean liquid has been absorbed. Now cover the contents of the pan with a ladle or two of the not quite simmering broth, stirring to mix well. As the rice absorbs the broth, keep adding more, a ladle or two at a time, stirring as you do so, until the rice is done. The rice should always be just barely swimming in liquid but never awash and never let to dry out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rice is done but still al dente, remove from the heat, taste, and add salt and pepper. Then stir in the 2 tablespoons of cheese, cover the pan and set aside, away from the heat, for 5 minutes or so to combine all the flavors well. Serve the rice, if you wish, with more grated cheese on the side.</p>"}]}