{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090922-pigsskin-thumb.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Beyond Nose to Tail", "Fergus Henderson", "offal", "pig's skin", "pork", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Pig's Skin", "link": "https://www.seriouseats.com/recipes/2009/09/fergus-henderson-pigs-skin-pork-scratchings-recipe.html", "description": "When we think of eating organs, we imagine the red, glossy innards of various beasts and fowl. The skin, however, the largest organ of them all, is a boon for the cook and meat lover.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Offal", "Pork", "The Nasty Bits"], "recipeIngredient": ["1 sheet of pork's skin, with a ¼ inch layer of fat still attached ", "3 cups rendered duck fat or lard, or enough to cover the layers of skin", "A few cups of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse and dry your piece of skin. Using a non-reactive pan, spread a thin layer of salt on the bottom. Place the skin on top, and fold accordian-style if needed, so that all of the skin will fit in the pan. Each time you fold the skin over, sprinkle another thin layer of salt in between so that the entire surface area will be touching salt by the time you're finished. Cover tightly with plastic wrap, and let sit in the refrigerator for 5 to 6 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the salting period, soak the skin in a large bowl of water for at least 6 hours to one day.  By the time the skin is done soaking, it will have grown slightly more engorged.      </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300°F. Place the skin into a cast iron skillet or heavy pot. Cover the skin with the rendered fat. If you're using a skillet or pan without a lid, cover the top with a sheet of foil. Place the covered vessel into the oven and cook for two hours, until the skin is very soft and shrunken. Be sure that the skin is gently simmering rather than deep-frying in the fat. If needed, turn the oven down to 250°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Kept in the refrigerator, the skin can be stored in the fat indefinitely.  When you are ready to eat the skin, place a sheet of it on a pan and crisp it in a 350°F oven for a few minutes, until the skin is puffed and golden brown.  Cut into pieces and serve.</p>"}]}