{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091221lacucina.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cuttlefish", "entertaining", "Italian", "La Cucina", "pastas", "squid", "squid ink"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book Party Planner: Black Tagliatelle with Cuttlefish", "link": "https://www.seriouseats.com/recipes/2009/12/black-tagliatelle-with-cuttlefish-pasta-recipe.html", "description": "\"The light sauce allows the unctuous, sea-flavored pasta to really shine through.\" Since most of us have at least a little time off for the holidays, I thought it might be fun to include a final recipe for our Feast...", "totalTime": "", "recipeYield": "4 as a main course, or 6 as a first course", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 3/4 cups all-purpose flour, plus more as needed", "2 large eggs, beaten", "1 cuttlefish ink sac", "1/4 pound (1 stick) unsalted butter", "1/3 cup chopped shallots", "2 garlic cloves, peeled", "1 pound large cuttlefish, cut in pieces", "1/4 cup white wine", "3 ounces tomato puree", "1/3 cup grated Parmigiano-Reggiano", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the flour onto a work surface or into a mixing bowl and shape it into a mound.  Use your hand or the bottom of a measuring cup to hollow out the center of the mound to form a crater.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the ink and 1 tablespoon of water along with the eggs into the crater.  Beat the eggs mixture lightly with a fork, as if making scrambled eggs.  When the eggs begin to look homogenous, use the fork to pull a little of the flour into the eggs, gradually adding more flour until the eggs are no longer runny.  Push aside 3 tablespoons of flour, then use your hands to work the rest of the flour into the eggs until the dough is smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you think you have achieved the right texture, wash and dry your hands.  Press your finger into the center of the dough ball.  If the dough does not stick to your finger as you pull it out, you do not need to add more flour.  If the dough is still sticky, knead in flour in small increments (heaping tablespoons) until the dough passes the test.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a towel or pastry scraper to remove any loose flour or crumbs from your work surface - it should be clean when you knead the dough.  Press the ball of dough forward with the palm of your hand, then fold the dough over itself, then give the dough a half turn.  Repeat, pressing forward with your palm, folding in half, and turning, always in the same direction.  When the dough is smooth and slightly \"leathery\" (anywhere from 5 to 10 minutes), it is ready to be rolled out.  Roll out the dough according to the directions on your pasta maker, then hang up to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons of butter in a pan and saute the shallot and garlic, removing the garlic when it turns golden.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cuttlefish, wine, tomatoes, salt and pepper.  Cook slowly over low heat until done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the tagliatelle in lightly salted boiling water, drain them but not completely, and add them to the sauce.  Add the remaining butter and Parmigiano-Reggiano and cook for a few minutes.</p>"}]}