{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090717-udon-thumb.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Japanese", "keywords": ["dashi", "Japanese", "noodles", "Seriously Asian", "udon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: Hooked on Udon", "link": "https://www.seriouseats.com/recipes/2009/07/seriously-asian-homemade-udon-in-japanese-noodle-broth-recipe.html", "description": "\"Finally, these were the noodles of my dreams, noodles with the kind of the flexible yet creamy strands that I had only ever tasted with homemade Italian pasta.\" Note: Every week, SE intern Chichi Wang will be discussing some aspect...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Japanese", "Pasta"], "recipeIngredient": ["<strong>For the noodles:</strong>", "1 3/4 cups cold water", "2 1/2 tablespoons salt", "2 egg yolks", "8 1/3 cups (2.5 pounds or 1 kg) all-purpose flour ", "<strong>For the broth:</strong> ", "8 1/3 cups dashi", "2 teaspoons salt", "3 tablespoons dark soy sauce", "3 tablespoons light soy sauce", "2 tablespoons sugar", "2 tablespoons mirin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve the salt in the water, then add the egg yolks to the mixture. Stir to combine. Mound the flour on a board and make a well in the center.  Gradually add the liquid mixture to the flour. Depending on what type of all-purpose flour you use, the amount of liquid will vary slightly. (I generally use King Arthur, and I find that it needs a little more liquid.) The dough will start to come together when approximately half of the liquid is incorporated into the flour.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Knead the dough vigorously, for about fifteen minutes, until it is smooth and firm yet pliant like an earlobe. Cover with a damp kitchen cloth and let rest for 8 hours during the winter or 3 hours in the summer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into four equal sections for ease of rolling.  On a flour-dusted board, roll out the dough to a 1/8 inch width. Sprinkle the sheet of dough with flour, and then gently fold into fourths lengthwise. Cut into approximately 1/4-inch strips with a sharp knife. After cutting, spread out loosely to ensure that the strands will not stick together as you are rolling and cutting the rest of the dough.    This batch, in total, will make approximately 10 servings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the noodles: bring a large pot of water to boil. Cook for approximately 4 to 7 minutes, depending on the thickness of the noodle. Boil until the noodles are just cooked through the center; drain and rinse under cold water.  Unlike Italian pasta, for which it is desirable to retain the surface starch, you want to make your udon noodles slicker.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make your basic Japanese noodle broth. In a large pot, bring dashi to a boil and add the salt, soy sauce, sugar, and mirin. Keep at a low simmer until you are ready to use it. This broth may be made in advance, cooled to room temperature, and refrigerated in a container for up to 3 days.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble: Place the cooked noodles in the broth, along with accoutrements, if desired. If the broth is fresh, then the noodles will be delicious on their own with very few additions needed. A poached egg, sliced green onions, or fish cake are some of my favorites.  </p>"}]}