{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091210-stainedglasscookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "baking", "candy", "Cookies", "desserts", "holiday baking", "holiday cookies", "holiday sweets", "ornaments", "The King Arthur Flour Cookie Companion"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stained Glass Cookies", "link": "https://www.seriouseats.com/recipes/2009/12/stained-glass-cookies-recipe.html", "description": "It was my love of edible adornments that inspire me to make these <strong>Stained Glass Cookies</strong> from <em><a href=\"http://www.amazon.com/King-Arthur-Flour-Cookie-Companion/dp/0881506591/?tag=serieats-20\">The King Arthur Flour Cookie Companion</a></em> to share with my tree-decorating friends.", "totalTime": null, "recipeYield": "4 dozen cookies", "recipeCategory": ["Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the dough:</strong>", "1/2 cup (3 1/4 ounces) vegetable shortening", "1/2 cup (1 stick, 4 ounces) unsalted butter", "1 1/2 cups (10 1/2 ounces) sugar", "4 ounces (half an 8-once package) cream cheese, softened", "1 teaspoon vanilla extract", "1 large egg", "4 cups (17 ounces) unbleached all purpose flour", "1/2 teaspoon ground ginger", "1 teaspoon nutmeg", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "<strong>For the candy centers:</strong>", "2 cups (14 ounces) sugar", "1 cup (11 ounces) light corn syrup", "1/2 cup (4 ounces) water", "Food coloring", "A few drops of strong flavoring of your choice (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, cream together the shortening, butter, and sugar until light and fluffy. Mix in the cream cheese, vanilla, and egg and beat well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized bowl, sift together the flour, ginger, nutmeg, baking soda, and salt. Gradually add the dry ingredients to the butter mixture, beating until well combined. The dough will be soft; cover and refrigerate it overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove the dough from the refrigerator and divide it into quarters. Refrigerate three of the pieces until needed. Preheat the oven to 375°F.  Lightly grease (or line with parchment) two or three baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each piece of dough to a 1/8-inch thickness on a lightly floured work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a 3 1/2- to 4-inch round cookie cutter to cut the dough, and immediately transfer the rounds to the prepared baking sheets, leaving a bit of space between them. Use another shape cutter if you like; just make sure it leaves enough space in the middle to cut out the space for the candy filling. Use a smaller (1 inch or so) cutter in the shape of a circle, heart, star, diamond, or what-have-you to cut out the centers. A bagel or doughnut cutter works well here-it cuts out the cookie and its center hole at the same time. If the dough isn't cold enough, refrigerate the sheets and cut out the centers when the dough is a bit easier to work with. Repeat with the remaining pieces of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies for 8 minutes, or until they're barely firm and still somewhat pale; they'll be just lightly browned around the outer edges. Let them cool on the baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place two or three 1-cup ovenproof glass measuring cups in a 375°F oven to warm. In a medium-sized pan, combine the sugar, corn syrup, and water, and stir over medium heat until the sugar is dissolved. Next, without stirring, cook the syrup until it reaches 300°F to 310°F (hard-crack stage) on a candy thermometer. Remove the syrup from the heat and take one measuring cup from the oven. Pour one half (or one third) of the syrup into the measuring cup, depending on how many colors of filling you want to make, and stir in the food coloring and flavor of your choice. Leave the remaining syrup in the pan, set over low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the syrup in the cup stops bubbling, hold the cup with a very thick potholder and pour the syrup in a then, gentle stream to fill the cookie centers. Stop pouring just as the syrup comes to the top level of the cookie. Be careful; this is an extremely hot process and you may need to take a break halfway through to give your hand a rest. Alternatively, you can use a small (teaspoon) cookie scoop to dip syrup out of the cup and deposit it in the cookie centers; fill the scoop about halfway. This prevents the mild discomfort of holding onto a hot glass for a long time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the second and/or third cup and the rest of the syrup, colored and flavored differently, to fill the centers of the remaining cookies. (If you have any leftover syrup, pour it into small rounds on a piece of parchment or aluminum foil to make hard candies.)</p>"}]}