{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Jen Maiser"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "duck", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Roasted Duck Fried Rice", "link": "https://www.seriouseats.com/recipes/2009/06/roasted-duck-fried-rice-recipe.html", "description": "This is the accompanying recipe for Cooking with a Friend: Duck Fried Rice and Corned Beef....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chicken", "Chinese", "Other Meats", "Rice"], "recipeIngredient": ["1/2 roasted duck (purchase from a Chinese Market)", "1 bunch scallions, sliced", "3 carrots, diced", "2 large eggs", "1/2 teaspoon soy sauce", "3 cups cold cooked white rice", "1/4 teaspoon sesame oil", "Peanut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove roasted duck meat and skin from bones, dice into small pieces. It's up to you how much duck you use. We ended up using approximately 75 percent of the 1/2 a bird and then nibbled on the rest while cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a large, wide skillet (not non-stick) over medium-high heat. I use my widest Le Creuset dutch oven because it has a large, wide base.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine eggs with soy sauce, sesame oil, and a pinch of salt. Beat until mixed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add duck to preheated pan and cook through, constantly stirring, until crispy. Then remove duck and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about a tablespoon of peanut oil to pan, then add carrots and scallions. Cook quickly, constantly stirring, for approximately 3-4 minutes. Carrots should retain their firmness. Remove mixture from pan and set aside. The pan should still have a thin sheen of oil. If not, add a bit more peanut oil before the next step.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add egg mixture to pan and cook through&mdash;approximately one minute. Remove from pan. The pan should still have a thin sheen of oil. If not, add a bit more peanut oil before the next step.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cold rice to now empty pan and stir-fry approximately five minutes until cooked through and browning a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return duck, carrots, scallions, and egg to the pan and mix with the rice for approximately 1-2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you're cooking for the week, remove mixture to a large plate to cool before packaging. If any extra soy sauce is needed, I prefer to add it at the time I eat the rice instead of risking getting it soggy during the cooking process.</p>"}]}