{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-numbinghotchicken.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Asian", "chicken", "Dinner Tonight", "Fuchsia Dunlop", "sichuan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Numbing-and-Hot Chicken (Ma La Zi Ji)", "link": "https://www.seriouseats.com/recipes/2009/10/numbing-and-hot-chicken-ma-la-zi-ji-chinese-asian-recipe.html", "description": "[Photographs: Nick Kindelsperger] Chinese cuisine is one I've been flirting with now for a few months. But with a copy of Revolutionary Chinese by Fuchsia Dunlop, I felt confident to move beyond the standard take-out fare and see what else...", "totalTime": "", "recipeYield": "3 to 4", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["12 ounces boneless chicken thighs, chopped into bite-sized pieces", "1/2 red bell pepper, stemmed, seeded, and chopped into bite-sized pieces", "1 fresh red chili or serrano, stemmed, seeded, and chopped into bite-sized pieces", "3 scallions, white parts only, thinly sliced", "1 teaspoon Sichuan pepper, ground", "1 teaspoon sesame oil ", "1 1/4 cups peanut oil ", "1 tablespoon Shaoxing wine (or dry sherry)", "2 tablespoon light soy sauce", "1/4 teaspoon dark soy sauce", "1 tablespoon plus 1 teaspoon of potato flour ", "1 tablespoon rice vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk together the Shaoxing wine, 1 tablespoon light soy sauce, dark soy sauce, 1 tablespoon potato flour, and 1 tablespoon cold water. Add the chicken to the marinade. Stir well and set aside while you prepare the rest of the ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a second bowl, combine the bell pepper, chile, scallions, and ground Sichuan pepper in a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a third bowl, make the sauce. Whisk together 1 tablespoon light soy sauce, rice vinegar, 1/2 teaspoon potato flour, and 3 tablespoons water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the peanut oil into a pot over high heat. Bring the temperature up to 375°F, then toss in the chicken. Cook for 30 seconds, then remove with a slotted spoon. Wait for the oil to come back up to 375°F then add the chicken back in. This time cook until the chicken is golden browned, about 3 to 5 minutes. Remove the pieces with a slotted spoon and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer 3 tablespoons of the frying oil to a wok or large sauté pan. Turn the heat to high. When really hot, add the bowl of peppers and chiles. Cook, stirring often, until fragrant, about 30 seconds. Add the chicken and sauce from the third bowl. Cook, stirring often, until the sauce has thickened. Transfer to a plate, and drizzle with the sesame oil. Serve.  </p>"}]}