{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Spanish", "keywords": ["Bobby Flay", "Bobby Flay's Burgers Fries and Shakes", "recipe newsletter", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bolo Burger", "link": "https://www.seriouseats.com/recipes/2009/07/bolo-burger-recipe.html", "description": "The following recipe is from the July 1 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! When it comes down to it there are really only two schools of hamburger philosophy. The...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Burger", "Mains", "Spanish"], "recipeIngredient": ["<strong>Piquillo Pepper-Smoked Paprika Aioli</strong>", "1/2 cup mayonnaise", "2 cloves garlic, chopped", "2 jarred piqiullo peppers, drained", "2 teaspoons smoked sweet Spanish paprika", "1/2 teaspoon kosher salt", "<strong>Burgers</strong>", "1 1/2 pounds ground chuck (80 percent lean)", "Kosher salt and freshly ground black pepper", "3 tablespoons canola oil", "4 sesame seed hamburger buns, split; toasted if desired", "8 slices Manchego cheese", "8 paper-thin slices Serrano ham"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the aioli, combine the mayonnaise, garlic, peppers, paprika, and salt in a food processor and process until smooth. Cover and refrigerate  for at least 30 minutes before serving. The aioli can be prepared 1 day in advance, tightly covered, and refrigerated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the meat into 4 equal portions (about 6 ounces each).  Form each portion loosely into a 3/4-inch-thick burger and make a deep impression in the center with your thumb. Season both sides of each burger with salt and pepper.  Cook the burgers, using 1 1/2 tablespoons of the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using a grill:</strong> Heat a gas grill to high or heat coals in a charcoal grill until they glow bright orange and ash over. Brush the burgers with oil. Grill the burgers until golden brown and slightly charred on the first side, about 3 minutes.  Flip over the burgers. Cook burgers until golden brown and slightly charred on the second side, 4 minutes for medium rare (3 minutes if topping with cheese; see step 3) or until cooked to desired degree of doneness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using a grill pan:</strong>  Heat a grill pan over high heat on top of the stove.  Cook the burgers as for a grill, above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using a saut&eacute; pan or griddle (preferably cast iron):</strong> Heat the oil in the pan or griddle until the oil begins to shimmer. Cook the burgers until golden brown and slightly charred on the first side. Flip over the burgers. Cook burgers until golden brown and slightly charred on the second side, 4 minutes for medium rare (3 minutes if topping with cheese; see step 3) or until cooked to desired degree of doneness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the buns on a flat surface and spread half of the aioli over them. Top each one with a slice of the cheese, then a slice of the ham, then a burger, another slice of ham, and finally another slice of cheese, in that order. Spread the rest of the aioli on the bun tops and cover each burger with a top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the tops of the buns with the remaining 1 1/2 tablespoons of oil and place on the grill, griddle, or saut&eacute; pan, top side down. Using a heavy-duty metal spatula, press down on the bottom of the buns and grill until the tops are light golden brown, 1 to 2 minutes. Turn the burgers over and continue cooking, pressing down the tops, until the bottoms are light golden brown and the cheese has melted, about 1 minute longer. Serve immediately.</p>"}]}