{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091001squid-hot-pot-1.jpg", "author": {"@type": "Person", "name": "Tam Ngo"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "Harris Salat", "hot pots", "Japanese", "kombu", "noodles", "seafood", "soups", "squid", "Tadashi Ono"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Squid Hot Pot (Ishiri Nabe)", "link": "https://www.seriouseats.com/recipes/2009/10/squid-hot-pot-ishiri-nabe-recipe.html", "description": "[Photographs: Tam Ngo] This week's Cook the Book recipes represent the ongoing research of the Japanese Hot Pots project&mdash;undertaken by Matsuri chef Tadashi Ono and journalist of all things Japanese Harris Salat. Last Christmas, I had the pleasure of...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book", "Japanese", "Other Seafood", "Soups and Stews"], "recipeIngredient": ["<strong>Broth:</strong>", "4 cups water ", "1 cup sake", "1/2 cup ishiri sauce", "2 (6-inch) pieces kombu", "1 pound squid", "<strong>Edibles:</strong>", "1 napa cabbage-spinach roll, sliced (recipe below)", "1 ounce harusame (thin, transparent noodles made from mung bean, potato, or sweet potato starch; may substitute with cellophane noodles)", "1/2 pound firm tofu (approx. 1/2 package), cut into 4 pieces", "2 ounces daikon, peeled, quartered lengthwise, and cut into 1/4-inch-thick slices", "1 negi (Japanese scallion, usually 3/4-inch thick and 2-feet long; may substitute with 2 green scallions); slice whites and greens at an angle into 2-inch pieces ", "4 ounces fresh shiitake mushrooms (about 8 pieces), stemmed", "3 1/2 ounces shimeji mushrooms (may substitute with white button or crimini), trimmed and separated", "2 cups shungiku (chrysanthemum leaves; may substitute with mizuna or watercress), stemmed", "<strong>Garnish:</strong>", "1/4 cup momiji oroshi (<a href=\"#momiji\">recipe below</a>)", "1/2 cup shibori scallions (<a href=\"#shibori\">recipe below</a>)", "<strong>Rice for Shime:</strong>", "1 cup of Japanese short grain rice ", "1 cup of water ", "<a href=\"http://www.flickr.com/photos/tamngo/3961172755/in/set-72157622470680856/\"><img alt=\"20091001squid-hot-pot-3.jpg\" src=\"https://www.seriouseats.com/recipes/images/20091001squid-hot-pot-3.jpg\" width=\"161\" height=\"240\" class=\"photo-right\" /></a>", "4 ounces napa cabbage leaves (approx. 4 large leaves), separated from the head ", "4 ounces spinach, stemmed", "8 whole dried Japanese chilies (each roughly the diameter of a chopstick)", "2 ounces raw green scallions, trimmed of roots", "cold water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mise en place:</strong> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prep the napa cabbage-spinach roll, momiji oroshi, shibori scallions (recipes below)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://kyotofoodie.com/how-to-clean-a-squid/\">Clean the squid</a> and separate the body from its tentacles. Cut the body and tentacles into 1/2-inch rings and strips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the harusame into 4 or 6-inch segments and soak in lukewarm water for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the rice, first, remove surface starch by washing the rice grains in cold water, using your fingers to swirl the grains and gently rub them together. Drain off the milky liquid. Repeat the process 2 to 3 times until the water is clear enough to see the rice. (The whole process should take no more than 3 minutes.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the rice to a colander, cover with a clean towel, and let rest for 15 minutes, allowing them to cook evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice and the 2 cups of water to a pot. Cover and bring to a boil over high heat. When it comes to a boil, lower the heat to medium and cook until you smell the rice aroma in the steam escaping the pot, about 10 minutes. Take care not to burn the rice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and keep covered for 10 minutes to complete the cooking process. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the pot and fluff the rice with a wooden spoon. Reserve the rice for the shime (below).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Broth:</strong> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the broth by combining the water, sake, and ishiri sauce in a bowl; reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the kombu on the bottom of a hot pot. Add the squid and the reserved broth. Cover and bring the hot pot to a boil over high heat. Decrease the heat to low and simmer until the squid becomes tender, about 20 minutes. Be sure to keep an eye on the heat, adjusting as necessary so the pot is kept at a steady simmer. (A too-vigorous bubbling will cause ingredients to break down.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Main ingredients:</strong> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the pot and push the squid to one side. Add the harusame, slices of nappa cabbage-spinach roll, tofu, daikon, negi, and the shiitake and shimeji mushrooms, arranging each ingredient in the hot pot in separate, neat bunches. Cover and simmer for 5 minutes. Keep an eye on your ingredients as they cook. If necessary, press them  into the broth as they simmer so they poach uniformly. Skim off scum that builds up on the surface of the broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the pot again, add the shungiku leaves, and simmer for 1 minute more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the hot pot to the dining table. Serve the ingredients, together with the broth, in small bowls and garnish with the momiji oroshi and the shibori scallions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shime:</strong> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the soup ingredients have been eaten and only the broth remains, finish the broth off by making a shime of rice ojiya. (The texture of this type of shime resembles a risotto and works best with thicker or miso-based broths.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cooked rice to the remaining broth in the hot pot. Place the pot over medium heat, stirring and cooking so the liquid reduces and the rice absorbs the broth. Cook until the rice reaches the consistency of thick porridge, taking care not to burn it. Serve it in individual bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Napa Cabbage-Spinach Roll</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes one roll (1-1/2 inch in diameter) -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the spinach to the boiling water and quickly blanch for 30 seconds or until it cooks through. Drain the spinach in a colander and and rinse under running water until it cools. Gently squeeze out any excess liquid from the leaves and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the sushi mat and tightly wrap the roll with plastic wrap, to make cutting easier. Slice the cylinder into 4 pieces, each about 2-inches wide. Remove the plastic wrap before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"momiji\"></a><h4>Momiji Oroshi</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1/4 cup -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the chilies in hot water for 5 minutes. Use the bottom of a chopstick to poke a hole into the flat end of one piece of the daikon. Stuff a chili into the hole, using the chopstick as a plunger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the rose-colored grated daikon well and squeeze out any extra liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation: </strong>You can more simply mix 1/4 cup grated daikon (extra liquid squeezed off) with 1/2 teaspoon red yuzu kosho to produce a fresher tasting result. The flavor will be more citrusy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"shibori\"></a><h4>Shibori Scallions</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1/2 cup -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>This traditional technique is used to make scallions milder while still preserving their taste.</em> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the green and whites of the scallions into thin rings. Fill a bowl with cold water and add the scallion slices. Soak for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the scallions and transfer to a clean kitchen towel. Wring the towel over the sink to squeeze out excess moisture and sliminess. After wringing the scallions, mix them well. (Shibori scallions can keep in the refrigerator for up to 3 days.)</p>"}]}