{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090831-shortrib.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["barbecue", "beef", "Big Bob Gibson's BBQ Book", "Chris Lilly", "Cook the Book", "grilling", "short ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Barbecue Beef Short Ribs", "link": "https://www.seriouseats.com/recipes/2009/08/barbecue-beef-short-ribs-recipe.html", "description": "\"Short ribs are notoriously tough and chewy if not cooked correctly but this hour-long steam makes sure they come out tender.\" The words \"indirect heat\" used to send shivers down my spine. But this weekend, I overcame my fear of...", "totalTime": null, "recipeYield": "5", "recipeCategory": ["Beef", "Cook the Book"], "recipeIngredient": ["10 beef short ribs cut into individual ribs", "<small>For the dry rub:</small>", "1 tablespoon salt", "4 teaspoons black pepper", "2 teaspoons dark brown sugar", "2 teaspoons dries oregano", "2 teaspoons garlic powder", "1 1/2 teaspoons dried thyme", "1 teaspoon ground ginger", "<small>For the stock:</small>", "1 cup beef broth", "3 tablespoons soy sauce", "4 teaspoons minced shallots", "2 teaspoons Worcestershire sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the membrane from the back of the ribs.  With a sharp knife, score the top of each rib by cutting 1/4-inch grooves perpendicular to the bone every 1/2 inch.  These cuts will provide more surface areas of bark (the flavorful crust).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the dry rub ingredients and mix well.  Apply a generous coat of the rub to all sides of each rib.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Build a fire (wood or combination of charcoal and wood) for indirect cooking by situating the coals on only one side of the grill, leaving the other side void.  Place the beef ribs on the cooker (bone side down) away from the coals, close the lid, and cook with indirect heat (approximately 275&deg;F) for 1 1/2 hours or until the internal temperature of the beef is 160&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ribs from the grill and place them in the center of a doubled sheet of aluminum foil, meat side down.  In a small bowl, combine the stock mixture and pour it over the ribs.  Wrap tightly in foil, trapping the juice inside.  Return the foil pack to the grill, close the lid, and cook over indirect heat for 1 hour, or until the internal temperature of the beef reaches 200&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the foil packet from the grill and let the beef rest in the foil for 15 minutes.  Unwrap the ribs and slice each one to the bone at all of the scored cuts.  This will create bite-size chunks of meat and allow the juice to penetrate the bark, providing more flavor.</p>"}]}