{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "baking", "chocolate", "Cookies", "Dede Wilson", "desserts", "hazelnuts", "holiday baking", "nutella", "recipe newsletter", "shortbread", "Unforgettable Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Nutella Linzer Cookies", "link": "https://www.seriouseats.com/recipes/2009/12/nutella-linzer-cookie-recipe.html", "description": "The following recipe is from the December 30 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Nutella is a beautiful thing. Chocolate and hazelnuts brought together into a creamy spread&mdash;what's not to...", "totalTime": null, "recipeYield": "about 28 cookies", "recipeCategory": ["Desserts", "Nuts"], "recipeIngredient": ["<strong>Cookies</strong>", "2 1/2 cups all-purpose flour", "1 cup skinned whole hazelnuts", "2/3 cup sugar", "1/4 teaspoon salt", "1 cup (2 sticks) unsalted butter, at room temperature, cut into pieces", "1/4 teaspoon almond extract", "&nbsp", "<strong>Topping and Assembly</strong>", "4 ounces semisweet chocolate, melted", "3/4 cup Nutella chocolate hazelnut-spread, at room temperature", "1/2 cup confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, nuts, sugar, and salt in the bowl of a food processor fitted with the metal blade attachment and process until the nuts are finely ground. Turn the machine on, add the butter a few pieces at a time through the feed tube, and process until evenly combined. Pulse in the almond extract and run the machine until the mixture begins to form large, moist clumps. Form two very flat disks, wrap in plastic wrap, and refrigerate for at least 2 hours or until firm enough to roll. The dough may be refrigerated overnight or frozen for up to 1 month; defrost in the refrigerator overnight before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the upper and lower third of the oven. Preheat the oven to 325&deg;F. Line two jelly-roll pans with parchment paper; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove one disk from the refrigerator and roll out a 1/4-inch thickness between two very lightly floured pieces of parchment. Cut out large cookies and place on the prepared cookie sheet at least 1 inch apart. Cut out a small cookie from the center of half of the cookies. If you like, you can bake these smaller cookies together on a third pan, as baking time will be less. They will not be used in the large cookie assembly, but can be served as is, or sandwiched together with one another. Repeat with the remaining dough. You will need to reuse the pans a few times. Take care to make sure you have the same number of solid cookie bottoms and cutout cookie tops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10 to 12 minutes for the small cookies and 20 to 25 minutes for the larger cookies, or just until the cookies turn light golden brown around the edges. Cool completely on the pans set on racks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the topping and assembly:</strong> To decorate the cookies, you have two options. Some of the cookies can be topped with a dusting of confectioners' sugar, while others can get a zebra-stripe of melted chocolate. Have all of the large cutout \"tops\" on a jelly-roll pan. If you want a confectioners' sugar dusting, simply put that sugar in a fine-mesh strainer and dust the tops of the cookies. Alternatively, fill a parchment cone with melted chocolate, snip a small opening, and make zigzags back and forth over the cookies. Allow the chocolate to firm up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a small offset spatula to spread a thin layer of Nutella on the flat bottoms of the large solid cookies. Carefully sandwich the decorative cutout cookie tops with the cookie bottoms. The small cookies can be served as is, or sandwich them with filling as well. Refrigerate for up to 2 weeks in an airtight container in single layers separated by parchment paper. Bring to room temperature before serving.</p>"}]}