{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091101cakespycandypie2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["candy", "desserts", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Leftover Halloween Candy Pie", "link": "https://www.seriouseats.com/recipes/2009/11/cakespy-leftover-halloween-candy-pie-recipe.html", "description": "Still have a pile of post-Halloween candy? Tired of eating it straight from the wrapper? Dump it into a pie shell, melt it, and behold: candy pie.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakespy", "Candy", "Halloween", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 single pie crust, blind baked (you can use your favorite recipe, or mine is below)", "Enough leftover Halloween candy to fill the pie crust ", "<strong>For 10 inch Pie Crust</strong>", "2 1/2 cups all-purpose flour, plus extra for rolling", "1 cup unsalted butter, very cold, cut into 3/4 inch cubes", "1 teaspoon salt", "1 teaspoon sugar", "4 to 8 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pie crust. Put the flour, salt and sugar into a food processor and pulse once or twice. Add the butter and process until the mixture looks grainy. Then slowly, while pulsing, add the water until you can form the dough by pressing it between your fingers (Note: if you don't have a food processor, this can all be done by hand as well). Put the loose dough onto a piece of plastic wrap. Using the wrap, fold the loose dough towards the middle and press with the back of your hands to form dough. Wrap and chill for at least 4 hours before using. When you're ready, roll it out with a rolling pin to an approximately 12-inch circle; transfer this to a pie plate and trim the edges and shape them in any way you'd like. Blind bake the pie crust for about 10 to 15 minutes at 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the pie crust rest until it's room temperature, and then fill it with whatever mix of candy suits you. I found that a chocolate-heavy mix tasted best, so my  mix included Tootsie Rolls in regular and vanilla, Snickers Fun Size bars, M&Ms, Kit Kat bars, a small amount of Dots, and of course some <a href=\"http://www.seriouseats.com/recipes/2009/10/how-to-make-homemade-candy-corn-halloween-recipe.html\">candy corn</a>. Don't be afraid to fill it to the top, as the candy will flatten and lower as it melts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in a 350&deg;F  oven for about 30-40 minutes, or until the candy is melted and the crust golden. The time may vary depending on your candy mixture. Once you remove it from the oven, let it cool for at least an hour so that the filling can set.</p>"}]}