{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090629burgersfries%26shakes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bobby Flay", "Bobby Flay's Burgers Fries and Shakes", "cheeseburgers", "Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Perfect Burger", "link": "https://www.seriouseats.com/recipes/2009/06/cook-the-book-perfect-burger-bobby-flay.html", "description": "Independence Day is a day for fireworks and barbecues and, most importantly—in my opinion, at least—burgers. There is no need to tell you that we are big fans of burgers here at Serious Eats; we like them so much that...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Burger", "Cook the Book"], "recipeIngredient": ["1 1/2 pounds ground chuck (80 percent lean)", "Kosher salt and freshly ground black pepper", "1 1/2 tablespoons canola oil", "4 slices cheese (optional)", "4 hamburger buns, split; toasted, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the meat into 4 equal portions (about 6 ounces each).  Form each portion loosely into a 3/4-inch-thick burger and make a deep impression in the center with your thumb.  Season both sides of each burger with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a gas grill to high or heat coals in a charcoal grill until they glow bright orange and ash over.  Brush the burgers with oil.  Grill the burgers until golden brown and slightly charred on the first side, about 3 minutes.  Flip over the burgers.  Cook burgers until golden brown and slightly charred on the second side, 4 minutes for medium rare (3 minutes if topping with cheese; see step 3) or until cooked to desired degree of doneness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using a grill pan:</strong>  Heat a grill pan over high heat on top of the stove.  Cook the burgers as for a grill, above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using a saute pan or griddle (preferably cast iron):</strong>  Heat the oil in the pan or griddle until the oil begins to shimmer.  Cook the burgers until golden brown and slightly charred on the first side.  Flip over the burgers.  Cook burgers until golden brown and slightly charred on the second side, 4 minutes for medium rare (3 minutes if topping with cheese; see step 3) or until cooked to desired degree of doneness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cheese, if using, to the tops of the burgers during the last minute of cooking and top with a basting cover, close the grill cover, or tent the burgers with aluminum foil to melt the cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sandwich the hot burgers between the buns and serve immediately.</p>"}]}