{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090603-chile-powder.jpg", "author": {"@type": "Person", "name": "Andrea Lynn"}, "recipeCuisine": "", "keywords": ["Chile Pepper magazine", "chiles", "condiments", "sauces", "Serious Heat", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Heat: Huntley Dent's Red Chile Sauce Recipe", "link": "https://www.seriouseats.com/recipes/2009/06/serious-heat-huntley-dents-red-chile-sauce-recipe.html", "description": "Note: On Thursdays, Andrea Lynn, associate editor of Chile Pepper magazine, drops by to drop some Serious Heat. During my time pursuing a culinary degree, school didn't provide all my food-related lessons. I worked as a live-in nanny for a...", "totalTime": null, "recipeYield": "2 cups", "recipeCategory": ["Condiments and Sauces", "Serious Heat"], "recipeIngredient": ["2 tablespoons vegetable oil", "3 to 4 tablespoons onion, finely chopped", "1 clove garlic, peeled and finely chopped", "1/4 teaspoon oregano", "1 teaspoon cumin", "2 tablespoons flour", "1/2 cup red chile powder ", "2 1/2 cups water", "1/2 to 1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 2-quart saucepan over medium heat, warm oil. Add the onion and garlic and sauté gently for about 5 minutes, or until the onion is translucent. Stir in the oregano, cumin and flour. Cook, stirring constantly, until this roux-like mixture bubbles up and begins to turn a very light brown, about 3 minutes. Remove pan from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, mix the chile powder and water until smoothly blended. Pour mixture into the flour-onion paste, stirring with a whisk to prevent lumps. Return the pan to medium heat and bring the sauce to the boiling point. Stir constantly to prevent chiles from scorching until bubbles form. When the sauce just begins to show signs of active boiling, reduce heat to low and simmer, covered, for 2 to 3 minutes more. Make sure to stir a few times, reaching thoroughly around the bottom and sides of the pan to catch any lumps beginning to form. When the sauce is thickened, and smooth, add the salt, beginning with the smaller amount. Remove from heat and set aside until needed. The finished red chile sauce should be thick enough to coat a spoon heavily. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><a href=\"http://www.istockphoto.com/user_view.php?id=1903949\" class=\"istock\">©iStockphoto.com/ilmwa555</a></small></p>"}]}