{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090727-660curriesbook.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["660 Curries", "Cook the Book", "curries", "curry", "Indian", "potatoes", "Raghavan Iyer", "raisins", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chunky Potatoes with Golden Raisins", "link": "https://www.seriouseats.com/recipes/2009/07/chunky-potatoes-with-golden-raisins-curry-recipe.html", "description": "The other night I was looking for a potato curry recipe for dinner. Let me tell you that deciding on one was no easy task with Raghavan Iyer's 660 Curries sitting in front of me. There are pages upon pages...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["1 can (14.5 ounces) diced tomatoes", "1 small red onion, coarsely chopped", "1/4 cup firmly packed fresh cilantro leaves and tender stems", "4 cloves garlic", "3 dried red Thai or cayenne chiles, stems removed", "2 lengthwise slices fresh ginger (each 2 inches long, 1 inch wide, and 1/8 inch thick)", "2 tablespoons canola oil", "1 teaspoon cumin seeds", "1 pound russet or Yukon gold potatoes, peeled, cut into 1/2-inch cubes, and submerged in a bowl of cold water to prevent browning", "1/2 cup frozen green peas (no need to thaw)", "1/2 cup golden raisins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the tomatoes, with their juices, and the onion, cilantro, garlic, chiles, and ginger in a blender jar.  Puree, scraping the inside of the jar as needed, to make a reddish-green sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large skillet over medium-high heat.  Add the cumin seeds and cook until they sizzle, turn a reddish brown, and smell nutty, 5 to 10 seconds.  Immediately add the pureed tomato-onion sauce.  Lower the heat to medium and cook, partially covered to contain some of the spattering, stirring occasionally, until the liquid evaporates and some of the oil starts to separate from the sauce, 15 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in 1 cup water.  Drain the potatoes and add them.  Cook, covered, stirring occasionally, until the potatoes are fork tender, 20 to 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the peas and cook, uncovered, until they are warmed through, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the curry with raisins and serve.</p>"}]}