{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/091127Sopes_Rajas_Con_Queso.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "Mexican", "keywords": ["cheese", "cornmeal", "masa", "Mexican", "peppers", "Seriously Meatless", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Meatless: Sopes de Chile Con Queso", "link": "https://www.seriouseats.com/recipes/2009/12/sopes-de-chile-con-queso-masa-recipe.html", "description": "Note: Michael Natkin of the vegetarian blog Herbivoracious drops by every Wednesday to share a delicious recipe and expand our vegetarian repertoire. [Photograph: Michael Natkin] Masa, or corn boiled with mineral lime and ground, is part of a vast family...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cheese", "Mains", "Mexican", "Seriously Meatless", "Vegetarian"], "recipeIngredient": ["<strong>For the sopes:</strong>", "2 1/2 cups masa harina", "1 3/4 cups hot water", "2 tablespoons vegetable shortening", "1/2 cup all purpose flour", "1 teaspoon salt", "1 teaspoon baking powder", "Vegetable oil for frying", "Finely diced red onion for garnish", "<strong>For the chile con queso:</strong>", "4 poblano peppers, roasted, skinned, seeded and sliced thinly", "1 cup tomato puree", "1 cup water", "1 teaspoon vegetable broth powder (optional; I like Seitenbacher)", "8 ounces asadero cheese or a mixture of Monterey Jack and cheddar", "Salt to taste; start with 1/2 teaspoon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly combine the masa and hot water, cover, and let stand 30 minutes. In the meantime you can prepare the chile con queso.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, heat the sliced peppers, tomato puree, water, and broth powder to a simmer and continue to cook until rather thick and reduced, about 10 minutes. Remove from the heat, stir in the cheese, which will melt, and add salt to taste. If you will be serving this soon, hold it warm, otherwise refrigerate until ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the remaining ingredients into the sope dough. Preheat a comal or griddle to medium high. Divide the dough into 16 pieces, roll into balls (which should be about 1 1/4 inches in diameter) and cover with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a lined tortilla press or your hands, press one ball out to about a 3 1/2 inch round, which will be about 1/4\" thick. Bake on the griddle for 10 seconds on each side and remove. Allow to cool for a few seconds, until you can touch it comfortably. Use your fingers to pull dough from the middle out to form walls around the perimeter, about 1/4\" thick and 1/2 inch high. Return to the griddle for one minute, on the flat side only, and then set aside, covered, until ready to fry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the remaining balls of masa. Once you have the hang of it, you can have two going at once, in staggered stages.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to finish the dish, heat a large skillet with 3/4\" of vegetable oil over a medium-high flame. When it is hot enough to sizzle if a scrap of dough is added, fry the sopes, wall side down, for about 45 seconds to a minute, until they are golden brown in spots and crispy. Drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each sope with about 1/4 cup of the chile con queso, top with a bit of red onion, and serve.</p>"}]}