{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090525soppressatabrunchbiscuits.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["biscuits", "brunch", "eggs", "Meat Lite", "ricotta", "sandwiches", "soppressata"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Soppressata, Egg, and Ricotta Sandwiches on Buttermilk Biscuits", "link": "https://www.seriouseats.com/recipes/2009/05/soppressata-and-ricotta-brunch-biscuits-recipe-egg-and-cheese-sandwiches.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. As sandwiches go, the egg sandwich earns a...", "totalTime": "", "recipeYield": "about 1 dozen", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["2 cups all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon baking soda", "1 coarse teaspoon salt", "1/4 teaspoon sugar", "4 tablespoons cold butter cut into small cubes", "3/4 cup buttermilk", "1 buttermilk biscuit (recipe above)", "1/2 tablespoon butter", "1 fresh egg", "1 tablespoon chopped chives", "1 thin piece of slicing soppressata, sweet or hot", "2 tablespoons fresh ricotta cheese", "Coarse salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the biscuits: Preheat the oven to 450°F and line a baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the flour, baking powder, baking soda, salt and sugar.  Work the butter cubes into the dry ingredients with your fingers, working it just until mixture becomes shaggy. Add the buttermilk and fold it in just enough to form a wet dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn it out onto a lightly floured surface and knead it 4 or 5 times. Sprinkle a little flour on the surface if the dough sticks. Roll the dough with a rolling pin to about 1/2-inch thickness.  Cut biscuits with a cutter and transfer to a baking sheet. Bake biscuits for 15 minutes, or until golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the sandwich: Melt the butter in a small frying pan over medium heat.  When the pan is hot, gently crack the egg into the middle.  Sprinkle the chopped chives around the egg white and let the egg cook about 2 minutes before turning over.  Continue cooking until the yolk is set to order. Season to taste with coarse salt and freshly ground black pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split warm biscuits (recipe above) in half.  Put the cooked egg on one half. Spread the ricotta on the other half and sprinkle the cheese with salt and pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sliced soppressata to the hot pan and fry it quickly, just to heat the meat through.  Top the egg with the soppressata and the other half of the biscuit.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with fresh fruit or mixed greens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: Soppressata comes in various sizes, so ask for slicing soppressata which is generally about 2 1/2 inches in diameter.  Genoa salami also works well.</p>"}]}