{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091025cscandynanaimo.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "Canadian", "candy", "candy corn", "fall recipes", "nanaimo bars", "no bake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Candy Corn Nanaimo Bars", "link": "https://www.seriouseats.com/recipes/2009/10/cakespy-candy-corn-nanaimo-bars-halloween-baking.html", "description": "The classic puts on a Halloween costume, swapping the top chocolate layer for a layer of sweet and festive <strong>melted candy corn.</strong> The result is an unrelentingly sweet and unabashedly rich treat, certain to satisfy even the sweetest of teeth. Will they make you fat? Probably, but you can always blame Canada.", "totalTime": "", "recipeYield": "about 36 bite-size bars", "recipeCategory": ["Cakespy", "Halloween"], "recipeIngredient": ["<strong>Ingredients for Bottom Layer:</strong>", "1/2 cup unsalted butter", "1/4 cup sugar", "5 tablespoons cocoa", "1 egg, beaten", "1 1/4 cups graham cracker crumbs", "1/2 cup finely chopped almonds (optional)", "1 cup coconut (sorry, coconut haters: this is <em>not</em> optional)", "&nbsp", "<strong>Ingredients for Middle Layer:</strong>", " 1/2 cup unsalted butter", "2 tablespoons cream or half and half", "2 tablespoons vanilla custard powder or instant vanilla pudding powder", "2 cups confectioners' sugar", "&nbsp", "<strong>Ingredients for Top Layer:</strong>", "1/2 cup unsalted butter", "1/2 cup candy corn", "1 teaspoon salt", "1 cup confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare bottom layer. Melt the butter, sugar, and cocoa in a double boiler until fully incorporated, but do not let the mixture come to a boil. Add the beaten egg and stir constantly until the mixture begins to thicken. Remove from heat and stir in the graham cracker crumbs, coconut, and nuts. Press down firmly into an <em>ungreased</em> 8 x 8-inch pan; try to make the mixture as flat as possible in the pan. Let this cool for about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the middle layer. Cream the butter, cream, instant pudding powder, and confectioners' sugar together, beating until the mixture is light and fluffy. Spread over bottom layer, once again trying to make the surface as flat as possible. At this point, I like to put the pan in the refrigerator, as it is easier to spread the top layer on when the buttery middle layer is a bit more solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the top layer. Melt the butter, salt, and candy corn in a double boiler over medium heat. Do not let the mixture boil. Add the confectioners' sugar bit by bit until the mixture reaches a thick, but still pourable, consistency. When the candy corn has mostly melted (the mixture has turned light orange, but there are still a few ghostly candy corn shards visible), it's ready to be spread on top of your other layers. Try to spread this layer on as quickly as you can so that the middle layer doesn't begin to melt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the bars cool for at least one hour in the refrigerator before serving.</p>"}]}