{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091122cakespytgivingcake3.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "holiday baking", "Thanksgiving sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Buche de Thanksgiving", "link": "https://www.seriouseats.com/recipes/2009/11/cakespy-buche-de-thanksgiving-pumpkin-log-cakes-marzipan-turkeys-recipe.html", "description": "Nobody ever makes <strong>Thanksgiving cakes</strong> (or if they do, they've never invited me to dinner). So in an effort to right this grievous wrong, I have adapted a traditional Christmas cake&mdash;the Bûche de Noël, or the Yule Log&mdash;for Thanksgiving.", "totalTime": "", "recipeYield": "about 10", "recipeCategory": ["Cakes", "Cakespy", "Pumpkin"], "recipeIngredient": ["<strong>For the cake:</strong> ", "3 eggs, separated", "1 cup sugar", "2/3 cup canned pumpkin", "3/4 cup all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon ground cinnamon", "1/2 teaspoon grount nutmeg", "1/4 teaspoon salt", "Confectioners' sugar, to dust your surface while rolling the cake", "<strong>For the filling:</strong>", "1 package (8 ounces) cream cheese, softened", "2 tablespoons butter, softened", "1 cup confectioners' sugar", "3/4 teaspoon vanilla extract", "<strong>For the frosting:</strong>", "1 package (8 ounces) cream cheese, softened", "1/2 cup (1 stick) butter, softened", "3 to 5 cups confectioners' sugar", "3/4 teaspoon vanilla extract", "2 tablespoons cocoa powder", "<strong>Optional:</strong> Ingredients for garnish", "White writing icing", "Marzipan", "Food coloring in red, yellow and green"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F. Line a 15 x 10 x 1-inch baking sheet with parchment paper. Spray the parchment with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat egg yolks on high speed until thick and yellow. Gradually add 1/2 cup of the sugar and all of the pumpkin, beating on high until sugar is mostly dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, beat egg whites until soft peaks form. Gradually add remaining sugar, beating until stiff peaks form. Fold into egg yolk mixture. Combine the flour, baking soda, cinnamon, nutmeg and salt; fold into pumpkin mixture. Spread into the prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 12 to 15 minutes or until cake springs back when lightly touched. Cool for about 5 minutes, just long enough so that the cake has set. Turn cake onto a clean kitchen towel dusted with confectioners' sugar. Gently peel off the parchment paper. Roll up cake in the towel jelly-roll style, starting with a short side; let it cool completely on a wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the filling. In an electric mixer, beat the cream cheese, butter, confectioners' sugar and vanilla until smooth (it will be a spreadable consistency, slightly less stiff than a cream cheese frosting). Unroll cake; spread filling evenly, almost but not quite to the edges (when you roll it back up the frosting will fill in the uncovered ends). Roll up again. Cover and chill until firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice off a small slice from either end of the cake to ensure that it is flat on the ends--from these scraps, if desired, you can cut a piece of the cake into a small circle, which you can affix to the side with either a bit of leftover filling or using a toothpick (this will be the \"branch\" on the side).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the frosting. In an electric mixer, combine cream cheese and butter and beat until fluffy. Add the confectioners' sugar, bit by bit, until the frosting has reached your desired consistency (I used about 3 1/2 cups). Add the vanilla and cocoa powder and mix until fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the frosting on the cooled cake (depending on the texture of your finished cake, you might want to apply a crumb coat first, but I found I did not need to). Let the cake chill for about half an hour, and then apply log detailing to the cake--I used Wilton's white writing icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, garnish with marzipan turkeys: mix a golf ball-sized piece of marzipan with food coloring (I used 2 drops of red, 4 drops of yellow and a tiny drop of green) to make a rich, burnt sienna type of cooked turkey color; separate into one large ball and two smaller ones; roll the large one into an oval, and the smaller pieces into teardrop shapes but with a blunt end; these are your drumsticks. Shape small bits of white marzipan to form mini bones and attach these to the drumstick pieces; assemble it all and add other marzipan detailing as desired.</p>"}]}