{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091207spagwcauliflowerandbacon.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["cauliflower", "Meat Lite", "pasta", "roasted vegetables", "spaghetti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Spaghetti with Roasted Cauliflower with Bacon Herbed Breadcrumbs", "link": "https://www.seriouseats.com/recipes/2009/12/spaghetti-with-roasted-cauliflower-bacon-herbed-breadcrumbs-recipe.html", "description": "[Photograph: Tara Mataraza Desmond] If you swear you hate cauliflower, you're probably wrong. I know, it seems out of line for me to accuse you of not knowing your own palate, but I'd be willing to bet that were...", "totalTime": null, "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Cauliflower", "Mains", "Meat Lite", "Pasta", "Pork"], "recipeIngredient": ["1 head cauliflower", "3 to 4 cloves garlic, peeled and sliced in half ", "2 to 3 tablespoons olive oil", "Coarse salt and freshly ground pepper", "4 slices thick cut bacon", "1 cup panko breadcrumbs", "2 tablespoons butter", "2 cloves garlic, minced", "2 to 3 sprigs fresh oregano, leaves plucked (stems discarded), finely chopped", "1/2 cup packed parsley leaves, finely chopped", "Coarse salt and freshly ground black pepper", "3 to 4 cups rich stock, preferably homemade (chicken, turkey, duck or ham)", "1 pound spaghetti", "2 tablespoons olive oil", "1 tablespoon butter", "Freshly grated Parmigiano-Reggiano "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven arranged with two rack to 400° F. Wash the cauliflower, trim the leaves, and slice in half lengthwise, through the core. Cut out the tough stem core section and then split the cauliflower into florets. Put the florets in a baking dish with the garlic and coat everything with the olive oil, salt and pepper. Transfer to the top rack in the oven and roast for about 45 minutes, until the cauliflower is tender and browning.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the bacon strips a few inches apart on a baking sheet covered with parchment paper.  Set in the oven on the lower rack for about 15 minutes or until crispy. Remove from the oven and transfer the bacon slices to a paper towel to soak up excess grease. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cauliflower roasts, toast the breadcrumbs in a dry sauté pan over medium-high heat, just until golden.  Remove them to a plate and set aside.  Add the butter to the sauté pan and melt.  Stir in the garlic and sauté for about 1 minute, taking care not to burn it.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the melted butter and garlic over the toasted breadcrumbs in a medium mixing bowl and stir in the herbs.  Crumble the bacon into the breadcrumbs. Stir well to combine everything. Season to taste with salt and pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cauliflower is done remove from the oven and set aside to cool slightly.  Chop the roasted florets into small pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the stock to a simmer in a wide, high-sided sauté pan over medium-high heat.  Drop the pasta in a pot of boiling salted water and cook until just underdone. Drain the pasta and then add it to the simmering stock.  Simmer for another 3 minutes.  Stir in the cauliflower, the olive oil and the butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta amongst individual bowls or serve on a platter.  Sprinkle the bacon breadcrumbs on top and serve with freshly grated Parmigiano-Reggiano.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small>Tara Mataraza Desmond writes about, cooks, and eats food for a living. She blogs about food and life through words and pictures at <em><a href=\"http://crumbsonmykeyboard.com\">Crumbs On My Keyboard</a>.</em></small></p>"}]}