{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090302FrenchOnionSoupDumplings.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["dumplings", "French", "French in a Flash", "French onion soup", "onions", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French in a Flash: French Onion Soup Dumplings", "link": "https://www.seriouseats.com/recipes/2009/03/french-in-a-flash-french-onion-soup-dumplings-recipe.html", "description": "When I was a girl, French onion soup was the end-all be-all of my culinary existence. When I was in France, I would search high and low for the little restaurants that sold it. I just had to have French...", "totalTime": "", "recipeYield": "15 to 20 dumplings", "recipeCategory": ["French", "Mains", "Soups and Stews"], "recipeIngredient": ["Counterfeit French Onion Soup Onions (recipe below), or 1 to 1 1/2 cups reserved onions from French Onion Soup", "15 to 20 wonton wrappers", "1 cup Gruyère, grated", "1/3 cup Parmesan, grated", "Chives, or twigs of thyme, for garnish", "A pat of butter", "<strong>Counterfeit French Onion Soup Onions</strong>", "1 tablespoon butter", "1 tablespoon olive oil", "2 red onions, thinly sliced", "1 sweet yellow onion, thinly sliced", "1/2 tablespoon sugar", "Salt and pepper", "1/4 cup cognac", "1/2 cup dry white wine", "1 cup beef stock", "1 bay leaf", "The leaves of 4 sprigs thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dumplings, spray 2 <a href=\"http://www.crateandbarrel.com/family.aspx?c=550&f=7387&q=gratin&fromLocation=Search&DIMID=400001&SearchPage=1\">individual gratin dishes</a> with nonstick cooking spray, and set them on a foil-lined baking sheet.  Take a wonton wrapper in your hand, and dip you finger into the strained broth (see above), moistening the entire wrapper.  This procedure will not only allow the dumpling to adhere and keep its shape, but will also steam the wrapper itself while the dumplings are in the oven.  It's a messy job, but if you want French Onion Soup Dumplings, you've got to do it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take about a teaspoon of drained onions, and place it into the center of the wonton wrapper.  Fold one corner up to meet the opposite corner, and press the sides of the triangle together.  Take the other two sides, and bring them up to the central point, and twist, forming a little beggar's purse, or dumpling.  Place the dumpling seam side down in the baking dish.  Keep making dumplings until you have packed both gratin dishes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top each gratin dish with half the Gruyère and half the Parmesan.  Dot little dabs of butter all over the top of the cheese.  This will allow the cheese to brown and toast like on real French Onion Soup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sit the dumplings under the broiler, until they look like French Onion Soup after about 5 minutes.  The cheese should be bubbling and golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stick a decorative toothpick into each dumpling, and scatter chives or thyme stems over the top.  Serve right from the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Counterfeit French Onion Soup Onions:</strong> Heat the butter and oil in a sauté pan on medium-low heat.  Add the onions, sugar, salt, and pepper, and cook for 30 minutes, stirring occasionally.  You may have to turn your heat down to low if you find them caramelizing too quickly.  You want them very soft, but not burnt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 30 minutes, add the cognac, and let it reduce for 1 minute.  Add the wine and beef stock and bay leaf and thyme.  Season again with salt and pepper.  Simmer on low for another 30 minutes.  Afterwards, set the onions into a strainer over a bowl to cool almost completely.  Reserve both the onions, and the broth that drains from them. <strong>You will want to use the same drain-and-reserve method if you are using bought or reserved onions!</strong></p>"}]}