{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090522-zucchini.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Eugenia Bone", "preserving", "Well-Preserved", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Preserved Zucchini", "link": "https://www.seriouseats.com/recipes/2009/05/how-to-can-preserve-zucchini-recipe.html", "description": "Photograph from iLoveButter on Flickr In the late summer when I was growing up, brown paper bags filled with zucchini used to magically appear on our front stoop. Backyard gardeners in my neighborhood would have such a large crop of...", "totalTime": "", "recipeYield": "1 1/2 pounds", "recipeCategory": ["Cook the Book", "Zucchini"], "recipeIngredient": ["3 pounds market-sized zucchini (about 8), cut into planks (not rounds, which seem to cook up wetter) about 1/4 inch thick", "3 tablespoons minced fresh flat-leaf parsley (optional)", "4 garlic cloves, minced (about 2 tablespoons)", "Salt and freshly ground black pepper", "Olive oil to cover"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the oven rack about 6 inches below the heating element.  (If the zucchini is broiled too close to the flame, it will burn.  As it is, it will blister.)  Preheat the broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a baking sheet.  Arrange the zucchini planks on the baking sheet and broil for 5 to 7 minutes, until browned on top.  Turn the zucchini over and broil the second side for 2 to 3 minutes more, until browned.  (You can also grill the zucchini.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the zucchini as it is done and let it rest on paper towels while you finish broiling.  (Some of the pieces will take longer than others , due to your stove or the thickness of the planks.)  The zucchini will release some juice.  This is good - you want them to dry out a little.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all of the zucchini are done, lay one layer down in a small square storage container or glass pan.  Sprinkle with parsley, garlic, and salt and black pepper to taste.  Make several more layers, seasoning each.  Once the zucchini are in, cover them with oil, put on the top or cover with plastic wrap, and refrigerate right away.  Avoid letting the zucchini sit at room temperature covered in oil, as spoilers may bloom, and the zucchini will absorb too much oil.  The oil should harden quickly in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To use, just peel off the strips of zucchini from the cold oil as you need them and re-cover the remaining zucchini with the cold oil clinging to it.  Re-cover the remaining zucchini with oil and refrigerate immediately.  If you find the zucchini are very oily, dab then with paper towels before using.</p>"}]}