{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090728-polentastew.png", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["fall recipes", "Meat Lite", "polenta", "sausages", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Summer Vegetable and Sausage Stew Over Polenta", "link": "https://www.seriouseats.com/recipes/2009/07/summer-vegetable-sausage-stew-over-polenta-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. Summer vegetables. Photograph from thebittenword.com on Flickr This...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Meat Lite"], "recipeIngredient": ["<small>To make the polenta</small>", "2 cups polenta", "1 teaspoon salt", "2 tablespoons butter", "2 ounces Romano cheese, plus more for serving ", "<small>To make the stew</small>", "2 tablespoons olive oil", "8 ounces hot Italian sausage, removed from casings and crumbled", "1/2 cup diced onion", "2 small yellow squash (about 11 ounces)", "1 small Japanese eggplant (about 6 ounces)", "1 teaspoon salt", "2 garlic cloves, minced", "1 tablespoon tomato paste", "1/4 cup dry red wine", "1 28-ounce can whole tomatoes, pureed with their juices", "1 tablespoon red wine vinegar", "1/3 cup roughly chopped basil leaves", "1 tablespoon butter "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a loaf pan with parchment paper and set aside. Bring six cups of water to a boil in a large Dutch oven and slowly pour the polenta in, whisking to prevent lumps. Add the salt. Turn the heat to low, and cook the polenta, stirring regularly, for about 45 minutes, or until the polenta tastes smooth and creamy--not gritty. Stir in the butter and cheese. Pour the hot polenta into the loaf pan and refrigerate overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the stew, heat the olive oil in a large sauté pan over medium-high heat and add the sausage, onion, squash, eggplant, and salt. Cook, stirring occasionally until the sausage has browned and the vegetables are tender, about 20 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the garlic, and stir to incorporate. Add the tomato paste, and stir to coat the vegetables and sausage. Add the wine and stir vigorously, picking up browned bits from the pan's bottom. Add the tomatoes, stir to combine, and bring to a boil then reduce heat. Simmer uncovered for 30 minutes. Add the basil and vinegar and taste, adding salt and freshly ground pepper if desired. Keep the stew warm over very low heat while you fry the polenta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unmold the polenta from the loaf pan and slice into 1/2-inch slabs. Melt the butter in a large nonstick skillet, and fry the polenta slices over medium heat until golden, about 8 minutes per side. Place two slices of polenta on a plate, spoon stew over the top, and serve with more grated Romano for topping. </p>"}]}