{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090603-rhubarb.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Cory Schreiber", "desserts", "Julie Richardson", "pies", "rhubarb", "Rustic Fruit Desserts", "strawberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Rhubarb Cream Cheese Pie with Fresh Strawberries", "link": "https://www.seriouseats.com/recipes/2009/06/rhubarb-cream-cheese-pie-with-fresh-strawberries-recipe.html", "description": "I'm pretty sure that strawberry rhubarb pie is responsible for the majority of rhubarb consumption in this country.  This recipe for <strong>Rhubarb Cream Cheese Pie with Fresh Strawberries</strong> from <em><a href=\"http://www.amazon.com/Rustic-Fruit-Desserts-Crumbles-Pandowdies/dp/1580089763/?tag=serieats-20\">Rustic Fruit Desserts</a></em> by <a href=\"http://www.bakerandspicebakery.com/team.php\">Julie Richardson</a> and <a href=\"http://wildwoodrestaurant.com/cory.htm\">Cory Schreiber</a> takes this classic combination a step further by adding a delicious cream cheese custard to the mix.", "totalTime": "", "recipeYield": "8 to 12", "recipeCategory": ["Bake the Book", "Cook the Book", "Fruit Desserts", "Pies, Tarts, and Crumbles", "Rhubarb", "Strawberry"], "recipeIngredient": ["1/4 recipe (1 disk) All-Butter Pie Pastry (<a href=\"#pastry\">see below</a>), pre-baked in a 9-inch pie pan and cooled", "1/2 cup (3 1/2 ounces) granulated sugar", "1 tablespoon cornstarch", "1 1/2 pounds rhubarb, trimmed and thinly sliced (about 4 cups or 1 pound prepped)", "<strong>For the custard:</strong>", "1 1/2 cups (12 ounces) cream cheese, at room temperature", "1/2 cup (3 1/2 ounces) granulated sugar", "2 eggs", "1 tablespoon pure vanilla extract", "1/8 teaspoon fine sea salt", "2 cups strawberries, hulled and halved", "2 tablespoons confectioners' sugar", "5 cups (1 pound, 9 ounces) all-purpose flour", "3 tablespoons granulated sugar", "1 1/2 teaspoons fine sea salt", "2 cups (1 pound) cold unsalted butter", "1 cup ice water, or more as needed", "2 tablespoons freshly squeezed lemon juice (about 1/2 lemon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the sugar and cornstarch together in a large bowl, then add the rhubarb and toss evenly until coated. Spoon the rhubarb mixture into the pre-baked pie crust. Bake in the middle of the oven for 15 minutes, then remove the pie from the oven and turn down the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the custard. Using a handheld mixer with beaters or a stand mixer with the paddle attachment, beat the cream cheese and sugar on medium speed until light and fluffy. Add the eggs one at a time, beating until smooth after each addition and scraping down the sides of the bowl occasionally. Stir in the vanilla and salt.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the custard into the pie and spread evenly and smoothly over the rhubarb. Return the pie to the oven and bake at 350&deg;F for 25 to 30 minutes, or until the custard puffs up around the edges but is still slightly wobbly in the middle. (Do not worry; as the pie cools the center will firm up.)  Cool to room temperature on a wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the strawberries atop the pie and dust with confectioners' sugar just before serving (a sieve works well for this), or serve berries alongside individual slices of pie.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage:</strong> The pie can be made a day in advance, in which case you should refrigerate it and top with the strawberries just before serving. Covered with plastic wrap, any leftovers will keep in the refrigerator for 2 to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For All-Butter Pie Pastry</strong> (<em>- makes 4 9-inch pie shells -</em>)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, sugar, and salt in a bowl, stir to combine, then put the bowl in the freezer for about 10 minutes, until super cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the butter into 1-inch cubes, then add it to the flour mixture and toss evenly to coat. Cut the butter into the flour mixture using a pastry blender, food processor, electric mixer, or your hands, just until the mixture becomes coarse and crumbly and the butter is about the size of peas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the water and lemon juice together, then drizzle over the dry ingredients, 1/3 cup at a time, tossing with a fork to distribute the liquid. The pastry will be shaggy but should hold together when squeezed in the palm of your hand; if not, add an additional teaspoon or two of ice water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump the pastry onto a lightly floured work surface and press down on the dough, folding it over on itself a few times until it holds together. Try not to handle it too much, or it will warm up and may become overdeveloped. Divide the pastry into 4 equal parts and shape each piece into a disk 1-inch thick. Wrap each disk in plastic wrap and chill for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the dough on a floured surface, using the smallest amount of flour possible.  Begin in the center of the disk and, using even pressure, roll the dough out towards the edge, turning the dough every few strokes to shape a circle and prevent the dough from sticking. It is a good idea to flip the dough over and roll it on the other side, too. This helps keep it smooth and also prevents it from sticking.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For ease of lining the pan, roll the pastry out a bit larger than the pan. Trim any excess dough with a knife. Dock the pastry with a fork. This helps prevent shrinkage during baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dough is in the pan, let it rest. Chill the crust for 30 to 60 minutes to relax the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage:</strong> If wrapped well, the disks will keep for up to 3 days in the refrigerator, or up to 3 months in the freezer. Defrost the frozen disks in the refrigerator overnight.</p>"}]}