{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/1.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["goat cheese", "grilling", "Meat Lite", "pizza", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Mushroom, Sausage, Goat Cheese, and Chive Grilled Pizzas", "link": "https://www.seriouseats.com/recipes/2009/05/mushroom-sausage-goat-cheese-chive-grilled-pizzas-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. This is a cross between crispy flatbread and...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["3/4 cup warm water (about 110°F)", "2 teaspoons honey", "1 packet instant dry yeast", "1 cup whole wheat flour", "1 cup all-purpose flour", "2 teaspoons olive oil", "1 teaspoon salt", "1 1/2 pounds mushrooms, shiitake and button (or your favorite variety or a mix), sliced or roughly chopped", "2 spring onion bulbs, thinly sliced", "2 tablespoons olive oil", "1 tablespoon malt vinegar", "Coarse salt and freshly ground black pepper", "1/4-pound sweet Italian turkey sausage (or your favorite sausage flavor)", "6 ounces crumbled soft goat cheese", "3 tablespoons chopped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the warm water and honey in a large mixing bowl.  Sprinkle the yeast on top of the water and gently stir to combine.  Let sit about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle 1 cup of flour into the water and stir to combine, forming a thick, sticky batter. Add the olive oil and salt, and then gradually add the remaining flour, stirring to incorporate as much of the flour as you can.  Turn the dough out onto a lightly floured surface and knead it for about 8 minutes. Transfer the dough to an oiled bowl and let it rise for 1 hour.  Punch it down and let it rise 1 hour more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pizza dough rises, prepare the topping. Preheat the oven to 400°F. Toss the mushrooms with the spring onion, olive oil and malt vinegar in a baking dish or a pie plate.  Season with salt and pepper. Remove the sausage meat from the casing and distribute it in small pieces across the top of the mushrooms. Transfer the dish to the oven and roast until the mushrooms are tender and the sausage is cooked through, 30 to 40 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the grill to medium-high (gas or charcoal).  Divide the pizza dough into 4 pieces and roll each very thin. Brush both sides of each piece with olive oil and place directly on the hot grates of the grill.  Grill each side about 3 minutes.  Divide the mushrooms and sausage amongst the four pizzas.  Sprinkle with goat cheese and chives. Leave the pizzas on the grates, turn off the grill and close the cover.  Let the pizzas sit an additional 2 minutes, just until the cheese has softened, before serving.</p>"}]}