{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/200908242bitesizedesserts.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bite-Size Desserts", "cakes", "Carole Bloom", "Cook the Book", "pistachios", "tea cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mini Pistachio Tea Cakes", "link": "https://www.seriouseats.com/recipes/2009/08/cook-the-book-mini-pistachio-tea-cakes-recipe.html", "description": "These little tea cakes tasted like nothing I've ever baked before. The addition of my homemade pistachio paste gave them a great crunch, and the texture of the cake itself was just dense and chewy enough to give them a great mouthfeel.", "totalTime": "", "recipeYield": "2 dozen tea cakes", "recipeCategory": ["Cook the Book", "Nuts"], "recipeIngredient": ["3 ounces (6 tablespoons, 3/4 stick) unsalted butter, softened", "1/2 cup (3 1/2 ounces) granulated sugar", "1/3 cup (3 ounces) packed pistachio paste", "1/2 teaspoon pure vanilla extract", "2 extra-large eggs, at room temperature", "1/2 cup (2 1/4 ounces) all-purpose flour", "1/4 teaspoon kosher or fine-grained sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position an rack in the upper third of the oven and preheat the oven to 400&deg; F.  Place the mini muffin pans on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter in the bowl of an electric stand mixer with the flat beater attachment or in a large mixing bowl using a hand-held mixer until it's light and fluffy, about 2 minutes. Add the granulated sugar and beat until smooth. Stop and scrape down the sides and bottom of the bowl with a rubber spatula. Add the pistachio paste and vanilla and mix until smooth and thoroughly combined. One at a time, add the eggs. They will sit on top of the mixture, so be sure to scape down the sides and bottom of the bowl with a rubber spatula. Blend thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the four into a medium-size bowl. Add the salt and toss to blend. Add this mixture to the butter mixture in 2 stages, blending well after each addition. Stop after each addition and scrape down the sides and bottom of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the four into a medium-size bowl.  Add the salt and toss to blend.  Add this mixture to the butter mixture in 2 stages, blending well after each addition.  Stop after each addition and scrape down the sides and bottom of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into a 2-cup liquid measuring cup and divide it evenly among the cavities of the mini muffin pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cakes for 13 to 15 minutes, until light golden and a cake tester inserted in the center comes out clean.  Remove the baking sheet from the oven and transfer the mini muffin pans to racks to cool completely.  Turn the mini muffin pans upside down and press the cakes out, then turn them right side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust the tops of the cakes with confectioners' sugar. Serve the cakes at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note on storing the tea cakes:</strong> Store the tea cakes tightly wrapped in aluminum foil at room temperature up to 4 days.  To freeze up to 4 months, wrap them tightly in several layers of plastic wrap and aluminum foil.  Use a large piece of masking tape and an indelible marker to label and date the contents.  If frozen, defrost the cakes overnight in the refrigerator and bring to room temperature before serving. </small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note on adding style:</strong> Top each cake with 2 or 3 toasted pistachio nuts before baking.</small></p>"}]}