{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090807-fleurburger.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["beef", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fleur Burger with Truffles", "link": "https://www.seriouseats.com/recipes/2009/08/fleur-burger-with-truffles-recipe.html", "description": "Photograph by Bill Milne The truffles are optional on this burger, which is good because you probably don't have any lying around. But you can replace it with other wild mushrooms for that earthy flavor. Keller changes his restaurant version...", "totalTime": "", "recipeYield": "4", "recipeCategory": [], "recipeIngredient": ["2 pounds coarsely ground American Kobe beef, chilled", "1 teaspoon cornstarch", "1 cup Quick Chicken Stock (<a href=\"#broth\">recipe below</a>) or packaged low-sodium chicken broth", "2 tablespoons olive oil", "Sea salt and freshly ground black pepper", "2 tablespoons ruby port", "4 brioche buns", "3 tablespoons unsalted butter, at room temperature", "1 ounce black truffle, very thinly sliced, about  slices per serving (optional)", "4 handfuls baby greens or sprouts", "Grenadine Pickled Onions (<a href=\"#onions\">recipe below</a>)", "Fleur de sel", "1 teaspoon whole black peppercorns", "1/2 teaspoon whole coriander seeds", "1 cup red wine vinegar", "1/2 cup grenadine", "1 large (about 10 ounces) red onion, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the burgers, shape the meat into 4 evenly sized patties about 1 inch thick. Handle lightly to keep the texture light and juicy. The burgers can be shaped and refrigerated, covered, for several hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, in a small bowl stir together the cornstarch and about 2 tablespoons of the stock until well blended. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large skillet or grill pan over medium-high heat until very hot. Generously season the meat on both sides with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the burgers in the skillet, turning once or twice, for 7 to 10 minutes for medium-rare. Do not press down on the patties. With a large spoon, baste the burgers several times with the fat in the pan. (You can also preheat the oven to 450&deg;F and cook the burgers on top of the stove until they are brown on both sides, and then finish them in the oven.) Remove the burgers to a warm platter and reserve the cooking skillet. Keep the burgers warm, and let rest for several minutes before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly so the burger skillet is still hot, pour out any remaining fat and return the pan to medium high heat. Add the port and stir and scrape all over the sides and bottom of the pan to dislodge all the browned bits. Add the remaining stock and bring to a boil. Cook until reduced by about a third, about 2 minutes. Add the cornstarch mixture and cook and stir until the sauce has thickened, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the buns in a toaster oven or under the broiler, about 5 inches from the heat, until lightly toasted. Or toast them on the outer perimeter of the grill pan. Use 2 tablespoons of the butter to spread on the cut sides of the buns. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 1 tablespoon of butter in a small skillet over medium heat until the butter begins to bubble. Add the truffle slices, if using, and cook, stirring and tossing, until the truffles are warm through, about 30 seconds. Set aside and keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To build the burgers, arrange a small handful of greens on the bun bottoms and spread a spoonful of pickled onions on the greens. Put the burgers on top and divide the truffle slices evenly among them. Lightly drizzle the sauce over and around the burgers, and then sprinkle with fleur de sel. Balance the bun tops against the burgers and serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"stock\"></a><h4>Quick Chicken Stock</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 2 quarts (8 cups) low-sodium or no-salt-added chicken broth in a large pot with 1 roughly chopped yellow onion; 1 stalk celery, cut into chunks; 1 carrot, cut into chunks; 1 small leek, cut into chunks; 1 tomato, roughly chopped; and a crushed garlic clove. Add a sprig each of parsley and thyme and a bay leaf. Add about 1/4 cup white wine or sherry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil over high heat, then reduce the heat to a slow simmer and cook, uncovered, until reduce to about 6 cups, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain, pressing down gently on the solids to extract as much liquid as possible. Discard the solids, and refrigerate the stock, covered, until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"onions\"></a><h4>Grenadine Pickled Onions</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 2 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tie the peppercorns and coriander seeds in cheesecloth or put them in a tea ball. In a nonreactive saucepan over medium-high heat, bring the vinegar, grenadine, and spices to a boil. Add the onion and simmer, uncovered, for 10 to 15 minutes. Let cool, transfer to a nonreactive container, cover, and let sit for 2 hours before using. The onion will turn a deeper color and take on more flavor if left in the pickling mixture for a day or two before use. They keep, refrigerated, for up to 2 weeks.</p>"}]}