{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baking", "Cook the Book", "corn", "custards", "desserts", "Karen DeMasco", "recipe newsletter", "The Craft of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet Corn Custard", "link": "https://www.seriouseats.com/recipes/2009/10/sweet-corn-custard-recipe.html", "description": "The following recipe is from the October 7 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! I had always thought of corn as a side dish, either on the cob with salt...", "totalTime": null, "recipeYield": "8", "recipeCategory": ["Corn", "Desserts"], "recipeIngredient": ["2 medium ears fresh corn, shucked", "1 quart heavy cream", "3/4 cup sugar", "1/2 teaspoon kosher salt", "1/4 vanilla bean, split lengthwise, seeds scraped out, bean and seeds reserved", "2 large eggs", "6 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the kernels from the corn cobs; reserve the cobs. In a large heavy-bottomed sauce pan, stir together the kernels, cobs, cream, sugar, salt, and vanilla bean and seeds. Bring to a rolling boil and then remove from the heat. Transfer the mixture to a bowl, cover, and refrigerate it for at least 12 hours, and up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 275&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the eggs and egg yolks in a medium bowl. Discard the corn cobs and pour half of the cream mixture over the eggs; whisk together until combined. Whisk in the rest of the cream mixture. Strain through a fine-mesh sieve into a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place eight 4-ounce ramekins or custard cups in a deep baking dish or roasting pan, spacing them evenly. Divide the custard mixture among the ramekins.  Cover the baking dish with aluminum foil, leaving the front side loose, and carefully place the dish in the oven. Fill the baking dish with warm water to reach halfway up the sides of the ramekins, then seal the dish tightly with the foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 20 minutes. Then rotate the pan and let the steam out by lifting the foil cover; replace the foil and seal it. Continue baking, lifting the foil every 15 to 20 minutes to let the steam out and then resealing it well, until the edges of the custard are set and the centers are still slightly loose, about 1 hour (if more time is needed, check at 5 minute intervals.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the foil. Transfer the dish to a wire rack. Let the custards cool to room temperature in the water bath. Remove from the water and refrigerate, uncovered, until set, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once set, the custards can be kept in the refrigerator, loosely covered with plastic wrap, for up to 2 days.</p>"}]}