{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090922-specialkbars-thumb.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["baking", "Cakespy", "cereal", "desserts", "Midwest", "Super Bowl desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Chocolate Peanut Butter Special K Bars", "link": "https://www.seriouseats.com/recipes/2009/09/chocolate-peanut-butter-special-k-bars-recipe.html", "description": "These no-bake bars, which generally resemble bricks in both size and weight, were comprised of a dense, crunchy-chewy mixture of corn syrup, sugar, peanut butter, and Special K cereal, all topped with about a half-inch of fudgy chocolate topping.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakespy", "Chocolate"], "recipeIngredient": ["1 1/2 cups brown sugar", "1 1/4 cups light corn syrup", "2 cups peanut butter (a creamy, no-stir type works best)", "6 cups Special K cereal", "12 ounces (1 bag) semisweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, microwave safe bowl, combine the brown sugar and corn syrup; mix well. Microwave on high for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from microwave and stir the mixture, making sure to scrape down the sides of the bowl. Microwave the mixture again on high for 2 minutes, or until the mixture starts to bubble around the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bowl from microwave and add 1 1/2 cups of the peanut butter; stir until smooth and fully incorporated. Add cereal and mix until it is fully coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon cereal mixture into a well greased 13 x 9-inch pan, pressing down with either clean fingers or the back of a spoon to make sure it is evenly and firmly packed into the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium microwave safe bowl, combine the chocolate chips and the remaining 1/2 cup of peanut butter. Heat on medium power for 2 minutes; remove and stir mixture. If chocolate chips are not fully melted, return the mixture to the microwave and heat in 20 second intervals until fully melted. Stir until smooth, and spread over the cereal mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool completely, and then cut into bars. Do not chill the mixture before cutting. </p>"}]}