{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090402warmbreadsaladwithpoachedegg.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["bread", "bread salads", "Jamie Oliver", "panzanella", "salads", "speck"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Bread Salad with Speck, Parmesan, and Poached Egg", "link": "https://www.seriouseats.com/recipes/2009/04/bread-salad-with-speck-parmesan-poached-egg-recipe.html", "description": "Making this salad should have had me seriously craving produce at its summertime peak—especially juicy tomatoes, which are the main event in panzanella, an Italian bread salad. This recipe is kind of a riff on panzanella, yet it was so...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Salads"], "recipeIngredient": ["10 to 15 pieces torn ciabatta or other crusty white bread", "5 tablespoons olive oil", "2 cloves of garlic, peeled and sliced", "Salt and pepper to taste", "10 slices speck, prosciutto, or pancetta, torn or cut into pieces", "Juice of 1 lemon", "4 eggs", "4 ounces baby arugula", "3 ounces Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.  In an ovenproof dish toss the bread pieces, garlic, and 2 tablespoons of the oil.  Bake until the bread begins to get crispy; about ten minutes. Lay the slices of speck across the bread pieces and continue baking for an additional 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a saucepan of water to boil for poaching the eggs.  Whisk the lemon juice, remaining olive oil, and a pinch of salt and pepper in a salad bowl to make a dressing.  Shave the Parmesan cheese using a vegetable peeler into thin shavings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Poach the eggs in simmering water for 4 minutes, or until the whites are completely set and the yolk is still soft.  Toss the arugula with the bread, speck, and dressing.  Serve with the shaved Parmesan and poached eggs.  Serve immediately.</p>"}]}