{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091005-ctb-muffins.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apple cider", "apples", "baking", "Cook the Book", "desserts", "Karen DeMasco", "Mindy Fox", "The Craft of Baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Cook the Book: Apple Cider Muffins", "link": "https://www.seriouseats.com/recipes/2009/10/apple-cider-muffins-karen-demasco-recipe.html", "description": "When the lovely <strong>apple-packed and cinnamon-scented muffins</strong> emerged from my oven, I was struck by their pliant texture. They had a resilience that made every muffin come out of the tin in a bouncy little round.", "totalTime": null, "recipeYield": "1 dozen", "recipeCategory": ["Apple", "Bake the Book", "Bread", "Breakfast and Brunch", "Breakfast Sweets", "Cook the Book"], "recipeIngredient": ["Unsalted butter, for the muffin tin (optional)", "1 cup granulated sugar", "1 cup packed dark brown sugar", "3/4 cup grapeseed oil", "3 large eggs", "2 1/4 cups unbleached all-purpose flour", "1 1/2 teaspoons baking soda", "1 teaspoon kosher salt", "1 teaspoon ground cinnamon", "1 cup apple cider", "3/4 cups sour cream", "1 1/2 teaspoons vanilla extract", "2 crisp baking apples, such as Granny Smith or Mutsu, peeled, cored, coarsely grated, and drained, juices reserved and used as part of the cider measurement ", "1 tablespoon Demerara sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.  Generously butter a standard 12-cup muffin tin or line it with paper liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the granulated sugar, brown sugar, and oil.  Add the eggs and whisk to combine.  In another bowl, sift together the flour, baking soda, salt, and cinnamon.  In a third bowl, whisk together the apple cider, sour cream, and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one third of the flout mixture and one third of the apple cider mixture to the sugar mixture, folding with a spatula just to combine.  Add the rest of the flour and cider mixtures in two additions.  Fold in the grated apple, and then divide the batter evenly among with prepared muffin cups, filling each cup three quarters of the way.  Sprinkle the tops of the muffins with the Demerara sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, rotating the muffin tin halfway through, until the muffins spring back to the touch, 25 to 30 minutes.  Transfer the pan to a wire rack and let cool for 10 minutes.  Then turn out the muffins from the pan and let them cool completely on the wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>These muffins are best the second day and will keep in an airtight container at room temperature for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Varying Your Craft: Apple Cider Quick Bread</strong> Pour the batter into a buttered 8 1/2 x 4 1/2-inch loaf pan lined with parchment paper and bake, rotating the pan halfway through, until a cake tester inserted in the center of the loaf comes out clean, 45 to 55 minutes.  Transfer the pan to a wire rack and let cool for 10 minutes.  Then turn out the loaf from the pan and let it cool completely on the wire rack.  This bread is best the second day and can be kept, wrapped in plastic wrap, at room temperature for up to 3 days.</p>"}]}