{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090611-grilled-asparagus.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["asparagus", "grilling", "prosciutto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Asparagus Wrapped in Prosciutto With Lemon", "link": "https://www.seriouseats.com/recipes/2009/06/grilling-asparagus-wrapped-in-prosciutto-lemon-recipe.html", "description": "I don't feel the need to gussy up asparagus on the grill; just a little olive oil, salt, and pepper is all you need to make them delicious. But every once in a while, I have the desire to go...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Asparagus", "Grilling"], "recipeIngredient": ["1 bunch of large asparagus, washed, tough ends snapped off", "4 ounces thinly sliced prosciutto", "1 lemon, zested and cut in half", "Extra virgin olive oil", "Freshly ground black pepper", "2 bamboo skewers, soaked in water for 30 minutes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap each asparagus spear in 1 slice of prosciutto, or 1/2 a slice if the slices are large. Thread spears onto the skewers, with 1 skewer going through the bottom of the asparagus and the other going through the top. Drizzle olive oil over the skewered asparagus, and season with black pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly over the charcoal grate. Place lemons halves, cut side down, and the asparagus on the grill over high heat. Cook asparagus until tender and prosciutto crisps, about 3-5 minutes per side. Cook lemon halves until lightly browned, about 2-3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove asparagus from the grill. Immediately squeeze the lemon halves over them, and sprinkle with lemon zest. Serve hot or at room temperature.</p>"}]}