{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["mains", "salmon", "sandwiches", "sauces", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salmon Burgers with Lemon-Herb Sauce", "link": "https://www.seriouseats.com/recipes/2009/01/salmon-burgers-with-lemon-herb-sauce-recipe.html", "description": "Salmon burgers are a lighter burger than the usual beef and a good option if you want to switch it up. This version, adapted from Cook's Illustrated Guide to Grilling and Barbecue, has mayonnaise to ensure moistness in the final...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Mains", "Salmon", "Sandwiches"], "recipeIngredient": ["1 1/4 pounds salmon fillets", "1/4 chopped fresh parsley leaves", "2 tablespoons mayonnaise", "2 tablespoons finely grated onion", "1 tablespoon juice from 1 lemon", "1/2 teaspoon salt", "Ground black pepper", "Vegetable oil for the grill grid", "1/4 cup mayonnaise", "1 small scallion, minced", "1 tablespoon juice from 1 lemon", "1 1/2 teaspoons minced fresh parsley leaves", "1 1/2 teaspoons minced fresh thyme leaves", "1/4 teaspoon salt", "Ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove any pinbones from the salmon flesh using tweezers or needle-nose pliers. Separate the flesh from the skin, discarding the skin. Chop the salmon into 1/4-inch pieces. Using a rocking motion with the knife, continue to chop the salmon until it is coarsely ground into pieces roughly 1/8 inch each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the salmon in a bowl and mix with the parsley, mayonnaise, onion, lemon juice, salt, and pepper to taste. Divide the mixture into 4 equal portions (about 5 ounces each) and use your hands to press each into a compact patty about 1 inch thick. Place the patties on a parchment-lined baking sheet and refrigerate for at least 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, light a chimney starter filled with hardwood charcoal (about 6 quarts) and allow to burn until all the charcoal is covered with a layer of fine gray ash. Build a single-level fire by spreading the coals evenly over the bottom of the grill. Set the cooking grate in place and use a grill brush to scrape the cooking grate clean. Place the grill grid on top of the cooking grate, cover the grill with the lid, and let the grate heat up, about 5 minutes. The grill is ready when the coals are medium-hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dip a small wad of paper towels in vegetable oil; holding the wad with long-handled tongs, wipe the grill grid. Grill the salmon burgers, uncovered, until well browned on one side, 3 to 4 minutes. Flip the burgers with a greased metal spatula. Continue grilling, uncovered, until the other side is well browned and the burgers are barely translucent at the center, about 3 minutes. Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Creamy Lemon-Herb Sauce</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 1/3 cup -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Feel free to substitute other herbs if you do not have parsley or thyme.</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all the ingredients, including pepper to taste, together in a small bowl. Cover with plastic wrap and chill until the flavors blend, at least 30 minutes.</p>"}]}