{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090721-chickpeas.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["chicken", "chickpeas", "Meat Lite", "salads", "tabouli"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Chickpea, Chicken, and Tabouli Salad", "link": "https://www.seriouseats.com/recipes/2009/07/chickpeas-chicken-tabouli-salads-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by their book, Almost Meatless. &copy;iStockphoto.com/JLGutierrez Despite my garden idiocy, I have a...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Legumes", "Meat Lite"], "recipeIngredient": ["2 cups water", "2 boneless skinless chicken breasts (about 12 ounces or 3/4 pound)", "1 cup bulgur wheat", "2 tablespoons grated onion", "1 cup small diced tomatoes (about 2 Roma tomatoes)", "1 cup small diced cucumber (about 1 small)", "1 cup cooked chickpeas", "Zest of 1 lemon", "1/4 cup fresh lemon juice (about 1 lemon)", "1 teaspoon coarse salt", "1/4 teaspoon freshly ground black pepper", "1/4 cup extra virgin olive oil", "2 cups tightly packed parsley leaves, chopped fine", "1/2 cup tightly packed mint leaves, chopped fine", "Hearts of Romaine or Butter lettuce leaves for scooping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a boil in a wide high-sided sauté pan. Add the chicken breasts and reduce to a bare simmer. Cover and poach the chicken for 15 minutes, until cooked through.  Remove the chicken, reserving the liquid, and set it aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the poaching liquid to a boil.  Add the bulgur wheat, cover and turn off the heat. Keep covered for 15 minutes, until the bulgur has absorbed the liquid and becomes tender.  Stir in the grated onion, transfer the bulgur in a large serving bowl, and refrigerate to cool completely.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the chicken is cool, shred it and add it to a mixing bowl with the tomatoes, cucumber, chickpeas, and lemon zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the lemon juice, salt, and pepper together in a small bowl.  Add the olive oil in a slow drizzle, whisking constantly to make a simple vinaigrette.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the chopped parsley and mint into the cooled bulgur.  Add the chicken and chickpea mixture and stir to combine.  Drizzle with the vinaigrette and stir again to incorporate all of the ingredients. Refrigerate the salad for about 30 minutes before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the salad on a big platter with Romaine hearts or Butter lettuce leaves for scooping.</p>"}]}