{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["gravy", "holiday recipes", "Thanksgiving turkeys", "The Food Lab", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Turkey Stuffed Turkey with Gravy", "link": "https://www.seriouseats.com/recipes/2009/11/turkey-stuffed-turkey-with-gravy-thanksgiving-recipe.html", "description": "Note: Want to read about the creation of this recipe? Check it out here....", "totalTime": null, "recipeYield": "8 to 12", "recipeCategory": ["The Food Lab", "Turkey"], "recipeIngredient": ["<strong>For the Turkey/Sausage:</strong>", "1 whole turkey, about 15 pounds", "3/4 pound boneless pork butt or slab bacon, cut into 1-inch chunks.", "2 tablespoons finely minced fresh sage leaves, or 1 teaspoon powdered dried sage", "2 cloves garlic, roughly chopped", "1 stalk celery, roughly chopped", "1 small yellow onion, roughly chopped", "1 teaspoon paprika", "2 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "2 tablespoons butter", "2 tablespoons vegetable oil", "<strong>For the Gravy:</strong>", "2 tablespoons vegetable oil", "1 large onion, peeled and roughly chopped", "2 large stalks celery, roughly chopped", "1 large carrot, peeled and roughly chopped", "2 cloves of garlic, peeled and smashed", "2 bay leaves", "12 black peppercorns", "Parsley stems, thyme sprigs, mushroom trimmings (anything you have on hand that would add flavor)", "1/4 teaspoon marmite", "1 teaspoon soy sauce", "3 tablespoons unsalted butter", "3 tablespoons flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sausage:</strong> With a sharp boning knife, remove legs and drumsticks from turkey. Peel skin off of legs, the remove meat from bone with boning knife. Trim away any silverskin or connective tissue, then cut meat into one-inch chunks. Toss meat with pork, sage, garlic, celery, onion, paprika, salt, and pepper, and allow to rest in refrigerator, covered, at least one hour, or up to overnight. Pass mixture twice through well-chilled meat grinder fitted with 1/4-inch plate. Place1 teaspoon of sausage on microwave-safe plate and microwave for 15 seconds until cooked through. Taste for seasoning. Add salt and pepper to sausage as necessary, then refrigerate until ready for use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the turkey:</strong> Remove wings from turkey using sharp boning knife and set aside. Carefully separate skin from turkey, working very slowly, and using a knife as necessary to help separation. Cut skin into two large sheets (one from the breasts, and the other form the back). Using back of knife, scrape off any excess fat from inner surface of skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 275°F and set oven rack to lower-middle position. Remove turkey breasts from carcass using sharp boning knife. Following the <a href=\"http://www.seriouseats.com/2009/11/the-food-lab-turkey-stuffed-turkey-thanksgiving.html\">photographs in the article,</a> butterfly one turkey breast into even an even rectangle. Season on both sides with salt and ground black pepper. Spread stuffing mixture in even 1/4-inch layer on top of breasts. Roll breast up, wrap with one piece of skin, and secure with 7 to 10 pieces of butcher's twine at 1-inch intervals, working from the outside in. Repeat with second breast. Season breasts on all sides with salt and ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place turkey ballotines on rack set in rimmed baking sheet and place in oven. Cook until internal temperature reaches 145°F as measured on a thermometer, about 3 to 5 hours, depending on thickness of rolls. Remove from oven and allow to rest in warm place, covered with foil, for at least half an hour, and up to 1 1/2 hours. Remove strings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter and vegetable oil in heavy-bottomed 12-inch skillet or heavy-bottomed roasting pan until foaming subsides. Add turkey rolls and cook until well browned on all surface, about 8 minutes total. Slice, and serve with gravy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the gravy:</strong> While turkey is roasting, roughly chop carcass and wings into 1-inch chunks. Heat vegetable oil in large saucepan or Dutch oven over high-heat until just beginning to smoke. Add turkey carcass and cook, stirring frequently, until well browned on all surfaces, about 10 minutes. Add onions, carrots, and celery, and cook, stirring frequently, until slightly softened, about 5 minutes. bay leaves, peppercorns, and optional aromatics, then fill with room temperature water until just covered. Bring to a boil over high heat, reduce to a simmer, and cook for 2 hours, skimming frequently (reserve fat to add to dressing, if desired).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain through chinois or fine mesh-strainer lined with cheesecloth. Measure out three cups of stock and and reserve remainder for another use (such as the dressing). Add butter and flour to medium saucepan and cook over medium-low heat, stirring constantly, until light blond in color, about 2 minutes.. Slowly whisk in three cups of reserved stock. Bring to a simmer and cook, stirring occasionally, until slightly thickened. Whisk in marmite and soy sauce. Adjust seasoning to taste with salt and pepper, and serve with sliced turkey.</p>"}]}