{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090514seriouslyitalian-thumb.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["breadsticks", "grissini", "Italian", "semolina", "Seriously Italian", "sesame"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Semolina and Sesame Grissini", "link": "https://www.seriouseats.com/recipes/2009/05/semolina-and-sesame-grissini-breadsticks-recipe.html", "description": "It's like an extra serving of the best part of bread; the brown, crunchy, sesame-coated crust in concentrated form.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Italian"], "recipeIngredient": ["1 cup plus 1 tablespoon warm water", "1 teaspoon active dry yeast", "1 cup sesame seeds", "A pinch of granulated sugar", "1 1/4 cups durum semolina flour", "1 cup unbleached all-purpose flour", "1 teaspoon kosher salt", "2 tablespoons extra-virgin olive oil", "Additional extra-virgin olive oil and kosher salt for baking the breadsticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/4 cup of the warm water in a small bowl and sprinkle over the yeast.  Add a pinch of sugar and stir the yeast to dissolve it.  Set the bowl aside to proof for 5 to 7 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the semolina and all-purpose flour in the bowl of an electric mixer along with the salt and 2 tablespoons of the sesame seeds, and stir to combine them. Check the yeast to make sure it has proofed; it will be appear foamy, with bubbles forming on the surface.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a well in the center of the dry ingredients and pour in the yeast mixture, the remaining water, and the olive oil. Attach the dough hook and knead the ingredients together on medium speed for 2 minutes; the dough will start out rough and gradually become smooth. Increase the speed to medium and continue kneading for an additional 2-3 minutes. The dough should be relatively smooth and velvety, and beginning to pull away from the sides of the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the bowl, and on a lightly floured board, knead the dough by hand until it is velvety smooth and elastic, about one minute or 30 strokes. Place the dough in a clean mixing bowl greased with olive oil, turning the dough once to coat it with the olive oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and set it in a warm, draft-free area to rise until tripled in bulk, about 2 1/2 hours.  (If you want the dough to rise overnight in the refrigerator, place it in an airtight plastic container, also greased with olive oil, that will be large enough to accommodate the dough when it has doubled in volume. The following day, remove the dough from the refrigerator and allow it to come to room temperature before proceeding with rolling and forming the breadsticks.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.  Prepare two baking sheets by adding about 1 1/2 or 2 tablespoons of additional olive oil; spread the oil out evenly on the sheets to coat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough onto a lightly floured board and divide it into 6 even-sized pieces. Work with one piece of dough at a time, and cover the other pieces with a damp towel or plastic wrap to prevent them from drying out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each piece of dough into 4 or 5 portions, about the size of a walnut in its shell.  If you have a scale, they should weigh 3/4 to 1 ounce. Form the breadsticks by rolling the pieces into a long strand with both hands, about 12 to 14 inches in length.  Keep your fingers spread apart while you roll the breadsticks, gently stretching the dough as your roll. If the dough resists, wait a few moments and let it relax, then continue rolling and pulling gently. Resist the urge to flour the board&mdash;the tackiness of the dough will help to stretch it out evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the breadstick on the oiled baking sheet and turn it, holding the ends, completely coating it with the oil. You should be able to fit 10 or 12 breadsticks on each tray; space them evenly apart by 1/2 an inch. (If you decide to roll very thin breadsticks, using smaller pieces of dough, you can space them closer together, but you may need a third baking sheet) Continue rolling the breadsticks until you have used all the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After forming all of the breadsticks, coat them with the sesame seeds, beginning with the first one you formed as it is the most relaxed and easy to work with.  Spread some of the remaining sesame seeds on your work surface in a narrow pile, about the length of the breadsticks and double the width.  Holding the end of a breadstick, gently put it on top of the seeds and then turn it over once to coat the dough generously with the seeds.  Return it to the baking sheet and continue until you have coated all the breadsticks with the sesame seeds.  (You may have some seeds leftover). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the breadsticks with a bit of kosher salt and let them rest for about 10 minutes before baking them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake them for 14 to 20 minutes, rotating the baking sheets halfway through the baking time to ensure even browning. The breadsticks are done when they are an even, light golden brown; the ends may brown more than the center but this is normal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the breadsticks to cool completely on the baking sheets.  Store them in an airtight container for up to two weeks. </p>"}]}