{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090615sevenfires.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["anchovies", "beef", "Cook the Book", "Francis Mallmann", "olives", "Seven Fires"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Braided Beef with Anchovies and Olives", "link": "https://www.seriouseats.com/recipes/2009/06/cook-the-book-braided-beef-with-anchovies-recipe.html", "description": "This recipe for Braided Beef with Anchovies and Olives from Francis Mallmann's Seven Fires is a show-stopper. It's a dish that you will want to serve when you are looking to impress, be it foodie friends or finicky in-laws. The...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Beef", "Cook the Book", "Olives"], "recipeIngredient": ["15 anchovy fillets, rinsed and patted dry", "1 cup pitted Kalamata olives", "1 center-cut beef tender loin roast, at least 12 inches long, partially butterfied", "2 tablespoons extra virgin olive oil", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush the anchovies to a paste in a mortar (or pulse in a food processor). Chop half of the olives, and crush them together with the anchovies. Cut the fillet lengthwise into 3 long strips, stopping 1 inch from the end. Spread the anchovy mixture evenly along one side of each strip. Braid the meat tightly, tying it firmly together at the end with kitchen string.  Use your palms to flatten the braid to an even thickness, then push any anchovy stuffing back into the braids. Brush the meat all over with 1 tablespoon of the olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush a <em>chapa</em> (a flat piece of cast iron set over a fire) or large cast-iron griddle with the remaining 1 tablespoon olive oil and heat over medium heat until a drop of water sizzles on the surface. Add the beef and cook without moving for 10 minutes, or until it is nicely browned on the first side. Turn the meat over and sear on the other side for about 6 minutes&mdash;the meat should be quite rare. Continue turning and cooking the meat until all the sides are seared and it is done to taste. Transfer the meat to a carving board and let rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, lightly smash the remaining olives and place alongside the meat. The juices will run together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the string, carve the beef into thick slices, and season with pepper. Serve with olives and juices.</p>"}]}