{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110610apricotsprimaryu.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["apricots", "dessert wines", "desserts", "dried fruits", "pistachios", "turkish", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Turkish Apricots Stuffed with Sweet, Thick Yogurt", "link": "https://www.seriouseats.com/recipes/2009/01/turkish-apricots-stuffed-with-sweet-thick-yogurt-recipe.html", "description": "This week, I've saved Nancy Harmon Jenkins' luscious recipe for <strong>Turkish apricots stuffed with sweet, thick yogurt</strong> for last. Dried apricots are softened in Sauternes (a French dessert wine), stuffed with sweet <strong>labneh</strong> (strained yogurt), and sprinkled with crushed pistachios.", "totalTime": null, "recipeYield": "6 servings", "recipeCategory": ["Apricot", "Cook the Book", "Desserts", "Fruit Desserts", "Nuts"], "recipeIngredient": ["3/4 pound dried apricots, preferably imported from Turkey", "1/4 cup sugar plus more to taste for the yogurt", "1/2 cup labneh (thick strained yogurt, recipe follows) made from 1 pint yogurt", "2 tablespoons sweet dessert wine such as Moscato or Sauternes", "2 tablespoons finely chopped pistachio nuts or more if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the apricots in a pan with water to cover to a depth of 1 inch. Bring to a boil and simmer, uncovered, until the apricots are plump, about 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the apricots, reserving the cooking water. Measure out 3/4 cup of the cooking water and return it to the pan with the 1/4 cup sugar. (Discard the rest of the cooking water.) Cook, stirring, until the sugar has dissolved, then add the wine. Return the apricots to the pan and continue cooking for about 20 minutes or until they are very soft. Remove the apricots and set aside to cool. Do not discard the cooking syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the apricots are cooking, blend the labneh with sugar to taste until it is smooth. Start with 2 tablespoons of sugar and add more if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the apricots are cool enough to handle, open each one and spoon in a rounded tablespoon or more of the yogurt, pressing the apricot halves around it to hold it in place. (The apricots should not be closed up over the yogurt, however. They should look like an old-fashioned whoopie pie, with the yogurt oozing out.) Arrange the apricots on a serving dish and spoon some of the reserved syrup over each one. Garnish with chopped pistachios.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Labneh: Use a colander lined with a triple layer of cheesecloth. Pour a quart of pure yogurt into the cheesecloth and set the colander in the sink or in a bowl to catch the whey. Set a plate or a piece of plastic wrap or aluminum foil lightly over the top to keep the dust off and leave for up to 24 hours. The yogurt just gets thicker as it keeps on dripping. When it's the thickness you desire, scrape it into a refrigerator container, cover it, and refrigerate it. It will keep for 10 days or more. Any whey that drifts to the top can be poured off before using.</p>"}]}