{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090904-skewers-thumb.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["apricots", "cheap eats", "chicken", "curried chicken", "curry", "Eat for Eight Bucks", "glazes", "lime"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Curried Chicken Skewers with Lime-Apricot Glaze", "link": "https://www.seriouseats.com/recipes/2009/09/eat-for-eight-bucks-curried-chicken-skewers-with-lime-apricot-glaze-recipe.html", "description": "[Photographs: Michele Humes] Shopping List 3 pounds boneless, skinless chicken thighs: $4.35 1/4 cup apricot or peach jam (pro-rated): $0.69 6 limes: $2.00 Small knob ginger: $0.28 Pantry items: Garlic, curry powder, soy sauce, peanut butter (optional) Total cost (for...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Apricot", "Eat for Eight Bucks", "Lime"], "recipeIngredient": ["<strong>For the marinade:</strong>", "<ul class=\"skinnyList\"><li>1/4 cup lime juice", "</li><li>1/4 cup soy sauce", "</li><li>1/4 cup apricot or peach jam", "</li><li>2 tablespoons white sugar", "</li><li>1 tablespoon mild curry powder", "</li><li>2 cloves garlic, coarsely chopped", "</li><li>1-inch section ginger, coarsely chopped</li></ul>", "<ul class=\"skinnyList\"><li>3 pounds boneless, skinless chicken thighs, trimmed of fat and cut into bite-sized pieces</li></ul>", "<ul class=\"skinnyList\"><li>Lime wedges for serving", "</li><li>Sweet-and-tangy peanut dipping sauce (optional; recipe follows)</li></ul>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>(recipe follows), reserve about 1/5 of the marinade before it comes into contact with the raw chicken and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the marinade over the chicken pieces. Thread the chicken onto wooden skewers that have been soaked in water overnight. Leave plenty of room so you can grab the skewer at the bottom--the meat should not extend from one end to the other</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil grill pan and place over high heat until just starting to smoke. Working in batches, lay skewers on pan and cook until the chicken develops grill marks, about 3 to 5 minutes. Turn each skewer over to brown the other side, an additional 3 to 5 minutes, or until chicken is cooked through. Test for doneness by cutting into the thickest part of the skewer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Broiler method:</strong> Preheat the broiler for at least 5 minutes and position the rack so that the skewers will be 3 inches from the heat source. Line a baking tray with aluminum foil. Place each skewer on the pan, arranging them so that the meat is in the center of the pan and the skewers slightly hang over the outside, and slide into the broiler. Broil until the chicken develops a few char spots, about 5 to 6 minutes. Turn each piece over to brown the other side, an additional 5 to 6 minutes, or until chicken is cooked through. Test for doneness by cutting into the thickest part of the skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Grill method:</strong> Oil the grill rack liberally. When the fire is hot, place each skewer on the grill, making sure that the chicken, not the skewer, is directly over the heat. Grill the chicken until it is cooked through and has begun to pick up a few crispy brown-black spots, about 2 to 5 minutes (depending on how hot the fire is). Turn the skewers over carefully and continue grilling until the other side is browned, another 2 to 5 minutes. Test for doneness by cutting into the thickest part of the skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with peanut dipping sauce and/or lime wedges for squeezing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Sweet-and-Tangy Peanut Dipping Sauce</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserve about 1/5 of the marinade before it has come into contact with the raw chicken. Take desired amount of peanut butter and dilute with enough marinade so that a dipping consistency is reached. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Variations</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Substitute orange juice for the fresh lime juice, omitting the added sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make a marinade for lamb or pork skewers, substitute redcurrant jelly for the apricot jam. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For an easy supper dish, pour marinade over chicken drumsticks and roast at 400F in a foil-lined baking dish, turning occasionally, until skin is caramelized and chicken is cooked through.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20090901skewers_pita.jpg\" src=\"https://www.seriouseats.com/recipes/images/20090901skewers_pita.jpg\" width=\"500\" height=\"308\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Serving Suggestions</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The chicken is great eaten straight off the skewer, with or without the dipping sauce, but here are a couple of delicious ways to stretch it out a bit:</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush pita breads with oil and toast on the grill or under the broiler. Cut in half and stuff with chicken pieces, diced cucumber and peanut dipping sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make lettuce cups or wraps with Boston or Bibb leaves. Serve with peanut dipping sauce.</p>"}]}