{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090917-eatfor8-thumb.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["bok choy", "cheap eats", "Eat for Eight Bucks", "healthy and delicious", "Nigel Slater", "Nigella Lawson", "noodles", "soba", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Soba with Mushrooms and a Side of Bok Choy", "link": "https://www.seriouseats.com/recipes/2009/09/soba-with-mushrooms-bok-choy-recipe.html", "description": "[Photograph: Robin Belinger] Shopping List 1 bunch baby bok choy: $2.00 12-ounce package soba noodles: $0.69 1 pound crimini mushrooms: $3.00 1 ear corn: $0.33 Knob of fresh ginger: $0.25 Cilantro (pro-rated): $0.50 Pantry items: Salt, peanut or olive oil,...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Eat for Eight Bucks", "Pasta", "Vegetarian"], "recipeIngredient": ["Salt", "6 heads baby bok choy (the kind that is 5-7 inches long), leaves separated and washed", "12 ounces soba noodles", "Peanut or olive oil", "1 pound button or crimini mushrooms, cleaned and sliced about 1/4 inch thick", "3 plump, juicy garlic cloves, 1 smashed and 2 finely chopped", "Pepper", "Kernels from 1 ear corn", "Soy sauce", "Sesame oil", "1 tablespoon finely chopped ginger", "Crushed red pepper", "2 tablespoons chopped cilantro", "2 teaspoons sesame seeds (optional garnish)", "Chili garlic sauce (optional condiment)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a 3-quart pot of water to a boil. When it bubbles, salt it lightly and plunge in the bok choy. Allow the water to come back to a boil, wait about a minute longer, and use tongs or a slotted spoon to remove the greens to a colander to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water comes back to a boil, add the soba and cook according to package instructions. (If it is finished before you need it, rinse it with cold water and leave it in another colander to drain.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the noodles boil, cook the vegetables: Heat a tablespoon of oil in a large, deep skillet or saute pan. Add the mushrooms and crushed garlic clove and cook over medium low heat, stirring infrequently, until they have released their liquid and it has begun to evaporate, 7 minutes or so. Season lightly with salt and pepper, add the corn, and cook a few minutes more, until the mushrooms and corn both look and taste ready to eat. Turn off the heat and toss with the drained soba and a few shakes of soy sauce and sesame oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can saute the bok choy while the mushrooms cook: Heat a generous tablespoon of oil in a skillet over high heat. Add the chopped garlic and ginger and a pinch of red pepper flakes; after a minute--the garlic and ginger should be fragrant but should not begin to brown--add the greens and toss for a minute or two, until they are well coated with oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish the soba with chopped cilantro and, if you like, a sprinkling of sesame seeds. Put soy sauce and sesame oil on the table (and maybe some chili garlic sauce if you have it). If the soba is a little dry for your taste, you might drizzle it with the garlicky, gingery liquid left in the boy choy skillet--it all tastes nice together.</p>"}]}