{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090820bigdealquiche.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["CSAs", "kale", "pancetta", "quiches", "The Crisper Whisperer", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: What to Do with Too Much Kale", "link": "https://www.seriouseats.com/recipes/2009/08/crisper-whisperer-what-to-do-with-too-much-kale.html", "description": "In the Crisper Featured Veg: Kale Strip: Remove leaves from stems by running thumb and forefinger along stem from bottom of leaf to top. Chop: Cut leaves crosswise into 1-inch strips. Wash: Submerge in large bowl of water and...", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Breakfast and Brunch", "Crisper Whisperer", "Eggs", "Kale", "Mains", "Pork", "Quiche"], "recipeIngredient": ["12 ounces pancetta or slab bacon, 1/4-inch dice", "1 medium red onion, diced", "4 large garlic cloves, chopped", "1 pound kale, stripped, chopped, and washed as specified In the Crisper (above)", "6 eggs", "2 cups milk", "1 cup heavy cream", "1/4 teaspoon salt", "A few good grinds of black pepper", "1 recipe Savory Pastry Dough, Baked Blind (below)", "1/3 cup grated Parmigiano Reggiano or Pecorino Romano cheese", "<strong>Ingredients for Savory Pastry Dough:</strong>", "12 ounces unbleached all-purpose flour", "8 ounces (2 sticks) unsalted butter, diced and kept in the freezer", "Big pinch of salt", "2 ounces ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Place the diced pancetta in a large frying pan. Sauté over medium-high heat until nicely browned and cooked through, lowering the heat if necessary as you go. Remove the pancetta with a strainer or slotted spoon to a paper-towel-lined plate and reserve. Pour off all but about 1 tablespoon of the fat from the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium-low. Add the diced onion to the pan and cook, stirring frequently, until beginning to soften but not brown. Add the chopped garlic and cook, stirring, one minute more. Be careful not to burn the garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the heat to medium-high. Add a large handful of the prepared kale to the pan. Cover and cook a minute or two until slightly wilted. Toss to distribute the onions and garlic so they don't burn. Add more kale to the pan by the handful. When all the kale is in the pan, add 1/4 cup water and reduce the heat to medium-low. Cook, covered, for approximately 15 minutes, stirring occasionally, until tender. If the pan becomes dry, add a few additional tablespoons of water to prevent burning. Remove from heat and mix in pancetta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the custard, crack the eggs into a large bowl and whisk until frothy. Add the milk, cream, salt, and pepper and whisk again until very frothy and well combined. Don't be shy with the whisk--the air will help prevent the solid ingredients from falling to the bottom of the custard while the quiche bakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the quiche, gently distribute half of the kale mixture onto the bottom of the blind-baked crust. Pour half the custard over top and sprinkle with half the grated cheese. Repeat with the remaining kale mixture, custard and cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 90 minutes (or up to 2 hours if necessary), until custard is just set but still jiggles slightly when agitated. Cool to room temperature and then chill until completely cold. Serve cold by the slice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Savory Pastry Dough, Baked Blind:</strong> Preheat the oven to 350°F. Combine the flour, butter and salt in the bowl of a food processor fitted with the blade. Pulse to blend until most of the mixture looks like <a href=\"http://www.bonappetit.com/tipstools/tips/2008/10/what_coarse_meal_looks_like\">coarse meal</a>, with some larger pieces of butter about the size of peas. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the motor running, add the ice water through the feed tube and blend very briefly to incorporate. Pick up a small handful of the dough and squeeze gently. If the dough holds together, turn it out onto a clean, dry work surface. If not, add more water by the teaspoonful and pulse just until it does. Do not overwork the dough, or it will get tough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the heel of your hand, smear the dough forward on the work surface in about 8 sections to distribute the butter. Working quickly, gather the dough into a disc shape, wrap in plastic wrap and refrigerate for at least 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the fridge to rest for a few minutes. On a lightly floured work surface or two overlapping sheets of parchment paper, roll out the dough to a scant 1/4-inch thickness. It should make a circle big enough to fit the bottom and sides of the ring mold or cake pan with substantial overhang (see photo <a href=\"http://blog.ruhlman.com/ruhlmancom/2009/07/the-best-quiche.html\">here</a>). Place the ring mold or cake pan on a baking sheet and line with parchment paper. Ease the dough into the ring mold or pan, making sure it lines the bottom and sides without gaps. Cut away and reserve a few pieces from the overhang to patch any holes that arise during blind baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the dough with a sheet of parchment paper and fill with dried beans or pie weights. Bake for 30 minutes. Remove the beans and parchment, patch any holes with some of the reserved dough, and bake for about 15 minutes more, until lightly browned. If any holes remain, patch with the remaining reserved dough.</p>"}]}