{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091223eggnognanaimo.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "bar cookies", "Cakespy", "Canadian", "christmas cookies", "desserts", "eggnog", "holiday baking", "holiday sweets", "nanaimo bars"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Holiday Eggnog Nanaimo Bars", "link": "https://www.seriouseats.com/recipes/2009/12/cakespy-holiday-eggnog-nanaimo-bars-recipe.html", "description": "This variation is heaped with serious holiday cheer including a spicy, nutty white chocolate top layer and a rich, creamy, eggnog-and-booze-infused middle layer.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["<strong>For the bottom layer:</strong>", "1/2 cup unsalted butter", "1/4 cup sugar", "5 tablespoons cocoa", "1 egg, beaten", "1 1/4 cups graham cracker crumbs", "1/2 cup finely chopped pecans (optional)", "1 cup shredded coconut (sorry, coconut haters: this is <em>not</em> optional)", "<strong>For middle layer:</strong>", "1/2 cup unsalted butter", "1/4 cup eggnog", "2 tablespoons vanilla custard powder or instant vanilla pudding powder", "2 cups confectioners' sugar", "1/2 teaspoon salt", "1/2 teaspoon nutmeg", "/2 tablespoon bourbon, if desired (Note: if you do add the bourbon, you might want to add a little bit more confectioners' sugar to the mix to ensure that the middle layer isn't too soft; you want the consistency to be like a very thick buttercream frosting)", "<strong>For top layer:</strong>", "4 ounces of white chocolate (this is about the size of a large Lindt bar)", "More nutmeg, to sprinkle on top (optional)", "1/2 cup pecan pieces (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare bottom layer. Melt the butter, sugar, and cocoa in a double boiler until fully incorporated, but do not let the mixture come to a boil. Add the beaten egg and stir constantly until the mixture begins to thicken. Remove from heat and stir in the graham cracker crumbs, coconut, and nuts. Press down firmly into a parchment-lined (trust me, this will make your life much easier when you try to remove them) 8 x 8-inch pan; try to make the mixture as flat as possible in the pan. Let this cool for about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the middle layer. Cream the butter, eggnog, instant pudding powder, salt, and confectioners' sugar together, beating until the mixture is light and fluffy. Add in the bourbon last, mixing only until incorporated; if the mixture is too thin, add a few more tablespoons of confectioners' sugar until it has reached a thick, spreadable consistency. Spread over bottom layer, once again trying to make the surface as flat as possible. At this point, I like to put the pan in the refrigerator, as it is easier to spread the top layer on when the buttery middle layer is a bit more solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the top layer. Melt white chocolate very slowly over low heat (you might want to use a double boiler). Once fully melted and smooth, remove from heat and allow to solidify to the point where it is thick but still pourable. Pour over second layer as quickly as you can, spreading it quickly with a spatula so that the middle layer doesn't begin to melt. Immediately scatter the pecans on top of the white chocolate layer and sprinkle the nutmeg on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the bars cool for at least one hour in the refrigerator before serving.</p>"}]}