{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bobby Flay", "Bobby Flay's Burgers Fries and Shakes", "Cook the Book", "french fries", "fries", "plantains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Plantain Shoestring Fries", "link": "https://www.seriouseats.com/recipes/2009/07/cook-the-book-plantain-shoestring-fries.html", "description": "Plantains are not that popular in the U.S., but the rest of the world eats them up. They are a starchy staple of many tropical countries' diets. Wikipedia lists no fewer than 23 regional dishes that revolve around plantains. In...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Burger", "Cook the Book"], "recipeIngredient": ["1 tablespoon kosher salt", "2 tablespoons grated lime zest", "1/4 teaspoon cayenne pepper", "5 cups peanut oil", "4 green plantains"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the salt, lime zest, and cayenne in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a heavy-bottomed medium stockpot over medium heat, or a tabletop deep fryer, to 375&deg F.  Line a baking sheet with paper towels and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oil is heating, peel the plantains.  To peel the plantains: use a sharp knife to cut off the top and bottom ends.  With the tip of the knife, make one slit in the skin of the plantain from top to bottom.  Run the plantain under cold water and use your thumb and fingers to work the peel away from the fruit, beginning at the slit.  Cut 1/2 inch off the ends of each plantain, then slice the plantains lengthwise with a U-shaped peeler or a mandoline into very thin strips ( about 1/8 inch thick).  Cut each strip lengthwise into 1/8-inch-thick fries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry in batches, turning frequently, until golden brown, about 45 seconds.  Remove with a mesh skimmer to the baking sheet lined with paper towels and season immediately with the salt mixture.</p>"}]}