{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091221rancheroshash.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["brunch", "chorizo", "eggs", "entertaining", "huevos rancheros", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Rancheros Hash Stacks", "link": "https://www.seriouseats.com/recipes/2009/12/rancheros-hash-stacks-brunch-party-entertaining-recipe.html", "description": "[Photograph: Tara Mataraza Desmond] If you're hosting a post-holiday or New Year brunch, consider adding these to the menu for versatility and ease. You can make the sauce and toast the tortillas a day or two ahead of time....", "totalTime": "", "recipeYield": "serves 4", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["1 teaspoon vegetable oil", "1/4 pound fresh chorizo (about 1 link)", "1 small onion, diced small", "2 garlic cloves, minced", "1 1/2 cups crushed tomatoes", "1/4 to 1/2 cup water", "1 1/2 cups cooked black beans (or your favorite variety)", "1 teaspoons ground cumin", "Coarse salt and freshly ground black pepper", "8 corn tortillas", "4 eggs, any style", "4 scallions, sliced thin", "1/2 cup loosely packed cilantro leaves, lightly chopped", "4 ounces grated cheddar cheese ", "Sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat the bottom of a large sauté pan with the vegetable oil and set over medium-high heat.  When the pan is very hot, squeeze the chorizo out of its casing and add the sausage to the pan in small pieces.  Let the meat brown for about 5 minutes, breaking the pieces up into tiny bits with a wooden spoon as it cooks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onion and garlic, reduce heat to medium and sauté for 7-10 minutes, until the onions are soft.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the tomatoes, water, beans and cumin. Bring to a simmer, cover and reduce heat to medium-low.  Simmer for 20-30 minutes to let the flavors come together.  Season the sauce to taste with salt and pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the tortillas in a 350° F oven for about 10 minutes until crisp. Alternatively, fry the tortillas: add about 1 cup of vegetable oil to a high-sided sauté pan over medium-high heat.  When bubbles spurt rapidly around the handle end of a wooden spoon set in the oil, the oil is ready for frying.  Lower the tortillas one at a time into the hot oil, frying about 1 minute per side.  Transfer each tortilla to a paper-towel lined plate and sprinkle with salt.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the eggs to order. Any style works well with these stacks.  Poached or sunny side egg yolks enrich the sauce when poked and drizzled into the rest of the dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the eggs are ready, assemble the stacks.  Put 1 baked tortilla on a plate and top with about 1/2 cup of the hot sauce and a sprinkle of cheese.  Add another crisp tortilla, top with 1/2 cup more sauce, and another sprinkle of cheese.  Top with an egg, scallions, cilantro and sour cream.</p>"}]}