{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-sobawithtofuandredpepper.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["asparagus", "Dinner Tonight", "noodles", "red pepper", "soba", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Soba Noodles with Asparagus, Red Pepper, and Tofu", "link": "https://www.seriouseats.com/recipes/2009/06/soba-noodles-with-asparagus-red-pepper-tofu-recipe.html", "description": "I picked this recipe from the Perfect Pantry mainly because of the sauce, which somehow manages to successfully combine soy sauce, hoisin, Sriracha, lime juice, and agave nectar. (I only stash the last one in my pantry for cocktails.) But...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Asparagus", "Dinner Tonight", "Pasta", "Tofu"], "recipeIngredient": ["3 tablespoons soy sauce", "2 tablespoons hoisin sauce", "1 1/2 teaspooon sriracha ", "1 1/2 teaspoons agave nectar (or honey)", "1 1/2 teaspoons lime juice", "6 ounces soba noodles ", "3 tablespoons canola oil", "6 ounces tofu ", "1/2 pound asparagus, woody stems remoed, cut into 1-inch pieces", "2 scallions, thinly sliced", "1/2 red pepper, stem removed, thinly sliced", "1/2 cup peanuts, roughly chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the soy sauce, hoisin sauce, Sriracha, agave nectar, and lime juice to a bowl.  Whisk until combined.  Pour half of the sauce into another bowl.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the block of tofu between two kitchen towels.  Press down gently to remove as much water as possible without breaking up the tofu.  Chop into half-inch cubes.  Add the tofu to one of the bowls of sauce.  Let it marinate for at least 20 minutes, stirring every 5 minutes or so to make sure it is covered in sauce.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to a boil.  Cook the soba according to the directions on the packaging.  Toss into a colander and rinse under cold water to stop the cooking.  Let the soba drain in the colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two tablespoons of the oil into a large skillet set over medium-high heat.  Add the asparagus, scallions, and the bell pepper and cook for about 3 minutes, stirring occasionally, until cooked.  Set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tofu from the sauce, quickly pat dry with some paper towels.  Pour the rest of the oil into the skillet, and then add the tofu.  Cook for about 2 to 3 minutes, stirring occasionally to get browned on all sides.         </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the other half of the sauce over the soba noodles, and stir well.  Add the vegetables and the tofu, and garnish with the peanuts.  Serve at room temperature, or, better yet, cold.  </p>"}]}