{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091127-dt-turkey-pot-pie.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["pies", "pot pies", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Dinner Tonight: Leftover Turkey Pot Pie", "link": "https://www.seriouseats.com/recipes/2009/11/leftover-turkey-pot-pie-recipe.html", "description": "[Photograph: Nick Kindelsperger] You've got a lot of turkey and you don't quite know what to do with it. We've all been there. Lunch today was a turkey sandwich with cranberry sauce smeared on bread with gooey stuffing in between....", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Chicken", "Dinner Tonight", "Turkey"], "recipeIngredient": ["3 discs store-bought pie crust", "2 cups leftover turkey, shredded (or simmer uncooked meat in a little stock until cooked)", "1 stick unsalted butter", "1/2 cup flour", "2 1/2 cups turkey or chicken stock", "1 1/2 cups milk", "1 large onion, diced", "3 carrots, chopped", "3 celery stalks, chopped", "Small handful parsley, roughly chopped", "Salt and pepper to taste", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heavy skillet or saucepan, melt the butter over medium heat.  Add the onion, carrot, and celery, and cook until soft and golden.  Sprinkle in the flour and cook for an additional minute, then whisk in the stock vigorously to avoid any lumps.  Whisk in the milk and bring to a simmer, then turn the heat to low and allow to thicken, stirring often, for 10 minutes or so. Stir in the turkey and parsley, then season to taste with salt and pepper, keeping in mind that the stock might have been salty already.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Arrange six 10-ounce ramekins (or use a smaller number of larger ones) on a baking sheet.  Roll out the pie crusts on a floured surface until large enough to make rounds to cover the ramekins with a little extra around the edges. Extra dough around the edges can be balled up and rolled out again, as necessary. It should be about 1/4-inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the filling into the ramekins and cover with the crust rounds.  Tuck the edges back under, and slash the top to vent it.  Beat the egg in a small bowl with a tablespoon of water, then brush it into the crust surfaces.  Bake until the crust is golden and the filling is bubbling, about 25 to 30 minutes. </p>"}]}