{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090528chessmen.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["Cookies", "French", "French in a Flash", "lemon verbena", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Tisane Shortbread Cookies with Lemon Verbena", "link": "https://www.seriouseats.com/recipes/2009/05/french-in-a-flash-tisane-shortbread-cookies-lemon-verbena-recipe.html", "description": "\"My white paper knight made from white sugar, white butter, white flour, and a pinch of white salt. My soul mate.\" I like to tell myself that I have only lied once in my life. I must have been about...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts", "French"], "recipeIngredient": ["2 sticks butter, room temperature", "3/4 cup sugar, plus extra for sprinkling", "Zest of 2 lemons", "2 cups flour", "1/2 teaspoon salt", "1 heaping tablespoon finely ground verbena (3 tea bags)", "<h5>A Note about Some Ingredients</h5>", "<strong><a href=\"http://en.wikipedia.org/wiki/Lemon_Verbena\">Lemon verbena</a></strong> is a standard on the French tisane, or herbal tea, menu.  It is harder to find in the States, although I often find it in its Lipton form at South American or other imported markets.  I have included an Amazon seller <a href=\"http://www.amazon.com/Lemon-Verbena-Leaf-1-oz/dp/B0001BMPQ0/?ref=serieats-20\">here</a>.  If you can't find verbena, you could certainly try switching up flavors.  Try your favorite herbal tea; I would go with chamomile."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle attachment, cream together the butter, sugar, and lemon zest until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour and salt together, and stir in the verbena.  If you are using whole leaf verbena, and not tea verbena, you'll want to run it through the food processor to get it very fine.  Add the dry ingredients into the wet in three batches, restarting the mixer on low speed, and then raising it to medium.  When everything is just combined, stop mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the dough into two parts, and place each half on a large sheet of plastic wrap.  Roll the dough into two logs about 2 inches in diameter and wrap in plastic.  Refrigerate until cold throughout, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.  Take the dough out of the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the dough has sat out for about 10 minutes, carefully cut the dough into 1/2-inch thick discs, trying not to crumble the dough.  Lay the discs onto a baking sheet. Sprinkle lightly with a dusting of sugar to form a sparkling, firm crust on the top of each cookie.  Bake for about 20 minutes, until golden and firm.  Allow to stand for a few minutes, until they are firm enough to move.  Remove to a wire rack to cool, and serve with tea.</p>"}]}