{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/tofu%20egg%20dashi.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Japanese", "keywords": ["chicken", "chicken skin", "dashi", "Seriously Asian", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: Scrambled Tofu", "link": "https://www.seriouseats.com/recipes/2009/12/seriously-asian-scrambled-tofu-iri-dofu-recipe.html", "description": "\"The meal satisfies meat devotees and tofu lovers alike.\" [Photographs: Chichi Wang] Previously Steamed Chocolate Cake » All Seriously Asian recipes » Wondering what to do with all those leftover birds from the holidays? Roast any ham hocks with the...", "totalTime": "", "recipeYield": "4 as a main dish", "recipeCategory": ["Chicken", "Japanese", "Tofu"], "recipeIngredient": ["1 block firm or medium-firm tofu, about 10 oz", "approximately 2 oz of chicken skin, about six 2-inch sections", "3 shitake mushrooms, thinly sliced", "1/2 carrot or a 2 inch section of daikon, julienned", "1/2 cup dashi", "2 tablespoons mirin", "2 tablespoons soy sauce", "1/2 teaspoon salt", "3 eggs", "<strong>1.</strong> Heat a skillet over low heat.  Add the strips of chicken skin, slowly rendering the fat until the skin is golden brown and crispy.  If desired, set aside a few strips of chicken skin to add later.", "<strong>2.</strong> Turn the heat to medium high.  Add the mushrooms, sauteeing for three to four minutes until the surface of the mushroom is lightly golden brown.  Add the carrots and stir around for a minute to soften.  ", "<strong>3.</strong> Using your fingers, crumble the tofu into the pan.  Add a bit of oil, if necessary, to continue browning the tofu.  After a few minutes, when the tofu is drier, add all of the dashi, soy sauce, salt, and mirin. ", "<strong>4.</strong>  Over medium heat, simmer the ingredients in the dashi mixture until the liquid is almost completely reduced.  Turn off the heat and crack the eggs into the pan, stirring around to evenly coat the tofu mixture.  If necessary, finish co"], "recipeInstructions": []}