{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091116SquashSauce.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["fall recipes", "Meat Lite", "pasta", "sage", "spaghetti", "squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Meat Lite: Spaghetti with Squash-Sausage-Sage Sauce", "link": "https://www.seriouseats.com/recipes/2009/11/meat-lite-spaghetti-with-squash-sausage-sage.html", "description": "[Photograph: Joy Manning] A lot of people think it's hard to make fresh pasta, but it isn't such a big deal, especially if you aren't attempting to roll out super-thin sheets for ravioli. Most machines come with a spaghetti attachment...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Mains", "Meat Lite", "Pasta", "Squash"], "recipeIngredient": ["<strong>For the spaghetti</strong>", "400 grams (about 2 1/2 cups) all purpose flour", "4 large eggs", "2 teaspoons olive oil", "<strong>For the sauce</strong>", "1 small butternut squash, seeds removed", "2 teaspoons olive oil", "1/4 teaspoon salt", "4 to 6 ounces Italian sausage (hot or sweet is up to you), removed from casings and crumbled", "1/2 cup diced shallot", "1 teaspoon minced sage leaves", "1 1/4 cup chicken stock, divided", "2 ounces grated parmesan or Romano cheese, plus more for passing at the table", "1/2 to 1 cup pasta cooking liquid"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pasta, mix the flour, eggs, and olive oil in a food processor until a dough ball begins to form. Transfer the dough to a clean work surface, and knead by hand until it is elastic and satiny, about 5 to 10 minutes. Wrap in plastic, and let rest while you make the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, preheat the oven to 350°F. Drizzle the olive oil over the squash and season with the salt. Roast, cut side down, for 30 minutes or until browned at the edges and completely tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the squash roasts, sauté the sausage over medium-low heat until the fat has rendered and the sausage is brown, about 10 minutes. Add the shallots and sage leaves; sauté until the shallots are softened and starting to brown, about 10 minutes. Deglaze the pan with about 1/4 cup of the stock. Scrape the roasted squash from its skin and add it to a blender with the remaining stock and puree. Add the purée to the sausage, shallot, and sage mixture.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta dough into 8 pieces. Using a pasta machine, roll out each piece of pasta dough into progressively thinner sheets until it reaches a medium thinness&mdash;on my machine it's setting 4 on a scale of 1 to 6. Use the spaghetti attachment to form the noodles. Toss with flour, and set aside while you bring a pot of salted water to a rolling boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the spaghetti for about 6 minutes; taste to check for doneness. Add to the squash sauce; toss to coat. Add the cheese and enough pasta cooking liquid to make the sauce your preferred consistency. Taste, and add additional salt and pepper if you like. Serve in bowls, passing extra cheese at the table if desired. </p>"}]}