{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090908-dishingupvermont.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "creme caramel", "custards", "desserts", "Dishing Up Vermont", "maple syrup", "Tracey Medeiros"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Maple Crème Caramel", "link": "https://www.seriouseats.com/recipes/2009/09/maple-creme-caramel-recipe.html", "description": "This version of crème caramel uses reduced maple syrup in place of the traditional caramel to give it an uniquely Vermont accented flavor. The beauty of this dessert lies in its presentation. The custard is loosened from its cup and inverted onto a serving plate so that the maple caramel in the bottom of the ramekin drips down the sides and into a beautiful puddle. I'm not going to make a stink about Mrs. Butterworth's on my pancakes, but only Vermont maple syrup will do for this recipe.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cook the Book", "Desserts", "Puddings and Custards"], "recipeIngredient": ["1/2 cup pure maple syrup, preferably Vermont-made", "1/3 cup pure maple syrup, Vermont Grade B", "5 farm-fresh egg yolks", "1 teaspoon pure vanilla extract", "1 teaspoon ground cinnamon", "2 cups whipping cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 275&deg;F. Lightly butter six (3/4-cup) ramekins and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer 1/2 cup maple syrup in a small saucepan over medium heat for about 10 minutes, until syrup is reduced to a thick pouring consistency.  Don't overcook or you will make candy. Immediately pour caramel into prepared ramekins to coat sides with some of the caramel. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the custard: Whisk Grade B maple syrup, egg yolks, vanilla, and cinnamon in a medium bowl to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the cream in a medium saucepan until just boiling.  Gradually whisk hot cream into the yolk mixture, then divide the mixture among the prepared ramekins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the ramekins into a baking pan and fill the pan with hot water halfway up the sides of the ramekins. Cover the baking pan with foil, carefully transfer to the oven, and bake for 50 minutes. During the last 10 minutes of baking, check the custards to make sure that the center is set and a little wiggly but not totally cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the custards from the water and chill uncovered in the refrigerator until cold, at least 4 hours. Custards can be made one day ahead but make sure to cover once they are cold. Keep refrigerated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, run a knife around the edges of the ramekins to loosen custards, and invert onto dessert plates.</p>"}]}