{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2009", "almonds", "America's Test Kitchen Family Baking Book", "baking", "Cookies", "desserts", "holiday baking", "Jam"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jam Thumbprints", "link": "https://www.seriouseats.com/recipes/2009/12/jam-thumbprints-recipe.html", "description": "The following recipe is from the December 23 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! The whole time that I was baking these Jam Thumbprints from America's Test Kitchen Family Baking...", "totalTime": null, "recipeYield": "about 4 dozen cookies", "recipeCategory": ["Desserts", "Nuts"], "recipeIngredient": ["1/2 cup seedless raspberry jam", "2 1/4 cups (11 1/4 ounces) all-purpose flour", "1/2 teaspoon salt", "1/2 teaspoon baking soda", "1/4 teaspoon baking powder", "12 tablespoons (1 1/2 sticks) unsalted butter, softened", "2/3 cup (4 2/3 ounces) sugar", "3 ounces (6 tablespoons) cream cheese, softened", "1 large egg", "1 1/2 teaspoons vanilla extract", "1/2 teaspoon almond extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven racks to the upper-middle and lower-middle positions and heat the oven to 350&deg;F. Line two large baking sheets with parchment paper. Fill a small zipper-lock bag with the jam. Whisk the flour, salt, baking soda, and baking powder together in a medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat the butter and sugar together with an electric mixer to medium speed until light and fluffy, 3 to 6 minutes. Beat the cream cheese, egg, and vanilla until combined, about 30 seconds, scraping down the bowl and beaters as needed.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to low and slowly add the flour mixture until combined, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with 1 1/2 teaspoons of the dough at a time, roll the dough into balls and lay them on the prepared baking sheets, spaced about 1 1/2 inches apart.  Make an indentation in the center of each cookie with your thumb.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies, one sheet at a time, until they are just beginning to set and are lightly browned around the edges, about 10 minutes. Remove the cookies from the oven and, working quickly, gently reshape the indentation with the bottom of a teaspoon measure. Snip a small corner off the bag of jam and carefully fill each indentation with about 1/2 teaspoon of the jam. Rotate the baking sheet and continue to bake until lightly golden, 12 to 14 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cookies cool on the baking sheets for 10 minutes, then transfer to a wire rack and let cool completely, about 20 minutes, before serving. </p>"}]}