{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090312-bakedcod-thumb.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["cod", "fish", "Italian", "mains", "seafood", "Seriously Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Italian: Sicilian-Style Baked Cod", "link": "https://www.seriouseats.com/recipes/2009/03/seriously-italian-sicilian-style-baked-cod-recipe.html", "description": "Editor's note: On Thursdays, Babbo pastry chef Gina DePalma checks in with Seriously Italian. After a stint in Rome, she's back in the States, channeling her inner Italian spirit via recipes and intel on delicious Italian eats. Take it away,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Fish", "Italian", "Mains"], "recipeIngredient": ["1 medium or 1/2 of a large red onion", "2 tablespoons olive oil", "1 tablespoon red wine vinegar", "12 to 16 ounces firm white fish fillet, cut in 3 to 4-ounce portions", "1/2 teaspoon anchovy paste", "3 tablespoons dried breadcrumbs", "3 or 4 sprigs fresh, flat-leaf parsley", "8 to 10 fresh mint leaves", "3 or 4 large fresh basil leaves", "Salt and freshly ground pepper to taste", "1/2 cup dry white wine or water", "10 to 12 oil-cured black olives, cracked and pitted "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the onion into quarters, then cut the quarters crosswise and separate the layers to create wide, square slices. In a sauté pan, heat 1 tablespoon of olive and add the onion. Season with salt and pepper, and sauté over low heat until the onion has wilted and started to turn translucent; be careful not to let it brown.  Add the red wine vinegar to the pan and shake it briefly, then transfer everything to the bottom of a medium-sized baking dish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe the pan with a paper towel to clean it, then place it back over low heat and add the remaining tablespoon of olive oil. Add the anchovy paste and stir with a wooden spoon to dissolve the paste into the oil. Dump the breadcrumbs into the pan and stir to completely coat them with the oil. Transfer the breadcrumbs to a small bowl to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the herbs, pat them dry, and finely chop them. Add them to the bowl with breadcrumbs, and season everything with a small pinch of salt and a few grinds of black pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the portioned fish on top of the onions and season with a bit more salt and pepper. Distribute the breadcrumb-herb mixture evenly on top of the fish. Add the white wine or water to the pan and scatter the olives around the dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the fish for 15 to 20 minutes, depending on the thickness of the fish; it should be cooked through but still moist; check the pan after 10 minutes and add a bit more water or wine if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, with the some of the onions, olives and pan juices spooned alongside the fish.</p>"}]}