{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-paprikaroastchicken.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "paprika", "poultry", "roast chicken"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Paprika Roast Chicken", "link": "https://www.seriouseats.com/recipes/2009/01/dinner-tonight-paprika-roast-chicken-recipe.html", "description": "It all started with some really good fried chicken. It was tangy from dip in buttermilk, and yet his this incredible spicy edge from a poultry shake from an Alton Brown recipe. Unlike most fried chicken recipes, he recommended placing...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["1 chicken", "2 tablespoons paprkia", "2 tablespoons kosher salt", "2 teaspoons garlic powder", "1 teaspoon cayenne pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees.  Loosen the skin of the chicken by carefully sticking your fingers between the skin and the meat.  It's best to get half of the breast done from the bottom of the bird, and then loosening the skin from the hole on top to get the other half.  The legs require a little more patience.  You'll have to go from the base of the leg and work from there.  The skin tears easily, so be careful.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together the paprkia, salt, garlic powder, and cayenne pepper.  Rub the seasoning underneath the skin where ever possible.  Be sure to sprinkle in the cavity of the bird.  Try to leave a tablespoon or so to sprinkle on at the end.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in a roasting pan, and stick in the oven.  Cook for about 50 minutes to an hour, or until the temperature is right around 165.  Remove and let rest for 10 minutes.  Then carve up and serve.  Sprinkle a little of the reserved shake on at the end.</p>"}]}