{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["chicken", "fried chicken", "pan-fried chicken", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Pan Fried Chicken Sandwich", "link": "https://www.seriouseats.com/recipes/2009/05/sunday-brunch-pan-fried-chicken-sandwich.html", "description": "I don't know why, but Memorial Day always puts me in a fried chicken state of mind (of course, I'm in a fried chicken state of mind just about every day). A couple of months ago I had a great...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Deep Frying", "Fried Chicken", "Sandwiches"], "recipeIngredient": ["1 cup buttermilk", "1/4 cup honey", "2 tablespoons Dijon mustard", "Salt and freshly ground pepper", "2 boneless chicken breasts, skin-on, split", "1 cup all-purpose flour for dredging, plus additional if necessary", "1 cup grapeseed, corn, canola, or other neutral oil", "4 biscuits (canned will do just fine)", "1 cup of your favorite slaw, either store-bought or homemade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the buttermilk, honey, and mustard with 2 teaspoons salt and 1 teaspoon pepper in a shallow baking dish. Add the chicken and coat well. Cover and marinate the chicken or at least 3 hours, or as long as overnight (in the refrigerator).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour in a wide, shallow dish--a pie plate works great--and season it with a little salt and pepper. Remove the chicken from the marinade, letting it drain for a second or two after you pull it from the baking dish, then dredge each piece in the seasoned flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil over medium heat in a skillet or saute pan large enough to accommodate the chicken without crowding. Let the oil heat for a full minute, then add the chicken. Cook it for 6 to 7 minutes a side, until golden brown. Turn the heat down to medium after you flip the meat. Meanwhile, bake the biscuits. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble the sandwiches: a pan fried chicken breast half on each biscuit bottom, topped with a few heaping tablespoons of cole slaw and a dab of mayo, and the top of the biscuit, of course.</p>"}]}