{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090713-chinese-spare-ribs.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "grilling", "rib", "ribs", "spare ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Grilling: Chinese-Style Spare Ribs", "link": "https://www.seriouseats.com/recipes/2009/07/grilling-chinese-style-spare-ribs-recipe.html", "description": "Each week Joshua Bousel drops by with a recipe for you to grill over the weekend. Fire it up, Joshua! On the commute to work a couple weeks ago, my co-worker and I were lamenting that for each excellent Chinese...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chinese", "Grilling, Smoking, and Barbecue", "Pork"], "recipeIngredient": ["1/3 cup hoisin sauce", "1/4 cup soy sauce", "3 tablespoons dry sherry", "2 cloves garlic, finely chopped", "2 tablespoons. sugar", "3/4 teaspoon. red food coloring", "1/4 teaspoon Chinese five spice powder", "1 2-pound slab spareribs, preferably St. Louis style, cut into individual ribs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together hoisin, soy, sherry, garlic, sugar, food coloring, and spice powder in a large bowl. Place ribs in a large ziploc bag and pour in the marinade.  Seal the bag and toss to coat ribs evenly.  Open and reseal the bag, removing as much air as possible.  Place in the refrigerator and marinate for one hour to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove ribs from the refrigerator while preparing grill.  Light a chimney 3/4 full of charcoal. When the charcoal is fully lit and covered in gray ash, pour coals out and arrange them on one side of the charcoal grate, keeping the other side empty.  Place the ribs on the cool side of the grill, reserving marinade.  Cover and cook at 350 degrees for 35 minutes.  Baste ribs with reserved marinade; flip and baste again.  Cover and continue to cook for 35 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Baste with remaining marinade and move ribs directly over the coals.  Grill unto ribs are glazed and browned, about 5 to 10 minutes more.  Remove from the grill, let cool for 5 minutes, and serve.</p>"}]}