{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "eggs", "Francis Mallmann", "ham", "omelets", "potatoes", "recipe newsletter", "Seven Fires"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Omelet Gramajo", "link": "https://www.seriouseats.com/recipes/2009/06/omelet-gramajo-recipe.html", "description": "The following recipe is from the June 17 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Omelet Gramajo is served in cafes and bodegas all over Argentina. There are many different stories...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Ham", "Omelettes", "Potato"], "recipeIngredient": ["2 red potatoes, about 6 ounces each, scrubbed", "2 cups vegetable oil, for frying", "2 tablespoons extra virgin olive oil", "4 thin slices jamón ibérico or other top-quality air-dried ham, such as serrano or proscuitto ", "4 large eggs ", "Coarse sea salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a mandoline or sharp knife, cut the potatoes into a fine julienne.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the vegetable oil in a 10-inch cast-iron skillet or Dutch oven to 360&deg;F. Add the potatoes, in batches if necessary, and cook for about 2 minutes, until golden. Remove with a slotted skimmer and drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the olive oil in a <em>chapa</em> (a flat piece of cast iron set over a fire) or 12-inch cast-iron skillet over medium heat.  Add the ham and crisp for about 15 seconds. Remove to paper towels to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 1 tablespoon olive oil on the same cooking surface over medium heat. Lightly beat the eggs and pour them in. Flip the edges with a spatula as the eggs cook to allow the uncooked portion to reach the pan surface. The eggs should be golden on the bottom&mdash;if necessary, lower the heat so that they do not brown. When the omelet is set on the bottom but still slightly runny on top, place the potatoes on one half of the omelet, and then the crisped ham.  Use a wide spatula to fold over the other half of the omelet, and slide it onto a serving dish. Sprinkle with salt and pepper and serve immediately.</p>"}]}