{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-spanishtortilla.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Spanish", "keywords": ["eggs", "potatoes", "spanish", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Tortilla Espanola", "link": "https://www.seriouseats.com/recipes/2009/06/dinner-tonight-tortilla-espanola-recipe.html", "description": "When I was complaining last week about wanting some kind of egg pie to slice up for dinner, this is exactly and precisely what I meant. Though I've written about a Spanish Tortilla on Serious Eats before, it was a...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Eggs", "Potato", "Spanish", "Vegetarian"], "recipeIngredient": ["3/4 cup olive oil ", "1 pound potatoes (Russet or Yukon gold), peeled, quartered and thinly sliced", "1 medium onion, quartered and thinly sliced", "6 eggs ", "Salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large nonstick skillet set over medium-high heat.  Carefully toss in the potatoes and onion. Cook for 20 minutes, stirring and folding the mixture over every other minute. They should be soft but not brown. Transfer the mixture to a colander set over a bowl. Drain for minute.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a large bowl. Add a big pinch of salt and a few cracks of pepper. Whisk until combined. Add the potato and onion mixture to the eggs. Stir until combined. Season again with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Replace the pan over medium heat and pour egg/potato mixture into it, flattening with a rubber spatula. Cook, shaking gently until bottom is golden brown and set, about 5 minutes. Place a large plate over the pan and carefully invert the tortilla. Slide the tortilla back into the skillet and continue to cook, shaking gently, until golden brown on second side and barely set in center, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tortilla and place on a cutting board. Let cool for 10 minutes or so. Then cut into wedges and serve with more salt and pepper to taste.     </p>"}]}