{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20081107MarioBook.jpg", "author": {"@type": "Person", "name": "Ed Levine"}, "recipeCuisine": "", "keywords": ["brunch", "cheese", "eggs", "frittata", "Mario Batali", "Mother's Day", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Mother's Day Sunday Brunch: Frittata with Spinach and Cheese", "link": "https://www.seriouseats.com/recipes/2009/05/easy-mothers-day-sunday-brunch-frittata-with.html", "description": "I'm going to make this Frittata with Spinach and Cheese, adapted from Mario Batali's encyclopedic Molto Italiano, for Vicky's family today. Why not? It's perfect Mother's Day fare. It looks great, all golden brown and bubbly; it tastes great, all...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Cheese", "Eggs", "Spinach"], "recipeIngredient": ["2 pounds spinach, tough stems removed and rinsed well", "2 tablespoons extra-virgin olive oil ", "1 onion, finely chopped", "8 large eggs", "1/4 cup fresh or aged sheep or goat cheese (cheddar will also do just fine)", "1/4 cup freshly grated Parmigiano-Reggiano", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 6 quarts of water to a boil in a large pot, and add 2 tablespoons salt. Set up the an ice bath next to the stove. Plunge the spinach into the boiling water and cook for 2 minutes. Drain and transfer to the ice bath until chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the spinach from the ice bath and drain in a colander, then place between two plates and squeeze out the excess liquid. Place in a kitchen towel and twist to dry further, then place on a cutting board and finely chop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 9-inch nonstick saute pan, heat the olive oil over medium heat until hot. Add the onion and cook, stirring, until soft, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium bowl, beat the eggs to blend. Add the spinach, cheeses, and salt and pepper to taste and mix well to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the egg mixture into the skillet and cook until the bottom has set, about 5 minutes. Hold a flat plate over the pan and invert the frittata onto the plate, then slide it back into the pan. Cook until just about set, about 5 minutes more, and serve hot.</p>"}]}