{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/smallkofta.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["chicken", "Meat Lite", "middle eastern", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Veggie-Chicken Koftas", "link": "https://www.seriouseats.com/recipes/2009/02/veggie-chicken-koftas-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by the book coauthored by the two, Almost Meatless, due out in spring....", "totalTime": "", "recipeYield": "serves 4", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["8 ounces boneless, skinless chicken thighs (about two thighs)", "1 3/4 teaspoons kosher salt, divided", "1/2 teaspoon cumin, divided", "Pinch of cayenne", "10 grinds of black pepper", "1 small eggplant (about 12 ounces), peeled and grated", "2 tablespoons canola oil", "1/2 large onion, minced, about 1 cup", " 2 garlic cloves, minced", "1/2 cup shelled, roasted, and salted pistachios", "2 tablespoons plain Greek-style yogurt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim any excess fat from the chicken thighs and cut into 1-inch chunks. Sprinkle the chicken with 1/4 teaspoon salt, 1/4  teaspoon cumin, the cayenne, and the black pepper. Put the seasoned chicken in a sealed container and refrigerate and until needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the shredded eggplant in a colander and toss with 1 teaspoon salt. Drain (over the sink or over a bowl) for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the eggplant is draining, heat the canola oil over medium heat in a large saute pan and add the onions, 1/2 teaspoon salt and 1/4 teaspoon cumin. Cook, stirring often, for about 15 minutes, until the onions have softened and begin to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the eggplant thoroughly with cold water. Place the eggplant in the center of clean kitchen towel and squeeze dry. Add to the saute pan with the onions. Add the garlic. Cook, stirring almost constantly, for another 15 minutes, until the eggplant is tender and the mixture is lightly browned. Spread the mixture out onto a dinner plate and place in the refrigerator or freezer until chilled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the vegetable mixture is completely chilled, add the reserved chicken chunks, the vegetable mixture, the pistachios, and the yogurt to a food processor. Process in 1-second pulses until a paste forms but you can still see small bits of chicken. Form into rounded tablespoon-sized balls and flatten into disks. Chill in the refrigerator for at least 1 hour or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook, preheat your broil and place koftas on a foil-lined baked dish about 4 to 6 inches from the heating element. Cook two to four minutes per side, until some charring appears and kofta are cooked through.  </p>"}]}