{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091005thecraftofbaking.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baking", "candy", "chocolate", "Cook the Book", "desserts", "Karen DeMasco", "The Craft of Baking", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: White Chocolate Truffles", "link": "https://www.seriouseats.com/recipes/2009/10/cook-the-book-white-chocolate-truffles-recipe.html", "description": "As someone who needs no convincing about the glories of white chocolate, I was eager to try Demasco's <strong>White Chocolate Truffles</strong> with lemon zest and pistachios. Melting the chocolate and the lemon zest together releases the fragrant oils into the creamy chocolate, cutting the sweetness with a hint of acid. I left my pistachios ground a little less than fine for the truffle coating, lending a nutty crunch and a beautifully craggy exterior. Even if you prefer dark or milk to white chocolate, I suggest you give these little guys a try, the lemon really takes these truffles to the next level.", "totalTime": "", "recipeYield": "28", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3/4 cup unsalted pistachios", "8 ounces white chocolate, finely chopped", "Finely grated zest of 1 lemon", "1/4 teaspoon kosher salt", "1/3 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, finely chop the pistachios.  Spread them onto a baking sheet and toast until they are fragrant, 5 minutes.  Remove them from the oven and cool the sheet on a rack.  When cool, grind the pistachios to a fine flour in the food processor.  Transfer them to a shallow bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour about 2 inches of water into a medium saucepan and bring it to a simmer.  Put the white chocolate, lemon zest, and salt into a heatproof bowl and place it over the simmering water.  Stir until the white chocolate has melted.  Remove the bowl from the heat and gently whisk in the heavy cream until completely smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the ganache cool to room temperature, about 2 hours.  Then cover the surface with a piece of plastic wrap and refrigerate it until it has set, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a melon baller or a 1/2-inch teaspoon measure, and a cup of warm water to clean the scoop as needed between balls, scoop the ganache into 28 one-inch balls.  Roll each ball between your hands until it is round, and then roll it in the toasted ground pistachios to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Truffles can be kept in an air tight container at room temperature for up to 3 days, or in the refrigerator  for up to 2 weeks.  Store them with extra toasted pistachios sprinkled over the top which keeps the truffles coated and prevents them from rubbing against one another.</p>"}]}