{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Chinese", "Cook the Book", "Corinne Trang", "flat breads", "scallions", "The Asian Grill"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Scallion Flat Breads", "link": "https://www.seriouseats.com/recipes/2009/04/scallion-flat-breads-recipe.html", "description": "These scallion flat breads from The Asian Grill are a take on the Chinese restaurant staple, the scallion pancake. This is version a little lighter and not as greasy. The flat breads are great by themselves, used as a wrap,...", "totalTime": "", "recipeYield": "12", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 cups all-purpose flour", "2 teaspoons kosher salt", "2 teaspoons baking powder", "6 scallions, trimmed and finely sliced (white and light green parts)", "1 cup spring or filtered water", "2 tablespoons vegetable oil", "1 tablespoon dark sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift 2 cups of the flour, the salt, and the baking powder together into a large bowl.  Make a well in the center and add the water and the sesame and vegetable oils.  Work the flour in toward the center with a spoon to incorporate the dry and wet ingredients.  Turn the soft dough out into a floured work surface and knead, using some or all of the remaining 1 cup flour, until smooth and elastic, about 5 minutes.  Wrap in plastic and allow to rest for 30 minutes at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough into 12 equal pieces.  Form into balls, then flatten them and roll out into 8-inch disks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note: </strong>To reheat the breads, fill a wok half-full with water and bring to a boil over high heat.  Wrap the breads in a kitchen towel (open side up) and place on a plate that fits on a bamboo steamer rack.  There must be enough space between the plate and the sides of the steamer to allow the steam to circulate.  Cover the rack and place on top of the wok of rapidly simmering water.  Steam from 30 seconds to 1 minute.</small></p>"}]}