{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/090927Stuffed_Polenta_Plated.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "Italian", "keywords": ["entrees", "greens", "Italian", "polenta", "saba", "Seriously Meatless", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Meatless: Polenta Triangles Stuffed With Spicy Greens and Cheese", "link": "https://www.seriouseats.com/recipes/2009/09/seriously-meatless-polenta-triangles-stuffed.html", "description": "Serious Eater Michael Natkin of the vegetarian blog Herbivoracious drops by every Wednesday to share a delicious recipe to expand our vegetarian repertoire. [Photographs: Michael Natkin] I typically serve polenta one of two ways&mdash;fresh from the pot or cooled, sliced,...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cheese", "Gluten-Free", "Italian", "Seriously Meatless", "Vegetarian"], "recipeIngredient": ["11 cups water", "2 2/3 cups coarse-ground cornmeal (polenta)", "6 tablespoons olive oil, divided", "1 onion, thinly sliced", "3 cloves garlic, thinly sliced", "1 bunch chard, triple washed, stems separated, stems thinly sliced and leaves sliced 1/2\" wide", "1 bunch beet greens, triple washed, stems discarded, leaves sliced 1/2\" wide", "1 cup red wine", "2 teaspoons chili flakes or more to your taste", "8 oz. caciocavallo + more for garnish (aged provolone is a good substitute, or try smoked mozzarella)", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a boil in a large soup pot and add 5 teaspoons of salt. Whisk in the cornmeal in a thin, slow stream. Stir continuously for 2 minutes. Cover and reduce heat to a lively simmer. Stir one minute out of every minutes for a total of forty minutes, then uncover and cook for five more minutes. It should be creamy and thick at this point. Keep it hot until you are ready to assemble the dish, otherwise it will set up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large skillet, heat 2 tablespoons of the olive oil over a medium high flame. Fry the onion and garlic for 1 minute. Add the thinly sliced chard stems and saute for 3 minutes. Add the leaves. It is ok if they are still wet. You may have to add them in batches to get them all in the pot, waiting til the first bunch \"melts\" a little. Add the chili flakes, red wine and 1 teaspoon of salt. Stir, cover, reduce heat to low and cook until they are fully tender. Taste and adjust salt and chili flakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a 13\" x 18\"  half-sheet pan (aka jelly roll pan). Pour in half of the polenta and spread it into an even layer. Top with the sauteed greens (leaving behind any excess liquid) and the Caciocavallo cheese, distributing them as evenly as possible. Cover with the remaining polenta and use a spatula to form an even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with plastic wrap and allow to chill until the polenta has set up firm, at least a couple of hours. </p>"}]}