{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/200912010-dt-orecchiette-with-kale-and-cauliflower.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["anchovies", "cauliflower", "Dinner Tonight", "Italian", "kale", "pastas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Orecchiette with Braised Kale and Cauliflower", "link": "https://www.seriouseats.com/recipes/2009/12/dinner-tonight-orecchiette-with-braised-kale-and-cauliflower-recipe.html", "description": "[Photograph: Blake Royer] I only occasionally pull out Suzanne Goin's Sunday Supper at Lucques because the recipes are all a little daunting. Usually I spend half the time simplifying her steps, which are clearly taken from a restaurant setting rather...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cauliflower", "Dinner Tonight", "Italian", "Kale", "Pasta"], "recipeIngredient": ["1 pound black Tuscan kale (also known as Lacinato), ribes removes and leaves roughly torn", "1/2 cup olive oil", "1 sprig rosemary", "2 red chilies, crumbled, or a couple pinches red pepper flakes", "1 large onion, sliced", "4 cloves garlic, sliced", "1 head cauliflower, about 2 1/2 pounds, broken into bite-sized florets", "1 pound orecchiette pasta", "2 anchovy fillets, finely chopped", "3 tablespoons pine nuts", "2 tablespoon currants", "1 cup bread crumbs, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heavy pot, heat half the olive oil over medium heat, then add half the chili and the rosemary sprig. Allow them to sizzle in the oil for a minute, then add half the onion. As it softens, after about two minutes, add half the garlic and season with salt and pepper. Continue cooking until the onion turns golden, then add the kale and stir to coat with the oil. Splash in 1/4 cup of water and cover tightly, turning the heat to low. Cook until tender, about 30 minutes, then remove the rosemary sprig. 10 minutes before cooking is through, add the currants to plump up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat the remaining oil in a second wide, heavy skillet over medium heat and add the remaining onion and chile. When it begins to color add the anchovy fillets, mashing them into the oil to melt. Increase the heat to high and add the cauliflower with a hefty pinch of salt and pepper. Cook, tossing and stirring often, until the cauliflower is richly caramelized and tender, but not mushy. Season to taste as necessary. When the cauliflower is near done, add the pine nuts to toast in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, cook the orrecchiette in salty boiling water until al dente. Drain, reserving a full cup of pasta cooking water. Combine all the ingredients into the largest pot, where you cooked either the kale or the cauliflower, and turn the heat to high. Allow the pasta to turn slightly golden and crisp, scraping it off the bottom of the pan with a wooden spoon. After a couple minutes, add some reserved pasta water to create a silky sauce and season to taste. Serve in bowls with the breadcrumbs scattered over the top.</p>"}]}