{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["chicken", "chicken wings", "Cook the Book", "Hugh Carpenter", "Super Bowl appetizers", "Super Bowl wings", "Teri Sandison", "The Great Wings Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: BBQ Wings with Pomegranate Glaze", "link": "https://www.seriouseats.com/recipes/2009/01/bbq-wings-with-pomegranate-glaze-recipe.html", "description": "Pomegranate molasses, a traditionally Middle Eastern ingredient, brings vibrant color and acidity to a classically American dish: tailgate wings. Taken from this week's Cook the Book pick, The Great Wings Book, pomegranate-glazed BBQ wings have a whole lot going for...", "totalTime": "", "recipeYield": "24 wings", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["24 chicken wings", "1 1/2 cups pomegranate molasses", "3 tablespoons grated lemon zest", "3/4 cup freshly squeezed lemon juice", "2 tablespoons ground coriander", "1 tablespoon crushed red chile flakes", "1/3 cup minced ginger", "4 cloves garlic, minced", "2 green onions, end trimmed, minced", "1/4 cup chopped rosemary sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the wing tips and save them for making stock. In a bowl large enough to hold the wings, combine all the remaining ingredients. Add the wings, and mix thoroughly. Marinate the wings in the refrigerator for 1 to 24 hours (the longer, the better).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using a gas barbecue or an indoor grill, preheat to medium (350°F). If using charcoal or wood, prepare a fire. Drain the chicken and reserve the marinade. When the gas barbecue or indoor grill is preheated or the coals or wood are ash covered, brush the grill with oil, then add the chicken wings. Regulate the heat so that it remains at a medium temperature. Grill the chicken wings for about 30 minutes with the barbecue covered. Turn the wings every 5 minutes, basting them on both sides with the reserved marinade. The chicken wings are done when the skin turns an even mahogany color and the meat is tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken wings from the barbecue. Cut the wings in half through the joint. Transfer to a platter and serve.</p>"}]}