{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090615sevenfires.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Francis Mallmann", "peaches", "pork", "Seven Fires"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Peached Pork", "link": "https://www.seriouseats.com/recipes/2009/06/peached-pork-recipe.html", "description": "Photograph from Old Shoe Woman on Flickr There is a peach tree in my backyard, and for the past few weeks I have been paying more attention to it than usual. Ever since those tiny green peaches appeared on its...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Peach", "Pork"], "recipeIngredient": ["1 boneless pork loin roast, about 2 pounds, butterflied", "8 garlic cloves, minced", "2 tablespoons minced fresh rosemary leaves", "7 to 8 tablespoons extra virgin olive oil", "Coarse salt and freshly ground black pepper", "6 small peaches, skin on, cut in half and pitted", "4 tablespoons unsalted butter, cut into small pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the meat on a work surface and trim off all fat and membrane.  Using a meat mallet, pound to an even thickness of 3/4 inch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic, rosemary, and 6 tablespoons of olive oil in a small bowl.  Season the pork with salt and pepper to taste, and spread half of the garlic mixture evenly over the surface.  Flip the meat, season with salt and pepper, and cover with the remaining garlic mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush a <em>chapa</em> (a flat piece of cast iron set over a fire) or a 12-inch square or two-burner rectangular cast-iron griddle with 1 tablespoon olive oil and heat over medium heat until a drop of water sizzle on the surface.  Add the meat to the hot surface and cook until it is well browned and crusty on the first side, about 10 minutes.  Meanwhile, arrange the peaches around the meat, cut side down.  Dot the butter around and in between the peaches and let them cook until nicely charred on the cut side and slightly softened, about 5 minutes.  Transfer to a platter, and cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat is well browned on the first side, turn and cook on the other side, adding another tablespoon of olive oil if needed, for about 7 minutes, or until done to taste.  Transfer the meat to a carving board, tent loosely with foil, and let rest for 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the meat and serve the peaches alongside.</p>"}]}