{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2009112acornsquashlasagna.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["acorn squash", "lasagna", "thanksgiving", "Thanksgiving recipes", "Thanksgiving turkey alternatives", "The Crisper Whisperer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Crisper Whisperer: Acorn Squash Lasagna with Béchamel Sauce", "link": "https://www.seriouseats.com/recipes/2009/11/the-crisper-whisperer-acorn-squash-lasagna.html", "description": "This acorn squash lasagna is easy to prepare and tastes like autumn on a fork.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Crisper Whisperer", "Lasagna", "Mains", "Vegetarian"], "recipeIngredient": ["1 medium acorn squash", "1 cup whole-milk ricotta cheese", "4 Tablespoons butter", "1 medium onion, diced small", "6 cloves garlic, chopped", "3 Tablespoons chopped fresh sage", "1/4 cup all-purpose flour", "4 cups whole milk", "1/8 teaspoon grated nutmeg", "1/2 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1 1/2 cups freshly grated Parmigiano-Reggiano cheese, divided", "2 eggs", "15 no-boil lasagna noodles (from one box)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450° F. Halve the squash lengthwise, discard the seeds, and roast until tender, about 40 minutes. Let cool slightly, then scoop out flesh into a medium bowl and mash with a fork. Stir in the ricotta cheese. Reduce the oven temperature to 375° F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the squash is roasting, melt the butter over medium heat in a medium pot. Add the onion, garlic, and sage and cook, stirring occasionally, until the onion begins to soften. Add the flour and cook, stirring constantly and scraping the bottom of the pot to prevent burning, for one minute. Add the milk along with the nutmeg, salt and pepper. Raise the heat to high and bring to a boil, stirring constantly. Then reduce the heat to maintain a brisk simmer and cook, stirring occasionally, until the mixture has thickened enough to coat the back of a spoon, about 8 minutes. Remove from the heat and stir in one cup of the Parmigiano cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, lightly beat the eggs. Very slowly pour in about one cup of the sauce while whisking the eggs with a fork. (This tempers the eggs so they don't scramble during the next step.) Then pour the tempered egg mixture into the pot with the sauce and stir to combine thoroughly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 9x13x2-inch pan, assemble the lasagna. Spread 1/2 cup of the sauce on the bottom of the pan. Lay five lasagna noodles on top, slightly overlapping them and breaking up the fifth noodle as necessary to cover the whole bottom. Top with half the squash mixture and then about 1 1/4 cups sauce. Repeat with a second layer of noodles, squash mixture and sauce. Add a third layer of noodles and top with the remaining sauce. Sprinkle the remaining 1/2 cup Parmigiano cheese on top. Bake on the center rack until bubbly and slightly browned on top, about 35-40 minutes. Cool for 10 minutes before serving. </p>"}]}