{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["baking", "bread", "breadmaking", "Kneadlessly Simple", "Nancy Baggett", "oatmeal", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scottish Oatmeal Bread", "link": "https://www.seriouseats.com/recipes/2009/03/scottish-oatmeal-bread.html", "description": "The following recipe is from the March 4th edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! Some recipes for oatmeal bread call for simply tossing some uncooked rolled oats in with the...", "totalTime": null, "recipeYield": "1 large loaf, 13 to 14 portions or slices", "recipeCategory": ["Bread"], "recipeIngredient": ["2 1/2 cups (12.5 ounces) unbleached white bread flour, plus 3/4 cup (3.75 ounces), plus more as needed", "Scant 1 3/4 teaspoons table salt", "3/4 teaspoon instant, fast-rising, or bread machine yeast", "3/4 teaspoon ground allspice", "1/8 teaspoon ground nutmeg", "1 1/4 cups plus 2 tablespoons ice water, plus more if needed", "1/2 teaspoon finely grated orange zest", "2 tablespoons unsalted butter, at room temperature, plus more for greasing pan and loaf top", "3/4 cup old-fashioned rolled oats, plus 4 tablespoons for garnish", "2/3 cup boiling water", "6 tablespoons packed light or dark brown sugar", "2/3 cup dried currants, rinsed under hot water, then thoroughly drained and patted dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, thoroughly stir together 2 1/2 cups of the flour, the salt, yeast, allspice, and nutmeg. Vigorously stir the ice water and orange zest into the flour mixture, scraping down the sides just until the ingredients are thoroughly blended. If too dry to mix, a bit at a time, stir in just enough more ice water to blend the ingredients, but don't over-moisten, as the dough should be fairly stiff. Stir in more flour to stiffen it if necessary. Brush the top with softened butter. Cover the bowl with plastic wrap. If desired, for best flavor or for convenience, you can refrigerate the dough for 3 to 10 hours. Then let rise at cool room temperature for 12 to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Second rise:</strong> In a medium bowl, gradually stir the oats into the boiling water until well blended. Let stand for 5 minutes to partially cook. Stir in the butter and sugar until the sugar dissolves and let cool thoroughly. Vigorously stir the cooled oatmeal mixture into the dough until thoroughly incorporated. Add in 3/4 cup of the flour and the currants until evenly distributed throughout, then, as needed, enough more flour to yield a very stiff dough, scraping down the bowl thoroughly. Using an oiled rubber spatula and working all the way around the bowl, fold the dough in towards the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously butter a 9 x 5-inch loaf pan. Add 2 tablespoons of oats to the pan; tip it back and forth to evenly distribute them. Invert the dough into the pan. Smooth out the top and press the dough evenly into the pan. Brush the loaf top with melted butter. Sprinkle the remaining 2 tablespoon oats over the top, pressing down to embed them. Using an oiled serrated knife or kitchen shears, cut a 6-inch-long, 1/2-inch-deep slash down the loaf center. Cover the pan with nonstick spray-coated plastic wrap. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Let rise using either of these methods:</strong> For a 1 3/4- to 2 1/2-hour regular rise, let stand at warm room temperature; for a 1- to 2-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water. Continue the rise until the dough nears the plastic. Remove it and continue until the dough extends just to the pan rim (it will rise a lot in the oven).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking preliminaries:</strong> 20 minutes before baking time, put a rack in the lower third of the oven; preheat to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Bake on the lower rack for 65 to 75 minutes, until the top is nicely browned and a skewer inserted in the thickest part comes out with moist crumbs on the tip (or until the center registers 204 to 206&deg;F on an instant-read thermometer). (As necessary to prevent over-browning, cover the top with foil.) Then bake for 5 to 10 minutes longer to ensure the center is baked through. Cool in the pan on a wire rack for 10 to 15 minutes. Remove the loaf to the rack; cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving and storing:</strong> This tastes good warm, but will cut much better when cool. Cool completely before storing. The bread will keep at cool room temperature for 3 to 4 days, and may be frozen, airtight, for up to 2 months.</p>"}]}