{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090715TroutenPapillotte.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["en papillotte", "fish", "French", "French in a Flash", "trout", "trout en papillotte"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Trout en Papillotte", "link": "https://www.seriouseats.com/recipes/2009/07/french-in-a-flash-trout-en-papillotte-fish-seafood-recipe.html", "description": "\"Unwrapping the unlucky but delicious trout feels something like Christmas.\" My grandmother is my own Edith Piaf. Mémé has a voice that trembles on the air, buoyed up by soprano aspirations. It is a beautiful but homemade voice--like a quilt....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Fish", "French"], "recipeIngredient": ["2 butterflied whole trout", "1 teaspoon olive oil, plus extra for drizzling", "1 fennel bulb, thinly sliced", "2 teaspoons butter", "6 sprigs thyme", "6 sprigs rosemary", "4 slices lemon, plus extra lemon juice for drizzling", "A handful of watercress or pea shoots", "Salt and pepper", "Two large rectangles of parchment paper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the trout outside and in with olive oil to coat.  The more thoroughly you do this, the less likely the fish will be to stick to the parchment.  Season them each inside and out with salt and pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the trout up like a book, and stick 3 thyme and 3 rosemary bookmarks in the center.  Add in 1 teaspoon of butter for good measure.  Close the book--your place is saved for later.  Place two slices of lemon on top of each trout.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the packages by tossing the fennel with 1 teaspoon of olive oil, salt, and pepper.  Divide in half, and place a small mound in the middle of each sheet of parchment.  Lay a trout on top of each fennel mountain.  Then seal the package.  Bring the edges of parchment parallel to the length of the fish up, and fold and fold and fold again until the fold rests sealed against the fish.  Then folds the ends up like a Christmas gift, and fold under.  All the folds will seal in the steam and the flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the trout for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toss the watercress or pea shoots with a touch of olive oil, salt, pepper, and lemon juice.  When the packages come out of the oven, cut them open at the table, and top with a bit of greenery.</p>"}]}