{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090423-dinnertonight.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chickpeas", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pasta with Chickpea Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2009/04/pasta-with-chickpea-tomato-sauce-recipe.html", "description": "This recipe appealed to me initially because I had some cooked chickpeas in the fridge looking for a home, and I had made enough batches of hummus—increasingly garlicky—to drive any and all friends away with a huff of my breath....", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Legumes", "Pasta"], "recipeIngredient": ["1 tablespoon olive oil", "2 cloves garlic, minced", "1/4 teaspoon crushed red pepper flakes", "3 cups cooked chickpeas (drained and rinsed if canned)", "1 28-ounce can whole tomatoes, crushed by hand", "2 cups chicken broth", "1 sprig fresh basil, leaves removed and roughly chopped, some reserved for garnish", "12 ounces short pasta", "Grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large skillet or medium saucepan over medium heat.  Just as it begins to shimmer, add the garlic and crushed red pepper flakes and cook until fragrant, less than a minute.  Add the chickpeas with a pinch of salt and cook for 5 minutes or so to soften them.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the broth and tomatoes and bring the mixture to a boil.  Turn down the heat and simmer until the flavors merge and the chickpeas are soft, about 20 to 25 minutes.  Add the basil sprig and most of the leaves, and continue cooking for an additional 5 minutes.  Remove the basil stem.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a pot of salty water to boil.  Cook the pasta until al dente, then drain, reserving some pasta cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cooked pasta to the sauce and toss well, adding a little pasta cooking water to achieve a creamy consistency.  Season to taste with salt and pepper, and serve with grated Parmesan. and remaining basil leaves.</p>"}]}