{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090311asparagusmushroomtart.JPG", "author": {"@type": "Person", "name": "Grace Kang"}, "recipeCuisine": "", "keywords": ["Bon Appetit", "Cooking from the Glossies", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cooking From the Glossies: Asparagus and Mushroom Tart", "link": "https://www.seriouseats.com/recipes/2009/04/bon-appetit-asparagus-mushroom-tart-recipe.html", "description": "Puff pastry is one of those indispensable pantry staples. It keeps forever in the freezer, thaws in a snap, and can be used in both savory and sweet applications. It's perfect for throwing an elegant appetizer like an asparagus and...", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Appetizers and Hors d'Oeuvres"], "recipeIngredient": ["1 17.3-ounce package frozen puff pastry (2 sheets), thawed", "1/4 cup unsalted butter", "12 ounces white button mushrooms, halved and then sliced thinly", "1 teaspoon coarse kosher salt, divided", "1/2 teaspoon coarsely ground black pepper, divided", "1 pound fresh asparagus, trimmed, cut on diagonal into 1-inch pieces", "1 1/2 teaspoons chopped fresh thyme", "1 1/2 teaspoons finely grated lemon peel", "1/2 cup crème fraîche", "1/2 cup (packed) coarsely grated Gruyere cheese (about two ounces)", "Fresh thyme sprigs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out each pastry sheet on work surface to 10-inch square. Cut each into 4 squares. Using small knife, score 1/2-inch border (do not cut through pastry) around inside edges of each square. Arrange squares on 2 rimmed baking sheets. (Can be made 1 day ahead. Cover and chill.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in heavy large skillet over medium-high heat. Add mushrooms; sprinkle with 1/4 teaspoon coarse salt and 1/4 teaspoon pepper. Sauté until tender and lightly browned, about 4 minutes. Transfer mushrooms to large bowl; cool 5 minutes. Add asparagus, chopped thyme, lemon peel, 3/4 teaspoon coarse salt, and 1/4 teaspoon pepper to mushrooms. Mix in crème fraîche and cheese. (Filling can be made 1 day ahead. Cover; chill.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 400°F. Mound filling atop pastry squares, leaving 1/2-inch plain border.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake tarts 12 minutes. Reverse sheets. Continue to bake tarts until crusts are puffed and golden and filling is cooked through, about 10 minutes longer. Transfer to plates; garnish with thyme sprigs.</p>"}]}