{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090327-grilling-dip-thumb.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["dips", "garlic", "grilling", "onions", "snacks", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Ember-Roasted Onion and Garlic Dip with Crispy Pita", "link": "https://www.seriouseats.com/recipes/2009/03/grilling-ember-roasted-onion-and-garlic-dip-with-crispy-pita-recipe.html", "description": "With a big move happening this weekend, and my kitchen all packed up, I wanted to make sure there was some food that didn't require the use of utensils during the endless hours of packing. Along with some leftover tzatziki,...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Condiments and Sauces", "Garlic", "Grilling", "Snacks", "Vegetarian"], "recipeIngredient": ["<strong>For the Dip:</strong>", "2 medium yellow onions (skin on), cut in half through the stem", "4 large garlic cloves (skin on)", "Extra virgin Olive Oil", "1 can (15 1/2 ounces) garbanzo beans, rinsed", "1/2 cup sour cream", "2 tablespoons fresh lemon juice", "2 tablespoons finely chopped fresh dill", "3/4 teaspoon ground cumin", "3/4 teaspoon Worcestershire auce", "1/2 teaspoon kosher salt", "1/4 teaspoon fresh ground black pepper", "1/8 teaspoon ground cayenne pepper", "6 pita pockets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal.  When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the onion halves, cut side down, on a 16-inch square of heavy duty aluminum foil.  Nestle garlic cloves between the onions.  Drizzle a couple tablespoons of olive oil over the onions and garlic.  Fold up the sides of the foil and seal the packet.  Place the packet directly on the coals, cover grill, and cook until a knife inserted into the foil slides through the onions with no resistance, about 20 to 30 minutes, carefully turning the packet once during cooking.  Remove the packet with tongs and set aside to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the cooking grate clean.  Lightly brush each pita on both sides with oil.  Working in batches, grill pitas until crisp and toasted, 2 to 4 minutes, turning frequently and swapping positions as needed for even cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the packet and remove and discard the skins and hard stems from the onions and garlic.  Place roasted onions and garlic in a food processor and pulse until almost puréed.  Add all of the remaining dip ingredients and process until quite smooth.  Adjust seasonings, if desired.  Cut each pita into wedges and serve with dip.</p>"}]}