{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091030-soondubu-pot.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Korean", "keywords": ["Korean", "Seriously Asian", "soondubu", "soups", "stews", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Seriously Asian: Korean Soondubu Jjigae (Soft Tofu Stew)", "link": "https://www.seriouseats.com/recipes/2009/10/seriously-asian-korean-soondubu-jjigae-soft-tofu-stew-recipe.html", "description": "[Photographs: Chichi Wang] The memorable meals in our lives take place in the presence of friends and family. Dishes we cook for those we love leave indelible impressions in our minds, like culinary timestamps. Even so, I eat some of...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Korean", "Soups and Stews", "Tofu"], "recipeIngredient": ["1/2 carton of extra-silken tofu, roughly 5 ounces", "2 tablespoons vegetable oil or cooking fat", "1 ounce ribeye steak, sliced thinly across the grain", "1/4 to 1/2 cup of vegetables (seasonal)", "2 teaspoons soondubu paste, or to taste (<a href=\"#paste\">recipe below</a>)", "1 cup meat or vegetable stock", "Seafood, optional (4 clams, a handful of chopped squid, or 3 medium-sized shrimp)", "1 egg", "Salt to taste", "Thinly sliced green onions as a garnish", "Rice as an accompaniment", "2 tablespoons coarse hot pepper powder", "1 tablespoon soy sauce", "1/4 teaspoon salt", "1 teaspoon minced garlic", "1 tablespoon beef broth, fish sauce, or water", "<strong>Spicy Soondubu Paste:</strong>", " 2 tablespoons coarse hot pepper powder", "1 tablespoon soy sauce", "1/4 teaspoon salt", "1 teaspoon minced garlic", "1 tablespoon beef broth, fish sauce, or water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly heat the clay pot over a low flame on the stovetop.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, have your mise-en-place ready: Sprinkle the slices of beef with a pinch of salt. Cut the vegetables of your choice into a 1/2-inch dice.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the clay pot is hot, add the cooking oil or fat and briefly heat.  Add the slices of ribeye all at once. Do not stir around. Let the surface of the meat brown and char; once one side has browned, remove all of the meat with chopsticks or a slotted spoon. Set aside. Each slice of beef should still be fairly raw.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the diced vegetables to the pot and let the juices deglaze the bits of meat sticking to the bottom of the pot. Stir occasionally with a wooden spoon.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the vegetables have browned, add the tofu paste to the pot.  Stir it around with the vegetables, taking care not to burn the paste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in all of the broth. The broth will simmer, then boil vigorously.  Depending on the vegetables, cook for 2 to 7 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the vegetables are nearly tender, add the tofu by large spoonfuls, taking care not to break up the custard-like tofu into little bits. Any remaining tofu in the carton may be stored in an airtight container filled to the brim with filtered water, which must be changed daily. It can be kept for 3 days in this manner.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the seafood if you're using any. Return the beef to the top of the broth. Let simmer for an additional minute. There should be enough broth to just cover all of the ingredients. Add more broth if necessary, and add more spicy tofu paste to taste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With heat-proof mitts, very carefully transfer the tofu pot from the burner to the table. Have the accompanying rice ready. Crack the egg into the tofu pot, stirring very gently to preserve the integrity of the tofu. Sprinkle green onions on top for garnish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spicy Soondubu Paste:</strong> Thoroughly mix all the ingredients together in a small glass jar. Seal it tightly and keep in the refrigerator for at least 2 days and up to 3 weeks.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small>Adapted from <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/0978541804/serieats-20\">Discovering Korean Cuisine: Recipes from the Best Korean Restaurants in Los Angeles</a></em> edited by Allisa Park.</small> </p>"}]}