{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091221PeppermintPatties.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["candy", "chocolate", "healthy", "healthy and delicious", "holiday baking", "holiday sweets", "mints"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Healthy &amp; Delicious: Homemade Peppermint Patties", "link": "https://www.seriouseats.com/recipes/2009/12/homemade-peppermint-patties-from-scratch-recipe.html", "description": "When I'm jonesing for chocolate and my only options come from a cornerstore candy display, I immediately search out the <strong>York Peppermint Patties</strong>. At 140 calories and 2.5 grams of fat per pop, they're a good bit lighter than almost any other commercially available chocolate bar. Plus, they're delicious and make your breath smell way better than a Snickers.", "totalTime": "", "recipeYield": "about 20 mini patties", "recipeCategory": ["Desserts", "Healthy and Delicious"], "recipeIngredient": ["2 cups powdered sugar", "1.5 tablespoons unsalted butter, softened", "2 teaspoons peppermint extract", "1/4 teaspoon vanilla extract", "2 tablespoons heavy cream", "8 ounces dark or bittersweet chocolate chips ", "1 tablespoon vegetable shortening"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a blender or stand mixer fitted with the paddle attachment, cream the sugar, butter, extracts, and heavy cream on low. (Note: if using the stand mixer, it's important to add the ingredients in that order. Otherwise the mixture becomes concrete on the bottom and crumbs on the top.) Once ingredients are combined, turn mixer to medium speed and beat for another minute or two. The end result should be smooth and adhere very well, almost like a paste. It shouldn't be lumpy or powdery.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large cookie sheet with wax paper. Using a teaspoon or your hands, roll mixture into small balls (about 1-inch or so). Place on cookie sheet and flatten each one into a patty. Once all are made, place in fridge for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While patties are chilling, melt chocolate and shortening together in a microwave, with a double boiler, or using a metal bowl placed over a pot of simmering water. Thenm let mixture cool to room temperature. (Note: don't place it in the fridge, though. You don't want it to harden prematurely.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When 20 minutes are up, remove patties from fridge. Using two forks, dunk them one by one into chocolate mixture and roll around until totally coated. Remove and place back on wax paper. When all are finished, place the cookie sheet in the fridge and leave for a few hours, until chocolate hardens. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat. Store leftovers in the fridge, sealed in a container and separated by wax paper.</p>"}]}