{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091020-dt-sausage-potato-mushroom-roast.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["fingerling potatoes", "mushrooms", "potatoes", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sausage, Potato, and Mushroom Roast", "link": "https://www.seriouseats.com/recipes/2009/10/dinner-tonight-sausage-potato-and-mushroom-roast-recipe.html", "description": "[Photograph: Blake Royer] A friend of mine recently gave me a bag of homegrown fingerling potatoes from her father's garden in Iowa, where he grows vegetables for his restaurant and always donates extras to his children. With more than enough...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Mains", "Mushrooms", "Potato", "Roasting"], "recipeIngredient": ["2 pounds fingerling potatoes or other small waxy potato cut into chunks", "4 raw sausages of various types (such as andouille, lamb, pork, etc)", "1 box white mushrooms, stems removed and halved", "Olive oil as needed", "Salt and pepper to taste", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Wash and scrub the potatoes and cut into bite-size chunks. Transfer to a roasting pan or dish that holds all the ingredients snugly.  Douse the potatoes quite generously with olive oil and toss with salt and pepper.  Roast, undisturbed, for about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and stir up the potatoes gently.  Distribute the mushrooms into the pan and toss them to coat with the oil, then nestle the sausages near the center.  Drizzle the sausages with a bit of oil and return to the oven for 20 to 30 minutes, depending on the size of the sausages and potato chunks.  Turn the sausages once during cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season to taste with salt and pepper.  Cut the sausages in half or quarters, and sprinkle everything with the parsley.  Serve alone or perhaps with a little mustard.</p>"}]}