{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090818-corn-tomatoes.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["corn", "corn salad", "Meat Lite", "stuffed tomatoes", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Buttermilk Bacon Corn Salad Tomatoes", "link": "https://www.seriouseats.com/recipes/2009/08/buttermilk-bacon-corn-salad-stuffed-tomatoes-recipe.html", "description": "&copy;iStockphoto.com/Marlee90 and MorePixels In August when the summer harvest is near its peak, there is a flood of euphoria and panic all at once as seasonal bounty hunters scramble to make the most of the fleeting feast. If you've joined...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon", "Meat Lite"], "recipeIngredient": ["4 jumbo heirloom or beefsteak-type tomatoes, or 6 to 8 plum or Roma tomatoes", "4 slices thick-cut bacon, cut into 1/4-inch pieces", "2 tablespoons olive oil", "5 ears corn, shucked and kernels cut from cob (4 cups of kernels)", "2 jalapeños, stemmed and chopped", "1 clove garlic, chopped", "1/4 cup cilantro, roughly chopped", "4 scallions, chopped", "1/2 cup buttermilk", "4 ounces soft plain goat cheese", "Coarse salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Core the tomatoes and cut a wide opening in the middle from the core. For plum or Romas, cut the tomatoes lengthwise and scrape out the seeds. Set the tomatoes aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bacon to a hot sauté pan over medium heat.  Render until crisp, about 7 minutes. Transfer to a paper towel-lined plate to drain.  Pour the bacon fat from the sauté pan and wipe it clean (unless you prefer sautéing in the bacon grease). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the oil to the same pan and return to medium heat.  Put the corn kernels, jalapeños, and garlic in the pan and sauté for 5 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the corn cooks, combine the buttermilk and goat cheese in a blender or food processor and blend until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the corn mixture to a large mixing bowl and add the buttermilk dressing, stirring to coat all the ingredients.  Add the cilantro and scallions and stir to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the corn salad into the tomatoes.  Serve immediately.  If serving later, let the corn salad chill and stuff the tomatoes just before serving. </p>"}]}