{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090914-apples.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apples", "Ari Weinzweig", "Cook the Book", "dessert", "fall recipes", "pears", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Apple (or Pear) Bacon Crisp", "link": "https://www.seriouseats.com/recipes/2009/09/apple-or-pear-bacon-crisp-recipe.html", "description": "Crisp salty pork plus sweet cinnamon and nutmeg scented pie?  It has to be one of the best combinations ever.  It's not really all that different than eating a plate of maple syrup-doused pancakes or waffles with sausage or bacon, but putting it together after dinner makes it seem positively decadent.", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Apple", "Bacon", "Cook the Book", "Pear"], "recipeIngredient": ["3/4 cup golden raisins", "3 tablespoons boubon", "6 ounces sliced Arkansas peppered or long pepper bacon (about 3 to 4 slices), diced", "3/4 cup Muscovado (or any other natural dark) brown sugar", "9 to 12 ripe apples or pears (about 2 1/2 pounds)", "1 1/4 teaspoons cinnamon", "1/4 cup unsalted butter", "<small>For the streusel:</small>", "1/2 cup unsalted butter, chilled and cut into 1/2-inch pieces", "1 1/4 cups flour", "1/4 cup Muscovado (or any other natural dark) brown sugar", "1/4 cup sugar", "1/4 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the bourbon over the raisins, mix well and set aside to soak for a minimum of 15 minutes, on up to a couple of hours (longer is better in my taste, but if you forget to do it ahead the shorter time will work just fine).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dredge the bacon in 3/4 cup of brown sugar and lay on a foil-lined baking sheet with a lip.  Sprinkle any of the remaining brown sugar over the top.  Bake for 20 minutes or until very dark brown, crisp and caramelized.  Carefully remove from oven and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While bacon is cooking, slice the fruit (skin on) directly into a 9-inch round pan.  After you've covered the bottom of the pan, sprinkle on some of the raisins, then add a bit of the bourbon and cinnamon.  Add another layer of fruit, then the remaining raisins and cinnamon.  Sprinkle the balance of the bourbon over the top and dot with the butter.  (The sliced fruit may pile up over the lip of the pan, but it will settle while baking.)  Sprinkle the candied bacon slices over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven temperature to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the streusel by combining the butter, flour, salt, and sugars in a mixer or food processor.  The mixture should be crumbly and somewhat dry.  Sprinkle over the top of the apple mixture in the pan and pat down lightly.  Go around the edges, pressing the streusel into the fruit to seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dish in the oven uncovered and bake for 30 to 40 minutes, until the juices are bubbling up around the edges and the streusel is nicely browned.  Remove from the oven and cool for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm, with optional ice cream or gelato.</p>"}]}