{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090112antipastopizza.JPG", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "", "keywords": ["antipasto", "Meat Lite", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Antipasto Pizza", "link": "https://www.seriouseats.com/recipes/2009/01/antipasto-pizza-recipe.html", "description": "Editor's note: Philadelphia food writers Joy Manning and Tara Mataraza Desmond drop by each week with Meat Lite, which celebrates meat in moderation. Meat Lite was inspired by the book coauthored by the two, Almost Meatless, due out in spring...", "totalTime": "", "recipeYield": "1 fourteen-inch pizza", "recipeCategory": ["Meat Lite"], "recipeIngredient": ["<strong>For the pizza dough (makes about 1 pound of dough, enough for a 14-inch pie)</strong>", "1 envelope active dry yeast (7grams)", "1 cup warm water (about 110° F), divided", "1 1/2 teaspoons coarse salt", "2 1/2 cups unbleached all-purpose flour", "2 teaspoons honey", "2 teaspoons extra virgin olive oil", " ", "<strong>For Roasted Vegetables:</strong>", "1 large red bell pepper, cut into 1/2-inch strips", "1 large Portobello mushroom cap, sliced into 1/2-inch strips", "1 small red onion, sliced into thin strips", "2 tablespoons extra virgin olive oil", "2 tablespoons balsamic vinegar", "1 tablespoon water", "1/4 teaspoon Kosher salt", "Freshly ground black pepper (about 10 grinds)", " ", "<strong>For Roasted Garlic Spread:</strong>", "1 head garlic", "1 tablespoon extra virgin olive oil", " ", "<strong>Additional pizza toppings:</strong>", "2 ounces sweet slicing soppresata", "1/2 cup grated mozzarella ", "1/2 cup grated fontina", "1 tablespoon balsamic vinegar", "1/4 teaspoon honey", "Freshly ground black pepper (about 5 grinds)", "1/4 teaspoon Kosher salt", "2 tablespoon extra virgin olive oil", "1/2 cup loosely packed parsley leaves", "1 cup loosely packed baby arugula", "5 large basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start by making the pizza dough.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the yeast into 1/2 cup of the warm water in a small bowl and set aside while preparing the other dough ingredients.  Combine the salt and the flour in the bowl of a food processor fixed with the dough blade.  Pulse a few times to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a liquid measuring cup, whisk together the remaining 1/2 cup warm water, honey and olive oil, and add the yeast mixture.  With the processor running, slowly add the wet ingredients to the dry through the chute in the lid.  Let the processor run until a ball of dough forms.* (See note) Turn the dough ball out onto a lightly floured surface and knead it for 5 minutes, or until the dough is smooth and soft. Transfer the dough to a large bowl brushed with oil.  Cover the bowl with a clean kitchen towel and set aside in a warm place to rise for 1 hour.  After an hour, punch the risen dough down and let it rise again for about 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the dough rises, make the roasted vegetables.  Preheat oven to 375° F.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the peppers, mushrooms, and onions in a 13x9-inch baking dish.  Whisk together the olive oil, vinegar, water, salt and pepper. Pour the mixture over the vegetables and toss to combine.  Cover the baking dish loosely with foil or a glass lid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the head of garlic in half horizontally.  Place the two halves, cut side up, on a piece of aluminum foil (about the size of a standard sheet of paper). Add 2 tablespoons water and fold up the sides of the foil to make a vessel around the garlic.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the baking dish and the foil vessel in the oven and roast the vegetables and garlic for 30 to 45 minutes, until they are tender.  Let them cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pop the roasted garlic out of the skins, discarding the skins.  Smash the cloves together with the 1 tablespoon of olive oil, forming a paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough is nearly ready, preheat the oven to 500° F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently stretch and press the dough onto your favorite pizza-baking device (I use a 14-inch cast iron pan.  You might go with your trusty pizza stone. Some opt for a metal pizza parlor tray).  Spread the roasted garlic paste across the surface of the dough and then arrange the soppresata slices on top.  Add the vegetables (divide into sections per veggie if desired).  Combine the cheeses and sprinkle across the vegetables.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pizza for about 10 minutes, or until the crust is golden and done to your liking.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pizza bakes, whisk together the balsamic, honey, pepper, salt and olive oil.  Roughly chop the parsley, arugula and basil and then toss with the vinaigrette.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving the pizza, cut it into even slices with a pizza wheel and top with the greens.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>*No food processor?  Make the dough by hand.  Slowly combine the wet and dry ingredients in a large mixing bowl stirring with a wooden spoon or your hands until shaggy dough forms.  Once all of the ingredients are incorporated, and some semblance of a dough ball has formed, proceed with the kneading, adding a minute or two to the total.</em></p>"}]}