{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["cheese", "potatoes", "soups", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Red Cat's Spicy Swiss Potato Soup", "link": "https://www.seriouseats.com/recipes/2009/01/the-red-cats-spicy-swiss-potato-soup-recipe.html", "description": "Read more about The Red Cat's Spicy Swiss Potato Soup on Serious Eats: New York as part of our series of recipes from famous restaurants in New York City....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Vegetarian"], "recipeIngredient": ["3 tablespoons butter", "1 small shallot, finely chopped", "1 1/2 pounds Idaho potatoes (about 2 medium potatoes), peeled and quartered", "3 cups low-sodium, store-bought chicken broth", "1 1/2 cups milk", "1 1/2 cups heavy cream", "Salt", "Freshly ground black pepper", "Cayenne", "3/4 cup grated Gruyère cheese (about 6 ounces)", "2 teaspoons hot paprika", "2 scallions, white and green parts, finely sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons of the butter in a heavy-bottomed soup pot over medium-high heat.  Add the shallot and sauté until softened but not browned, approximately 3 minutes.  Add the potatoes, chicken stock, and 3 cups water.  Bring to a boil and then lower the heat so the liquid simmers.  Cook until the potatoes are soft to a knife-tip, approximately 15 minutes.  Pour the contents of the pot into a fine-mesh strainer set over a bowl.  Set the cooking liquid aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass the potatoes through a food mill or ricer.  Return the potatoes to the pot over medium heat and add the milk, cream, and 1 1/2 cups of the cooking liquid.  Whisk gently to incorporate, but do not overwork the potatoes.  Season with salt, pepper, and cayenne to taste.  Finish by whisking in the remaining tablespoon butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, put some shredded Gruyère in the bottom of each of 4 bowls, and ladle in the hot soup.  Garnish with a dusting of paprika and the scallions.</p>"}]}