{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090302kneadlessly_simple.jpg", "author": {"@type": "Person", "name": "Michele Humes"}, "recipeCuisine": "", "keywords": ["baking", "breadmaking", "breads", "Cook the Book", "gingerbread", "Kneadlessly Simple", "Nancy Baggett", "pain d'epice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Yeasted Pain d'Epice", "link": "https://www.seriouseats.com/recipes/2009/03/kneadlessly-simple-nancy-baggett-yeasted-pain-depice-recipe.html", "description": "Pain d'épice, or spice bread, is a specialty of northern France. It has the flavors we associate with gingerbread, but the sliceable texture of a very firm pound cake. As it uses only honey for moisture, with no butter or...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1/2 cup each dark raisins and golden raisins", "2 1/4 cups (11.25 ounces) unbleached white bread flour or unbleached all-purpose white flour, plus more as needed", "1 cup (5 ounces) medium rye flour or whole wheat flour", "2 teaspoons anise seeds", "1 1/2 teaspoons instant, fast-rising, or bread machine yeast", "1 1/4 teaspoons table salt", "1/4 teaspoon ground ginger", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1/4 teaspoon ground allspice", "1/2 cup clover honey or other mild honey", "1 1/2 teaspoons finely grated orange zest", "1 1/2 cups ice water, plus more if needed", "1/4 cup diced (1/8-inch pieces) crystallized ginger", "Flavorless oil for coating dough top", "2 teaspoons clover honey or other mild honey, blended with 2 teaspoons water for wash"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First rise:</strong> Soak the raisins in hot water for 10 minutes, then drain well and let cool thoroughly. In a large bowl, thoroughly stir together the white and rye flours, anise seeds, yeast, salt, ginger, cinnamon, cloves, and allspice. In another bowl or measuring cup, thoroughly whisk the honey and orange zest into the water. Vigorously stir the mixture along with the crystallized ginger and raisins into the bowl with the flours, scraping down the bowl sides and mixing just until the dough is thoroughly blended. If the dough is too dry to mix together, gradually add in just enough more ice water to facilitate mixing, as the dough should be stiff. If necessary, add in more white flour to stiffen it. Brush or spray the top with oil. Tightly cover the bowl with plastic wrap. If desired, for best flavor or for convenience, you can refrigerate the dough for 3 to 10 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Second rise:</strong> Vigorously stir the dough, adding enough more flour to yield a very stiff consistency. Turn it out into a well-oiled 9x5-inch loaf pan. Brush or spray the top with oil. Smooth out and press the dough evenly into the pan with oiled fingertips or a rubber spatula. Cover with nonstick spray-coated plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Let rise using any of these methods:</strong> For a 1 1/2- to 2 1/2-hour regular rise, let stand at warm room temperature; for a 1- to 2-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water; or for an extended rise, refrigerate for 4 to 24 hours, then set out at room temperature. Remove the plastic wrap when the dough nears it, then continue the rise until dough extends 1/2 inch above the pan rim. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking preliminaries:</strong> 15 minutes before baking time, put a rack in the lower third of the oven; preheat to 350 degrees F. Evenly brush the top with the honey wash.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Bake on the lower rack for 50 to 60 minutes, or until the loaf is well browned, covering with foil as needed. Continue baking for 15 to 20 minutes more, until a skewer inserted in the thickest part comes out with just a few particles on the end (or until the center registers 200 to 202 degrees F on an instant-read thermometer). Bake for 5 to 10 minutes longer to ensure the center is done. Cool in the pan on a wire rack for 10 minutes. Turn the loaf onto the rack; cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving and storing:</strong> The loaf slices best when thoroughly cooled and tastes best after being allowed to ripen for a few  hours. Store airtight wrapped in plastic. The bread will keep at room temperature for up to 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}