{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091022-dt-chilaquiles-verdes.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Mexican", "keywords": ["Dinner Tonight", "Mexican", "tortillas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chilaquiles Verdes", "link": "https://www.seriouseats.com/recipes/2009/10/dinner-tonight-chilaquiles-verdes-recipe.html", "description": "[Photograph: Blake Royer] When I set out to make chilaquiles, I had in mind the brunch dish, a sort of tortilla and egg casserole with melted cheese. And while I found recipes for what I was looking for, I also...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Dinner Tonight", "Mexican", "Vegetarian"], "recipeIngredient": ["12 ounces thick homemade-style tortilla chips, or equivalent corn tortillas baked or fried to make chips", "2 pounds tomatillos, husked and rinsed", "2 jalapeno or 4 serrano chiles, stemmed", "2 tablespoons vegetable or olive oil", "1 medium white onion, sliced 1/4-inch thick", "4 garlic cloves, peeled and finely chopped", "2/3 cup Mexican <em>crema</em>, or substitute creme fraiche or cream", "3 cups chicken stock, or substitute vegetable stock or water", "1/2 cup chopped fresh cilantro, or 3 tablespoons chopped fresh epazote", "4 ounces (about 1 cup) grated Mexican melting cheese, or substitute Monterey Jack"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the tomatillos and green chiles under a very hot broiler and cook, turning occasionally, until roasted and blackened in spots, about 10-12 minutes.  Transfer everything to a blender and blend into a smooth pur&eacute;e.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot or dutch oven, heat the oil over medium and cook the onion until golden, about 7 minutes.  Add the garlic and cook an additional minute, then pour in the tomatillo pur&eacute;e.  Bring to a boil, then stir in the broth and <em>crema</em>.  Season to taste with salt, then add the cilantro or epazote and bring back to a boil. Turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, preheat the oven to 400&deg;F. Arrange the chips on a 13x9 baking dish, then pour the sauce over them, pressing the chips gently to ensure they are covered in sauce. Sprinkle the cheese over the top and bake until bubbling and slightly brown on the edges, about 15 minutes. Serve immediately before the chips go soggy.</p>"}]}