{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/200908242bitesizedesserts.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bite-Size Desserts", "candy", "caramel", "Carole Bloom", "chocolate", "Cook the Book", "desserts", "truffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Salted Caramel-Bittersweet Chocolate Truffles", "link": "https://www.seriouseats.com/recipes/2009/08/salted-caramel-bittersweet-chocolate-truffles-recipe.html", "description": "When I was 16 years old I had a giant crush on this guy who was a few years older than me and pretty much perfect in my young punk rock-obsessed mind. When Valentine's Day rolled around I decided that the best way for me to let him know how I felt was to make him a batch of chocolate truffles&mdash;I was confident that these truffles would turn out so delicious that he wouldn't be able to resist me. Despite my lack of candy making experience, the truffles turned out pretty well. I lovingly wrapped them and went to meet my crush.", "totalTime": "", "recipeYield": "5 dozen 1-inch truffles", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["18 ounces bittersweet chocolate (62% to 72% cacao content), finely chopped, divided", "3 ounces (6 tablespoons) unsalted butter", "3/4 cup (5 ounces) granulated sugar", "3/4 cup heavy whipping cream", "1 teaspoon pure vanilla extra ", "2 1/2 teaspoons fleur de sel or other fine-grained sea salt, divided", "2 tablespoons unsweetened cocoa powder (natural or Dutch process)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 8 ounces of the chopped chocolate in a 2-quart bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the butter into small pieces and place it in a 2-quart saucepan with the sugar. Cook over medium heat, stirring with a heat resistant spatula, until the sugar and butter melt. Raise the heat to medium-high and cook until the mixture turns amber colored, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At the same time, bring the cream to a boil in a 1-quart saucepan over medium heat. Stir the cream into the butter mixture until completely smooth. Be careful because the cream will bubble and may spatter when added.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the saucepan from the heat and stir in the vanilla and 1 1/2 teaspoons of the salt until thoroughly blended. Immediately pour the caramel over the chocolate in the bowl. Let it stand for 15 to 30 seconds, then stir together until smooth. Cover the bowl with plastic wrap and cool to room temperature. Chill until thick, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Truffles:</strong> Line 2 baking sheets with waxed or parchment paper. Use a 1-inch round ice cream scoop to scoop out the truffles and place them on a baking sheet. Chill uncovered for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust your hands with cocoa powder and roll the truffles into balls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 7 ounces of chocolate in the top of a double boiler over low heat, stirring frequently. Or melt the chocolate in a microwave-safe bowl on low power for 30-second bursts. Stir after each burst to to make sure that the chocolate is melting evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the top pan of the double boiler, if using, and wipe it dry. Add the remaining 3 ounces of chocolate in 3 stages, stirring until it's completely melted. This tempers the chocolate so it won't have any streaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keep the chocolate warm over a pan of water that is 2 degrees warmer than the chocolate. Line a baking sheet with waxed or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a truffle into the melted chocolate and coat completely.  Use a truffle dipper or a plastic fork with the two middle tines broken out to lift the truffle from the chocolate. Let the excess chocolate drip off, then place the truffle on the clean lined baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After dipping 5 truffles at a time, sprinkle a few grains of the remaining salt on top of each. Let the truffles set at room temperature or place them in the refrigerator for 15 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the truffles at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note on storing the truffles:</strong> Store the truffles between layers of waxed paper in an airtight container in the refrigerator up to 1 month. To freeze up to 2 months, wrap the container tightly in several layers of plastic wrap and aluminum foil. Use a large piece of masking tape and an indelible marker to label the contents. If frozen, defrost the truffles overnight in the refrigerator and bring to room temperature before serving.</small></p>"}]}