{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/need_to_know/20090402-seriouslyitalian-thumb.jpg", "author": {"@type": "Person", "name": "Gina DePalma"}, "recipeCuisine": "Italian", "keywords": ["Italian", "pastas", "Seriously Italian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Seriously Italian: Spaghetti All'Ubriaco", "link": "https://www.seriouseats.com/recipes/2009/04/seriously-italian-spaghetti-all-ubriaco-recipe.html", "description": "Every now and then the intrepid eater will encounter a dish that can only be described as mind-blowing. My first bite of this spaghetti, served at a bustling osteria not far from Florence's Piazza Santa Croce, almost made my head spin right off.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Italian", "Pasta", "Vegetarian"], "recipeIngredient": ["2 quarts water", "2 quarts inexpensive (but tasty and drinkable) red wine, plus ½ cup for the pan", "1 lb. thick spaghetti or linguine", "2 fat cloves of garlic, or four small cloves", "2 tablespoons butter, salted or unsalted", "1/2 cup extra-virgin olive oil", "Peperoncino or dried red pepper flakes to taste (optional)", "1/4 cup chopped, flat-leaf Italian parsley "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the water and red wine to a 6-quart stock pot and place it over medium-high heat. Season the liquid generously with kosher salt and cover the pot to bring it to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, peel the garlic and slice it.  Place the butter and olive oil in a sauté pan large enough to fit the pasta and place it over low heat to slowly melt the butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water and wine come to a boil, add your spaghetti; stirring as needed to engulf the pasta in the liquid.  As the spaghetti cooks, stir it often to prevent it from sticking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the garlic to the pan and wait for it to come to a sizzle.  Add the optional peperoncino for some heat, if you like and stir the garlic, keeping the heat low to prevent it from scorching</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the garlic is toasted pale and sizzling, add the additional ½ cup of red wine and a generous splash of the pasta cooking water to the pan and turn up the heat until the liquid simmers. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Test the spaghetti for doneness; when it is al dente, transfer it to the sauté pan along with the parsley.  Keep cooking the spaghetti in the juices, tossing and shaking the pan until the liquid is absorbed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately on warm plates.  The pasta is delicious without grated cheese, but you can grate a bit of Pecorino Romano or Parmigiano-Reggiano over the top if you like. </p>"}]}