{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20091112-food52-tatoleek.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["holiday recipes", "leeks", "potatoes", "Thanksgiving sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Potato Leek Au Gratin", "link": "https://www.seriouseats.com/recipes/2009/11/potato-leek-au-gratin-recipe.html", "description": "[Photograph: Sarah Shatz]...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Potato", "Sides", "Vegetarian"], "recipeIngredient": ["2 leeks (medium size)", "1 garlic clove", "1 splash Vermouth (or dry white wine)", "2 to 2 1/2 pounds boiling potatoes (approximately 6 to 7medium size potatoes such as Yukon Gold)", "1 to 1 1/4 cup grated gruyere", "1 1/4 cup heavy cream", "2 to 3 tablespoons unsalted butter", "Kosher or sea salt (to taste)", "Pepper (to taste)", "1 small saute pan", "4 to 5 shavings of gruyere"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300 °F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove roots and green leaves from leeks. Wash and dry the white part of the leek.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split leeks in half lengthwise. Then chop crosswise into thin to medium size half moon crescents. Dice garlic. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sauté leeks slowly in approximately one tablespoon of the butter on medium low heat in a nonstick pan until soft but not brown (about 6-8 minutes). Add garlic and sauté for a minute more. Add a dash of vermouth (or white wine) and sauté a minute more until most of the vermouth (white wine) has evaporated. The leeks should be damp, but not swimming in vermouth (white wine). Remove leeks from heat, cover and let sit.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and slice potatoes evenly into approximately 1/8th-inch slices. Dump slices in cold water as you slice so that the potatoes don't turn brown. (note: I peel and slice each potato individually rather than peeling them all first so that the peeled potatoes spend less time sitting around possibly turning brown.)<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate a block of gruyere so that you have 1 cup of grated gruyere.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly butter the baking dish. Drain potatoes taking care not to break them.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay down one layer of potato in the dish. Sprinkle generously with salt and pepper. Then sprinkle with sautéed leek mixture. Then sprinkle with some of the gruyere. Finally dot with one or two bits of butter (optional). Repeat sequence until all potatoes are used. The last layer should be just a layer of potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly pour cream all over potatoes in dish. Finish with a few shavings of gruyere which will give a nice color and a little bit of crust. Bake for approximately 1 1/4 to 1 1/2 hours. Cream should simmer and may even gently bubble, but it should never boil (boiling will cause the cream to separate and curdle). It's done when it has a nice golden brown to orange color; the potatoes are tender but still hold their shape; and the cream has thickened and reduced slightly. Let cool for 15 to 20 min before serving.</p>"}]}