{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090826-nectarines.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bite-Size Desserts", "cakes", "Carole Bloom", "Cook the Book", "galettes", "nectarines", "stone fruits", "summer", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Nectarine and Walnut Galettes", "link": "https://www.seriouseats.com/recipes/2009/08/nectarine-and-walnut-galettes-recipe.html", "description": "I cannot think of a better way to <strong>celebrate the nectarine</strong> (one of my most favorite fruits, in case you couldn't tell), than with this lovely recipe for <strong>Nectarine and Walnut Galettes</strong> from <a href=\"http://www.carolebloom.com/\">Carole Bloom</a>'s <strong><em><a href=\"http://www.amazon.com/Bite-Size-Desserts-Creating-Cupcakes-Cobblers/dp/0470226978/?tag=serieats-20\">Bite-Size Desserts.</a></em>", "totalTime": "", "recipeYield": "eight 3-inch galettes", "recipeCategory": ["Cook the Book", "Nectarine", "Nuts"], "recipeIngredient": ["3/4 cup (3 1/4 ounces) plus 2 teaspoons all-purpose flour", "2/3 cup (3 ounces) walnuts, divided", "2 teaspoons plus 1 tablespoon (1/4 ounce) granulated sugar", "1/8 teaspoon kosher or fine-grained sea salt", "3 ounces (6 tablespoons, 3/4 stick) plus 2 teaspoons unsalted butter, chilled, divided", "1 to 2 tablespoons ice water", "1 teaspoon freshly squeezed lemon juice", "Finely grated zest of 1/2 large lemon", "3/4 pound fresh nectarines (2 to 3 medium), halved and pitted", "2 tablespoons (3/4 ounce) firmly packed light brown sugar", "1 extra-large egg yolk, at room temperature", "1/2 teaspoon pure vanilla extract", "1 ounce (2 tablespoons) unsalted butter, softened", "1 tablespoon heavy whipping cream", "1/4 cup apricot preserves", "1 tablespoon amaretto, Cognac, or water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Walnut Pastry Dough</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse together 3/4 cup of flour, 1/3 cup of walnuts, 1 teaspoon of granulated sugar, and salt in the work bowl of a food processor fitted with the steel blade until the walnuts are very finely ground, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut 3 ounces of chilled butter into small pieces and add to the flour mixture.  Pulse until the butter is cut into very tiny pieces, about 30 seconds.  The texture should be sandy with very tiny lumps throughout.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine 1 tablespoon of water, lemon juice, and lemon zest.  With the food processor running, pour this mixture through the feed tube.  Process until the dough wraps itself around the blade, about 30 seconds to 1 minute.  If the dough seems dry, add the remaining 1 tablespoon of water and process until the dough comes together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the dough into a flat disk and wrap tightly in a double layer of plastic wrap.  Chill in the refrigerator until form before using, about 2 hours.  If the dough is too cold and firm, it will splinter and break when rolled out.  Let it stand at room temperature for 10 to 15 minutes to become more pliable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Nectarine Filling</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the nectarines into 1/2-inch-thick slices and cut each slice in half across the width.  You should have approximately 3 cups of sliced fruit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sliced nectarines together in a large mixing bowl.  Add the brown sugar and toss together to distribute evenly.  Taste the fruit to see if it needs any more brown sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Walnut Filling</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse the remaining 1/3 cup of walnuts and 1 tablespoon of granulated sugar together in the work bowl of a food processor fitted with a steel blade until the walnuts are very finely ground, about 1 minute.  Add the egg yolk and vanilla and pulse to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the softened butter into small pieces and add it to the walnut mixture.  Pulse several times until the butter is cut into tiny pieces.  Add the remaining 2 teaspoons of flour and pulse until the mixture is smooth, about 15 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembly</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat the oven to 375&deg;F.  Line a baking sheet with parchment paper or a nonstick liner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a smooth, flat surface, roll out the pastry dough between sheets of lightly floured waxed or parchment paper to a large disk about 14 inches in diameter.  Carefully peel the paper off the top of the dough and brush off any excess flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip a 4-inch round plain biscuit cutter into flour or use a small knife to cut out 4-inch rounds of dough.  Use an offset spatula to lift the dough rounds and transfer them to the lined baking sheet, leaving at least 1 inch of space between them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the walnut filling evenly among the dough rounds.  Use a spoon or offset spatula to spread the filling over the center of the pastry dough, leaving a 1-inch border all around.  Mound the sliced nectarines over the walnut filling in the center of each dough circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the remaining 2 teaspoons of chilled butter into small pieces and distribute them evenly over the sliced nectarines.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Fold the border of each dough round up so that it partially encloses the nectarines and walnut filling. It will naturally form pleats as it is folded. Brush the borders of each dough round with some of the cream, being careful that it doesn't run down the sides and under the galettes. If it does, wipe it up because it can cause the bottoms of the galettes to burn. Gently lift back the folds of the dough and brush those areas with more cream, then replace the folds. Evenly sprinkle the remaining 1 teaspoon of granulated sugar over the dough borders.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the galettes for 35 to 40 minutes, until the crusts are light golden.  Remove the baking sheet from the oven and transfer to a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Apricot Glaze</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the apricot preserves and amaretto, Cognac, or water in a small saucepan.  Bring to a boil over medium heat.  Remove the saucepan from the heat and strain the glaze into a small bowl, pushing through as much of the pulp as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a goose-feather pastry brush to lightly brush the top of each galette with the glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note on storing the galettes:</strong> Although the galettes are best eaten the day that they are made, they can last for up to two days.  Store them tightly covered with aluminum foil at room temperature. </small></p>"}]}