{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100516handpie_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "pies", "sausage", "savory pies", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Sausage and Feta Hand Pies", "link": "https://www.seriouseats.com/recipes/2010/05/sunday-brunch-sausage-and-feta-hand-pies-brunch-breakfast-recipe.html", "description": "Since brunch is a casual, loosely defined weekend meal, it's a great time to try out savory dishes that seem too unusual, rich, or time-consuming for a weeknight dinner. <strong>Sausage and feta hand pies</strong> are just such a meal, and out-of-this-world delicious besides. They're pretty little packages with a very high crust-to-filling ratio. They may induce embarrassing but uncontrollable moans of bliss.", "totalTime": "", "recipeYield": "12", "recipeCategory": ["Cheese"], "recipeIngredient": ["Olive oil", "2-3 sweet Italian sausages (2/3-1 pound total), casings removed", "1 large onion, thinly sliced", "1 head fennel, trimmed, cored, and thinly sliced", "1/2 teaspoon crushed red pepper flakes (optional)", "Salt", "Pepper", "1 pound plum tomatoes, quartered lengthwise, seeded, and cut into 1/2-inch dice", "8 ounces feta cheese, crumbled", "1/2 cup flat leaf parsley leaves, chopped", "Flour for dusting", "1 large egg, lightly beaten", "2 tablespoons fennel seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil in a large skillet over medium heat. Put the sausage in the pan and break it up with a wooden spoon. Cook, stirring occasionally, until browned, about 5 minutes. Use a slotted spoon to remove the sausage to a plate lined with paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons olive oil to the skillet along with the onion and cook over medium heat for 2 minutes, stirring occasionally. Add the fennel and, if using, red pepper flakes; season with salt and pepper. Cook until the vegetables are tender, about 8 minutes. Add the tomatoes and cook, stirring, until they release their juices, 3 to 4 minutes. Turn off the heat, stir in the sausage, and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425 with racks in the upper and lower thirds. Line two baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the feta and parsley into the cooled sausage filling. Roll one piece of dough out into a 16 by 11 inch rectangle. I do this in between two pieces of parchment paper and dust the dough lightly with flour on both sides. Trim the large rectangle down to 15 by 10 inches and then cut this rectangle into six 5-inch squares. Sweep any excess flour away with a dry pastry brush. Make the other piece of dough into 6 squares, too.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put about 1/2 cup filling in the center of each square of dough. Fold all four corners around the filling so that the points meet in the center but do not touch; leave about 1/4 inch of space between the edges. Transfer the hand pies to the prepared baking sheets. (As an alternative, you can ease the squares of dough into standard-size muffin tins, fill with sausage-feta mixture, and fold the dough edges over the top. Bake for the same amount of time.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the tops of the dough with beaten egg and sprinkle with fennel seeds. Bake, switching the position of the sheets halfway through, until golden brown, 35-40 minutes. Cook slightly on a wire rack and serve warm.</p>"}]}