{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101209-127355-dinner-tonight-enchiladas-suizas.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["butternut squash", "Dinner Tonight", "enchiladas", "Mexican", "Rick Bayless", "squash", "tomatillos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Enchiladas Suizas", "link": "https://www.seriouseats.com/recipes/2010/12/enchiladas-suizas-rick-bayless-recipe.html", "description": "I am astonished I haven't written about this recipe before. It's probably <strong>my favorite enchilada variation</strong>&mdash;it's comforting, soothing, and wildly addictive. For help I turned to <strong>Rick Bayless's <em><a href=\"http://www.amazon.com/dp/0393058999/?tag=serieats-20\">Fiesta at Rick's</a></em></strong> (one of our <a href=\"http://www.seriouseats.com/2010/12/gift-guide-the-ten-best-cookbooks-of-2010.html\">favorite cookbooks of 2010</a>) and I'm really glad I did. He replaces the normal shredded chicken with roasted vegetables.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Mexican", "Squash"], "recipeIngredient": ["1 pound tomatillos, husks removed and rinsed", "1 medium white onion, sliced ¼-inch thick", "3 garlic cloves ", "3 serranos, stemmed ", "3 ½ tablespoons canola oil, divided", "2 cups vegetable or chicken broth ", "½ cup Mexican crema (or creme fraiche)", "2 large carrots, peeled and cut into ½-inch cubes ", "1 large red onion, peeled and cut into ½-inch cubes", "2 cups cremini mushrooms, cleaned, stems removed, and cut into ½-inch cubes", "1 butternut squash, peeled and seeds scooped out, flesh cut into ½-inch cubes", "12 corn tortillas ", "⅔ cup chihuahua cheese (or other Mexican melting cheese)", "<strong>For Garnish</strong>", "¼ White onion, thinly sliced ", "4 tablespoons cilantro, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower middle and upper middle positions and preheat broiler. Toss tomatillos, onion, garlic, and serranos on large baking sheet and place in oven. Roast for four to five minutes, or until tomatillos soften and start to turn black. Flip everything over with pair of 12-inch tongs. Return to oven and cook for another four to five minutes. Some black is okay, but adjust vegetables if they simply start to burn. Remove and let cool. Adjust heat in oven to 400 degrees. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer all contents on baking sheet to a blender. Process until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 ½ tablespoons canola oil into large dutch oven set over medium-high heat. When hot, dump contents of blender in. It should immediately start to sizzle and bubble. Cook, stirring often with wooden spoon, until darker, about three minutes. Pour in broth and crema, turn heat to medium-low, and stir until mixture is smooth. Partially cover dutch oven, and simmer for 30 minutes. Season to taste with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss carrots, red onion, mushrooms, and butternut squash with one tablespoon oil on a baking sheet. Season with a pinch of salt Place on the lower-middle rack in oven and cook for about 25 minutes. Toss with pair of 12-inch tongs after 10 minutes, and after 20. Vegetables, and especially carrots, should be tender. Return to oven for another five minutes if they are not.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour remaining tablespoon of oil into a bowl. Using a brush, coat both sides of each tortilla with oil. Stack them up, and then place in a large plastic ziplock bag. Do not close bag. Place in microwave and cook for 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour one cup of sauce into a 13 by 9-inch baking dish. Scoop about two tablespoons of the roasted vegetables into each tortilla. Roll up, and place seam-side down in the sauce on the baking dish. Repeat 11 times. Pour remaining sauce over them, and then sprinkle cheese evenly on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place baking dish in oven and cook for 10 minutes, or until warm. Remove from oven, and using a spatula, transfer three enchiladas to each dish. Garnish with onion rings and cilantro. Eat immediately. </p>"}]}