{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100924-gadogado-610.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Asian", "bean sprouts", "coconut milk", "cucumbers", "garlic", "lettuce", "peanuts", "Seriously Asian", "shrimp paste", "spicy", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gado Gado", "link": "https://www.seriouseats.com/recipes/2010/09/asian-gado-gado-tofu-bean-sprouts-street-food.html", "description": "Note: This recipe is adapted from The Cradle of Flavor by James Oseland....", "totalTime": "", "recipeYield": "4 as a main dish", "recipeCategory": ["Garlic", "Nuts", "Salads", "Tofu"], "recipeIngredient": ["<h4>For the Javanese peanut sauce: </h4>", "1 1/2  cups unsalted skinned roasted peanuts", "1 1/2  teaspoons dried shrimp paste", "1 fresh red Holland or green thai chile, or fresno, cayenne, or serrano", "2 medium cloves garlic, coarsely chopped", "3 to 4 tablespoons palm sugar, thinly sliced, or dark brown sugar", "3/4 cup unsweetened coconut milk", "1 tablespoon cider or rice vinegar", "3/4 teaspoon kosher salt", "3/4 cup water", " ", "<h4>For the Gado Gado </h4>", "3 cups mung bean sprouts", "1 tablespoon vegetable oil", "6 ounces cotton tofu, drained and sliced into 1/4 inch cubes", "1 large cucumber, cut into 2-inch long matchsticks, 1/4 inch on each side", "1/2 head leafy green lettuce, torn into large bite-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the peanut sauce: </strong>  Heat a 12-inch nonstick skillet over medium heat until hot, about 1 minute. Add the peanuts and toast, shaking the pan every few seconds, until golden brown, 3 to 5 minutes.  Transfer to bowl and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shrimp paste in the center of a small square of foil.  Fold edges of the foil over to enclose the shrimp paste.  Using a pair of tongs, place foil over direct heat of burner set to medium-high.  Toast on both sides until fragrant, about 1 minute total.  Using a spoon, scrape paste into a small bowl and allow it to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer peanuts to food processor and pulse until they are the consistency of sand, about 12 one-second pulses. Add toasted shrimp paste, chile, garlic, and sugar to the peanuts in the food processor.  Pulse until mixture is grainy, about 8 to 10 one-second pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return mixture to skillet.  Add coconut milk and bring to gentle simmer over medium-low heat.  Continue to cook, stirring constantly, until the milk is thick and will coat the back of a wooden spoon, about 5 to 7 minutes.  Add vinegar and salt and stir well to combine.  Add water.  Sauce should have consistency of thick cream.  </p>\r\n\r\n<p>Set aside to cool before using.</p>\r\n\r\n<p>Stores well in fridge for up to a week, reheat briefly, then allow to cool to room temp . If sauce becomes too thick, stir in a little water.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> To assemble gado gado:</strong> Fill saucepan 3 quarts water and bring to a boil over high heat.  Add the bean spouts and blanch just until they begin to soften, 10 to 20 seconds.  Using a slotted spoon, transfer the bean sprouts to a colander and run cold water over them until cool.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in nonstick 12 inch skillet over medium-high heat until shimmering. Add tofu and cook until golden brown on all sides, 2 to 3 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bean sprouts, cucumbers, lettuce, and tofu into large mixing bowl.  Add the peanut sauce and toss thoroughly.  Serve immediately to retain the crispness of the vegetables.</p>"}]}