{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100415VealStewForestiere610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["beef", "French", "French in a Flash", "stews", "veal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Veal Stew Forestière", "link": "https://www.seriouseats.com/recipes/2010/04/french-in-a-flash-veal-stew-forestiere-recipe.html", "description": "A stew may seem heavy and wintry for the budding springtime, but this stew is lighter, fresher, and full of tender veal, earthy mushrooms, fresh lemony thyme, and shards of salty, crisp Jambon de Bayonne. With a dash of luscious cream, it's a breath of fresh, springtime air in the stuffy world of stews.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "French"], "recipeIngredient": ["2 tablespoons light olive oil ", "1 1/2 pounds veal stew meat", "4 shallots, diced", "2 cloves garlic, diced", "2 8-ounces boxes of sliced wild mushrooms (including shiitake, oyster, cremini)", "1/2 cup dry sherry", "2 cups beef stock", "6 stems thyme", "2 slices Jambon de Bayonne, or Prosciutto", "1 tablespoon butter, room temperature", "1 1/2 tablespoons flour", "1/4 cup cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stew pot, heat the olive oil on medium-high heat. Sear the cubes of meat on all sides. The meat will not be cooked through. Remove it to a plate while you get on with the rest of the stew.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a bit of light olive oil or butter to the pot if it needs it, and lower the heat to medium-low. Add the shallots and the garlic and sweat very gently for 1 minute, until the shallots are translucent, and the garlic is fragrant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the mushrooms to the pot, and turn up the heat slightly. Cook until soft and a touch brown around the edges: 6 to 8 minutes. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Deglaze the pan with the sherry. For safety, pour the 1/2 cup sherry into a separate cup, take the pan off the heat, and add it in. Turn the heat up so that the sherry bubbles and reduces.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the meat back into the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the beef stock and the thyme. Cover, and bring to a boil over high heat. When the pot boils, reduce the heat to low, and cook covered for 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, spray a baking sheet with nonstick spray. Lay out two slices of Jambon de Bayonne or Prosciutto on the baking sheet, and place in the 450&deg;F oven for 10 minutes until crisp. Allow to cool. Brake the crispy ham into salty shards. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a beurre manié by mashing together the butter and the flour.  Stir into the stew, and let it bubble up a few minutes until the stew has noticeably thickened. Take the pot off the heat, and stir in the cream. Pull out the stems of thyme.  Add the crispy shards of ham on top.  </p>"}]}