{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101005%20fresh%20corn%20yeast%20bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "corn", "fall"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Sweet Corn Yeast Bread", "link": "https://www.seriouseats.com/recipes/2010/10/bread-baking-sweet-corn-yeast-bread.html", "description": "Corn starts getting old faster than almost anything else. Picked fresh and cooked soon, it's amazingly good. After few days, it's just okay. Another day or two, and it's time to get creative.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread Baking", "Breakfast and Brunch", "Corn", "Yeast Bread"], "recipeIngredient": ["1 1/2 cups fresh corn (about 3 small cobs)", "2 1/2 teaspoons (1 package) instant yeast", "1 1/2 teaspoons kosher salt", "1 tablespoon sugar", "13 1/2 ounces (about 2 1/2 cups) bread flour", "2 tablespoons unsalted butter", "Olive oil for greasing bowl", "Cornmeal for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree the corn in your food processor until smooth. Add yeast, salt, sugar, flour, and butter and process until you have a smooth ball of dough that is elastic and begins to clear the sides of the bowl. Because the corn could have a variable amount of liquid, you might need to adjust the moisture in the dough. If it's too dry, add water by the tablespoon until the dough comes together to form an elastic ball. If it's too wet, add flour slowly until the dough clears the sides of the processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto lightly floured work surface. Knead briefly, then form it into a ball. Place the dough into a lightly greased bowl, and turn it to coat with oil. Cover bowl with plastic wrap and set aside to rise until doubled, about 90 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Turn dough out onto lightly floured work surface. Knead it briefly, then form it into a tight ball. Place on baking sheet lightly sprinkled with cornmeal and cover with plastic wrap. Let it rise until doubled, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap, slash as desired, and bake until well-browned. 35-40 minutes. Let the bread cool completely on a rack before cutting.</p>"}]}