{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101124applegalette.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apple", "apples", "Avec Eric", "cakes", "caramel", "Cook the Book", "desserts", "Eric Ripert", "galette", "holiday baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Apple Galette", "link": "https://www.seriouseats.com/recipes/2010/11/apple-galette-recipe.html", "description": "This <strong>Apple Galette</strong> from <a href=\"http://aveceric.com/about-eric-ripert.html\">Eric Ripert</a>'s <strong><em><a href=\"http://www.amazon.com/Avec-Eric-Culinary-Journey-Ripert/dp/0470889357/serieats-20\">Avec Eric</a></em></strong> is something like a deconstructed-then-reconstructed tarte tatin.  The apples are soft and sweet but still tart, intensely flavored, and beautifully glazed thanks to the slow cooking with the caramel powder.", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Apple", "Bake the Book", "Cook the Book", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": [" 1/2 cup granulated sugar", "Water, as needed", "3 tablespoons unsalted butter, approximately", "1/2 teaspoon ground cinnamon ", "1/2 vanilla bean, split lengthwise", "5 Granny Smith apples, peeled and cored ", "1 sheet frozen puff pastry dough, cut into a 9-inch circle, kept in the freezer ", "1 egg, slightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a silicon baking mat (such as a Silpat) or a large sheet of parchment paper on a flat work surface, and have ready another mat or sheet of parchment paper. Place the sugar in a heavy saucepan and add enough water to cover the sugar. Cook the sugar, without stirring, until it turns into a dark caramel, about 10 minutes. Remove the pan from the heat and stir in 2 tablespoons of the butter and cinnamon. Scrape the seeds from the vanilla bean into the caramel and stir to blend. Pour the caramel mixture onto the center of the mat or parchment paper on the work surface, then place the second mat or sheet of parchment paper on top. Using a rolling pin, flatten the caramel carefully and allow it to cool and set. Break the caramel mixture into small pieces, then place them in a food processor and grind them into a fine powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Lightly coat an 8-inch round cake pan with the remaining 1 tablespoon of butter and sprinkle in a little of the cinnamon-caramel powder. Slice the apples crosswise, as thinly as possible. Arrange half of the apple slices over the cinnamon-caramel powder in the pan, forming one layer and overlapping slightly. Cover the apples with a few spoonfuls of the cinnamon-caramel powder and repeat with the remaining apple slices and caramel powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan with aluminum foil and bake for 1 hour, or until the apples are cooked through, tender, and just slightly caramelized. Remove the foil and bake an additional 20 minutes, allowing the excess moisture to evaporate. Transfer the pan to a rack and allow the apples to cool. Meanwhile, increase the oven temperature to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cold puff pastry round, centered, on top of the pan over the cooled apples. Cover with a large sheet of parchment paper and top with a baking sheet, then invert the apple cake onto the parchment-lined baking sheet. If necessary, recenter the inverted cake pan on top of the puff pastry dough, leaving a 1-inch border of dough around the pan. Remove the cake pan, revealing the layers of baked apples. Lightly brush the exposed dough with the beaten egg and bake for 20 to 25 minutes, or until the dough is golden brown and has puffed evenly around the apple filling. Cool slightly, then slice into wedges and serve.</p>"}]}