{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/10042010spongecake.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["cakes", "desserts", "hyssop", "rose", "Spice Hunting", "sponge cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hyssop and Rose Sponge Layer Cake", "link": "https://www.seriouseats.com/recipes/2010/10/hyssop-rose-sponge-layer-cake-recipe.html", "description": "[Photograph: Max Falkowitz] Like lavender, hyssop really comes into its own with desserts. Dried leaves can be infused into any water-based liquid, unlocking their full flavor. I wanted to take advantage of sponge cake's high water content to carry hyssop's...", "totalTime": "2 1/2 hours, with an optional overnight refrigeration", "recipeYield": "6 to 8", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["6 tablespoons boiling water", "1 to 2 tablespoons dried hyssop leaves (use the first for a hint of hyssop, the second for more prominent flavor)", "6 eggs, separated, at room temperature", "1 1/2 cups sugar", "1 1/2 cups cake flour", "1 1/2 teaspoons baking powder", "1 teaspoon table salt", "1/3 cup rose jam", "1 cup cold heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 325&deg;F. Pour boiling water over the hyssop leaves in a small bowl and steep for three minutes. Strain through fine mesh strainer into 1-cup liquid measure cold water to get back to six tablespoons total (1/4 cup plus two tablespoons). Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat together egg yolks and sugar in stand mixer or by hand in medium bowl until light and pale yellow and mixture falls in ribbons from whisk. Add cooled hyssop water and stir to combine. Add the flour, baking powder, and salt. Stir until just combined&mdash;do not overmix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In clean bowl with new whisk (carefully clean stand mixer and whisk attachment if using) beat the egg whites until they form stiff peaks. The whites should be dry but still have a shine to them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir about a quarter of your beaten whites into yolk mixture to lighten it, then add remaining whites in three or four additions, folding gently with rubber spatula. Line the bottom of loaf pan with parchment paper and pour the batter in. It should come to just below the lip (excess batter can be baked in separate small ramekin). Bake until top feels firm and springy when pressed with a finger, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide knife around edges of the pan and remove cake onto a cooling rack. Allow to cool 10 minutes, then slice into thirds. Let slices cool completely, then spread rose jam evenly on one layer. Add the middle layer. Whip the heavy cream until it forms stiff peaks, then spread it on the middle layer and cover it with the top. Trim sides to form neat rectangle if desired. Serve immediately or chill overnight covered in plastic wrap to enhance hyssop flavor.</p>"}]}