{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100325blueribbonmatzohballsoup.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Kosher", "keywords": ["Blue Ribbon", "Bruce Bromberg", "Eric Bromberg", "Jewish", "matzo", "matzo ball soup", "matzo balls", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blue Ribbon's Excellent Matzo Ball Soup", "link": "https://www.seriouseats.com/recipes/2010/03/blue-ribbons-excellent-matzoh-ball-soup-recipe.html", "description": "Is Blue Ribbon's matzo ball soup better than either of my grandmother's? I'd rather not say. What I will say is that it lived up to the title of \"excellent\"&mdash;the stock was beautifully flavored, and the matzo balls were the ideal weight and density and tasted of chicken fat in the best possibly way.", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Kosher", "Passover", "Soups and Stews"], "recipeIngredient": ["<strong>Chicken Broth</strong>", "1 whole chicken (3 to 4 pounds)", "1 tablespoon kosher salt", "5 celery stalks with leaves, chopped", "3 carrots, peeled and chopped", "1 onion, chopped", "3 garlic cloves, peeled", "4 sprigs of fresh flat-leaf parsley", "3 sprigs of fresh dill", "1/2 teaspoon black peppercorns", "2 dried bay leaves", "<strong>Matzo Balls</strong>", "4 large eggs", "1 cup matzo meal", "2 tablespoons schmaltz (rendered chicken far reserved from making broth) or duck fat", "1 tablespoon kosher salt", "1 teaspoon baking powder", "1/4 cup seltzer water", "3 carrots, peeled and sliced into 1/4-inch-thick rounds (about 1 cup)", "Salt and freshly ground black pepper", "1 1/2 tablespoons finely chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the chicken with salt inside and out. Let rest on a plate in the refrigerator for 15 minutes. Rinse very well under cold running water and then pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chicken in a large stockpot and add enough cold water to cover by 3 inches. Bring to a boil, them skim off any foam that rises to the top. Add the celery, carrots, onion, garlic, parsley, dill, peppercorns, and bay leaves, and return the liquid to a boil. Skim again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat and let simmer uncovered until the chicken is cooked, about 45 minutes. Transfer the chicken to a large bowl and, when cool enough to handle, take the meat off the bones (reserve the meat for another purpose). Return the bones to the pot  and simmer for 1 hour more. Strain through a cheesecloth-lined sieve, discarding the solids. Cool the broth slightly, then refrigerate until cold, overnight or up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, skim off the solidified chicken fat from the broth. Save for making matzo balls or another purpose.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the matzo balls:</strong> In a large bowl, stir together the eggs, matzo meal, schmaltz, salt, and baking powder. Add the seltzer and use a rubber spatula to mix well. Cover with plastic wrap and refrigerate for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large, wide pot with salted water and bring to a boil. Fill a small bowl with cold water and have nearby to keep your hands clean and wet. Working gently, without pressing, use clean, wet hands to form 1/2-inch-round matzo balls. As they are formed, drop them into the boiling water. When all of the matzo balls are formed, cover the pot with a round of parchment paper to keep them submerged (or partially cover the pot with a lid if you don't have parchment paper) and simmer very gently (don't let the water boil again) until cooked through and tender, 45 minutes to 1 hour.  Remove from the cooking liquid with a slotted spoon, and arrange in a single layer on a rimmed baking sheet. If not using that day, let cool to room temperature, then store the matzo balls in a single layer in an airtight container filled with cooled cooking liquid to cover for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, gently reheat the matzo balls in a pot filled with matzo ball cooking liquid or fresh water to cover (when the water comes to a simmer, taste a matzo ball to see if it's hot enough, and either use immediately or continue to simmer until warmed to taste).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate pot, bring the chicken broth to a boil. Add the carrot rounds and simmer until soft, about 7 minutes. Season to taste with salt and pepper, then add the dill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the broth into individual serving bowls. Use a slotted spoon to transfer the warmed matzo balls into the soup and serve piping hot.</p>"}]}