{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101129DaubeRoastBeefSandwich610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["beef", "French", "French in a Flash", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Daube Roast Beef Sandwiches", "link": "https://www.seriouseats.com/recipes/2010/12/french-in-a-flash-daube-roast-beef-sandwiches-recipe.html", "description": "All the flavors of Daube on a roll: tender beef, punchy orange and olives, sweet onions and carrots, earthy herbes de Provence, and deep wine and stock. A perfect way to update and cheat your way back on a French classic.", "totalTime": "", "recipeYield": "2 to 4", "recipeCategory": ["Beef", "French", "Sandwiches"], "recipeIngredient": ["1 tablespoon olive oil", "1 half medium yellow onion, sliced thinly on a mandoline", "1 half small carrot, peeled ", "1 clove of garlic, whole but bruised, plus 1 large clove, whole and peeled", "1/2 teaspoon dried herbes de Provence", "5 French oil-cured black olives, roughly chopped", "3 wide strips of orange zest, made with a vegetable peeler", "1 teaspoon unbleached all-purpose flour", "1/4 cup dry rosé wine (red or white would do as well)", "1 cup low-sodium beef stock", "Kosher salt and freshly ground black pepper", "1/2 pound thinly-sliced rare roast beef", "1 thin baguette, or 4 French rolls, or 4 small Kaiser rolls"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil over in 10-inch skillet over medium heat until shimmering. Add onions, bruised garlic clove, and carrot. Cook, stirring frequently until translucent but not browned, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add herbes de Provence, olives, orange zest, and flour, cook for 30 seconds, stirring continuously. Add wine, stirring vigorously and allow to reduce for 30 seconds. Add beef stock, and whisk to pick browned bits on bottom of pan. Cover, and simmer on low heat for 20 minutes until gravy-like consistency is reached. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate slices of beef, and add to pot. Remove from heat and stir beef into sauce. Cover, and let stand 10 minutes. Remove carrot, orange zest, and whole garlic. Discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast baguette or rolls in a toaster under the broiler. Cut remaining whole garlic clove in half, and rub bread with cut side of garlic. Pile meat into bread and serve immediately.</p>"}]}