{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/22100326-kugel-primary.jpg", "author": {"@type": "Person", "name": "Special to Serious Eats"}, "recipeCuisine": "", "keywords": ["Arthur Schwartz", "hanukkah sides", "kugel", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Potato Kugel", "link": "https://www.seriouseats.com/recipes/2010/03/potato-kugel-arthur-schwartz-passover-recipe.html", "description": "<strong>Arthur <a href=\"http://www.thefoodmaven.com/index.html\">\"The Food Maven\"</a> Schwartz</strong> has written many, many wonderful cookbooks, including <em><a href=\"http://www.amazon.com/dp/1580088988/?tag=serieats-20\">Jewish Home Cooking,</a></em>. In this recipe for potato kugel (which he said he's planning to make for this year's Passover Seder) his secret to a <strong>fluffy, non-gluey</strong> batch is using an inordinate number of eggs. That and using Russet potatoes. \"The ticket to kugel lightness,\" he swears.", "totalTime": null, "recipeYield": "at least 12", "recipeCategory": ["Passover", "Potato"], "recipeIngredient": ["3 pounds Russet (baking) potatoes", "12 eggs", "2 medium onions (12 ounces), peeled and cut into chunks", "2/3 cup matzoh meal", "1 tablespoon salt", "3/4 to 1 teaspoon freshly ground black pepper", "3 tablespoons vegetable oil (for a parve pudding) or schmaltz "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 °F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the potatoes and chunk them up, getting them ready for the food processor. Keep in a bowl of cold water until ready to process, but don't leave them there longer than a few hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a very large bowl, beat together the eggs, until well mixed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor fitted with the metal blade, pulse the onion until very finely chopped, but not liquefied. Scrape the onions into the bowl with the eggs and stir them in. Stir in the matzoh meal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the potatoes. In the same processor bowl (no need to clean), in three batches, process the potatoes until very finely chopped. The pieces should be no bigger than a grain of rice and mostly smaller. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As each batch of potatoes is processed, immediately scrape it into a strainer placed over a bowl. With a rubber spatula or the back of a spoon, press out the moisture. Immediately, stir the potatoes into the onion and egg mixture. Discard the liquid and potato starch that will settle in the bowl. Season the batter with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 2 tablespoons of vegetable oil or schmaltz into a 13 by 9-inch baking pan, preferably glass. Turn the pan to coat the bottom and half way up the sides with the oil or schmaltz. Place the empty pan in the preheated oven for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the oiled pan from the oven and pour the potato batter into the pan. The oil will come up the sides of the pan, especially in the corners. Press the batter down near the corners to lightly to fill them with potato batter. It's a good thing when the oil comes over the top of the batter. It adds crispness. Drizzle the remaining tablespoon of oil or melted schmaltz on the surface of the batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 1 hour and 15 minutes, until lightly browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let rest for at least 15 minutes before cutting and serving, preferably somewhat longer. Serve hot or warm, freshly baked or reheated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The kugel reheats extremely well in a 350°F oven, uncovered so the top can crisp up additionally. Reheating time depends on the size of the piece being reheated, and at what temperature the kugel is when going into the oven. It can be kept in the refrigerator for at least four days, and for several months in the freezer. It is best to defrost before reheating. </p>"}]}