{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/02082010broccolichickenmac.jpg", "author": {"@type": "Person", "name": "Joy Manning"}, "recipeCuisine": "", "keywords": ["broccoli", "chicken", "mac and cheese", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Mac &amp; Cheese with Chicken and Broccoli", "link": "https://www.seriouseats.com/recipes/2010/02/meat-lite-mac-cheese-with-chicken-and-broccol.html", "description": "[Photograph: Joy Manning] This recipe sprang from some leftovers that I had on hand during a recent blizzard that buried us here in Philadelphia as well as an intense craving I had for starchy, cheesy comfort food. This homey casserole...", "totalTime": null, "recipeYield": "serves 6", "recipeCategory": ["Broccoli", "Chicken", "Mains", "Meat Lite", "Pasta"], "recipeIngredient": ["2 broccoli crowns (6 ounces), broken down into florets and chopped", "6 ounces of a short, curved pasta shape, like elbows", "3 tablespoons butter, plus more for preparing the baking dish", "1 shallot, minced", "1/2 teaspoon salt", "1/8 teaspoon cayenne", "3 tablespoons of flour", "2 1/2 cups milk", "1 cup (3 ounces) grated cheddar cheese", "1/2 cup mascarpone cheese", "2 cups shredded chicken, from a home roasted or rotisserie bird", "1/4 cup plain bread crumbs", "1/3 cup grated Parmesan or Romano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9-by-13-inch baking dish and set aside. Bring a pot of salted water to a boil and par-cook the broccoli for three minutes. Plunge into an ice bath, and reserve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F; bring a large pot of salted water to the boil. Cook the pasta for 75 percent as long as the package instructions describe, then drain and reserve the pasta. (The pasta will finish cooking as the casserole bakes.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pasta is cooking, make the cheese sauce by melting the butter in a saucepan over medium heat. When the butter is melted, add the shallot, salt, and cayenne, and cook, stirring often, for 5 minutes. Add the flour, and cook another minute. Slowly pour in the milk, whisking constantly, until the mixture is smooth. Bring to a boil, reduce to a simmer, and cook for another few minutes, until it is thick enough to coat the back of a spoon. Off the heat, stir in the cheddar and mascarpone, whisking until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the pasta and sauce to combine, and stir in the broccoli and chicken. Pour everything into the prepared baking dish, and top with the bread crumbs and grated Parmesan or Romano cheese. Bake for about 20 minutes, until the top is lightly golden brown. </p>"}]}