{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100629-nastybits-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["chicharonnes", "pork", "pork belly", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "4"}, "name": "The Nasty Bits: How to Make Chicharrones", "link": "https://www.seriouseats.com/recipes/2010/06/the-nasty-bits-how-to-make-chicharrones-recipe.html", "description": "When I asked  <a href=\"http://www.seriouseats.com/user/profile/GoodEaterKenji\">Kenji</a> if he knew of any good recipes for chicharrones, he instantly thought of a technique he learned in Colombia. The method seemed too good to be true: <strong>place segments of pork belly in a wok with a bit of water, set it over the stove, and let the fat render out over the course of a few hours.</strong> Towards the end, turn up the heat, thereby using the fat in the wok to deep-fry the belly.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Pork", "The Nasty Bits"], "recipeIngredient": ["1 pound pork belly, skin side rubbed with 2 teaspoons baking soda and 1 teaspoon salt", "Water to cover", "Salt and pepper to taste", "Spices of your choice such as cayenne, sugar, and paprika"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the belly: Rub the baking soda and salt all over the surface of the skin, taking care to distribute the powder evenly. Set the pork belly on a rack and place it uncovered in the refrigerator for at least an hour but preferably overnight and for up to a day.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, rinse the belly in cold water and pat dry. Cut into 1-inch segments, about 1/3-inch thick. Place all the segments of belly into a wok and add enough water to cover the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to low. Over the course of 2 to 4 hours, depending on the moisture content of your pork, slowly render the fat from the belly, turning the segments of meat every half hour or so. Keep the heat on low. In the beginning, the water will look like pork stock but over time the water will cook off, leaving only the lard in the pan.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When only liquid fat remains in the wok, turn the heat to high and carefully monitor the pieces of belly as they deep-fry in the lard. This last stage of deep-frying should take about 3 to 5 minutes. Using a slotted spoon, transfer the chicharrones to a plate lined with paper towels to blot the extra fat. Toss with salt and your choice of seasonings. The chicharrones will remain crispy for many hours.  </p>"}]}