{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100621creamsicles.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "desserts", "ice cream", "popsicles", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: A Midsummer Night's Creamsicles", "link": "https://www.seriouseats.com/recipes/2010/06/cakespy-a-midsummer-nights-creamsicles-recipe.html", "description": "This week marks Midsummer, that magical part of the year where the days are long and, according to Shakespeare, the nights are made of magic. <strong>And while Shakespeare is fine, creamsicles are divine&mdash;and so I present A Midsummer Night's Creamsicles</strong>, a homemade version of the classic treat which truly taste best when enjoyed in the summer months.", "totalTime": "", "recipeYield": "4-6, depending on size", "recipeCategory": ["Cakespy"], "recipeIngredient": ["<strong>For the filling:</strong>", "4 scoops of softened vanilla ice cream", "<strong>For the coating:</strong>", "4 scoops of orange sorbet", "1 scoop of vanilla ice cream", "1/2 to 1 cup milk or cream ", "<strong>Special equipment: </strong>Popsicle sticks, waxed paper, paper cups"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a piece of waxed paper into an approximately 8x8-inch square. Place one scoop of vanilla ice cream directly in the center. Place the popsicle stick in the center of the ice cream, and gently shape the ice cream so that it covers the top half of the popsicle stick. Gently roll the waxed paper so that the ice cream forms a sort of cylinder around the top half of the popsicle stick, and put in the freezer so it can harden for at least an hour. Repeat these steps with your remaining popsicle sticks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the sorbet, scoop of vanilla ice cream, and milk or cream in a blender. Blend until smooth and creamy. It should be a thick, but pourable, consistency. Add more milk or cream if the mixture is too thick; add a little more sorbet or ice cream if it feels too thin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble the pops. Fill your paper cup about 1/3 full with the sorbet mixture. Unwrap one of your prepared vanilla ice cream-on-a-stick concoctions, and place, ice cream side down, in the cup. Fill the rest of the cup with the sorbet mixture, so that it coats the vanilla ice cream center on all sides. Repeat with your remaining pops and coating mixture until you've run out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> If you have extra vanilla pops you can prepare a bit more coating and make extra pops; if you have extra coating mixture and don't feel like waiting for more vanilla pop centers to chill, it also makes for a very tasty drink as is.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return to the freezer and let chill for several hours before serving. Remove from freezer, loosen from cups (cut off cups if necessary) and enjoy immediately.</p>"}]}