{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101221snoutsoupprimary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Nasty Bits", "pork", "soup", "split pea soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Snout and Split Pea Soup", "link": "https://www.seriouseats.com/recipes/2010/12/snout-and-split-pea-soup.html", "description": "A pig snout, a pound of dried split green peas, and a pot of water practically make themselves into soup on a cold winter's night.", "totalTime": "2 hours", "recipeYield": "8, as an appetizer", "recipeCategory": ["Pork", "Soups and Stews", "The Nasty Bits"], "recipeIngredient": ["One pig's snout, halved lengthwise down the middle ", "3 tablespoons olive oil", "1 onion, thinly sliced", "2 cloves crushed garlic", "¼ teaspoon dried thyme", "1 tablespoon tomato paste", "1 teaspoon salt", "1 pound dried green split peas", "1 to 2 tablespoons olive oil or lard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 4 quart saucepan over medium heat. Add olive oil and snout halves to pot. Let skin and meat brown, turning once or twice, about 5 minutes total. Add garlic and onions to pot and cook, stirring frequently until lightly browned, about 3-5 minutes. Add tomato paste and cook, stirring frequently for 1 minute. Add thyme, salt, and enough water to cover pieces of snout completely. Bring water to boil, then reduce to steady simmer and cook for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add green split peas to pot and simmer until split peas are tender, about 45 minutes. Remove the halves of snout from the pot. Puree soup with immersion blender, blender, or food processor to desired consistency. Taste soup and add additional salt if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blot residual liquid from snout. Slice off as many sections of snout as you need for garnish, into slices about 1/4 thick. Heat skillet over medium heat.  Add one tablespoon olive oil or lard to skillet.  Pan-fry slices of snout for 40 seconds to 1 minute per side. Remove from skillet and blot dry. Garnish soup with fried snout slices and serve immediately.  </p>"}]}