{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100623-dt-pasta-with-sausage-broccoli-and-caramelized-garlic.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["broccoli", "Dinner Tonight", "pastas", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Orecchiette with Sausage, Broccoli, and Caramelized Garlic", "link": "https://www.seriouseats.com/recipes/2010/06/dinner-tonight-orecchiette-with-sausage-broccoli-and-caramelized-garlic-recipe.html", "description": "Rather than using bitterness as a way to balance the dish (like in the classic recipe for sausage and broccoli rabe) this recipe adds sweetness in the form of sun-dried tomatoes and acidity with a shot of lemon juice. Three or four cloves of garlic are also sliced and gently cooked in the fat from the sausage, a simple step that adds another dimension of flavor.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Broccoli", "Dinner Tonight", "Pasta"], "recipeIngredient": ["12 ounces broccoli florets (from about 2 average-sized bunches), cut into bite-sized pieces", "4 tablespoon olive oil", "3/4 pound sweet Italian sausage, casings removed", "3/4 pound orecchiette pasta, or substitute another short pasta such as penne", "4 cloves garlic, peeled and sliced", "Salt to taste", "8 oil-packed sun-dried tomatoes, sliced", "1 tablespoon fresh thyme leaves, roughly chopped", "Juice of 1/2 a lemon", "1/4 cup Parmesan cheese", "3 scallions, both white and light green parts, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salty water to boil and prepare a bowl of ice water.  Drop the broccoli into boiling water and cook until tender but still slightly firm, 2-3 minutes. Transfer the broccoli with a slotted spoon to the ice bath to cool quickly. Stir until cool, then drain the water. Return the water to a boil and cook the pasta until al dente, reserving 1 cup of the pasta cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat half the olive oil in a large skillet over medium heat and add the sausage. Break up into bite-sized pieces (but not until crumbly) and cook until golden brown and cooked through. Remove to a plate, leaving the fat in the pan. Add the garlic slices and remaining oil, if necessary depending on how much fat the sausages gave, and cook over low heat until golden. Add the broccoli and toss, then add the sausage, sun-dried tomatoes, and thyme. Increase the heat to medium and cook until heated through.</p>"}]}