{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20101004radicchioglaze.jpg", "author": {"@type": "Person", "name": "Maggie Hoffman"}, "recipeCuisine": "Italian", "keywords": ["Andrew Carmellini", "fall", "Italian", "radicchio", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andrew Carmellini's Risotto Rosso with Red Wine, Radicchio, and Smoked Mozzarella", "link": "https://www.seriouseats.com/recipes/2010/10/andrew-carmellinis-risotto-rosso-with-red-wine-radicchio.html", "description": "[Photographs: Maggie Hoffman] This risotto is easy to make but sophisticated in flavor, with rich tannins and complexity from wine and port, a smoky note from smoked mozzarella, and a touch of bitterness from wine-glazed radicchio. Note: Port can be...", "totalTime": "", "recipeYield": "4-6,", "recipeCategory": ["Italian", "Rice"], "recipeIngredient": ["1 large head radicchio, outer leaves removed, split in half and cored", "1/4 cup extra virgin olive oil, divided", "1 medium clove garlic, lightly smashed under flat of knife blade", "1/2 cup port (see note)", "Kosher salt and freshly ground black pepper", "5 cups homemade chicken broth or low-sodium canned broth", "1 small onion, finely chopped (about 1/2 cup)", "2 cups Arborio rice", "1 cup dry red wine", "1 tablespoon fresh thyme leaves", "1/4 pound smoked mozzarella, cut into 1/4-inch dice (about 3/4 cup)", "1-ounce grated Parmigiano-Reggiano or Piave (about 1/4 cup) plus more for serving", "1 tablespoon butter", "1/4 cup flat leaf parsley, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each half of radicchio into thirds lengthwise, then cut each segment in half crosswise. Heat 2 tablespoons olive oil in 12-inch heavy-bottomed skillet over medium-high heat until shimmering. Add garlic and radicchio. Season with salt and pepper and cook, stirring frequently, until radicchio has begun to wilt, about 1 minute. Add port, stir to combine and cook, stirring occasionally, until the port has evaporated and the radicchio pieces are soft but retain a little bit of texture and bounce, 8 to 10 minutes. Remove from heat and set aside. Discard garlic clove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring stock to a simmer in a medium saucepan. Heat remaining 2 tablespoons oil in a large saucepan or Dutch oven over high heat until shimmering. Add the onions and sauté until translucent, about 1 minute. Add rice and mix with wooden spoon until well-coated in olive oil. Continue to cook until lightly toasted, about 1 1/2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one cup of wine. Cook, stirring constantly, until wine is mostly absorbed, 1-2 minutes. Add half of stock. Cook, stirring frequently, until stock is mostly absorbed, about 7 minutes. Add remaining stock and cook, stirring frequently, until rice is just tender and bound in a creamy, stew-like sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the radicchio and thyme. Cook for one minute, stirring constantly, then remove from heat. Season to taste with salt and pepper. Add half of smoked mozzarella, the Parmigiano, and butter, and stir well. Fold in parsley and serve immediately, topping each serving with more Parmigiano and smoked mozzarella.</p>"}]}