{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100917-buckeyes-610.jpg", "author": {"@type": "Person", "name": "Liz Gutman"}, "recipeCuisine": "", "keywords": ["buckeyes", "candies", "chocolate", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.5", "ratingCount": "2"}, "name": "Peanut Butter-Chocolate Buckeyes", "link": "https://www.seriouseats.com/recipes/2010/09/peanut-butter-chocolate-buckeyes.html", "description": "All for me. [Flickr: CH®iS] This recipe is easiest if the peanut butter and butter are room-temperature; you can zap them in the microwave in 15-second increments to soften them up, if you get impatient. Make sure you have a...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts", "Nuts"], "recipeIngredient": ["1 1/2 cups salted butter, at room temperature", "3 cups unsweetened peanut butter", "6 cups confectioner's sugar", "1 tablespoon fleur de sel or Maldon sea salt (optional, to taste)", "4 cups chopped dark chocolate or semisweet chocolate chips, for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the butter and peanut butter in the bowl of a stand mixer fitted with the paddle attachment, cream on medium speed until well combined and fluffy, about 4 minutes (You can do this by hand by stirring vigorously with a spatula until fluffy)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the mixer to medium low. With the mixer running, add the confectioner's sugar 2 cups at a time waiting until each addition is incorporated before adding the next.  Add the salt and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the mixture has come together, transfer bowl to freezer until mixture is chilled and firm, about 10 minutes.  Roll tablespoon-sized lumps into 1-1/2\" balls and place on a baking sheet lined with waxed paper or parchment, refreezing mixture as needed if it begins to melt. Inser a toothpick into the top of each ball and place baking sheet in freezer until buckeyes are firm, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the peanut butter balls are chilling, melt the chocolate in a bowl placed on top of a saucepan filled with simmering water, stirring occasionally; or in the microwave in 15-second intervals, stirring and scraping down sides with rubber spatula between each zap until the chocolate is melted (be careful not to burn). Allow to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chilled peanut butter balls from freezer and dip in chocolate using the toothpicks, leaving a circle of exposed peanut butter on top.  Place back on wax paper to set.  Once they're all dipped, remove the toothpicks and smooth out the toothpick hole with a finger (alternatively, put a crystal or flake of fancy sea salt on top to hide it.)</p>"}]}