{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100105-posole.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "Dinner Tonight", "hominy", "Mexican", "posole", "poultry", "soups", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Red Posole Stew with Chicken", "link": "https://www.seriouseats.com/recipes/2010/01/red-posole-stew-with-chicken-hominy-recipe.html", "description": "Not the posole in question, but probably good, too. [Photograph: evelynishere on Flickr] For some reason, posole was the New Year's dish of 2010. I read about it no less than three times&mdash;in the San Francisco Chronicle, in TimeOut Chicago,...", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains", "Mexican", "Soups and Stews"], "recipeIngredient": ["<strong>For the chile purée: </strong>", "2 large dried Mexican chiles, preferably anchos or guajillos, stems and seeds removed", "1 clove garlic, peeled", "1/2 white onion, halved through the core and peeled", "1 cup boiling water", "<strong>For the posole: </strong>", "1 1/2 pounds bone-in chicken drumsticks", "1 can (29-ounce) hominy, drained", "4 cups chicken broth or pork stock", "2 cups water", "1 to 2 teaspoons kosher salt, or to taste (see Note)", "<strong>To serve:</strong>", "Thinly sliced green cabbage, radish, or chopped onion", "Lime wedges", "Dried oregano, preferably Mexican, to sprinkle on top", "Warm tortillas or tortilla chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium stockpot, combine the chicken, hominy, broth, and water. Bring to a boil and simmer gently until the chicken is just cooked through. Remove the chicken pieces to cool on a plate, then separate the meat from the bones, skin, and cartilage. Roughly chop the meat and discard the rest. Keep the chicken moist in a small bowl with some of the hot broth poured over it.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat a griddle or cast-iron pan with no oil over medium-low heat and add the dried chiles, garlic clove, and onion. Cook, turning occassionally, until soft and browned. Take care not to burn the chile. Transfer to a bowl and cover with the boiling water to reconstitute the chiles, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chile mixture and soaking water to a blender, puree, and add to the soup (do this little-by-little to control the spiciness). Simmer everything together for at least 20 minutes. When the flavor is developed, add the chicken meat to the soup and simmer for an additional couple minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with the cabbage, radish, or onion. Offer the oregano to sprinkle on top, and serve with lime wedges and tortillas.</p>"}]}