{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100104ChickenCitrusSauce.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["chicken", "citrus", "healthy", "healthy and delicious"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Healthy &amp; Delicious: Chicken with Citrus Sauce", "link": "https://www.seriouseats.com/recipes/2010/01/healthy-delicious-chicken-with-citrus-sauce-recipe.html", "description": "Editor's note: On Mondays, Kristen Swensson of Cheap, Healthy, Good swings by these parts to share healthy and delicious recipes with us. Take it away, Kristen! [Photograph: bluewaikiki.com on Flickr] I'm not necessarily one for New Years resolutions, but I...", "totalTime": null, "recipeYield": "3", "recipeCategory": ["Chicken", "Healthy and Delicious"], "recipeIngredient": ["1 navel orange", "1 lime", "1 pound boneless, skinless chicken breast, sliced into ½-inch fillets", "2 teaspoons vegetable oil ", "1/2 small onion, chopped", "1 small garlic clove, chopped ", "1 thyme sprig", "1/2 cup dry white wine", "1-1/2 cups low-fat, low-sodium chicken broth", "1/2 tablespoon extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "1 teaspoon unsalted butter."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and dry the fruit. Grate 1/2 teaspoon zest from each. Then, using a pairing knife, peel both pieces of fruit so no white pith is left. Section them. Squeeze the juice from each husk into a bowl and set aside. (There should be a little less than 1/4 cup of juice.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat vegetable oil over medium heat. Add onion, garlic, and thyme and cook for about 5 minutes, until onion is translucent and a little soft. Pour in white wine and cook until half of it has evaporated. Add chicken broth and citrus zest. Cook for 10 minutes, or until about half of it is left. Add reserved orange and lime juices and simmer for another 10 minutes. Strain everything into a small saucepan (removing the solids) and boil 2 or 3 minutes, or until there is a 1/2 cup sauce left. Remove from heat and set aside. Wipe out the large skillet with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same skillet, heat the olive oil over medium-high heat. Salt and pepper the chicken fillets, then place them in the skillet. Cook for about 4 minutes on each side, until no longer pink in the middle. Set aside to rest. Pour off any remaining fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reduced sauce back into the skillet, scraping up browned bits of chicken as you go. Cook about 1 or 2 minutes. Add sectioned fruit and warm through, another 1 or 2 minutes. Remove pan from heat. Carefully stir in butter and season with salt and pepper. Pour mixture over chicken and serve with rice. Do not let the extra sauce go to waste.</p>"}]}