{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100831spicysmores.jpg", "author": {"@type": "Person", "name": "Andrea Lynn"}, "recipeCuisine": "", "keywords": ["chile powder", "chiles", "chocolate", "desserts", "s'mores", "Serious Heat", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spicy S'mores", "link": "https://www.seriouseats.com/recipes/2010/09/spicy-chocolate-smores.html", "description": "If you haven't ever heightened your chocolate with a tiny blast of chile powder, then let me convince you why you should. You don't want to overdo the chile flavor&mdash;just use a touch of spiciness to bring out the rich chocolaty flavor. The sweetness of the chocolate floods the mouth at the start with just a splash of heat coming right at the end, like in this <strong>Spicy S'mores recipe,</strong> where a blast of cayenne transforms the chocolaty camp treat into a gooey, spicy bit of heaven.", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Desserts"], "recipeIngredient": ["1 (12-ounce) bag semi-sweet chocolate morsels", "1 teaspoon cayenne powder", "2 tablespoons heavy cream", "16 graham crackers squares", "Kosher salt, as needed", "Jumbo marshmallows"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a small saucepot halfway with water, and bring to a boil over medium-high heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Create a double boiler by placing a metal bowl that will fit over the saucepot without touching the water, and add 2⁄3 of the chocolate morsels to the bowl. Using a wooden spoon, stir the melting chocolate until it reaches a smooth consistency, just a couple minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the double boiler setup, and add remaining chocolate morsels, cream and cayenne powder to the melted chocolate. Stir with the wooden spoon to combine. Taste, and add more cayenne powder, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover a baking sheet with a two layers of waxed or parchment paper. Working quickly, dip one side of the graham cracker square into the melted chocolate, using a small spatula or knife to smooth out the chocolate on the cracker, if necessary. Repeat with remaining graham crackers. Sprinkle sea salt on top of the chocolate-covered graham crackers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the baking sheet into the freezer, and let the chocolate harden for 1 hour. When the chocolate on the graham crackers has hardened, wrap them individually in waxed or parchment paper and place in a Ziploc bag. Store the graham crackers in the refrigerator until ready to use.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to make the s’mores, preheat the broiler. On a foil-lined baking sheet, add marshmallows, and place under the broiler. Cook until marshmallows are toasted, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the toasted marshmallow onto the chocolate-covered graham cracker, and serve.</p>"}]}