{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20101019%20croissant%20dough.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "croissants", "pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Bread Baking: Easy(er) Croissants", "link": "https://www.seriouseats.com/recipes/2010/10/bread-baking-easy-croissants-recipe.html", "description": "There may not be such a thing as croissants that are truly <em>easy</em> to make, but I guarantee these are easier than any of the more traditional recipes. This dough recipe is a cross between pie dough, sweet flaky pastry dough, and traditional croissant dough, and easy enough to make just about any time you want it.", "totalTime": "", "recipeYield": "16", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch", "Breakfast Sweets", "Pastry"], "recipeIngredient": ["2 1/2 teaspoons instant yeast", " 1/2 cup lukewarm water", "1 tablespoon sugar", "1/2 cup cold milk", "1 large egg", "11 1/4 ounces (2 1/4 cups) all purpose flour", "1 teaspoon salt", "1 stick salted butter, frozen", "1 stick unsalted butter, frozen", "Optional: Chocolate or other filling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the butter out of the freezer and let it sit at room temperature while you work. You want it as cold as possible, but still able to be cut. Put the yeast, water and sugar into a medium bowl and stir to combine. Set aside until it begins to get foamy, about 5 minutes. Add the milk and egg, and beat lightly to break up the egg and combine it all.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour and salt into your food processor, and pulse to distribute the salt. Cut each stick of butter into tablespoon-sized pieces, then cut each of those pieces in half. Put all of the pieces into the food processor with the flour and pulse about 10 times to distribute the butter and break the chunks just a little. You don't want small pieces as you would for pie crust; larger chunks are preferable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour and butter to the liquid in the bowl, and fold gently with a spatula until all the flour is moistened and it is well combined, being careful not to break up the butter. The butter should still be fairly hard at this point. The dough will be very wet; don't worry about it. Cover the bowl and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The mixture can be used the next day, or kept refrigerated for an additional day if you aren't ready for it. When you are ready, flour your work surface generously, and have more flour standing ready. Turn the dough out onto your work surface, sprinkle some additional flour over the top, and form it into a rough square. Working quickly, roll the dough out to an approximate 16-inch square. Because it's so wet, it should roll easily, but it might be a bit sticky. Add flour as needed on top and underneath to keep it from sticking. Fold the dough in thirds, like a letter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Then fold it in thirds again, to make a square. Do the same roll-and-fold two more times. As you work, keep the work surface lightly floured, just to keep it from sticking. Since the dough is so soft, you should be able to do this fast enough that the butter won't get too soft and squishy. If you get delayed and the butter does soften, put it in the fridge and continue once the butter has firmed up again. After the last fold, flatten it a bit, then put it into a plastic bag and put it into the refrigerator for at least an hour, or up to three days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to make the croissants, preheat the oven to 400 degrees and line a baking sheet with parchment paper. The dough will have risen while refrigerated. Cut the dough into quarters.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the first quarter into about a 6-inch square. Cut the square into quarters diagonally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take one of your right triangles of dough and roll or stretch it into a pie-shaped wedge at least seven inches long. You can make it longer if the dough is thick enough to allow it, but at least seven inches will give you enough length to have attractive wraps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting at the wide end, roll the dough toward the the point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the finished croissants on the prepared baking sheet with the point underneath. Curl the dough into a crescent shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover them with plastic wrap and set aside for 30 minutes. They won't rise much at all, but they should feel puffy instead of firm. Brush the croissants with an egg wash, if desired, or leave them plain. Bake at 400 degrees for 20 minutes, until they are golden brown. Remove to a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Variation: For chocolate croissants, follow the original recipe though Step 6, then roll the quarter of dough into a rectangle about 10 x 6 inches. Cut that into strips about 2 1/2 inches wide x 6 inches long.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put your favorite chocolate at one end, and roll up. It works best to make sure the dough is just a little wider than the chocolate and fold it over to enclose the chocolate when you start rolling, so it doesn't seep out during baking. Place the rolls seam-side down on the pan and allow them to rise and bake as in the original recipe.</p>"}]}