{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100706-dt-tagliatelle-with-spinach-peas-and-pesto.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "pasta", "peas", "pesto", "salmon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pasta with Salmon, Peas, and Pesto", "link": "https://www.seriouseats.com/recipes/2010/07/dinner-tonight-pasta-with-salmon-peas-and-pes.html", "description": "As much as I love the simplicity of homemade pesto with al dente pasta, I found myself with a piece of wild salmon and fresh peas the other day and set out to make it into dinner.  While cream would be an obvious choice for saucing the pasta, I turned to yogurt instead, building off this <a href=\"http://www.seriouseats.com/recipes/2009/05/dinner-tonight-salmon-and-pea-tagliatelle-recipe.html\">previous Dinner Tonight recipe</a>.  Turns out the addition of pesto into the yogurt&mdash;which is thinned with a little vegetable stock and clings to the pasta beautifully&mdash;is an unexpected but wonderful twist.  It adds a lovely tang and makes the dish just that much richer than pesto alone.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Legumes", "Pesto", "Salmon"], "recipeIngredient": ["1 pound dried tagliatelle, or 1.5 pounds fresh", "1 pound salmon fillet", "1 tablespoon olive oil", "1 cup vegetable stock", "4 tablespoon pesto", "1/2 pound frozen or fresh peas", "1/2 cup plain yogurt", "3 tablespoons chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of salty water to boil. Cook the pasta until al dente if dried, tender if fresh.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a second skillet or small pot, bring the stock to a boil and add the peas. Cook until the peas are tender, longer if fresh.  Stir in the pesto and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat a large skillet over medium-high heat. Add the olive oil, then cook the salmon skin-side up until 3/4 cooked through. Flip and finish cooking. The skin should remove easily from the fish. Discard the skin and flake the salmon gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta and return to its cooking pot. Add the yogurt along with the pea and pesto mixture and the chopped parsley. Toss well to combine, then stir in the salmon chunks. Divide into bowls and serve immediately with fresh black pepper.</p>"}]}