{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100113-indoor-beer-braised-ribs.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["grill", "grilling", "indoor grilling", "pork", "rib", "ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Indoor Grilling: Beer-Braised Ribs", "link": "https://www.seriouseats.com/recipes/2010/01/indoor-beer-braised-ribs-recipe.html", "description": "\"These ribs were tender with a richness of flavors from the beer, cinnamon, ginger, garlic, and chilies in the braise.\" [Photograph: Joshua Bousel] Although grilling is most definitely a year-round practice in my household, when the cold and dark arrive,...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Grilling", "Pork"], "recipeIngredient": ["1 rack pork loin back ribs, around 3 pounds", "Salt and freshly ground black pepper to taste", "2 tablespoons vegetable oil", "10 allspice berries", "2 or 3 3-inch cinnamon sticks", "10 nickel-sized slices unpeeled fresh ginger or 1 tablespoon ground ginger", "5 dried red chilies or a teaspoon of cayenne", "5 cloves garlic, lightly smashed", "1 bottle dark beer, like Guinness or any porter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F. Remove the membrane from the bottom side of the ribs and split the rack into two. Season liberally with salt and pepper. Put oil in a large, deep ovenproof skillet or casserole that can later be covered. Turn heat to medium-high and, when oil shimmers, sear meat on both sides until nicely browned, turning as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add allspice, cinnamon, ginger, chilies and garlic and stir; add beer. Bring to a boil; cover pan and adjust heat so mixture simmers steadily. Put in oven and cook until meat is tender, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat broiler. Drain meat and sprinkle it with salt and pepper. Broil on both sides until brown and crisp, about 1 to 2 minutes. Meanwhile, skim cooking liquid of fat, bring to a boil, and use as sauce. </p>"}]}