{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/030510-dt-bayscallopsoup2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Dinner Tonight: Bay Scallops", "link": "https://www.seriouseats.com/recipes/2010/03/bay-scallops-dinner-recipe.html", "description": "I have a serious soft spot for scallops. I love the way the taste and how they look after being quickly seared over high heat. About the only thing I don't like is the price&mdash;but that's where <strong>bay scallops</strong> come in. They're smaller than traditional scallops, yet still have that amazing <strong>sweet and succulent</strong> taste.", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Other Seafood"], "recipeIngredient": ["2 tablespoon olive oil", "2 garlic cloves, minced", "1/2 cup white wine", "2 cups chicken broth", "Juice of 1 lime", "1/2 cup cilantro, chopped", "1 pound sea scallops", "Salt and pepper", "4 ounces spaghetti (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour 1 tablespoon of the olive oil into a saucepan set over medium heat. Add the garlic and cook for about 30 seconds, until fragrant. Pour in the white wine. Cook for a couple minutes, until it has slightly reduced. Then pour in the chicken broth, and add the lime juice and cilantro. Reduce heat to a simmer and let cook while you cook the scallops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rest of the olive oil into a medium sized bowl. Add the bay scallops and a pinch of salt and pepper. Toss until evenly coated. Set a large skillet over high heat. When just beginning to smoke, add the scallops. Stir constantly to keep the scallops from sticking. Cook for about 2 minutes, or until the scallops have a lightly browned exterior. Divide the scallops between two bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle some of the broth over the scallops in the two bowls. Add some of the cooked pasta to the bowl (is using). Serve. </p>"}]}