{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101012_trigonaSMALL.jpg", "author": {"@type": "Person", "name": "Andrea Lynn"}, "recipeCuisine": "", "keywords": ["beef", "confit", "crockpot", "greek", "mole", "phyllo dough", "Serious Heat", "trigonas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Heat: Trigonas with Confit Beef and Mole Sauce", "link": "https://www.seriouseats.com/recipes/2010/10/trigonas-with-confit-beef-and-mole-sauce.html", "description": "...", "totalTime": null, "recipeYield": "75 trigonas", "recipeCategory": ["Beef", "Serious Heat"], "recipeIngredient": ["<strong>For the Beef Confit:</strong>", "2 teaspoons ground cinnamon ", "3/4 teaspoon allspice", "3/4 teaspoon ground cloves", "1/4 teaspoon ground nutmeg", "2 teaspoons ground black pepper", "2 cloves garlic, minced", "2 teaspoons dried oregano", "1/2  teaspoon dry mustard", "1 1/2 teaspoons paprika ", "1 tablespoon kosher salt ", "2 pounds beef chuck, cut into 1 ½-inch cubes ", "2 cups pork lard or other rendered animal fat (olive oil can be used in a pinch)", "<strong>For the Mole Sauce:</strong> ", "1 tablespoon olive oil ", "1 onion, chopped ", "5 medium cloves garlic, minced (about 5 teaspoons)", "2 tablespoons chili powder", "1 teaspoon ground cumin ", "1/2 teaspoon ground cinnamon ", "1/4 teaspoon ground cloves ", "1 (28-ounce) can diced tomatoes, drained", "3 ounces coconut milk ", "1 red bell pepper, chopped ", "2 chipotle chiles, chopped ", "10 ounces homemade chicken broth (or low-sodium canned broth)", "2 tablespoons peanut butter ", "4 ounces bittersweet chocolate", "<strong> For the Trigona</strong>", "1 (1-pound) box of phyllo dough, unrolled to sheets 12 inches by 17 inches", "1 pound of butter, melted ", "Sour cream, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Beef Confit: In a large bowl, add cinnamon, allspice, cloves, nutmeg, pepper, garlic, oregano, mustard, paprika and salt. Mix to combine. Add the beef pieces, and toss in the spice mixture so all pieces are well-covered. In a slow cooker, add beef and lard. Warm over the high heat setting until lard melts. Turn down heat to low and cook overnight. Let the beef and fat cool. Use a spoon to transfer mixture to a heat-safe container. Reserve beef in the fridge for up to three days in advance.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Mole Sauce: In a large pot, warm oil over medium heat. Add onion and sauté until translucent, about 4 minutes. Add garlic and spices to pot, and sauté until fragrant, about 1 minute. Add the diced tomatoes, coconut milk, bell pepper, chipotles, broth, peanut butter, and chocolate, letting it all melt together and become thick. Reduce heat to low, and let mixture simmer 10 minutes. Remove from heat, and transfer mole sauce to a blender. Purée until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Trigona Filling: In a large shallow saucepan, cook beef and fat over medium-high heat, stirring constantly, until the beef is fall-apart tender and shreds while stirring, about 15 minutes. Set up a metal colander over a large bowl. Transfer meat to colander, letting excess fat drip into the bowl. Reserve fat if desired for another use. In a large bowl, mix the shredded beef with enough mole sauce to make the mixture moist, reserving any remaining mole sauce for a different use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Trigona: Unroll the phyllo dough on a flat surface, keeping it in a stack. With a sharp knife, cut the stack of sheets into six strips, the long way to yield six strips that measure 2 inches by 17 inches. Keep phyllo covered with plastic or a damp dish towel when not using. With a pastry brush, brush melted butter over the layer of phyllo you'll be working with. Put one teaspoon of filling at the bottom of 1 phyllo strip. Fold the lower right-hand corner up and to the left, so that the former bottom of the strip is now even with the left-hand side, making a little triangular pouch at the bottom of the strip.  Fold that pouch up.  Now fold that pocket back over to the right again, and continue that manner of back-and-forth folding all the way up the strip to form a triangular pouch Repeat until you’ve made desired amount of trigona. Store trigona in fridge until ready to bake or freeze indefinitely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°. Place trigona pieces onto a sheet pan, and bake until golden in color, about 30 minutes, turning halfway through cooking process. Serve each trigona with a tiny dollop of sour cream. </p>"}]}