{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100805TomatoTarragonSoup610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French in a Flash", "soups", "tomatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French in a Flash: Cold Tomato and Tarragon Soup", "link": "https://www.seriouseats.com/recipes/2010/08/french-in-a-flash-cold-tomato-and-tarragon-soup-recipe.html", "description": "We, proud Americans, know that peanut butter belongs with jelly. A perfect pair. A dynamic duo. But in France, tomato and tarragon are an incontestable couple. I have featured the two together before, in an adaptation of the <a href=\"http://www.seriouseats.com/recipes/2009/09/french-in-a-flash-tarragon-chicken-recipe.html\">tomato and tarragon chicken</a> I learned in Paris. But summertime screams for the naturally gifted ingredients to strut their stuff raw and unadulterated.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["French", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["2 1/2 pounds vine tomatoes, seeded and in chunks", "1 Vidalia onion, in chunks", "1 red bell pepper, seeded and in chunks", "2 cloves garlic", "3 tablespoons fresh tarragon leaves (from approximately 2 large stems), plus more for garnish", "2 cups tomato juice", "1/2 cup extra virgin olive oil, plus more for garnish", "3 tablespoons red wine vinegar", "2 teaspoons sugar", "Salt and freshly cracked black pepper to taste", "1/2 cup baguette crumbs, or fresh bread crumbs", "4 ounces crumbled fresh goat cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large blender, place all the ingredients EXCEPT the bread crumbs and the goat cheese. Blend everything together until almost completely smooth.  Taste, and season well with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the breadcrumbs to the blender, and just whiz to incorporate. To make baguette crumbs, take the stale butts of old baguettes and smash them in a food processor. I always keep a baggie of these in my freezer, but any fresh bread crumbs will do. Just avoid heavily flavored breads like rye.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decant the soup into a pitcher or punch bowl, and cover and refrigerate until ready to serve. Serve in mugs or bowls with some crumbles of fresh goat cheese and whole tarragon leaves, and a drizzle of extra virgin olive oil.</p>"}]}