{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100726_cornsquashtacos2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["chiles", "corn", "Dinner Tonight", "Mexican", "squash", "taco", "tacos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Calabazas Horneadas (Baked Squash, Chiles, and Corn Tacos)", "link": "https://www.seriouseats.com/recipes/2010/07/calabazas-horneadas-baked-squash-chiles-corn-tacos-recipe.html", "description": "This recipe immediately caught my eye because it showed what I love about Mexican cuisine so much: it's <strong>highly seasoned, slightly spicy, and somehow meaty,</strong> even though there is no meat in sight. The squash act as the base, with the corn adding some sweetness. The poblanos adds some spiciness to be sure, but they also infuse the mixture with this smokey aroma.", "totalTime": null, "recipeYield": "3 to 4", "recipeCategory": ["Corn", "Dinner Tonight", "Mexican", "Squash"], "recipeIngredient": ["3 ears fresh corn on the cob", "2 fresh poblano chiles", "1 large white onion, thinly sliced", "1 tablespoon butter", "1/2 pound squash, cut into 1-inch wedges", "6 garlic cloves, minced", "1 sprig epazote, leaves only, finely chopped", "1/2 cup Mexican crema, creme fraiche, or sour cream", "Salt and black pepper", "1/4 pound Mexican cheese, grated (chihuahua or even queso fresco)", "Fresh corn tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Meanwhile, cut off the corn kernels from the cobs. Break the cobs in half, and then place in a saucepan with 2 cups of water. Bring to a boil, and then reduce heat to medium. Cook for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, blacken the skins of the poblanos by placing them on top of a burner on the stove. Cook them until they are charred all over, turning often, and then transfer to a plastic bag. Let them hang out for at least 10 minutes. Then peel off their skin, remove the stems and seeds, and then cut into 1/4 inch thick strips.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large iron skillet, melt the butter over medium heat. Then add the onions. Cook until transparent, about 5 minutes or so. Then add the corn kernels, squash wedges, and garlic. Cook for about 10 minutes, stirring often. Add the poblano strips and cook for an additional 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the liquid away from the corn cobs. Pour 1/2 cup of the liquid into the pot with the squash and poblanos, along with the epazote. Cook for 5 minutes. Turn off the heat, and add the crema. Season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the cheese on top. Transfer the skillet to the oven and bake for 15 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with corn tortillas. </p>"}]}