{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100712johnferrellscornbread.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cornbread", "John Ferrell", "Mary Mac's Tea Room"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: John Ferrell's Cornbread", "link": "https://www.seriouseats.com/recipes/2010/07/mary-macs-tea-room-southern-cornbread-recipe.html", "description": "When I heard that all newcomers to <a href=\"http://www.marymacs.com/\">Mary Mac's Tea Room</a> are greeted with a piece of cornbread and a small bowl of pot likker (the liquid left behind after boiling greens) I was anxious to see just what type of cornbread it would be.  While most recipes have fairly similar ingredients, the proportions vary as do the textures and flavors.  In <strong>John Ferrell's Cornbread</strong>, he includes buttermilk for moisture and tang, self-rising flour for a wonderfully airy texture, and a quarter cup of bacon drippings.", "totalTime": "", "recipeYield": "8 to 10", "recipeCategory": ["Cook the Book", "Cornbread"], "recipeIngredient": ["1/4 cup corn oil or bacon drippings plus 2 tablespoons for the skillet ", "1 1/2 cups white cornmeal plus 1 tablespoon for the skillet ", "1/4 cup self-rising flour ", "1 tablespoon sugar ", "1 teaspoon salt ", "1 1/2 teaspoons baking powder ", "1/2 teaspoon baking soda ", "1 cup buttermilk ", "1 large egg  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450˚F. Grease a 10-inch cast-iron skillet with 2 tablespoons corn oil or bacon drippings and place it in the oven for 6 to 8 minutes, until very hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the 1 1/2 cups white cornmeal, the flour, sugar, salt, baking powder, and baking soda in a large bowl. Mix together the buttermilk, the remaining 1/4 cup oil or drippings, and egg in a small bowl. While the skillet is in the oven, stir the wet ingredients into the dry until just combined. Do not overstir. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the hot skillet from the oven and sprinkle the 1 tablespoon cornmeal evenly over the bottom. This prevents the cornbread from sticking. Immediately pour the batter into the skillet and return to the oven. Bake for 18 to 20 minutes, or until browning on the edges. Serve hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Variation:</strong> Alternatively, the batter can be poured into a well-greased muffin tin to make about a dozen cornbread muffins..</small></p>"}]}