{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100226-ctb-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "beef cheeks", "Cathy Erway", "Cook the Book", "pomegranates", "The Art of Eating In"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Pomegranate-Braised Beef Cheeks with Butternut Squash Puree", "link": "https://www.seriouseats.com/recipes/2010/02/pomegranate-braised-beef-cheeks-butternut-squash-puree-recipe.html", "description": "The cheeks are braised for a few hours in red wine and pomegranate juice&mdash;a mix of acidic liquids that reduces and melds with the meaty juices to create a sauce that's sharp enough to cut through the fattiness of the cheeks, but still rich enough to taste special.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Beef", "Braising and Stewing", "Cook the Book", "Pomegranate"], "recipeIngredient": ["Salt and pepper", "1/2 cup flour", "2 to 4 tablespoons vegetable oil", "1 medium onion, chopped", "1 carrot, chopped", "1 celery stalk, chopped", "2 cups Chianti or other dry red wine", "2 cups pomegranate juice", "1 large butternut squash", "1 tablespoon butter", "1/2 cup heavy cream", "Fresh pomegranate seeds for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat beef cheek pieces dry. Season with salt and pepper on all sides and dredge in a light coating of flour. Heat the oil in a large, oven-safe pot or Dutch oven over high heat until oil begins to pop. Shake off excess flour and place beef cheeks in a single layer on the bottom of the pan (working in batches if necessary). Brown on each side until lightly golden. Remove beef cheeks with tongs and set aside in a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325&deg;F. Add the onion, carrot, and celery to the pan (adding additional oil if bottom is very dry), and sweat over low heat until softened, about 6 minutes. Season with salt and pepper and scrape up any browned bits from the bottom of the pan. Return the beef cheeks to the pot, and add the wine and one cup of the pomegranate juice. Bring just to a boil, stirring. Cover, and transfer to the oven to braise for 3 to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, slice the squash in half lengthwise and scoop out the seeds. Generously oil a baking tray and place squash halves cut side down. Roast for about 1 hour while the beef cheeks are braising, or until the tops are soft to the touch and the flesh underneath is tender through. Let cool, and scrape out the flesh from the skins with a spoon. Transfer to a saucepan and add the butter, cream and a couple of pinches of salt while stirring over medium heat. Using a hand blender, process until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pot with the beef cheeks to the stove. Transfer beef to a separate dish carefully with a slotted spoon. Add the remaining cup of pomegranate juice and reduce sauce to about half, depending on how much liquid there is to begin with. Arrange beef cheeks on a plate with a scoop of the squash puree, and top with a ladle or two of the sauce. Garnish with fresh pomegranate seeds.</p>"}]}