{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100222-nastybits-rawgoat1.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["goat", "goat curry", "goat meat", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Guyanese Goat Curry", "link": "https://www.seriouseats.com/recipes/2010/02/the-nasty-bits-guyanese-goat-curry-recipe.html", "description": "<strong>Goat</strong> is not really nasty in any sense of the word, but <strong>it does happen to be underappreciated, underused, and misunderstood.</strong> If you've bleeted about eating goat in the past, this curry recipe will change your mind.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Mains", "The Nasty Bits"], "recipeIngredient": ["2 to 2 1/2 pounds goat meat for stewing", "1 lemon", "2 teaspoons cumin seeds", "1 teaspoon fennel seeds", "1 teaspoon black peppercorns", "2 teaspoons fenugreek", "1 teaspoon mustard seeds", "2 teaspoons coriander seeds", "1/2 teaspoon cloves", "1/2 teaspoon allspice", "2 teaspoons ground turmeric", "1 onion", "a few cloves of garlic", "a few tablespoons of oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the goat meat under cold running water and place in a pot or large bowl.  Squeeze the juice of one lemon into the pot, toss in the lemon rind, and fill the vessel with water so that all the goat meat is covered.  Let sit for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, toast and grind the spices: place all of the spices except the ground turmeric into a heavy skillet.  Over medium heat, toast the spices, moving the seeds around so that the surfaces come into contact evenly with the heat.  The spices will be done when the mustard seeds begin to pop and the cumin seeds are a shade darker, about 2 to 3 minutes.  Immediately remove the pan from the heat and add the turmeric powder to the pan.  Stir around.  Place all of the spices into a spice or coffee grinder and process until finely ground.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor or blender, puree the onions and garlic with just enough water to make a thick paste.  A few tablespoons of water should suffice.  Transfer the paste to a small bowl and add the toasted and ground spices.  Mix thoroughly to make a thick paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium sized pot, add a few tablespoons of oil as well as the spice paste.  Toast the paste in the oil for 30 seconds to a minute, taking care not the burn the mixture.  Then add the goat meat and stir around, cooking the meat for a minute or so in the fragrant oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough water to cover the meat.  Bring the water to boil, then lower the heat and simmer for 2 1/2 or so hours, until the meat is tender.  Towards the end, de-fat the broth by skimming the surface with a broad spoon.  Alternatively, if you are making the recipe in advance, refrigerate the curry and allow the fat to solidify at the top.  Serve with plenty of rice to sop up the goat broth.  </p>"}]}