{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101216-cookie-swap-mice-610.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["animal-shaped cookies", "Cookies", "holiday cookies", "holiday sweets", "holidays", "SE Cookie Swap 2010"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Mice Cookies", "link": "https://www.seriouseats.com/recipes/2010/12/mice-cookies-recipe.html", "description": "Baked for the 2010 Serious Eats Cookie Swap \"This recipe is from Martha Stewart's Holiday Cookies issue. I didn't get the licorice tails (too lazy) and substituted vanilla extract for almond because I prefer vanilla. I made them because they...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["3 cups all-purpose flour ", "1/2 teaspoon salt", "1 cup (2 sticks) unsalted butter, softened ", "3/4 cup sugar ", "1 teaspoon almond extract ", "1 large egg ", "1/4 cup sliced natural almonds ", "4 30-inch black licorice laces, cut into 3 inch lengths (optional) ", "3 ounces semisweet chocolate, coarsely chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk to combine flour and salt in a bowl. In a separate bowl, beat butter with an electric mixer on medium-high speed until creamy, about 2 minutes. Add sugar gradually, beating until mixture is pale and fluffy, about 3 minutes. Beat in extract, then egg. Reduce speed to low, and add one-third flour mixture. Gradually add remaining flour mixture, beating just until blended. Halve dough and shape into disks; wrap each in plastic, and chill 2 hours or up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees. Roll about 1 tablespoon of chilled dough between your palms to form 1 1/4-inch- to 1 1/2-inch-long oval shapes. Slightly elongate one side to form face. Gently pinch bridge of nose to form eye sockets. With a paring knife, make 2 small slits at top of each shape, for placement of ears. Place 2 sliced almonds into slits. Place shapes on parchment-lined baking sheets, spacing 2 inches apart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, rotating sheets halfway through, until cookies are light golden brown on bottom and around edges, and tips of ears are golden brown, about 20 minutes. Transfer sheets to wire racks, and immediately insert a wooden skewer about 1/2 inch into mouse's rounded end. Remove skewer and insert curved length of licorice for tail. It should adhere to the still-warm cookie. Let cookies cool completely on wire racks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt chocolate in a heatproof bowl set over (not in) a pan of simmering water. Turn off heat; keep chocolate warm until ready to use, stirring occasionally. Place melted chocolate in a parchment cone or a resealable plastic bag with a tiny hole cut in one corner. Pipe chocolate in tiny dots to form eyes and nose. Chill until chocolate is set, about 20 minutes. Cookies can be stored in a single layer in an airtight container at room temperature up to 1 week.</p>"}]}