{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-chickenwitholivesandlemon.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "lemon", "mains", "olives", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sautéed Chicken with Olives, Capers, and Roasted Lemons", "link": "https://www.seriouseats.com/recipes/2010/01/dinner-tonight-sauteed-chicken-with-olives-capers-and-roasted-lemons-recipe.html", "description": "[Photograph: Nick Kindelsperger] My wife's New Year's resolution is to learn to eat olives. This should be the last impediment to our life-long happiness. I completely understand that olives are an acquired taste; it's just that it happens that I...", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Chicken", "Dinner Tonight", "Lemon", "Mains", "Olives"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil, plus more for drizzling", "1 lemon, sliced 1/4-inch thick ", "Salt and pepper", "1 5-ounce bag baby spinach", "1 tablespoon bread crumbs", "2 6-ounce skinless, boneless chicken breast halves", "2 tablespoons all-purpose flour", "1/4 cup green olives, pitted and sliced ", "1 tablespoon capers, drained", "1/2 cup chicken stock ", "1 1/2 tablespoons butter, diced", "1 tablespoon parsley, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. Place a piece of parchment paper on a baking sheet, and drizzle some olive oil on top. Toss the lemon slices on in a single layer. Drizzle a bit more olive oil on top of the slices and sprinkle with salt and pepper. Set the baking sheet in the oven and cook for 20 minutes. Remove the pan when the lemons have begun to brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the lemons are roasting, place a large skillet over high heat. Add the spinach in without any oil, and cook, stirring often, until wilted. This should take about 2 minutes. Remove to a colander and let drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the skillet with a paper towel, turn the heat to medium, and add the breadcrumbs. Cook those for about 2 minutes until nicely toasted. Then add the spinach back to the skillet, season with a pinch of salt and pepper, and cook for an additional minute. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two tablespoons of the oil into large a large skillet set over high heat. Dry the chicken breasts and then season with salt and pepper. Dredge them in the flour, shaking off any excess, and then place in the skillet. Cook for about 6 minutes, turning halfway through, until golden brown on both sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss in the olives, capers, and the stock. Cook for about five minutes, or until the sauce has reduced by two-thirds. Place the roasted lemons on top of the chicken, sprinkle with some parsley, and add the diced butter. Cook for a minute until the chicken is properly cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a chicken breast halve on top of some spinach and spoon the sauce on top. Season with salt and pepper to taste. </p>"}]}