{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100406-nasty-bits-beauty.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["baking", "lard", "leaf lard", "pie crusts", "pie dough", "pies", "rendering lard"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: How to Use Leaf Lard in Pastry Doughs", "link": "https://www.seriouseats.com/recipes/2010/04/how-to-use-rendered-leaf-lard-in-pastry-dough-recipe.html", "description": "<strong>Why use lard in pastries?</strong> Butter produces extremely good crusts, yet lard holds two distinct advantages over an all-butter crust. First, lard produces flakier crusts than butter. Even the small amount of water present in butter may cause the dough particles to stick to one another rather than separate into the discrete layers that constitute a flaky pastry. Second, while butter is primarily a saturated fat, lard by percentage is primarily an unsaturated fat. Here, a recipe for lard-and-butter pastry dough.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pork", "The Nasty Bits"], "recipeIngredient": ["3/4 teaspoon salt", "6 tablespoons ice water", "2 1/4 cups all-purpose flour", "1/2 cup unsalted butter, very cold ", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2010/03/how-to-render-leaf-lard-welsh-griddle-cakes-recipe.html\">rendered leaf lard</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour and salt into a bowl.  Add the butter and cut it into the flour with a knife or pastry bench scraper until the butter is in pea-sized pieces.  Add the lard and cut it into the flour until it is in pea-sized pieces as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the water to the bowl, one tablespoon at a time, mixing with a fork until the dough begins to come together in a shaggy mess. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a mat, form it into a rough ball, and divide into two.  Shape each piece into a 1-inch thick disk, wrap tightly in plastic wrap, and refrigerate for at least two hours before using.  The dough may be refrigerated for up to 3 days, or frozen.  (To use the frozen dough, thaw overnight in the refrigerator before using.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>strong>4.</strong> Proceed with the directions of your particular pie or tart recipe.  For general use: place a disk of  dough on a lightly floured surface and roll out to 1/8-thickness, rolling from the center towards the edge.  Lift and rotate the dough every few rolls to prevent the dough from sticking.  Dust with extra flour as needed.  Gently ease the dough into the pie or tart pan(s) and trim the edges to fit the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For recipes that call for unbaked shells, refrigerate until ready to use.  For partially baked shells, chill the shells for half an hour or so, until firm, prior to baking to ensure a flaky crust.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F.  If necessary, line the pie shells with parchment paper and fill with pie weights.  Bake for 20 to 30 minutes, depending on whether you want a partially baked or fully baked shell.</p>"}]}