{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101012-dt-roasted-butternut-squash-and-chicken-soup.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "fall", "poultry", "soup", "soups", "squash", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Dinner Tonight: Roasted Chicken and Butternut Squash Soup", "link": "https://www.seriouseats.com/recipes/2010/10/dinner-tonight-roasted-chicken-and-butternut-squash-soup-recipe.html", "description": "Here's the idea: grab some produce, seasoning, and perhaps some protein, throw it on a sheet tray and roast until golden and tender, then mash it up into a rustic, warming soup. Roasting adds a depth of flavor to this <strong>Roasted Chicken and Butternut Squash Soup</strong> that simmering will never provide, and it also makes for a low-fuss dinner that tastes like it took a lot more effort than it did.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Soups and Stews", "Squash"], "recipeIngredient": ["1 medium butternut squash, peeled and cut into medium dice", "1 medium yellow onion, cut into medium dice", "4 bone-in, skin-on chicken thighs", "2 tablespoons olive oil", "Salt and pepper to taste", "4 cups low-sodium chicken broth", "1/4 teaspoon ground cumin", "1/4 teaspoon ground coriander", "1-2 tablespoons fresh squeezed lemon juice", "Fresh cilanto, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 425°F. Arrange the squash, onion, and chicken on a large baking sheet in a single layer.  Drizzle with the olive oil, salt, and pepper. Toss to coat and roast until the chicken is cooked through and squash is tender, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to a plate to cool enough to handle, then pull the meat from the thighs, discarding the bones and skin. Chop into cubes and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, combine the squash, onions, and chicken broth in a medium pot. Add the cumin and coriander and bring to a simmer. With a potato masher or wooden spoon, mash up the soup (it will still be somewhat chunky), then add the lemon juice. Add the chicken pieces, then season to taste with salt, pepper, and/or lemon juice. Ladle into bowls and top with fresh cilantro as a garnish.</p>"}]}