{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101107simplepotatoleeksoup.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["Crisper Whisperer", "fall recipes", "potato leek soup", "soup", "soups", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Agreeably Simple Potato Leek Soup", "link": "https://www.seriouseats.com/recipes/2010/11/the-crisper-whisperer-potato-leek-soup-recipe.html", "description": "Though Thanksgiving is unimpeachably the best holiday, there are moments in early November when the mere anticipation of post-Thanksgiving fullness can make you full, if not ever-so-slightly comatose. At times like these, even the most devout givers of thanks need a simple, comforting dinner like this appealingly basic Potato Leek Soup.", "totalTime": "40 minutes", "recipeYield": "4", "recipeCategory": ["Crisper Whisperer", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["3 large leeks, white and light green parts only", "2 tablespoons olive oil", "2 tablespoons butter", "4 garlic cloves, roughly chopped", "Kosher salt", "6 medium to large Yukon Gold potatoes", "8 cups low-sodium chicken broth (or homemade vegetable stock or water)", "Freshly ground black pepper, to taste", "Sour cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice leeks in half lengthwise and wash thoroughly. Cut crosswise into 1/4-inch-thick half-moons. Heat olive oil and butter over medium heat in Dutch oven or heavy-bottomed pot. Add leeks and garlic and sprinkle with 1/2 teaspoon salt. Cook, stirring occasionally, until leeks are softened but not browned, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While leeks are cooking, fill large bowl halfway with cold water. Peel potatoes, placing each in bowl of water immediately after peeling to prevent browning. Cut each potato in half lengthwise and slice into 1/2-inch-thick half-moons. Drain potato slices and add to pot along with stock and a few generous grinds of pepper. Raise heat to high and bring soup to a boil. Reduce to a simmer, cover, and cook until potatoes are very soft, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree soup with an immersion blender or in batches in standing blender. Season to taste with salt and pepper and serve with sour cream if desired. Soup reheats well and will keep in refrigerator for up to one week.</p>"}]}