{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101102%20stuffing%20bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "fall recipes", "stuffing", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Stuffing Bread", "link": "https://www.seriouseats.com/recipes/2010/11/bread-baking-stuffing-bread-thanksgiving-baking.html", "description": "My goal for this bread was for it to have <strong>three different uses</strong>. First, it could be the base for a stuffing. Second, because it tastes like Thanksgiving, it would make a great sandwich bread for the day-after turkey sandwiches. And last, the bread would make great croutons for salads.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup warm water", "2 1/4 teaspoons active dry yeast", "1 tablespoon honey", " 3 cups bread flour", "1 egg", "1 teaspoon salt", "1 tablespoon poultry seasoning, such as Penzey's", "1 tablespoon chive-infused olive oil (optional) or olive oil", "Cornmeal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix water, yeast and honey in bowl of food processor and set aside until foamy, about 10 minutes. Add bread flour and egg. Process until dough is smooth and elastic, about 30 seconds. Add salt, poultry seasoning and olive oil, and continue kneading until dough is smooth, silky, and elastic, about 45 seconds longer. Form dough into ball, drizzle with olive oil, and place in clean bowl. Cover bowl with plastic wrap and set aside to rise until doubled, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some cornmeal in bottom of 9x5 loaf pan and preheat the oven to 350°F. Flour work surface lightly and turn dough out. Form into log about 8 inches long and place it into prepared pan, seam-side down. Cover pan with plastic wrap and set aside until doubled, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slash loaf as desired and bake until browned, about 40 minutes. Let loaf cool in pan for about 5 minutes, then remove it from pan and transfer to cooling rack. Allow to cool at least 2 hours before slicing.</p>"}]}