{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20101108-deep-fried-turkey-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["holiday", "thanksgiving", "The Food Lab", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Deep-Fried Whole Buffalo Turkey", "link": "https://www.seriouseats.com/recipes/2010/11/deep-fried-whole-buffalo-turkey-recipe.html", "description": "Frank's RedHot and a side of blue cheese dressing add Buffalo flavors to this deep-fried turkey.", "totalTime": "1 hour", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Christmas", "Deep Frying", "Gluten-Free", "Mains", "Thanksgiving", "Turkey", "Winter"], "recipeIngredient": ["1 turkey, about 12 pounds (5.5kg), giblets removed, patted dry (see note)", "3 to 4 gallons (11 to 15L) peanut oil", "Kosher salt and freshly ground black pepper", "24 ounces Frank's RedHot sauce (3 cups; 720ml)", "12 ounces unsalted butter (3 sticks; 345g)", "1 head celery, rinsed", "3 cups (720ml) store-bought or homemade blue cheese dressing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place turkey on frying rig according to manufacturer's instructions, with legs pointing down. Add to empty frying vessel. Add oil until turkey is barely submerged. Remove turkey, allow excess oil to drip back into pot, and transfer to a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ignite turkey fryer and heat oil to 350&deg;F (177&deg;C). Turn off gas completely and slowly lower turkey into hot oil (process should take at least 1 1/2 minutes). When turkey is fully submerged, reignite turkey fryer and adjust flame to maintain steady 325 to 350&deg;F (163 to 177&deg;C). Fry until an instant-read thermometer inserted into coolest part of breast registers 145&deg;F (63&deg;C), 25 to 27 minutes. Allow excess oil to drip back into pot, transfer turkey to a clean disposable aluminum tray or rimmed baking sheet, season with salt and pepper, and allow to rest at least 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make hot sauce. Heat Frank's and butter in a medium saucepan over medium-high heat, whisking occasionally, until butter is fully melted and sauce is hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After turkey has rested, ladle half of hot sauce evenly over every surface. Transfer to a serving platter. Pour excess sauce from baking sheet back over turkey. Carve turkey and serve immediately with celery, passing extra hot sauce and blue cheese dressing at the table.</p>"}]}