{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/crisp%20burger%20-%2008.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Ultra Crispy Burgers", "link": "https://www.seriouseats.com/recipes/2010/05/ultra-crispy-burgers-recipe.html", "description": "The best burger for a single man or woman. No spouses allowed.", "totalTime": "", "recipeYield": "4 burgers", "recipeCategory": ["Beef", "Burger", "Sandwiches"], "recipeIngredient": ["6 ounces beef sirloin, trimmed of gristle, and cut into 1-inch cubes", "5 ounces beef brisket, trimmed of gristle, and cut into 1-inch cubes", "12 ounces oxtail, fat and meat carefully removed from bone and trimmed of silverskin, bones discarded or reserved for another use (about 5 ounces of combined meat and fat)", "Kosher salt and freshly ground black pepper", "1/2 teaspoon vegetable oil", "4 slices American cheese", "4 soft white burger buns, lightly toasted", "Pickles chips and sliced onions (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place feed shaft, blade, and 1/4-inch die of meat grinder in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece and place in freezer for 10 minutes until meat is firm, but not frozen.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine meat in large bowl and toss to combine. Grind meat directly onto parchment or foil-lined rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Without picking the meat up, divide it into four piles on baking sheet and gently press piles into patties approximately 4-inches wide and 1/2-inch thick. Parries should remain loose and have ragged edges. Season generously with salt and pepper. Using wide spatula, carefully flip patties over (some may fall apart - just push them together again). Season second side with salt and pepper and refrigerate until ready to use (can be stored on sheet tray covered with plastic wrap in refrigerator for up to 1 day).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in heavy-bottomed 8-inch sauté pan over high heat until smoking. Carefully transfer patty to skillet and cook without moving until dark crust forms, about 2 1/2 minutes (open your window, disarm your fire alarm, and be prepared for splatters). Using spatula, carefully flip patty and top with cheese. Continue to cook for one to two minutes longer until desired doneness is reached (patty will be at least medium, but will still remain juicy even until well-done)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place pickles and onions on burger bun bottom if desired. Top with cooked patty, close buns, and eat immediately. Repeat with remaining burgers, discarding all but 1 teaspoon fat from skillet between burgers.</p>"}]}