{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100525steak_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "flank steak", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Meat and Two Veg", "link": "https://www.seriouseats.com/recipes/2010/05/eat-for-eight-bucks-meat-and-two-veg-recipe.html", "description": "A pound of flank steak, a bunch of carrots, a bunch of chard, and a handful of lentils become two meals in the time it takes to make one.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Eat for Eight Bucks", "Mains"], "recipeIngredient": ["1 cup (7 ounces) lentils", "Salt", "1 bunch chard (mine weighed about 12 ounces)", "1 pound carrots", "Olive oil", "Juice of 1 lemon", "Pepper", "2 cloves garlic", "Sherry or red wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the lentils in a pot, pour in water to cover by 3 inches, and bring to a boil. Add a pinch of salt and adjust the heat to hold a not-too-vigorous simmer. Cook until tender, 30-45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the lentils cook, prepare the other vegetables. Slice the ribs out of the chard. Chop the leaves into large bite-size pieces and wash. Wash the ribs. Scrub and peel the carrots. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the carrot salad. Put aside 1 or 2 carrots. Use a box grater or your food processor to grate the rest of the carrots (I find that the box grater produces the nicest texture, but it’s such a pain in the neck). Put 1 1/2 tablespoons olive oil and 1 1/2 tablespoons fresh lemon juice in a bowl large enough to hold the grated carrots, season with salt and pepper, and whisk to emulsify. Toss the grated carrots with this dressing; taste and correct seasoning if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare vegetables for the lentil salad. Cut the remaining carrot or carrots and the chard ribs into small dice, about 1/3 inch. Heat a tablespoon of olive oil in a small skillet or saucepan over medium heat. Add 1 clove of garlic, peeled and smashed, and push it around in the oil for about half a minute, until it is fragrant. Add the diced carrot and chard ribs, reduce the heat to medium low, and cook until tender, 5 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the chard (if you are making the flank steak, now is a good time to broil it). Pour into a medium saucepan enough water just to cover its bottom and turn the heat to medium. When the water starts to steam, start tossing in handfuls of chard, allowing each one to wilt a bit before you add the next. When all the chard is in the pot, cover and cook for about 5 minutes, until the chard is tender but not yet limp. Drain the chard, push out as much liquid as possible with the back of a wooden spoon, and wipe out the pot. Heat a tablespoon of olive oil in the pot and add a peeled, smashed clove of garlic, as for the diced vegetables. When the garlic is fragrant, carefully put the steamed chard into the pot (if it is too wet, it will splatter) and stir until it is coated with oil, just a minute or so. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Check to see if the lentils are done. If they are, drain. You may assemble the lentil salad now or later. Toss the lentils with a tablespoon of vinegar, 2 tablespoons olive oil, and salt and pepper. If you made flank steak, you can add any juices under the resting meat to the lentils as well. Stir in the sautéed carrot and chard dice. The salad is good warm or at room temperature.</p>"}]}