{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Aaron Mattis"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Garlic, Caramelized Leek, and Bacon Pizza", "link": "https://www.seriouseats.com/recipes/2010/06/roasted-garlic-caramelized-leek-bacon-pizza-recipe.html", "description": "...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Mains"], "recipeIngredient": ["1/2 recipe <a href=\"http://www.seriouseats.com/recipes/2010/06/sourdough-pizza-crust-dough-recipe.html\">sourdough pizza crust</a>", "2 heads garlic", "Kosher salt", "Freshly ground black pepper", "Extra virgin olive oil", "4 thick slices smoked bacon", "3 medium leeks or 5 small leeks", "2/3 pound fresh mozzarella", "Parmigiano-Reggiano", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from refrigerator and let sit on counter 2 hours prior to baking to relax gluten and bring to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350°F. Season garlic with kosher salt and pepper and coat with olive oil. Wrap in aluminum foil and bake until soft, about 1 hour. Squeeze each head of garlic through a ricer to remove skins and create a paste, or squeeze out garlic flesh from each clove by pressing with the side of a chef's knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice bacon into lardons and sauté in a small skillet over medium-low heat until crispy, about 15 minutes. While bacon cooks, julienne leeks, discarding dark green tops. Submerge in cool water and swirl to dislodge grit. Drain and dry thoroughly with a salad spinner or paper towels. When most of the bacon fat has rendered, add leeks to skillet. Season lightly with kosher salt and pepper and cook, stirring occasionally, until very soft and sweet, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven on maximum with a pizza stone for 1 hour prior to cooking, using convection heat if possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each pie, working on a lightly floured counter, carefully stretch out ball of dough as thinly as possible. Transfer dough round to a lightly floured peel. Spread half of the garlic paste over the dough, leaving about an inch bare around the edges. Top with half of the leeks and bacon and half of the mozzarella, torn into large chunks. Bake on pizza stone until crust is deeply caramelized and cheese is bubbly and lightly browned, about 5 minutes at 550°F. Top with finely grated Parmigiano-Reggiano. Sprinkle with coarse sea salt, drizzle lightly with olive oil, slice, and serve.</p>"}]}