{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101112-turkey-in-parts.JPG", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["low carb", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Roast Turkey in Parts", "link": "https://www.seriouseats.com/recipes/2010/11/turkey-in-parts-white-dark-recipe.html", "description": "A whole roast bird may be traditional, but roasting your holiday turkey in parts is the best way to achieve even, thorough cooking from breast to leg.", "totalTime": "5 hours, plus overnight rest if dry-brining", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Christmas", "Mains", "Roasting", "Thanksgiving", "Turkey"], "recipeIngredient": ["1 whole turkey, 10 to 15 pounds (4.5 to 6.8kg)", "Kosher salt and freshly ground black pepper", "1 large onion, peeled and roughly chopped (about 2 cups)", "1 large carrot, peeled and roughly chopped (about 1 cup)", "2 large ribs celery, roughly chopped (about 1 cup)", "2 medium cloves garlic, peeled and smashed", "2 bay leaves", "12 whole black peppercorns", "1 quart (900ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock, divided", "2 tablespoons (30ml) vegetable oil", "3 tablespoons (45g) unsalted butter", "3 tablespoons flour", "1/4 teaspoon Marmite", "1 teaspoon (5ml) soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, remove legs from turkey and set aside. Using a large cleaver or heavy <a href=\"https://www.seriouseats.com/2018/06/the-best-chefs-knives.html\">chef's knife</a>, cut backbone and carcass away from the turkey breast. Separate turkey wings from breast. Chop backbone and carcass into rough pieces with the cleaver. Season liberally with salt and pepper. For best results, transfer turkey parts to a wire rack set in a rimmed baking sheet and let rest, uncovered, overnight in refrigerator (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 275°F (135&deg;C). Spread onions, carrots, celery, garlic, bay leaves, and black peppercorns evenly across a rimmed baking sheet. Pour 1 cup (240ml) stock into baking sheet; reserve remaining stock. Place a wire rack on top of the baking sheet. (It may rest directly on top of vegetables&mdash;this is okay.) Set aside. Place turkey on top of rack on top of vegetables, trying to leave a little space between the turkey pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast turkey until an instant-read thermometer inserted into the center of a breast piece registers 150°F (66&deg;C), 2 to 3 hours total. Remove breast and set aside. Continue roasting legs until an instant-read thermometer registers 170°F (77&deg;C) when inserted into leg, about 30 minutes longer. (Depending on the pieces' arrangement, the legs might finish at the same time as the breasts.) The turkey pieces will not be browned. Set aside at room temperature for at least 30 minutes and up to 2 hours. Set a fine-mesh strainer over a large bowl. Strain vegetables from tray. Reserve liquid and discard vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>While Turkey Is Roasting, Make the Gravy:</strong> Roughly chop carcass and neck into 1-inch chunks. Heat vegetable oil in a large saucepan or Dutch oven over high heat until just beginning to smoke. Add turkey carcass and cook, stirring frequently, until well browned on all surfaces, about 10 minutes. Add remaining stock. Add water until turkey pieces are barely covered. Bring to a boil, reduce to a simmer, and allow to simmer while turkey roasts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey is resting, pour stock through the same strainer and add to reserved stock from strained vegetables. Discard solids. If desired, cut giblets into 1/4-inch pieces. Heat butter in a medium saucepan over medium-high heat until melted. Add giblets and cook, stirring frequently, until lightly browned, about 2 minutes. Add flour and cook, stirring constantly, until flour is light blond in color. Slowly whisk in reserved stock, Marmite, and soy sauce. Bring to a boil, then reduce to a simmer. Cook until desired consistency is reached, about 10 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>30 Minutes Before Serving Turkey:</strong> Preheat oven to 500°F (260&deg;C). Place turkey in oven and cook until crisp and browned, turning breast once during cooking. Serve immediately with gravy.</p>"}]}