{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100426ediblelobsterrolls.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Carole Topalian", "Cook the Book", "Edible: A Celebration of Local Foods", "lobster", "lobster rolls", "mayonnaise", "sandwiches", "Tracey Ryder"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lobster Rolls", "link": "https://www.seriouseats.com/recipes/2010/04/lobster-rolls-recipe.html", "description": "Thumbing through the pages of <strong><em><a href=\"http://www.amazon.com/Edible-Celebration-Local-Tracey-Ryder/dp/0470371080/serieats-20\">Edible: A Celebration of Local Foods</a></em></strong> by <a href=\"http://www.traceyryder.com/\">Tracey Ryder</a> and <a href=\"http://www.topalianphoto.com/\">Carole Topalian,</a> I came across a recipe for lobster rolls adapted from <em><a href=\"http://www.ediblecommunities.com/capecod/\">Edible Cape Cod</a></em>.  I decided that since a trip up to New England wasn't in the cards, a homemade version was in order.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 egg", "1 egg yolk", "2 teaspoons Dijon mustard", "2 teaspoons white wine vinegar", "1 teaspoon kosher salt, plus more if needed", "1 1/2 cups vegetable oil or grapeseed oil", "1/4 teaspoon freshly ground black pepper, plus more if needed", "2 teaspoons freshly squeezed lemon juice, plus more if needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the mayonnaise</strong>  Place the egg, egg yolk, and mustard in the work bowl of a food processor.  Process for 30 seconds and then, with the machine running, add the vinegar and salt and process for another 15 seconds.  With the machine still running, begin to add the oil slowly, a few drops at a time.  When the mixture starts to thicken, add the remainder of the oil in a slow, steady stream until it has been incorporated.  Stop the machine.  Add the pepper and lemon juice and pulse quickly to combine.  Taste and adjust the seasoning if needed, and pulse quickly to combine.  Makes 1 cup.  Use mayonnaise immediately or store in the refrigerator in a sealed container for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Lobster Rolls</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 Maine lobsters (1 1/4 pounds each)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup Homemade Mayonnaise, or commercial</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/3 cup unsalted butter, melted</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 top-sliced, pull-apart hot dog rolls</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Procedure</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot at least 16 inches in diameter and 12 inches deep two-thirds full with water and bring to a rolling boil.  Place the lobsters head-first into the pot and cover with the lid.  Return the water to a boil.  Remove the lid and simmer the lobsters for about 11 minutes (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, remove the lobsters from the pot and place them in a large bowl or the sink to cool enough to handle.  Remove the lobster tails and claws.  Using a lobster cracker, crack open the tails and claws and remove the meat.  Roughly chop the meat and place into a large bowl; set aside to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the mayonnaise to the bowl with the lobster and stir to combine.  Add additional mayonnaise if needed to achieve the desired consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet over medium-high heat for about 5 minutes.  Lightly brush both sides of each hot dog roll with the melted butter and place all the rolls into the skillet.  Cook the rolls outside face down, until the bottoms are golden brown, 2 to 3 minutes.  Turn the rolls over and cook until the bottoms are golden, 2 to 3 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the rolls from the skillet.  Stuff each roll evenly with the prepared lobster filling.  Serve 2 lobster rolls per person.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong>  To figure the boiling time for live lobsters, after the cooking water has returned to a boil, lobster should be simmered 10 minutes for the first pound of weight of 1 lobster, plus 3 minutes for each additional pound.  With this method, after the water has returned to a boil, a 1 1/2-pound lobster would simmer for 10 minutes plus 1 1/2 minutes, for a total of 11 1/2 minutes, and a 2-pound lobster would cook for about 13 minutes.</small></p>"}]}