{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100606grits.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "grits", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Bacon Cheddar Broiled Grits", "link": "https://www.seriouseats.com/recipes/2010/06/sunday-brunch-bacon-cheddar-broiled-grits.html", "description": "<strong>Plain grits are a fine thing, yes,</strong> but grits plus bacon and cheese will win over anyone. The Lee brothers suggest serving these grits with scrambled eggs, but also imply that after a rough night you might want nothing more than a big bowl of grits, a spoon, and a tall mimosa. They also advise against instant grits, urging us to look instead for the label \"stone-ground\" or \"old-fashioned.\"", "totalTime": null, "recipeYield": "4-6", "recipeCategory": ["Breakfast and Brunch"], "recipeIngredient": ["2 cups whole milk", "2 cups water", "1 cup stone-ground grits", "1/4 teaspoon kosher salt", "1/4 pound slab or thick-cut bacon, diced", "1 3/4 cups (4 ounces) coarsely grated extra-sharp cheddar cheese", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk and water into a 2-quart saucepan. Cover and then bring to a boil over medium-high heat. When the liquid is bubbling, uncover the pot, stir in the grits and salt, and reduce the heat to medium. Stir constantly until the grits have the consistency of thick soup, about 8 minutes. Reduce the heat to low and simmer, stirring every few minutes, for about 20 minutes, until the grits thicken. Then cook about 15 minutes more, stirring just about constantly to prevent the grits from sticking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the grits are cooking, preheat the broiler. Cook the bacon in a skillet over medium-high heat until firm and barely crisp, about 4 minutes. (A 9-inch wide, 2-inch deep, cast-iron skillet, if you have one, will be perfect for broiling the grits later, so go ahead and use it to cook the bacon now.) Remove the bacon with a slotted spoon and drain on paper towels. If you are going to use the same skillet for broiling, pour the bacon fat into a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the grits are cooked, stir in the bacon, pepper, 2 tablespoons of bacon fat from the small bowl, and all but a handful of the cheese. Stir until the cheese melts. Pour the grits into your skillet, a broiler-safe 24-ounce baking dish, or four broiler-safe 6-ounce ramekins. Scatter the remaining handful of cheese over the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Broil about 2 inches from the flame until the cheese is nicely browned, about 3 minutes. Serve immediately.</p>"}]}