{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100222-Cassoulet.jpg", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": ["beans", "cassoulet"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cassoulet", "link": "https://www.seriouseats.com/recipes/2010/02/fast-cassoulet-beans-recipe.html", "description": "\"I'm not going for a 30-Minute Meal here, but for a cassoulet, this recipe is pretty speedy.\" I love a traditional cassoulet but am rarely prepared to devote several days to prepping and sourcing all the ingredients. Just reading through...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mains"], "recipeIngredient": ["2 cups dried navy beans", "2 sprigs thyme, 1 stem parsley, top half of a stalk of celery, 2 bay leaves, tied in a bundle", "3 whole garlic cloves, peeled", "1 slice bacon", "Salt and black pepper, to taste", "2 teaspoons grape seed oil, or other neutral oil with a high smoke point", "10 small garlicky pork sausage links (Avoid Italian sausage and sausage with a lot of sage; I used <a href=\"http://aberdeenhillfarm.com/products\">Aberdeen Hill Farms</a> breakfast sausage)", "5 chicken drumsticks", "1 large onion, chopped", "2 carrots, or 1 small parsnip, chopped", "2 celery stalks, chopped", "4 garlic cloves, minced", "1 teaspoon minced fresh thyme.", "About 3/4 cup white wine", "1 cup chopped tomato", "2 cups bread crumbs", "1/2 stick unsalted butter, melted", "2 tablespoons fresh parsley, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the beans in cool water for 6 to 8 hours. Drain the soaking water and transfer beans to a heavy bottomed pot. Cover beans with about 2 inches of water and add bundle of aromatics, garlic, and bacon. Partially cover and simmer gently over medium-low heat until beans are tender, but not falling apart, 1 hour or so. Remove from heat, take out herb bundle, garlic, and bacon. Salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast iron or other oven-proof skillet and add oil. Brown the sausage over moderately high heat, remove and set aside. Season the chicken with salt and pepper and brown on all sides. Remove and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the heat to medium and add the onion, carrots, and celery to the skillet, along with a good pinch of salt. Stir occasionally. After the vegetables begin to soften (about 3 to 4 minutes), add the garlic and thyme, and cook, stirring, another 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Deglaze the skillet with wine and reduce slightly. Stir in the chopped tomato and bring to a simmer. Stir in the beans (reserving the cooking liquid) and season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the chicken and sausage in an alternating pattern, pressing them into the bean mixture. The beans should be well-moistened and you should be able to see liquid bubbling up a bit on the sides and peaking through the beans. If not, drizzle in some of the reserved bean cooking liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the bread crumbs, butter, parsley, and salt and pepper to taste. Spread over the beans and meat. Transfer the skillet to the oven and bake for about 30 minutes, until the bread crumb crust is nicely browned and crispy and the meat is cooked through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the cassoulet to sit at room temperature 15-30 minutes before serving. </p>"}]}