{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100329gateaubretonafter.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["almond", "cakes", "French pastries", "Rose Levy Beranbaum", "Rose's Heavenly Cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rose Levy Beranbaum's Gâteau Breton", "link": "https://www.seriouseats.com/recipes/2010/03/rose-levy-beranbaums-gateau-breton-recipe.html", "description": "Once I put the batter for this <strong>Gâteau Breton</strong> into the pan and in the oven it was only a matter of minutes before an intoxicating began to fill my kitchen.  It was a sweet mix of sugar, eggs, and almonds that brought to mind freshly baked almond croissants.", "totalTime": null, "recipeYield": "10 to 12", "recipeCategory": ["Bake the Book", "Cakes", "Cook the Book", "Desserts", "Nuts"], "recipeIngredient": ["1/2 cup blanched sliced almonds", "3/4 cup superfine sugar, divided", "1/4 teaspoon salt", "2 sticks plus 2 tablespoons unsalted butter, preferably high fat (or high-quality lightly salted butter), 65° to 75°F", "about 4 large egg yolks, at room temperature", "1 tablespoon kirsch, dark rum, or water", "1 1/4 teaspoons pure vanilla extract", "2 cups (sifted into the cup and leveled off) plus 3 tablespoons bleached all-purpose flour", "1 whole egg, lightly beaten "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Preheat the oven</strong>: Twenty minutes or more before baking, set an oven rack in the lower third of the oven and preheat the oven to 325°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the almonds evenly on a baking sheet and bake for about 7 minutes, or until pale gold. Stir once or twice to ensure even toasting and avoid overbrowning. Cool completely. In a food processor, process the almonds with about 1/4 cup of the sugar and the salt until fairly fine but not powder fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the flat beater, mix together the remaining sugar and the butter on medium speed for about 1 minute until smooth and creamy. Scrape down the sides of the bowl. Beat in the yolks, 1 at a time, beating for about 20 seconds between each addition. Scrape down the sides of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the almond mixture, kirsch, and vanilla and mix on low speed until the dry ingredients are moistened. Raise the speed to medium and beat for about 20 seconds until evenly incorporated. Add the flour in four parts, beating on the lowest speed for about 15 seconds and turning off the mixer between additions. Detach the beater and, with a silicone spatula, finish mixing in any flour that may remain, reaching to the bottom of the bowl. Using the silicone spatula, scrape the batter into the prepared pan and smooth the surface evenly with a small off set spatula. If you are using a 1-inch-high tart pan, the batter will be about 1/4 inch from the top of the pan and will rise to about 1/4 inch above the top during baking. In a 1⅜-inch-high pan, the batter will be about 1 inch from the top and rise to about ⅜ inch from the top. (If using a cake pan, the gateau will rise higher and dip slightly in the middle.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the beaten egg, brush the top of the cake well, using a little less than 1 tablespoon. Use the tines of a fork to make a crosshatch of three long lines in two directions. (If the batter has softened, refrigerate or freeze it briefly to make it more firm.) The fork lines will help prevent the batter from puffing up unevenly and after baking will leave a bare tracing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 35 to 45 minutes, or until deep golden brown and the cake springs back when pressed lightly in the center. It should just begin to come away from the sides of the pan. An instant-read thermometer will register about 205°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cake cool on a wire rack for 10 minutes. If using a pan with a removable bottom, remove the sides of the pan. Invert the cake onto a cookie sheet and remove the pan bottom. Reinvert it onto a serving plate. Cool completely.</p>"}]}