{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100910-kimchidumplings-recipe.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Korean", "keywords": ["Asian", "cabbage", "dumpling", "kimchi", "Korean", "Seriously Asian", "soy sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kimchi Dumplings", "link": "https://www.seriouseats.com/recipes/2010/09/kimchi-dumplings-recipe.html", "description": "These dumplings are one of my new favorite ways to use kimchi....", "totalTime": "1 hour", "recipeYield": "makes approximately 40 to 50 dumplings", "recipeCategory": ["Cabbage", "Korean"], "recipeIngredient": ["1 cup finely diced napa cabbage kimchi", "1 ounce dried vermicelli noodles", "1 8-ounce block of cotton (firm tofu)", "1 large egg", "4 teaspoons light soy sauce", "1/2 teaspoon sesame oil", "1 package dumpling wrappers (40 to 50 wrappers)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><Strong>For the Filling</strong>: Place tofu on paper towel-lined plate. Top with second paper towel and place plate on top. Allow to drain for 15 minutes. With your fingers, break up the tofu until it resembles crumbled feta cheese.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, bring 1 quart water to a boil and remove from heat.  Add noodles, cover, and let steep until noodles are softened, about 5 minutes. Finely chop noodles (you should have about 1/2 cup chopped noodles). Combine tofu, noodles, kimchi, egg, soy sauce, and sesame oil in small bowl. Stir with fork to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fill dumplings, place approximately 2 teaspoons of filling in center of single wrapper. Moisten with wet finger tip, then fold over and seal by crimping edges. Set formed dumpling on rimmed baking sheet lined with parchment paper. Keep unfilled wrappers under damp kitchen towel to prevent drying. </p>\r\n\r\n<p><strong>Note:</strong> Formed dumplings at this stage can be stored covered in refrigerator for up to 1 day. For long term storage, freeze dumplings on tray (don't allow them to tough during freezing or they'll stick together), remove once frozen, and store in freezer in zipper-lock freezer bag for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook, bring 3 quarts water to a rolling boil in a stock pot. Add dupmling ans boil until the skins are just translucent, 4 to 6 minutes. Remove dumplings from water with slotted spoon or spider and serve immediately with soy sauce and vinegar, if desired.</p>"}]}