{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100518-dt-olive-oil-poached-salmon.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["fish", "olive oil", "poach", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Olive Oil&ndash;Poached Salmon", "link": "https://www.seriouseats.com/recipes/2010/05/dinner-tonight-olive-oil-poached-salmon-recipe.html", "description": "I couldn't really resist the idea of using <strong>a poaching liquid of pure olive oil.</strong> What would it do to the flesh of this salmon? The process is similar to making a confit, such as duck: a slow poach in fat, resulting in succulence and tenderness. But for fish, which is already tender, it's fast enough for a weeknight dinner instead of a multiple-hour affair.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Dinner Tonight", "Mains", "Poaching", "Salmon"], "recipeIngredient": ["2 pounds salmon, skinned, boned, and cut into serving portions", "Olive oil as needed", "1 cup peas", "1 1/2 cups sugar snap peas, washed and ends trimmed", "1 pound asparagus, woody ends snapped off, cut into 1-inch pieces on the diagonal", "2 teaspoons lemon juice", "1 teaspoon lemon zest", "1 teaspoon chopped fresh thyme leaves", "Salt and pepper to taste", "Flaky sea salt such as Maldon, for finishing the fish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the salmon in a heavy, snug pot or tall-sided skillet and cover with olive oil until completely submerged.  Warm over low heat until the oil feels barely warm to the touch, about 100 degrees.  White dots appearing on the flesh indicate that the heat is too high. Cook for 18-20 minutes, until still rosy in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the lemon juice, zest, thyme leaves, and a little warm oil from the salmon.  Season with salt and pepper and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a large pot of salted water to boil.  Add the asparagus and cook for 1 minute, then add the sugar snap peas and cook for 30 seconds, then add the peas for a final 30 seconds.  Drain the vegetables and dry them well, then toss with the dressing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the salmon topped with flaky salt and surrounded by vegetables.</p>"}]}