{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100420-dt-cornmeal-crusted-trout.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fish", "Mark Peel", "trout"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Cornmeal-Crusted Pan-Fried Trout", "link": "https://www.seriouseats.com/recipes/2010/04/dinner-tonight-cornmeal-crusted-pan-fried-trout-fish-recipe.html", "description": "I've been daydreaming lately about going on a fishing trip. Maybe that's why I was drawn immediately to this recipe, which I imagine is the perfect recipe for a cast iron skillet and the freshest river trout known to man. The idea here is to use <strong>a fine cornmeal that will adequately coat the fish and give it a golden crunch</strong> on the outside.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Fish"], "recipeIngredient": ["4 trout fillets, or two whole trout beheaded, scaled, butterflied, and pinbones removed", "salt and pepper as needed", "6 tablespoons fine cornmeal", "1/4 cup all-purpose flour", "1 tablespoon chopped parsley", "1/4 cup canola oil", "1 tablespoon butter", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the fish with salt and pepper. In a shallow bowl, combine the cornmeal, flour, parsley, and 1 teaspoon salt. Dip the flesh side of the trout in the cornmeal mixture, pressing to make sure it is fully coated, dusting it by hand to create a good layer of cornmeal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the oil in a hot pan until almost smoking, then add 1 or 2 fillets (as many as will fit comfortably) flesh side down. After 1 minute, add 2 teaspoons of butter to the pan, and watch the skin of the fish: when it begins to curl, about 1 to 2 minutes longer, turn the fish. Cook on the skin side just another 30 seconds or so, then remove to a warm oven while you cook the remaining fish with the rest of the oil and butter. Serve hot with lemon wedges.</p>"}]}