{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/IMG_2913.JPG", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Latin American", "keywords": ["chicken", "Colombian", "potato", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ajiaco: Colombian Chicken and Potato Soup", "link": "https://www.seriouseats.com/recipes/2010/09/ajiaco-colombian-chicken-and-potato-soup-recipe.html", "description": "All potatoes originated in the Andes, and Colombia has quite a selection of them, the best being the small, yellow, creamy, buttery <em>papas Criollas</em>. They're eaten deep fried, salt roasted, boiled, or&mdash;my wife's favorite method&mdash;cooked into <em>ajiaco</em>, a classic chicken and potato soup from the mountains around Bogotá.", "totalTime": "1 hour 15 minutes", "recipeYield": "4 to 6", "recipeCategory": ["Chicken", "Latin American", "Mains", "Potato", "Soups and Stews"], "recipeIngredient": ["2 quarts homemade chicken stock (or low-sodium canned stock)", "1 whole bone-in, skin-on chicken breast, split (12 to 16 ounces total)", "1 large onion, split in half", "2 bay leaves", "2 pounds russet potatoes (about 2 medium) peeled and cut into rough 1-inch chunks", "2 pounds papas Criollas (about 20 potatoes), peeled", "1 pound Red Bliss potatoes (about 2 small), peeled, split into quarters lengthwise, and cut into 1/2-inch slices", "1/4 cup dried <em>guascas</em> (see note)", "2 ears corn, shucked and broken into 3 pieces each", "1 small onion, finely diced (about 3/4 cup)", "2 tablespoons chopped cilantro", "1 serrano or 1/2 jalapeño chile, seeded and finely minced", "Kosher salt and freshly cracked black pepper", "1/2 cup sour cream, thinned with 1 tablespoon milk", "1/2 cup capers, rinsed, drained, and roughly chopped", "1 ripe avocado, preferably smooth, light-green <em>fuerte</em> variety, sliced into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chicken stock, chicken breast, onion, bay leaves, potatoes, and guascas in a large saucepot or Dutch oven. Add more water if necessary to cover solids by 1-inch. Bring to a boil over high heat. Reduce to a simmer and cook until chicken breast is cooked through, about 10 minutes. Transfer chicken breast to plate and set aside until cooled to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to simmer potatoes until russets and papas Criollas are completely tender and falling apart, about 45 minutes longer, adding more water as necessary. Discard onion and bay leaves. Using whisk, mash potato pieces against side of pot and stir vigorously to thicken soup. The soup should be thick, with large chunks of potatoes still remaining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add corn cobs and continue to cook, stirring occasionally, until corn is cooked and soup is thickened to the consistency of thick heavy cream, about 15 minutes longer. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While soup is cooking, make the <em>aji</em>: Combine onion, cilantro, and chile pepper in small serving bowl and add water until just covered. Season generously with salt and stir to combine. Set aside. Discard chicken skin and bones. Shred meat into bite-size pieces and set aside in serving bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season soup to taste with salt and pepper. Serve immediately, passing picked chicken, chopped capers, sour cream, and aji table-side for diners to add to their bowl. Serve avocado slices on the side.</p>"}]}