{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101119CiderDonuts.jpg", "author": {"@type": "Person", "name": "Olga Massov"}, "recipeCuisine": "Kosher", "keywords": ["apple cider", "desserts", "fried", "hanukkah", "hanukkah desserts", "holiday baking", "Jewish holidays"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cider Doughnuts", "link": "https://www.seriouseats.com/recipes/2010/11/apple-cider-doughnuts-donuts-recipe.html", "description": "After a filling Hannukah meal, no matter how much I've eaten, I always want some dessert at the end. Sadly, I never took to <strong>sufganyot, the Sephardic jelly-filled doughnuts</strong> traditionally served during the holiday, but I've always, <em>always</em> had a soft spot for homemade doughnuts, especially the apple cider kind.", "totalTime": "1 hour, 30 minutes", "recipeYield": "12", "recipeCategory": ["Breakfast Sweets", "Deep Frying", "Desserts", "Doughnuts", "Kosher"], "recipeIngredient": ["1 cup apple cider", "3 1/2 cups flour, plus additional for the work surface", "2 teaspoons baking powder", "1 teaspoon baking soda", "1/2 teaspoon ground cinnamon", "1/2 teaspoon salt", "1/8 teaspoon ground nutmeg", "4 tablespoons (1/2 stick) butter, at room temperature", "1 cup granulated sugar", "2 eggs", "1/2 cup buttermilk", "Shortening or vegetable oil for frying", "1 cup sugar mixed with 2 tsp cinnamon in a wide dish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In saucepan over medium heat, gently reduce apple cider to about 1/4 cup by simmering for 20-30 minutes. Set aside to cool. In large bowl, whisk together flour, baking powder, baking soda, cinnamon, salt, and nutmeg. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter and sugar to stand mixer fitted with paddle attachment. Cream on medium speed until the mixture is smooth and fluffy, about 3 minutes. Add eggs, 1 at a time, continuing to mix until eggs are completely incorporated. Reduce speed to low and gradually drizzle in reduced apple cider and buttermilk, mixing just until combined, about 1 minute. Add flour mixture and continue to mix until the dough comes together. Do not overmix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two rimmed baking sheets with parchment paper and sprinkle generously with flour. Turn dough onto one sheet and sprinkle the top with flour. Flatten dough to even 1/2-inch thickness with hands or rolling pin, sprinkling with flour as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough to the freezer until slightly hardened, about 20 minutes. Using 3-inch doughnut cutter, cut out doughnut shapes and donut holes. Place cut doughnuts and doughnut holes onto second sheet pan. Refrigerate doughnuts for 20 to 30 minutes. (You can re-roll scraps of dough, refrigerate them briefly and cut additional doughnuts from dough.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough oil or shortening to Dutch oven or wok to measure depth of about 3 inches. Attach candy thermometer to side of the pan and heat over medium heat until oil reaches 350 degrees. Line large plate with several layers of paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully add doughnuts to oil a few at a time, being careful not to crowd pan. Fry until golden brown, about 60 seconds. Turn doughnuts over and fry until second side is golden, 30 to 60 seconds longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain fried donuts on paper towels. Dip top of the warm doughnuts in cinnamon sugar and serve immediately.</p>"}]}