{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2010/01/thebestchiliever.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "American", "keywords": ["american", "bean", "beef", "chili", "low carb", "meat", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "36"}, "name": "The Best Chili Ever", "link": "https://www.seriouseats.com/recipes/2010/01/the-best-chili-recipe.html", "description": "This chili brings together a rich, complex chili flavor; a robust beefy character; and creamy, tender beans that stay intact.", "totalTime": "6 hours, plus overnight to soak beans", "recipeYield": "Serves 6 to 10", "recipeCategory": ["American", "Beef", "Chili", "Dairy-Free", "Mains", "Stovetop", "The Food Lab"], "recipeIngredient": ["1 pound (450g) dried dark red kidney beans", "Kosher salt", "4 quarts (3.8L) water", "3 whole ancho, <em>pasilla</em>, or <em>mulato</em> chilies, seeded and torn into rough 1-inch pieces (about 1/2 ounce)", "2 whole New Mexico red, California, <em>costeño</em>, or <em>choricero</em> chilies, seeded and torn into rough 1-inch pieces (about 1/8 ounce)", "1 whole <em>cascabel</em>, <em>árbol</em>, or <em>pequin</em> chili, seeded and torn in half", "5 pounds (2.3kg) bone-in beef short ribs, trimmed of silver skin and excess fat", "Freshly ground black pepper", "2 tablespoons (30ml) vegetable oil", "1 quart (900ml) low-sodium chicken broth (preferably <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a>), divided", "2 whole anchovy fillets", "1 teaspoon (5ml) Marmite", "2 teaspoons (10ml) soy sauce", "2 tablespoons (30ml) tomato paste", "1 1/2 tablespoons whole cumin seeds, toasted, then ground", "1 1/2 teaspoons whole coriander seeds, toasted, then ground", "2 whole cloves, toasted and ground", "1 star anise, toasted and ground", "1 tablespoon extra-finely ground coffee beans", "1 ounce chopped unsweetened chocolate", "1 large yellow onion, diced fine (about 1 1/2 cups)", "3 fresh Thai bird chilies or 1 jalapeño, finely chopped", "4 cloves garlic, minced (about 1 tablespoon)", "1 tablespoon dried oregano leaves", "2 bay leaves", "1 (28-ounce; 794g) can crushed tomatoes", "1/4 cup (60ml) cider vinegar, plus more to taste", "1/4 cup (60ml) vodka or bourbon", "1 tablespoon (15ml) Buffalo-style hot sauce, such as Frank's RedHot (or more to taste)", "2 tablespoons dark brown sugar", "<strong>For the Garnish (all suggestions optional):</strong>", "Scallions, sliced finely", "Cheddar, Jack, or Colby cheese, grated", "Sour cream", "Jalapeño or Poblano peppers, diced and seeded", "Onion, diced", "Avocado, diced", "Saltines", "Fritos"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beans, 6 tablespoons kosher salt (or 3 tablespoons table salt), and water in a large plastic container or bowl. Allow to soak at room temperature at least 8 hours, or overnight. Drain and rinse soaked beans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add dried chilies to a large heavy-bottomed Dutch oven or stockpot and cook over medium-high heat, stirring frequently, until slightly darkened with an intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chilies, place in a small bowl, and set aside. Alternatively, place dried chilies on a microwave-safe plate and microwave on high power in 15-second increments until chilies are pliable and toasted-smelling, about 30 seconds total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season short ribs on all sides with salt and pepper. Add oil to Dutch oven and heat over high heat until smoking. Add half of short ribs and brown well on all sides (it may be necessary to brown ribs in 3 batches, depending on size of Dutch oven&mdash;do not overcrowd pan), 8 to 12 minutes total, reducing heat if fat begins to smoke excessively or meat begins to burn. Transfer to a large rimmed baking sheet or plate. Repeat with remaining short ribs, browning them in the fat remaining in Dutch oven. Once all short ribs are cooked, transfer all rendered fat into a small bowl and reserve separately. Allow short ribs to cool at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, return Dutch oven to medium-high heat and add 1 cup (240ml) chicken broth, using a flat wooden spoon or stiff spatula to scrape browned bits off of bottom of pan. Reduce heat until chicken broth is at a bare simmer, add toasted chilies to liquid, and cook until chilies have softened and liquid is reduced by half, 5 to 8 minutes. Transfer chilies and liquid to a blender. Add anchovy, Marmite, soy sauce, tomato paste, ground spices, coffee, and chocolate and blend at high speed, scraping down sides as necessary, until a completely smooth purée has formed, about 2 minutes. Set chili purée aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim meat from short rib bones and hand-chop into rough 1/2-inch to 1/4-inch pieces (finer or larger, as you prefer), reserving bones separately. Add any accumulated meat juices to chili purée.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 4 tablespoons (60ml) rendered beef fat (if necessary, add vegetable oil to reach 4 tablespoons) in a large Dutch oven or heavy-bottomed stockpot over medium heat until shimmering. Add onions and cook, stirring frequently, until softened but not browned, 6 to 8 minutes. Add fresh chilies, garlic, and oregano and cook, stirring frequently, until fragrant, about 1 minute. Add chili purée and cook, stirring frequently and scraping bottom of pot, until chili mixture begins to fry and leaves a coating on bottom of pan, 2 to 4 minutes. Add chicken stock, chopped beef, beef bones, and bay leaves. Bring to a simmer, scraping bottom of pan to loosen browned bits. Reduce heat to lowest possible setting, add beans, and cook, with cover slightly ajar, until beans are almost tender, about 1 hour. Add crushed tomatoes and cider vinegar and cook, with cover slightly ajar, until beans and beef are fully tender and broth is rich and lightly thickened, 2 to 3 1/2 hours longer, adding water if necessary to keep beans and meat mostly submerged (a little protrusion is okay).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, remove and discard bay leaves and bones. (At this point, any excess meat still attached to the bones can be removed, chopped, and added back to the chili, if desired.) Add vodka (or bourbon), hot sauce, and brown sugar and stir to combine. Season to taste with kosher salt, ground black pepper, and additional vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, or, for best flavor, allow to cool and refrigerate overnight, or up to 1 week in a sealed container. Reheat and serve with desired garnishes.</p>"}]}