{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100902jerkpork.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Caribbean", "keywords": ["Cook the Book", "grill", "grilling", "Jamaican", "Jerk", "Planet Barbecue", "pork", "Steven Raichlen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Cook the Book: Jerk Pork", "link": "https://www.seriouseats.com/recipes/2010/09/jerk-pork-recipe.html", "description": "What's the first image that pops into your head when you think about Jamaica? Bob Marley? White sandy beaches? A certain smokable substance? Perhaps a steel drum band? Or maybe, if your mind tends to jump to more food related images, a smokey grill filled with jerk chicken and pork coated in that super spiced Jamaican seasoning that tastes like nothing else.", "totalTime": "", "recipeYield": "10 to 12", "recipeCategory": ["Caribbean", "Cook the Book", "Grilling", "Pork"], "recipeIngredient": ["1 pound Scotch bonnet chiles, stemmed and cut in half (1/2 pound seeded Scotch bonnets for the tender of tongue)", "1 green bell pepper, cored and seeded", "1 bunch scallions, both white and green parts, trimmed and cut into 1-inch pieces", "1 small onion, coarsely chopped", "2 shallots, coarsely chopped", "3 cloves garlic, coarsely chopped", "1 piece (2 inches) fresh ginger, peeled and coarsely chopped", "2 teaspoons fresh thyme leaves, or 1 teaspoon dried thyme", "3 giant thyme leaves (Spanish thyme), or 1 additional teaspoon fresh thyme leaves, or 1/2 teaspoon dried thyme", "6 fresh basil leaves, or 1 1/2 teaspoons dried basil", "1 tablespoon ground allspice, or more to taste", "2 teaspoons ground cinnamon", "2 teaspoons freshly ground black pepper", "1/2 cup coarse salt (kosher or sea)", "1/4 cup vegetable oil", "1 tablespoon soy sauce, or more to taste", "1 Boston butt (bone-in pork shoulder roast; 6 to 7 pounds, with ample fat)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the Scotch bonnets, bell pepper, scallions, onion, shallots, garlic, ginger, thyme, basil, ground allspice, cinnamon, and black pepper in a food processor fitted with a metal blade and puree to a smooth paste, running the machine in bursts. Work in the salt, oil, and soy sauce. Add enough water (about 1/4 cup) to obtain a thick but pourable paste. Taste for seasoning, adding more allspice and/or soy sauce, as necessary; the mixture should be very salty and very flavorful. You should have about 2 1/4 cups—perhaps a little more than you need, but any excess keeps well in the refrigerator. Store it in a glass jar and place a piece of plastic wrap between the top of the jar and the lid, so the pepper fumes and salt don’t corrode the lid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut through one side of the pork shoulder to the bone. Cut around the bone and keep cutting to within an inch of the other side of the shoulder. Do not cut all the way through. Open the pork shoulder like a book. Cut under the bone and remove it. Pound the pork with a meat mallet or rolling pin until it is about 1 1/2 inches thick. Holding the knife parallel to the short edge of the pork rectangle, make a series of parallel cuts 1/2 inch deep and 2 inches apart from one edge to the other. Turn the pork over and make parallel cuts on the other side, working so that the cuts on the second side are midway between the cuts on the first side. These “accordion” cuts are a signature of Jamaican jerk masters and help the marinade and smoke flavors penetrate the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread half of the jerk marinade in the bottom of a nonreactive roasting pan or aluminum foil pan. Place the butterflied pork on top. Spread the remaining jerk paste over it. Let the pork marinate in the refrigerator, covered, for 2 to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the wood chips and allspice berries and soak them in water for 1 hour. Drain just before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pork, scraping off the excess jerk seasoning; it’s OK to leave a little on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To grill:</strong> Technically Jamaicans grill jerk pork using the direct method, but the low heat and corrugated tin cover they use produces an effect similar to indirect grilling. And, indirect grilling requires less attention than direct grilling here. Take your choice.</p>\r\n\r\n<p><em>If you are grilling using the indirect method,</em> set up the grill for indirect grilling and preheat it to medium. When ready to cook, if you are using a gas grill, add the wood chips and allspice berries to the smoker box or place them in a smoker pouch under the grate. If you are using a charcoal grill, toss the wood chips and allspice berries on the coals. Arrange the butterflied pork, fat side up, in the center of the grate over the drip pan and away from the heat and cover the grill.</p>\r\n\r\n<p><em>If you are grilling using the direct method,</em> set up the grill for direct grilling and preheat it to medium-low. When ready to cook, if you are using a charcoal grill, toss half of the wood chips and allspice berries on the coals. If you are using a gas grill, add the wood chips and allspice berries to the smoker box or place them in a smoker pouch under the grate. Arrange the butterflied pork, fat side up, on the hot grate and cover the grill. Toss the remaining wood chips and allspice berries on the coals when you turn the pork; keep the grill covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the pork until it is darkly browned and very tender, 40 to 60 minutes using the indirect method; about 20 minutes per side using the direct method. Use an instant-read meat thermometer to test for doneness, inserting it through the side of the pork. When done the internal temperature should be about 190°F to 195°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, transfer the jerk pork to a cutting board and let it rest, loosely covered with aluminum foil, for 10 minutes. Using a cleaver, whack the pork into bite-size pieces. Traditionally, jerk pork is served on waxed paper to be eaten with your fingers.  </p>"}]}