{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100322-nastybits-welshgriddlecakes.JPG", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Greg Patent", "lard", "leaf lard", "rendering", "The Nasty Bits", "Welsh Griddle Cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: How to Render Leaf Lard (with Welsh Griddle Cakes Recipe)", "link": "https://www.seriouseats.com/recipes/2010/03/how-to-render-leaf-lard-welsh-griddle-cakes-recipe.html", "description": "<strong>Nothing should stand in your way when it comes to a culinary communion with lard.</strong> If you are so clever as to obtain the entirety of leaf lard (ask a good butcher), then all you really need to render it is a knife and heavy pot. You can then use the lard in both sweet and savory dishes, like this recipe for <strong>Welsh Griddle Cakes.</strong>", "totalTime": "", "recipeYield": "20 to 24 tea cakes", "recipeCategory": ["Baking", "Pork", "The Nasty Bits"], "recipeIngredient": ["4 cups cake flour", "2 teaspoons baking powder", "1/4 teaspoon salt", "1/2 cup cold unsalted butter ", "1/2 cup rendered lard, in its solid form ", "3/4 cup granulated sugar plus more for sprinkling", "1/2 teaspoon freshly grated nutmeg", "1/4 teaspoon ground cinnamon", "3/4 cup golden raisins, currants, or dried cranberries", "Finely grated zest of 1 large lemon", "1 large egg", "3 Tablespoons fresh lemon juice", "3 Tablespoons whole milk, plus more if needed", "All purpose flour, for rolling dough", "<strong>For the rendered lard:</strong>", "1 entire leaf lard, about 2 1/2 pounds", "1/4 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In a bowl, combine the flour, baking powder, and salt. Add the lard and butter, or just the butter, and using a pastry blender, or two knives, cut the fat into the flour until the particles are the size of small peas. Using your fingertips, rub the flour and fat mixture until the lard and the butter are fairly small and the mixture resembles coarse cornmeal. Stir in the sugar, nutmeg, allspice, the dried fruit, and lemon rind.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl with a fork, beat the egg, lemon juice, and 2 tablespoons of milk. Sprinkle the egg mixture over the flour mixture and use the fork to start stirring it in, tossing the dough until it forms medium clumps. Then reach into the dough with both hands and, working quickly, keep tossing it until it feels moist, squeezing the dough together to form one mass. If the dough won't hold together, add a bit more milk, 1 teaspoon at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour your work surface, place the dough on it, and roll over the dough to flatten it; continue rolling until it is 1/3-inch thick. Use the cutter to stamp out rounds. Transfer them to the sheet or tray. Reroll and restamp the scraps, using all the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a cast-iron skillet over low heat. Carefully transfer the cakes to the skillet, spacing them about 2 inches apart. Cook over low heat for 5 to 6 minutes or until the bottoms are deep golden brown. Turn over carefully with a spatula turner and cook the second sides for 5 more minutes. The surfaces should feel crisp when tapped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cakes to a wire rack. Cook the remaining cakes in the same way. Serve the cakes warm or at room temperature. Store in an airtight container at room temperature for 2-3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the rendered lard:</strong> (makes about 10 cups)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a sharp knife, cut the lard into approximately 1 inch cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cubes of lard into a heavy pot, preferably enameled cast iron and add the water. Cover the pot and let the lard render for an initial ten minutes; then remove the lid. Maintaining the very low heat, slowly bring the lard to a temperature at which the liquid is barely simmering. Continue to render the lard for 1 to 2 hours, until the bits of cracklings are golden brown and very small, and the liquid fat is pale and golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the cracklings from the lard, pressing down on the mesh of the strainer to extract as much liquid as possible from the solids. Set aside the cracklings for another use. Cool the lard to room temperature and refrigerate until solid. The lard may be kept in airtight containers for several months.</p>"}]}