{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100924saltybutterbreakupcookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Around My French Table", "butter", "Cook the Book", "Cookies", "Dorie Greenspan", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Salted Butter Break-Ups", "link": "https://www.seriouseats.com/recipes/2010/09/salted-butter-break-ups-cookies-recipe.html", "description": "After baking a batch of these <strong>Salted Butter Break-Ups</strong> from <a href=\"http://doriegreenspan.com/about.html\">Dorie Greenspan</a>'s <strong><em><a href=\"http://www.amazon.com/Around-My-French-Table-Recipes/dp/0618875530/serieats-20\">Around My French Table</a></em></strong> all I could think about was how much more fun they were than a typical butter cookie, both in flavor&mdash;salty-sweet to the max and in how they're meant to be eaten&mdash;broken up at the table and plenty messy.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["1 3/4 cups all-purpose flour", "2/3 cup sugar", "3/4 to 1 teaspoon <em>sel gris</em> or kosher salt", "9 tablespooons cold unsalted butter, cut into 18 pieces", "3 to 5 tablespoons cold water", "1 egg yolk, for the glaze "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, sugar, and salt in a food processor and pulse to combine. Drop in the pieces of butter and pulse until the mixture looks like coarse meal&mdash;you’ll have both big pea-sized pieces and small flakes. With the machine running, start adding the cold water gradually: add just enough water to produce a dough that almost forms a ball. When you reach into the bowl to feel the dough, it should be very malleable. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough onto a work surface, form it into a square, and pat it down to flatten it a bit. Wrap the dough in plastic and chill it for about 1 hour (or for as long as 3 days). When you’re ready to bake, center a rack in the oven and preheat the oven to 350&deg;F. Line a baking sheet with a silicone baking mat or parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the fridge and, if it’s very hard, bash it a few times with your rolling pin to soften it. Put the dough between sheets of plastic wrap or wax paper and roll it&mdash;or pat it&mdash;nto a rectangle that’s about 1/4 inch thick and about 5 x 11 inches; accuracy and neatness don’t count for a lot here. Transfer the dough to the lined baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg yolk with a few drops of cold water, and, using a pastry brush, paint the top surface of the dough with the egg wash. Using the back of a table fork, decorate the cookie in a crosshatch pattern. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookie for 30 to 40 minutes, or until it is golden. It will be firm to the touch but have a little spring when pressed in the center&mdash;the perfect break-up is crisp on the outside and still tender within. Transfer the baking sheet to a rack and allow the cookie to cool to room temperature. </p>"}]}