{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20101026%20caterpillar%20pieces.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "fall", "rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Caterpillar Bread for Halloween", "link": "https://www.seriouseats.com/recipes/2010/10/bread-baking-caterpillar-bread-for-halloween.html", "description": "If you're going to put a creepy, crawly critter on the dining room table for Halloween, why not make it delicious? Making bread in the form of a caterpillar like this one is not only cute and clever, it's also practical. The <strong>body segments are perfect rolls, and the legs are bread sticks.</strong> There's no need for cutting&mdash;segments separate neatly with just a little tug. This would be great for a party or just for a fun dinner with the family.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Halloween"], "recipeIngredient": ["2 1/2 teaspoons (1 package) instant yeast", "1 1/4 cups lukewarm water", "1 tablespoon sugar", "13 1/4 ounces (2 1/2 cups) bread flour", "1 teaspoon salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer combine the yeast, water, and sugar. Set aside until it bubbles, about 10 minutes. Add the bread flour and knead with the dough hook attachment at low speed until the dough is smooth and elastic, about 10 minutes. Add the salt and oil and continue kneading until the dough is smooth, shiny and elastic and the oil and salt are completely incorporated, a few minutes more. Cover the bowl with plastic and let it rise until the dough has doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375 degrees and line a baking sheet with parchment paper. You could also sprinkle a baking sheet with cornmeal, but it's easier to remove for cooling if you use parchment. Flour your work surface lightly and turn the dough out. Knead briefly, then form the dough into a ball. Cut the dough into quarters, then cut each of those quarters into quarters again to form 16 pieces. Form 12 pieces into balls, as you would for rolls. Cut the remaining 4 pieces into thirds to form 12 smaller pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each smaller piece into a long, thin rope, a little thinner than a pencil. Arrange the ball and ropes on your baking sheet so that the balls barely touch each other and there is a rope underneath each \"joint\" between the balls (you'll use up 11 of the ropes). Arrange the balls as pictured so that it will all fit on the pan, and adjust legs so they don't touch during baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the last rope and cut in thirds. Use two pieces for antennas on the head of the caterpillar, and make a small ball from the third piece flatten it a bit to a disc-shape and place it just under the head to make the pincer \"mouth\" for the caterpillar. Cover the pan with plastic wrap and set aside to rise until it has doubled in size, about 30 minutes.</p>\r\n\r\n<p>When the dough has risen, use a small pair or scissors to snip two \"eyelids\" on the face of the caterpillar, and snip completely through the disc \"mouth.\" </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Snip a decorative pattern on the body with scissors if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 375 degrees until it is golden brown, about 30 minutes.</p>"}]}