{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken liver", "Cook the Book", "crostini", "Marco Canora", "recipe newsletter", "Salt to Taste", "Terroir"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Liver Crostini", "link": "https://www.seriouseats.com/recipes/2010/02/chicken-liver-crostin-recipe.html", "description": "The following recipe is from the February 17 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! When it comes to upscale bar food, Terroir, a natural wine bar in New York City,...", "totalTime": "", "recipeYield": "about 20 crostini", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Offal"], "recipeIngredient": ["1/2 pound chicken livers", "2 tablespoons unsalted butter", "4 tablespoons extra virgin olive oil", "1 cup finely chopped onion", "Kosher salt and freshly ground black pepper", "1 fresh sage sprig", "1 fresh rosemary sprig", "1/2 anchovy fillet, minced", "1/2 tablespoon drained capers", "1/4 cup cognac or other deglazing liquid such as wine", "1-2 baguettes, sliced, toasted, and seasoned with salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the livers, removing any veins, sinew, and fat. Lay them on towels to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter and 1 tablespoon oil in a large skillet over high heat. Add the onion and season with salt and pepper. Add the sage and rosemary and cook, stirring occasionally, until the onion starts to soften and color, about 5 minutes. Add the anchovy and capers, reduce the heat to medium-high, and continue cooking until the onion is soft and caramelized, about 10 minutes more. Transfer the onion to a bowl and wipe out the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the livers dry with a towel. Heat the skillet over high heat. Add the remaining 3 tablespoons oil. Season the livers with salt and pepper and immediately place them in the pan in a single well-spaced layer. Cook the livers without disturbing them until they get nicely browned, about 2 minutes, then flip them over. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook for 1 minute more, then add the onion. Mix to distribute the onion evenly. Stand back from the stove and carefully add the cognac (it will flame); cook until the flames burn out and the pan is more or less dry, about 30 seconds. Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the livers to cool for 15 minutes. Remove and discard the herbs, then chop the livers finely or pulse the mixture in a food processor. Taste and adjust the seasoning if necessary with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve at room temperature on toasted baguette slices. The chicken liver mixture will keep in the refrigerator for about a week.</p>"}]}