{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101207-tongue-tacos-de-lengua-primary.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["adobo", "chipotle", "cilantro", "lengua", "taco", "tacos", "tongue", "veal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Sous Vide Tacos de Lengua", "link": "https://www.seriouseats.com/recipes/2010/12/sous-vide-tacos-de-lengua-tongue-recipe.html", "description": "Not only does cooking a tongue sous-vide make for complete set-it-and-forget-it ease (as it does with any braised or confit dish), it also creates a more flavorful finished product as the tongue slowly stews in its own juices.", "totalTime": "3 days", "recipeYield": "4", "recipeCategory": ["Offal", "Sous Vide"], "recipeIngredient": ["1 cow or veal tongue, about 1 1/2 pounds", "Kosher salt and freshly ground black pepper", "6 stems cilantro", "1 medium onion, split in half", "1 roma tomato, split in half", "2 tablespoons duck fat, pork fat, or canola oil", "4 chipotle chilis in adobo sauce, plus 1 tablespoon sauce", "1 lime", "16 to 24 corn tortillas", "chopped onions, scallions, cilantro, and limes for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season tongue with salt and pepper and place in vacuum bag with cilantro, onion, tomato, and fat. Cook at 170°F until completely tender, at least 24 hours, and up to 48. Place bag in ice bath and cool completely, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open bag carefully and pour contents into large wire-mesh strainer set over bowl. Transfer tongue to cutting board and discard remaining solids. Carefully peel outer membrane off of tongue and discard. Chop tongue into 1/2-inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chipoles, adobo sauce, and half of liquid from tongue in blender and blend until smooth. Season to taste with lime juice and salt. Set aside. Combine tongue and remaining liquid in heavy-bottomed 10 or 12-inch skillet. Bring to a simmer over high heat, reduce to medium and cook, stirring frequently, until liquid is reduced and tongue has started to crisp, about 8 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, wrap a scoop of tongue in a double layer of corn tortillas. Top with chipotle sauce and diced onions, scallions, or cilantro as desired. Pass additional lime wedges.</p>"}]}