{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101216-128834-chicken-cutlets-with-creamy-Parmesan-dressing.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "mains", "poultry", "Super Bowl mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken Cutlets with Creamy Parmesan Dressing", "link": "https://www.seriouseats.com/recipes/2010/12/dinner-tonight-chicken-cutlets-with-creamy-parmesan-dressing-recipe.html", "description": "In this recipe I tackled chicken breast with a little help from Tyler Florence's latest cookbook <em><a href=\"http://www.amazon.com/Tyler-Florence-Family-Meal-Bringing/dp/1605293385\">Family Meal</a>.</em> In order to coax as much flavor out of the breast while keeping it as juicy as possible, he relies on a meat mallet and a classic bread-crumb coating: The mallet ensures the breasts are uniformly thick so that they're cooked evenly all the way through, and the flour, egg, and panko bread crumb coating help create a golden crust.", "totalTime": "35", "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["2 boneless, skinless chicken breasts, about 1 1/2 pounds", "1/2 cup all-purpose flour", "kosher salt and black pepper to taste", "2 eggs, lightly beaten", "1 cup panko bread crumbs", "Neutral oil for frying, such as peanut", " 4 anchovy fillets", "2 egg yolks", "1 clove garlic, smashed", "Juice of 2 lemons", "1/2 cup extra virgin olive oil", "1/4 cup grated Parmesan", "4 ounces salad greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken breasts between two pieces of plastic wrap and gently pound to uniform 1/2-inch thickness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put flour, eggs, and panko on three separate plates. Season flour with salt and pepper. Dredge chicken in flour, then egg, then panko, being sure to thoroughly shake off excess between each stage. Place breaded cutlets on a plate and transfer to refrigerator for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine anchovies, egg yolks, garlic, and lemon juice in blender or food processor and pulse until smooth, about 30 seconds.  With machine running, add olive oil in steady stream until thick, creamy, and emulsified. Transfer to bowl and whisk in Parmesan, then season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 cup oil over high heat in 12-inch skillet until shimmering, then lay cutlets in skillet, working in batches to avoid overcrowding if necessary.  Cook until golden brown and cooked through, 5 to 7 minutes per side. Center of breast should register 155°F on instant read thermometer.  Drain on paper towels, transfer to plates, and top with the greens tossed in dressing. Serve immediately.</p>"}]}