{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100402-seasian-potatorendang.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Asian", "keywords": ["Malaysian", "potatoes", "rendang", "Seriously Asian", "Seriously Malaysian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato Rendang", "link": "https://www.seriouseats.com/recipes/2010/04/potato-rendang-recipe.html", "description": "Learn more about how to make rendangs here. [Photograph: Chichi Wang]...", "totalTime": "", "recipeYield": "4 servings", "recipeCategory": ["Asian", "Potato", "Vegetarian"], "recipeIngredient": ["<strong>For the flavoring paste:</strong>", "1 can coconut milk, about 14 fluid ounces", "2 thick stalks fresh lemongrass, de-stemmed with the bristly tops cut off", "5 medium sized shallots, coarsely chopped", "3 cloves garlic, coarsely chopped", "1 piece turmeric, 2 inches long, peeled and coarsely chopped, or 1 1/2 teaspoons ground turmeric", "1 piece galangal, 2 inches long, peeled and thinly sliced", "1 1/2 pounds small potatoes, either fingerling, a baby variety, or peruvian blue"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, reduce the coconut milk: Pour it into a nonstick skillet and bring to a boil over medium heat. Reduce the heat to a simmer and cook uncovered, for fifteen or so minutes, until the milk has reduced a bit and swirls of oil begin to appear on the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the paste: Cut the aromatic part of the lemongrass into 1/4-inch thick slices. Place the cut lemongrass, shallots, garlic, turmeric, galangal, and chilies in a small food processor.  Pulse until the consistency is chunky-smooth, adding a teaspoon or so of water if necessary to get the paste moving along. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the paste to the coconut milk after it has been simmering for 15 minutes; then simmer for 30 minutes or so, until the liquid has reduced by 1/2.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the coconut milk is simmering, scrub the potatoes and slit them halfway through with a knife. When the coconut milk has reduced by half, add the potatoes and simmer, uncovered for 30 to 45 minutes, until the only the oil is left in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to low and saut&eacute; the potatoes in the remaining coconut oil. Continue to saut&eacute;, stirring the potatoes around every 5 minutes, until the skins are nicely browned&mdash;about 30 minutes longer. Allow the dish to rest for a few minutes, then serve.  </p>"}]}