{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100712-dt-roasted-beets-with-guajilo-dressing.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beets", "Dinner Tonight", "salads", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Dinner Tonight: Roasted Beet Salad with Guajilo Chile Dressing", "link": "https://www.seriouseats.com/recipes/2010/07/dinner-tonight-roasted-beets-salad-with-guajilo-chile-dressing-goat-cheese-recipe.html", "description": "Turns out the earthiness of beets plays superbly with the earthiness of dried chiles, which are the soul of this absolutely addicting dressing.  The result is sweet, vinegary, smoky, garlicky&mdash;it's wondrous. I'm going to start keeping this around all the time.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Salads", "Vegetarian"], "recipeIngredient": ["1 pound beets, washed and cut into small wedges", "3/4 cup oil (neutral, olive, or a combination)", "2 medium dried guajilo chiles (or substitute New Mexico chiles)", "2 garlic cloves, peeled and quartered", "1/4 cup sherry vinegar", "salt to taste", "4 handfuls beet greens, swiss chard, spring greens, spinach, or watercress", "2 ounces goat cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees.  Toss the beet wedges with olive oil and salt and arrange on a roasting pan or baking sheet.  Cover tightly with foil and cook in the oven until a fork easily penetrates, 30-45 minutes.  Remove the cover and cook for an additional 10 minutes to caramelize them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat the oil in a small skillet and add the garlic.  While it is heating, tear off the stems from the chiles and split them open, shaking out the seeds.  When the garlic is sizzling vigorously the oil is hot enough; lay the chiles flat in the oil and toast for about 30 seconds, until they smell \"toasty\" and and insides have turned lighter in color.  Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully transfer the chiles to a blender or small food processor and add the vinegar plus a teaspoon of salt.  Blend or process for 30 seconds.  Once the oil has cooled somewhat (at least 5 minutes) add it along with the garlic, then blend until smooth and emulsified.  It may take a minute or more.  Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using the beet greens or Swiss chard, add them to the skillet with 1/4 cup of water and a pinch of salt and cover.  Cook over medium heat until wilted, then uncover and cook until most of the liquid has evaporated.  Divide amongst plates, top with the beets and drizzle with plenty of dressing. Crumble goat cheese on the plate and serve.</p>"}]}