{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100727%20BlackandWhiteSweetRolls.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread baking", "buttermilk", "desserts", "rolls", "sweet rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Black and White Sweet Rolls", "link": "https://www.seriouseats.com/recipes/2010/07/bread-baking-black-and-white-sweet-rolls-recipe.html", "description": "When I was a kid, <strong>I absolutely loved marble poundcake.</strong> I loved the swirl as much as I liked the flavor. When I started thinking about creating a bread with a chocolate swirl, my first inclination was to make a loaf, just like those poundcakes I loved so much. But then I thought that fluffy sweet rolls would show off the swirl even better. And a pull-apart loaf is just plain fun.", "totalTime": "", "recipeYield": "makes 16 rolls", "recipeCategory": ["Bread Baking"], "recipeIngredient": ["<strong>For the dough:</strong>", "1 cup buttermilk", "1/4 cup sugar ", "2 1/2 teaspoons instant yeast", "1 teaspoon salt", "3 cups all purpose flour", "1 egg", "4 tablespoons butter, softened", "1 teaspoon vanilla", "<strong>For the light half:</strong>", "1 teaspoon almond extract", "<strong>For the dark half:</strong>", "1 tablespoon cold coffee (or water)", "1/4 cup cocoa", "<strong>For the filling:</strong>", "1/8 cup sugar ", "4 tablespoons butter, softened", "1/2 cup nuts, chopped", "<strong>For the icing:</strong>", "1 cup powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the buttermilk, sugar, and yeast in the bowl of your stand mixer and set aside for 15 minutes until it becomes bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt, flour, and egg, and knead until the mixture becomes elastic. Add the butter and vanilla, and continue kneading until the butter and vanilla are fully incorporated and the mixture is smooth, elastic, and no longer sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove half of the dough from the mixer bowl and set aside while you work on the remaining half. Add the almond extract to the dough in the bowl and knead until it is completely incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move the almond dough to an oiled bowl, cover with plastic wrap, and set aside until doubled, about 90 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the other half of the dough into the bowl, add the cocoa and the coffee (or water) and knead until the chocolate is completely incorporated. Drizzle with a little oil to coat the dough, cover with plastic wrap, and set aside to rise along with the first dough, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325 degrees. If you want the extra insurance, spray a baking pan with baking spray. I used a 9-inch square pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the doughs have risen, flour your work surface and roll out the almond dough to a rectangle about 10 x 12 inches. Spread the 4 tablespoons of softened butter on the dough, then sprinkle with the 1/8 cup of sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, roll out the chocolate dough to the same size, and arrange it on top of the almond dough. Sprinkle with with chopped nuts, leaving about 2 inches bare on the long side. Roll the dough again with your rolling pin to press the nuts into the dough and to adhere the two layers. Roll so that you're increasing the length to about 16 inches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll up the dough, jellyroll-style starting on the long side, rolling towards the portion you left free of nuts so that you have a log that's 16 inches long. Pinch to seal the seam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the log into 16 pieces, about 1 inch high, and place them in your baking pan. If you've used square pan, you'll have four rows of four.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan with plastic wrap and set aside to rise, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 325°F for 40 to 45 minutes, until nicely browned. About 10 minutes before you're done, you can brush the tops of the buns with some melted butter for a softer crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the powdered sugar with enough water to make it pourable. If you like, add some almond extract, vanilla, or coffee for a little more flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the buns from the pan and set on a rack. Let cool slightly, then drizzle with the icing.</p>"}]}