{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100222appletartlets.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["apples", "desserts", "goat cheese", "honey", "puff pastry", "sweet and savory", "tarts", "The Crisper Whisperer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Apple, Goat Cheese, and Honey Tartlets", "link": "https://www.seriouseats.com/recipes/2010/02/the-crisper-whisperer-apple-goat-cheese-and-honey-tartlets-recipe.html", "description": "I love a simple dessert that is not too sweet, and I love a cheese plate even more. These little beauties are both, rolled into one irresistibly dissonant individual serving. I knew I would have to make them soon. Now you can, too.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Apple", "Crisper Whisperer", "Desserts"], "recipeIngredient": ["1 fourteen-ounce package puff pastry (single sheet), defrosted", "4 ounces fresh goat cheese", "1 tablespoon fresh lemon juice", "Scant 1/4 teaspoon kosher salt", "1 Gala apple, peeled, quartered, and sliced", "1 tablespoon butter", "2 tablespoons honey, plus more for drizzling", "Light dusting of ground allspice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Unfold the puff pastry onto a cutting board. Using a 5-inch cookie cutter (or an overturned bowl and a small, sharp knife), cut four 5-inch circles from the dough. Place the rounds on a parchment-lined cookie sheet. Press a 3 1/2-inch cookie cutter into the center of each round, stopping 3/4 of the way down so that the outer and inner portions are still attached at the bottom. This will allow the outer ring to rise around the center. Pierce the inner section of each round all over with a fork. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the goat cheese, lemon juice and salt in a small bowl. Microwave for 20 seconds or until soft but not melted. Stir to combine well, then divide and spread over the inner section of each round. Top with overlapping apple slices, making sure to stay within the inner section of each round. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the butter and honey in a small bowl and microwave for 30 seconds, or until the butter is almost melted. Stir to combine and complete the melting. (Be careful, as the honey gets hot surprisingly quickly.) Brush some honey butter over the entirety of each round. Dust lightly with ground allspice. Bake for 25 minutes, or until the apples are tender and the pastry is nicely browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the pastries cool slightly, then drizzle with additional honey if desired. Serve warm or at room temperature.</p>"}]}