{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100122-mushroomoliveleekrisotto.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Cooking Under Pressure", "leeks", "Lorna Sass", "mushrooms", "olives", "rice", "risotto", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Risotto with Mushrooms, Olives, and Leeks", "link": "https://www.seriouseats.com/recipes/2010/01/risotto-with-mushrooms-olives-and-leeks-recipe.html", "description": "\"The texture was perfectly creamy, as any good risotto should be.\" [Photograph: Caroline Russock] For our final pressure cooker vs. traditional cooking methods face-off, I decided to focus on risotto. If you've ever made risotto at home you know making...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Mushrooms", "Olives", "Pressure Cooker", "Rice", "Vegetarian"], "recipeIngredient": ["1 tablespoon unsalted butter", "1 tablespoon olive oil", "2 medium leeks, white part only, thoroughly rinsed and thinly sliced (about 1 1/2 cups)", "1 1/2 cups Arborio rice", "1/2 pound of mushrooms, stems reserved for another use, caps thinly sliced", "1/4 cup pitted, minced black olives, preferably oil-cured", "3 1/4 to 3 1/2 cups vegetable or chicken broth or bouillon", "1/3 to 1/2 cup grated Parmesan", "Salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter and oil the cooker.  Saute the leeks until soft but not browned, about 2 minutes.  Stir in the rice, making sure to coat thoroughly with the fat.  Stir in the mushrooms, olives, and 3 1/4 cups of the broth (watch for sputtering oil).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lock the lid in place and over high heat bring to high pressure. Adjust the heat to maintain high pressure and cook for 4 minutes. Reduce the pressure by placing the cooker under cold running water. Remove the lid, tilting it away from you to allow steam to escape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The risotto will be fairly soupy at this point.  Set the cooker over medium-high heat and boil uncovered, stirring vigorously every minute, until the mixture thickens and the rice is tender but still chewy, 3 to 5 minutes.  Add a bit more broth if the mixture becomes dry before the rice reaches the desired consistency.  Turn off the heat, stir in the Parmesan, and add salt to taste (if desired).  Serve immediately.</p>"}]}