{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100716-ice-cream-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["desserts", "frozen desserts", "ice cream", "summer", "summer desserts", "The Food Lab", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "8"}, "name": "New England&ndash;Style Frozen Custard Without an Ice Cream Machine", "link": "https://www.seriouseats.com/recipes/2010/07/vanilla-ice-cream-without-the-machine-recipe.html", "description": "This ice cream is the real deal. [Photograph: Kenji Alt] The Secret to No Machine Ice Cream is Here....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts", "The Food Lab"], "recipeIngredient": ["8 large egg yolks", "1 cup sugar", "2 teaspoons vanilla extract", "1/4 teaspoon kosher salt", "1 (12-ounce) can evaporated milk", "2 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl or stand mixer fitted with whisk attachment, whisk egg yolks, sugar, vanilla, and salt until pale yellow and mixture falls off of whisk in thick ribbons, about 5 minutes. Set aside. Stirring constantly, heat evaporated milk in medium saucepan on stovetop until it comes to a simmer. Slowly add hot milk to egg mixture, whisking constantly, until fully incorporated. Transfer mixture back to saucepan and heat, whisking constantly, to 180°F (it should become thick and custardy). Do not overheat, or eggs will scramble. Chill mixture completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip 1 cup heavy cream with whisk or in stand mixer until doubled in volume. Add whipped cream to egg mixture and fold with whisk just until no lumps remain. Pour mixture into ice cube trays and freeze for 4 hours, or until solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine frozen cubes of ice cream (use a spoon or a dull knife to remove them) and remaining heavy cream in food processor and process until smooth, about 30 seconds, scraping down sides and breaking up lumps as necessary during process. Transfer mixture to quart container, and freeze for at least 4 more hours before serving.</p>"}]}