{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100628-wok-skills-steaming-gyoza.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["dumpling", "gyoza", "pork", "scallion", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Simple Pork and Scallion Dumplings", "link": "https://www.seriouseats.com/recipes/2010/06/simple-pork-and-scallion-dumplings-recipe.html", "description": "Homemade dumplings, better than the ones you bought in the freezer section", "totalTime": "", "recipeYield": "about 75 dumplings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Pork"], "recipeIngredient": ["1 pound pork shoulder or pork belly, trimmed of connective tissue, but with fat intact, cut into 1-inch cubes", "1 1/2 teaspoons kosher salt", "1/4 pound slab bacon, cut into 1/2-inch cubes, frozen", "1 egg", "2 tablespoons chicken stock, pork stock, or cold water", "1 tablespoon Shaoxing wine or dry sherry", "2 teaspoons soy sauce", "1/2 teaspoon sugar", "16 scallions, white and green parts, finely sliced", "Round dumpling wrappers (either store-bought, or <a href=\"http://www.seriouseats.com/recipes/2009/09/lamb-dumplings-recipe-asian-cooking.html\">homemade</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss cubes of pork and salt in a medium bowl. Spread the pork pieces on a rimmed baking sheet, leaving space between the pieces than place in the freezer for 15 minutes until just starting to freeze, but still pliable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of food processor, combine salted pork, bacon, egg, stock, soy sauce, and sugar. Process until a rough puree is formed and pieces of pork are no larger than 1/8th of an inch, about 20 seconds. Add leeks to food processor and pulse until evenly incorporated, about 6 one-second pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with a few skins at a time, place approximately 1 tablespoon of filling in the center of each wrapper. Use your finger to spread a small amount of water around the edge of each wrapper. Seal wrappers by folding in half and pleating one side 5 or 6 times, pinching the edges together as you go. Place finished dumplings on a parchment-lined baking sheet, separating them to avoid sticking, and covering the whole thing with a clean, damp washcloth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a bamboo steamer with wilted cabbage or lettuce leaves, or create a <a href=\"http://www.seriouseats.com/2010/06/how-to-steam-in-a-wok.html\">parchment liner</a>. Place dumplings in steamer, leaving a small gap between each one a place over a wok of simmering water. Steam for 7 to 9 minutes until skins are translucent and filling is cooked through. Serve immediately with soy sauce, chili paste, Chinkiang vinegar, black vinegar, or plain rice vinegar.</p>"}]}