{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101001_baconpotatosalad.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["cilantro", "Dinner Tonight", "mayonnaise", "poblano peppers", "potato salad", "potatoes", "Rick Bayless"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted New Potato Salad with Poblano Mayo", "link": "https://www.seriouseats.com/recipes/2010/10/roasted-new-potato-salad-with-poblano-mayo-recipe.html", "description": "Potato salad, so often sad and boring, is infused with roasted garlic and covered with a spicy poblano mayonnaise. What's so fascinating about this recipe is how everything is cooked on one baking sheet.", "totalTime": "", "recipeYield": "4 people", "recipeCategory": ["Bacon", "Dinner Tonight", "Potato Salad"], "recipeIngredient": ["1 1/2 pounds small new potatoes, cut into bite size pieces (if necessary)", "Vegetable oil ", "Kosher salt and freshly ground black pepper", "2 large poblano chiles", "4 garlic cloves, peeled", "4 green onions, roots and wilted outer leaves removed, chopped into 1/2-inch pieces", "1 egg yolk ", "1/4 cup light vinegar (rice vinegar or Spanish cava vinegar)", "1 cup olive oil ", "1/4 cup cilantro, chopped", "4 slices of cooked bacon, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 375°F. Toss  potatoes on one side of roasting pan and drizzle with vegetable oil. Season with salt and pepper. Roast for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the baking sheet from the oven. Toss the poblanos and garlic with a little more vegetable oil and place on the other side of the baking sheet. Add the green onions on top of the new potatoes. Place back in the oven and cook until the potatoes are tender, the poblanos are evenly blistered, and the garlic is soft, about 20 minutes. Remove from the oven and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel off the blackened skin from the poblanos, and discard the seeds and stems. Chop the poblano and place half in a blender along with the roasted garlic, egg yolk, vinegar, and 1/2 teaspoon salt. Blend until smooth. While still running, slowly drizzle in the olive oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss potatoes, green onion, cilantro, and the rest of the roasted chile into a medium bowl. Add a half cup of the poblano mayonnaise and stir until thoroughly coated. Serve with the crumbled bacon.</p>"}]}