{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/031010-dt-porkchopswithcarrotsbeets2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beets", "carrots", "Dinner Tonight", "pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Roasted Carrots and Beets with Pork Chops", "link": "https://www.seriouseats.com/recipes/2010/03/roasted-carrots-and-beets-with-pork-chops-recipe.html", "description": "What initially attracted me to this recipe from <strong>Jamie Oliver</strong> were the vegetables. The pork chops seemed like an afterthought. <strong>But man, that pork chop.</strong> Maybe I just haven't had a juicy one in a while. It was greedy and indulgent, and sometimes you're just in that kind of mood.", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Mains", "Pork"], "recipeIngredient": ["3/4 pounds carrots, peeled", "3/4 pounds beets", "salt and black pepper", "1/2 bulb garlic, cloves smashed", "Extra-virgin olive oil", "1/2 orange, juiced", "1 sprigs of fresh thyme", "1 sprigs fresh rosemary", "2 1/2 tablespoons balsamic vinegar", "2 thick pork loin chops", "4 fresh sage leaves", "1/2 lemon, juiced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the over to 425°F. Meanwhile, bring two pots of water to a boil. Add the carrots to one pot and the beets to the other. Let both pots cook over medium-high heat for 15 to 20 minutes, or until both are tender. Drain each and place in separate bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the carrots into quarters. Immediately toss them with half of the smashed garlic, a tablespoon or so of olive oil, the orange juice, thyme, and a pinch of salt and pepper. Toss well and transfer to one end of a large baking sheet. Then peel the beets, quarter them, and toss them in another bowl with the other half of smashed garlic, the rosemary, balsamic vinegar, and a pinch of salt and pepper. Transfer these to the other half of the large baking sheet. Place in the oven and cook for 30 minutes, or until golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With 15 minutes left, season the chops with salt and pepper, and place the sage leaves in the center of the both sides of all the chops. Pour a tablespoon or so of olive oil into a large, oven safe skillet, set over medium-high heat. Add the chops and cook for about 4 to 6 minutes, or until nicely browned on one side. Flip the chops, and then transfer the skillet to the oven. Let them cook for 10 to 12 minutes or until the internal temperature is 140°F. Then remove the chops, pour out any fat in the skillet, and then pour in the lemon juice. Scrap up any browned bits and pour over the chops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the chops with the roasted vegetables. Season with salt and pepper to taste.</p>"}]}