{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101025-morcillasalad.jpg", "author": {"@type": "Person", "name": "Andrea Lynn"}, "recipeCuisine": "", "keywords": ["salads", "sausage", "Serious Heat", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Morcilla Salad with Beets, Fennel and Walnut-Tequila Vinaigrette", "link": "https://www.seriouseats.com/recipes/2010/10/morcilla-salad-with-beets-fennel-and-wa.html", "description": "Morcilla sausage. [Flickr: scaredykat] This recipe is adapted from chef Lucio Palazzo of Xochitl Restaurant in Philadelphia and is on the menu for the restaurant's Day of the Dead celebration. According to Palazzo, morcilla is a spicy pork blood sausage...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Salads", "Serious Heat"], "recipeIngredient": ["<strong>For the vinaigrette:</strong>", "1 cup walnuts, dry toasted", "1 cup tequila Añejo or Reposado", "2 tablespoons red wine vinegar", "1 tablespoon whole grain or Dijon mustard", "3 ancho chiles, stemmed and seeded", "1 chipotle morita, stemmed and seeded", "1 cup vegetable oil", "Salt ", "<strong>For the salad:</strong>", "5 medium red beets", "Salt", "1 head of fennel, fronds removed, some reserved for garnish", "1 small red onion", "4 links good-quality morcilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the dressing: On a griddle or in a cast iron pan, pressing with a spatula, toast the chiles for 30 seconds or so on each side until they begin to blister and emit a small wisp of smoke.  Soak them in a container submerged with hot water for 30 minutes. In a small saucepot, ignite the tequila to burn off the alcohol, and reduce by two thirds.  Place the walnuts in a blender, along with the mustard, vinegar, reduced tequila, and soaked chiles (you can discard the soaking liquid, or use it to thin out the vinaigrette if the results are a little too thick). Purée with some oil, and continue adding the oil in a slow stream until the dressing is emulsified.  Season with salt to taste and check for acidity, adjusting with vinegar or lime juice if necessary.  A small pinch of sugar may be nice here, as well.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the salad: Preheat the oven to 350 degrees. Rinse the beets well, remove the tops if they are still attached, and, while still wet, coat the beets liberally with salt.  Salt roast for about an hour, depending on the size of the beets, or until they are fork tender. Peel the beets, and shave them with a mandolin, or slice them thinly with a knife.  Using the mandolin, or a knife, slice the fennel across the grain and slice the red onion to the same thickness of the beet slices.  In one bowl, place the beets, in another, the fennel and onion.  This will prevent staining the lighter colored components beet red, and preserve the attractive colors reminiscent of the Mexican flag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a griddle or cast iron pan, lay down a thin film of oil, and cook the morcilla, crisping up the casing of the sausage.  It may be finished in the oven, but take care not to burst the casing.  Remove the sausages from the heat, allow to rest for a minute while you dress your salad. In the bowls with the beets and fennel, place a spoonful of dressing, along with the herbs.  Season with salt, and toss until you are satisfied.  On four plates, drag some of the dressing under where you plan to plate the morcilla, and off to the side build your salad, alternating layers of beet and fennel in an appealing way.  Slice your morcilla on the bias, and fan out over the drag of dressing.  Garnish with chopped walnuts, or, for a refined look, use a microplane to make it rain walnuts all over the plate.  Make sure to set out an extra plate, as well as a glass of water and a beer for the spirit of the dead that will be joining your feast.  </p>"}]}