{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100408blueribbonmarrowbones.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bone marrow", "Bromberg Bros. Blue Ribbon Cookbook", "Bruce Bromberg", "Cook the Book", "Eric Bromberg", "oxtail"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Beef Marrow Bones with Oxtail Marmalade", "link": "https://www.seriouseats.com/recipes/2010/04/beef-marrow-bones-with-oxtail-marmalade-recipe.html", "description": "Before I had ever eaten bone marrow, one of my friends compared it to <strong>meat butter.</strong>  Having never experienced it for myself I was immediately sold on his description.  What could be better than meat butter? With this concept permanently in my subconscious, I made the <strong>Beef Marrow Bones with Oxtail Marmalade</strong> served at <a href=\"http://www.blueribbonrestaurants.com/rests_brass_man_main.htm\">Blue Ribbon Brasserie</a>. The dish was kind of like butter and jam&mdash;but made entirely from animal protein.", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Beef", "Cook the Book"], "recipeIngredient": ["<strong>For the marrow bones:</strong> ", "3 pounds center-cut beef marrow bonescut into 2-inch pieces, tendons trimmed (ask your butcher to do this)", "1/4 cup kosher salt, plus more if needed", "<strong>For the oxtail marmalade:</strong>", "4 pounds oxtail, trimmed of fat", "6 cups port wine", "6 cups dry red wine", "4 quarts veal or chicken stock, homemade or purchased", "1 head of garlic, halved crosswise", "1/2 bunch of fresh thyme", "1 tablespoon black peppercorns", "8 tablespoons (1 stick) unsalted butter", "3 tablespoons all-purpose flour", "1 1/2 pounds carrots, peeled, trimmed, and cut into ¼-inch cubes (about 4 cups)", "1 pound shallots, peeled and cut into ¼-inch cubes (about 4 cups)", "1 1/2 teaspoons kosher salt, plus more to taste", "1/2 cup granulated sugar", "1/2 cup (packed) light brown sugar", "1 cup red wine vinegar", "2 1/2 teaspoons freshly ground black pepper, plus more to taste", "3 slices challah bread, homemade or you favorite store-bought soft loaf, toasted and still warm, cut into quarters", "Chopped fresh flat-leaf parsley leaves, for serving", "Fleur de sel or other good-quality coarse sea salt, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bones in a large bowl. Combine the salt with 4 cups cold water; pour over the bones. If the water does not cover the bones, add a solution of 1 cup water to 1 tablespoon salt at a time, until the bones are covered. Soak in the refrigerator for 36 to 48 hours, changing the water three</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>times, until the bones are bleached of color. Drain well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the oxtail, 3 cups of the port, the red wine, veal stock, garlic, thyme, and peppercorns in a large pot. Bring the mixture to a boil, reduce the heat, and simmer for 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the oxtail to a bowl; when cool enough to handle, remove the meat from the bones and cut it into small cubes. Refrigerate the meat until ready to</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>use. Strain the oxtail liquid into a large skillet, discarding the solids. Bring the liquid to a boil over high heat; reduce the heat to medium and simmer until the mixture is reduced to 3 cups, 1 1/2 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While it reduces, combine 3 tablespoons of the butter with the flour until it forms a paste. Whisk the paste, 1 tablespoon at a time, into the reduced liquid</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>over medium heat. Cook until the mixture thickens slightly, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate large skillet, melt the remaining 5 tablespoons butter. Add the carrots, shallots, and a pinch of salt over medium heat until slightly softened,</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>about 15 minutes. Stir in the sugars, the remaining 3 cups port, the vinegar, the 1 1/2 teaspoons salt, and 1 1/2 teaspoons of the pepper. Cook over medium-high heat until the liquid has completely evaporated, about 45 minutes. Stir in the oxtail meat, thickened oxtail cooking liquid, and remaining 1 teaspoon pepper.  Taste and adjust the seasonings if necessary. Set aside or transfer the marmalade to an airtight container and refrigerate overnight. (Before serving, reheat in a saucepan over medium heat until warmed through.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the bones and challah toasts on the platter. Spoon oxtail marmalade in between the bones (reserve remaining marmalade for another use).  Sprinkle with chopped parsley and coarse sea salt.</p>"}]}