{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101004PoissonALaCreme610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French in a Flash", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Bernadette's Poisson à la Crème", "link": "https://www.seriouseats.com/recipes/2010/10/french-in-a-flash-bernadettes-poisson-a-la-creme-recipe.html", "description": "A fresh take on an old family recipe, fish baked in crème fraîche with garlic and basil and tomatoes makes a 15-minute weeknight recipes something elegant and decadent.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Fish", "French"], "recipeIngredient": ["4 8-ounce boneless and skinless fillets of white fish, such as red snapper or hogfish ", "Sea salt", "Freshly cracked black pepper", "1 cup crème fraîche", "2 to 3 cloves of garlic, finely grated on a Microplane", "4 tablespoons (1/2 stick) unsalted butter, divided", "2 1/2 cups grape tomatoes (about 40), cut in half", "Pinch of granulated sugar", "1/2 cup chiffonade of fresh basil (from about 16 basil leaves)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 425&deg;F. Pat fish dry with paper towels and season with salt and pepper.  Combine garlic and crème fraîche together in small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a ceramic oven-safe baking dish on the center rack of the hot oven for 5 minutes.  You can use either individual ceramic oval baking dishes (5 1/2 by 8 inches), or a large ceramic baking dish (9 by 13 inches). Add 2 tablespoons butter to hot dish (or between the four individual dishes), using wooden spoon to spread butter over bottom of baking dish. Place fish skin-side-down on the buttered baking dish. Cover with the crème fraîche. Bake until the fish is just cooked though (opaque and flaky), about 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in an 8 1/2-inch sauté pan, melt the remaining butter over medium-low heat. Add the tomatoes with a pinch of sugar and a pinch of salt. Cover and cook until the tomatoes soften and burst, about 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove fish from oven, sprinkle with basil, and spoon tomatoes over the top. Serve immediately with warm, crusty bread.</p>"}]}