{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/dressed%20up%20white%201.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "white bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Dressed-Up White Bread", "link": "https://www.seriouseats.com/recipes/2010/08/bread-baking-dressed-up-white-bread-recipe.html", "description": "If you're going to serve a loaf of bread to company, <strong>why not make it pretty as well as delicious?</strong> This one looks impressive, but it's simple to do. And while it's a dressy-looking bread for dinner, the leftovers are perfect for breakfast toast or lunch sandwiches. If you don't need a fancy loaf, you can skip the snipping and make it a plain loaf. <strong>Or use the snipping technique with your own favorite bread recipe.</strong>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons active dry yeast", "1 tablespoon brown sugar", "1/2 cup (2 1/2 ounces) semolina flour", "1/2 cup quick cooking rolled oats", "2 cups (9 ounces) bread flour", "1 large egg", "1 1/2 teaspoons kosher salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine water, yeast, and sugar. Stir to combine and set aside for 10 minutes until it is bubbly and frothy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the semolina and oatmeal, stir to combine, and set aside for another 10 minutes, until the oatmeal softens and the mixture is bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bread flour and the egg, and knead with the dough hook until the mixture begins to get elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt and the olive oil and continue kneading until the mixture is elastic and no longer sticky. There may be some nubby lumps from the oatmeal, but the dough itself should be smooth and stretchy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a ball and put it back into the mixer bowl (or a clean bowl, if you prefer) drizzle it with a bit of olive oil, and cover the bowl with plastic wrap. Set it aside to rise until doubled, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 350 degrees and sprinkle some cornmeal on a sheet pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some flour on your work surface. Take the dough out of the bowl, knead it a bit, and form it into a smooth, tight ball. Place it on your sheet pan, seam-side down. Cover with plastic wrap and set aside until doubled, about 30 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a small, sharp pair of scissors, starting at the top of the loaf, make a series of snips around the loaf. You can make as many as you like, make them as large or small as you like, in any pattern.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I made rows of concentric circles around the loaf, but you could do lines down the loaf, or a spiral pattern.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 350 degrees for about 40 minutes, until the loaf is golden brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool completely on a wire rack before slicing.</p>"}]}