{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100711muhammara.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["dips", "red peppers", "turkish", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mediterranean Flavors: Roasted Red Pepper Spread", "link": "https://www.seriouseats.com/recipes/2010/07/roasted-red-pepper-spread-dip-recipe.html", "description": "<strong>Muhammara</strong> is a spread composed of roasted red peppers and walnuts. It's soaked and bound with a healthy amount of olive oil and <em>nar ekşisi</em>, pomegranate juice reduced to a thick syrup. It's tart, sweet, and rich&mdash;a salad dressing all on its own. Surprisingly affordable and versatile, it demands inclusion in your pantry. Kick out a vinegar if you have to.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Condiments and Sauces", "Tastes of the Mediterranean", "Vegetarian"], "recipeIngredient": ["4 large red peppers, cut in half lengthwise and seeds removed", "2 cups of pecans or walnuts, finely chopped", "1 cup of stale bread cut into 1/4 inch cubes", "1/2 of a small red onion, if you like and aren’t making this in advance", "1 handful of chopped parsley", "3 tablespoons of <em><a href=\"http://www.amazon.com/Sultan-Pomegranate-Molasses-9-5fl-oz/dp/B000LRKO9E\">nar ekşisi</a></em>", "1/4 cup of extra virgin olive oil; use more or less as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread some olive oil on a roasting pan and roast the peppers in a 450&deg;F oven for 25 to 30 minutes, or until the skins are blackened and the flesh offers no resistance to a knife. You can also <a href=\"http://www.seriouseats.com/2010/07/how-to-roast-peppers.html\">roast the peppers whole over a gas stove.</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the peppers have cooled enough to handle, remove most of the blackened skins, but leave some on if you like for a charred flavor. Roughly dice the peppers, then transfer them to a large cutting board with the other dry ingredients. Run across it all with a sharp knife until you have a slightly cohesive mass with chunks smaller than peas. Don’t over-mince. You can do this in a food processor, but go with brief pulses and the understanding that you may have to do the last bit of mincing by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to a large bowl and add the <em>nar ekşisi</em> and salt to taste. Drizzle in enough olive oil to make a cohesive mass. Let the bread soak in the juices for a couple minutes, then serve.</p>"}]}