{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100720pestopasta.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "pasta", "pesto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Pumpkin Seed Pesto", "link": "https://www.seriouseats.com/recipes/2010/07/eat-for-eight-bucks-pumpkin-seed-pesto-pasta-vegetarian-recipe.html", "description": "Last week I finally got around to whipping up some <strong>pesto with pumpkin seeds</strong>, playing the part of pine nuts, and now I am smitten. I've tossed it with cold whole wheat couscous, twice I've stirred it into pasta, and I've eaten it by the spoonful while the baby begged for her fair share. With plain sliced tomatoes, pasta with pesto becomes a simple but filling celebration of summer.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Eat for Eight Bucks", "Pasta", "Pesto", "Pumpkin", "Vegetarian"], "recipeIngredient": ["1/4 cup pumpkin seeds", "2-4 cloves garlic, depending on size, age, and your preference ", "Scant 1/2 teaspoon salt", "5 or 6 black peppercorns", "2 cups basil leaves, roughly chopped and loosely packed", "Olive oil", "1/2 cup freshly-grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly toast the pumpkin seeds in a small skillet over medium heat, shaking every now and then. Toast until they become fragrant or begin popping--just a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, put the garlic, salt, and peppercorns into a mortar and pound to a paste. (I have been using 4 smallish cloves of juicy young garlic with mouthwateringly pungent results.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the toasted pumpkin seeds in the bowl of a food processor and pulse until they are about the size of large breadcrumbs. Add the basil and the garlic-salt puree; pulse until the mixture looks evenly combined, but stop well short of a puree. Drizzle 1/4 cup olive oil evenly over the contents of the food processor and pulse to combine again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the pesto into a medium bowl and stir in the Parmesan. Taste for salt and pepper and add more oil, if necessary, to achieve your desired taste and texture.</p>"}]}