{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100729-cardamom-primary.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Indian", "keywords": ["black cardamom", "collard greens", "Indian", "Spice Hunting", "spices", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Collard Greens Braised in Coconut Milk and Tomato", "link": "https://www.seriouseats.com/recipes/2010/07/collard-greens-braised-in-coconut-milk-and-tomato-recipe.html", "description": "Black cardamom imparts a smokey, camphorous flavor to foods, which I like to use as a subtler substitute for other smoked ingredients. While I realize that for most people who do so, having too many smoked pig parts in their...", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Indian", "Leafy Greens", "Sides", "Vegetarian"], "recipeIngredient": ["2 large bunches of collard greens, cut into inch-thick ribbons", "2 large yellow onions, sliced into thin half-moons", "4 plum tomatoes, diced (about 1 15 oz. can of diced tomatoes)", "1 13.5 oz. can of coconut milk", "1 teaspoon of cumin seeds", "1 pinch of asafoetida", "3 black cardamom pods", "1 tablespoon coriander seeds, toasted and ground", "1 teaspoon ground medium-hot chile, or half-sharp paprika", "Juice of half a lime", "1/3 cup of oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, heat the oil on medium-high. Toss in a cumin seed. When it cracks and sizzles, add in the rest of the cumin, asafoetida, and black cardamom. Stir 30 seconds, then add the remaining spices. Let them cook for another 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onions and a pinch of salt. Cook the onions on medium, stirring every now and then, till they’ve softened significantly and have started to brown. Add the tomatoes with another small pinch of salt and cook till softened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add collards by the handful, coating them in oil as you go, till all are incorporated. Add another small pinch of salt, the coconut milk, and 1/4 cup of water. Stir to combine, then cover and cook for about 40 minutes, or until the greens are tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift the lid and check for seasoning. You can reduce the sauce if you like, but this is intended to be served over rice, so it should be a little loose. Just before serving, stir in the lime juice.</p>"}]}