{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100328-nastybits-choppedliver.JPG", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["chopped liver", "gribenes", "liver", "offal", "schmaltz", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Chopped Liver with Gribenes", "link": "https://www.seriouseats.com/recipes/2010/03/the-nasty-bits-chopped-liver-recipe.html", "description": "I have been waiting for years to use the expression <strong>\"What am I, chopped liver?\"</strong> It's my <em>hasta la vista,</em> if you will, the one sentence that I see myself saying with gusto in imagined social settings. Part of the attraction stems from the paucity of <strong>colloquialisms out there that make references to offal.</strong> I finally found an opportunity to use it last week, and afterward, I went home to make this <strong>chopped liver recipe</strong> to celebrate.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Offal", "The Nasty Bits"], "recipeIngredient": ["1 pound chicken livers", "1/2 pound onions, thinly sliced", "2 ounces chicken skin, or vegetable oil", "1 boiled egg", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a saute pan over low heat and add the oil.  Add the chicken skin to the pan and slowly render the fat from the skin, turning the pieces of skin every few minutes.  Saute the skin in the chicken fat until the pieces are golden brown.  Remove the skin and set aside.  Pour off all but one tablespoon of the liquid chicken fat, reserving the rest of the fat for later use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pan over medium heat.  Pat the chicken livers dry with a paper towel and add to the pan.  Saute over medium-high heat until the surface is golden brown and the interior is still slightly pink, about 4 minutes.  Remove the livers from the pan and set aside.  The livers will still be cooking slightly as you remove them, making the interiors perfectly tender.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cooked chicken livers, sauteed onions, crispy chicken skin, and boiled egg on a clean cutting board.  Using a knife, rock the blade back and forth, finely chopping the mixture until it reaches a fine consistency.  Transfer the mixture to a bowl and blend further with a spoon.  Dribble in the reserved chicken fat until the mixture is creamy.  Add salt and pepper to taste.  Remember that the chopped liver will be served chilled, so salt a little more aggressively than usual.</p>"}]}