{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100524creampie.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bananas", "Cakespy", "cookie crusts", "cream pies", "crusts", "desserts", "peanut butter", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Banana Cream Pie in a Chocolate Peanut Butter Cookie Crust", "link": "https://www.seriouseats.com/recipes/2010/05/cakespy-banana-cream-pie-in-a-chocolate-peanut-butter-cookie-crust-recipe.html", "description": "Please, stop using banana bread as the final resting place for your ripe bananas. Because there's a much sweeter option: <strong>namely, banana cream pie. In a chocolate peanut butter cookie crust.</strong> This concoction combines the classic idea of combining rich, creamy banana pudding with cookies, but in a far more decadent way.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Banana", "Cakespy", "Nuts"], "recipeIngredient": ["<strong>For the crust:</strong>", "4 tablespoons butter", "1 1/2 cups crushed chocolate peanut butter cookies (I used <a href=\"http://www.cakespy.com/blog/2010/5/18/sweet-obsession-chocolate-peanut-butter-cookies-inspired-by.html\">these ones</a>—but you'd probably be fine using regular peanut butter cookies, too)", "<strong>For the filling:</strong>", "<small>Adapted from <em>DamGoodSweet: Desserts to Satisfy Your Sweet Tooth, New Orleans Style</em> by David Guas and Raquel Pelzel.</small>", "5 large egg yolks", "1/2 cup sugar", "1/4 cup cornstarch", "1/4 teaspoon salt", "1 1/2 cups whole milk", "1/2 cup cream", "3 tablespoons rum (the original recipe calls for banana liqueur; rum worked)", "2 teaspoons vanilla extract", "2 tablespoons unsalted butter", "2 ripe bananas, mashed", "<strong>To garnish (optional)</strong>", "Whipped cream", "Pecans or walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the crust. Preheat oven to 350&deg;F. Generously butter a 10-inch pie plate. In a medium bowl, mix together cookie crumbs, melted butter, until evenly mixed. Pat the mixture in the bottom and up the sides of your prepared pie plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate for 20 minutes to firm the crust, then bake it in your preheated oven until it feels lightly crisp--about 8-10 minutes. Let cool while you prepare the filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the filling. Whisk the egg yolks, sugar, cornstarch, and salt together in a medium bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the milk and cream to a boil in a medium saucepan, heating it up on medium heat so it gradually comes to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk a little of the hot liquid into the egg mixture, mixing quickly and thoroughly so that the eggs don't scramble. Once the bottom of the bowl is warm, slowly whisk in the rest of the hot milk. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly rinse your saucepan or grab another clean one--using a clean saucepan will assure that you don't scorch your pudding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the liqueur or rum  and whisk over medium heat until it thickens, about 2 minutes. Cook while constantly whisking until the pudding is glossy and thick, 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk in the butter, vanilla, and mashed bananas. The mixture is going to become quite thick, but will have some lumps from the banana. This is ok--whipped cream will top this uneven look easily, and the thick, rich banana flavor will truly reward you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the pudding over the prepared crust. Put it in the fridge, and cover with plastic wrap after about 15 minutes (long enough to keep it from steaming it up right away). This will keep it from forming a skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let chill in the refrigerator for 4 hours before serving. </p>"}]}