{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100715-pork-chop-sous-vide.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Sous Vide 101: Spicy Rubbed Pork Chops with BBQ Sauce", "link": "https://www.seriouseats.com/recipes/2010/07/sous-vide-101-spicy-rubbed-pork-chops-with-bbq-barbecue-sauce-recipe.html", "description": "Modern pork chops are not forgiving. Back in the day, pigs used to be tough and fatty. They walked five miles each way through sleet and snow in bare feet just to get to the slop pit. They were lucky to get a single patch of dry mud to roll in. <strong>You could cook the bejeezus out of their loins and they'd still be juicy</strong> (albeit tough) from all the melted fat and connective tissue. <strong>Today's pampered pigs, on the other hand, are lean, white, and delicate.</strong> Overcook them just a shade, and you're left masticating wet cardboard. <strong>Enter <a href=\"http://www.seriouseats.com/2009/10/understanding-sous-vide-cooking-heston-blumenthal.html\">sous-vide</a>. </strong>", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Pork", "Sous Vide"], "recipeIngredient": ["1 tablespoon chili powder", "2 1/2 tablespoon dark brown sugar, divided", "1 tablespoon kosher salt", "1/4 teaspoon cayenne pepper", "1 teaspoon ground coriander", "1/2 teaspoon ground fennel", "1 teaspoon ground black pepper", "4 bone-in pork rib chops, about an inch thick (10 ounces each)", "1 cup chicken broth", "1/2 cup ketchup", "1/4 cup dark molasses", "1 small onion, grated on the large holes of a box grater", "2 tablespoons Worcestershire sauce", "1 tablespoon brown mustard", "2 tablespoons cider vinegar", "2 teaspoons hot sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chili powder, 1 tablespoon brown sugar, salt, cayenne, coriander, fennel, and pepper together in small bowl and mix to combine. Set aside 1 tablespoon. Rub remaining mixture evenly on every surface of pork chops. Seal pork chops in a single layer in a vacuum bag and cook in water oven set to 140 degrees for at least 45 minutes, and up to 6 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine chicken broth, ketchup, molasses, onion, Worcestershire sauce, mustard, vinegar, hot sauce, and remaining tablespoon spice mix in a small saucepan. Bring to a simmer over medium-high heat. Reduce to low and cook until thickened and glossy, about 20 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork chops from vacuum bag and pat dry with paper towels. Light hot grill. When ready to cook, brush top side of each chop with 1 tablespoon of sauce. Transfer to grill, sauced-side down and cook for 1 minute. Meanwhil, brush top side with more sauce. Flip chops and cook 1 minute longer. Transfer chops to a plate and  brush both sides with more sauce. Cover with foil and allow to rest for 5 minutes. Remove foil, brush with more sauce, and serve, passing extra sauce at the table.</p>"}]}