{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-duckbreastwithredwine1.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["creole", "Dinner Tonight", "duck", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Seared Duck Breast with Red Wine and Figs", "link": "https://www.seriouseats.com/recipes/2010/01/dinner-tonight-seared-duck-breast-with-red-wine-and-figs-recipe.html", "description": "[Photograph: Nick Kindelsperger] I have a seriously soft spot for Creole cuisine, which is unfortunately completely underrepresented in this column. Most recipes require long simmers and dozens of ingredients, a fact that is even more pronounced as I flip through...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Duck", "Other Meats"], "recipeIngredient": ["2 duck breasts, with skin still on", "Salt and pepper", "1 pinch sugar", "1/4 medium onion, chopped", "1/2 garlic clove, minced", "1/2 cup red wine", "1/2 tablespoon red wine vinegar", "1 tablespoon fig preserves", "Small sprig fresh thyme, rosemary, or sage, plus more for a garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450&deg;F. Sprinkle the duck breasts with a pinch of sugar, salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place an iron-skillet over medium-high heat. Place the duck breasts in the pan skin-side down. They should start to render enough fat to sear. Cook for 3 minutes, moving them around to make sure the skin doesn't burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip the breasts over and place the pan into the oven. Cook for 5 minutes. Then remove the breasts, set aside, and turn off the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the skillet to the stove top and turn the heat to medium. Add the onions to cook in the rendered duck fat. Cook for 10 minutes. Add the garlic and cook for a minute. Then add the wine, vinegar, fig preserves, and herb sprig. Cook, stirring occasionally, for 15 minutes. Then strain the sauce into a small saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With five minutes left in cooking the sauce, place the duck breasts back into the oven to warm. The oven should be turned off, but there should be enough heat to gently warm the breasts back up. Slice the duck into 1/2-inch thick pieces, and spoon on some of the sauce. Garnish with some herbs.</p>"}]}