{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100213CantoneseRoastDuckSoupNoodles%20.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Chinese New Year", "duck", "Easy Asian Noodles", "Helen Chen", "noodles", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Noodles for the New Year: Cantonese Roast Duck Soup Noodles", "link": "https://www.seriouseats.com/recipes/2010/02/noodles-for-the-new-year-cantonese-roast-duck-soup-noodles-chinese.html", "description": "[Photograph: Jason Wyche] Have you ever walked by the windows full of beautifully lacquered roasted ducks in Chinatown and wondered what exactly to do with them once you got them home? I often find myself gazing longingly at the birds,...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Duck", "Other Meats", "Soups and Stews"], "recipeIngredient": ["12 ounces Chinese wheat or egg noodles, or vermicelli or thin spaghetti", "4 cups canned chicken broth plus", "4 cups water", "2 teaspoons Chinese rice wine or dry sherry", "3 slices unpeeled fresh ginger", "8 ounces <em>yu choy</em>, cut into 2-inch pieces, or other fresh greens such as spinach, watercress Napa cabbage, etc.", "1⁄2 Chinese roast duck, chopped into bite-sized pieces", "1⁄2 teaspoon salt, or to taste", "1 scallion, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot of boiling water, cook the dried noodles until a little softer than al dente, about 3 minutes, or 2 minutes if the noodles are fresh. Drain, rinse in cold water, and set aside to drain again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the broth mixture into a saucepan and add the wine and ginger. Bring to a boil over medium heat. Add the greens and cook until they are just wilted and tender; do not overcook. Add the duck&mdash;about 3 to 5 pieces per person&mdash;and 2 or 3 tablespoons of the sauce that the shops pack with the duck. Cook until the broth just returns to a boil. Remove from the heat and add salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the cooked noodles with a kettle of boiling water to warm and loosen. Drain thoroughly, and divide the noodles evenly between four large noodle bowls. Top each bowl with some of the greens, pieces of duck, and a teaspoonful of the scallion. Remove and discard the ginger from the broth, if desired. Ladle the hot broth over the toppings and noodles and serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong> Do not let the noodles sit too long in the hot broth because they will absorb the liquid and lose their chewy texture.</small></p>"}]}