{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-bltwithshrimpandavocado.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["avocado", "blt", "Dinner Tonight", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: BLT with Avocado and Shrimp", "link": "https://www.seriouseats.com/recipes/2010/08/blt-with-avocado-and-shrimp-sandwich-recipe.html", "description": "The only justification I have for desecrating BLT glory with avocado and shrimp is that it works. This isn't traditional or authentic in any way. To be honest, it kind of bugs me that I'd even enjoy something that messes with <strong>the holy trinity of bacon, lettuce, and tomato on bread.</strong> Why mess with perfection? But I do enjoy it. So here it is, ready to be scrutinized.", "totalTime": null, "recipeYield": "2 people", "recipeCategory": ["Avocado", "Bacon", "Dinner Tonight", "Sandwiches"], "recipeIngredient": ["5 small raw shrimp (about 2 ounces, or so)", "2 slices white bread", "1/2 avocado, sliced 1/4-inch thick ", "2 thick slices of tomato", "2 leaves of lettuce (preferably iceberg, but romaine will work)", "2 slices of thick-cut bacon ", "1 tablespoon mayonnaise ", "Salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a small pot of water to a boil. Add the shrimp, reduce the heat to medium, and cook until they are pink, about 30 seconds to a minute. Drain the water, and then toss the shrimp in an ice bath. Let cool down for a few minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the slices of bacon in a skillet set over medium heat, turning often. You want crispy bacon here. Drain on paper towels when done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toast the slices of bread. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Construct the sandwich. Smear the mayonnaise on one side of each slice of toast. Place the lettuce on top of one of the slices of bread. Add the tomato slices on top of the lettuce, and then season each with a pinch of salt and pepper. Add the avocado slices next, then the bacon, and finally the shrimp. Season with another pinch of salt and pepper. Finally top with the last piece of toast, mayonnaise side down. Serve. </p>"}]}