{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100527-grilled-pizza-opener-thumb-560x373-91806.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["grill", "grilled pizza", "grilling", "pizza", "pizza dough", "pizza sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Pizza Napoletana", "link": "https://www.seriouseats.com/recipes/2010/05/how-to-make-grilled-pizza-napoletana-on-a-barbecue-recipe.html", "description": "The grill is one of the tastiest, fastest ways to get charred, crisp pizza at home during the summer.", "totalTime": "2 hours (plus time for dough to proof)", "recipeYield": "Makes 4 pizzas", "recipeCategory": ["Grilling", "Pizza"], "recipeIngredient": ["2 pounds <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">homemade</a> or store-bought pizza dough", "1 (14.4 ounce) can whole peeled tomatoes, preferably San Marzano, drained", "Kosher salt", "1/2 cup extra virgin olive oil", "1 pound shredded or thinly sliced low-moisture mozzarella cheese (see note)", "4 ounces roughly grated Parmiggiano-Reggiano or Pecorino Romano", "1/2 cup finely chopped basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a knife or bench scraper to divide dough into four even pieces. With lightly floured hands, form into tight balls. Lightly oil 4 medium containers (large soup bowls work great) and place 1 dough ball in each one. Lightly grease the tops of the dough balls then cover each bowl with plastic wrap. Allow to rise at room temperature until doubled in volume, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place tomatoes in fine mesh strainer set over sink and squeeze them between your fingers until broken into approximate 1/4-inch chunks. Allow to drain for at least 15 minutes. Season with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a heavily floured surface, roll a dough ball into a disk about 13-inches by 9-inches and 1/4-inch thick using rolling pin. Shake off excess flour and place on a sheet tray lined with parchment paper. Repeat with remaining dough balls, placing a sheet of parchment between each one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a large chimney starter 3/4 full with charcoal and wait until fully ignited and coals are mostly covered in gray ash (about 20 minutes). Arrange coals under half of grill grate and place grate on top. Cover and allow to preheat for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush top of 1 dough round with a thin even layer of oil and season with kosher salt. Place gently on hot side of grill, oiled side down. Immediately brush top side with thin layer of oil and season with salt. Cook, checking frequently and moving to encourage even browning until bottom is dark brown and charred in spots and top is bubbly 45 to 90 seconds total. Flip using tongs or large spatula and cook until second side is charred. Flip again and transfer to cooler side of grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply 1/4 of both cheeses in a thin even layer across surface of pizza. Add 1/4 of tomato sauce in tablespoon-sized dollops across surface of pizza (about 1/2 cup total per pie). Cover and cook until cheese is melted and sauce is heated through, about 1 minute. Transfer pizza to cutting board with large spatula or metal pizza peel. Sprinkle with basil, and serve immediately. Repeat steps 5 and 6 with remaining dough.</p>"}]}