{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101209-127844-tuna-pasta-with-fennel-seed-lemon-and-pine-nuts.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["capers", "chile", "Dinner Tonight", "fennel seeds", "lemon zest", "pasta", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Pasta with Tuna, Pine Nuts, Fennel Seeds, Capers, and Lemon", "link": "https://www.seriouseats.com/recipes/2010/12/pasta-with-tuna-pine-nuts-fennel-seeds-capers-recipe.html", "description": "I just didn't feel like shopping.  And let's face it, sometimes we don't. That's when the pantry comes in handy. It's good to have recipes like this in the repertoire.  All told, <strong>I pulled this together in about 15 minutes</strong>&mdash;just enough time to bring the water to boil and cook the pasta al dente. The recipe is adapted from <strong>Judy Rogers' famous <em><a href=\"http://www.amazon.com/dp/0393020436/?tag=serieats-20\">Zuni Cafe Cookbook.</a></em></strong> The pine nuts work surprisingly well with the tuna.", "totalTime": "15", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pasta"], "recipeIngredient": ["1 pound short pasta, such as orrechiette or penne", "1/4 cup pine nuts", "1/4 cup olive oil", "1/4 teaspoon fennel seeds, lightly crushed", " 1/2 teaspoon red pepper flakes", "zest of 1 lemon", "2 tablesoon capers, roughly chopped", "1 can tuna in olive oil", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil over high heat.  Cook the pasta until just shy of al dente, according to pasta box directions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat the pine nuts in a large (12-inch) skillet over medium heat.  Cook until toasted and fragrant but not burned, 1-2 minutes, then add the oil, fennel seeds, red pepper flakes, and lemon zest.  Cook for an additional minute until the spices are fragrant, then add the tuna.  Stir carefully, avoiding breaking it up too much, until warmed through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta, reserving 1 cup of cooking water, and add the pasta to the skillet. Toss well to coat, then add some of the pasta water, about 1/4 cup, and cook over low heat until the pasta is al dente and the sauce and noodles cling together well.  Add pasta water as needed to achieve the right sauciness.  Season to taste with salt and pepper, and serve immediately.</p>"}]}