{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100303-sous-vide-steak-hanger.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "easy", "low carb", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7142857142857", "ratingCount": "14"}, "name": "Sous Vide Steaks", "link": "https://www.seriouseats.com/recipes/2010/03/sous-vide-steaks-recipe.html", "description": "Sous vide is the ideal way to prepare steak for perfectly even edge-to-edge cooking and foolproof results. These sous vide steaks can be finished in a pan or on the grill.", "totalTime": "1 1/2 to 4 hours", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Father's Day", "Gluten-Free", "Grilling, Smoking, and Barbecue", "Mains", "Mother's Day", "Sous Vide", "Stovetop", "The Food Lab", "Valentine's Day"], "recipeIngredient": ["2 (1 1/2– to 2-inch-thick) ribeye, strip, porterhouse, or T-bone steaks (about 1 pound/450g each), or 4 tenderloin steaks (6 to 8 ounces/170 to 225g each)", "Kosher salt and freshly ground black pepper", "4 sprigs thyme or rosemary (optional)", "2 garlic cloves (optional)", "2 shallots, thinly sliced (optional)", "2 tablespoons (30ml) vegetable, canola, or rice bran oil (if pan-searing)", "2 tablespoons (30g) butter (if pan-searing; optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a sous vide cooker to desired final temperature. (See note for temperature and timing charts, or <a href=\"https://www.seriouseats.com/2015/06/food-lab-complete-guide-to-sous-vide-steak.html#chart\">find the same charts here</a>.) Season steaks generously with salt and pepper. Place in sous vide bags along with herbs, garlic, and shallots (if using) and distribute evenly. Seal bags and place in water bath for desired time according to charts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Finish in a Pan:</strong> Turn on your vents and open your windows. Remove steak from water bath and bag and carefully pat dry with paper towels. Add vegetable, canola, or rice bran oil to a heavy cast iron or stainless steel skillet, then place over the hottest burner you have and preheat skillet until it starts to smoke. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently lay steak in skillet, using your fingers or a set of <a href=\"https://www.seriouseats.com/2017/09/the-best-kitchen-tongs-equipment-review.html\">tongs</a>. If desired, add a tablespoon of butter; for a cleaner-tasting sear, omit the butter at this stage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 15 to 30 seconds, flip steak so that the second side comes into contact with the pan. Repeat, flipping steak every 15 to 30 seconds, until it has developed a nice brown sear, about 1 1/2 minutes total. If you did not add butter earlier, add butter to skillet about 30 seconds before steak is done for added richness. Serve steak immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Finish on the Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove steak from water bath and bag and carefully pat dry with paper towels. Place steak directly over hot side of grill and cook, turning every 15 to 30 seconds, until a deep, rich crust has formed, about 1 1/2 minutes total. If the fire threatens to flare up as the steak drips fat into it, suffocate the fire by closing the grill lid until the flames die out. Alternatively, transfer steak to cooler side of grill, using a set of long tongs, until flames subside. Do not allow steak to become engulfed in flames."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cooked steak to a cutting board or serving platter and serve immediately."}]}