{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101111-dt-indian-spiced-cauliflower-with-rice.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Indian", "keywords": ["cauliflower", "Dinner Tonight", "Indian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Dinner Tonight: Roasted Cauliflower with Indian Spices", "link": "https://www.seriouseats.com/recipes/2010/11/dinner-tonight-roasted-cauliflower-with-indian-spices-recipe.html", "description": "More than those of any other cuisine, Indian recipes seem to transform vegetables. Even without an animal product in sight, a curry can manage to taste meaty. You never get up from the table thinking, \"That could have been more flavorful,\" if the recipe is prepared correctly. And this is nowhere more apparent than with cauliflower, which is insipid raw, but deeply satisfying once cooked with plenty of spices and caramelization. It's in the running for \"meatiest\" vegetable around.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cauliflower", "Dinner Tonight", "Indian", "Sides", "Vegetarian"], "recipeIngredient": ["1 large head cauliflower, broken into florets", "4 tablespoons neutral oil, such as canola", "One (1-inch) piece ginger, peeled and minced, about 1 tablespoon", "1 teaspoon cumin seeds, toasted in a dry skillet, ground", "2 serrano chilis, minced", "2 teaspoons coriander seeds, toasted in a dry skillet, ground", "1/2 teaspoon turmeric", "1/4 teaspoon cayenne", "Kosher salt", "1 cup canned diced tomatoes (or fresh in season)", "1/4 cup chopped cilantro", "1 lime, cut into wedges", " Cooked rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Toss cauliflower florets with half of oil. Spread on baking sheet. Roast until caramelized and mostly tender, 15-20 minutes. Break into smaller bite-sized florets as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining oil in small stainless-steel skillet until shimmering. Add ginger and serrano chilis and cook, stirring frequently, until fragrant, about 1 minute. Add cumin, coriander, turmeric, cayenne, and pinch of salt.  Allow spices to toast in oil, being careful not to burn, for at least one minute. Add cauliflower and toss well in spices. Cook for an additional 2 minutes, then add  tomatoes. Cook until thickened and fragrant, about 5 minutes. Adjust seasoning to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in cilantro and serve with rice, passing lime wedges tableside.</p>"}]}