{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100315irishcupsohno.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "cream", "cupcakes", "desserts", "Guinness", "irish", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cakespy: Chocolate Stout Cupcakes with Irish Whiskey Filling", "link": "https://www.seriouseats.com/recipes/2010/03/cakespy-irish-car-bomb-filled-cupcakes-boozy-baking-recipe.html", "description": "One of the great things about mid-March: you are encouraged to make <strong>Chocolate Stout Cupcakes with Irish Whiskey Filling,</strong> a festive treat for this St. Paddy's week.", "totalTime": "", "recipeYield": "about 20 cupcakes", "recipeCategory": ["Cakes", "Cakespy", "Chocolate", "St. Patrick's Day"], "recipeIngredient": ["<strong>For the cupcakes:</strong>", "1 cup stout (such as Guinness)", "1 cup (2 sticks) unsalted butter", "3/4 cup unsweetened cocoa powder", "2 cups flour", "2 cups sugar", "1 1/2 teaspoons baking soda", "3/4 teaspoon salt", "2 large eggs", "2/3 cup sour cream (full fat is best)", "<strong>For the filling:</strong>", "8 ounces bittersweet chocolate", "1/3 cup heavy cream", "1/3 cup Bailey's Irish Cream (the original recipe calls for 2/3 heavy cream and no Bailey's in the filling, but I found it increased the awesome quotient just a little bit) ", "2 tablespoons butter, room temperature", "1 to 2 teaspoons Irish whiskey", "<strong>For the frosting</strong>", "<strong>Note:</strong> If you want lots of frosting on each cake, go ahead and double this recipe", "3 to 4 cups confections' sugar", "1 stick (1/2 cup) unsalted butter, at room temperature", "3 to 4 tablespoons Bailey's Irish Cream (or more, to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Get ready: pre-heat oven to 350°F. Line 24 cupcake cups with liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 1 cup stout and 1 cup butter to simmer in heavy large saucepan over medium heat. Add cocoa powder and whisk until mixture is smooth. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate large bowl, whisk flour, sugar, baking soda, and 3/4 teaspoon salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another large bowl, using an electric mixer, beat eggs and sour cream in another large bowl to blend. Add stout-chocolate mixture to egg mixture and beat just until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the dry mixture and beat briefly on slow speed. Using a rubber spatula, fold batter until completely combined.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter among cupcake liners, filling them 2/3 to 3/4 of the way (I found that they don't rise an incredible amount, so it was OK to fill them pretty close to the top). Bake cake until tester inserted into center comes out clean, rotating them once front to back if your oven bakes unevenly. The original recipe suggested 17 minutes, but I found it took more like 20 minutes. Cool cupcakes on a rack completely.</p>\r\n\r\n<p>Note: If you don't let them cool completely before filling, they will taste good--but they won't look so pretty. Here's an example (I couldn't resist trying one right away)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While your cupcakes cool, go ahead and make the filling. Chop the chocolate into coarse but roughly even pieces, and transfer it to a heatproof bowl. Heat the cream until it is simmering (but not boiling) and pour it over the chocolate. Let it sit for about a minute and then stir until smooth. (Note: Per the original recipe, if this has not sufficiently melted the chocolate, you can return it to a double-boiler or give it 20 seconds in the microwave to help the chocolate get sufficiently melty.) Add the butter, Irish Cream, and whiskey and stir until combined.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make space for the filling. The original recipe suggests using an apple corer to cut out a section from your cooled cupcakes to fill, but lacking one I found that the cake is sturdy enough that if you gently cut out a circle using a small, sharp knife, it works just fine. You want to cut halfway to 2/3 of the way down--not too far down or your filling might ooze out the bottom. You don't want to lose a single drop.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the cupcakes. You can pipe in the filling, or if it is still pretty smooth and fluid, you can just spoon it in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the frosting. In an electric mixer, mix the butter on medium speed until it is very fluffy. Whip the butter in the bowl of an electric mixer, or with a hand mixer, for several minutes. You want to get it very light and fluffy. Slowly add the confectioners' sugar, starting with a few tablespoons at a time of your sugar until the frosting looks thick enough to spread (for me, this was about 2 cups). At this point, add in the Irish Cream and whip it until combined. Beat in as much or as little of the remaining confectioners' sugar until the frosting has reached your desired consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost your cupcakes. If you want to get fancy, pipe the frosting on top in swirls or whirls—but if you just want to eat the cupcakes, frost using a spatula, garnish with a little something green, and get eating.</p>"}]}