{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100423porkribroastwithrosemaryandsagedone.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alice Waters", "Cook the Book", "In The Green Kitchen", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pork Rib Roast with Rosemary and Sage", "link": "https://www.seriouseats.com/recipes/2010/04/pork-rib-roast-with-rosemary-and-sage-recipe.html", "description": "Tackling a giant bone-in roast isn't something that most of us take on more than once or twice a year, if that. <strong>But it's a skill certainly worth honing.</strong>  A hulking roast is a wonderfully impressive meal that not only feeds a crowd, but also elicits plenty of ego-stroking <em>ohhs</em> and <em>ahhs</em> once it hits the table.  Aside from being a great crowd-pleaser, the roast doesn't require too much labor, once you get the hang of tying it.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Pork", "Roasting"], "recipeIngredient": ["1 bone-in 4- to 5-rib pork loin", "3 garlic cloves, peeled and chopped", "Salt and fresh-ground black pepper", "1 tablespoon chopped rosemary", "1 tablespoon chopped sage leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the flap of meat next to the rib bones and rub the garlic onto the meat and bones down to the loin meat.  Sprinkle liberally with salt, ground pepper, and half of the rosemary and sage.  Rub the seasonings into the meat.  Reassemble the roast and use kitchen string to tie the meat and bones together.  Season the outside of the roast, again liberally, with salt, pepper, and the remaining herbs, and rub into the meat.  The chopped garlic goes on the inside of the roast; if rubbed onto the outside, it will burn in the oven.  Wrap up the roast in the butcher paper, or lightly cover, and refrigerate.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the roast from the refrigerator an hour or so before cooking to let it come to room temperature.  Put it in a roasting pan, bone side down; the bones will make a sort of natural roasting rack.  Preheat the oven to 400&deg;F.  Cook the roast for 30 minutes for so, then turn it over in the roasting pan, bone side up, and cook for another 20 minutes.  Turn the roast again, bone side down, and cook for another 20 minutes or so, until the internal temperature registers 130&deg;F.  When the roast is done, let is rest for 15 to 20 minutes before carving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skim off some of the fat from the roasting pan, add some water or stock, and scrape up all of the browned bits at the bottom of the pan.  Pour the juices into a small saucepan and keep warm.  When ready to serve, remove the strings from the roast, and cut the meat into thick chops with the bones, or cut the rack of rib bones away from the meat, and slice between the bones to separate them.  Return them to the oven for a few minutes if you like them crustier.  To the juices in the saucepan, add the juices reserved from the roast after resting and carving.  Slice the meat and serve with the warm juices and rib bones.</p>"}]}