{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100923-guavaicecream.jpg", "author": {"@type": "Person", "name": "Ethan Frisch"}, "recipeCuisine": "", "keywords": ["coffee", "cream cheese", "desserts", "espresso", "guava", "ice cream", "lemons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Scooped: Cream Cheese and Guava Swirl Ice Cream", "link": "https://www.seriouseats.com/recipes/2010/09/cream-cheese-and-guava-swirl-ice-cream-recipe.html", "description": "The Spanish have a long tradition of eating their beloved <strong>Manchego cheese with a smear of <em>membrillo</em>, a sweet paste made from quince.</strong> As their culinary influence spread to colonies in the Americas, they were adopted and adapted to match local tastes and ingredients. <strong>The gestalt of the two flavors together is incredible,</strong> a completely perfect combination of sweet and tart, creamy and fruity, exotic and familiar. In ice cream form, it's even more delicious (but what isn't more delicious in ice cream form?) and incredibly easy to make.", "totalTime": "2 hours", "recipeYield": "1 quart", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats", "Lemon"], "recipeIngredient": ["1 cup guava paste (canned)", "About 1 cup water", "8 oz cream cheese, softened", "3/4 cup milk", "3/4 cup heavy cream", "2 tablespoons lemon juice from one lemon", "3/4 cup sugar", "1/8 tsp salt", "Ground coffee and cinnamon for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat guava paste with 1/4 cup water in a small saucepan over low heat, stirring occasionally. The paste will become more liquid as it heats, so add additional water slowly, until mixture is pourable, about the viscosity of maple syrup. Chill in fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine cream cheese, milk, sugar, lemon juice and salt in blender jar. Blend on high speed until completely dissolved. Add cream and blend until just mixed (too much blending can over-whip the cream).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spin the cream cheese ice cream base in ice cream machine (if you don't have one, use Kenji's <a href=\"http://www.seriouseats.com/2010/07/how-to-make-ice-cream-without-an-ice-cream-maker-the-food-lab.html?ref=latestc\">awesome alternative</a>).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer ice cream to pint or quart-sized containers, alternating scoops of ice cream with small ladlefuls of of guava syrup. Try to stack unevenly, so syrup gets distributed throughout the container, using a fork or spoon to force guava paste into uneven spots by sticking in and out three to four times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refreeze containers until desired consistency is reached. Serve witha little fine-ground coffee or espresso and a touch of cinnamon sprinkled on top.</p>"}]}