{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100816-dt-summer-succotash-with-bacon.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["succotash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Summer Succotash with Bacon", "link": "https://www.seriouseats.com/recipes/2010/08/dinner-tonight-summer-succotash-with-bacon-recipe.html", "description": "It's the kind of meal you eat on a table on the back deck, or makes you wish that you <em>had</em> a table on a back deck, a glass of wine in hand, sort of eating it like an open-faced sandwich, sort of eating it with a fork, sort of spilling it on your shorts and sort of not caring. In other words: summer.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon", "Corn", "Dinner Tonight", "Tomato"], "recipeIngredient": ["1 pound fresh shell beans in pod or 1 cup frozen baby lima beans", "1/4 pound bacon, cut into 1/4-inch pieces", "1 1/2 tablespoons olive oil", "1 small Vidalia onion or other sweet onion, chopped", "2 large garlic cloves, 1 of them minced", "3/4 pound cherry tomatoes (about 1 1/2 pints), halved", "Fresh kernels from 4 ears corn", "1 tablespoon sherry vinegar, plus more to taste", "1/4 cup packed small fresh basil leaves", "1/4 cup packed small fresh arugula leaves", "6 slices thick, crusty bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fresh beans, shell them, and in the meantime bring a small pot of salted water to boil.  Cook the beans until just tender, about 5 minutes, then drain and cool under running water to stop the cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, cook the bacon over medium heat until just crisp, then remove to drain on a paper towel.  Pour off all but 1 tablespoon of the bacon fat, then add the olive oil and heat over medium.  Add the onion and cook until softened, 4-5 minutes, then add the garlic and cook for a minute more.  Add the tomatoes, corn, and vinegar, and cook, stirring often, until the tomatoes just begin to lose their shape.  Season to taste with salt and pepper. Remove skillet from heat and stir in the cooked beans and half the bacon.  Allow the succotash to cool awhile, then stir in the basil and arugula. Season to taste with salt, pepper, and sherry vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, toast 6 slices of bread, then cut the second garlic clove in half.  Immediately rub the toasted bread with the garlic, then drizzle with a little olive oil.  Spoon succotash over bread and top with remaining bacon.</p>"}]}