{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101026-pumpkincustard.jpg", "author": {"@type": "Person", "name": "therealchiffonade"}, "recipeCuisine": "", "keywords": ["brulee", "custard", "desserts", "fall", "market scene"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Sugar Pumpkin with Brown Sugar Egg Custard", "link": "https://www.seriouseats.com/recipes/2010/10/baked-sugar-pumpkin-with-brown-sugar-egg-cust.html", "description": "Already-sweet sugar pumpkins are rubbed with olive oil and brown sugar, before being filled with a lightly sweetened brown sugar custard. The baked pumpkins are sprinkled with sugar and torched until a thin crust has formed.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Desserts", "Pumpkin"], "recipeIngredient": ["<strong>For the baked sugar pumpkin:</strong>  ", "1 fresh sugar pumpkin, 2 3/4 to 3 pounds", "1 tablespoon olive oil", "1 tablespoon brown sugar", "Pinch cinnamon", "Pinch salt", "<strong>For the brown sugar egg custard:</strong>", "12 ounces evaporated milk", "2 whole eggs", "2 egg yolks", "1/3 cup brown sugar", "1 teaspoon vanilla", "1/4 teaspoon pumpkin pie spice (or just cinnamon is fine)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Remove top from pumpkin and reserve.  Scoop out seeds and reserve if desired.  Gently score the inside of the pumpkin in a crosshatch manner (it doesn’t have to be neat).  Do not puncture outer shell of pumpkin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the entire pumpkin, inside and out, with olive oil.  Rub inside of pumpkin with brown sugar.  Sprinkle cinnamon and salt inside pumpkin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pumpkin and pumpkin top cut side down on a baking sheet lined with parchment.  Cover pumpkin tightly with foil and bake 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pumpkin from the oven, turn it cut side up, cover again with foil and return the pumpkin to oven until completely tender, about 15 minutes longer. Return pumpkin to oven for 5 minute intervals until completely tender if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To toast seeds: Discard stringy flesh and wash seeds.  Toss with olive oil and salt. Toast in 350 oven on parchment lined rimmed baking sheet for 10 minutes, then continue roasting checking the seeds every 3-4 minutes until golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For brown sugar egg custard:</strong> Preheat oven to 300°F. In a saucepan, heat evaporated milk to a simmer over medium-low heat.  In a bowl, whisk together eggs, brown sugar, vanilla and pumpkin pie spice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk into the egg mixture whisking vigorously, then return the milk and egg mixture to the saucepan.  Simmer 5 minutes, stirring with a wooden spoon, until slightly thickened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the custard into glass loaf pan set inside roasting pan and add enough hot tap water to come halfway up the sides of the glass loaf pan.  Bake until set, 50 to 55 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble pumpkin and custard:</strong> Lightly spoon cooked custard into pumpkin and chill for at least 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To brulee custard:</strong> Sprinkle custard with 1 tablespoon granulated sugar.  Torch carefully until lightly browned and sugar is completely melted.  Oven broiling is not recommended as the pumpkin may burn.</p>"}]}