{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100911-smorestartlets-610.jpg", "author": {"@type": "Person", "name": "Jenny McCoy"}, "recipeCuisine": "", "keywords": ["chocolate", "desserts", "graham crackers", "marshmallows", "s'mores", "tartlets", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "S'mores Tartlets", "link": "https://www.seriouseats.com/recipes/2010/09/smores-tartlets-tarts-recipe.html", "description": "In honor of my favorite summertime treat, I am sharing one of my favorite recipes:  <strong>S'mores Tartlets.</strong>  They are a little time-consuming to make, but well worth the effort&mdash;especially in January when winter is upon you and summer feels lightyears away.  Made from <strong>a little shell of graham cracker sable, filled with semisweet chocolate ganache and topped with a dollop of charred marshmallow meringue,</strong> this bite-sized treat can be made anytime, along with a pitcher of lemonade, for a quick transport to a hot summer day.", "totalTime": "5 hours", "recipeYield": "50 (makes fifty 1-inch tartlets)", "recipeCategory": ["Desserts"], "recipeIngredient": ["<strong>For the Graham Cracker Sable</strong>", "10 tablespoons unsalted butter, at room temperature", "1/2 cup light brown sugar, lightly packed", "2 tablespoons honey", "1 cup all-purpose flour, plus extra for rolling", "2/3 cup whole wheat flour", "1/3 cup wheat germ", "1/2 teaspoon kosher salt", "3/4 teaspoon baking soda", "3/4 teaspoon ground cinnamon", "<strong>For the Chocolate Ganache Filling</strong>", "1 cup heavy cream", "1/4 cup whole milk", "1 tablespoon unsalted butter", "7 ounces semisweet chocolate chips", "<strong>For the Marshmallow Meringue</strong>", "2 large egg whites", "2/3 cup sugar", "1/2 vanilla bean, split and seeded", "1 tablespoon light corn syrup", "1/3 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tartlet Shells:</strong> In the bowl of a stand mixer, fitted with the paddle attachment, cream butter, sugar and honey on medium speed until light and fluffy. In a medium-sized mixing bowl, whisk together both flours, wheat germ, salt, baking soda, and cinnamon until well combined. Turn mixer to low and slowly add dry ingredients to butter and sugar mixture; continue to mix until evenly incorporated, about 2 minutes. Remove the dough from mixer and shape into a flat patty about 1” thick; wrap dough in plastic wrap and refrigerate for about two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 325 degrees. Gently roll dough on a lightly floured surface to about a 1/4” thick. Using biscuit cutter, cut into 1 1/2-inch rounds and line fifty 1-inch tart rings.  Trim any excess dough from edges and place tart shells on a baking sheet. Bake until light golden brown, approximately 9 minutes. Transfer baking sheet to wire rack and allow to cool completely. Remove tarts from molds and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Place chocolate chips and butter in large mixing bowl. Set aside. Bring heavy cream and milk to a boil in a heavy saucepan. Pour over chocolate and let stand one minute. Whisk until smooth. Carefully pour warm ganache into prepared shells, filling to the brim. Transfer to refrigerator until set, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meringue:</strong> In the bowl of a stand mixer fitted with the whisk attachment, mix egg whites, one tablespoon sugar and vanilla bean seeds on low speed until frothy. Meanwhile, with mixer still running on low speed, place remaining sugar, corn syrup and water in a small saucepan and cook over medium heat until mixture registers 236 degrees on an instant read thermometer, swirling the mixture gently every minute or so, about 4 minutes. Increase mixer to medium high and slowly pour hot sugar mixture over egg whites. Continue to whip until thick, glossy, and cooled to room temperature, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer meringue to pastry bag fitted with small pastry tip. Pipe small dollop on top of each ganache-filled tartlet. Char meringue with kitchen torch to deep golden brown just before serving.</p>"}]}