{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101130-dt-bistro-salad-with-bacon-croutons-and-garlic.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["croutons", "Dinner Tonight", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: French Bistro Salad with Bacon, Croutons, and Garlic", "link": "https://www.seriouseats.com/recipes/2010/11/french-bistro-salad-with-bacon-croutons-garlic-recipe.html", "description": "<strong>The genius is in the croutons:</strong> they're homemade from cubed rustic bread (a perfect use if it's stale, but it will work fine with fresh), crisped in the rendered bacon fat until golden and just barely chewy.  They absorb a ton of flavor and it gives the whole salad that porky, bacon-y goodness all the way through.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Bacon", "Dinner Tonight", "Salads"], "recipeIngredient": ["2 tablespoons Dijon mustard", "2 tablespoon red wine vinegar", "Salt to taste", "1/2 cup neutral oil, such as peanut or canola", "6 cups mixed salad greens", "4 ounces bacon, preferably thick cut, cut into matchsticks", "2 large slices rustic bread, cut into 1-inch cubes", "2 garlic cloves, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the Dijon and red wine vinegar.  Add the oil in a slow stream while whisking vigorously to create an creamy emulsion of the dressing ingredients.  Once all the oil is added, season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bacon to a medium skillet and turn the heat to medium.  Cook the bacon until the fat begins to render, 2-3 minutes, then add the cubed bread.  Cook, stirring ocassionally, until the bacon is crisp and the bread is golden, 10-12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the greens in a large salad bowl.  Top with the bacon/crouton mixture and dressing, then toss to coat the leaves thoroughly.  Season, if needed, with salt.  Add the minced garlic then divide amongst plates.  Serve while the croutons are still warm.</p>"}]}