{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-sichuanboiledbeef.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["beef", "Chinese", "Dinner Tonight", "sichuan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sichuan Boiled Beef in Fiery Sauce", "link": "https://www.seriouseats.com/recipes/2010/02/dinner-tonight-sichuan-boiled-beef-in-fiery-sauce-recipe.html", "description": "[Photograph: Nick Kindelsperger] I just knew the smoke detector was going to go off. I had all the fans on and even my kitchen window fully open, which was letting in some glorious freezing Chicago air. But it was no...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Chinese", "Dinner Tonight", "Mains"], "recipeIngredient": ["1 stalk of celery, stem only, chopped 2-inch segments", "4 scallions, white parts only, chopped into 2-inch segments", "1 pound flank steak, thinly sliced against the grain", "Salt", "1 tablespoon yellow rice wine", "5 tablespoons vegetable oil", "10 dried red chiles", "2 teaspoons Sichuan peppercorn", "4 tablespoons chili bean paste", "3 cups chicken stock", "1 tablespoon dark soy sauce", "1 tablespoon cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sliced beef to a bowl and pour in the rice wine. Toss well and set aside for 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 3 tablespoons of the oil into a work or large sauté pan. Turn heat to high. When very hot, add the chiles and Sichuan peppercorns. Stir constantly, and cook for 1 to 2 minutes, until very fragrant but not burnt. Turn off the heat, and remove chiles and peppercorns and set aside. When cool, roughly chop the chiles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat back to high. Add the celery and scallions and cook for about 2 minutes, until they are just cooked through. Remove them and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chili bean paste and cook for 30 seconds, stirring often, until very fragrant. Pour in the chicken stock and soy sauce. Bring to a boil. Meanwhile, whisk together the cornstarch with 3 tablespoons of water. Stir in the beef and toss until coated. When stock is boiling, reduce heat to a simmer and then add the beef. Cook for 1 to 2 minutes, or until the beef is just cooked. Turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the celery and scallions between four bowls. Ladle the broth and the beef into each bowl. Add the chopped chiles and Sichuan peppercorns to each. Pour the rest of the oil into a skillet set over high heat. When it starts to smoke, turn off the heat, and immediately pour over each bowl. It will sizzle the beef on top. Serve immediately.</p>"}]}