{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100629-britflapjacks.jpg", "author": {"@type": "Person", "name": "HeartofGlass"}, "recipeCuisine": "", "keywords": ["biscuits", "british", "oats", "UK"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Microwavable British Flapjacks", "link": "https://www.seriouseats.com/recipes/2010/07/microwaved-british-flapjacks.html", "description": "Do not be freaked out by the picture of the dead lion surrounded by honey bees on the label. These treats are vegetarian and no lions are harmed in the making of the syrup. It is made from a sugar blend, not honey! Mr. Lyle was a religious man and created the image based on a Biblical story in which Samson found a honeycomb in the carcass of a lion.  Bless Mr. Lyle, for somehow I doubt this image was \"focus group\" tested.", "totalTime": "", "recipeYield": "10 to 12", "recipeCategory": ["Breakfast and Brunch", "Other Grains"], "recipeIngredient": ["1/2 cup (1 stick) unsalted butter (or vegan substitute) ", "(Depending on the consistency of your oats, you may need to add a tablespoon more.)", "1/2 (generous, packed) cup light brown sugar", "2 1/3 cups old-fashioned oats (Not instant or steel-cut)", "Salt to taste", "<small>* Do not be freaked out by the picture of the dead lion surrounded by honey bees on the label. These treats are vegetarian and no lions are harmed in the making of the syrup. It is made from a sugar blend, not honey! Mr. Lyle was a religious man an</small>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure oats, sift them with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Microwave 5 to 7 minutes.  Wait until the mixture is bubbling, but not boiling over.  Remove from the microwave.  The oat mixture will still be cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The original recipe says this mixture should make 16, but I found that yields a quite tiny flapjack.  And after all, this is my easy, quick, microwaved, American version of flapjacks&mdash;only fitting they should be supersized.</p>"}]}