{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101025stiltonandwalnutcrackers.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Barefoot Contessa", "Barefoot Contessa How Easy Is That?", "blue cheese", "Cook the Book", "crackers", "Ina Garten", "Stilton", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Stilton and Walnut Crackers", "link": "https://www.seriouseats.com/recipes/2010/10/ina-garten-stilton-and-walnut-crackers-recipe.html", "description": "<a href=\"http://www.barefootcontessa.com/\">Ina Garten</a>'s <strong><em><a href=\"http://www.amazon.com/Barefoot-Contessa-How-Easy-That/dp/0307238768/serieats-20\">How Easy Is That?</a></em></strong> begins like every great dinner party does, with cocktails.  The first chapter is a predinner spread of cocktails and little bites that get the meal started on the right note, keeping your guests entertained and giving you a little leeway to finish up the rest of the meal.  All of these hors d'oeuvres have Garten's simple and elegant touches all over them&mdash;popcorn is drizzled with truffle butter, mixed nuts are roasted with chipotle and rosemary, and instead of cheese and crackers, Garten offers these <strong>Stilton and Walnut Crackers</strong>.", "totalTime": null, "recipeYield": "24 crackers", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Cook the Book", "Nuts"], "recipeIngredient": ["1/4 pound (1 stick) unsalted butter, at room temperature", "8 ounces Stilton, crumbled, at room temperature (12 ounces with the rind)", "1 1/2 cups all-purpose flour", "2 teaspoons kosher salt", "1 teaspoon freshly ground black pepper", "1 extra-large egg beaten with 1 tablespoon of water, for egg wash", "1/2 cup walnuts, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and Stilton for 1 minute, until smooth.  With the mixer on low, add the flour, salt, and pepper and continue beating for about 1 minute until the dough is in large crumbles.  Add 1 tablespoon of cold water and mix until the dough comes together.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump the dough into a floured board and then use your palms to roll it into a 12-inch-long-log.  Brush the log completely with the egg wash.  Spread the walnuts on a cutting board and roll the log back and forth in the walnuts, pressing lightly, to distribute them on the log.  Wrap in plastic and refrigerate for at least 30 minutes or for up to 4 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the oven to 350&deg;F and line a sheet pan with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the log into 3/8-inch-thick slices with a small sharp knife and arrange the crackers 1/2 inch apart on the sheet pan.  Bake for 22 minutes, until very lightly browned, rotating the pan once during baking.  Cool on the pan and serve at room temperature.<br />\n</p>"}]}