{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100525-Kikkoman%20recipes%20-%201.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "Japanese", "keywords": ["green bean", "Japanese", "mushroom", "ponzu", "shiitake", "tempura"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Green Bean and Shiitake Tempura with Ponzu Mayonnaise", "link": "https://www.seriouseats.com/recipes/2010/05/deep-fried-green-bean-and-shiitake-tempura-with-ponzu-mayonnaise-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: Ponzu can be found in most Asian grocers or ordered online. About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science of home cooking...", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6 as an appetizer", "recipeCategory": ["Japanese", "Legumes", "Mushrooms", "Sides", "Vegetarian"], "recipeIngredient": ["<strong>For the Ponzu Mayonnaise:</strong>", "1 large egg yolk", "1 tablespoon red or white miso paste", "1 tablespoon ponzu sauce (see note)", "1 tablespoon honey", "1 cup vegetable oil", "Kosher salt", " ", "<strong>For the Tempura:</strong>", "1 1/2 quarts peanut oil", "1 cup unbleached all-purpose flour", "1/2 cup rice flour (or cornstarch)", "1 egg", "1 1/2 cups ice cold seltzer water", "1/2 pound green beens, trimmed", "4 ounces (about 8 medium) shiitake mushrooms, stems removed, caps cut in half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ponzu Mayo:</strong>Add the egg yolk, miso paste, ponzu, and honey to a medium bowl and whisk to combine. Set the bowl inside on top of a medium sauce pot lined with a kitchen towel to keep it steady. Whisking constantly and vigorously, slowly drizzle in vegetable oil until the sauce forms a thick emulsion. Season to taste with salt and pepper, and add up to one tablespoon of water until mixture is thick enough to hold its shape, but not pasty. Refrigerate until ready to use. Sauce can be stored in refrigerator for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tempura:</strong> Heat peanut oil over high heat in a large, heavy dutch oven or wok to 390°F as read on an <a href=\"http://www.seriouseats.com/2010/03/the-ten-best-kitchen-tools-gadgets-gear.html\">instant read</a> or deep-frying thermometer, about 12 minutes. Lower heat to maintain temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour and rice flour together in a large bowl. Add eggs and soda water and, shaking bowl with one hand, rapidly whisk with other hand with a pair of chopsticks until the mixture just comes together. There should still be dry clumps of flour remaining. Line a second bowl with a triple layer of paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in four batches, submerge the vegetables in the batter and turn to coat. Pick up with you hands, allow the excess batter to drip off, and drop the pieces into the hot oil one at a time, bringing your hand right down to the oil (do not drop from a height or the hot oil will splash). Increase heat to high to maintain temperature. Fry, agitating constantly with chopsticks or a wire mesh spider until the tempura is a pale golden brown and very crisp, about 3 minutes. Transfer the fried vegetables to the paper-towel lined bowl, season with salt, and toss to drain excess oil. Transfer to a wire rack set in a rimmed baking sheet in a 200°F oven to keep warm. Allow oil to reheat to 390°F and repeat with remaining batches. Serve immediately with ponzu mayonnaise.</p>"}]}