{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100928topsirloinwithbabyspinach.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Deborah Krasner", "Good Meat", "potatoes", "spinach", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Top Sirloin with Baby Spinach and Home Fries", "link": "https://www.seriouseats.com/recipes/2010/09/cook-the-book-top-sirloin-with-baby-spinach-and-home-fries-recipe.html", "description": "For our first recipe of the week from <strong><a href=\"http://www.culinaryvermont.com/\">Deborah Krasner</a></strong>'s <strong><em><a href=\"http://www.amazon.com/Good-Meat-Complete-Sourcing-Sustainable/dp/1584798637/serieats-20\">Good Meat</a></em></strong> I thought it would be best to choose this <strong>Top Sirloin with Baby Spinach and Home Fries</strong>, a simple preparation to best showcase the difference between grass-fed and more conventional grain-fed beef.  I figured that the minimalist combination of seared steak seasoned with only salt and pepper, over a bed of raw spinach with a few crisp rounds of potato would let the meaty flavors of the grass-fed beef really shine.", "totalTime": null, "recipeYield": "2 to 4", "recipeCategory": ["Beef", "Cook the Book", "Potato", "Spinach"], "recipeIngredient": ["2 to 4 cups raw baby spinach, washed and spun dry", "1/4 cup extra-virgin olive oil, plus more for drizzling", "1 or 2 large waxy potatoes, very thinly sliced", "Salt and freshly ground black pepper", "1 pound grass-fed sirloin (top loin) steak", "1/4 cup red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the spinach across the surface of a serving platter and set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a cast-iron skillet over medium-high heat and fry the potato slices until crisp on both sides.  Remove them from the hot pan and arrange them in a single layer on top of the raw spinach.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Salt and pepper the steak, and wipe out the pan.  Return it to the stovetop over high heat, and pan-sear the steak until browned on the outside and medium rare within, 3 to 4 minutes per side.  Remove the steak from the pan and lay it over the potatoes and spinach to rest and to further wilt the spinach.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat.  Immediately pour the red wine into the hot pan and scrape any particles sticking to the pan to incorporate them.  Pour this sauce over the meat along with a drizzle of olive oil.  Serve at once, dividing the steak at the table.</p>"}]}