{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["curry", "noodles", "pink peppercorns", "rice", "sauces", "Spice Hunting", "spices"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Curry Paste with Peruvian Flair: Red Curry and Pink Peppercorn Meat Sauce", "link": "https://www.seriouseats.com/recipes/2010/06/red-curry-and-pink-peppercorn-meat-sauce-recipe.html", "description": "Learn more about pink peppercorns here » During the summer my thoughts turn to spicy fare. It makes you sweat, in a good way, and if you can't beat the heat, you may as well fight it on its own...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Condiments and Sauces", "Rice"], "recipeIngredient": ["1 pound ground beef, pork, or bison, lean but not devoid of fat", "4 tablespoons of red curry paste", "1 tablespoon of coriander, toasted and ground", "1 tablespoon of pink peppercorns, toasted and ground", "1 can of coconut milk", "1/4 cup of soy sauce ", "2 tablespoons of Chinese rice wine", "Up to 1 tablespoon of sugar, to taste", "1 1/2 teaspoons of cornstarch dissolved in two teaspoons of water", "Juice of one lime", "Roughly chopped cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet on high heat for several minutes until water sizzles off instantly. Add your meat of choice and brown it well, salting aggressively. When the meat is browned and a little crispy, remove it with a slotted spoon to a plate lined with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain off all but a thin film of the fat and add the curry paste. Stir it constantly until it has slightly darkened in color and is intensely aromatic. Add the ground coriander and pink peppercorns and stir to incorporate for about 15 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the coconut milk, soy sauce, and rice wine, scraping the bottom of the skillet to remove any browned bits. Stir to combine and let it all come to a boil, then reduce it to a simmer for about half an hour, or until the sauce has thickened, the flavors have melded, and the meat is tender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise the heat to high and pour in the cornstarch mixture to let the sauce thicken, stirring, for about a minute. Taste for salt and sugar, then add the lime juice off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a good-sized ladle of sauce to a bowl of noodles, rice, or rice cakes, and garnish with some cilantro.</p>"}]}