{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100823-dt-chickpeas-and-chorizo.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chickpeas", "chorizo", "cous cous", "Dinner Tonight", "mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "5"}, "name": "Dinner Tonight: Chickpeas and Chorizo", "link": "https://www.seriouseats.com/recipes/2010/08/chickpeas-and-chorizo-recipe.html", "description": "I know this dish probably doesn't look like much. It's lumpy and kind of monotone (my wife charitably commented, once I'd put it into bowls, that \"it looks kind of like prison food\").  But like people, all dishes can't be attractive, and certainly not everything that's tasty has to be good-looking.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Legumes", "Pork"], "recipeIngredient": ["1 tablespoon canola oil", "1/2 pound fresh chorizo, meat removed from casing", "1 medium onion, finely chopped", "3 cloves garlic, minced", "1 tablespoon ground cumin", "1 tablespoon ground coriander", "1 tablespoon allspice", "1/4 teaspoon chili powder, or more to taste", "1 15-ounce can chopped tomatoes", "2 cups water", "1 15-ounce can chickpeas, drained", "1 cup cous cous", "Freshly chopped parsley or cilantro for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pan large enough to hold all the ingredients, heat the oil over medium heat.  Once hot, add the chorizo, breaking up in the pan as it cooks, until it has released its oil into the pan and is fully cooked and beginning to crisp.  Remove, leaving the oil in the pan, and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onion to the pan and cook for a few minutes until beginning to soften, then add the garlic.  Cook until the onion is soft, then add the spices and cook for an additional minute to marry the flavors. Pour in the tomatoes, chickpeas, and water.  Bring to a boil and simmer for 5 minutes, then add the chorizo and cous cous and season to taste with salt. Simmer until the cous cous is cooked through and liquid is absorbed (depending on the size and brand of the cous cous, more water may be necessary). Allow to cool a little before serving.  Sprinkle with chopped parsley or cilantro, if desired.</p>"}]}