{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100406%20Caraway%20rye.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "rye bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Caraway (Stone-Ground) Rye", "link": "https://www.seriouseats.com/recipes/2010/04/bread-baking-caraway-stone-ground-rye-recipe.html", "description": "There are a lot of different rye flours available, including light rye, medium rye, and pumpernickel flour. However, my local grocery chains tend to have one brand and one type, and that's <strong>stone-ground rye.</strong> It's a coarser, grittier rye than most of the others that I buy online, but it still makes a nice bread. If your local markets have other varieties of rye flour, use what's available or what you like best.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup whey (or water)", "1 cup stone-ground rye flour", "2 1/2 teaspoons (1 package) instant yeast", "1 tablespoon sugar", "1 1/2 cups bread flour", "1 teaspoon salt", "1 tablespoon olive oil", "2 tablespoons caraway seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The night before you plan on baking, mix the whey and rye flour in the bowl of your stand mixer, cover the bowl with plastic wrap, and let it sit overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, add the yeast, sugar, and one cup of the bread flour. With the bread hook, knead until it is thoroughly mixed, then add the salt and the rest of the bread flour, and knead until the dough begins to become elastic. Because of the rye, this can take a bit of kneading.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the olive oil and caraway seeds and continue kneading until the dough is elastic and no longer sticky. A rye dough will never have the elasticity of an all-white loaf, but you need to develop enough gluten so the bread will hold its shape rather than spread sideways.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a ball, put it back into the bowl, and drizzle it with olive oil to coat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and let it sit until it has doubled in size, about 1 to 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle cornmeal on the bottom of a cast iron dutch oven (or similar pot). Take the dough out of the bowl and knead it briefly and form it into a nice, tight, smooth ball. Put the dough into the dutch oven, cover it, and let it rest for 45 minutes. It should be just about doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the dutch oven into a cold oven, set the heat for 400 degrees and set the timer for one hour. Bake, covered. After an hour, take the pot out of the oven and uncover. It should be nicely browned and fully cooked. If it's not as brown as you like, you can put it back in the oven for another five minutes, uncovered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move the bread to a rack to cool completely before cutting.</p>"}]}