{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101213-128380-chocolate-mint-thumbprints.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2010", "Baked", "Baked Explorations", "chocolate", "Cook the Book", "Cookies", "holiday baking", "holiday cookies", "holiday sweets", "Matt Lewis", "mint", "Renato Poliafito"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Chocolate Mint Thumbprints", "link": "https://www.seriouseats.com/recipes/2010/12/chocolate-mint-thumbprints-cookies-recipe.html", "description": "It wasn't until I baked these <strong>Chocolate Mint Thumbprints</strong> from <em><strong><a href=\"http://www.amazon.com/Baked-Explorations-American-Desserts-Reinvented/dp/1584798505/serieats-20\">Baked Explorations</a></strong></em> that I realized where my longstanding affection for the chocolate-mint flavor combo came from. They call for <a href=\"http://www.tootsie.com/products.php?pid=105\">Andes Mints</a>, those wonderful little green foil-wrapped rectangles of deliciousness.", "totalTime": "1 1/2 hours", "recipeYield": "40 cookies", "recipeCategory": ["Bake the Book", "Chocolate", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the chocolate mint thumbprints:</strong>", "2 ounces good-quality dark chocolate (60 to 72%)", "2 ounces mint chocolate (or Andes mint chocolate candies) ", "1 1/2 cups all-purpose flour ", "1/2 cup dark unsweetened cocoa powder (like Valrhona) ", "3/4 teaspoon salt", "1 cup (2 sticks) unsalted butter, cut into 1-inch cubes, at room temperature", "1⁄3 cup granulated sugar", "2 tablespoons firmly packed dark brown sugar", "2 large egg yolks", "1 teaspoon pure vanilla extract", "1 cup coarse sugar for rolling", "<strong>For the white chocolate filling:</strong>", "3 ounces good-quality white chocolate, coarsely chopped", "3 tablespoons heavy cream", "1/2 teaspoon pure peppermint extract   "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the chocolate mint thumbprints:</strong>  Melt the dark chocolate and mint chocolate together in a microwave or over a double boiler. Whisk until smooth, then set aside to cool.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the flour, cocoa powder, and salt. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing mixer fitted with the paddle attachment, beat the butter until creamy. Add the granulated and brown sugars and beat on medium-high speed until light and fluffy, about 3 minutes. Add the egg yolks and vanilla and beat again until combined. Scrape the chocolate into the mixer and beat just until incorporated. Scrape down the sides and bottom of the bowl and add the flour mixture all at once. Beat on low speed, scraping the side of the bowl occasionally, until the dough is smooth. Transfer it to a sheet of plastic wrap and pat it into a disk; wrap and refrigerate it until it is chilled and firm, at least 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Line two baking sheets with parchment paper. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the coarse sugar into a shallow bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With clean hands, form tablespoon-size dough balls, taking care that they have no lumps or cracks. Roll each ball in the coarse sugar and place it on a prepared baking sheet. Use your thumb or a small dowel to make an indentation in the center of the cookie. Bake for 10 minutes, remove the sheet from the oven, and use your thumb or the dowel to make the indentation more visible. Return the sheets to the oven and bake for another 4 to 5 minutes.</p>\n\n<p>(These are the type of cookies that can overbake very quickly—pull them out at the first signs of cracking.) Set the baking sheets on a wire rack to cool for 5 minutes. Use a spatula to transfer the cookies to the rack to cool completely before filling them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the white chocolate filling:</strong>  Place the white chocolate in a glass measuring cup with a pour spout. Put the cream in a microwave-safe bowl or cup and microwave it on high power until it boils, about 30 seconds. Pour the hot cream over the white chocolate and let stand for 30 seconds, then whisk until smooth. Stir in the peppermint extract. Fill the thumbprint cookies with the white chocolate ganache and refrigerate them until set, about 30 minutes. </p>\n\n<p><small></strong>Note:</strong> These cookies taste great at room temperature or directly from the refrigerator. They can be stored in an airtight container in the refrigerator for up to 3 days.</small></p>"}]}