{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100409-riceballs-finished.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Asian", "keywords": ["desserts", "glutinous rice", "Malaysian", "Seriously Asian", "Seriously Malaysian", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Onde-Onde", "link": "https://www.seriouseats.com/recipes/2010/04/onde-onde-recipe.html", "description": "To learn about other Malaysian starters and desserts, click here. [Photographs: Chichi Wang] The batter for this chewy, soft dough can be made with either water or sweet potatoes. I like the extra bit of sweetness that comes from using...", "totalTime": "", "recipeYield": "approximately 40 dumplings", "recipeCategory": ["Asian", "Desserts", "Sweet Potatoes and Yams"], "recipeIngredient": ["<strong>For the filling</strong>", "2 ounces palm sugar", "&nbsp", "<strong>For the dough</strong>", "1 small sweet potato (about 1/2 pound)", "1 1/4 cups sweet glutinous rice flour", "1 teaspoon vanilla extract", "3 tablespoons water, if needed to moisten the dough", "&nbsp", "<strong>For serving</strong>", "1 cup freshly grated coconut, plain or toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll or cut the sugar into 1/4 inch pieces. Pack them into pea-sized chunks by pressing or rubbing them between damp fingers. Don't worry if the chunks seem flaky or powdery&mdash;the sugar will settle and stay clumped when fashioning the rice balls. Make about 40 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sweet potato in a small saucepan, pour in enough water to cover, and bring to a boil. Cover, reduce the heat to medium, and simmer for 20 minutes until the potato is fork tender. Drain. Once it's cool enough to hand, peel off the skin and press the flesh through a potato ricer into a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the rice flour with the sweet potato and knead with your hands until well mixed. The dough should be very soft and moist, but not sticky. Add additional water or flour until you get a texture that will hold together when rolled into balls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pinch off a small piece of the dough and roll it into a ball about 3/4 inches in diameter. With your index or pinky finger, make a hole in the ball and place the chunk of palm sugar inside, pinching the dough closed to seal the hole. Use water if necessary to make the edges stick together. Place onto a tray dusted with a bit of rice flour, and repeat with the remaining dough.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have a plate with the grated coconut ready. Fill a large pot with water and bring to a boil. Reduce the heat and keep at a steady simmer. Add the dumplings to the water and stir gently. Cook for 4 to 5 minutes, until the surface looks semi-opaque.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the balls from the water with a slotted spoon. Roll the balls around in the grated coconut. Serve at room temperature. The balls will keep, unrefrigerated, for two days. </p>"}]}