{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101210-128208-pumpkin-soup.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["holiday appetizers", "holiday recipes", "soup", "soups", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Pumpkin Soup", "link": "https://www.seriouseats.com/recipes/2010/12/the-crisper-whisperer-classic-pumpkin-soup.html", "description": "Far be it from me to argue with a curried pumpkin soup, or a pumpkin soup with pancetta, or a pumpkin soup with dancing croutons. I love those guys, I really do. What they aren't, though&mdash;what they'll never be&mdash;is the good old classic pumpkin soup that got us all hooked on pumpkin soup in the first place. Nope, they aren't The One. <strong>But this is.</strong>", "totalTime": "90 minutes", "recipeYield": "Makes about 2 quarts, serving 4 to 6", "recipeCategory": ["Crisper Whisperer", "Pumpkin", "Soups and Stews"], "recipeIngredient": ["1 medium sugar pumpkin (about 3 pounds)", "2 tablespoons olive oil", "2 tablespoons unsalted butter", "1 medium onion, finely chopped (about 1 cup)", "6 cups low sodium homemade or store-bought chicken stock", "1/2 teaspoon ground cinnamon (optional)", "1/4 teaspoon ground nutmeg (optional)", "Pinch cayenne pepper (optional)", "2 tablespoons maple syrup", "1/2 to 1 cup heavy cream", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and peheat oven to 400&deg;F. Split pumpkin in half and remove seeds with a large spoon. Rub on all surfaces with oil and place on a parchment-lined rimmed baking sheet, cut-side up. Roast until completely tender and a knife or cake tester inserted near the stem meets little to no resistance, about 1 hour. Remove from oven and allow to cool. When cool enough to handle, scoop out flesh into a medium bowl and discard skin. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt butter in Dutch oven over medium-high heat. Add onions and cook, stirring occasionally, until softened but not browned, about 4 minutes. Add pumpkin flesh, stock, cinnamon, nutmeg, and cayenne. Bring to a boil, reduce to a simmer, and cook for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove Dutch oven from heat. Puree soup with immersion blender or carefully, in batches, in regular blender. For a smoother soup, strain through a fine-mesh strainer. Whisk in maple syrup and add cream to taste. Season to taste with salt and pepper. Reheat gently and serve immediately.</p>"}]}