{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100114-fiaf-cooking.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["beef", "French", "French in a Flash", "mains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Boeuf aux Carottes", "link": "https://www.seriouseats.com/recipes/2010/01/french-in-a-flash-boeuf-aux-carottes-beef-short-ribs-braised-with-carrots-recipe.html", "description": "[Photographs: Kerry Saretsky] Previously White Bean Bisque with Garlic Chips » All French in a Flash recipes » It was a hot summer night in Paris when Mr. English came down from London to keep me a bit of company,...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "French", "Mains"], "recipeIngredient": ["3 pounds beef short ribs", "2 tablespoons olive oil, plus 1 teaspoon", "12 carrots, peeled (cut 6 into thirds, and 6 into penny coins about 1/2-inch thick)", "2 cups peeled pearl onions (I use thawed frozen pearl onions)", "2 cloves garlic, smashed", "1 bunch of chervil, leaves chopped, stems reserved", "3 juniper berries, crushed (optional)", "2 bay leaves", "1/2 cup dry red wine", "3 cups beef stock", "2 tablespoons butter, room temperature", "2 tablespoons flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide, deep pan, heat 2 tablespoons oil on medium-high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the meat well with salt and pepper, and sear the short ribs in the hot oil until crusted and browned on all 6 sides. Set the meat aside, and discard the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 teaspoon fresh olive oil to the pan, and reduce the heat to medium low. Add the 6 carrots which you have cut into thirds, reserving the copper penny carrots until later. Add the pearl onions, and garlic, and chervil stems, and bay leaves, and juniper berries. Season with salt and pepper, and sauté gently until the garlic is fragrant&mdash;about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the red wine, and allow it to lift any dark bits of meat from the bottom of the pan. Simmer for 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle the meat back into the pan with the vegetables, and add the beef stock. Bring to a boil over high heat, then cover, and reduce heat to low and simmer for 2 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 2 1/2 hours, add in the copper penny carrots. Stir into the broth, and cover, simmering another 30 minutes, so the meat will cook 3 hours in total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a beurre manié by smashing the butter and flour together. Set aside. This step is optional: it turns a runny, brothy sauce into something thick and coating, but you can either omit the thickening agent altogether, use half of it, or use all of it, depending on how you like your stews.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 3 hours, pull out the large chunks of carrots that have cooked for three hours, and the chervil stems and bay leaves and juniper berries if you can find them. Discard. Skim off as much fat from the surface of the stew as you can.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add in the beurre manié, if you are using it, and allow the stew to bubble for 5 minutes to thicken. Just before serving, stir in the chervil leaves.</p>"}]}