{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101216-129535-thai-style-minced-chicken-with-basil-and-chiles.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Thai", "keywords": ["Asian", "chicken", "Dinner Tonight", "stir fry", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8", "ratingCount": "5"}, "name": "Dinner Tonight: Thai-Style Minced Chicken with Basil and Chiles", "link": "https://www.seriouseats.com/recipes/2010/12/dinner-tonight-thai-style-minced-chicken-with-basil-chiles-stir-fry.html", "description": "This tasty ten-minute dinner is easy once your prep is done. In French cooking, mise en place is a virtue; but when you have a screaming hot wok and literally seconds between success and disaster, it's a requirement.", "totalTime": "10 minutes", "recipeYield": "4 people", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains", "Stir Frying", "Thai"], "recipeIngredient": ["1 pound ground chicken, or boneless, skinless meat chopped in a food processor", "2 tablespoons peanut oil, divided", "1 small yellow onion, thinly sliced into crescents", "1 red or orange bell pepper, cut into 1/2 inch strips and then into diamonds", "1 tablespoon minced garlic", "1-2 jalapeno or serrano chiles, cut crosswise into rings", "1 tablespoon Thai black soy sauce", " 1 tablespoon Thai or Vietnamese fish sauce", " 1 cup fresh basil leaves, thinly sliced", " Ground pepper to taste", " 2 cups cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In wok or other stir-fry pan, heat 1 tablespoon of the oil over high heat until just smoking, then add the onion. Stir-fry for 1 minute, then add bell pepper and stir-fry for an additional minute. Add garlic and cook for another 30 seconds, then remove the pan from the heat and scrape contents into bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining two tablespoons oil over high heat until just smoking, then add chicken all at once. Spread evenly in skillet and cook, without stirring until golden brown, 1 to 2 minutes. Stir-fry until pink is completely gone and chicken is cooked through, about 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return cooked vegetables to pan and add chiles. Stir-fry for 1 minute, then add the soy sauce and cook for 15 seconds. Follow with fish sauce and basil leaves and cook until just wilted, then season with pepper.  Taste for balance, adding soy sauce, fish sauce, or more pepper as needed.  Serve immediately with rice.</p>"}]}