{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100221redriceomelet.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "eggs", "frittatas", "Sunday Brunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Red Rice Frittata", "link": "https://www.seriouseats.com/recipes/2010/02/sunday-brunch-red-rice-frittata-breakfast-eggs-recipes.html", "description": "[Photo: Robin Bellinger] As a native Houstonian, I had at least heard of most of the buffet staples featured in The Lee Bros. Southern Cookbook, but a few were completely new to me, reminders that Texas has never been strictly...", "totalTime": null, "recipeYield": "2-3, with rice to spare", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Vegetarian"], "recipeIngredient": ["3 ounces slab bacon or 2 slices thick-cut bacon cut into small dice", "1 large yellow onion, chopped", "3 cloves garlic, crushed", "1 1/2 cups long-grain white rice", "2 cups chicken broth or water", "1 15-ounce can chopped tomatoes", "1 teaspoon crushed red pepper flakes", "1 teaspoon pimentón or paprika", "Salt", "Freshly ground pepper", "6 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°. In a medium saucepan over medium heat, fry the bacon until firm and barely crisp, about 4 minutes. Add the onion and garlic and cook until softened, about 5 minutes. Add the rice and cook, stirring frequently, for a minute or two, until fragrant and slightly translucent. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the broth or water, tomatoes, pepper flakes, pimentón, 1 teaspoon salt, and 1/2 teaspoon pepper and stir to combine. Bring to a simmer, then cover and turn the flame as low as possible. Cook for about 20 minutes, until the rice is tender but still soupy. If not soupy, add more broth or water a tablespoon at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cooked rice into an 8 x 8 baking dish and bake on the middle rack of the oven for 15-25 minutes, or until all the liquid had been absorbed. At this point, you can proceed to the next step or cool and refrigerate the rice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your broiler. Melt a tablespoon of butter in a 10-inch ovenproof skillet and stir in about a third of your rice. Beat the eggs with salt and pepper. When the rice is heated through, add the eggs to the skillet and quickly stir to combine the rice and eggs evenly. Turn the heat to medium low and cook, rotating the skillet every once in a while, until the frittata has firmed up around the edges, about 10 minutes. </p>"}]}