{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090808inseasonpeaches.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cobbler", "Cook the Book", "John Ferrell", "Mary Mac's Tea Room", "peaches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Georgia Peach Cobbler", "link": "https://www.seriouseats.com/recipes/2010/07/cook-the-book-georgia-peach-cobbler-recipe-dessert.html", "description": "While I can't call the cobbler I made an authentic <strong>Georgia Peach Cobbler</strong> since I'm pretty sure my peaches hailed from New Jersey, it was incredible.  The peaches are peeled and sliced, and then mixed with sugar, nutmeg, cinnamon, vanilla, a bit of cornstarch, and then dotted with an entire stick of butter.  The topping is somewhere in between a pie crust and a biscuit, made in the stand mixer and incredibly easy to roll out.  While baking the peach juices mix with the butter and sugar, creating a liquid that seeps up over the crust and is delicious enough to eat by the spoonful.", "totalTime": null, "recipeYield": "8 to 10", "recipeCategory": ["Bake the Book", "Cook the Book", "Desserts", "Peach", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["2 pounds fresh fruit or 1 (16-ounce) can sliced peaches in heavy syrup, undrained ", "1 cup plus 3/4 teaspoon sugar ", "1 teaspoon freshly squeezed lemon juice ", "1/4 teaspoon ground cinnamon ", "1/8 teaspoon ground nutmeg ", "1 teaspoon pure vanilla extract ", "2 teaspoons cornstarch ", "8 tablespoons (1 stick) salted butter, cut into small pieces  ", "1/2 cup shortening ", "3/4 teaspoon salt ", "1 3/4 cups all-purpose flour ", "1/3 cup ice water (with crushed ice) ", "2 tablespoons (1/4 stick) unsalted butter, melted   "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Peel and slice the fresh fruit. (If using canned fruit, taste before adding the sugar.) Place the fruit in a bowl and add 1 cup of the sugar, lemon juice, cinnamon, nutmeg, vanilla, and cornstarch. Toss together gently. Pour the sweetened fruit into a 13 by 9-inch baking dish and dot with the butter pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the work bowl of a stand mixer with the paddle attachment, on medium speed, beat the shortening, salt, and the remaining 3/4 teaspoon sugar. Gradually add 1/2 cup of the flour to the shortening mixture and mix together lightly. When the mixture becomes stiff, add 1 tablespoon of the ice water. Repeat the process until all the flour and water is used. The mixture should be soft, but not wet. Cover and let chill for 30 to 40 minutes. Roll out on a floured surface to a 13 by 9 1/2-inch rectangle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the fruit with the pastry, crimping the edges. Make 3 or 4 slits in the pastry with a sharp knife for steam to escape. Brush the crust with the 2 tablespoons of melted butter. If using fresh fruit, cook for 1 hour. If using canned fruit, cook for 25 to 30 minutes at 400˚F. The cobbler is done when the pastry is golden. Serve warm with vanilla ice cream or whipped cream. </p>"}]}