{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100121-bakedbeans.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baked beans", "beans", "Cook the Book", "Cooking Under Pressure", "Lorna Sass", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Boston 'Baked' Beans", "link": "https://www.seriouseats.com/recipes/2010/01/boston-baked-beans-pressure-cooker-recipe.html", "description": "[Photograph: Caroline Russock] My consumption of baked beans is usually limited to barbecue joints but I was dying to see how dried beans would fare in the pressure cooker. This recipe for Boston \"Baked\" Beans from Cooking Under Pressure by...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Pressure Cooker", "Sides", "Vegetarian"], "recipeIngredient": ["1 1/2 cups dried navy beans, picked over and rinsed", "2 bay leaves", "1 1/2 quarts (6 cups) water", "2 tablespoons oil, divided", "1 large onion, coarsely chopped", "2 large garlic cloves, minced", "1/4 cup molasses", "1/4 cup Dijon-style mustard", "1/4 cup tomato paste", "4 whole cloves", "One 3-inch stick cinnamon, broken in two", "1 to 3 teaspoons cider vinegar", "1 teaspoon salt, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the beans, bay leaves, water, and 1 tablespoon oil in the cooker. Lock the lid in place and over high heat bring to high pressure. Adjust the heat to maintain high pressure and cook for 15 minutes. Reduce the pressure by placing the cooker under cold running water. Remove the lid, tilting it away from you to allow steam to escape. Drain the beans, reserving the liquid. Return the beans and 2 cups of liquid to the cooker. Discard any remaining liquid or reserve it for making your next soup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining tablespoon of oil in a skillet. Saute the onions and garlic until the onions begin to brown around the edges, 3 to 4 minutes. Stir in the molasses, mustard, tomato paste, cloves, and cinnamon. Pour the mixture on top of the beans. <em>Do not stir.</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lock the lid in place and over high heat return to high pressure.  Adjust the heat to maintain high pressure and cook for an additional 10 minutes. Remove the lid, tilting it away from you to allow steam to escape. If the beans are not tender, replace (but do not lock) the lid and simmer until done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before serving, remove the cloves, bay leaves, and cinnamon sticks. The mixture will thicken on standing, but if you wish to thicken it immediately, pur&eacute;e some of the beans and stir the puree back in. Stir in the vinegar and salt.</p>"}]}