{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101227-129764-shortbread-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cookie a day 2010", "Cookies", "holiday baking", "holiday sweets", "Sarabeth Levine", "Sarabeth's Bakery", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bake the Book: Shortbread Cookies", "link": "https://www.seriouseats.com/recipes/2010/12/shortbread-cookies-sarabeth-bakery-recipe.html", "description": "Super light and flaky with just the slightest hint of lemon zest, these are some of the best shortbread cookies I've ever made.  Unlike other recipes that can get overly cakey and crumbly to the point of falling apart, these roll out thin and bake up tender.  The cookies are finished with a sprinkling of sugar immediately after they come out of the oven.  The heat from the cookies adheres the sugar to the tops, giving them a tiny sugar crust.", "totalTime": null, "recipeYield": "3 dozen cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["16 tablespoons (2 sticks) unsalted butter, at room temperature, cut into ½-inch cubes", "½ cup superfine sugar", "½ teaspoon pure vanilla extract", "Grated zest of ½ lemon ", "2 cups unbleached all-purpose flour", "⅛ teaspoon fine sea salt", "½ cup granulated sugar, for sprinkling "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the center and top third of the oven and preheat to 350°F. Line two half-sheet pans with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter in the bowl of a heavy-duty stand mixer fitted with the paddle attachment on medium-high speed until the butter is smooth, about 1 minute. Gradually add the superfine sugar, then the vanilla and lemon zest, mixing until light in color and texture, about 3 minutes. Reduce the mixer speed to low. In thirds, add the flour and salt. Mix, scraping down the sides of the bowl to be sure the dough is well combined, until the dough cleans the sides of the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough on a lightly floured work surface and knead briefly until smooth. Dust the work surface and the top of the dough with flour, and roll out the dough into a ¼-inch-thick rectangle. Using a 2½-inch round fluted cookie cutter, cut out the cookies, and place them 1 inch apart on the half-sheet pans. Gather up the scraps, roll out, and cut out more cookies until all of the dough has been used. Refrigerate the cookies until chilled, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, switching the position of the pans from top to bottom and front to back halfway through baking, until the edges are very lightly browned, about 15 minutes. Remove from the oven and immediately sprinkle the cookies lightly with the granulated sugar (the sugar will not stick if the cookies aren’t hot). Cool completely on the pans.</p>\n\n<p><small><strong>Note:</strong> The cookies can be stored in an airtight container at room temperature for 5 days.</small></p>"}]}