{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100301-ctb-rillettes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["appetizers", "charcuterie", "Cook the Book", "John Besh", "pork", "rillettes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pork Shoulder Rillettes", "link": "https://www.seriouseats.com/recipes/2010/03/pork-shoulder-rillettes-charcuterie-appetizer-recipe.html", "description": "The chapter devoted to all things porcine in <strong><em>My New Orleans</em></strong> by <strong>John Besh</strong> is called <em>Boucherie</em>, and has several delicious-sounding pork-based charcuterie projects including these <strong>Pork Shoulder Rillettes</strong>. This version slow cooks pork butt with chicken stock, lard, wine, and a few other aromatics until it's tender enough to shred into a million tasty little pieces.", "totalTime": null, "recipeYield": "10 to 15 small jars", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Pork"], "recipeIngredient": ["1 pound lard", "3 onions, chopped", "One 4 to 5 pound boneless Boston butt pork roast", "Salt", "Freshly ground black pepper", "5 cloves garlic, chopped", "1 celery stalk, halved", "1 quart chicken stock", "1 cup white wine", "2 sprigs fresh thyme", "2 bay leaves", "1 teaspoon crushed red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the lard in a large enameled cast-iron pot with a lid over moderate heat.  Add the onions and cook, stirring occasionally, until they are very soft and translucent, about 10 minutes.  While the onions are cooking, cut the pork into large pieces and season with salt and pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pork to the pot along with the garlic, celery, chicken stock, wine, thyme, bay leaves, and pepper flakes.  Increase the heat to medium-high and bring to a gentle boil.  Reduce the heat to low, cover, and slowly simmer for 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork from the pot and place in the bowl of a standing mixer fitted with the paddle attachment, and mix on low speed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and discard the celery, thyme sprigs, and bay leaves from the pot.  Slowly add the remaining broth from the pot to the meat in the mixing bowl, continue mixing on low speed until all the broth has been incorporated back into the meat.  Season with salt and pepper.  Pack the cooled pork in a terrine or in small sterilized jars.  Cover well and refrigerate.  Jarred rillettes will keep for 6 months.</p>"}]}