{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101104-dt-farro-with-roasted-kale-and-beets.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beets", "Dinner Tonight", "farro", "goat cheese", "kale", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Farro Salad with Roasted Kale and Beets", "link": "https://www.seriouseats.com/recipes/2010/11/dinner-tonight-farro-salad-with-roasted-kale-and-beets-recipe.html", "description": "Nothing beats the deep flavor of caramelization the oven provides. That was the only inspiration for this recipe&mdash;that and a bag of farro in the pantry, the nutty grain that's as healthy as brown rice but cooks in half the time (while tasting twice as good).  I was surprised at how delicious it all came out, the way simple in-season food often does.", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Dinner Tonight", "Kale", "Vegetarian"], "recipeIngredient": ["3 beets, peeled and thinly sliced on a mandoline", "2 bunches kale, tough ribs removed and leaves roughly torn", "3 cloves garlic, thinly sliced", "3 tablespoons olive oil", "Salt and freshly ground black pepper to taste", "1 pound farro (pearlized)", "2 tablespoons lemon juice from 1 lemon", "3 ounces fresh goat cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400°F. Spread  beets, kale, and garlic on rimmed baking sheet and drizzle with the olive oil. Season with salt and pepper, and toss to combine. Roast until the beets are soft and the kale is tender, 20-30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cover farro with cold water in  medium saucepan, season with salt, and bring to a boil over high heat. Reduce heat to a simmer and cook until tender, about 30 minutes. Drain excess water, then add roasted vegetables and toss to combine. Season to taste with salt, pepper, and lemon juice and divide amongst bowls. Crumble goat cheese and serve hot or warm.</p>"}]}