{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100610-dt-fava-beans-and-zucchini-with-garlicky-croutons.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beans", "fava beans", "salads", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Fava Beans with Grilled Zucchini and Homemade Garlicky Croutons", "link": "https://www.seriouseats.com/recipes/2010/06/dinner-tonight-fava-beans-with-grilled-zucchini-and-homemade-garlicky-croutons-recipe.html", "description": "The combination of flavors and textures in this salad keeps it interesting: just-soft grilled zucchini, al dente fava beans, the garlicky crunch of homemade croutons, and the salty crumble of Parmesan cheese.", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Salads", "Vegetarian"], "recipeIngredient": ["1 1/2 cups shelled fava beans, about 1 pound fava bean pods", "5 tablespoons good olive oil, more as needed", "1 1/2 cloves garlic, minced", "1 tablespoon dried thyme", "1 few slices stale baguette or other crusty bread, cut into pieces", "2 zucchini or yellow summer squash", "1/2 cup mint leaves", "1/2 cup shaved Parmesan", "2 tablespoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. Bring a pot of salted water to boil and cook the fava beans uncovered until the beans are just tender, about 5 minutes.  Transfer to an bowl full of ice water to cool them quickly and set the color, then slip the beans from their skins and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, whisk together 2 tablespoons of olive oil with 1 clove of the minced garlic, the thyme, and a teaspoon of salt.  Add the bread and toss to coat, then bake for 10 minutes, stirring once halfway through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the ends of the zucchini and cut them into strips, then drizzle with olive oil and a few pinches of salt. Heat a ridged grill pan (or a regular skillet will work) over high heat and grille or cook the zucchini for about 2 minutes/side, until cooked but not mushy. Allow to cool, then cut into bite-sized pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the zucchini, fava beans, and mint with the remaining garlic, lemon juice, and a tablespoon of olive oil.  Season with salt and pepper, then transfer to bowls and top with croutons and Parmesan cheese. Serve.</p>"}]}