{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100316DijonChicken610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["chicken", "French", "French in a Flash", "mains", "mustard", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Dijon Chicken", "link": "https://www.seriouseats.com/recipes/2010/03/french-in-a-flash-dijon-chicken-recipe.html", "description": "Dijon chicken is simple, but hearty. The chicken has the fall-off-the bone texture of a stew, but enrobed in a thick sauce of cream and aromatic Dijon mustard. Refined and rustic and served with a hearty, warm baguette, it satisfies everyone at the table.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "French", "Mains"], "recipeIngredient": ["3 tablespoons light olive oil, plus 1 tablespoon", "10 chicken legs", "2 cloves garlic, chopped", "4 shallots, diced", "3/4 cup white wine", "1 1/2 cups low-sodium chicken stock", "6 stems thyme, plus extra for garnish", "1/2 cup Dijon mustard", "1/2 cup cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide, heavy-bottomed pan, heat 3 tablespoons light olive oil on medium-high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken legs with salt and pepper, and pat dry with paper towel.  Sear in the hot oil until golden-brown on all sides.  Remove to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour out the hot chicken oil, and lower the heat to low. Add 1 tablespoon fresh light olive oil to the pan. Add in the shallot, and then the garlic 1 minute later, and sauté just until translucent and fragrant&mdash;two minutes total from the time the shallots went into the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the white wine, and raise the heat to medium-high. Reduce the wine&mdash;it will bubble the chicken bits up from the bottom of the pan, and reduce by about half. Then add the chicken stock and 6 stems of thyme. Then, nestle the chicken back into the pan in a single layer. Bring the liquid to a boil, then lower the heat to a simmer, and cover the pot, simmering for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 30 minutes, remove the cover from the pot, and allow the chicken to simmer a further 5 to 10 minutes uncovered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the pan off the heat. Again, remove the chicken from the pan.  Whisk in the cream and the mustard until the sauce is homogeneous. Then strain. Toss the chicken with the Dijon sauce, top with fresh thyme, and serve right away with crusty bread and a salad.</p>"}]}