{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101013apples.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["apple cider", "apples", "browned butter", "butter", "desserts", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Scooped: Apple, Browned Butter, &amp; Sour Cream Ice Cream", "link": "https://www.seriouseats.com/recipes/2010/10/apple-browned-butter-sour-cream-ice-cream-recipe.html", "description": "The time has come for us to end this ice cream series, October being halfway to Halloween. We wanted something to complement fall's palette of desserts: crumbles, crisps, cakes, and quickbreads, filled with apples, pears, walnuts, and cinnamon. With that in mind, apples and sour cream were a no-brainer, a lusciously tart rejoinder to rustic late-harvest food.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Apple", "Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 stick (8 tablespoons) butter, cut into small chunks <em>[OR 2 sticks for second version]</em>", "4 cups apple cider, plus one tablespoon, divided (see note)", "1/2 teaspoon freshly grated nutmeg", "2 cups sour cream", "3/4 cup whole milk", "1/4 cup brown sugar <em>[OR 1/2 cup for second version]</em>", "1 teaspoon vanilla extract", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet, melt butter on medium heat. When fully melted, increase heat and let butter brown to a rich amber. When the color has darkened significantly and you see black particles in the pan, pour off into a heat-proof container, straining out the black particles on the bottom, and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, bring the four cups of apple cider to a boil and add the nutmeg. Reduce until you have 1/2 cup of syrup, about 20 minutes. Do not reduce further. Keep an eye on it when bubbles start stacking up, as it will reduce very quickly. Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together sour cream, milk, brown sugar, vanilla, and salt in a large bowl. When the butter and apple cider syrup have cooled, whisk them in very thoroughly. The butterfat must be completely emulsified into the base, or it will get grainy when frozen. You can do this step in your blender if you like. Add the last tablespoon of apple cider, cover, and refrigerate overnight. The base will also keep for up to a week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, spin the base in your ice cream maker according to manufacturer's instructions. The ice cream is at its peak at this point as soft-serve, or after an hour in the freezer, which will firm it up a bit. If you plan to serve it later, leave it to thaw on the counter for at least half an hour before serving, or it will be grainy. </p>"}]}