{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100922gotobeefdaube.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "French", "keywords": ["Around My French Table", "beef", "Cook the Book", "Dorie Greenspan", "French", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Dorie Greenspan's Go-To Beef Daube", "link": "https://www.seriouseats.com/recipes/2010/09/dorie-greenspans-go-to-beef-daube-stew-recipe.html", "description": "When <a href=\"http://doriegreenspan.com/about.html\">Dorie Greenspan,</a> author of <strong><em><a href=\"http://www.amazon.com/Around-My-French-Table-Recipes/dp/0618875530/serieats-20\">Around My French Table</a></em></strong> says this version of <strong>Beef Daube</strong> is her go-to recipe for the French classic, there's really no doubt in my mind that it's going to be incredible.  Luckily, the cool temperatures over the weekend made this <strong>beef stew</strong> a perfect way to dive into fall and winter braises.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Beef", "Cook the Book", "French"], "recipeIngredient": ["4 slices thick-cut bacon, cut crosswise into 1-inch-wide pieces", "One 3 1/2-pound beef chuck roast, fat and any sinews removed, cut into 2- to 3-inch cubes", "2 tablespoons mild oil (such as grapeseed or canola)", "Salt and freshly ground pepper", "2 yellow onions or 1 Spanish onion, quartered and thinly sliced", "6 shallots, thinly sliced", "1 garlic head, halved, horizonally, only loose papery peel removed", "1 1/2 pounds carrots, trimmed, peeled, halved crosswise, and halved or quartered lengthwise, depending on thickness", "1/2 pound parsnips, trimmed, peeled, halved crosswise, and quartered lengthwise (optional)", "1/4 cup Cognac or other brandy", "1 bottle fruity red wine (I know this sound sacrilegious, but a Central Coast Syrah is great here)", "A bouquet garni&mdash;2 thyme sprigs, 2 parsley sprigs, 1 rosemary sprig, and the leaves from 1 celery stalk, tied together in a piece of cheesecloth "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a Dutch oven over medium heat and toss in the bacon. Cook, stirring, just until the bacon browns, then transfer to a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the beef between sheets of paper towels. Add 1 tablespoon of the oil to the bacon fat in the pot and warm it over medium-high heat, then brown the beef, in batches, on all sides. Don’t crowd the pot&mdash;if you try to cook too many pieces at once, you’ll steam the meat rather than brown it&mdash;and make sure that each piece gets good color. Transfer the browned meat to the bowl with the bacon and season lightly with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off the oil in the pot (don’t remove any browned bits stuck to the bottom), add the remaining tablespoon of oil, and warm it over medium heat. Add the onions and shallots, season lightly with salt and pepper, and cook, stirring, until the onions soften, about 8 minutes. Toss in the garlic, carrots, and parsnips, if you’re using them, and give everything a few good turns to cover all the ingredients with a little oil. Pour in the brandy, turn up the heat, and stir well so that the brandy loosens whatever may be clinging to the bottom of the pot. Let the brandy boil for a minute, then return the beef and bacon to the pot, pour in the wine, and toss in the bouquet garni. Once again, give everything a good stir. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the wine comes to a boil, cover the pot tightly with a piece of aluminum foil and the lid. Slide the daube into the oven and allow it to braise undisturbed for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull the pot out of the oven, remove the lid and foil, and stir everything up once. If it looks as if the liquid is reducing by a great deal (unlikely), add just enough water to cover the ingredients. Recover the pot with the foil and lid, slip it back into the oven, and cook for another 1 1/2 hours (total time is 2 1/2 hours). At this point the meat should be fork-tender&mdash;if it’s not, give it another 30 minutes or so in the oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste the sauce. If you’d like it a little more concentrated (usually I think it’s just fine as is), pour the sauce into a saucepan, put it over high heat, and boil it down until it’s just the way you like it. When the sauce meets your approval, taste it for salt and pepper. (If you’re going to reduce the sauce, make certain not to salt it until it’s reduced.) Fish out the bouquet garni and using a large serving spoon, skim off the surface fat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the beef and carrots moistened with sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storing:</strong> Like all stews, this can be kept in the refrigerator for about 3 days or frozen for up to 2 months. If you are preparing the daube ahead, don’t reduce the sauce, just cool the daube and chill it. Then, at serving time, lift off the fat (an easy job when the daube’s been chilled), reduce the sauce, and season it one last time.</p>"}]}