{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/11.7.2010piepopstep7.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "foods on a stick", "holiday baking", "pie pops", "pies", "Thanksgiving sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8", "ratingCount": "5"}, "name": "Cakespy: How to Make Pumpkin Pie Pops", "link": "https://www.seriouseats.com/recipes/2010/11/cakespy-pumpkin-pie-pops-thanksgiving.html", "description": "Riddle me this: what <em>doesn't</em> taste better on a stick? While you ponder that epic question, let me introduce you to a pint-sized pop of flavor guaranteed to delight your dining companions this Thanksgiving: <strong>the Pumpkin Pie Pop.</strong>", "totalTime": "", "recipeYield": "18-24 pops, depending on thickness of crust", "recipeCategory": ["Cakespy", "Pies, Tarts, and Crumbles", "Pumpkin"], "recipeIngredient": ["2 unbaked 9-inch pie dough crusts", "3/4 cup brown sugar", "1/2 teaspoon salt", "1 teaspoon ground cinnamon", "1 teaspoon ground ginger", "1/4 teaspoon ground cloves", "2 large eggs", "1 can (15 ounces) plain pumpkin (not spiced)", "1 can (12 ounces) sweetened condensed milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix sugar, salt, and spices in a small bowl; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat eggs in a separate large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the pumpkin and the sugar and spice mixture into the bowl with the beaten eggs and stir well, until fully combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually stir in the sweetened condensed milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set your pie filling mixture to the side for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your pie dough. Roll out one of the unbaked pie crusts on a well-floured surface until it is about 9 inches in diameter, just as if you were baking a full-sized pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour the top of the rolled crust, and using a cookie cutter, biscuit cutter, or even an overturned glass or jar, cut out as many circles or rounds as you can. You can gather the scraps and roll out the remaining dough to get a few more cutouts. Repeat with your second batch of pie dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half  pie dough rounds on two cookie sheets, and press lollipop sticks into each of them, making sure that it is about 3/4 of the way up on the round. Stagger the placement of your rounds to accommodate the lollipop sticks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After you've pressed the lollipop stick into the round, place a small spoonful of pie filling in the center of each round, leaving about half an inch around to allow for pressing the top crust on the sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the top crust: gently place a second round on top of the crust with a spoonful of filling, and using a fork, gently press the tines all around the sides to ensure that the pie pops are sealed and that the filling will not leak. If some of the filling comes out while you are doing this, it's OK. Press the fork tines on the top of the pie pop once or twice to allow air to escape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, brush the tops of the pie pops with an egg wash. I did not do this, but they came out fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. Place your pie pops in the oven and reduce heat to 350&deg;F. Bake for about 15 minutes, or until golden around the edges.</p>"}]}