{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101028pumpkinhash.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "hash", "pancetta", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Pumpkin, Pancetta and Potato Hash", "link": "https://www.seriouseats.com/recipes/2010/10/sunday-brunch-pumpkin-pancetta-potato-hash-breakfast-brunch.html", "description": "<strong>Pumpkin is on everyone's mind (and porch) today</strong>, but while there are many great recipes for pumpkin pies, cakes and waffles, there are fewwe great savory pumpkin recipes.  The inherent issue with pumpkin is that it's rather sweet, and can tend towards mushy or even slimy if prepared wrong.  Tempering the sweetness of the pumpkin with dense Yukon gold potatoes and salty pancetta turns a fantastic ingredient once relegated to soups and sweets into the star of brunch.", "totalTime": "30 minutes", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Halloween", "Potato", "Pumpkin"], "recipeIngredient": ["4 oz pancetta, cut into 1/2-inch cubes", "1 medium onion, diced (about 1 cup)", "4 large Yukon gold potatoes, peeled and chopped into ½ inch dice (about 4 cups)", "1/2  teaspoon crushed red pepper flakes", "1/2 cup water", "1/2 a medium pumpkin (or other winter squash, like butternut or acorn) peeled and chopped into 1/2 inch dice (about 2 cups)", "Salt and pepper", "4 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry pancetta in a large non-stick skillet over medium-low heat until crisp, about 8 minutes; remove from pan and reserve fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to medium and add diced onion to skillet with pancetta fat and cook, stirring frequently, until translucent, about 4 minutes.  Add diced potatoes, red pepper flakes and water, cover and cook over high heat until potatoes are soft (about 5 minutes)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once potatoes are soft and water has evaporated remove cover and add pumpkin. Cook with lid ajar until pumpkin is soft and both pumpkin and potatoes are beginning to brown, stirring often with wooden spoon to prevent sticking, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pancetta to pan and season to sate with salt and pepper. Divide hash evenly between four plates.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry eggs on medium-high heat in fat leftover in pan until the whites are set but the yolks are runny.  Top hash with fried eggs and serve with fried green tomatoes.</p>"}]}