{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/100313Polenta_Mushroom_Leek_Ragout_Primary.jpg", "author": {"@type": "Person", "name": "MichaelNatkin"}, "recipeCuisine": "Italian", "keywords": ["balsamic vinegar", "cheese", "Gorgonzola", "Italian", "leeks", "mushrooms", "polenta", "Seriously Meatless", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Meatless: Polenta with a Leek and Mushroom Ragu", "link": "https://www.seriouseats.com/recipes/2010/03/vegetarian-polenta-with-a-leek-and-mushroom-ragu-recipe.html", "description": "Top-quality gorgonzola and aged balsamic vinegar elevate this easy-to-make polenta into a delicious vegetarian meal. By the way, don't listen to anyone who says you need to stir polenta constantly for the entire 45 minutes or so that it takes to become smooth. Just give it a good beating every so often, and make sure it has enough water so it won't scorch.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cheese", "Italian", "Mushrooms", "Other Grains", "Seriously Meatless", "Vegetarian"], "recipeIngredient": ["8 cups water", "1 tablespoon Kosher salt", "2 cups medium or coarse yellow cornmeal (polenta)", "2 tablespoons butter (or more to taste)", "1 cup grated Parmigiano-Reggiano", "3 tablespoons extra-virgin olive oil", "3 leeks, white and tender green parts only, cleaned and cut into thin semicircles", "4 cloves garlic, finely sliced", "pinch of chili flakes", "1.5 pounds crimini mushrooms, sliced about 1/8\" thick", "1/2 cup dry white wine", "Kosher salt", "2 tablespoons minced flat leaf parsley + a few leaves for garnish", "6 ounce gorgonzola dolce, cubed", "aged balsamic vinegar (tradizionale or condimento grade - not the thin, sour grocery store stuff)", "Finishing salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water and 1 tablespoon of salt to boil in a medium sized pot (say around 5 quarts). Whisk in the polenta in a thin stream. Reduce to a bare simmer. Stir occasionally but thoroughly to release the starch and avoid scorching. If it seems to be getting too thick, add more water, 1/2 cup at a time. Be careful, polenta likes to \"burp\" and shoot hot goo on to your arm.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After about 45 minutes, you should see a change where the grains of cornmeal become less distinct and the porridge smoother. At that point, stir in the butter and Parmigiano-Reggiano. Taste and adjust the seasoning. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat up a large skillet over a medium high flame. Add the oil, and a few seconds later, the leeks, garlic, chili flakes and 1/2 teaspoon salt. Cook, stirring occasionally, until the leeks are tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the mushrooms and continue frying until they give up their liquid and then dry out and begin to brown. Deglaze the pan with the white wine. Taste and adjust salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve, bring the polenta back to temperature if it has cooled down. Stir the minced parsley into the mushrooms. Put a serving of polenta in a warmed bowl and top with the mushroom ragout. Garnish with the cheese (right on the polenta so it begins to melt), the parsley leaves, a generous drizzle of fine balsamic vinegar and a few grains of good finishing salt.</p>"}]}