{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100526matcha.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["Cookies", "green tea", "ice cream", "matcha", "Spice Hunting", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Matcha Ice Cream and Cookies", "link": "https://www.seriouseats.com/recipes/2010/05/matcha-green-tea-ice-cream-cookies-desserts-recipe.html", "description": "[Photograph: Sam Bowman] Good matcha ice cream is hard to find. It's often too sweet and lacking in depth, which is why I consider it the perfect candidate to try at home. And with summer approaching, and the idea of...", "totalTime": null, "recipeYield": "a scant quart", "recipeCategory": ["Desserts"], "recipeIngredient": ["<strong>Ingredients for Matcha Ice Cream</strong>", "2 cups heavy cream", "1 cup whole milk", "6 egg yolks", "1 1/2 cups of sugar", "1/4 cup matcha", "1 teaspoon vanilla extract", "<strong>Ingredients for Matcha Cookies</strong>", "1 cup of all-purpose flour", "1/4 cup of matcha", "1 pinch of salt", "1 stick of unsalted butter, softened", "2/3 cup of sugar", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Procedure for Matcha Ice Cream</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set cream and milk on low heat, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, beat the egg yolks with the sugar till smooth and a little lighter in color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Temper the eggs. When the cream mixture is warm, add it, one ladle at a time, to the egg-sugar mixture, whisking vigorously. After you've added about a quarter of the cream mixture this way, pour the rest in and whisk till combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour everything back into the pot and keep on low heat, reserving a little bit of the custard in the bowl. Add the matcha and whisk to form a concentrated paste. The matcha clumps easily, but smooth it out as best you can. A few small lumps aren't a problem.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add this concentrate to the pot and stir to combine. Keep the heat as low as possible to prevent the eggs from curdling. Stir the custard until it coats the back of a wooden spoon and a finger wipes a clean stripe. Add the vanilla, then cook for one minute longer. Don't let it sit on the heat any longer than you have to; the matcha \"brews\" almost instantly and excess heat exposure can make it bitter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the custard through a fine-mesh strainer into a bowl in an ice bath or a shallow, wide baking dish and let it cool completely. Then move it to your ice cream maker and freeze according to the manufacturer's instructions. If you don't have an ice cream maker, put the custard in the freezer and stir it up about every half hour, mixing the solids and liquids, till it has the consistency of ice cream. The results won't be quite the same&mdash;it won't be as airy&mdash;but it'll still be lusciously creamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Procedure for Matcha Cookies</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the flour, matcha, and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer, cream the butter and sugar till light and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour to the mixer in small batches until everything is combined. The dough will have a pie crust-like consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg and mix till the dough comes together in a smooth mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a work surface and divide the dough in half. Roll each half into a log about an inch in diameter. Incorporate some more flour if the dough is too sticky to work with, but only as much as you need.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the logs in plastic wrap and chill in the refrigerator or freezer for at least half an hour. The dough will last for months in the freezer, so you can slice off as many or as few cookies as you'd like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before baking, heat the oven to 350&deg; with a rack in the middle. Slice the dough into uniformly-thick rounds (I aim for about 2-3 coins' thickness) with a sharp knife and place them on a buttered cookie sheet. You can space them relatively close as they won't spread much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For cookies that retain some chew, bake no longer than 8 minutes, or until the bottoms and edges acquire the slightest hints of brown. For crispier cookies, bake up to 12 minutes. Transfer the cookies to a cooling rack 30 seconds after removing them from the oven. The cookies keep for a couple days in an air-tight container, but are best eaten immediately.</p>"}]}