{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100428baychickenandfigs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bay leaves", "Carole Topalian", "chicken", "Cook the Book", "Edible: A Celebration of Local Foods", "figs", "prunes", "Tracey Ryder"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bay-Scented Chicken with Figs", "link": "https://www.seriouseats.com/recipes/2010/04/bay-scented-chicken-with-figs-recipe.html", "description": "Although this <strong>Bay-Scented Chicken with Figs</strong> from <strong><em><a href=\"http://www.amazon.com/Edible-Celebration-Local-Tracey-Ryder/dp/0470371080/serieats-20\">Edible: A Celebration of Local Foods</a></em></strong> by <a href=\"http://www.traceyryder.com/\">Tracey Ryder</a> and <a href=\"http://www.topalianphoto.com/\">Carole Topalian</a> was made in my New York kitchen, the ingredients for the recipe had California written all over them.  If I was living in Southern California I would have access to ripe figs and fresh bay leaves, but since it's not <em>quite</em> season yet on the East Coast, their dried counterparts had to make do. But even with dried figs and bay leaves, this recipe was a winner.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "4 chicken legs or 1 chicken (about 3 1/2 pounds) cut into quarters", "2 tablespoons extra-virgin olive oil", "2 medium onions, halved and thinly sliced", "2 cloves garlic, finely chopped", "1/2 teaspoon ground cumin", "2 tablespoons all-purpose flour", "1/2 cup dry white wine", "1 1/2 cups chicken broth", "6 fresh figs or 8 dried figs, cut into quarters", "8 pitted prunes, cut into quarters, optional", "1/2 cup drained green olives, pitted and halved, or 1/4 cup drained and rinsed capers, optional", "5 fresh bay leaves, or 2 dried bay leaves", "2 sprigs fresh thyme (tied together with kitchen twine) or 1/2 teaspoon dried thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle 1/2 teaspoon of the salt and 1/4 teaspoon of the pepper evenly over the chicken pieces.  In a large sauté pan, heat the oil over medium-high heat.  Add the chicken pieces skin-side down and cook until the skin is deeply browned, about 3 to 5 minutes.  Turn over each piece and brown the other side for about 2 minutes more.  Remove the chicken to a platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium.  Add the onion and cook, scraping the bottom of the pan and stirring occasionally until softened, about 5 minutes.  Add the garlic and cumin and cook, stirring, for 1 minute.  Stir in the flour and cook, stirring, for 2 minutes.  Whisk in the wine and cook, stirring, until the mixture is smooth, about 2 minutes.  Slowly whisk in the chicken broth and cook, stirring, until smooth.  Add the figs, the prunes, and/or olives, if using either or both, the bay leaves, thyme, and the remaining 1/2 teaspoon of salt and 1/4 teaspoon of pepper, and stir to combine.  Add the chicken pieces and any juices in a single layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the sauce to a boil, cover the pan, reduce the heat, and simmer until the chicken is tender and no longer pink inside, 40 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the pan.  Remove the bay leaves and thyme sprigs from the sauce with tongs and discard.  Stir the sauce well, and press down a bit on some of the figs and prunes to release some of their flavors into the sauce.  Pour the sauce onto a shallow platter and place the chicken on top.  Spoon some of the sauce over the chicken and serve immediately. </p>"}]}