{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100212adhocbuttermilkfriedchicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Ad Hoc at Home", "brining", "chicken", "Cook the Book", "fried chicken", "Thomas Keller"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Ad Hoc's Buttermilk Fried Chicken", "link": "https://www.seriouseats.com/recipes/2010/02/thomas-kellers-ad-hocs-buttermilk-fried-chicken-recipe.html", "description": "\"The equation makes perfect sense: a great brine, a dip in buttermilk, and an intensely flavored coating.\" [Photograph: Caroline Russock] A few months back I read Lucy Baker's review of Ad Hoc's Fried Chicken Mix and basically ran out the...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Deep Frying", "Fried Chicken", "Mains"], "recipeIngredient": ["Two 2 1/2- to 3-pound chickens ", "Chicken Brine, cold (recipe follows)", "<strong>For Dredging and Frying:</strong>", "Peanut or canola oil for deep-frying", "1 quart buttermilk", "Kosher salt and freshly ground black pepper", "<strong>Coating:</strong>", "6 cups all-purpose flour", "1/4 cup garlic powder", "1/4 cup onion powder", "1 tablespoon plus 1 teaspoon paprika", "1 tablespoon plus 1 teaspoon cayenne", "1 tablespoon plus 1 teaspoon kosher salt", "1 teaspoon freshly ground black pepper", "Ground fleur de sel or fine sea salt", "Rosemary and thyme sprigs for garnish", "5 lemons, halved", "12 bay leaves", "1 bunch (4 ounces) flat-leaf parsley", "1 bunch (1 ounce) thyme ", "1/2 cup clover honey", "1 head garlic, halved through the equator", "1/4 cup black peppercorns", "2 cups (10 ounces) Diamond Crystal kosher salt", "2 gallons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each chicken into 10 pieces: 2 legs, 2 thighs, 4 breast quarters, and 2 wings. Pour the brine into a container large enough to hold the chicken pieces, add in the chicken, and refrigerate for 12 hours (no longer, or the chicken may become too salty).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the brine (discard the brine) and rinse under cold water, removing any herbs or spices sticking to the skin. Pat dry with paper towels, or let air-dry. Let rest at room temperature for 1 1/2 hours, or until it comes to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you have two large pots (about 6 inches deep) and a lot of oil, you can cook the dark and white meat at the same time; if not, cook the dark meat first, then turn up the heat and cook the white meat. No matter what size pot you have, the oil should not come more than one-third of the way up the sides of the pot. Fill the pot with at least 2 inches of peanut oil and heat to 320°F. Set a cooling rack over a baking sheet. Line a second baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine all the coating ingredients in a large bowl. Transfer half the coating to a second large bowl. Pour the buttermilk into a third bowl and season with salt and pepper. Set up a dipping station: the chicken pieces, one bowl of coating, the bowl of buttermilk, the second bowl of coating, and the parchment-lined baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before frying, dip the chicken thighs into the first bowl of coating, turning to coat and patting off the excess; dip them into the buttermilk, allowing the excess to run back into the bowl; then dip them into the second bowl of coating. Transfer to the parchment-lined pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully lower the thighs into the hot oil. Adjust the heat as necessary to return the oil to the proper temperature. Fry for 2 minutes, then carefully move the chicken pieces around in the oil and continue to fry, monitoring the oil temperature and turning the pieces as necessary for even cooking, for 11 to 12 minutes, until the chicken is a deep golden brown, cooked through, and very crisp. Meanwhile, coat the chicken drumsticks and transfer to the parchment-lined baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cooked thighs to the cooling rack skin-side-up and let rest while you fry the remaining chicken. (Putting the pieces skin-side-up will allow excess fat to drain, whereas leaving them skin-side-down could trap some of the fat.) Make sure that the oil is at the correct temperature, and cook the chicken drumsticks. When the drumsticks are done, lean them meat-side-up against the thighs to drain, then sprinkle the chicken with fine sea salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn up the heat and heat the oil to 340°F. Meanwhile, coat the chicken breasts and wings. Carefully lower the chicken breasts into the hot oil and fry for 7 minutes, or until golden brown, cooked through, and crisp. Transfer to the rack, sprinkle with salt, and turn skin side up. Cook the wings for 6 minutes, or until golden brown and cooked through. Transfer the wings to the rack and turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the chicken on a serving platter. Add the herb sprigs to the oil (which will still be hot) and let them cook and crisp for a few seconds, then arrange them over the chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Chicken Brine</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 2 gallons -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all the ingredients in a large pot, cover, and bring to a boil. Boil for 1 minute, stirring to dissolve the salt. Remove from the heat and cool completely, then chill before using. The brine can be refrigerated for up to 3 days.  </p>"}]}