{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101105-seriouslyasian-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Asian", "keywords": ["fish", "Seriously Asian", "smoking", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tea Smoked Fish", "link": "https://www.seriouseats.com/recipes/2010/11/tea-smoked-fish-recipe.html", "description": "...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Asian", "Fish"], "recipeIngredient": ["one 8 ounce fish fillet", "¼ cup vermouth or rice wine, such as sake or Shaoxing rice wine", "1 teaspoon each of salt and crushed peppercorns (black, Sichuan, mixed, etc.)", "1/3 cup rice, preferably jasmine or long-grain", "1/4 cup tea, such as jasmine or black", "1 teaspoon sugar", "heavy duty aluminum foil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steep  fish in wine and sprinkle salt on top.  Let soak in marinade for eight hours to one day, turning fish over once or twice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up pot with steamer insert.  Steam fish for five to eight minutes until fish begins to flake. Remove  fish from heat and allow to cool, 10 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover wok with foil on the bottom, taking care that foil snugly fits in the wok.  Mixa leaves, rice, and sugar at the bottom of the wok.  Place steaming rack in the middle of the wok, or use chopsticks to make a grid over tea leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully blot any residual moisture from fish.  Place fish directly on rack or chopsticks.  Place lid on wok and use overlap of foil to seal shut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn on exhaust fan and open all windows in the house.  Over high heat, toast tea and rice until smoky wisps begin to emerge from wok, 3 to 6 minutes.  Toast for 5-7 minutes longer, then shut off heat and let fish sit in wok for 5 to 7 minutes longer.  The smells will begin to turn smoky - turn off heat before you smell burning.  Fish will be golden to dark brown, depending on time and type of tea leaf.  Serve tepid or refrigerate and serve cold.  Fish may be kept in refrigerator for about a week.  </p>"}]}