{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100901doughnuts.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["desserts", "mahlab", "Spice Hunting", "spices", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spiced Sweet Potato Doughnuts", "link": "https://www.seriouseats.com/recipes/2010/09/spiced-sweet-potato-doughnuts-recipe.html", "description": "[Photograph: Max Falkowitz] Mahlab is primarily used in Mediterranean and Middle Eastern breads and pastries, but there's no reason to limit it to those applications. It works surprisingly well with baking spices common in most pantries, like nutmeg and cinnamon....", "totalTime": "1 hour", "recipeYield": "12 (makes about 12 dougnuts)", "recipeCategory": ["Breakfast Sweets", "Dairy-Free", "Deep Frying", "Desserts", "Doughnuts", "Sweet Potatoes and Yams", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the doughnuts</strong>", "1 1/2 pounds sweet potatoes (about 3 medium-large)", "1 1/2 cups flour", "2 tablespoons mahlab, less if very fresh", "1 teaspoon cinnamon", "1/2 teaspoon freshly ground nutmeg", "2 teaspoons baking powder", "1 or 2 heavy pinches of salt", "1 1/2 quarts neutral-flavored oil, for deep frying", "<strong>For the glaze</strong>", "1 cup powdered sugar", "3 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the sweet potatoes with their skins on until a paring knife pierced through the center offers no resistance. Set them aside to cool a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the remaining doughnut ingredients in a large bowl. Prep a work surface with some flour to dust the counter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sweet potatoes are just cool enough to handle, peel off the skins by wrapping them in a paper towel and rubbing them between your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pur&eacute;e the peeled sweet potatoes with a ricer, masher, or grater. Make sure to smooth out large chunks. Sweet potatoes can take a lot more mashing than their white cousins, but don't work them any more than you have to.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the pur&eacute;ed sweet potato into the flour. Mix with your hands till just combined, then turn out onto your work surface. Dust some more flour over the top and fold the dough over on itself a few times till you get a relatively flat circle. Roll or flatten it out to about 3/4-inch thickness. Dough should be moist, but not stick readily to floured hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut doughnut shapes out of the dough. For the large circles, I use <a href=\"http://www.nishienterprise.com/Stainless-Steel-Katori-p/steel%20katori%20-3.htm\">\"thali bowls\"</a> that I got for a dollar a piece at an Indian grocery. (They double as great prep bowls.) For the holes, I use an apple corer. Set the doughnut shapes aside for a few minutes so the exteriors harden a bit. This produces a crispier crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a deep fryer, Dutch oven, or wok (which uses the least oil) on medium-high heat. When the oil shimmers, pull off a small knob of dough as a test and drop it in. It should bubble immediately, but not violently, and brown after a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the doughnuts three at a time, turning occasionally, for three to five minutes, letting them get a darker-than-golden crust. Doughnuts will continue to darken as they cool. Let them drain onto a few folds of paper towel on a cookie sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the second batch is frying, whisk water into the powdered sugar a tablespoon at a time until a thick but spoonable paste forms. Transfer the glaze to a pie plate or frying pan. Dip the drained doughnuts in each side for a few seconds, then set aside to drain on a cooling rack. Continue glazing each cooled batch while frying the next.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The glaze will set as the doughnuts cool. Serve warm or at room temperature.</p>"}]}