{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100813sweetlemonandblackolivecookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["black olives", "Cook the Book", "Cookies", "David Leite", "lemon", "olives", "The New Portuguese Table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sweet Lemon and Black Olive Wafers", "link": "https://www.seriouseats.com/recipes/2010/08/sweet-lemon-and-black-olive-wafers-recipe.html", "description": "<strong><a href=\"http://leitesculinaria.com/about\">David Leite</a></strong>, author of <strong><em><a href=\"http://www.amazon.com/New-Portuguese-Table-Exciting-Flavors/dp/0307394417/serieats-20\">The New Portuguese Table</a></em></strong> is quick to point out that these <strong>Sweet Lemon and Black Olive Wafers</strong> are not typical of Portuguese cuisine.  What they <em>are</em> is an inspired riff on a <em>biscoito</em>, a dunking cookie similar to biscotti.  By adding olive-cured olives and lemon zest, Leite has created a flavor complexity with sweet-savory qualities that simple, home-baked cookies rarely attain.", "totalTime": null, "recipeYield": "about 15 wafers", "recipeCategory": ["Cook the Book", "Desserts", "Lemon", "Olives"], "recipeIngredient": ["1 1/2 cups all-purpose flour ", "1/2 cup mild oil-cured black olives, rinsed quickly if particularly salty, pitted and coarsely chopped ", "1/4 cup sugar, plus more for coating", "1/4 teaspoon baking powder ", "2 tablespoons grated lemon zest", "1/8 teaspoon cinnamon", "Pinch of kosher salt", "1/4 cup extra-virgin olive oil ", "1 large egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the upper third of the oven and crank the heat up to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the flour, olives, sugar, baking powder, zest, cinnamon, and salt in a medium bowl.  Whisk together the oil and egg, pour the mixture into the dry ingredients, and mix with your hands until the dough no longer looks dry and holds together when squeezed, 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a small bowl with sugar and set nearby.  Pinch off 1 tablespoon (about 1 ounce) of dough, roll it in a ball, and coat it with the sugar.  Place it in one corner of a sheet of parchment cut to fit your baking sheet, place another piece of parchment on top, and using a rolling pin, roll the ball into a 3 1/2-to-4-inch circle, scant 1/16 inch thick.  The edges will be ragged; that's how they should be.  Repeat with 5 more wafers on the same shape.  Lift off the top sheet and slip the parchment with the cookies onto the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the wafers are edged with brown and pebbled on top, 10 to 12 minutes.  Slide the parchment onto a wire cooling rack.  Repeat with the remaining dough.  Once cooled, the wafers will keep in an airtight container for several days, but I doubt they'll stick around for that long.</p>"}]}