{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100501behemothcrumb.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "crumb cakes", "desserts", "New Jersey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Behemoth Crumb Cake", "link": "https://www.seriouseats.com/recipes/2010/05/cakespy-crumb-cake-recipe.html", "description": "When it comes to crumb, I have a theory: if some is good, more is better. This theory was proven when I discovered something called the Colossal Crumb Cake at New Jersey's <a href=\"http://www.oceangrovebakeshoppe.com/\">Ocean Grove Bake Shoppe</a>. Their version had a ratio of roughly <strong>9 parts crumb to 1 part cake,</strong> and it was just as amazing as it sounds. Could it be possible to recreate this magic at home?", "totalTime": "", "recipeYield": "about 12", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Cakes", "Cakespy"], "recipeIngredient": ["<strong>For the crumb topping:</strong>", "3 cups (6 sticks) unsalted butter", "7 1/2 cups all-purpose flour", "4 1/2 cups packed dark brown sugar", "1 1/2 teaspoon salt", "4 teaspoons vanilla extract", "5 tablespoons ground cinnamon", "<strong>For the cake:</strong>", "1 cup sifted unbleached or bleached all-purpose flour", "1 teaspoon baking powder", "1/8 teaspoon baking soda", "1/2 teaspoon salt", "5 tablespoons unsalted butter", "1/2 cup superfine or strained sugar", "1 large egg", "1/2 teaspoon vanilla extract", "1/2 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the topping. Melt the butter in a medium saucepan over a low flame. Remove from the heat and cool for about 5 minutes, but do not allow the butter to become cold. Transfer the butter to a very large mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour, brown sugar, salt, vanilla extract, and cinnamon. The original recipe suggested stirring with kitchen forks to bring the mixture together, but I went one better and used salad tongs because of the sheer volume. Stir together until the mixture forms small crumbs. Set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F with the rack in the lower third of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9x13-inch pan. Dust the pan lightly with all-purpose flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, baking powder, baking soda, and salt in a large bowl, then whisk together. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the butter into 1-inch pieces. Place them in the large bowl of a standup electric mixer fitted with beaters or a paddle attachment. Soften the butter on low speed. Increase the speed to medium-high and cream until smooth and light in color, about 1 1/2 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar, 1 tablespoon at a time, taking about 6 to 8 minutes to blend it in well. Scrape the sides of the bowl occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg, and beat, scraping the sides of the bowl as necessary. Beat for about 1 minute longer. Blend in the vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to low. Add the dry ingredients alternately with the sour cream, dividing the flour mixture into 3 parts and the sour cream into 2 parts, starting and ending with the flour. Mix just until incorporated after each addition. Scrape the sides of the bowl as necessary and mix for 10 seconds longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the batter into the prepared pan, smoothing the surface with the back of a tablespoon or rubber spatula. It will just barely cover the bottom in a thin layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take a handful of the crumb mixture and make a fist to press the mixture into a large clump. Then separate into smaller clusters, scattering them on the top of the cake batter. Repeat until all of the crumbs have been used. Try to make sure that every surface of the cake part is covered, as it will bubble up in any gaps you leave on top. My cake at one point did start to ooze through on the corner, so you might want to leave a thin baking sheet below the cake pan just to ensure no spillage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently pat the crumbs into the batter with the palm of your hand; but do not press hard. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in the preheated oven for 35-40 minutes, or until the cake is golden brown on top and begins to come away form the sides of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>You may notice that the cake feels fairly heavy. Curious, I weighed it before putting it in the oven. It weighed almost 11 pounds. Granted, this is including the weight of the pyrex baking dish, but still pretty hefty, no?</p>"}]}