{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100517pimentocheesebaconbread.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bread", "Cook the Book", "James Villas", "Pig: KIng of the Southern Table", "pimento cheese", "pimentos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bacon-Pimento Cheese Bread", "link": "https://www.seriouseats.com/recipes/2010/05/cook-the-book-bacon-pimento-cheese-bread-draf.html", "description": "Pimento cheese is one of my all-time-favorite desert-island foods, so when I came across this recipe for <strong>Bacon-Pimento Cheese Bread</strong> I was instantly in love. Incorporating all of the ingredients for pimento cheese into a loaf of white bread along with some crisp bacon seemed almost too good to be true. And of course, there was the even more intriguing possibility of spreading the bread with a little more pimento cheese.", "totalTime": "", "recipeYield": "1 loaf", "recipeCategory": ["Bacon", "Bread Baking", "Cook the Book"], "recipeIngredient": ["4 slices bacon", "1 envelope active dry yeast", "2 tablespoons warm water", "3 1/2 cups plus 3 tablespoons all-purpose flour", "2 teaspoons sugar", "1 teaspoon salt", "1 cup milk", "1 tablespoon minced fresh chives", "2 ounces sharp cheddar cheese, shredded", "1/4 cup finely chopped pimentos", "1 tablespoon butter, melted "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>n a medium skillet, fry the bacon over moderate heat till crisp. Drain on paper towels, crumble, and reserve the grease in the skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the yeast and water and let proof for about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the 3 tablespoons of flour, reserved bacon grease, sugar, and salt, gradually stir in the milk, and cook over moderate heat, stirring constantly, till thick and smooth, about 10 minutes. Remove the pan from the heat, add the chives, cheese, and pimentos, stir till the cheese melts, and let cool slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the yeast mixture to the cheese mixture, stir, and gradually add the 3 cups of flour, beating with an electric mixer till smooth and adding enough extra flour to make a firm dough. Turn the dough out onto a lightly floured surface and knead till smooth and elastic, about 8 minutes. Place in an oiled bowl, turn to coat the surface, cover with a towel or plastic wrap, and let rise in a warm area till doubled in bulk, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch the dough down, transfer to a 9 by 5 by 3-inch loaf pan, cover, and let rise again till doubled in bulk, about 1 hour. Meanwhile, preheat the oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the top of the loaf with melted butter and bake till the loaf sounds hollow when tapped, 35 to 40 minutes. Turn out onto a wire rack and let cool.</p>"}]}