{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100322beeftenderloinwatercresssear.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["louisa shafia", "Lucid Food", "matzoh"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Matzo Brei with Caramelized Apples", "link": "https://www.seriouseats.com/recipes/2010/03/matzoh-brei-with-caramelized-apples-recipe.html", "description": "Matzoh Brei is one of the great Passover breakfast foods, not to mention ridiculously simple to make. This recipe from <a href=\"http://www.seriouseats.com/2010/03/meet-eat-louisa-shafia-author-of-lucid-food.html\"><em>Lucid Food</em> by Louisa Shafia</a> combines vanilla, apples, maple syrup, and cinnamon with the scrambled matzohs.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Apple", "Breakfast Sweets", "Passover"], "recipeIngredient": ["2 firm apples, peeled cored, and quartered", "3 tablespoons unsalted butter plus extra, at room temperature", "1 teaspoon ground cinnamon", "4 tablespoons maple syrup, plus more for serving", "3 eggs", "1/2 cup milk", "1/2 teaspoon vanilla extract", "Pinch of salt", "6 pieces lightly salted matzoh"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice each apple quarter lengthwise into 4 pieces.  Heat a saute pan over medium-high heat and add 2 tablespoons of the butter, followed by the apples.  Cook the apples, flipping them occasionally, until they are tender and lightly browned, about 6 minutes.  Add the cinnamon and 2 tablespoons of the maple syrup and cook for 1 minute.  Turn off the heat and transfer the apples to a covered dish to keep warm.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the remaining 2 tablespoons of maple syrup with the eggs, milk, vanilla extract, and salt.  Pour the batter into a pie dish.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the saute pan over medium-high heat and add 1 tablespoon of the butter.  When the butter is hot, pull several pieces of the matzoh out of the batter and put them in the pan.  Cook for 1 1/2 minutes.  You can drop a teaspoon of batter into the matzoh here and there as it cooks to make it fluffier, or to join smaller broken pieces together.  Flip the matzoh with a spatula and cook the second side until golden brown, 1 1/2 minutes more.  Drop more butter in the pan and repeat with the remaining matzoh and batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve as soon as it comes out of the pan with the apple slices and extra maple syrup.  It will disappear very fast!</p>"}]}