{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101212-127355-dinner-tonight-baked-oysters.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Alton Brown", "artichoke", "artichoke hearts", "bread crumbs", "Dinner Tonight", "oysters"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Alton Brown's Baked Oysters with Artichoke and Panko Crumbs", "link": "https://www.seriouseats.com/recipes/2010/12/alton-browns-baked-oysters-with-artichokes-recipe.html", "description": "There are some questionable accounts about what actually goes into the authentic version of Oysters Rockefeller. Just about every recipe I found was different, significantly too. That's how I ended up with this <a href=\"http://www.foodnetwork.com/recipes/alton-brown/baked-oysters-brownefeller-recipe/index.html\">baked oyster recipe from Alton Brown</a>, which makes no attempt to be historically accurate. Luckily, Brown just decided to create a really great baked oyster recipe.", "totalTime": "40 minutes", "recipeYield": "4 to 6 people", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner Tonight"], "recipeIngredient": ["24 oysters (preferrably blue point)", "6 tablespoons unsalted butter", "¾ cup finely chopped onion, from about ½ small onion", "¾ cup finely chopped celery, from about 1 stalk celery", "1 teaspoon kosher salt, divided", "1 tablespoon minced garlic, from about 2 garlic cloves ", "one 14-ounce can artichoke hearts, drained, and finely chopped", "1 cup panko bread crumbs", "2 teaspoons grated lemon zest, from about 1 large lemon", "½ teaspoon freshly ground black pepper", "1 teaspoon dried oregano ", "4 cups rock salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower-middle and upper-middle positions and preheat oven to 420&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour rock salt onto a sheet pan. Shuck oysters using an oyster knife. Discard top flat shell, and then use knife to dislodge oyster from bottom shell. Keep oyster in bottom half, and retain as much of oyster liquor as possible. Nestle bottom shell with oyster in salt, making sure none of the liquor pours off. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter to 12-inch sauté pan set over medium-low heat. When butter has melted, turn heat up slightly, and add onion, celery, and ½ teaspoon salt. Cook until onion is translucent, 5 to 7 minutes. Add garlic, and cook until fragrant, about one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to low and add artichoke hearts, bread crumbs, lemon zest, ½ teaspoon kosher salt, black pepper, and oregano. Cook for 3 more minutes, until everything is very fragrant. Turn off heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide bread crumb mixture evenly on top of oysters. Set sheet pan in oven and cook for 10 minutes, or until top is lightly browned. Serve immediately. </p>"}]}