{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100208-brusselsprouts%20close-up.jpg", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Roasted Brussels Sprouts with Caramelized Onions and Bacon", "link": "https://www.seriouseats.com/recipes/2010/02/roasted-brussel-brussels-sprouts-with-caramelized-onions-bacon-recipe.html", "description": "These Brussels sprouts are tender throughout, with crisped edges and outer leaves. Bits of caramelized onions and crisp chunks of bacon pack the sprouts with flavor.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Bacon", "Sides"], "recipeIngredient": ["About 2 1/2 pounds brussels sprouts\u2028", "4 tablespoons olive oil, plus more as needed", "Salt and pepper, to taste,\u2028", "2 medium onions\u2028, peeled and sliced thin", "2 to 3 ounces smoked bacon (about 3 strips), cut into 1-inch by ¼-inch pieces", "1 tablespoon or so chopped fresh flat-leaf parsley\u2028\u2028"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F. I like using convection mode for roasting, but you can also preheat a conventional oven to 425°F.\u2028</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and trim stems and outer leaves from brussels sprouts and cut any really big sprouts in half. Dry well, place on baking sheet, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the bacon in a skillet over low heat, until it is crispy and most of the fat is rendered, about 5 minutes. Remove the fat and lay the bacon on paper towels to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle two tablespoons of olive oil in the skillet and caramelize the onions over low heat for about 20 to 30 minutes, stirring occasionally to prevent browning. Add oil as necessary and deglaze pan with a tablespoon or so of water if brown bits form on the bottom of the skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the onions are caramelizing, drizzle the remaining two tablespoons of olive oil over brussels sprouts and give them a quick toss to coat the brussels sprouts evenly. Sprinkle with salt and pepper.\u2028\u2028 Turn the flat side of any cut sprouts face down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast brussels sprouts for about 20 minutes, giving the baking sheet a good shake once or twice to encourage even browning. They are done when the outer leaves are well-browned and a paring knife can be inserted through the middle of a sprout without much resistance.\u2028\u2028 </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the brussels sprouts, bacon, and onions together. Turn them out onto a serving platter and garnish with parsley.</p>"}]}