{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100928-dt-roasted-beet-and-potato-borscht.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beets", "borscht", "Dinner Tonight", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Roasted Beet and Potato Borscht", "link": "https://www.seriouseats.com/recipes/2010/09/dinner-tonight-roasted-beet-and-potato-borsch-recipe.html", "description": "The brilliance of this soup, besides the shocking color, is how deeply flavored it is with very little fat (just a few tablespoons needed to coat the chunks of roasted beet and potato).  That's all thanks to a hot oven and the complex sweetness of roasted beets (If you're stuck on childhood memories of the pickled stuff, this might change your mind).", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Potato", "Soups and Stews"], "recipeIngredient": ["2 pound red beets (about 5 medium), scrubbed, peeled, and cut into medium dice", "1 pound russet potatoes (about 2 medium), peeled and cut into medium dice", "2 shallots, coarsely chopped", "3 to 5 sprigs fresh thyme", "2 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "5 cups homemade chicken broth or low-sodium canned broth", "1 tablespoon red wine vinegar", "Sour cream", "4 tablespoon chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 400°F. Meanwhile, toss vegetables with olive oil, salt, and pepper.  Spread out in a single layer on rimmed baking sheet and tuck the sprigs of thyme in amongst the vegetables.  Roast until tender, about 45 minutes, discarding the thyme once they are finished cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the chicken broth to a simmer in a large saucepot and add the cooked vegetables.  Mash roughly with a potato masher or wooden spoon, add the vinegar, and season to taste with salt and pepper and more vinegar if needed.  Serve in bowls topped with a dollop of sour cream and a sprinkle of parsley.</p>"}]}