{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201000504-dt-merguez-sausage-with-collards-and-cous-cous.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["collard greens", "couscous", "Dinner Tonight", "merguez", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Merguez Sausage with Collards and Couscous", "link": "https://www.seriouseats.com/recipes/2010/05/dinner-tonight-merguez-sausage-with-collards-recipe.html", "description": "Who knew that a spicy lamb sausage from northern Africa would get along so well with collard greens, a staple of Southern soul food? Knowing that sausages and greens are a natural combination, I trusted this <a href=\"http://www.epicurious.com/recipes/food/views/Quick-Collard-Greens-with-Merguez-Sausage-and-Couscous-233925\">recipe from Epicurious.com</a>, which cooks the greens quickly by blanching then braising them with some of the cooking liquid, rather than the long, slow preparation I'm familiar with.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Leafy Greens", "Mains"], "recipeIngredient": ["2 pounds collard greens, stemmed", "1 1/2 pounds merguez sausage links", "1/2 cup water", "2 tablespoons olive oil", "1 cup chopped onion", "1/4 teaspoon dried crushed red pepper", "1 garlic clove, minced", "1/4 teaspoon ground cumin", "1/4 teaspoon ground cinnamon", "1/2 cup dried currants", "2 tablespoons unsalted butter", "10 ounces plain couscous, cooked according to package directions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot, bring plenty of salty water to boil. Stack the stemmed collard leaves and cut them crosswise into 1-inch strips.  Lower the collard greens into the boiling water and cook for a couple minutes, until beginning to soften, then drain, reserving 1 cup of the cooking liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large skillet over medium heat, then add the onion and cook until soft and translucent, then add the crushed red pepper, garlic, cumin and cinnamon.  Cook for a minute or so to meld the spices, then add the collard greens and continue cooking for a few more minutes. Stir in the currants and cooking liquid and bring to a simmer; cook, partially covered, until the liquid has reduced and clings to the leaves without puddling.  Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, place the sausages plus water in a large skillet and turn the heat to medium.  Cook until the water evaporates and renders the sausage fat into the skillet, then continue cooking as the sausages brown, about 10-12 minutes.  Depending on the fat content of the sausages, a little more oil in the pan may be necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the cous cous according to package directions and stir in the butter.  Serve topped with the collard greens and sausage.</p>"}]}