{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100325-grilled-artichokes-large.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["artichokes", "grill", "grilling", "spicy", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Artichokes with Mint and Chilies", "link": "https://www.seriouseats.com/recipes/2010/03/grilling-artichokes-with-mint-and-chilies-recipe.html", "description": "I saw the first decent artichokes of the season, calling to me between the remains of the winter vegetables. In this recipe, they get <strong>a Mario Batali treatment</strong>&mdash;boiled in a <strong>lemon, wine, garlic, and mint mixture,</strong> then taken to the grill to crisp up, and finally finished with a sprinkling of mint, hot peppers, and sea salt. Sound good? Well, good is an understatement here.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Vegetarian"], "recipeIngredient": ["6 large artichokes, <a href=\"http://www.seriouseats.com/2010/03/how-to-trim-an-artichoke-hearts.html\">trimmed</a>", "2 lemons, halved", "1 bunch mint, chopped, plus about 1/4 cup fresh mint leaves cut into chiffonade", "6 garlic cloves, thinly sliced", "1 cup extra-virgin olive oil", "1 cup dry white wine", "2 to 4 small red hot chili peppers, chopped fine", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with 6 cups of water and the juice of the 1 1/2 of the lemons. As you trim the artichokes, place them in the bowl of lemon water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chopped mint, garlic, olive oil, and wine in a large pot. Add the artichoke and the lemon water, adding more water if necessary to cover the artichokes. Put a pan lid or plate on top of the artichokes to keep them submerged and bring to a boil over high heat. Reduce the heat, cover, and simmer until just tender, 15 to 20 minutes, depending on the size of the artichokes. Drain and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over the charcoal grate. Clean and oil the grilling grate. Place the artichokes, cut side down, over the hottest part of the grill and cook, unmoved, for 3 to 5 minutes, until nicely charred. Turn and cook until golden brown on the second side, about 5 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the artichokes from the grill to a platter and sprinkle with the remaining mint and peppers. Serve with a bowl of coarse salt.</p>"}]}