{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["ethiopian", "niter kibbeh", "Spice Hunting", "spices"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Niter Kibbeh", "link": "https://www.seriouseats.com/recipes/2010/07/niter-kibbeh-recipe.html", "description": "Learn more about niter kibbeh here » Niter kibbeh is a spice blend always at the peak of freshness since you lock the flavors into clarified butter. There are as many recipes for niter kibbeh as there are Ethiopian cooks;...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Condiments and Sauces"], "recipeIngredient": ["1 pound of unsalted butter", "1 small onion, minced", "6 cloves of garlic, peeled and smashed", "2 inches of ginger, peeled and sliced thin", "2 3-inch sticks of cinnamon, or 1 teaspoon ground", "8 crushed cardamom pods, or 1/2 teaspoon ground", "1 teaspoon of fenugreek, whole or ground", "1 teaspoon of coriander, whole or ground", "2 cloves, or 1/8 teaspoon ground", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, slowly melt the butter on low heat. Meanwhile, toast the spices. If grinding, toast beforehand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add all the spices to the butter, and reduce the heat to a bare simmer. Keep an eye on the pot every few minutes to make sure it’s not boiling as the water evaporates. The milk solids will rise to the surface of the pot as the water cooks out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the butter simmer, with just a few bubbles popping through, for 1 to 1 1/2 hours. Like a good stock, longer cooking is better, but it needs to be gentle so the milk solids don’t burn. If they do, the niter kibbeh will be irreparably bitter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the solids have turned a pleasant brown and plenty of time has past, line a mesh strainer with a cheesecloth or paper towel and place it over a small storage container. Strain the butter well, making sure there are no milk solids or spices in the final product. Your niter kibbeh will last for months in the refrigerator. The larger a batch you make, the less butter you’ll lose to straining.</p>"}]}