{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100201-wings-platter2.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["appetizers", "Buffalo wings", "chicken", "chicken wings", "spicy", "Super Bowl wings", "wings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Baked \"Buffalo\" Hot Wings", "link": "https://www.seriouseats.com/recipes/2010/02/baked-buffalo-hot-wings-recipe.html", "description": "...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken"], "recipeIngredient": ["<strong>For the wings:</strong>", "5 pounds chicken wings", "4 tablespoons neutral oil", "Salt and pepper", "1 1/2 cups flour (optional)", "<strong>For the sauce:</strong>", "1 cup Louisiana Hot Sauce (preferably <a href=\"http://www.franksredhot.com/\">Frank's brand</a>)*", "2 sticks unsalted butter", "1 teaspoon Worcestershire sauce", "1 teaspoon salt, or to taste", "Cayenne pepper to taste (optional)", "<strong>For dunking:</strong>", "6 ribs celery, cut into 4-inch long sticks", "<a href=\"http://www.seriouseats.com/recipes/2010/02/blue-cheese-dip-sauce-recipe.html\">Blue Cheese Dip </a>", " <small>* Using a relatively mild Louisiana hot sauce is an important part of the process.  If the hot sauce is quite hot (like, say, Tabasco) the Buffalo sauce will be far too spicy by the time you use the right amount to get the consistency you want.  Starting with a sauce like Frank's, which is what they use in Buffalo, allows you to then add cayenne until it's as spicy as you like.</small>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the wings:</strong>The wings are traditionally cut into three pieces.  Using a heavy knife, cut through the joints in the wings to separate then into three pieces.  A sharp knife should slide through the joint easily; there is no need to cut through any bone. It's easiest to see the joints with the underside of the wings facing up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The tips of the wing, which contain little to no meat, can be discarded or saved for the stock pot.  Rinse the wings and pat them dry, then toss in a bowl with the oil and a good pinch each of salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The sauce:</strong> Melt the butter over low heat in a sauce pan and add the remaining sauce ingredients, whisking well to combine.  Keep the heat low and only as long as necessary to melt the butter: you don't want the butter to separate.  Taste for spiciness, and add cayenne if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Marinate or Flour?</strong> Depending on your method, the next step is to either toss the wings with a quarter of the sauce and refrigerate for an hour, or toss them in a bowl with the flour.  The former method will infuse the wings with flavor, while the latter will create a crisp exterior that will eventually soak up lots of sauce. It's up to you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.  Grease a baking sheet with a neutral oil such as canola, using a paper towel or brush to ensure it coats all of the surface.  Arrange the wing pieces skin-side-up. They should be snug, but not too crowded. Keep in mind they will shrink as they cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook undisturbed for 30 minutes until golden brown, and until the wings release easily from the baking sheet.  Using a pair of tongs, turn the pieces over and return to the oven to bake for an additional 15 to 20 minutes, until crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the wing are finished cooking, pour the Buffalo sauce into a shallow bowl (you'll probably have to do this in batches) and add a few wings at a time.  Turn them in the sauce until well-coated, then transfer to a platter. Repeat with the remaining wings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Get a jug of blue cheese or <a href=\"http://www.seriouseats.com/recipes/2010/02/blue-cheese-dip-sauce-recipe.html\">make your own!</a> Serve with celery sticks.</p>"}]}