{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100820-smokedchocicecream.jpg", "author": {"@type": "Person", "name": "Ethan Frisch"}, "recipeCuisine": "", "keywords": ["cardamom", "chocolate", "cinnamon", "desserts", "frozen desserts", "honey", "ice cream", "star anise", "summer", "tequila"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scooped: Smoked Chocolate and Tequila Ice Cream", "link": "https://www.seriouseats.com/recipes/2010/08/smoked-chocolate-and-tequila-ice-cream-recipe.html", "description": "What could be better than <strong>chocolate, tequila and ice cream</strong> on a hot August afternoon? So why not put them all together in one amazing ice cream concoction? Funny you should ask, because that's exactly what we did.", "totalTime": "12 hours (or 4 hours, if you really can't wait)", "recipeYield": "About 1 quart, or 10 servings", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["3 cups half-and-half (or 1 1/2 cups each of whole milk and heavy cream)", "1 cinnamon stick (about 3 inches)", "5 black cardamom pods, crushed", "2 small pieces of star anise", "1 tablespoon whole coffee beans or 1 teaspoon coffee grinds", "5 ounces (about 3/4 cup) bittersweet chocolate, coarsely chopped", "6 egg yolks", "1 cup turbinado (raw) sugar", "1/4 cup honey", "8 tablespoons (about 3 shots) good tequila"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy bottomed pot heat the half-and-half over a low/medium flame with the spices (cinnamon, black cardamom, star anise and coffee) until infused with flavor, about 30 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another pot, mix the turbinado sugar, 2 tablespoons of tequila and a little water (about 1/4 cup) and cook over medium heat to caramelize the sugar, about 7 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the caramel sauce is still warm, pour it (carefully) into the pot with the half-and-half and spices. It may bubble and foam, so pour slowly and steadily, and stir as you pour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the honey into the same pot you used to caramelize the sugar, and cook over a low flame until that begins to caramelize as well, about 5 minutes. Mix it into the pot with the half-and-half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, whisk the egg yolks until the color lightens, about 4 to 5 minutes of continuous whisking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Temper the eggs into the pot. <strong>Note:</strong> This process is actually fairly easy, it just takes a little patience. To temper eggs, you need to warm them up before pouring them into the hot half-and-half; if you pour the cold yolks directly into the pot, they'll curdle and you'll wind up with scrambled eggs floating in your ice cream base. Start by scooping a few ladlefuls of hot half-and-half into your eggs, and mix well to incorporate. When the outside of the mixing bowl is warm to the touch, you'll know the eggs are ready. Pour them slowly and carefully back into the pot, using a rubber spatula to scrape out the bowl. Mix to make sure all the yolks are dissolved into the half-and-half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to cook the ice cream base over low/medium heat, stirring occasionally, until the mixture thickens and coats the back of a spoon, about 8 to 10 minutes. If you have a thermometer handy, the mixture should heat up to 160°F to ensure that the eggs have been cooked thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chocolate in a mixing bowl, and pour the hot ice cream base through a mesh strainer into the bowl and over the chocolate. The heat from the liquid will melt the chocolate, so stir it around to make sure it gets mixed and melted evenly. If you have an immersion blender, use it. If not, simple mixing with a wooden spoon or spatula will do the trick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the chocolate has been fully melted, pour about 6 tablespoons of tequila into the bowl. This is pushing the upper limit of the amount of alcohol an ice cream can contain and still be able to freeze&mdash;if you're not into the taste of tequila, only use 3 tablespoon or choose another alcohol that you like better. If you want an ice cream that's really boozy, put 8 (or more) but remember that your final product will melt faster with more alcohol.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill the base in the fridge overnight. Letting the ice cream base age overnight allows the fats to crystallize and proteins to hydrate&mdash;in English, it makes the texture incomparably smooth when you spin it in your machine the next morning. If you can't wait overnight, leave the base in the fridge until cool, about 4 hours.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spin the base in your ice cream machine, then store in the freezer for another hour or two&mdash;or just eat it right away! Garnish with a little sea salt, or smoked salt if you want to be really classy, for an incredible sweet-savory combination.</p>"}]}