{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100502asparaguseggsteak_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["asparagus", "brunch", "eggs", "steak", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sunday Brunch: Steak, Eggs, and Sunny Side-Up Asparagus", "link": "https://www.seriouseats.com/recipes/2010/05/sunday-brunch-steak-and-eggs-and-asparagus-cheese-recipe.html", "description": "[Photo: Robin Bellinger] The pairing of steak and eggs always tempts me on brunch menus; even a wee little piece of red meat feels like a luxury when I haven't been awake for all that long. Bavette, or flap steak,...", "totalTime": null, "recipeYield": "2-3", "recipeCategory": ["Asparagus", "Breakfast and Brunch", "Eggs"], "recipeIngredient": ["1 pound asparagus, tough ends snapped off", "Salt", "1 tablespoon butter", "3 eggs", "3/4 cup grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam the asparagus. If you don't have a favorite method, try Sally Schneider's: Put the asparagus in a lidded skillet with 1/3 cup of water and a sprinkle of salt. Cover, turn the heat to high, and steam 5-8 minutes, until the asparagus is tender and there is only about a spoonful of water left in the skillet. Peek in and move the asparagus around every once in a while. If the water is evaporating too quickly, add a bit more and adjust the heat. If there is a lot of water left at the end, pour off all but a tablespoon. When the asparagus is tender, remove the skillet from the heat, remove the lid, and toss the asparagus with 1 teaspoon butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the eggs in the remaining butter (I fried mine in the buttery skillet I had used to fry my steaks), about 3 minutes at medium-low heat. You want the whites set, but the yolk should be runny so it can meld with the cheese in a nice, saucy way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the asparagus among 2 or 3 plates. Top each bunch with a bit of cheese, a fried egg, and a bit more cheese. Serve immediately.</p>"}]}