{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-omeletwithwhitebeans.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "eggs", "Jose Andres", "omelets", "onions", "white beans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Omelet with White Beans and Green Onions", "link": "https://www.seriouseats.com/recipes/2010/01/omelet-with-white-beans-and-green-onions-recipe.html", "description": "\"Something miraculous happens when you mix rich extra-virgin olive oil and white beans.\" [Photograph: Nick Kindelsperger] This omelet could have turned into a horribly lopsided mess. It cooks only one side and is topped with white beans, which are sautéed...", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Omelettes"], "recipeIngredient": ["1/2 14-ounce can white beans (Navy Beans or Cannellini), drained  ", "2 tablespoons extra-virgin olive oil ", "1/4 cup scallions, thinly sliced", "4 large eggs", "1/2 tablespoon fresh parsley, chopped", "Salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 tablespoon of the olive oil into a non-stick skillet set over medium heat. Add the beans and spread them out in one layer. Cook for about 3 minutes without stirring, until they are crispy and slightly browned on one side. Add the scallions, stir, and cook for 1 minute. Turn off the heat and transfer to a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the skillet and place back on a burner over medium-heat. Pour in 1/2 tablespoon of the olive oil. Crack all the eggs into a bowl and lightly whisk together. Pour half of the eggs into the skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a spatula along the edge of the eggs to keep them from sticking. Once the edges have set but the middle is still runny, add half of the bean and scallion mixture. Cook until the eggs in the middle are done to your liking. (I like mine a little runny.) Slide the tortilla onto a plate, garnish with parsley, and season with salt. Repeat with this step with the rest of the eggs. </p>"}]}