{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20101216-129020-tea-cured-gravlax-edit.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "curing", "fish", "gravlax", "salmon", "Sunday Brunch", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Tea Cured Gravlax", "link": "https://www.seriouseats.com/recipes/2010/12/tea-cured-gravlax-recipe.html", "description": "Gravlax is a traditional Swedish salmon preparation, where salmon is cured in salt, sugar and dill for up to a week. This recipe combines jasmine and green tea instead of the more traditional dill, making for a <strong>slightly smoky flavor.</strong> It takes a traditional Swedish appetizer and turns it into a simple brunch.", "totalTime": "Up to 1 week", "recipeYield": "Serves 4 (or 6-8 as hors'dourves)", "recipeCategory": ["Breakfast and Brunch", "Salmon"], "recipeIngredient": ["3/4 – 1 pound filet of salmon", "1 tablespoon jasmine tealeaves", "1 tablespoon green tealeaves", "1/2 cup kosher salt", "1 cup sugar", "2 teaspoons cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix jasmine and green tea in small bowl.  Cover with boiling water and let sit 3-5 minutes until tealeaves are fully soaked, drain and cool.Combine salt, sugar and cracked black pepper and mix until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/2  cup of salt/sugar mixture on bottom of pyrex or glass dish.  Place salmon filet skin side down on salt/sugar mixture.  Evenly coat top of salmon filet with moistened tea then coat with remaining sugar/salt mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap a piece of cardboard that is small enough to cover with filet without touching the sides of the dish with foil.  Cover dish loosely with plastic, place cardboard wrapped with foil on top of plastic followed by a one-pound can.  Refrigerate for 3 days, or up to a week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve remove from cure and wipe off remaining tea and salt/sugar mixture.  Slice very thinly and serve with bagels and cream cheese for brunch, or on rye bread or blinis with a dab of sour cream or crème fraiche for cocktail parties.  A glass of sparkling wine goes very well with this gravlax at either time of day.</p>"}]}