{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100811-dt-pasta-with-corn-pesto.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["corn", "Dinner Tonight", "mains", "parmesan", "pasta carbonara", "pine nuts", "taglietelle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "8"}, "name": "Dinner Tonight: Pasta with Bacon and Corn 'Pesto'", "link": "https://www.seriouseats.com/recipes/2010/08/pasta-with-bacon-and-corn-pesto-recipe.html", "description": "When it comes down to it, my favorite food is pasta. And if you held a gun to my head, I'd probably say that carbonara is my favorite pasta. I love its creaminess-with-no-cream, the chewy, salty bits of bacon, the roundness of Parmesan, the bite of black pepper. So it's not with any flippancy that I say that <strong>this recipe reminds me of carbonara, and in the best of possible ways.</strong> It's creamy, bacony, and satisfying&mdash;yet it's also a lot lighter and more fitting for summer.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Bacon", "Corn", "Dinner Tonight", "Nuts", "Pasta"], "recipeIngredient": ["4 slices thick bacon, cut into lardons", "4 cups fresh corn kernels from about 6 ears", "1 large clove garlic, minced", "salt and pepper to taste", "1/2 cup grated Parmesan", "1/3 cup pine nuts, toasted", "1/3 cup extra-virgin olive oil", "3/4 pound taglietelle, fettucini, or other pasta", "3/4 cup slivered basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, cook the bacon pieces over medium-low heat until chewy and beginning to crisp and the fat has rendered into the pan, about 10 minutes.  Remove the bacon with a slotted spoon and drain on paper towels.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the corn and garlic to the skillet and toss to coat in the fat. Add a couple pinches of salt and pepper and cook until the corn is just tender, about 5 minutes.  Reserve 3/4 cup of corn, then scrape the rest into a food processor.  Add the pine nuts and Parmesan and pulse to combine.  Add the olive oil with the machine running and blend until almost smooth.  Add some water if necessary to smooth it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a pot of salty water to boil and cook the pasta until al dente.  Reserve 1 1/2 cups of the pasta cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the pasta cooking pot, combine the cooked pasta, corn pesto, reserved corn, most of the basil, and 3/4 of the bacon.  Over low heat, toss to combine, adding some of the reserved pasta cooking water until the sauce comes together and coats all the noodles.  Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta among bowls and top with remaining basil, bacon, and freshly grated Parmesan cheese, if desired.  Serve immediately.</p>"}]}