{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100315tortadelastresleches.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cakes", "Cook the Book", "cream", "milk", "Rose Levy Beranbaum", "Rose's Heavenly Cakes", "tres leches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Torta de las Tres Leches", "link": "https://www.seriouseats.com/recipes/2010/03/torta-de-las-tres-leches-cake-recipe.html", "description": "The first bite of <strong>tres leches cake</strong> that <strong><a href=\"http://www.realbakingwithrose.com/\">Rose Levy Beranbaum</a></strong> tasted stopped her in her tracks&mdash;it was one of the best things she had ever tasted. Coming from a woman who has written volumes on the subject of cake, this proclamation is not to be taken lightly. And if you've ever experienced the sweet joy that is tres leches cake, I'm sure you know exactly what she's talking about.", "totalTime": null, "recipeYield": "8 to 10", "recipeCategory": ["Cakes", "Cook the Book", "Desserts"], "recipeIngredient": ["6 large eggs, at room temperature", "1 cup superfine sugar", "1/2 teaspoon pure vanilla extract", "1/8 teaspoon salt", "2 cups (or 1 3/4 cups) cake flour (or bleached all-purpose flour), sifted into the cup and leveled off", "Leche Mixture (recipe follows)", "Whipped Cream Topping (recipe follows)", "<strong>Special Equipment</strong>: One 9 by 3-inch round cake pan, coated with baking spray with flour, then topped with a parchment round", "2 1/2 cups nonfat milk", "2 1/2 cups whole milk", "1 1/2 tablespoons sugar", "1 cup plus 3 tablespoons sweetened condensed milk (1 container)", "1 cup heavy cream", "1 1/2 cups heavy cream, cold", "1 tablespoon superfine sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Preheat the oven</strong>: Twenty minutes or more before baking, set an oven rack in the lower third of the oven and preheat the oven to 350°F/175°C.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, using a long-handled wire whisk, lightly combine the eggs, sugar, vanilla, and salt. Set the bowl over a saucepan of simmering water and heat until quite warm to the touch, stirring constantly with the whisk. Immediately transfer the bowl to the stand mixer fitted with the whisk beater, and beat the mixture on high speed for 5 minutes, or until it is very thick, light in color, and quadrupled in volume. In a 5-quart mixer bowl, it will come to about three-quarters high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the egg mixture is beating, sift the flour onto a piece of wax paper or parchment. When the beating is complete, sift half the flour onto the beaten eggs. With a large balloon whisk, slotted skimmer, or silicone spatula, fold it in gently but rapidly until almost all the flour has disappeared. Repeat with the remaining flour until the flour has disappeared completely. Scrape the mixture into the prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 30 to 35 minutes. The cake will rise to the top of the pan at the sides and dome slightly above the sides, developing a crack. When it is fully baked, the cake will lower a bit in the pan, come away slightly from the sides, and a wire cake tester inserted in the center will come out clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prevent the collapse of its delicate foam structure, while still hot, the biscuit must be unmolded as soon as it is baked. Have ready a small metal spatula and two wire racks that have been coated lightly with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a small metal spatula between the sides of the pan and the cake, pressing firmly against the pan. Unmold at once onto a prepared rack, leaving the parchment in place. Reinvert the cake to cool completely. The firm upper crust prevents falling and results in a light texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make Leche Mixture:</strong> In a heavy medium saucepan, boil the nonfat milk, whole milk, and sugar over medium heat until reduced by half (to 2 1/2 cups). Pour the mixture into a medium bowl and stir in the condensed milk and heavy cream. Cover and refrigerate until ready to soak the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and dry the cake pan in order to use it as a container for soaking the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a long serrated knife, remove the upper crust but do not remove any of the cake beneath it&mdash;leave it slightly domed. Remove the parchment and a little of the lower crust by scraping it lightly with the serrated blade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crisscross two sheets of plastic wrap on the work surface and place the cake top side up in the center of the wrap. Pull the plastic wrap up and wrap the cake. Set it in the cake pan in which it was baked. Open the top of the plastic wrap to expose the cake and slowly pour the milk mixture over the cake. It will absorb completely into the cake. Rewrap the cake and refrigerate it for 8 hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the top of the plastic wrap and gently invert the cake onto a flat surface such as the loose bottom of a tart pan. Reinvert it onto a serving plate with a lip or a 10-inch pie plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><Strong>Make the Whipped Cream Topping:</strong> In a mixing bowl, combine the cream and sugar and refrigerate for at least 15 minutes. (Chill the mixer's beaters alongside the bowl.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip the cream and sugar, starting on low speed, gradually raising the speed to medium- high, until stiff peaks form when the beater is raised.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish the cake:</strong>  Use a pastry bag fitted with a large open star pastry tube (3/8 to 1/2 inch) to pipe sideways shells or stars over the top of the cake. You may also swirl whipped cream with a spatula. Refrigerate the cake until ready to serve. As the cake sits, a little of the milk will exude around the bottom. The cake will keep for up to 3 days refrigerated.</p>"}]}