{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100223-dt-tortilla-soup.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "Dinner Tonight", "Mexican", "soups", "tortilla soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Tortilla Soup", "link": "https://www.seriouseats.com/recipes/2010/02/dinner-tonight-tortilla-soup-recipe.html", "description": "The real pleasures of <strong>tortilla soup</strong> come with the garnishes: the smooth coolness of avocado, the smoky chew of dried chiles, the burst of cilantro, the crunch of cabbage. Add all that to a golden, chickeny broth, tinged with tomatoes and the mellow heat of toasted chiles, and you have a restorative meal to last through these remaining weeks of winter doldrums.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains", "Mexican", "Soups and Stews"], "recipeIngredient": ["<strong>For the soup:</strong>", "3 tablespoons olive oil, plus 1 tablespoon for cooking the chicken", "1/3 medium onion, thinly sliced", "2 to 3 cloves garlic, minced", "2 tomatoes, diced", "3/4 teaspoon salt", "1 teaspoon dried oregano", "6 cups chicken broth", "12 ounces boneless skinless chicken, thigh or breast", "<strong>For garnishes:</strong>", "1/4 cup corn oil", "6 corn small corn tortillas, cut into strips", "1 teaspoon salt", "2 large dried chiles, such as ancho or guajilo", "Small handful cilantro leaves, chopped", "1 avocado, cut into chunks", "1/4 small head green cabbage, thinly sliced", "1 cup chopped stemmed spinach"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large soup pot over medium-high heat, then add the onion.  Cook until translucent, about two minutes, then add the garlic and cook for an additional minute. Stir in the tomatoes, salt, and oregano and cook for another minute, then add the chicken broth, bring to a boil, and reduce the heat to simmer for 30 minutes, until the tomatoes melt into the broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, prepare the tortilla strips. Heat the corn oil in a shallow skillet until a small piece of tortilla bubbles vigorously when added, then fry the strips in batches until golden, about 2 minutes. Transfer to paper towels to drain and toss while still hot with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken breast with a little salt and pepper and add the remaining olive oil to a skillet.  Heat over medium-high heat, then add the chicken and sear on both sides until golden, 3-4 minutes per side.  The chicken does not necessarily need to be cooked all the way through.  Add it to the soup with 3-4 minutes remaining in the cooking time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a dry skillet, toast the chiles over medium-high heat until they soften, 1 to 2 minutes.  Push them into the surface of the skillet as needed with a wooden spoon.  Remove to a cutting board, then stem and de-seed them and chop into small pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the broth into shallow bowls and garnish as desired.</p>"}]}