{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101103grilledbrieandgoatcheese.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bobby Flay", "Bobby Flay's Throwdown", "Cook the Book", "green tomatoes", "grilled cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Brie and Goat Cheese with Bacon and Green Tomato", "link": "https://www.seriouseats.com/recipes/2010/11/grilled-brie-and-goat-cheese-with-bacon-and-green-tomato-recipe.html", "description": "When Bobby Flay went up against The Pop Shop on a grilled cheese-themed episode of Throwdown! it seemed like the New Jersey soda fountain with a menu featuring 31 varieties of grilled cheese would have the advantage for sure. But...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Bacon", "Cook the Book"], "recipeIngredient": ["8 (1/4-inch-thick) slices center-cut bacon", "10 tablespoons (1 1/4 sticks) unsalted butter, at room temperature", "8 (1-inch-thick) slices Pullman bread", "12 ounces really good Brie, thinly sliced with a serrated knife", "2 green tomatoes, sliced 1/4 inch thick", "8 ounces soft goat cheese, such as Bûcheron, cut into 8 slices", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the bacon in a large skillet or on a griddle and cook, flipping it once, over medium heat until golden brown and crisp, about 10 minutes. Remove to a paper towel-lined plate. Break each piece in half and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a cast-iron griddle or cast-iron pan over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread butter on one side of each slice of bread. Flip over 4 slices of the bread slices and layer each with 3 to 4 slices of Brie, 2 green tomato slices, 2 slices of goat cheese, and 4 slices of the bacon. Season with salt and pepper. Place the remaining bread slices on top, butter side up, and cook on the griddle until the bottom is golden brown, 3 to 4 minutes. Flip the sandwich over, cover with a heatproof bowl (to melt the cheese), and continue cooking until the bottom is golden brown and the Brie has melted, 3 to 4 minutes.</p>"}]}