{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100809russiansnutcakes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["almonds", "cakes", "Cook the Book", "David Leite", "The New Portuguese Table", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: \"Russians\" Nut Cakes", "link": "https://www.seriouseats.com/recipes/2010/08/russian-nut-cakes-portuguese-desserts-baking-recipe.html", "description": "These Portuguese-Russian from <strong><em><a href=\"http://www.seriouseats.com/2010/08/cook-the-book-the-new-portuguese-table.html\">The New Portuguese Table</a></em></strong> by <a href=\"http://leitesculinaria.com/about\">David Leite</a> cakes are gorgeous.  Toasted, ground walnuts and almonds are incorporated into the clove scented batter, and then lightened with whipped egg whites.  Once the cake is baked and cooled it is topped with a pristine layer of vanilla butter cream, sprinkled with more ground nuts and then sliced into perfect little squares.  For an added layer of flavor you can spread the cakes with bitter orange marmalade before topping them with the buttercream.", "totalTime": null, "recipeYield": "sixteen 2-inch cakes", "recipeCategory": ["Cakes", "Cook the Book", "Desserts", "Nuts"], "recipeIngredient": ["<strong>For the cakes:</strong>", "Nonstick baking spray with flour ", "1 cup blanched whole almonds", "1 1/2 cups walnut halves", "1/2 cup granulated sugar ", "1/8 teaspoon ground cloves", "1/4 cup all-purpose flour ", "1 teaspoon baking powder ", "1/4 teaspoon kosher salt ", "6 tablespoons unsalted butter, at room temperature ", "3 large eggs, separated", "<strong>For the frosting:</strong>", "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature", "1/3 cup superfine sugar", "1/4 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and crank up the heat to 350&deg;F.  Coat and 8-by-8-inch baking pan with baking spray, line the bottom with parchment paper, and spray the paper.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the almonds and walnuts in a single layer on a rimmed baking sheet and roast in the oven until golden brown, 10 to 15 minutes.  Let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Buzz the nuts, along with 2 tablespoons of the sugar and the cloves, in a food processor until the mixture is the temperature of cornmeal, about 45 seconds.  Sift the flour, baking powder, and salt into a small bowl, and stir in 1 cup of the ground nuts.  Set the rest aside for decoration.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, or with a handheld mixer in a large bowl, beat the butter and the remaining 6 tablespoons of sugar on high speed until light and pale yellow, about 5 minutes.  Scrape down the mixture occasionally with a spatula.  Add the egg yolks one at a time, beating for 1 minute after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip the whites into glossy, firm peaks in a large bowl.  Stir the flour mixture into the yolk mixture, and then gently fold in the whites.  Scoop the batter into the prepared pan and smooth the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cake until golden brown and a toothpick inserted into the middle comes out clean, about 25 minutes.  Transfer the pan to a wire rack and let cool for 10 minutes.  Run a knife around the edges of the cake, place a rack on top, and flip.  Peel off the parchment, flip once more so the cake is right side up, and cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Switch to the whisk attachment and whip the butter in the clean mixer bowl on medium speed until light and smooth, about 3 minutes.  Slowly add the superfine sugar and whip until light and fluffy, about 6 minutes more.  Stir in the vanilla.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slather the top of the cake with the frosting.  Sprinkle with as much of the reserved ground nuts as you wish.  Using a serrated knife, trim the edges of the cake to neaten them, and slice the cake into 16 squares.  The cake can dry out quickly, so wrap them well with plastic if not serving right away.  </p>"}]}