{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101213RedPepperCaviarArtichoke610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["artichokes", "French in a Flash", "peppers", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash (Holiday): Red Pepper Caviar in Chilled Artichokes", "link": "https://www.seriouseats.com/recipes/2010/12/french-in-a-flash-christmas-red-pepper-caviar-in-chilled-artichokes-recipe.html", "description": "Chilled, hollowed artichokes are filled with a caviar de poivrons (red bell pepper caviar) and zested up with lemon, garlic, and piment d'espelette. It's an easy appetizer with a great presentation that can be made ahead. Perfect for the holidays!", "totalTime": "1 hour and 15 minutes, plus 1 to 2 hours chilling time", "recipeYield": "4", "recipeCategory": ["Vegetables", "Vegetarian"], "recipeIngredient": ["4 artichokes, trimmed", "Kosher salt", "5 red bell peppers (about 2 1/4 pounds)", "2 cloves garlic, grated", "1 tablespoon extra virgin olive oil", "2 tablespoons mayonnaise", "2 tablespoons 2% Greek yogurt", "1 teaspoon Dijon mustard", "1 tablespoon white wine vinegar", "1 teaspoon fresh lemon juice", "Freshly cracked black pepper", "1/8 teaspoon piment d’espelette", "Extra virgin olive oil and fleur de sel for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place oven rack 6 inches below broiler.  Preheat broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place artichokes in large stockpot and submerge in enough water to cover by 2 inches. Salt water. Cover pot, and bring to boil over high heat. Once boiling, reduce heat to medium-low. Cook, turning occasionally, until artichoke stems are tender, and leaves are easily removed from artichoke, about 45 minutes. Place artichokes upside down in a colander placed over bowl, and refrigerate until completely chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line rimmed baking sheet with aluminum foil. Place bell peppers on baking sheet, and broil for 30 minutes, turning once every 8 to 10 minutes. Once peppers are roasted, place in large glass bowl, and cover tightly with plastic wrap. Cool to room temperature. Once cool, remove skins and seeds. Pat roasted pepper flesh dry on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place roasted peppers and remaining ingredients in bowl of food processor. Process until smooth, about 2 minutes. Cover, and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each chilled artichoke in half lengthwise.  Remove innermost leaves and choke with teaspoon.  Fill cavity with chilled red pepper caviar.  Repeat for all remaining artichoke halves.  Drizzle with extra virgin olive oil, and garnish with extra black pepper and fleur de sel.  Serve immediately with fresh baguette.</p>"}]}