{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100118cookingunderpressure.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "Cooking Under Pressure", "Lorna Sass", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Boeuf en Daube Provençal", "link": "https://www.seriouseats.com/recipes/2010/01/cook-the-book-boeuf-en-daube-provencal-french-beef-stew-pressure-cooker-recipe.html", "description": "After yesterday's resoundingly successful chicken broth made in less than an hour with the help of my new pressure cooker, I was curious to see what other tricks this magical vessel had up its sleeve. The broth was incredible, but,...", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Beef", "Cook the Book", "Pressure Cooker", "Soups and Stews"], "recipeIngredient": ["2 cups drinking-quality red wine", "2 garlic cloves, chopped", "1/2 teaspoon dried thyme", "2 bay leaves", "2 tablespoons tomato paste", "3 to 5 anchovy fillet, packed in olive oil, drained, and mashed (optional)", "2 1/2 pounds boneless chuck or round, cut into 1 1/2-inch cubes, trimmed of excess fat", "2 tablespoons olive oil", "1 large onion, sliced", "1/3 cup pitted black olives, preferably oil-cured (optional)", "1/2 teaspoon salt, or to taste", "Freshly ground black pepper", "4 large carrots, peeled (leave whole)", "1/4 cup finely chopped fresh parsley", "1 tablespoon cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the wine, thyme, bay tomato paste, and mashed anchovies (if using) in a large nonaluminum bowl or storage container.  Add the beef, cover, and refrigerate for a few hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in the cooker.  Add the onion and cook over medium-high heat until lightly browned, about 4 minutes.  Holding the beef cubes to one side, pour the wine marinade into the cooker and boil it over high heat until it reduces somewhat, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the beef and stir in the olives (if using) plus salt (you are likely to need more if you haven't used the olives and anchovies) and pepper to taste.  Set the carrots on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lock the lid in place and over high heat bring to high pressure.  Adjust the heat to maintain high pressure and cook for 16 minutes.  Let the pressure drop naturally, about 10 minutes.  <em>Do not use the quick-release method.</em>  Remove the lid, tilting it away from you to allow steam to release.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Test the beef for doneness.  If it is not sufficiently tender, lock the lid back into place and return to high pressure for a few more minutes.  Again, let the pressure drop naturally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slash the carrots into chunks,  Stir in the parsley.  To thicken the sauce, dissolve the cornstarch in 1 tablespoon of water and stir it in.  Boil gently, stirring occasionally, until the mixture thickens, 1 to 2 minutes.  Remove the bay leaves and adjust the seasoning before serving.</p>"}]}