{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100330stecca.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baking", "bread", "Cook the Book", "Jim Lahey", "My Bread", "no-knead bread", "olives", "sun-dried tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Stecca with Olives and Sun-Dried Tomatoes", "link": "https://www.seriouseats.com/recipes/2010/03/cook-the-book-stecca-with-olives-and-sun-dried-tomatoes-recipe.html", "description": "There was no way that I could resist <strong>four long, thin baguettes studded with olives and sun-dried tomatoes.</strong> They looked absolutely beautiful, and knowing that the dough was based on Jim Lahey's foolproof <a href=\"http://www.seriouseats.com/recipes/2010/03/basic-no-knead-bread-dough-jim-lahey-recipe.html\">no-knead bread method</a>, I was confident that the finished loaves wouldn't be an all-day project.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Cook the Book", "Olives"], "recipeIngredient": ["3 cups (400 grams) bread flour", "1/2 teaspoon (3 grams) table salt", "3/4 teaspoon (3 grams) sugar", "1/4 teaspoon (1 gram) instant or other active dry yeast", "1 1/2 cups (350 grams) cool (55 to 65&deg;F) water", "Additional flour for dusting", "1/4 cup (about 60 grams) extra-virgin olive oil", "3/4 teaspoon (3 grams) coarse sea salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir together the flour, table salt, sugar, and yeast. Add the water and, using a wooden spoon or your hand, mix until you have a wet, sticky dough, about 30 seconds. Cover the bowl and let sit at room temperature until the surface is dotted with bubbles and the dough is more than doubled in size, 12 to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the first rise is complete, generously dust a work surface with flour. Use a bowl scraper or rubber spatula to scrape the dough out of the bowl in one piece. Fold the dough over itself two or three times and gently shape it into a somewhat flattened ball. Brush the surface of the dough with some of the olive oil and sprinkle with 1/4 teaspoon of the coarse salt (which will gradually dissolve on the surface).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a tea towel on your work surface and generously dust it with wheat bran, cornmeal, or flour. Gently place the dough on the towel, seam side down. If the dough is tacky, dust the top lightly with wheat bran, cornmeal, or flour. Fold the ends of the tea towel loosely over the dough to cover it and place in a warm, draft-free spot to rise for 1 to 2 hours. The dough is ready when it is almost doubled. If you gently poke it with your finger, it should hold the impression. If it springs back, let it rise for another 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Half an hour before the end of the second rise, preheat the oven to 500&deg;F:, with a rack in the center. Oil a 13-by-18-by-1-inch baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough into quarters. Gently stretch each piece evenly into a stick shape approximately the length of the pan. Place on the pan, leaving at least 1 inch between the loaves. Brush with olive oil and sprinkle with the remaining 1/2 teaspoon coarse salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 to 25 minutes, until the crust is golden brown. Cool on the pan for 5 minutes, then use a spatula to transfer the stecca to a rack to cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong><small>Note:</strong>The stecca may become a bit soggy in just a few hours because of the salt on the surface. If that happens, reheat the loaves in a hot oven until crisp. </small></strong></p>"}]}