{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100721-ctb-galette.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "Emeril Lagasse", "Farm to Fork", "galette", "goat cheese", "leeks", "puff pastry", "tomatoes", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Tomato, Zucchini, and Leek Galette with Roasted Garlic Goat Cheese", "link": "https://www.seriouseats.com/recipes/2010/07/tomato-zucchini-and-leek-galette-roasted-garlic-goat-cheese-recipe.html", "description": "This <strong>Tomato, Zucchini, and Leek Galette with Roasted Garlic Goat Cheese</strong> is a perfect example of Emeril's newfound reverence for fresh produce.  Ripe summer tomatoes, zucchini, and leeks are seasoned with just a touch of salt and white pepper, layered on a bed of herbed goat cheese and puff pastry.  It's a gorgeous and simple dish that lets the true character of the ingredients come through with all of its summery goodness.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cheese", "Cook the Book", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 sheet frozen puff pastry, thawed", "3 tablespoons olive oil", "2 cups thinly sliced well-washed leeks (white part only)", "Salt and freshly ground white pepper", "1 pound medium heirloom tomatoes, stem ends trimmed", "8 ounces zucchini, ends trimmed", "5 tablespoons extra-virgin olive oil", "5 ounces goat cheese, at room temperature", "1 teaspoon fresh thyme leaves", "2 heads Roasted Garlic (recipe follows)", "1/2 cup finely grated Parmigiano-Reggiano cheese", "2 tablespoons thinly sliced fresh basil leaves ", "12 ounces garlic (about 5 large heads)", "2 tablespoons extra-virgin olive oil", "1/4 teaspoon salt", "1/8 teaspoon freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll out the puff pastry dough to 1⁄16- inch thickness. Cut out a 12-inch round, and place it on a rimmed baking sheet lined with parchment paper. Chill the dough in the freezer for at least 15 minutes or up to an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tomatoes into ¼-inch-thick rounds, and arrange them in one even layer on a wire rack set over a baking sheet. Sprinkle with ¼ teaspoon salt, and set aside to drain for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, slice the zucchini into 1/8-inch-thick rounds. In a small bowl, mix the zucchini slices with 1 tablespoon of the extra-virgin olive oil, ¼ teaspoon salt, and 1/8 teaspoon white pepper. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-size bowl, combine the goat cheese, thyme, ½ teaspoon salt, ¼ teaspoon white pepper, and 2 tablespoons of the extra-virgin olive oil. Mix well with a rubber spatula. Squeeze each head of roasted garlic over the bowl, pressing the soft cloves out of the peel. Mix until the goat cheese is smooth and the mixture is uniform.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the baking sheet from the freezer (it is okay if the dough is frozen-- it will soften by the time you complete the assembly) and spread the goat cheese mixture evenly over the dough, leaving a 1-inch border around the edges. Spread the sautéed leeks evenly over the goat cheese. Blot the tomatoes dry and arrange them in a concentric pattern over the leeks. Arrange the zucchini slices in a concentric pattern over the tomatoes. Sprinkle the Parmesan evenly over the top. Fold the border of the pastry up and over the edge of the tomatoes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the galette for 20 minutes, or until the crust is golden and puffed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the galette from the oven, sprinkle the fresh basil over the top, and drizzle with the remaining 2 tablespoons extra-virgin olive oil. Set the galette aside for at least 15 minutes before slicing and serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Roasted Garlic</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Cut a piece of aluminum foil to measure approximately 12×8 inches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the top quarter off each head of garlic, and place the garlic, cut side up, on one side of the piece of foil. Drizzle the oil over the garlic, and sprinkle with the salt and pepper. Fold the other side of the foil over, and seal on all sides to form an airtight pouch.  Transfer the pouch to a baking sheet, and roast in the oven until the cloves are soft and golden brown, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pouch from the oven and let it sit until the garlic is cool enough to handle. Then squeeze each head of garlic, gently pressing it with your fingers to expel the soft cloves into a bowl. Stir the garlic with a rubber spatula to blend it thoroughly. Use as needed, or store in an airtight container in the refrigerator for up to 2 weeks. </p>"}]}