{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101020chickenandtheusualsuspects.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["capers", "chicken", "Cook the Book", "olives", "red peppers", "rice cooker", "Roger Ebert", "The Pot and How to Use It"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken and The Usual Suspects", "link": "https://www.seriouseats.com/recipes/2010/10/chicken-and-the-usual-suspects-recipe.html", "description": "With cooking instructions that read, <strong>\"put all the ingredients in the rice cooker and cook until done,\"</strong> <strong>Chicken and The Usual Suspects</strong> is quite possibly the least labor-intensive recipe in <em>The Pot and How To Use It</em>, and after opening a few cans and dicing chicken thighs, dinner was well on its way. Since I wasn't feeling particularly productive, I spent the time it took the pot to work its magic to speculate on which ingredients represented the various actors in this <a href=\"http://en.wikipedia.org/wiki/The_Usual_Suspects\">cinematically titled</a> dish&mdash;would Kevin Spacey make a better artichoke or a marinated mushroom?", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Cook the Book", "Olives"], "recipeIngredient": ["Rice (cover the bottom of the Pot about a half inch)", "Boneless chicken thighs, skinned, cut into 1/2-inch pieces", "Black olives, pitted, to taste (the nice ones if you can)", "Pearl onions to taste", "1 small jar marinated artichoke hearts (use the liquid, too)", "1 small jar roasted red peppers, sliced if you like", "1 small jar capers, drained", "1 can stewed tomatoes, drained", "1 small can marinated mushrooms (use the liquid, too)", "Vegetable stock, enough to submerge everything (can be cut with water)", "A few bay leaves", "Optional: Red pepper ﬂakes to taste (to spice it up if you like that)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put all the ingredients in the rice cooker and cook until done.</p>\r\n\r\n<p><small><strong>Note:</strong> Feel free to substitute fresh vegetables for canned/jarred if you like. Be sure to add Italian dressing (or similar) to add flavor if marinated artichokes/mushrooms are not used. Just be sure to season it somehow.</small></p>"}]}