{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101019_se_spicemix.jpg", "author": {"@type": "Person", "name": "helenjane"}, "recipeCuisine": "", "keywords": ["mains", "parties", "pork", "rib", "ribs", "Serious Entertaining"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Oven-Braised Pork Ribs", "link": "https://www.seriouseats.com/recipes/2010/10/oven-braised-ribs-recipe.html", "description": "[Photograph and illustration: Helen Jane Hearn] These ribs require a dry rub the day before, and after that, they bake for three hours. This means you need to plan ahead. That's okay&mdash;they're worth it. This dish works well at an...", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Halloween", "Mains", "Pork"], "recipeIngredient": ["3 pounds baby back ribs (about 2 full racks)", "1 cup brown sugar", "3 tablespoons chili powder", "3 tablespoons garlic salt", "1 teaspoon dry mustard", "1 teaspoon ground thyme", "1/2 teaspoon ground allspice", "1/2 cup granulated sugar", "1/2 cup water", "1/2 cup orange juice", "Juice of two limes", "1/3 cup honey", "1/3 cup ketchup", "1 tablespoon Worcestershire sauce", "1 teaspoon instant espresso powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse ribs and pat dry with paper towels. Combine brown sugar, chili powder, garlic salt, mustard, thyme and allspice in sealed container or Mason jar. Shake container until spices are thoroughly blended. Rub spice mixture over ribs on both sides. Form foil packet by folding a 4-foot long piece of foil in half lengthwise and crimping the long edges tight. Add ribs to packet and crimp top to close. Refrigerate at least 2 hours and up to 24.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350&deg;F. Whisk together sugar, water, orange juice ,and lime juice in medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the foil rib-packet out of the fridge and open one end. Shape the foil upward like a funnel. Pour in braising mixture. Reseal the foil packet and place on rimmed baking sheet. Bake at 350&deg; for 1 hour. Reduce heat to 250°F and continue cooking until tender, about 2 hours longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the pan from the oven and unroll one end of meat packet. Drain all juice into a small saucepan. Add the honey, ketchup, Worchestershire and cayenne pepper to the saucepan. Whisk furiously with the flame on medium-high. Bring to a boil and then reduce to medium low. Thicken sauce until it's of a spoon-coating consistency, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Brush ribs with sauce. Broil until it begins to look glossy and glazed, about 1 minute. Flip ribs and cover with more sauce. Return to broiler until deep mahogany in color, about 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and brush with sauce one more time. Let rest for 10 minutes, then cut into 4 equal portions. Serve immediately, passing more sauce tableside.</p>"}]}