{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100718piecookie2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["apple pie", "Cakespy", "cookie dough", "Cookies", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pookie = Pie + Cookie", "link": "https://www.seriouseats.com/recipes/2010/07/cakespy-pookie-a-cookie-coated-pie-recipe.html", "description": "Discovering the <a href=\"http://www.thisiswhyyourefat.com/?p=553684256\">Pake</a> (a pie baked into a gigantic cake) was something of an epiphany: talk about a way to make pie even awesomer. But it also prompted a question:<strong> what else could be applied to pie for an added dimension of delicious? </strong> The answer was clear, of course:<strong> a cookie dough coating.</strong> Introducing: the <strong>Pookie, a cookie-coated pie. </strong>", "totalTime": "", "recipeYield": "about 8", "recipeCategory": ["Cakespy", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 cup unsalted butter, at room temperature", "1 cup tightly packed brown sugar", "1/2 cup granulated sugar", "2 large eggs", "1 1/2 teaspoons vanilla", "3 cups flour, plus 2 tablespoons or so for handling dough", "1/2 teaspoon salt", "11 ounces (1 bag) butterscotch chips", " One 8-inch apple pie, slightly underbaked crust ideal (I used a store-bought pie)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Butter, and line with parchment, a 10-inch pie plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer, cream the butter and both sugars on medium speed until light and fluffy. Add the eggs one at a time, beating well and scraping down the sides of the bowl after each addition. Add the vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour and salt into a small bowl. Add the dry ingredients to the wet mixture, mixing until just combined. Fold in the butterscotch chips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using floured hands, press down a layer of cookie dough into the bottom of the pie plate, pressing slightly up the sides. Place the 8-inch pie (out of its plate, of course) on top. Gently pat the rest of the cookie dough on top and push down the sides, so that the pie is completely covered in dough. It should be just about the right amount, but if you seem to have extra keep it to the side and bake it as cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>Because I wasn't sure if the cookie dough would ooze up and around the pie, I put the pie plate on top of a pizza plate to bake, in case it dripped down the sides. It didn't, but it sure did give me a little extra confidence while baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until crispy on the edges and until the top part has a dull look--for me, about 50 minutes(you might want to check after 40 minutes, just in case).</p>"}]}