{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101229-129766-chocolate-chubbies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chocolate", "Cook the Book", "cookie a day 2010", "Cookies", "desserts", "holiday baking", "holiday cookies", "holiday sweets", "Sarabeth Levine", "Sarabeth's Bakery"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Chocolate Chubbies", "link": "https://www.seriouseats.com/recipes/2010/12/chocolate-chubbies-recipe.html", "description": "Not really a cookie or a brownie, these <strong>Chocolate Chubbies</strong> from <a href=\"http://goddessofbakedom.com/sb/sarabeth/about-sarabeth.html\">Sarabeth Levine</a>'s <strong><em><a href=\"http://www.amazon.com/Sarabeths-Bakery-My-Hands-Yours/dp/0847834085/serieats-20\">Sarabeth's Bakery</a></em></strong> are somewhere in between.", "totalTime": null, "recipeYield": "2 dozen cookies", "recipeCategory": ["Bake the Book", "Chocolate", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["8 tablespoons (1 stick) unsalted butter, cut into 1/2-inch cubes", "9 ounces semisweet or bittersweet chocolate (no more than 62 percent cacao), finely chopped", "3 ounces unsweetened chocolate, finely chopped", "1/2 cup unbleached all-purpose flour", "1/2 teaspoon baking powder ", "1/4 teaspoon fine sea salt", "3 large eggs, at room temperature", "1 1/4 cups superfine sugar", "2 teaspoons pure vanilla extract", "2 cups (12 ounces) semisweet chocolate chips", "1 1/2 cups (5 1/2 ounces) coarsely chopped pecans", "1 1/4 cups (4 1/2 ounces) coarsely chopped walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the center and top third of the oven and preheat to 350°F. Line two half-sheet pans with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 1 inch of water to a simmer in a medium saucepan over low heat. Put the butter in a wide, heatproof bowl, and melt the butter over the hot water in the saucepan. Add the semisweet and unsweetened chocolate, stirring often, until melted and the mixture is smooth. Remove the bowl from the heat and let stand, stirring occasionally, until cooled slightly but still warm, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour, baking powder, and salt together into a medium bowl. Whip the eggs in the bowl of a heavy-duty stand mixer fitted with the whisk attachment on medium-high speed until the eggs are foamy and lightly thickened, about 30 seconds. Increase the speed to high and gradually add the sugar, then the vanilla. Whip until the eggs are very thick and pale yellow, about 3 minutes. Reduce the mixer speed to medium and beat in the tepid chocolate, making sure it is completely incorporated. Change to the paddle attachment and reduce the mixer speed to low. Gradually add the flour mixture. Remove the bowl from the mixer. Using a wooden spoon, stir in the chocolate chips, pecans, and walnuts, making sure the chunky ingredients are evenly distributed at the bottom of the bowl. The dough will be somewhat soft.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a 2-inch ice-cream scoop, portion the batter onto the prepared pans, placing the cookies about 1 1/2 inches apart. Bake the cookies immediately—if you wait, they won’t be shiny after baking. Bake, switching the position of the pans from top to bottom and front to back about halfway through baking, until the cookies are set around the edges (if you lift a cookie from the pan, the edges should release easily, even if the center of the cookie seems underdone), 17 to 20 minutes. Do not overbake. Cool completely on the baking pans. </p>\n\n<p><small><strong>Note:</strong> The cookies can be stored in an airtight container at room temperature, with the layers separated by parchment paper, for up to 3 days.)</small></p>"}]}