{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101220SaffronMusselPasta610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French", "French in a Flash", "mussel", "mussels", "pastas", "seafood", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Creamy Saffron Mussel and Spinach Pasta", "link": "https://www.seriouseats.com/recipes/2010/12/french-in-a-flash-creamy-saffron-mussel-and-spinach-pasta-recipe.html", "description": "This pasta is based on a creamy saffron mussel soup I learned at cooking school in Paris. It was salty from the briny liqueur the mussels leach out into the pot, luscious and sweet from the cream, and heady and intoxicating from the scent of the saffron. This is my version, done on the cheap, built to fill you up.", "totalTime": "15 minutes, plus 1 hour for soaking mussels", "recipeYield": "4", "recipeCategory": ["Clams, Mussels, and Oysters", "French", "Pasta"], "recipeIngredient": ["2 pounds mussels", "Kosher salt", "1 pound casarecce pasta (fusilli is a good substitute)", "4 ounces baby spinach, roughly chopped", "1 tablespoon olive oil", "1 tablespoon unsalted butter", "1 1/2 very large shallots, sliced (or 3 small shallots, about 1/4 cup total)", "2 cloves garlic, thinly sliced", "Freshly cracked black pepper", "1/4 cup dry white wine", "1/2 cup low-sodium chicken stock, preferably organic", "3/4 teaspoon saffron", "1/4 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the mussels in large bowl full of water and ice. Add 1 to 2 tablespoons all-purpose flour, and let mussels sit for 1 hour to purge. Rinse mussels in cold running water, pull off any beards and discard, and set mussels aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring large pot of water to a boil, and salt it well. Add pasta, and cook until al dente. Add spinach to hot water with pasta at last second, stir once to submerge, then drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in wide braising pan, heat oil and butter over medium heat until melted. Add shallots and garlic, and season with salt and pepper.  Sweat, stirring often with wooden spoon, until shallots are soft and translucent, about 4 minutes. Add white wine, and simmer for 1 minute.  Add chicken stock and saffron, cover and increase heat to high, and bring liquid to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mussels to pot, and lower heat to medium. Cover and simmer until all mussels have opened, 6 to 8 minutes. Remove from heat and stir in cream. Add drained pasta and spinach, and return to low heat, stirring for 1 minute, until pasta has absorbed some of the sauce and color of the saffron. Remove mussels from shells and stir back into pasta if desired.  Serve immediately.</p>"}]}