{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100423-konnyaku-sashimi.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Japanese", "keywords": ["Japanese", "konnyaku", "Seriously Asian", "shirataki", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: Konnyaku", "link": "https://www.seriouseats.com/recipes/2010/04/seriously-asian-simmered-konnyaku-with-beef-recipe.html", "description": "There are few foods on the planet for which you expend more energy chewing it than you receive in calories. Raw celery is one of them. <strong>Konnayaku,</strong> the Japanese product made from a plant in the taro family called <a href=\"http://en.wikipedia.org/wiki/Konjac\">konnayku</a> (also referred to as konjac or devil's tongue), is my low calorie food of choice. Here are some suggestions for how to cook with it, including a recipe for simmered konnyaku with beef.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Japanese", "Other Vegetables", "Vegetarian"], "recipeIngredient": [], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium-sized pot of water to boil. Add the whole block of konnyaku or the package of shirataki and parboil for 10 minutes. Drain and discard the water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the konnyaku lengthwise into two rectangular blocks, then cut each block into pieces 1/2-inch thick. Score each piece in a cross-hatch pattern to allow the flavors of the simmering liquid to penetrate more deeply. Set aside. If using shirataki, set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a heavy pan, such as a cast iron skillet, over high heat. Add cooking oil or fat to the pan. Add the cubed beef to the pan and lightly brown on two sides; then remove with a slotted spoon. Using the remaining fat in the pan, lightly saute the parboiled and drained konnyaku or shirataki so that the surface is blistered and slightly browned. Remove and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the beef and the konnyaku or shirataki along with all the marinade ingredients into a medium saucepan. Bring the pot to a boil; then lower the heat to a simmer and cook for 1 to 1 1/2 hours, until the beef and konnyaku are tender. For a vegetarian option, substitute daikon and lotus root for the beef and add the vegetables during the latter half of simmering.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the miso paste to the simmering liquid and stir to dissolve.  Simmer for a few minutes, correcting for taste. Depending on how salty your soy sauce and miso paste are, you may need to add a teaspoon or more of sugar. Serve hot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> The squares of konnyaku may be browned in a hot cast iron pan, or set under the broiler for a few minutes to recrisp the surface. </p>"}]}