{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101027-applejamrecipe-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["apples", "Edible DIY", "jams", "raisins", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rum Raisin Apple Pie Jam", "link": "https://www.seriouseats.com/recipes/2010/10/rum-raisin-apple-pie-jam-recipe.html", "description": "Filled with tart Granny Smith apples, juicy raisins, cinnamon, nutmeg, ginger, and a healthy shot of dark rum, this jam tastes exactly like my favorite holiday apple pie. It's insanely good on cornbread and pretty darn delicious on plain old...", "totalTime": null, "recipeYield": "Seven (8-ounce) jars, plus a little leftover", "recipeCategory": ["Apple", "Breakfast Sweets", "Condiments and Sauces", "Edible DIY"], "recipeIngredient": ["3/4 cup raisins", "6 cups peeled, cored, and chopped Granny Smith apples (about 5 medium apples)", "3/4 cup unsweetened apple juice or apple cider", "1/4 cup dark rum", "2 tablespoons freshly squeezed lemon juice", "Freshly grated zest of one lemon", "1 (1.75-ounce) package regular powdered fruit pectin", "9 cups granulated sugar", "1 teaspoon cinnamon", "1/4 teaspoon nutmeg", "1/4 teaspoon ground ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place 7 half-pint jars on rack in large pot. Add enough water to cover jars and bring to boil over high heat. Boil for 10 minutes, turn off the heat and allow jars to rest in hot water. Meanwhile, put rims and lids in small saucepan and cover with water. Heat over medium heat until water is simmering; remove pan from heat and allow rims and lids to rest in hot water.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse the raisins in a food processor until finely chopped, about seven one-second pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the apples, apple juice, rum, lemon juice, and lemon zest in a big pot. Bring to a boil over high heat. Reduce the heat to medium and continue to cook, stirring occasionally, until the apples are soft and beginning to break down, about 12 to 15 minutes. Mash the apples with a potato masher or large fork to make a chunky sauce. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove apple mixture from heat, add pectin, and stir until dissolved. Stir in raisins. Return pot to high heat and bring mixture to a boil.  Add sugar all at once. Stir mixture constantly until it comes to a full rolling boil. Allow to boil hard for one minute, then remove pot from heat and stir in cinnamon, nutmeg, and ginger. Skim any foam off surface of the jam with a slotted spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow to rest undisturbed on countertop for six hours or overnight. </p>"}]}