{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100621-pancakes-primary-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["buttermilk", "easy", "pancake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9375", "ratingCount": "32"}, "name": "Light and Fluffy Buttermilk Pancakes", "link": "https://www.seriouseats.com/recipes/2010/06/light-and-fluffy-pancakes-recipe.html", "description": "These pancakes are extra light and fluffy with a classic buttery flavor and golden brown, crisp tops and bottoms.", "totalTime": "30 minutes", "recipeYield": "Makes 16 pancakes", "recipeCategory": ["Pancake", "The Food Lab"], "recipeIngredient": ["<strong>Basic Dry Pancake Mix:</strong>", "10 ounces (about 2 cups) all purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1 teaspoon kosher salt", "1 tablespoon sugar", "<strong>For Each Batch of Pancakes</strong>", "2 large eggs, separated", "1 1/2 cups (about 12 ounces) buttermilk", "1 cup (about 8 ounces) sour cream (see note)", "4 tablespoons unsalted butter, melted, plus more for serving", "Warm maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dry Pancake Mix:</strong> Combine flour, baking powder, baking soda, salt, and sugar in a medium bowl and whisk until homogenous. Transfer to an airtight container. The mix will stay good for 3 months. (See note.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For each Batch of Pancakes:</strong> Place one batch of dry mix in a large bowl. In a medium clean bowl, whisk the egg whites until stiff peaks form. In a large bowl, whisk the egg yolks, buttermilk, and sour cream until homogenous. Slowly drizzle in the melted butter while whisking. Carefully fold in the egg whites with a rubber spatula until just combined. Pour the mixture over the dry mix and fold until just combined (there should still be plenty of lumps).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large heavy-bottomed nonstick skillet over medium heat for 5 minutes (or use an electric griddle). Add a small amount of butter or oil to the griddle and spread with a paper towel until no visible butter or oil remains. Use a 1⁄4-cup dry measure to place 4 pancakes in the skillet and cook until bubbles start to appear on top and the bottoms are golden brown, about 2 minutes. Carefully flip the pancakes and cook on the second side until golden brown and completely set, about 2 minutes longer. Serve the pancakes immediately, or keep warm on a wire rack set on a rimmed baking sheet in a warm oven while you cook the remaining 3 batches. Serve with warm maple syrup and butter.</p>"}]}