{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100608hominy%20stew.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "hominy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Quick Squash and Hominy Stew", "link": "https://www.seriouseats.com/recipes/2010/06/eat-for-eight-bucks-quick-squash-and-hominy-s.html", "description": "When my husband gets excited about an almost-vegetarian dinner, you may safely assume two things about the recipe: it involves a small but crucially tasty amount of bacon, and it is going straight into my file of keepers. This combination of summer squash, corn, and beans is nutritious, filling, and fast.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Eat for Eight Bucks"], "recipeIngredient": ["1/4 pound good, thick bacon, chopped", "1 tablespoon olive oil", "1 yellow onion, peeled and chopped", "3 cups cooked or canned hominy, drained", "1 cup hominy- and/or bean-cooking liquid, or water", "1 cup cooked beans, preferably pinto, drained", "1/4 teaspoon freshly ground black pepper", "1 pound zucchini or other summer squash, cut into bite-size pieces 1/4 inch thick", "Salt", "Lemon (optional)", "2 to 3 ounces crumbled queso fresco or feta cheese", "Chopped parsley or cilantro (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the bacon in a large saucepan or small Dutch oven over medium heat until firm and a bit crisp, about 7 to 10 minutes. Remove with a slotted spoon to drain on a plate lined with paper towels. Pour the fat from the pot into a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 2 tablespoons of bacon fat back into the pot along with the olive oil. Turn the heat to medium, add the onion, and saute until soft and translucent, about 5 minutes. Add the hominy and saute for abut 5 minutes, stirring occasionally. Add the cup of liquid (hominy- or bean-cooking liquid or water) and pepper and bring to a simmer. Cover, turn the heat to medium low, and simmer for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the squash and beans to the pot, replace the cover, and simmer until the squash is almost completely cooked, about 5-7 minutes (taste a piece of squash to be sure). Uncover the pot and simmer until the liquid in the pot thickens a bit and the squash is completely cooked, a few minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste for salt and pepper. If you have a lemon, you might add a squeeze of lemon juice, but the dish is delicious without it. Garnish each bowl of stew with bacon and crumbled cheese. Chopped parsley or cilantro would make nice garnishes, too, but I did not use them.</p>"}]}