{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100908musselswithcornandsherry.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "corn", "In the Kitchen with A Good Appetite", "melissa clark", "mussel", "mussels", "sherry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Garlicky Steamed Mussels with Corn and Sherry", "link": "https://www.seriouseats.com/recipes/2010/09/garlicky-steamed-mussels-with-corn-sherry-recipe.html", "description": "These <strong>Garlicky Steamed Mussels with Corn and Sherry</strong> from <em><a href=\"http://www.amazon.com/Kitchen-Good-Appetite-Recipes-Stories/dp/1401323766/serieats-20\">In the Kitchen with A Good Appetite</a></em> by <strong><a href=\"http://www.melissaclark.net/\">Melissa Clark</a></strong> are the perfect summer-fall transition food.  The mussels are steamed with sweet corn&mdash;it still tastes of summer, but is warm enough for these slightly chilly nights.  The sherry, used instead of a more typical white wine or beer to steam the mussels, lends an almost woody, caramelized element that complements the briny mussels.", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["2 pounds mussels", "1 tablespoon extra-virgin olive oil", "4 garlic cloves, minced", "2 scallions, white and green parts, thinly sliced", "1 shallot, finely chopped", "Kosher salt to taste", "2 ears corn, kernels scraped from the cob", "1/3 cup dry (fino) sherry", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the mussels under cold running water. If you see hairy clumps around the shell (called beards), use a sharp knife or your fingers to pull them off, then scrub the shells well with a vegetable brush.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a soup pot with a tight-fitting cover, heat the olive oil, then add the garlic, scallions, shallot, and a pinch of salt. Sauté until the shallots and garlic are softened, 3 minutes. Add the corn and continue to sauté until it begins to soften, about 3 minutes longer.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the sherry and bring to a simmer. Let simmer until the corn is cooked through, about 5 minutes. Add the mussels and cover the pot. Let the mussels steam, stirring once or twice, until they open, 5 to 10 minutes. Use a slotted spoon to transfer the mussels to bowls. Discard any that have not opened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the pan juices and simmer until the butter is melted and the sauce is slightly thickened, about 2 minutes. Pour the mixture over the mussels and serve immediately.</p>"}]}