{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100722-dt-scallops-with-succotash.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["corn", "Dinner Tonight", "fava beans", "peas", "scallops", "seafood", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Scallops with Corn and Fava Bean Succotash", "link": "https://www.seriouseats.com/recipes/2010/07/dinner-tonight-scallops-with-corn-and-fava-bean-succotash-recipe.html", "description": "With so many spring and summer vegetables available&mdash;fava beans, corn, shelling peas, zucchini&mdash;I wanted to try them all.  That's when inspiration hit in the form of <strong>succotash.</strong> A perfect way for all the vegetables to play along, each combined in a skillet and simmered with a little milk until al dente and tossed with slivered basil.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beans and Pulses", "Corn", "Dinner Tonight", "Legumes", "Other Seafood"], "recipeIngredient": ["1 pound fava beans, beans removed from pods", "1/4 pound fresh shelled peas", "1/4 cup olive oil", "3 cloves garlic, sliced", "2 ears corn, kernels cut off", "1 zucchini or summer squash, cut into 1/2 inch half moons", "6-8 large basil leaves, stacked and cut into strips", "12 scallops", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of salted water to boil and prepare a bowl filled with ice water.  Plunge the fave beans into the water and cook for 2-3 minutes, then remove with a slotted spoon to the ice bath to cool quickly (save the water for cooking the peas). Once cool, take the beans and remove the tough outer layer, which should slip away easily to reveal the bright green bean inside. Cook the peas for 2-3 minutes in the boiling water and then transfer them to the ice water as well, draining once cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) skillet, heat 3 tablespoons of the oil over medium heat. Add the garlic and cook for a minute, then add the corn and cook for an additional 4-5 minutes. Add the peas, zucchini, and milk and cook until most of the moisture has evaporated and absorbed into the vegetables. With a few minutes left of cooking, add the fava beans and butter. Remove from the heat and quickly stir in the basil leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, season the scallops generously with salt and pepper and heat the remaining olive oil over high heat in a non-stick skillet large enough to hold the scallops comfortably. When the oil is shimmering and almost smoking, add the scallops to the pan and cook them, untouched, for about 5 minutes, until they develops a golden crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the succotash among plates and top with the scallops. Serve immediately.  </p>"}]}