{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Aaron Mattis"}, "recipeCuisine": "", "keywords": ["pizza", "pizza crusts", "pizza dough", "sourdough"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sourdough Pizza Crust", "link": "https://www.seriouseats.com/recipes/2010/06/sourdough-pizza-crust-dough-recipe.html", "description": "While making pizza crust with sourdough starter might take a little extra care, it's worth your time. The sourdough brings a robust tanginess to the dough, which pairs well with a host of toppings.", "totalTime": "", "recipeYield": "4 ten-ounce balls of dough", "recipeCategory": ["Bread", "Pizza"], "recipeIngredient": ["1 cup mature 100 percent hydration sourdough starter", "18 ounces unbleached bread flour, plus more for dusting", "3 1/2 teaspoons kosher salt", "3 tablespoons granulated sugar", "1/4 cup extra virgin olive oil", "1 to 1 1/4 cups lukewarm water (approximately 90°F)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove starter from refrigerator and let sit at room temperature for 2 hours. Combine starter, flour, salt, sugar, olive oil, and 1 cup water. Work vigorously by hand or with a stand mixer until dough forms a coarse ball that comes away from the sides of the ball, adding more water or flour as necessary, about 4 minutes. Let rest for 15 minutes. Turn out onto a lightly floured counter, dust with flour, and knead by hand until soft, supple, and no longer sticky, about 3 minutes. Alternately, mix on low speed in stand mixer until this texture is achieved, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a large bowl. From dough into a ball and roll all around bowl until coated with oil. Cover bowl with plastic wrap and let rise in a warm, draft-free environment until dough has increased by at least half in volume. The duration of the rise will depend on the strength of your starter; I let mine sit in a cool oven overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into fourths. Form each piece into a ball and coat with olive oil. Seal each piece in an airtight freezer bag. Let rest at room temperature for 1 hour, and then refrigerate overnight.</p>"}]}