{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100802zucchinitomato.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["charnushka", "potatoes", "Spice Hunting", "spices", "tomatoes", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Tomatoes, Zucchini, and Potatoes with Charnushka", "link": "https://www.seriouseats.com/recipes/2010/08/roasted-tomatoes-zucchini-and-potatoes-with-charnushka-recipe.html", "description": "[Photograph: Max Falkowitz] Charnushka is great in spice blends and complex simmered dishes, but it's simpler dishes like these that show off all it can do. Here it's used as a substitute for black pepper as a more interesting, less...", "totalTime": "40-50 minutes", "recipeYield": "6", "recipeCategory": ["Potato", "Sides", "Vegetarian", "Zucchini"], "recipeIngredient": ["4 medium-large ripe tomatoes, cut into large dice", "4 large zucchini, cut into large dice", "8 cloves of garlic, minced", "2 tablespoons of charnushka, toasted and slightly ground", "5 large Yukon Gold potatoes, cut into 3/4 inch cubes", "1/3 cup of olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn your oven to 450&deg;F. Position two racks so they are close to the middle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss the potatoes with half the olive oil and a few large pinches of salt. Make sure they're thoroughly coated. When the oven is about 250&deg;F, transfer the potatoes to one or two cast iron skillets and slide them into the lower rack of the oven. Using cast iron and starting in a low oven will make the potatoes addictively crispy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Leave the potatoes alone for 15 to 20 minutes while they develop a crust. In the meantime, prep your remaining ingredients and toss in the same large bowl with a few heavy pinches of salt. Transfer them to a sheet pan and spread so they're all in a single layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After about 20 minutes, add the tomatoes and zucchini to the other rack and check on the potatoes. If a thin metal spatula can slide under them without too much resistance and the bottoms are a deep golden brown, toss them and spread so they're once again in a single layer. If they're stuck or aren't fully browned, leave them be. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Every 10 minutes thereafter, check on the potatoes and toss as needed. They'll likely finish cooking as the tomatoes and zucchini have softened up and released plenty of juices, which is when they're done (they won't really caramelize with all that moisture). Remove all the ingredients from the oven and combine on a platter just before serving.</p>"}]}