{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100506QuatreEpicesCandiedNuts610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["almonds", "candy", "French in a Flash", "nuts", "snacks", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Quatre Épices Candied Nuts", "link": "https://www.seriouseats.com/recipes/2010/05/french-in-a-flash-quatre-epices-candied-nuts-recipe.html", "description": "The French are renowned for their superior walnuts and almonds. This brittle coats the nuts in a sticky, crisp blanket of sweetness and spice...and everything nice. The heat of the quatre épices makes it perfect for an apéritif, and the sweetness for a dessert. A simple-to-make Jacques of all trades.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "French", "Nuts", "Snacks", "Vegetarian"], "recipeIngredient": ["1 cup sugar", "1 1/4 cups water", "1 teaspoon salt", "1/2 teaspoon cinnamon", "1/2 teaspoon nutmeg", "1/4 teaspoon cloves", "1/4 teaspoon black pepper", "1 cup roasted, salted almonds", "1 1/2 cups walnut halves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a nonstick pan, combine the sugar and the water. Bring to a boil.  Line a baking sheet with parchment paper, and spray with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water and sugar mixture begins to turn slightly golden, add the salt, cinnamon, nutmeg, cloves, and black pepper. Stir in the almonds and the walnuts so that everything is combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the heat to medium, adjusting the heat as necessary to keep the caramel from burning, and keep turning the nuts continuously until the water and sugar have reduced to a thick syrup that coats the nuts. At this point, the mixture will be golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a silicone spatula, spoon the nuts onto the prepared lined and lightly greased baking sheet. Spread them in a single layer, and leave to cool complete.  Do NOT touch the hot nuts, as boiling sugar will burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the candied nuts have completely cooled, separate them with your hands, and sneak at least one handful for yourself before sealing them away in an airtight jar to be plundered by everyone else.</p>"}]}