{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100322-dt-almond-tofu-buckwheat-noodles.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["almonds", "noodles", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Almond Tofu with Buckwheat Noodles and Snow Peas", "link": "https://www.seriouseats.com/recipes/2010/03/dinner-tonight-almond-tofu-with-buckwheat-noodles-recipe.html", "description": "This is not my kind of food. No disrespect, it's just not what I dream of on my way home from work with a grumbling stomach, lunch long past. <strong>Strips of baked tofu, a sauce made with almond butter, and a pile of buckwheat noodles?</strong>  But I will always respect a recipe that tastes really good.  Always.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dairy-Free", "Dinner Tonight", "Nuts", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["14 ounces extra-firm tofu, drained", "6 tablespoons almond butter", "2 tablespoons soy sauce", "3 tablespoons maple syrup", "1 tablespoon sesame oil, plus more as needed", "4 tablespoons neutral oil, such as canola", "3 scallions, thinly sliced", "1 tablespoon minced fresh ginger", "2 cloves garlic, minced", "3 cups snow or snap peas, ends trimmed and halved", "8 ounces soba noodles", "2 tablespoons rice vinegar", "1 cup fresh cilantro, chopped", "Sriracha or other hot sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Cut the tofu into 1/4-inch thick strips.  Combine the almond butter, soy sauce, maple syrup, and sesame oil and whisk until smooth.  Oil a baking sheet with half the neutral oil and lay the tofu strips in a single layer, then spoon 1/2 teaspoon of the almond butter mixture on each piece.  Spread it out to paint the top and bake the tofu for 25 minutes, then flip the pieces and coat them with the same amount of almond butter mixture. Bake for an additional 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the other ingredients.  When the tofu is done, remove and cut into strips.  Heat the remaining neutral oil in a wok or large skillet until shimmering and add the scallions.  Cook for a minute, then add the tofu.  After a minute, add the garlic and 1/2 cup water and stir well while cooking.  Spoon in the remaining almond butter mixture and stir well to combine.  Cover.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, cook the soba noodles in salted boiling water, adding the snap or snow peas for the last couple minutes of cooking.  Drain and add to the stir-fry pot along with the rice vinegar and cilantro.  Toss to combine and serve.</p>"}]}