{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101115_dt_redpeppersoup.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "paprika", "red peppers", "smoked paprika", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Dinner Tonight: Red Pepper Soup with Toasted Cumin Seeds", "link": "https://www.seriouseats.com/recipes/2010/11/red-pepper-soup-with-toasted-cumin-seeds-recipe.html", "description": "I'm not much of a red pepper soup guy. It's not that I <em>hate</em> the stuff, it's just that blended soups in general don't usually excite me. But I am a sucker for the traditional Indian spices which show up in this recipe from <a href=\"http://www.cookingchanneltv.com/recipes/red-pepper-soup-with-toasted-cumin-seeds-recipe/index.html\">Bal Arneson on the Cooking Channel</a>. And when you <strong>add smoked paprika,</strong> which I've been addicted to for months now, I just couldn't pass it up. I imagined a multi-layered soup, with a slightly smokey edge, warming and just slightly sweet from the peppers.", "totalTime": "", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Soups and Stews"], "recipeIngredient": ["2 tablespoons canola oil ", "1 small red onion, chopped", "2 large garlic cloves, minced", "1 tablespoon garam masala ", "1 teaspoon asafoetida (optional)", "1 teaspoon mustard seeds", "1 teaspoon plus 1 tablespoon cumin seeds, divided ", "1 teaspoon Spanish smoked paprika ", "3 red bell peppers, stemmed, seeded, and sliced ", "1/2 cup vegetable broth ", "1/2 cup white wine ", "salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour oil into into a large 12-inch skillet. Turn heat to medium. When shimmering, add red onion and garlic. Cook until onion is soft, about 4 minutes. Add garam masala, asafoetida (if using), mustard seeds, 1 teaspoon cumin seeds, and paprika. Stir with wooden spoon, and cook for 10 seconds, or until fragrant. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss in red peppers. Cook for 2 minutes, or until they begin to soften. Pour in broth and wine. Bring mixture to to a simmer, and then reduce heat to medium-low. Season with salt and pepper to taste. Let cook for 8 to 10 minutes, or until peppers are soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off heat. Transfer half of contents of soup to a blender. Carefully puree and pour into large bowl. Puree the other half of soup. Quickly rinse out skillet, and then pour soup back in. Warm over medium-low heat. Then ladle soup into bowls. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place remaining tablespoon of cumin seeds in cast iron skillet set over medium-high heat. Stir gently until they just begin to become fragrant and lightly smoke. Turn off heat and sprinkle toasted cumin seeds over soup. </p>"}]}