{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101909PeachCardamomPie.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["dessert", "desserts", "easy", "fruit", "healthy and delicious", "peaches", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Healthy and Delicious: Top-Crust Peach and Cardamom Pie", "link": "https://www.seriouseats.com/recipes/2010/09/top-crust-peach-and-cardamom-pie-recipe.html", "description": "Recipes like Top Crust Peach and Cardamom Pie from <em>Bon Appetit</em> via <a href=\"http://www.epicurious.com/recipes/food/views/Top-Crust-Peach-and-Cardamom-Pie-354339\">Epicurious</a> have helped me get over my cooked fruit issues. This recipe <strong>flips the classic peach pie upside-down</strong> and gives it a (gentle, loving) kick in the seat. Tart and sweet, the warm, fragrant cardamom complements the <strong>sassy, tangy peaches</strong>. Together, they perfectly evoke the change of season. It's a terrific entry-level recipe for anyone hesitant about giving pie a go.", "totalTime": "2 hours", "recipeYield": "8", "recipeCategory": ["Dairy-Free", "Desserts", "Fruit Desserts", "Healthy and Delicious", "Peach", "Pies, Tarts, and Crumbles", "Vegan"], "recipeIngredient": ["<strong>For the crust:</strong>", "1 1/4 (6.25 ounces) cups unbleached all-purpose flour", "1 1/2 teaspoons plus 1/4 cup turbinado or demarara sugar ", "1/2 teaspoon kosher salt ", "1/2 cup chilled non-hydrogenated vegetable shortening, cut into 1/2-inch cubes ", "3 tablespoons ice water", "<strong>Filling</strong>", "2 1/2 pounds firm, ripe peaches, peeled, pitted, sliced 1/2 inch thick ", "2 tablespoons cornstarch", "2 teaspoons fresh lemon juice", "1/3 teaspoon ground cardamom", "1 tablespoon almond milk (or 1 egg, beaten)", "1 teaspoon turbinado or demarara sugar (for sprinkling)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For crust:</strong> Blend flour, 1 1/2 teaspoons sugar, and salt in food processor. Add shortening. Pulse until mixture resembles very coarse meal, about eight 1-second pulses. Add ice water. Pulse until mixture comes together in moist clumps, about six 1-second pulses, adding up to 1 tablespoon more water if dough is dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out dough onto lightly floured work surface and knead just until dough comes together, 4 to 5 turns. Roll dough into cylinder and cut in half. Flatten one half into disk; wrap in plastic and chill for at least 30 minutes. Wrap remaining half in plastic and freeze up to three months. Dough can also be made ahead and kept chilled in refrigerator for one day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line large baking sheet or cutting board with parchment paper. Sprinkle work surface with flour and roll out dough to 13-inch round. Transfer dough to baking sheet and chill 20 minutes. Using 2 1/2- to 3-inch cookie cutter, cut shapes from dough, leaving cutouts on baking sheet. Reroll scraps and cut out more shapes if necessary. Chill cutouts on baking sheet while preparing filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For filling:</strong> Adjust baking rack to lowest position in oven and preheat to 400°F. In a medium bowl, toss peach slices, remaining 1/4 cup sugar, cornstarch, lemon juice, and cardamom until peaches are coated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer filling to 9-inch pie plate. Arrange crust cutouts over filling in slightly overlapping rings, working from the outside edge to the center. Brush crust with almond milk, then sprinkle with additional sugar if desired. Bake until crust is golden brown and juice is bubbling, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to baking rack and cool at least 30 minutes. Serve warm or at room-temperature in bowls with your favorite topping or <em>au natural</em>.</p>"}]}