{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/030310-chickenparmesan.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Italian", "keywords": ["chicken", "chicken parmesan", "Cook's Illustrated", "Dinner Tonight", "Italian", "parmesan", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken Parmesan", "link": "https://www.seriouseats.com/recipes/2010/03/the-best-chicken-parmesan-recipe-cooks-illustrated.html", "description": "Most of my chicken parmesan experiences have been bad ones. You probably know where this is headed&mdash;the oversized portions of heavily breaded chicken topped with boring tomato sauces and layer upon layer of greasy cheese. But this recipe is well-proportioned, light on the grease, and clean in flavor. <strong>It's easily the best chicken parmesan I've ever had.</strong>", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Italian"], "recipeIngredient": ["2 garlic cloves, minced", "1/2 cup extra-virgin olive oil", "1 28-ounce can crushed tomatoes", "1/2 teaspoon dried basil", "1/4 teaspoon dried oregano", "1/4 teaspoon granulated sugar", "1 large egg", "1/2 cup dry bread crumbs", "2 large boneless, skinless, chicken breasts (about 8 ounces each), tenderloins removed", "3/4 cup mozzarella cheese, grated", "1/4 cup Parmesan cheese", "8 ounces spaghetti or linguine", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, bring a large pot of water to a boil. Then start with the sauce. Pour 1/4 cup of the olive oil into a pot set over medium-high heat. Add the garlic and cook until fragrant, about 15 seconds. Dump in the tomatoes, along with the dried basil, dried oregano, sugar, and a pinch of salt and pepper. Reduce heat to a simmer and cook for 10 to 12 minutes, or until it has thickened up nicely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sauce is cooking, slice each chicken breast in half horizontally, so you end up with four roughly 4-ounce portions of chicken. Each one should be about 1/4-inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the egg into a small pie pan or baking dish, add 1/4 teaspoon of salt, and beat until combined. In another small pie pan or baking dish, combine the bread crumbs, 1/4 teaspoon salt, and a few cracks of pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip one of the chicken cutlet into the beaten, and then into the bread crumbs. Toss to coat. Place it on a wire rack set over a large pan, and repeat process with other cutlets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Pour the rest of the olive oil into a large skillet set over medium-high heat. When the oil just starts to shimmer, add the cutlets. They should all fit in a single layer. Cook for 5 to 6 minutes, flipping halfway through. Wash the rack while you cook the cutlets, and dry. Set the cooked cutlets on the cleaned wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta along with 2 teaspoons of salt to the boiling water. Cook according to the directions on the box. Drain when done and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top each cutlet with a quarter of the mozzarella and parmesan. Place wire rack set over the pan under the broiler, about 4 to 5 inches from the top, and broil for about 2 to 3 minutes, or until the cheese is nicely browned and bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the spaghetti into four portions and plate. Top each with a cutlet and a generous helping of the sauce. Serve.</p>"}]}