{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101018BroccoliRaabSausageGrapes.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["broccoli rabe", "grapes", "healthy", "healthy and delicious", "sausage", "turkey", "turkey sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Healthy &amp; Delicious: Broccoli Rabe, Turkey Sausage, and Grapes", "link": "https://www.seriouseats.com/recipes/2010/10/healthy-delicious-broccoli-rabe-turkey-sausage-grapes-recipe.html", "description": "I stumbled over <strong>Mark Bittman</strong>'s Broccoli Rabe with Sausage and Grapes by pure serendipity, while researching beets in <em>How to Cook Everything</em>. The necessary produce was already crowding my crisper drawer, and the oil and seasonings were standing ready in the pantry. Even better, a trip to the freezer revealed two links of sweet Italian turkey sausage, which, when subbed in for their pork equivalents, would lighten the meal considerably.", "totalTime": "20-25 minutes", "recipeYield": "4", "recipeCategory": ["Grapes", "Healthy and Delicious", "Turkey"], "recipeIngredient": ["1 pound broccoli rabe, ends trimmed", "1 pound sweet Italian turkey sausage links", "1 tablespoon extra virgin olive oil, plus more if necessary", "2 large cloves garlic, slivered", "About 1/2 lb seedless red grapes", "Kosher salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium saucepan of salted water to a boil. Cut broccoli rabe in half. Boil until stalks start becoming tender, about 3 minutes. Remove and plunge into ice bath, or drain and soak with cold water to stop the cooking process.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat a 12-inch nonstick pan over medium heat. Prick sausage with fork, add it to pan, and brown well on all sides. When browned, remove sausage from pan and cut into bite-sized pieces. Add olive oil to pan and let it warm for a few seconds before adding sausage back to pan. Cook sausage about 5 minutes, stirring occasionally, until pieces are fully browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze broccoli rabe well to get rid of the excess moisture. Chop into bite-sized pieces. Add to pan with garlic and cook until heated, 3 to 4 minutes, stirring occasionally. Add grapes and cook until fruit is heated through, another 3 to 4 minutes. Salt and pepper to taste. Serve immediately.</p>"}]}