{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101020-duck-fat-potato.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["duck fat", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Extra Crispy Duck Fat-Fried Fingerling Potatoes", "link": "https://www.seriouseats.com/recipes/2010/10/extra-crispy-duck-fat-fried-fingerling-potatoes-recipe.html", "description": "There are three keys to getting extra crunchy fried potatoes: First, you've got to cook them for long enough to allow the gluey starch inside the cells to dissolve and work on the cell walls, gluing them into a thicker, more robust shape. Secondly, you've got to heat their surface in order to dehydrate and crisp them. Finally, you have to maximize the surface area, giving the potatoes more places to crisp up.", "totalTime": "20 minutes", "recipeYield": "4, as a side", "recipeCategory": ["Christmas", "Duck", "Potato", "Sides", "Thanksgiving"], "recipeIngredient": ["1 1/2 pounds fingerling potatoes, scrubbed clean", "Kosher salt", "3 tablespoons duck fat (see note)", "Coarse sea salt, like Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover potatoes with cold water in a saucepan. Add about 2 tablespoons kosher salt to taste. Bring to a boil over high heat. Reduce to a simmer and cook until potatoes are completely tender, about 10 minutes. Drain and allow to cool five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split potatoes in half lengthwise. Heat duck fat in 12-inch non-stick skillet over medium heat until melted. Turn off heat. Add half of potatoes, cut side down. Return to high heat and cook until crisp and golden brown, about 5 minutes. Transfer to paper towel-lined plate. Add remaining potatoes to skillet cut-side down and repeat. Serve immediately, sprinkled with coarse sea salt.</p>"}]}