{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100420babciabread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "polish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Babcia Bread", "link": "https://www.seriouseats.com/recipes/2010/04/bread-baking-babcia-polish-sweet-bread-chleb-drozdzowy-recipe.html", "description": "In trying to re-create my husband's grandmother's recipe, I was working from a version passed along from memory with possible translation errors. But <strong>I knew I got it right when I got an enthusiastic \"Oh, yeah\" from my from my husband.</strong> This is the bread the way he remembered it, and this is what I'm declaring the final version.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch"], "recipeIngredient": ["1 stick butter", "1/2 cup milk", "2  1/2 teaspoons (1 package) yeast", "3 3/4 cups AP flour, divided", "3 eggs", "1 teaspoon salt", "2/3 cup sugar", "1 tablespoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the milk and butter into microwave-safe container and heat to melt the butter. The milk shouldn't boil, it should be just warm enough to melt the butter. Cool (if needed) to lukewarm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the milk mixture into the bowl of your stand mixer, add the yeast and 1 cup of flour, and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and let it sit for 15 minutes. It will rise a bit during this time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add eggs, and beat with the paddle attachment until well combined. Add salt, sugar and vanilla and beat well. Add the remaining 2 3/4 cups of flour, mix with the paddle to combine, then switch to the dough hook and knead well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>During kneading, the dough will begin sticking to the sides of the bowl and building up, until very little is left on the hook. Stop the mixer and scrape it down as this happens. It may take several times before the dough gives up on this sticking. Eventually, the dough will form a ball around the hook, with just a little \"foot\" of dough stuck to the bottom of the bowl, but the sides will remain clean. Keep kneading until the dough is smooth and shiny. It will be a soft dough, but it shouldn't be sticky or goopy at all. If it is sticky, add additional flour as needed, in small increments. It shouldn't need a lot more flour; this dough seems loose while kneading but holds its shape well after you form it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and let the dough rest until doubled in size; it may take 2 hours, or more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle cornmeal on the bottom of a 10-inch loaf pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Knead dough again, shape, and put into a bread pan. You shouldn't need any flour to knead or shape this dough. It's not sticky at all.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let it rise again until doubled in size. Again, It can take a long time to rise. Be patient.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush top with beaten egg yolk mixed with water, if desired, for a shiny top. You can slash the top, or leave it as-is. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 325°F until deeply browned, 45 to 55 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the loaf cool for five minutes before taking it out of the pan to cool completely on a rack before cutting.</p>"}]}