{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100927-huaraches.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["black beans", "cilantro", "corn", "Dinner Tonight", "huaraches", "lime", "masa", "Mexican", "onions", "radishes", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Huaraches with Black Beans and Radish", "link": "https://www.seriouseats.com/recipes/2010/09/huaraches-with-black-beans-and-radish-recipe.html", "description": "<strong>Huaraches are flattened ovals of masa</strong> that get their name from the <a href=\"http://en.wikipedia.org/wiki/Huarache_(shoe)\">Mexican sandal</a>. They are kind of like <a href=\"http://www.seriouseats.com/recipes/2008/06/sopes-recipe.html\">larger sopes without sides</a>, and can be topped with just about anything. The first ones I encountered were straight-off-the-griddle from a cart in <a href=\"http://www.travelbymexico.com/oaxaca/atractivos/index2.php?nom=eoaxparquellano\">Parque El Llano in Oaxaca, Mexico</a>. The tender huaraches were slightly blackened from the griddle, just like my favorite pizzas, and topped with a fiery salsa balanced by tender mushrooms and cream. I've been dreaming of them lately, so I really couldn't pass up this version of the dish from <strong>Rick Bayless</strong>'s newest cookbook.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beans and Pulses", "Corn", "Dinner Tonight", "Lime", "Mexican"], "recipeIngredient": ["1 pound fresh corn masa or 1 3/4 cups dried masa harina for tortillas", "Table salt", "3/4 cup canned cooked black beans, drained ", "1/2 cup vegetable oil ", "1 1/2 cups tomatillo salsa or red chile salsa ", "2/3 cup grated queso anejo or queso fresco ", "2/3 cup white onion, chopped", "1/2 cup cilantro, chopped", "3 to 4 radishes, cut into matchsticks ", "2 limes, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using masa harina, mix with 1 cup plus 2 tablespoons hot tap water and 3/4 teaspoon salt and allow to hydrate for 5 minutes, covered with plastic wrap. If using fresh masa, combine with 3/4 teaspoon salt. Divide mixture into 8 balls. Cover with plastic wrap. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add drained beans to food processor with 2 tablespoons water. Blend until smooth, adding water as needed until texture resembles masa.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat heavy 12-inch cast iron skillet over medium heat. Meanwhile, form one ball masa into an egg shape. Using thumb, make deep, wide hole. Spoon 1 to 2 teaspoons black bean mixture into hole. Pinch the masa up to enclose it and roll into a cigar shape. Place between two sheets of plastic and flatten gently with tortilla press or under heavy skillet until 1/4-inch thick. Carefully peel off top sheet of plastic. Flip the masa onto your fingers and peel the bottom sheet of plastic. Transfer quickly to skillet and cook until small lightly browned in spots, about 1 minute. Flip and cook until cooked through, about 3 minutes. Remove and set aside on plate. Repeat with other balls. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour enough oil into the skillet to generously coat bottom heat over medium-high heat until shimmering. Slide two huaraches into skillet. Cook for 1 1/2 minutes and flip. Coat top side with 1 1/2 tablespoons salsa and sprinkle with 1 tablespoon cheese. Cook one minute longer. Set aside and repeat with the other huaraches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the huaraches with onion, cilantro, and radishes. Serve immediately with lime wedges.</p>"}]}