{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100413octopusandcelery.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["antipasti", "celery", "Cook the Book", "Mario Batali", "Mark Ladner", "Molto Gusto", "octopus", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Octopus and Celery", "link": "https://www.seriouseats.com/recipes/2010/04/cook-the-book-octopus-and-celery.html", "description": "Celery has never been a vegetable that I've had an affinity for&mdash;not crunched on raw or slathered with peanut butter. I've always found it stringy, fibrous, and bitter in a way that was unappealing. But the first few bites of the <strong>sweet celery hearts mixed with tender octopus,</strong> lightly dressed with olive oil and vinegar, opened my eyes to celery's potential. Who would have thought it would take a cephalopod to help me learn to love celery?", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Other Seafood"], "recipeIngredient": ["<ul class=\"skinnyList\"><li>One 3-pound octopus (frozen is fine), sac, beak, and eyes removed (have the fishmonger do this)", "</li><li>1 1/2 cups dry white wine", "</li><li>2 small red onions, thinly sliced", "</li><li>2 carrots, thinly sliced", "</li><li>2 celery ribs, thinly sliced", "</li><li>3 garlic cloves, smashed and peeled", "</li><li>1 bay leaf, preferably fresh", "</li><li>1 sprig each fresh Italian parsley, sage, rosemary, and thyme", "</li><li>1 celery heart with tender leaves, base cut off, fibrous strings removed with a vegetable peeler, and thinly sliced", "</li><li>1/4 cup red wine vinegar", "</li><li>1/4 cup extra virgin olive oil", "</li><li>Maldon or other flaky sea salt</li></ul>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the octopus, wine, onions, carrots, sliced celery ribs, herbs, and a wine cork, if you have one (the cork helps tenderize the octopus), in a large pot, add enough water to cover the octopus, and bring to boil over high heat. Reduce the heat to medium, cover, and simmer gently until the thickest part of the octopus is tender when pierced with a knife, about 1 hour. Remove from the heat and allow to cool in the broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the octopus (discard the vegetables and cork). Cut off the tentacles and strip the skin and suckers from the tentacles (the skin will come off easily once the octo pus is cooked). Cut the head and tentacles into 1-inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the octopus, sliced celery heart, vinegar, and oil in a large bowl, mixing well. Season well with salt and serve, or let stand for 1 hour to bring out the flavors. (<em>The octopus can be refrigerated for up to 3 days; bring to room temperature before serving.</em>)</p>"}]}