{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100906sausagestew.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["duck fat", "dumplings", "hungarian", "juniper", "paprika", "sauerkraut", "sausages", "soups", "Spice Hunting", "spices", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sausage and Sauerkraut Stew with Duck Fat Dumplings", "link": "https://www.seriouseats.com/recipes/2010/09/sausage-sauerkraut-stew-dumplings-juniper-paprikash-recipe.html", "description": "[Photograph: Max Falkowitz] Juniper plays best with gamey meats, but game can be hard to come by. If you don't hunt (or have a friend who does), your options are limited. Ducks, however, are far more widely available and are...", "totalTime": "1 hour", "recipeYield": "6", "recipeCategory": ["Duck", "Soups and Stews"], "recipeIngredient": ["<strong>For the stew</strong>", "About 1/2 cup cold solid cooking fat (duck fat, chicken fat, lard, or shortening), divided", "1 pound spicy sausage (sujuk, kielbasa, or a Hungarian sausage) sliced into 1/2 inch disks", "2 large onions, sliced thin", "1 pound sauerkraut, drained", "8 medium cloves of garlic, minced", "1 quart homemade duck or chicken stock, or low-sodium store-bought stock", "2 teaspoons <a href=\"http://www.seriouseats.com/2010/05/spice-hunting-a-guide-to-paprika.html\">sweet paprika</a>", "2 teaspoons <a href=\"http://www.seriouseats.com/2010/05/spice-hunting-a-guide-to-paprika.html\">half-sharp paprika</a>", "12 <a href=\"http://www.seriouseats.com/2010/09/spice-hunting-juniper-berries-how-to-use.html\">juniper berries</a>, crushed and bundled in cheesecloth or spice infuser", "1 1/2 teaspoons kosher salt", "<strong>For the dumplings</strong>", "1 1/2 cups flour", "1 large egg", "1/3 cup water", "1 teaspoon baking powder", "Sour cream for serving", "1 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the stew:</strong> Heat 1 teaspoon fat in a 5-quart Dutch oven on medium heat until lightly smoking. Add sausages and cook, stirring occasionally, until browned, about 10 minutes. Transfer to paper towel-lined plate to drain (leave excess fat in pan).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions to pot and cook, stirring frequently, until deep brown, about 20 minutes, adding 1 tablespoon of water if onions start to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic and cook, stirring frequently, until fragrant, about 1 minute. Add  sauerkraut, stock, paprikas, and juniper berries. Stir to combine, increase heat to high, and bring to a boil. Reduce to a simmer and cook, uncovered for half an hour. Season to taste with salt. Meanwhile, make the dumplings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the dumplings:</strong> In a medium bowl, whisk together water, egg, 3 tablespoons cold fat, and salt. In separate bowl, whisk together flour and baking powder. Dump flour mixture into wet ingredients and stir with wooden spoon until the shaggy dough forms. Let it rest for 5 minutes. Meanwhile, bring 1 quart water to a boil over high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop rounded teaspoons of dough into boiling water.  After three minutes, retrieve one dumpling and cut it open. If doughy or chalky inside, return to pot for one minute longer. When cooked, drain dumplings on paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons fat to heavy-bottomed 12-inch stainless steel skillet and heat over medium-high heat until shimmering. Swirl to coat bottom of pan. Add drained dumplings and cook until lightly-browned on all sides, turning occasionally, about 4 minutes total. Reheat stew, ladle and serve with dumplings and sour cream.</p>"}]}