{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100910-marketscenepizza-610.jpg", "author": {"@type": "Person", "name": "therealchiffonade"}, "recipeCuisine": "", "keywords": ["balsamic vinegar", "cornmeal", "goat cheese", "onions", "pizza", "pizza dough"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cornmeal, Goat Cheese and Muscadine Pizza", "link": "https://www.seriouseats.com/recipes/2010/09/cornmeal-goat-cheese-and-muscadine-pizza-recipe.html", "description": "Note: Muscadines are a variety of red grape from the Southeastern United States. If unavailable, any red grape variety will do....", "totalTime": "", "recipeYield": "4 as a first course, 8 as an appetizer", "recipeCategory": [], "recipeIngredient": ["2 1/2 teaspoons active dry yeast", "1/8 teaspoon sugar", "1 cup warm water", "1/4 cup extra virgin olive oil", "2 cups (10 ounces) all-purpose flour", "1/3 cup cornmeal", "kosher salt", "1 teaspoon vegetable oil", "1 medium onion, finely sliced (About 1 1/2 cups)", "1/2 teaspoon freshly ground pepper", "1 tablespoon balsamic vinegar ", "1 (11-ounce) package goat cheese", "2 tablespoon honey", "1 pint fresh muscadines, split in half, seeds removed with tip of sharp knife (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine yeast, sugar and water in small bowl and allow to rest 5 minutes.  Pour yeast mixture into bowl of stand mixer fitted with dough hook add olive oil, flour, cornmeal and 1 1/2 teaspoons salt.  Mix at low speed until dough comes together, about 7 minutes.  Transfer to oiled bowl, cover with plastic and allow to rise 2 hours at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in heavy-bottomed 8-inch stainless steel skillet over medium-high heat until shimmering. Add onions and season with salt and pepper.  Cook, stirring frequently, until lightly browned, about 10 minutes. Add vinegar and cook additional 5 minutes until mixture is nearly dry and onions are deep brown. Transfer to small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process goat cheese in food processor until smooth and creamy, scraping down sides of bowl as necessary, about 1 minute total.  Add honey and 1/2 teaspoon salt and season until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350 degrees.  Punch down dough and divide into 4 pieces.  Flatten each piece with fingers and place on single parchment-lined rimmed baking sheet. Poke each piece of dough 20 times with tip of chopstick to dock (don't break through dough).  Bake until dough is golden brown, about 20 minutes. Remove from oven and spread 1/4 of goat cheese mixture on each dough disk, followed by 1/4 of onion mixture.  Bake additional 5 minutes to warm cheese and onions. Apply the muscadines, cut side down, on top of onion.  Return to the oven for 2 minutes to warm muscadines.  Serve immediately.</p>"}]}