{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100402-kerisik.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Asian", "keywords": ["coconut", "kerisik", "rendang", "Seriously Asian", "Seriously Malaysian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "How to Make Kerisik", "link": "https://www.seriouseats.com/recipes/2010/04/how-to-make-kerisik.html", "description": "[Photograph: Chichi Wang] In Malaysian, Singaporean, and Indonesian cookery, kerisik, or grated and pan-toasted fresh coconut, is used to thicken dishes like curry and rendang. Since the coconut slivers are only slightly dehydrated, kerisik soaks up much of its surrounding...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Asian", "Coconut", "Condiments and Sauces"], "recipeIngredient": ["1 coconut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> <strong>Selecting and Breaking Down the Coconut</strong><br />\r\nThe first step is selecting the right kind of coconut: a mature, compact specimen with a beige to dark brown exterior. Younger coconuts have a softer, pudding-like flesh, whereas for our purposes, you'll need a coconut with firmer interior. Select a heavy coconut and shake it about: you should be able to hear the liquid moving inside.</p>\r\n\r\n<p>To crack the coconut open, take either a heavy cleaver or a hammer and a nail, and find one point on the coconut to hack. If you're using a cleaver, use the bottom tip and give the coconut a few heavy thwacks until a fissure forms on the shell. If you're using a hammer and a nail, place the nail in a textured groove somewhere on the shell, and hammer away until the fissure forms.</p>\r\n\r\n<p>Once you've punctured a whole into the coconut, release the inner juices. The coconut water should taste fresh and sweet (feel free to drink it if you like it).</p>\r\n\r\n<p>Separate the meat from the shell with a relatively thin paring knife, making circular motions underneath the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Grating the Coconut</strong><br />\r\nThe best way to grate the coconut is to use a high quality Microplane grater, as you would for cheese. Doing so will give you fine, lacy shreds of coconut meat that are ideal for even toasting. You could also cut the coconut into 1/2-inch chunks and run them through the food processor until they are finer and fluffy, approximately 1 minute. (However, if you've got the gumption to crack open your own coconut, you hardly need a food processor once you've managed to extract all the meat!)<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Toasting the Coconut</strong><br />\r\nPlace the grated coconut meat in a bare (not-oiled) skillet or wok over medium heat. Toast the coconut slowly, stirring around with a spatula to evenly disperse the heat. Continue to toast until the slivers of coconut are golden brown and toasty-smelling. Some slivers may toast more slowly or quickly than other slivers; don't worry as long as the general distribution is golden brown, with perhaps a few darker and white slivers in the mix. The entire process, set over low heat, should take five to ten minutes.</p>\r\n\r\n<p>Transfer the toasted coconut to a bowl and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Grinding or Pounding the Coconut</strong><br />\r\nDepending on your preferred consistency, either place the coconut meat in the food processor and pulse until it resembles sawdust (about one minute) or pound the coconut by hand in a mortar and pestle. For rendangs, I like to leave the coconut shreds lightly pounded so that their unique juiciness and texture are still recognizable once mixed into the dish. Makes several cups of kerisik.</p>"}]}