{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101222MarmaladeEpoissesCanapé.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["canapes", "marmalades", "orange marmalade", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Marmalade): Marmalade and Stinky Cheese Canapés", "link": "https://www.seriouseats.com/recipes/2010/12/the-secret-ingredient-marmalade-marmalade-and.html", "description": "Stinky, pungent, oozing cheese and a pinch of sweet marmalade on crispy, butter bread.  Fromage-ophile heaven.", "totalTime": "10", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "The Secret Ingredient"], "recipeIngredient": ["3 1/2-inch slice of white farmhouse bread, crust removed, and each slice cut into 3 equal rectangles, or 9 1/4- to 1/2-inch slices of baguette", "1 tablespoon clarified butter, plus more as needed (You can buy this as \"ghee\" from some stores.  Flavorless oil is a better substitute than melted butter.)", "4 1/2 teaspoons good quality orange marmalade (recommended: Bonne Maman)", "3 1/2 ounces Epoisses cheese, cut into 9 rectangles (do not cut it until the last minute)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the bread.  Melt the clarified butter in a small sauté pan over medium-high heat.  Fry the bread, 3 pieces at a time, 1 minute one each side, until crisp and golden.  Remove to a plate, and repeat with the remaining bread, adding more butter as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Another less traditional, if more sensible, way to prepare the bread is to preheat the oven to 350&deg;F.  Brush both sides of 9 thin slices of baguette with flavorless oil or melted clarified butter, and arrange in a single layer on a small rimmed baking sheet.  Bake until crisp and golden, about 10 to 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread each toast with 1/2 teaspoon marmalade, and top with 1 rectangle of Epoisses.  Set on a platter, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can also make this as a grilled cheese, but using 2 1/2-inch slices of farmhouse bread per person.  Spread the outside of the bread with room temperature unsalted butter, and the inside with 1 tablespoon orange marmalade.  Spread 2 ounces of Epoisses between the slices, and stick together.  Toast in a skillet on medium-low heat for 2 to 3 minutes per side, until the outside is golden and the inside is absolutely runny.  Repeat for as many sandwiches as you need.</p>"}]}