{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100803-dbcurrie-bread.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread baking", "breads", "cottage cheese", "dill"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Bread Baking: Cottage Cheese Dill Bread", "link": "https://www.seriouseats.com/recipes/2010/08/bread-baking-cottage-cheese-dill-bread-recipe.html", "description": "I was in a cheesy mood, but I didn't want an overtly cheesy bread, so I decided to use <strong>cottage cheese.</strong> By the time it was mixed into the bread and cooked, <strong>it disappeared into the dough, but it made a nice moist and slightly chewy loaf.</strong>", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup whey (or water)", "2 tablespoons sugar", "2 1/4 teaspoons yeast", "3 cups bread flour (more, as needed)", "1/2 cup cottage cheese", "1 teaspoon salt", "1 teaspoon dry dill weed", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the whey (or water) sugar, yeast, and one cup of the bread flour. Set aside until it gets bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the bread flour, cottage cheese, salt and dill. Knead with the bread hook until the dough begins to get elastic. Add the olive oil and continue kneading. The dough should be smooth, elastic, and only slightly sticky. If it is too sticky, add more bread flour, as needed. The amount you need will depend on how wet your cottage cheese was. I needed about a quarter cup more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough is thoroughly kneaded, drizzle some olive oil into a plastic bag and put the dough into the bag, making sure that it's completely coated with the oil and not sticking to the bag. Put the bag of dough in the fridge to rest over night.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, massage the dough in the bag briefly, then let the dough come up to room temperature (or close - it doesn't need to be exact). The dough will rise while it's warming up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some cornmeal on a baking sheet and preheat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has warmed and has risen, flour your work surface, remove the dough from the bag and knead it briefly before forming it into your preferred shape. Move it to the baking sheet and cover it with plastic wrap. Let it rise until doubled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slash the loaf as desired and bake at 350 degrees for 40 minutes until well browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool completely on a rack before slicing.</p>"}]}