{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2010/05/spachcockedroastchicken.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["butterfly", "chicken", "essential", "low carb", "roast chicken", "roasted chicken", "spatchcock"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7727272727273", "ratingCount": "22"}, "name": "Spatchcocked (Butterflied) Roast Chicken With Quick Jus", "link": "https://www.seriouseats.com/recipes/2010/05/butterflied-roasted-chicken-with-quick-jus-recipe.html", "description": "Making a simple but perfect roast chicken is a technique that should be in every home cook's arsenal. But the reality is that perfection is difficult to achieve, especially if you're trying to roast that chicken whole. The problem is that chicken breasts dry out if cooked beyond 150&deg;F (66&deg;C) or so, but legs need to come up to 175&deg;F (80&deg;C). Spatchcocking, or butterflying, is the solution: By flattening out the chicken, you expose its legs to higher heat, helping them cook a little faster than the breasts&mdash;which is exactly what you want for juicy meat. It also yields crisper skin and a much faster cooking time than traditional roasting. In and out of the oven in 45 minutes or less!", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chicken", "Mains", "Roasting", "The Food Lab"], "recipeIngredient": ["1 large chicken, about 4 to 5 pounds (1.8 to 2.3kg)", "2 tablespoons (30ml) light olive oil or other neutral-flavored oil, such as canola or vegetable, divided", "Kosher salt and freshly ground black pepper (see note)", "1 teaspoon (5g) baking powder (optional; see note)", "2 teaspoons (10g) chopped fresh parsley, thyme, rosemary, oregano, marjoram, savory, or a mix (optional)", "1 medium onion, roughly chopped (about 1 cup)", "1 medium carrot, peeled and roughly chopped (about 1/2 cup)", "1 medium rib celery, roughly chopped (about 1/2 cup)", "1 bay leaf", "1 cup (240ml) dry vermouth or sherry", "1 teaspoon (5ml) soy sauce", "3 tablespoons (45g) unsalted butter", "2 teaspoons (10ml) juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place oven rack in upper-middle position and preheat oven to 500&deg;F (260&deg;C). Using sharp kitchen shears, remove spine from chicken and cut spine into 5 to 6 one-inch-long pieces. Set spine aside. Flatten chicken by placing skin side up on a cutting board and applying firm pressure to breastbone. Transfer to a wire rack set in a foil-lined rimmed baking sheet. Position chicken so that breasts are aligned with center of baking sheet and legs are close to edge. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle chicken with 1 tablespoon (15ml) oil. Combine 1 tablespoon (15g) kosher salt, 1/2 teaspoon ground black pepper, and 1 teaspoon (5g) baking powder (if using) in a small bowl. Sprinkle all over chicken. Sprinkle chicken with herbs, if using. Rub chicken to distribute seasoning evenly all over skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast chicken until thickest part of breast close to bone registers 150&deg;F (66&deg;C) on an instant-read thermometer and joint between thighs and body registers at least 175&deg;F (80&deg;C), about 45 minutes, reducing heat to 450&deg;F (232&deg;C) if chicken starts to darken too quickly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat remaining 1 tablespoon (15ml) oil in a small saucepan over high heat until shimmering. Add chicken spine and cook, stirring frequently, until well browned, about 3 minutes. Add onion, carrot, and celery and cook, stirring frequently, until beginning to brown, about 3 minutes. Add bay leaf and deglaze with vermouth or sherry and 1 cup (240ml) water, using a wooden spoon to scrape up any browned bits from bottom of pan. Reduce heat to maintain simmer and cook for 20 minutes. Strain out solids and return liquid to pan. Boil over medium-high heat until approximately 1/3 cup (80ml) remains, about 7 minutes. Whisk in soy sauce, butter, and lemon juice off heat. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken from oven, transfer to cutting board, tent loosely with foil, and allow to rest 5 minutes before carving. Serve with hot <em>jus</em>.</p>"}]}