{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100215canorabroccolirabe.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["broccoli rabe", "Cook the Book", "Marco Canora", "Salt to Taste", "side dishes", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Broccoli Rabe with Chiles and Garlic", "link": "https://www.seriouseats.com/recipes/2010/02/broccoli-rabe-with-chiles-and-garlic-recipe.html", "description": "[Photograph: Caroline Russock] Many people go through life hating certain vegetables just because they haven't eaten them cooked properly. Take brussels sprouts. Up until recently they've been almost a joke vegetable, making otherwise adventurous palates cringe. But most folks have...", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["2 bunches broccoli rabe", "Kosher salt and freshly ground black pepper", "Pinch of minced pepperoncini or red pepper flakes", "1 large garlic clove, peeled and sliced", "3 tablespoons extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the broccoli rabe by cutting off the bottom of each bunch and then separating the leaves from the flower-topped stems.  Snap off and discard the thin stems attached to the leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil over high heat.  Plunge the leaves into the boiling water.  When the water returns to a boil, remove the leaves from the pot with a slotted spoon, cool them in ice water, then drain them well in a colander.  Add the stems to the boiling water and cook until almost tender, about 2 minutes; then take them out of the pot, cool in ice water, and add them to the colander to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the pepperoncini, garlic, and oil in a large skillet and warm over low heat.  When the garlic begins to color, about 2 minutes, add both the broccoli rabe leaves and flower-topped stems to the oil.  Gently warm the rabe in the garlic infused oil just until the stems are tender, about 5 minutes.  Adjust the seasoning with salt and pepper and serve.</p>"}]}