{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100504scallionradishandcucumbersalad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cucumbers", "noodles", "salads", "Simon Hopkinson", "The Vegetarian Option", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Scallion, Radish, and Cucumber Salad with Cashews and Vermicelli", "link": "https://www.seriouseats.com/recipes/2010/05/vegetarian-scallion-radish-and-cucumber-salad-with-cashews-and-vermicelli-recipe.html", "description": "This <strong>Scallion, Radish, and Cucumber Salad with Cashews and Vermicelli</strong> was just right labor- and flavor-wise, but I was concerned it would be too light to pass for an evening meal. I considered adding fish or chicken to serve alongside, but I decided that I'd take the leap and go it alone. It was the epitome of a quick, healthy, and almost vegetarian* meal.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["1/4 pound dried thread vermicelli (or glass noodles)", "2 heaping tablespoons unsalted cashew nuts", "Salt", "A little sunflower oil", "6 radishes, trimmed", "6 scallions, trimmed", "1 cucumber, 7 inches long", "Generous handful each of cilantro and mint leaves", "1 or 2 large red chilis, sliced", "<strong>For the dressing</strong>", "1 tablespoon Ginger Syrup (recipe follows)", "1 tablespoon Sesame Paste (recipe follows)", "Juice of 2 limes", "1 tablespoon Asian fish sauce or light soy sauce", "1 tablespoon sesame oil", "<strong>To garnish</strong>", "2 teaspoons toasted sesame seeds", "2/3 cup sesame seeds", "3 tablespoons finely grated ginger (juice saved!)", "1 large garlic clove, peeled", "2 tablespoons light soy sauce", "4 tablespoons mirin (Japanese cooking wine)", "1 to 2 tablespoons chili oil", "1/3 to 1/2 cup sesame oil, plus a little extra to serve", "2 tablespoons lemon juice", "1/2 cup warm water", "1 to 2 tablespoons sugar, to taste", "2 cups (scant) granulated sugar", "1 1/2 cups water", "Finely pared zest of 1 lemon (use a potato peeler)", "1 1/2 cups peeled and coarsely grated fresh ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Snap the vermicelli into shorter lengths, one-third of the original, folded skein.  Soak in cold water for about 30 minutes, or until well softened.  Drain and return to the bowl.  Now cover with boiling water, and fork and lift the noodles around for a few minutes until they have become silky, soft, and tender (eat one).  Drain, rinse in cold water, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, gently toast the cashews with a little salt and in a little oil until golden all over.  Cool, and then crush each cashew lightly with the back of a knife.  Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the radishes into quarters or rounds, the scallions into diagonal shreds, and the cucumber into thin matchsticks.  Tip the prepared vegetables into a large bowl and add the vermicelli.  Tear the cilantro and mint leaves into smaller pieces and add to the salad with the chili.  Mix together with your hands to distribute everything evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now whisk the dressing ingredients together in a small bowl.  Add to the salad and mix together once more with two forks, lifting and dropping the salad so that all is evenly dressed.  Pile into a shallow serving dish and sprinkle the crushed cashews and sesame seeds over.  Best eaten pleasantly chilled, with warm sake or ice-cold beer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Sesame Paste</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 1 3/4 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly toast the sesame seeds in a dry pan over medium heat until fragrant, and cool slightly.  Tip into a small food processor and add all of the other ingredients.  Grind and pulse until you have a paste that is fully emulsified and super-smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into two small, lidded containers, smooth the surface, and trickle over a little extra sesame oil, to preserve the surface.  Put in the refrigerator, where the paste will keep happily for anything up to 1 month.  Or you could freeze one of them, if you like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Ginger Syrup</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve the sugar in a the water in a pan over medium heat, then bring to a boil and cook for 2 minutes.  Immediately add the lemon zest and ginger and stir together.  Bring back to a boil for a few seconds then pour into a bowl.  Cover and leave to infuse overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The following day, add 2 tablespoons of water and warm through until liquid and pourable.  Strain through a sieve and press on the solids with the back of a ladle to extract all the ginger and lemon flavors.  Pour the syrup into a screw-top jar and store in the refrigerator until needed, where it will keep for several weeks.</p>"}]}