{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100920endivesappliesandgrapes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apples", "Around My French Table", "Cook the Book", "Dorie Greenspan", "endives", "grapes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Endives, Apples, and Grapes", "link": "https://www.seriouseats.com/recipes/2010/09/cook-the-book-endives-apples-and-grapes.html", "description": "According to <a href=\"http://doriegreenspan.com/about.html\">Dorie Greenspan</a> author of <strong><em><a href=\"http://www.amazon.com/Around-My-French-Table-Recipes/dp/0618875530/serieats-20\">Around My French Table</a></em></strong> if you have never been a fan of endives it's because you have never tried this recipe for pan roasted <strong>Endives, Apples, and Grapes</strong>.  Adapted from <a href=\"http://en.wikipedia.org/wiki/Alain_Passard\">Alain Passard</a>, a French chef with an undeniable passion for vegetables, this combination of sweet, bitter, and herbaceous notes lend a complexity of flavor that belies the simplicity of the cooking process.", "totalTime": "", "recipeYield": "4 as a starter, or 2 as a main course", "recipeCategory": ["Apple", "Cook the Book", "Grapes", "Vegetarian"], "recipeIngredient": ["2 plump endives", "1 tart-sweet apple, such as Fuji or Gala", "1 1/2 tablespoons salted butter (if you can find butter with sea salt crystals, use it)", "4 small clusters white or green grapes (in France, I like to use Muscat grapes)", "4 small sprigs rosemary", "Salt, preferably fleur de sel, and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the endives lengthwise in half.  Cut the apple into quarters and remove the core.  Peel off a thin strip of skin down the center of each quarter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a large skillet (nonstick is best) over low heat and toss in the butter.  When it's melted, put the endive into the pan cut side down and the apples skin side up.  Add the grapes, scatter over the rosemary, and cook, undisturbed for 20 minutes, at which point the underside of the endives will have caramelized and the apples and grapes will be soft and perhaps browned.  Gently turn everything over, baste with any liquid in the pan, and cook for 20 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the ingredients to a warm serving platter or to individual plates and, using a sturdy wooden spoon or silicone spoon, scrape up the cooking sugars sticking to the bottom of the pan.  You might want to pour a few spoonsfuls of water into the pan to help you nab the sugars and make a spare amount of sauce.  Season the endive with salt and pepper, spoon over the <em>jus</em>, and serve.</p>"}]}