{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/dressed%20up%20white%208.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "sweet potato bread", "sweet potato flour", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Bread Baking: Sweet Potato Bread", "link": "https://www.seriouseats.com/recipes/2010/08/bread-baking-sweet-potato-bread.html", "description": "When I go to a grocery store, after I've found the things I came for, I always scout around for interesting new ingredients. When a new ingredient is something I can use in bread, I silently \"squeee\" a little bit before I toss my prize into my cart. My latest find was at the same time exotic and familiar. <strong>Sweet potato flour.</strong> <em>Squeeeee!</em>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Sweet Potatoes and Yams", "Vegetarian"], "recipeIngredient": ["1 1/4 cups lukewarm water", "2 1/2 teaspoons active dry yeast", "1 tablespoon sugar", "3/4 cup sweet potato flour", "2 cups bread flour", "1 teaspoon salt", "2 tablespoons softened butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine water, yeast, and sugar, and set aside until it becomes frothy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sweet potato flour and bread flour and knead until the dough cleans the sides of the bowl and becomes smooth and elastic. It will still be a little bit sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt and butter and continue kneading until the the butter is completely incorporated. It may still be a little sticky, but don't worry about that. The elasticity is the important thing to look for.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a rough ball, drizzle with a bit of olive oil to coat, and put it back into the bowl (or a clean one if you prefer). Cover the bowl with plastic wrap and set aside to rise until doubled, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, punch it down, form it into a ball again, and cover the bowl with plastic wrap. Set it aside to rise until doubled again, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and sprinkle a baking sheet with some cornmeal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When dough has doubled, lightly flour your work surface and knead the dough briefly, then form it into your preferred shape. Put it on your prepared baking sheet (or you could use a loaf pan, if you prefer), cover it with plastic wrap, and let it rise until doubled, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slash the dough as desired. I used the same scissors-snip method that I used for my Dressed-Up White Bread, in a different pattern. A plain slash across the top would be just fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 350 degrees for 40-50 minutes until browned. Cool completely on a rack before cutting.</p>"}]}