{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101112_sweetsourribs.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Dinner Tonight", "mains", "pork", "rib", "ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Dinner Tonight: Sweet and Sour Spare Ribs", "link": "https://www.seriouseats.com/recipes/2010/11/dinner-tonight-sweet-and-sour-spare-ribs-recipe.html", "description": "I'm so entrenched into the smoky world of barbecue that I sometimes feel like the only respectable and correct way to cook spare ribs is low and slow on a pit. Trust me&mdash;when you've tasted the saucy specimens of <a href=\"http://www.cozycornerbbq.com/\">Cozy Corner</a> you might agree that I'm on to something. But while those are undeniably tasty, this theory isn't exactly practical for a weeknight meal. Luckily, other cuisines disagree with me and have developed artful ways of cooking ribs quickly that come out just as delicious.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chinese", "Dinner Tonight", "Mains", "Pork"], "recipeIngredient": ["1 slab (about 1 1/2 pounds) pork spare ribs", "2-inch section ginger, peeled and sliced into 1/2-inch coins", "6 green onions, chopped into 2-inch sections", "1 tablespoon Chinese rice wine", "Salt", "2 tablespoons canola oil ", "2 tablespoons dark soy sauce", "4 tablespoons white sugar", "1 1/2 tablespoons Chinese black vinegar ", "1 teaspoon sesame oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the ribs between the bones using a sharp chefs knife or cleaver. Using a cleaver, carefully chop these into 2-inch segments (or ask butcher to do it for you).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rib segments into medium-sized sauce pot. Cover with water. Bring to boil over high heat. Skim any scum that comes to surface with spoon. Once boiling, reduce heat to medium-low and simmer. Add Chinese rice wine, pinch of salt, and half of the ginger and green onions. Cook for 15 minutes, skimming occasionally. Reserve 1 cup of cooking liquid, then strain ribs in a colander and discard ginger and green onions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour oil into large wok set over high heat. When oil begins to smoke, add remaining ginger and green onions. Cook for 30 seconds, stirring constantly with a wooden spoon, until fragrant. Add ribs. Cook for two minutes until they begin to brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reserved cooking liquid, soy sauce, sugar, black vinegar, and sesame oil. Simmer vigorously until reduced to glaze, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve ribs with white rice.   </p>"}]}