{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/almond%20rolls%20rolled%20out.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["almond", "baking", "bread", "bread baking", "rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Bread Baking: Almond Rolls", "link": "https://www.seriouseats.com/recipes/2010/08/bread-baking-almond-rolls-recipe.html", "description": "<strong>These rolls have a layered dough, sort of like croissants, but they're as easy as pie crust.</strong> Or, if you think pie crust is difficult, disregard that last sentence. They're pretty easy, considering the result. Almond filling can be found at most supermarkets.", "totalTime": "", "recipeYield": "16", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch", "Desserts", "Nuts"], "recipeIngredient": ["1 cup cool water", "2 1/2 teaspoons instant yeast", "1/3 cup sugar", "1/3 cup sour cream", "3 cups bread flour", "1 teaspoon kosher salt", "1 stick (1/2 cup) cold butter", "1 can (12.5 ounces) almond filling", "1 egg, beaten with a little water for an eggwash"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, mix water, yeast, sugar and sour cream. Whisk to dissolve the sugar and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour and salt in the bowl of your food processor. Cut the butter into about a dozen chunky pieces, and drop the into the bowl of the food processor. Pulse the food processor a few times, as you would for a pie dough. You're looking for pieces about the size of a chickpea. Some larger chunks are fine, and it's also fine if some are smaller. It's not an exact process.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the flour mixture to the bowl with the wet ingredients. With a rubber spatula, fold the mixture gently, just to moisten all the flour, trying not to break or mash the butter chunks any more than necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, generously flour your work surface and turn the dough out. You'll probably need to use more flour as you roll out the dough, so keep it handy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the dough into a rough rectangle, then roll it out to about 12 x 16 inches. You don't have to be exact. Rough dimensions are fine. The butter will be chunky and clumpy in the dough. That's fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the dough in thirds, as you'd fold a letter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough again to the roughly the same size as before, and fold in thirds again. You don't need to measure, just eyeball that you're rolling to about that size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly, so the the butter doesn't soften too much or begin to melt, do the roll-and-fold twice more, then fold the dough in half, wrap it in plastic wrap, and toss it into the refrigerator. It should rest there for at least an hour, but you can leave it until the next day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees and line a baking sheet with parchment paper. Take the dough out of the refrigerator, cut it into two pieces, and return half to the refrigerator while you work on the other half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flatten the piece of dough a bit, then cut it into eight roughly equal pieces. Roll the first piece to about 3 x 6 inches. Take about a tablespoon of the almond paste and spread it on the lower part of the dough, and then spread it about halfway up, leaving most of it at the end. Roll the dough up and place it, seam-side down, on the prepared sheet pan. Leave plenty of room between the rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all eight rolls are finished, cover the pan with plastic wrap and set aside for 30 minutes. You can continue rolling the next eight or save the dough for the next day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 30 minutes, the rolls won't have risen much, but they will feel puffy. Brush the rolls with the eggwash and bake at 400 degrees until they are nicely browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let them cool (at least a little bit) before eating - or risk burning yourself on the hot filling.</p>"}]}