{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100211upineclairhow.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "desserts", "eclairs", "Movie Awards Season Recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Up in Eclair", "link": "https://www.seriouseats.com/recipes/2010/02/oscars-recipes-movies-up-in-the-air-eclairs.html", "description": "Oh, George. Clearly, you don't know that so many voids can be filled with delicious eclairs, and so I'd like to present a sweet cinematic pairing: <strong>Up in Eclair</strong>. In deference to the film, the pastry is light as air and shaped like the planes which permeate the plotline. The <strong>lemon filling is sweet with a tinge of sour</strong> as a nod to the bittersweet story, and for your eating pleasure, the icing on top brings it all home for a sweet ending.", "totalTime": "", "recipeYield": "about 10 airplane eclairs", "recipeCategory": ["Cakespy"], "recipeIngredient": ["<strong>For the pastry shells:</strong>", "1 cup water", "1/2 cup butter", "1/4 teaspoon salt", "1 cup all-purpose flour", "4 eggs", "&nbsp", "<strong>For the filling:</strong>", "About 1 cup lemon curd or lemon pie filling (a heaping spoonful or to taste per pastry)", "&nbsp", "<strong>For the icing:</strong>", "1 cup confectioners' sugar, sifted", "heavy cream, to thin (you could use milk...but I like cream)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the shells: in a medium saucepan bring 1 cup water to a boil, stir in 1/2 cup butter and salt. Stir until melted. Add flour all at once and stir vigorously until mixture forms a ball. Remove from heat and beat in eggs, one at a time, until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using floured hands, form the dough into heaping tablespoonfuls (you should have 10 or so balls). Should you be inclined to shape them like airplanes, follow the next step; you could also just drop by tablespoons onto baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form airplanes: use 3/4 of the dough in each ball to form a cylinder, and then use the rest of the remaining dough from the ball to form little wings and tail fins for the plane. It's easiest to adhere the wings and fins to the plane base on the baking sheet; you can then press them into the body of the plane to ensure that they won't come apart while baking. If you'd like to make some clouds to go with your planes, simply flatten the dough lightly, and pinch in the dough irregularly around the circumfrence to form the puffs like on a cloud.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake 15 minutes in the preheated oven, then reduce heat to 375&deg;F and bake until golden, 10 to 15 minutes. Cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20100211fillingeclairs.jpg\" src=\"https://www.seriouseats.com/recipes/images/20100211fillingeclairs.jpg\" width=\"500\" height=\"375\" class=\"mt-image-none\" style=\"\" /></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cool, cut a small slit in the side of each pastry and carefully spoon the filling in (you could pipe it in with a pastry bag, but I found that spooning it in was quicker and required less cleanup). If you find that your pastry shells are too delicate, you can slice them gently in half and put the filling in sandwich style too. It is a little messier to eat but no less delicious.</p>"}]}