{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101105_cubesteak.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Alton Brown", "beef", "Dinner Tonight", "dutch oven", "mushroom", "steak", "Worcestershire sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Cube Steak à la Salisbury", "link": "https://www.seriouseats.com/recipes/2010/11/cube-steak-a-la-salisbury-recipe.html", "description": "This Alton Brown recipe takes the flavorings from Salisbury steak, but swaps the ground beef for the cube steak. Now, I doubt cube steak in any form would impress those who weren't fortunate enough to have it as a child. As for me, this is straight-up nostalgia on a plate&mdash;no A1 necessary.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Beef", "Dinner Tonight", "Mushrooms"], "recipeIngredient": ["4 cube steaks (1/4 pound each), usually top round ", "1/2 cup all-purpose flour ", "1 teaspoon salt ", "1/2 teaspoon freshly ground black pepper", "3 tablespoons butter", "2 tablespoons canola oil ", "1/2 medium onion, thinly sliced", "2 garlic cloves, minced", "1/2 pound button mushrooms, stems discarded, and thinly sliced", "3/4 cup red wine ", "1 tablespoon Worcestershire sauce", "1/2 tablespoon Dijon mustard", "3/4 cup beef stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat to 250&deg;F. Meanwhile, pour flour, salt, and black pepper onto large plate and mix well. Dredge each cube steak in flour mixture, shaking off excess. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one tablespoon each of oil and butter to Dutch oven. Turn heat to medium high. When oil is shimmering, add two cube steaks. Cook for about four minutes on each side, or until browned. Remove cube steaks and set aside on a plate. Repeat process with remaining two cube steaks, adding more oil and butter if necessary.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pour out any grease left in dutch oven, then add remaining butter and oil. Turn heat to medium-high, and when oil shimmers, add onion, garlic, and mushrooms. Cook, stirring frequently, until onion is caramelized, about three minutes. Add wine. Using wooden spatula, scrap up any browned bits from bottom of pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add Worcestershire sauce, mustard, and stock. Stir well, then add cube steak, nestling them into sauce as much as possible. Cover dutch oven and place on lower-middle rack of oven. Cook until very tender, about 25 minutes. Serve with mashed potatoes. </p>"}]}