{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/22100326-taralli-primary.jpg", "author": {"@type": "Person", "name": "Jenny McCoy"}, "recipeCuisine": "Italian", "keywords": ["baking", "Cookies", "crackers", "Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Two Types of Taralli, the Italian Cookie-Cracker", "link": "https://www.seriouseats.com/recipes/2010/03/taralli-italian-cookie-cracker-recipe.html", "description": "On Wednesday evening, I had the opportunity to attend an Italian Easter baking class with <strong><a href=\"http://www.nickmalgieri.com/\">Nick Malgieri</a></strong>, a master Italian pastry chef extraordinaire. Here are a couple of my favorite recipes from the class for <strong><a href=\"http://en.wikipedia.org/wiki/Taralli\">Taralli</a>,</strong> a traditional cookie baked at Easter.  One is sweet, the other is savory&mdash;both are quite delicious.", "totalTime": null, "recipeYield": "16 large cookies", "recipeCategory": ["Desserts", "Easter", "Italian"], "recipeIngredient": ["3/4 cup warm water, about 110°F", "2.5 teaspoons (1 envelope) active dry yeast", "1/4 cup olive oil", "3 cups all-purpose flour (spoon flour into dry-measure cup and level off)", "2 teaspoons salt", "1 tablespoon fennel seeds", "1 teaspoon coarsely ground black pepper", "2 large rectangular cooling racks, turned upside down and lightly oiled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F and set racks in upper and lower thirds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the dough, combine the flour and baking powder, stirring well to mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the eggs in a bowl, then whisk in all the remaining ingredients in order.  Fold in the flour mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out on to a floured surface and knead lightly to mix. Separate into 16 equal pieces. Roll each to an 8-inch rope, then into a circle. Pinch the ends together to seal. Place eight on each pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the taralli about 30 to 40 minutes, or until well puffed and a deep golden. Cool on racks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the icing, combine all ingredients in a saucepan and heat gently until lukewarm. Brush over the tops of the cooled cookies. Immediately top with multi-colored sprinkles, before the icing sets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Taralli Napoletani: Neapolitan Salty Ring Cookies</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 30 small cookies -</em> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the dough, pour the water into a bowl and whisk in the yeast. Whisk in the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the remaining ingredients in the bowl of a food processor fitted with the steel blade. Pulse several times to mix. Add the liquid and pulse again until the dough forms a ball. Let the processor run continuously for about 10 seconds to knead the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert the dough to an oiled bowl and carefully remove the blade. Turn the dough over so that the top is oiled and cover the bowl with plastic wrap. Let the dough rise at room temperature until in doubles in bulk, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the dough has risen, scrape it out of the bowl to a lightly floured work surface and use a bench scraper or knife to cut it into two equal pieces. Roll each piece of dough under the palms of your hand to a 15\" length and cut each into 1\" pieces to make 30 equal pieces in all</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One at a time, roll each piece of dough under the palms of your hands to make an 8\" strand. Join the ends together to make a circle, pressing firmly to seal. Line up the formed taralli on a lightly floured work surface or floured baking sheets, making sure they do not touch each other.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the oven racks in the upper and lower thirds of the oven and preheat to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot (such as the one in which you would cook pasta) 3/4 full with water. Bring the water to a full rolling boil. Set one of the cooling racks on the stovetop (put a pan under it to catch drips) next to the pan of boiling water. Drop the taralli, 6 or 8 at a time into the boiling water and remove them with a skimmer as soon as they float to the surface. Arrange them about an inch apart in all directions, on the prepared racks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the taralli about 30 minutes, rotating from the upper third of the oven to the lower third, and vice versa, midway through the baking. Continue baking the taralli until they are golden and crisp. Remove from the oven and cool to room temperature on the cooling racks in which they were baked.</p>"}]}