{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100518chopped%20salad_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "salad greens"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Spring Turnip Salad", "link": "https://www.seriouseats.com/recipes/2010/05/eat-for-eight-bucks-spring-turnip-chopped-salad-recipe.html", "description": "After a winter of contemplating overpriced supermarket turnips that looked like softballs with troubled pasts, last week at the farmers' market I saw a bunch of <strong>lovely young turnips with tender greens still attached.</strong> I knew they deserved a fate more interesting than roasting with other see-you-through-the-winter staples.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Eat for Eight Bucks", "Mains", "Salads"], "recipeIngredient": ["1 fresh, young bunch of turnips, stems discarded, greens well washed and sliced into thin ribbons (1/3 inch or less), roots trimmed, peeled, and cut into 3/4 inch chunks", "3 tablespoons apple cider vinegar", "Olive oil", "Salt", "1 tablespoon honey", "Juice of 1 lime", "1/4 cup plain yogurt or buttermilk", "1/3 cup chopped fresh herbs, such as parsley, cilantro, and chives", "1 cup cooked white beans", "3 hard cooked eggs, peeled and sliced", "4 strips bacon, cooked and chopped or crumbled", "3 pieces of cornbread (your favorite recipe), cut into small cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least a few hours in advance, toss the raw turnip greens with 2 tablespoons apple cider vinegar, 2 tablespoons olive oil, and a big pinch of salt. Cover and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the turnip roots in a medium saucepan with an inch of water, a pinch of salt, and a splash of olive oil. Cover, bring to a boil, and boil hard, covered, until turning tender, about 5 minutes. Then remove the lid and continue to boil until tender enough to eat, a minute or two more. Drain if necessary and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve 1/2 teaspoon salt and 1 tablespoon honey in 1 tablespoon apple cider vinegar and the lime juice. Whisk in 2 tablespoons olive oil. Stir in 1/4 cup plain yogurt or buttermilk and the chopped herbs. Taste and add salt, vinegar, or oil if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dress the beans with 2 tablespoons of the yogurt dressing. Spread some greens on each plate and top with egg, beans, bacon, steamed turnips, and cornbread. Serve extra yogurt dressing on the side.</p>"}]}