{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/panzanella2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["bread", "Italian", "panzanella", "parsley", "salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Panzanella Salad", "link": "https://www.seriouseats.com/recipes/2010/10/grilled-panzanella-salad-recipe.html", "description": "Note: Use extremely ripe tomatoes, preferably ones that are beginning to split open. Salad is best eaten within one hour of composing....", "totalTime": "30 minutes", "recipeYield": "4-6", "recipeCategory": ["Italian", "Salads"], "recipeIngredient": ["2 large very ripe tomatoes (see note), cut into 1-inch chunks", "Kosher salt", "1 medium zucchini, split in half lengthwise", "2 bell peppers, split in half", "1 red onions, cut into 3/4-inch slices, each slice held together with 2 wooden skewers", "1 (1-pound) loaf day-old Italian bread, sliced into 1-inch thick slices", "1/2 cup extra-virgin olive oil, divided", "Freshly ground black pepper", "2 tablespoons balsamic vinegar", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss tomato slices with 1/2 teaspoon salt in large bowl. Set aside at room temperature. Brush zucchini, peppers, red onion, and bread slices with 1/4 cup olive oil and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ignite 1/2 chimney (2 1/2 quarts) of coals. When coals are mostly covered in gray ash, spread evenly over coal grate. Put cooking grate in place, cover, and preheat for 5 minutes. Scrape grill clean. Place zucchini, peppers, and onions on grate. Cover and cook until first side is lightly charred, about 4 minutes. Flip, cover, and cook until charred on second side and vegetables are tender, about 4 minutes longer (depending on size of vegetables, some may take longer or shorter to cook. Remove from grill as they become tender). Transfer to cutting board and tent loosely with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, grill bread until golden brown on both sides. Transfer to cutting board with vegetables cut bread and vegetables into rough 1-inch cubes and transfer to bowl with tomatoes. Add remaining olive oil, vinegar, and parsley. Toss to combine, and season to taste with salt and pepper. Serve immediately.</p>"}]}