{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100427grahamcrackerstack.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "crackers", "graham crackers", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Peanut Butter Graham Crackers", "link": "https://www.seriouseats.com/recipes/2010/04/bread-baking-peanut-butter-graham-crackers-recipes.html", "description": "While today's graham crackers aren't the same as ones promoted by 19th century diet reformer Sylvester Graham, they're still a relatively healthy option, with lots of fiber from the whole wheat. But that's not why I eat them. As far as I'm concerned, graham crackers are the perfect vehicle for peanut butter. The majority of graham crackers around here disappear under a smear of the stuff. To me, that's the perfect quick and satisfying snack. But why stop at putting peanut butter onto the graham crackers? <strong>Why not put some <em>in the crackers</em> as well?</strong>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Nuts"], "recipeIngredient": ["1/2 cup (1 stick) unsalted butter", "1/2 cup brown sugar, packed", "1/4 cup maple syrup", "1 teaspoon baking powder", "1 teaspoon kosher salt", "2 teaspoons vanilla", "1/4 cup peanut butter", "3 1/4 cups (14.25 oz.) whole wheat flour", "1/2 cup water", "Additional flour, for rolling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, cream the butter, sugar and maple syrup with the paddle attachment until the mixture is light. Scrape down the bowl as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt, baking soda, vanilla, and peanut butter and beat well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour in thirds, alternating with the water, beginning and ending with the flour. Beat until well combined and it can form a cohesive ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the bowl, wrap it in plastic (or put it in a plastic bag) and let it rest in the fridge overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready to bake, preheat the oven to 325 degrees. Line three cookie sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 3 pieces. On a lightly floured surface, roll the first piece to a rectangle of about 10x12 inches, then move the dough to the first  parchment-lined cookie sheet..</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a pastry cutter (for a zigzag edge) or a pizza wheel or knife, trim the edges of the dough so that it's straight and square. Cut it lengthwise so you've got two 5x12 pieces, and then make three cuts in the other direction, so you've got 8 pieces that are about 3x5 inches. If you want to be precise, measure. If you like the homemade look, just eyeball the cuts. There's no need to separate the pieces, you'll break them apart later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want graham crackers that can be easily cracked into smaller pieces, score the pieces, but don't cut all the way through. Last, use a fork to poke holes in each piece. A decorative pattern is nice, or just poke a few holes. Repeat the rolling and cutting with the other pieces of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for about 25 minutes, or until the crackers begin to brown just a little. Let them cool on the cookie sheet before breaking off the ragged edges you trimmed (these are a treat for the baker) and then break them into crackers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The crackers will be soft when you take them out of the oven, but they should harden to a crackery crispness as they cool. If they don't harden, you can pop them back into the oven for a few more minutes of baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let them cool and dry out completely before storing them in any sort of closed bag or container. If they're completely dry and crispy, they'll store well for a long time, just like any cracker.</p>"}]}