{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100907turkeyhash.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "inexpensive", "turkey hash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Texas Turkey Hash", "link": "https://www.seriouseats.com/recipes/2010/09/eat-for-eight-bucks-texas-turkey-hash.html", "description": "The original is made with ground beef and white rice; I used turkey and millet and was very happy with the results. The cilantro, also my addition, is nice but not necessary; add it only if you have it around. I make my own chili powder; you may use any store-bought or homemade powder you like (just watch the salt if it's store-bought) or make up your own spice blend of cumin, oregano, and a dot of cayenne.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Eat for Eight Bucks", "Turkey"], "recipeIngredient": ["Shopping list: onions, $0.50; green bell pepper, $1.00; ground turkey, $3.81; 28 oz. tomatoes, $1.91; 2 ounces cheese, $0.40.", "Pantry items: olive oil, garlic, chili powder, salt, pepper, millet or rice.", "Total cost (for 4-6 portions): $7.62", "1 tablespoon olive oil", "2 medium yellow onions, sliced thin from pole to pole", "1 medium green bell pepper, diced medium", "1 tablespoon finely chopped garlic", "1 tablespoon chili powder", "1 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "1/2 cup uncooked millet or white rice", "1 pound ground turkey", "1 (28-ounce) can diced tomatoes", "1/4 cup chopped cilantro", "2 ounces (about 3/4 cup) coarsely grated cheese--Monterey jack, pepper jack, cheddar, or a combination", "Sour cream or plain yogurt to serve (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350. Heat olive oil in heavy-bottomed 12-inch skillet over medium heat until shimmer. Add onions and peppers to skillet and cook, stirring occasionally, until vegetables are soft but not yet brow, about 10 minutes. Stir in the garlic and cook until fragrant, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chili powder, salt, freshly ground pepper, and millet (or rice) and cook, stirring frequently, until lightly toasted, about 2 minutes. Add ground turkey and break up with wooden spoon. Cook, stirring frequently, until crumbly and no longer pink, about 5 minutes. Remove from heat and add tomatoes and their liquid along with cilantro.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour mixture into greased 9x13 baking dish and top with the grated cheese. Cover with aluminum foil and bake 30 minutes; remove foil and bake 15 minutes longer. Serve hot with extra chopped cilantro and sour cream or yogurt.</p>"}]}