{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100802gelatodecrema.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Danilo Zecchin", "F.W. Pearce", "gelato", "The Ciao Bella Book of Gelato and Sorbetto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Cook the Book: Gelato de Crema", "link": "https://www.seriouseats.com/recipes/2010/08/gelato-de-crema-ciao-bella-recipe.html", "description": "This <strong>Gelato de Crema</strong> acts as a base for many of the gelato recipes in <em>The Ciao Bella Book of Gelato and Sorbetto</em>, but frozen on its own, this is a wonderful introduction into the subtle differences between ice cream and gelato.  Without the buttery richness of a base made entirely of cream, <strong>this custard allows the delicate flavors of milk, egg yolks, and sugar to come through.</strong>  The sugar is kept to a minimum, giving the gelato a clean, austere sharp flavor with none of the cloying qualities of an overly sugared scoop of vanilla.", "totalTime": null, "recipeYield": "1 quart of gelato", "recipeCategory": ["Bake the Book", "Cook the Book", "Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["2 cups whole milk", "1 cup heavy cream", "4 large egg yolks", "2/3 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottom saucepan, combine the milk and cream.  Place over medium-low heat and cook, stirring occasionally so a skin doesn't form, until tiny bubbles start to form around the edges and the mixture reaches a temperature of 170&deg;F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a heat-proof bowl, whisk the egg yolks until smooth.  Gradually mix in the sugar until it is incorporated and the mixture is thick and pale yellow.  Temper the eggs by very slowly pouring in the hot milk mixture while whisking continuously.  Return the custard to the saucepan and place over low heat.  Cook, stirring frequently with a wooden spoon, until the custard is thick enough to coat the back of a spoon and it reaches a temperature of 185&deg;F.  Do not bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture through a fine-mesh strainer into a clean bowl and let cool to room temperature, stirring every 5 minutes or so.  To cool the custard quickly, make an ice bath by filling a large bowl with ice and water and placing the bowl with the custard in it; stir the custard until cooled.  Once completely cooled, cover and refrigerate until very cold, at least 4 hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into the container of an ice cream machine and churn it according to the manufacturer's instructions.  Transfer to an airtight container and freeze for at least 2 hours before serving. </p>"}]}