{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101117-stuffing.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["dressing", "essential", "sage", "sausage", "stuffing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "24"}, "name": "Classic Sage and Sausage Stuffing (Dressing)", "link": "https://www.seriouseats.com/recipes/2010/11/classic-sage-and-sausage-stuffing-or-dressing-recipe.html", "description": "Our traditional sausage and sage Thanksgiving stuffing owes its perfect texture to oven-dried bread, which soaks up a rich base of eggs, broth, and butter.", "totalTime": "2 1/2 hours", "recipeYield": "Serves 10 to 14", "recipeCategory": ["Baking", "Christmas", "Fall", "Pork", "Sides", "Thanksgiving", "The Food Lab", "Winter"], "recipeIngredient": ["2 1/2 pounds (1.25kg) high-quality sandwich bread or soft Italian or French bread (about 2 loaves), cut into 3/4-inch dice (about 5 quarts)", "8 tablespoons butter (1 stick; 4 ounces; 115g)", "1 1/2 pounds (680g) sage sausage, removed from casing", "1 large onion, finely chopped (about 12 ounces; 350g)", "4 large ribs celery, finely chopped (about 12 ounces; 350g)", "2 cloves garlic, minced or grated on a <dorado id=\"microplane-graterzester\" class=\"text\">Microplane grater</dorado>", "1/4 cup minced fresh sage leaves (or 2 teaspoons dried sage leaves)", "Kosher salt and freshly ground black pepper, if needed (see note)", "1 quart low-sodium <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken or <a href=\"https://www.seriouseats.com/recipes/2016/11/brown-turkey-stock-recipe.html\">turkey stock</a> (4 cups; 1L), divided", "3 whole eggs", "1/4 cup minced parsley leaves, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower-middle and upper-middle positions. Preheat oven to 275&deg;F (135&deg;C). Spread bread evenly over 2 rimmed baking sheets. Stagger trays on oven racks and bake until completely dried, about 50 minutes total, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool. Increase oven heat to 350&deg;F (180&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, melt butter over medium-high heat until foaming subsides (do not allow butter to brown), about 2 minutes. Add sausage and mash with a stiff whisk or potato masher to break up into fine pieces (largest pieces should be no bigger than 1/4 inch). Cook, stirring frequently, until only a few bits of pink remain, about 8 minutes. Add onion, celery, garlic, and sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk remaining chicken stock, eggs, and 3 tablespoons parsley in a medium bowl until homogeneous. Stirring constantly with a wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes and fold gently until evenly mixed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use part of stuffing to stuff turkey, if desired (see note). To cook remaining stuffing, transfer to a buttered 9- by 13-inch rectangular baking dish (or 10- by 14-inch oval dish), cover tightly with aluminum foil, and bake until an instant-read thermometer reads 150&deg;F (66&deg;C) when inserted into center of dish, about 45 minutes. Remove foil and continue baking until golden brown and crisp on top, 15 to 20 minutes longer. Remove from oven, let cool for 5 minutes, sprinkle with remaining parsley, and serve.</p>"}]}