{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100910-brownaleicecream-610.jpg", "author": {"@type": "Person", "name": "Ethan Frisch"}, "recipeCuisine": "", "keywords": ["beer", "Brooklyn Brewery", "buckwheat", "cardamom", "cinnamon", "cloves", "Guerrilla Ice Cream", "honey", "ice cream", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scooped: Brown Ale and Buckwheat Honey Ice Cream", "link": "https://www.seriouseats.com/recipes/2010/09/brown-ale-and-buckwheat-honey-ice-cream-recipe.html", "description": "A few weeks ago, <a href=\"http://www.guerrillaicecream.com/\">Guerrilla Ice Cream</a> (my mobile ice cream project) was approached by fashion designers <a href=\"http://www.shipley-halmos.com/\">Shipley &amp; Halmos</a> about doing a New York City-themed flavor for <a href=\"http://www.fashionsnightout.com/\">Fashion's Night Out</a>, a city-wide fashion event taking place today. As a native New Yorker, I jumped at the chance to capture the flavor of the greatest city in the world in ice cream form. I decided on a deep, complex, and just-a-tad spicy <strong>Brown Ale and Buckwheat Honey Ice Cream, topped with roasted chestnuts</strong> (hat tip to the chestnut vendors of old New York) and <strong>apple chips</strong> (it is the Big Apple, after all).", "totalTime": "10 hours", "recipeYield": "1 quart", "recipeCategory": [], "recipeIngredient": ["1 bottle (12 oz) Brown Ale (Brooklyn Brewery, ideally)", "3 cups half-and-half (or 1.5 cups whole milk, 1.5 cups heavy cream)", "1/2 tsp whole cloves", "1 whole cinnamon stick", "1 cardamom pod, crushed", "1 tsp black peppercorns", "1 bay leaf", "1/2 tsp vanilla extract", "6 large egg yolks", "1/3 cup sugar plus 2 tablespoons sugar, divided", "1/3 cup buckwheat honey (preferably raw, see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat  half-and-half, cinnamon, cloves, peppercorns, cardamom and bay leaf in medium heavy-bottomed saucepan over medium-low heat until fragrant, about 40 minutes. If mixture bubbles, reduce heat until it is just barely steaming.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1/3 bottle (4 ounces) beer and 1/3 cup sugar to small heavy-bottomed saucepan and heat over medium heat, swirling gently, until deeply caramelized, about 5 minutes. Slowly pour beer and sugar into half-and-half, stirring constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk egg yolks with remaining 2 tablespoons sugar until pale yellow in color and mixture falls in wide ribbons from whisk. Slowly pour 1 cup half and half mixture into eggs, whisking constantly. Pour egg mixture back into pot with half and half, whisking constantly. Heat over medium heat, whisking constantly, until mixture thickens slightly and registers 160 degrees on instant read thermometer, about 5 minutes (mixture should coat back of wooden spoon). Pour ice cream base through fine meshed strainer into a mixing bowl, and allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the honey and remaining beer and whisk to combine. Chill overnight in refrigerator. Freeze in ice cream maker according to manufacturer's instructions.</p>"}]}