{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100628radishes500.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["Crisper Whisperer", "grain salad", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: How to Use Up Your Misfit Vegetables", "link": "https://www.seriouseats.com/recipes/2010/07/how-to-use-up-leftover-vegetables.html", "description": "Is your CSA or garden giving you small, not-so-useful quantities of a funky variety of vegetables? Toss them into this forgiving, nutritious grain salad, and you'll have dinner on your plate and a load off your conscience in about half an hour.", "totalTime": "", "recipeYield": "4 as a main course", "recipeCategory": ["Crisper Whisperer", "Vegetarian"], "recipeIngredient": ["1 cup of dry grains, such as wheat berries, farro, brown or wild rice, quinoa*, or couscous", "1/4 cup of olive oil", "2 tablespoons champagne vinegar", "1/4 teaspoon salt", "A few generous grinds of black pepper", "1/2 small red onion, finely diced", "About 4 cups total of mixed vegetables", "A big handful of mixed herbs, minced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, choose your grain. Rinse it thoroughly under running water in a fine-mesh sieve, and then cook in boiling, well-salted water according to package directions. Drain if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large bowl, combine the oil, vinegar, salt and pepper and whisk to blend well. Add the diced red onion.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Choose, prepare, and add your vegetables. I know it's a leap of faith, but there are many good choices here and few not-so-good ones. You can opt for a combination of textures or a simpler approach. Good choices include:</p>\r\n\r\n<p>\tSteamed leafy greens such as kale, collards, chard, spinach and the like, drained well and cut into bite-sized pieces<br />\r\n\tGrilled summer squash or eggplant<br />\r\n\tDiced raw carrots, peppers, celery, cucumbers, tomatoes, or radishes<br />\r\n\tWinter squash or root vegetables, diced and roasted<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Choose and add your herbs. A mixture of two parts basil, two parts parsley and one part mint would work well with a wide variety of veggies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the grains are cooked and still hot, add them to the bowl and toss to combine. Serve warm, at room temperature, or chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>*Quinoa is actually a seed, but it makes a great grain salad anyway.</p>"}]}