{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100217-goatcheese3.jpg", "author": {"@type": "Person", "name": "Erin Zimmer"}, "recipeCuisine": "", "keywords": ["cheese", "goat cheese", "how tos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "4"}, "name": "How to Make Goat Cheese", "link": "https://www.seriouseats.com/recipes/2010/02/how-to-make-goat-cheese-recipe.html", "description": "This easy (no wait, ridiculously easy) recipe doesn't require rennet or a backyard farm. All you need is goat's milk, lemon juice, cheesecloth, a candy thermometer and some herbs. Bam. You are a cheesemaker.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cheese"], "recipeIngredient": ["1/4 cup freshly squeezed lemon juice", "1/2 clove freshly grated garlic", "A few pinches coarse salt", "Herbs (up to you) but recommended: Rosemary, chives, parsley, herbs de Provence, fennel fronds, dill, and other non-herbs like dried apricots. "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium saucepan with goat's milk. Heat gradually until it reaches 180°F. Watch closely. You can run in and out of the kitchen, but don't get too distracted. It shouldn't take more than about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Once it hits the magical temperature, remove from heat and stir in lemon juice. Let stand until milk starts to curdle, about 20 seconds. Don't expect curdles, like cottage cheese curdles. As you can see in this photo, slight clumping will occur, but nothing too drastic. Don't go pouring in a bucket of lemon juice, thinking nothing has happened. But you can add a few extra droplets if nothing is actually happening. Also: blood orange isn't as effective as lemon in creating the right curd texture, just sayin'.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a colander with several layers of cheesecloth—really, several. Otherwise you'll lose precious goat cheese through the soggy cloth. Place over a large bowl to catch the whey drips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle milk into colander. Pull up and tie the four corners of the cheesecloth together and hang on the handle of a wooden spoon. (This was my favorite part, second to eating it of course.) Set over a very deep bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow whey to drain (drip, drip, drip) until a soft, ricotta-like consistency is reached inside the cloth, about 1 to 1.5 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a bowl and fold in salt, garlic, and flavors of your choice. Serve on fresh bread, salads, with fruit, or just straight-up. Can be stored in an airtight container in the fridge, but after a few days, the consistency isn't as lusciously smooth and spreadable.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Eat it on everything.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat. Make as much as possible.</p>"}]}