{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100628bwicecream.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["baking", "Black and White Cookies", "Cakespy", "Cookies", "desserts", "ice cream sandwiches", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Black and White Ice Cream Sandwich Cookies", "link": "https://www.seriouseats.com/recipes/2010/06/cakespy-black-and-white-ice-cream-sandwiches-cookies-recipe.html", "description": "Paul Simon once sang that \"everything looks worse in black and white.\" Clearly, the guy had never sampled a black and white ice cream sandwich cookie. Starting out with the classic New York deli treat and sandwiching it with chocolate and vanilla ice cream, <strong>this is basically a trinity of awesome: cakey cookies, sweet frosting, and creamy, rich ice cream.</strong>", "totalTime": "", "recipeYield": "about 12 sandwiches", "recipeCategory": ["Cakespy"], "recipeIngredient": ["<strong>For the cookies:</strong>", "2 cups flour", "1 teaspoon baking powder", "1/4 teaspoon salt", "6 tablespoons whole milk", "1 teaspoon vanilla extract", "1/2 cup unsalted butter, at room temperature", "2/3 cup granulated sugar", "2 large eggs, at room temperature", "<strong>For the icing(s):</strong>", "2 cups plus 2 tablespoons confectioners' sugar (keep a little extra on hand in case needed)", "2 teaspoons plus 2 teaspoons light corn syrup", "1/2 teaspoon lemon juice", "1 teaspoon vanilla extract", "3 tablespoons water, or more if needed", "3 tablespoons unsweetened cocoa powder, preferably Dutch-process", "<strong>For the filling:</strong>", "1 carton Neapolitan ice cream (or, 1 pint each vanilla and chocolate ice cream of the finest quality)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F. Prepare two baking sheets by lining them with parchment paper and set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the flour, baking powder, and salt. In another small bowl, mix together the milk and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle attachment, beat together the butter and granulated sugar on medium speed until completely smooth. Beat in the eggs one at a time. Stir in half of the flour mixture, then stir in the milk mixture, and then the rest of the flour mixture; beat it all until the batter is smooth. Use a rubber spatula to scrape down the sides of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a cookie scoop or small ice cream scoop (or regular spoon, if you don't have this kind of fancy gear), drop rounded spoonfuls spaced 2 inches apart on your prepared baking sheets. Bake, rotating the sheets midway through baking, until the cookies feel just set in the center, about 15 minutes. Let cool completely on the baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cookies cool, prepare the icings. In a medium bowl, whisk together the 2 cups confectioners' sugar with 2 teaspoons corn syrup, lemon juice, vanilla, and water until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer half of the icing mixture into a second bowl, and whisk in the cocoa and remaining corn syrup to make the \"black\" half of the icing. Add a little bit more water if it is too thick; you want it to be easily spreadable, but not so thin that it will drip. The two icings should have a similar consistency; if the \"white\" icing is too thin, add in a little more confectioners' sugar and stir until smooth.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a small icing spatula or butter knife, spread white icing over half of the bottom (flat side) of half of the cookies (half of them will be left unfrosted, so feel free to be liberal with the amount of frosting you apply). Spread the \"black\" frosting over the other half, taking care that you get a nice, clean line down the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cookies hang out in the fridge, uncovered, for about an hour--this will harden the icing a bit and make them easier to handle while you assemble your sandwiches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Get out your ice cream, and let it sit outside of the freezer for 10 minutes or so to soften a bit before assembling. I used a carton of Neapolitan ice cream so that I could grab spoonfuls right along the chocolate-vanilla line to sandwich between my cookies. Turn one of the unfrosted cookies so that the flat side is up; place a nice-sized scoop of vanilla-chocolate ice cream directly on top. Using a spoon, lightly flatten the top of the scoop to make room for the rounded bottom of the cookie that you'll be placing on top. Place the frosted cookie on top, and gently press down so that the sandwich comes together. Using a butter knife, gently smooth the sides of the ice cream so that it is flush with the edges of the cookie. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap in plastic wrap or waxed paper, and store in the freezer for at least one hour to allow the ice cream to set. Enjoy immediately upon removing from the freezer.</p>"}]}