{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/making.jpg", "author": {"@type": "Person", "name": "Tam Ngo"}, "recipeCuisine": "", "keywords": ["cheese", "cheese curds", "cheesemaking", "curds", "mozzarella", "Murray's Cheese", "whey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "How to Make Mozzarella", "link": "https://www.seriouseats.com/recipes/2010/02/how-to-make-mozzarella-cheese-at-home-curds-stretching-murrays.html", "description": "Making mozzarella at home is ridiculously easy, especially if you've got Kevlar hands. Mozzarella is a <em>pasta-filata</em> style of cheese which involves hand-stretching hot curds into pliable strands. Like pulling bread dough, the point is to manipulate it just enough to improve elasticity, but not so much as to toughen the thing.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cheese", "Pizza"], "recipeIngredient": ["1 pound fresh cheese curds, cold", "1 tablespoon kosher salt", "Hot water (160-165° F)", "Warm water (90-100° F)", "Cool water", "<h5>Equipment</h5>", "2 large metal mixing bowls", "Thermometer", "Knife", "Wooden spoon", "3 pairs of thin Latex gloves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut mozzarella curd into 1-inch cubes. (Cutting the curd while still cold gives cleaner rather than jagged edges).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cut curds in a large mixing bowl and pour just enough warm water (roughly 90 to 100°F) to cover the curds. Never pour water directly on top of the curds, but pour water along the sloped side of the bowl to gently envelope the curds. This brings the curds to temperature gradually. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let stand for a few minutes until the curds warm through. (Test by picking the largest piece of curd in the bowl and splitting it open. If it still feels cold on the inside, let stand for a little longer.) Warming the curds through helps them melt evenly once <em>really</em> hot water is introduced. When the curds are fully warmed, they should go from a firm, tofu-like texture to a softer/squidgier texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Introducing warm water to cold curds will cause the temperature of the water to drop slightly.  If the water feels too cool, add a little more warm/hot water to bring the water temperature to 100 to 120°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all of the curd pieces have warmed through, drain the water from the warm curds into a separate bowl and reserve. (This water is the brine for your finished balls of mozzarella. Add 1 tablespoon of salt to the water and stir to dissolve.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of curds, pour hot water (160°F) around the edges of the bowl until it just covers the curds. Let the curds sit for about 2 minutes until they begin to soften and melt. Use a wooden spoon to gently fold the curds over each other in the bowl. When you get one smooth, homogeneous mass, you are ready for the next step!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>During step 4, keep feeling the temperature of the water. It should be uncomfortably hot to the touch. If the temperature drops, skim off some warm water and add hotter water to raise the temperature of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keeping the curd mass submerged in super hot water, gently pull one end of it away from your body (while guiding the remainder in the bowl with your other hand).  Imagine you are guiding a fire hose or straightening a long stocking. Keep as much of the ball submerged under water as possible. (This will keep the curd smooth and silky.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the curd is loosely elastic and stretched, roll one end of the hose until it meets the other end&mdash;as if you are coiling a stocking. Then, take the mass in one hand and pass it through your other hand cupped in the shape of a \"C\".</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As the ball completely passes through the C-shaped hand, pinch the smaller ball off from the larger cheese mass (by bringing your pointer finger in toward your wrist).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately put the formed ball into the warm brine solution.  Let sit for a few minutes. If there are ragged edges from where the ball was pinched, smooth the edges by running the ball submerged along the inside of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat steps 5 through 8 with the remaining curd mass. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve and eat as soon as possible! Fresh mozzarella can kept unrefrigerated overnight or for a few days longer in the fridge. Note that refrigeration will cause the cheese to seize up and lose its pillowy softness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><img alt=\"20100217sampler.jpg\" src=\"https://www.seriouseats.com/recipes/images/sampler.jpg\" width=\"500\" height=\"375\" class=\"mt-image-none\" style=\"\" /></p>"}]}