{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100525GFBread_2.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "gluten free", "gluten-free bread", "Gluten-Free Tuesday", "sandwich bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5714285714286", "ratingCount": "7"}, "name": "How to Make Gluten-Free Sandwich Bread", "link": "https://www.seriouseats.com/recipes/2010/05/how-to-make-gluten-free-sandwich-bread-recipe.html", "description": "Gluten-free bread. I'm the first to admit it suffers from a bit of a bad reputation. The premade loaves tend to be expensive and homemade recipes often are dense and fall apart when sliced.  What's a gluten-free eater to do? Live without bread? My answer to that is an emphatic \"No!\" <strong>Gluten-free bread can be wonderful.</strong> For my first column on Serious Eats, I wanted to share my recipe for <strong>Easy Sandwich Bread.</strong> Let's get baking!", "totalTime": "", "recipeYield": "One 9x5 loaf", "recipeCategory": ["Bread Baking", "Gluten-Free", "Gluten-Free Tuesday", "Yeast Bread"], "recipeIngredient": ["<strong>Dry Ingredients</strong>", "2 1/2 cups Brown Rice Flour", "2/3 cup cornstarch ", "2/3 cup dry milk powder [If dairy is a problem for you, dry soy milk or DariFree can be substituted. The finished loaf will be lighter in color.]", "1 Tablespoon xanthan gum ", "1 teaspoon salt  ", "<strong>Wet Ingredients</strong>", "1 3/4 cups warm water ", "1 packet active dry yeast ", "2 Tablespoons vegetable oil ", "2 large eggs  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine water and yeast. Stir to combine. Use a liquid measuring cup. (I use a 2-cup measure.) The water should be between 110-115 degrees F. Let the yeast dissolve in the water while you measure your dry ingredients.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, whisk together dry ingredients. While using a scale to measure ingredients is the most accurate method, most American home bakers use cup measures. And so do I! (Just don't tell my professional baker friends. It can be our little secret.) The best way to fill a measuring cup is to \"fill and level.\" Using a scoop, or a smaller size measuring cup, pour the flour into your measuring cup. Be sure to use a nested set of \"dry\" measuring cups. If your flour has been sitting around, it's a good idea to whisk it before measuring. This will lighten it and break up any clumps. Overfill the cup and then run a straight edge tool over the top of the cup. I like to use a small cake decorating spatula. This is what you are looking for: a level cup of flour. Use this method for any gluten-free flours and starches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add yeast mixture, vegetable oil and eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an electric mixer, mix dough for five minutes on medium-high speed. (If using a stand mixer, remember to use the flat paddle attachment to mix the dough.) Your dough should be soft, thick, and sticky. The dough will not form a cohesive dough ball. If you are using a handheld mixer, the dough will try to \"climb\" the beaters. Be sure to use a rubber spatula to push the dough back into the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease a 9x5-inch loaf pan with vegetable spay.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread batter evenly into the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the loaf lightly with a piece of greased plastic wrap. (If you cover the loaf tightly, the dough will have trouble rising.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow dough to rise for 1 hour. Check it. It it has risen a little over the top of the pan, it is ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees F. (Keep dough covered while preheating the oven.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove plastic wrap and bake for 55 minutes or until internal temperature reaches 208 degrees-211 degrees F. If the crust of your bread begins to get too dark before the internal temperature of the bread reaches 208 degrees, simply cover the loaf with a piece of aluminum foil. This will allow the bread to continue baking without burning the crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bread from oven and turn it out onto a wire rack to cool. This will help to keep the crust crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the loaf to cool completely. Store at room temperature for two to three days or slice and freeze. Do not refrigerate--this will make for soggy bread!</p>"}]}