{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101221-129707-grapefruit-avocado-salad.JPG.JPG", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["aji panca", "avocado", "grapefruit", "salads", "Spice Hunting", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Avocado and Grapefruit Salad with Aji Panca Vinaigrette", "link": "https://www.seriouseats.com/recipes/2010/12/avocado-grapefruit-salad-chile-chili-vinaigrette-recipe.html", "description": "Aji panca's light fruitiness pairs well with assertive, aromatic grapefruit and buttery avocado&mdash;it plays off their best attributes and brings them closer together. Though this a decidedly winter salad, it feels summery, and it'd be the perfect accompaniment for a winter grill fest-turned-taco night. Or dice the fruit fine and pile it on toast for breakfast. Yes, you'll need to <a href=\"http://www.seriouseats.com/2010/06/knife-skills-how-to-cut-citrus-segments.html\">segment your grapefruit</a> for this, but once you get a little practice it's easy and kind of fun. If you buy an extra couple practice grapefruit you'll be a pro by serving time.", "totalTime": "7 minutes", "recipeYield": "4", "recipeCategory": ["Avocado", "Grapefruit", "Salads", "Vegetarian"], "recipeIngredient": ["2 large ruby grapefruits, cut into segments, juice reserved", "2 ripe Hass avocados, cut in half and sliced 1/4 inch thick", "4-6 tablespoons red onion, diced fine, divided", "4 teaspoons aji panca (or pasilla chile), ground (about 1 large chile)", "4 tablespoons fruity extra virgin olive oil, divided", "Coarse salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange grapefruit and avocado on four plates. Top with sprinkles of red onion and aji panca. On each plate, drizzle 2 teaspoons reserved grapefruit juice over avocado slices, covering well to prevent browning. Then drizzle 1 tablespoon olive oil over each plate. Add salt, mostly on avocado, to taste, starting with 1/4 teaspoon per plate. Serve immediately.</p>"}]}