{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100708-dt-summer-squash-risotto.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "rice", "risotto", "squash", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Summer Squash Risotto", "link": "https://www.seriouseats.com/recipes/2010/07/dinner-tonight-summer-squash-risotto-recipe.html", "description": "I often turn to <a href=\"http://www.amazon.com/exec/obidos/ASIN/0060171472/serieats-20\"><em>Chez Panisse Vegetables</em></a> when I have a vegetable rather than an idea for dinner, and this <strong>summer squash risotto</strong> recipe caught my eye. It's a fairly standard risotto recipe&mdash;butter, onions, wine, stock, and rice&mdash;which means the flavor of the zucchini or summer squash and fresh herbs emerges.", "totalTime": "", "recipeYield": "4-6", "recipeCategory": ["Dinner Tonight", "Rice", "Squash", "Vegetarian"], "recipeIngredient": ["1/4 pound summer squash or zucchini, ends trimmed and cut into bite-sized pieces", "6 tablespoons unsalted butter", "6 squash blossoms (optional)", "1 medium onion", "7-8 cups chicken or vegetable stock", "2 cups risotto rice, such as Arborio", "1/3 cup white wine", "Salt and pepper to taste", "3 tablespoons herbs such as sage, marjoram, savory", "1/2 cup grated Parmesan cheese, plus more for garnish", "4 tablespoons balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the stock to a boil in a saucepan and keep at a simmer. In a large, heavy pot melt 2 tablespoons of the butter and saute the onions over medium heat until soft. Add the rice and stir well, ensuring all the grains are coated in fat, and cook for 1-2 minutes. Add the wine and a couple pinches of salt and allow it to absorb into the rice; once it has add about 1 cup of stock and stir well. Stir often as the stock is absorbed, adding it 1 cup at a time whenever the pot is almost dry again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, melt 2 more tablespoons of butter in a large saute pan over high heat and cook the squash or zucchini until golden. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rice is nearly soft still with a \"chalky\" hard center, add the squash or zucchini, squash blossoms, and herbs. Stir well and add more stock. Cook, adding stock if necessary, until the rice is tender, then stir in the remaining butter, Parmesan, and balsamic vinegar. Turn off the heat and cover, allowing the pot to sit for 2 minutes (prepare shallow bowls in the meantime). Ladle into bowls and serve with more Parmesan as a garnish.</p>"}]}