{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101119-dt-fish-with-buttery-herbs.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["basil", "capers", "Dinner Tonight", "fish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Pan-Seared Fish with Buttery Herbs", "link": "https://www.seriouseats.com/recipes/2010/11/pan-seared-fish-with-buttery-herbs-recipe.html", "description": "The preparation is a bit like that famous <strong>French preparation Sole a la Meuniere,</strong> the dish that seduced Julia Child when she first came to France.  This is mostly due to the brown butter, which you create just as the fish finishes cooking.  The radiant heat of the pan makes the herbs sputter and pop, and turns the butter nutty and golden.  Spooned over the dish for the final minute of cooking, it arrives at the table tender, buttery, and succulent.", "totalTime": "15 minutes", "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Fish"], "recipeIngredient": ["1 clove garlic, finely minced", "1/4 cup chopped fresh parsley", "1/4 cup chopped fresh basil", "2 teaspoons capers, rinsed, dried and chopped", "2 teaspoons zest from 1 lemon", "2 tablespoons olive oil", "2 tablepsoons juice from 1 lemon", "Kosher salt and freshly ground black pepper", "1 tablespoon canola oil", "2 skin-on white fish fillets (like snapper or hake, about 3/4 pound)", "2 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine garlic, parsley, basil, capers, and lemon zest  in small bowl with olive oil.  Add lemon juice, salt, and pepper to taste. Stir well to combine and set aside while you cook the fish.</p>\n\n<p></p>\n\n<p></p>\n\n<p></p>\n\n<p><br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry fillets well and season with salt and pepper. Heat canola oil in saute pan or skillet large enough to hold the fillets comfortably over high heat, until almost smoking.  Add fillets skin-side down and cook without moving until the skin is crisp and golden and easily releases from the pan, 3-5 minutes.  Carefully flip the fillets over and cook for an additional 2-4 minutes, depending on the thickness of fillets (center of fillet should register 140°F on instant read thermometer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When fish is a minute away from being finished, add butter to pan.  Allow to melt and begin to take on golden color, then add herb mixture.  Spoon juices over fish as it finishes cooking. Serve fillets with more pan juices spooned on top.</p>"}]}