{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100204-steak-sandwich.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["grill", "grilling", "Guinness", "indoor grilling", "sandwiches", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Indoor Grilling: Guinness-Marinated Steak Sandwich", "link": "https://www.seriouseats.com/recipes/2010/02/indoor-grilling-guinness-marinated-steak-sandwich-recipe.html", "description": "[Photograph: Joshua Bousel] Wings, nachos, ribs&mdash;they're all lined up for Sunday. As I eagerly await my excuse to devour my favorite party foods, I was craving along the same lines but more of a quick, weeknight night dinner, and this...", "totalTime": "", "recipeYield": "", "recipeCategory": [], "recipeIngredient": ["2 lbs flank steak", "1 pint of Guinness beer", "2 large red onions, cut into 1/2 inch rounds and skewered through the middle", "1 5.2-ounce container Boursin cheese, frozen", "4 Ciabatta rolls", "Arugula", "Olive oil", "Kosher salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the steak dry with paper towels and place in a shallow, nonreactive container. Place onion slices on top of the steak and pour in the Guinness. Cover and let marinate in the refrigerator for 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the steak and onions from the marinade and brush lightly with oil and season with salt and pepper. Heat indoor grill over high heat until very hot. place steak and onions on the grill and Cook until the steak and onions have browned nicely, about 6 to 8 minutes, then flip and continue to cook until the other side is browned and the meat is done to your liking, about another 5-6 minutes for medium rare. Remove from the grill, shave a thin layer of Boursin on the top of the steak and onions and let rest for 5 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush bread slices lightly with oil and place on the grill until nicely toasted, about 1 to 2 minutes. Spread a layer of Boursin on both sides of the bread. Slice the steak into long 1/4 inch slices against the grain. Place a handful of arugula on the bottom piece of bread, then top with steak and onions and serve.</p>"}]}