{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100618frankiesmeatballs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Italian", "keywords": ["bread crumbs", "Brooklyn", "Cook the Book", "Frank Castronovo", "Frank Falcinelli", "Italian", "meatballs", "pine nuts", "raisins"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "4"}, "name": "Cook the Book: Frankies' Meatballs", "link": "https://www.seriouseats.com/recipes/2010/06/frankies-spuntino-meatballs-recipe.html", "description": "When eating at <strong>Frank Falcinelli and Frank Castronovo's <a href=\"http://www.frankiesspuntino.com/\">Frankies Spuntino</a></strong>, not ordering the <strong>meatballs</strong> is really a crime.  They are by far the best meatballs I've ever had in a restaurant, and possibly my life. <strong>Perfectly textured, not at all dense but not falling-apart crumbly,</strong> with just the right amount of egg, bread crumbs, garlic, and cheese throughout.  But what really makes these meatballs special is <strong>the addition of raisins and pine nuts</strong>.", "totalTime": null, "recipeYield": "18 to 20 meatballs", "recipeCategory": ["Beef", "Cook the Book", "Italian", "Nuts"], "recipeIngredient": ["4 slices bread (2 packed cups' worth)", "2 pounds ground beef", "3 cloves garlic, minced", "1/4 cup finely chopped flat-leaf parsley", "1/4 cup grated Pecorino Romano, plus about 1 cup for serving", "1/4 cup raisins", "1/4 cup pine nuts", "1 1/2 teaspoons fine sea salt", "15 turns white pepper", "4 large eggs", "1/2 cup dried bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 325&deg;F.  Put the fresh bread in a bowl, cover it with water, an let it soak for a minute or so.  Pour off the water and wring out the bread, then crumble and tear it into tiny pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the bread with all of the remaining ingredients except the tomato sauce in a medium mixing bowl, adding them in the order that they are listed.  Add the dried bread crumbs last to adjust for wetness; the mixture should be moist wet, not sloppy wet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the meat mixture into handball-sized meatballs and space them evenly on a baking sheet.  Bake for 25 to 30 minutes.  The meatballs will be firm but still juicy and gently yielding when they're cooked through.  (At this point, you can cool the meatballs and hold them in the refrigerator for as long as a couple of days or freeze them for the future.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the tomato sauce in a sauté pan large enough to accommodate the meatballs comfortably.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump the meatballs into the pan of sauce and nudge the heat up ever so slightly.  Simmer the meatballs for half and hour or so (this isn't one of those cases where longer is better) so they can soak up some of the sauce.  Keep them there until it's time to eat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the meatballs 3 to a person in a healthy helping of read sauce, and hit everybody's portion&mdash;never the pan&mdash;with a fluffy mountain of grated cheese.  Reserve the leftover tomato sauce (it will be extra-super-delicious) and use it anywhere tomato sauce is called for in this book.</p>"}]}