{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100511chickpeasoup.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["chickpeas", "Eat for Eight Bucks", "inexpensive", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Chickpea Soup with Toasted Breadcrumbs", "link": "https://www.seriouseats.com/recipes/2010/05/eat-for-eight-bucks-chickpea-soup-with-toasted-breadcrumbs-recipe.html", "description": "I first made Mark Bittman's <strong>chickpea soup with toasted breadcrumbs</strong> because it sounded fast and easy, but it earned its spot on my list of favorite recipes because it tastes so good. If you've cooked your chickpeas carefully and stored them in their broth, <strong>not much can go wrong</strong> with this soup. It's very receptive to experimentation with spices, herbs, and greens. The escarole, my addition, brought some nice flavor and texture to the dish.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Eat for Eight Bucks", "Legumes", "Vegetarian"], "recipeIngredient": ["About 3/4 cup homemade bread crumbs", "Olive oil", "1 medium onion, chopped", "1 teaspoon pimenton or cumin (optional)", "Salt and pepper", "1 tablespoon minced garlic", "Splash of wine (optional)", "3 cups cooked chickpeas, with about 2 cups of their cooking liquid", "1 head escarole, cleaned and chopped into bite-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Spread the bread crumbs on a baking sheet, toss with a glug of olive oil (1-2 tablespoons), and spread evenly again. Toast for 5 to 10 minutes, stirring every few minutes, until the crumbs are golden and fragrant. Keep a very close eye on them as you stir, for they can begin to burn quite quickly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the breadcrumbs are toasting, heat 2 tablespoons of olive oil in a medium saucepan over medium heat. Add the chopped onion and cook, stirring occasionally, until it is softened and beginning to get some color, 10-15 minutes depending on your pot and your heat. Stir in the pimenton or cumin, if using, along with some salt and pepper and the garlic and cook for about a minute more. If you have a bottle of wine open, add a glug now and cook until it has almost entirely evaporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chickpeas and their broth into the saucepan and bring to a simmer. Simmer gently for a few minutes to heat through; then stir in the escarole, return to a simmer, and cook 5 minutes more, until the escarole is tender enough to eat. Serve the hot soup topped with a generous sprinkling of toasted bread crumbs.</p>"}]}