{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100629sachertorte.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apricot", "chocolate cake", "Cook the Book", "Lucy Baker", "The Boozy Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sachertorte", "link": "https://www.seriouseats.com/recipes/2010/06/cook-the-book-sachertorte-recipe.html", "description": "The Sachertorte is basically a dense chocolate cake layered with apricot jam and finished with a chocolate glaze.  The Viennese generally consider the cake to be too dry to eat on its own so it is typically served with a dollop of <em>schlag</em>, or sweetened whipped cream, but if you ask me, I think it's just an excuse to enjoy a little more whipped cream.", "totalTime": "", "recipeYield": "12 to 16", "recipeCategory": ["Apricot", "Bake the Book", "Cook the Book"], "recipeIngredient": ["<strong>For the torte:</strong>", "5 ounces bittersweet chocolate, chopped", "1/4 pound (1 stick) unsalted butter, softened", "3/4 cup plus 1/4 cup sugar", "6 large eggs, separated", "1 tablespoon apricot brandy", "1 cup all-purpose flour ", "<strong>For the apricot glaze:</strong>", "1 cup apricot preserves", "3 tablespoons apricot brandy ", "<strong>For the chocolate glaze:</strong>", "1/2 cup heavy cream", "5 ounces bittersweet chocolate, chopped", "4 tablespoons unsalted butter", "2 tablespoons apricot brandy"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the torte, preheat the oven to 350°F. Butter two 8-inch round cake pans or spray with nonstick spray. Line the bottoms of the pans with parchment paper. Dust with flour and tap out the excess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate in a heatproof bowl and set the bowl over a pan of simmering water. Heat, stirring occasionally, until the chocolate is melted and smooth. Remove the bowl from the heat and allow the chocolate to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat the butter and 3/4 cup sugar with an electric mixer until very light and fluffy, about 3 minutes. Beat in the egg yolks one at a time, scraping down the sides of the bowl as needed. Beat in the apricot brandy and the cooled chocolate. Set aside. Wash and dry the beaters.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another large bowl, beat the egg whites with the remaining 1/4 sugar until they form soft peaks. Stir 1/3 of the beaten whites into the chocolate mixture to lighten it, then carefully fold in the remaining whites until only a few streaks of white remain. Sprinkle 1/2 cup of flour over the batter and fold in until incorporated. Repeat with the remaining 1/2 cup flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter between the two cake pans and bake until they are puffed a toothpick inserted into the center comes out clean, about 20 minutes. Remove the cakes from the oven and allow them to cool on a wire rack for 15 minutes. Run a knife around the edge of each pan and invert each cake over a plate. Peel off the parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the glaze, bring the apricot preserves and apricot brandy to a boil in a medium saucepan over medium heat. Reduce heat to a simmer, and cook until mixture is thickened, about 5 minutes. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one torte layer on a plate lined with two pieces of wax paper (align them so that each piece covers half the plate and they overlap slightly in the middle). Spread the torte layer with 1/2 the apricot jam mixture. Top with the remaining torte layer, and spread it with the remaining jam mixture. Let stand while you make the chocolate glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chopped chocolate in a small mixing bowl. Heat the heavy cream in a small saucepan over low heat until it reaches a simmer. Pour over the chocolate and let stand 2 minutes, then stir until smooth. Stir in the butter until smooth. Stir in the apricot brandy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately pour the glaze over the cake. Using an offset spatula, smooth the glaze over the top and sides of the torte, making sure to cover it completely. Refrigerate the cake until the glaze is set, about 1 hour. Gently pull the sheets of wax paper out from underneath it, cut into thin wedges, and serve.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong>  Substitute orange marmalade for the apricot jam, and orange liqueur for the apricot brandy. </small></p>"}]}