{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100422wholewheatspaghettiwithkalefinished.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alice Waters", "Cook the Book", "In The Green Kitchen", "kale", "pasta", "whole wheat pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Whole-Wheat Spaghetti with Kale", "link": "https://www.seriouseats.com/recipes/2010/04/whole-wheat-spaghetti-with-kale-recipe.html", "description": "One of the topics that <a href=\"http://www.chezpanisse.com/about/alice-waters/\">Alice Waters</a> discusses in the first pages of <em><a href=\"http://www.amazon.com/Green-Kitchen-Techniques-Learn-Heart/dp/0307336808/serieats-20\">In The Green Kitchen</a></em> is how to stock a pantry.  Any cook worth his or her salt knows that having a few items such as decent olive oil, onions, garlic, and pasta on hand makes putting together delicious last minute meals easy and relatively stress-free.  This recipe for <strong>Whole-Wheat Spaghetti with Kale</strong> comes together in the time it takes for the pasta to cook and with no need to stop off at the market for extra ingredients, providing you have some sort of leafy green on hand.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cook the Book", "Kale", "Pasta", "Vegetarian"], "recipeIngredient": ["1 1/2 pounds kale, about 2 bunches", "Salt", "1 pound whole-wheat spaghetti", "1/2 cup olive oil", "1 large onion, peeled and thinly sliced", "A large pinch of dried chile flakes", "4 garlic cloves, peeled and chopped", "Parmesan or Romano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tough stems from the kale leaves. Discard the stems, and coarsely chop the greens. Rinse the kale and drain. Bring a large pot of water to a boil, and season with a generous amount of salt. Add the spaghetti and cook until al dente, tender but still firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pasta cooks, heat a large, heavy sauté pan over medium-high heat. Add half of the oil, the onion, chile flakes, and a pinch of salt, and cook, stirring occasionally, until the onion is tender and lightly colored, about 5 to 7 minutes. (If the onion begins to scorch, reduce the heat to medium.) Add the kale and cook, stirring and tossing, until the kale is wilted and tender, about 3 minutes. Add water to the pan if the greens are dry, and if the greens are on the sturdy side, cover the pan briefly to steam them. Add the garlic, season with salt, and cook for 2 minutes more. Take care that the garlic doesn't brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta when cooked, reserving some of the pasta water.  Add the pasta to the sauté pan and toss to combine. Loosen with a splash of the cooking water as needed, and taste for salt. Transfer the pasta to a warm platter or serving bowls, and drizzle a thin stream of olive oil on top. Garnish with shavings of Parmesan or Romano cheese, and serve immediately.</p>"}]}