{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100831farro%20salad.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["carrots", "Eat for Eight Bucks", "farro", "healthy", "olives", "salads", "swiss chard", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Farro Salad", "link": "https://www.seriouseats.com/recipes/2010/08/eat-for-eight-bucks-farro-salad.html", "description": "This will not look like much of a meal to some of you, but for me a bowl of simply dressed grains and vegetables is about as good as it gets, at least when I can't devote much thought and energy to satisfying my stomach. This <strong>farro salad</strong> is wonderful to have around, since it can serve as a healthy snack or emergency provisions if a big dinner is taking longer to prepare than you had anticipated.", "totalTime": "", "recipeYield": "3 to 4", "recipeCategory": ["Eat for Eight Bucks", "Olives", "Salads", "Vegetarian"], "recipeIngredient": ["<strong>Shopping list:</strong> 1 cup (7 ounces) farro, $1.50; 1 bunch Swiss chard, $2.00; 1 carrot, $0.25; 4 ounces feta, $3.00; olives, $1.00", "<strong>Pantry items:</strong> olive oil, red wine vinegar, salt, pepper, garlic.", "<strong>Total cost</strong> (for 3 hearty portions): $7.75", "1 cup farro", "Salt", "Red wine vinegar", "1 bunch Swiss chard, cleaned, stems removed and chopped into 1/4 inch dice, leaves roughly chopped", "1 carrot, peeled and cut into 1/4 inch dice", "Olive oil", "1 clove garlic, peeled and smashed", "Salt", "Pepper", "4 ounces feta ", "A small handful of good black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the farro according to package instructions. The brand I use calls for a 25 minute simmer in a quart of salted water. Drain the farro, dump it into a big bowl, and toss with 1 tablespoon red wine vinegar while it is still warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam the chard leaves. Put them, still wet from rinsing, into a saucepan and add an extra splash of water. Cover, turn the heat to medium, and cook until they are tender enough to eat but not mushy. Peek in every once in a while to toss the leaves with a spoon and taste for doneness; it usually takes around 5 minutes. Drain in a colander. When cool enough to handle, chop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the carrot and chard stems. Put them in the saucepan you used for the chard leaves with a glug of olive oil and the garlic. If there is still chard-cooking liquid in the saucepan, that's fine. Turn the heat to medium-low and saute gently, adjusting the heat if necessary, until the vegetables are tender, about 10 minutes. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the farro, chopped chard leaves, chard stems, and carrots together in a big bowl. Drizzle with 1 tablespoon red wine vinegar and 2 tablespoons olive oil. Season with 1/4 teaspoon salt and 1/4 teaspoon pepper; toss again and taste. Add more oil or salt and pepper if necessary. Serve warmish, room temperature, or cold with about an ounce of feta cheese and a few olives per person.</p>"}]}