{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100309papusas.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "pupusas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Pupusas con Curtido", "link": "https://www.seriouseats.com/recipes/2010/03/eat-for-eight-bucks-papusa-con-curtido-recipe.html", "description": "Served with a spicy cabbage salad, <strong>pupusas&mdash;homemade, cheese-stuffed corn tortillas&mdash;</strong>are one of my favorite ways to make a dinner that feels like a treat without even approaching the $5 barrier.", "totalTime": "", "recipeYield": "serves 2", "recipeCategory": ["Eat for Eight Bucks", "Mains", "Vegetarian"], "recipeIngredient": ["2 cups masa harina", "1 teaspoon salt", "About 2 loosely packed cups (8 ounces) coarsely grated queso fresco, Monterey Jack, or pale, mild cheddar", "Peanut or canola oil ", " ", "<strong>For the curtido:</strong>", "1 pound green cabbage, shredded (about 6 well-packed cups)", "1 carrot, peeled and grated (optional)", "1 teaspoon kosher salt", "2 tablespoons red wine vinegar", "1/4 teaspoon cayenne", "1 teaspoon dried oregano", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the masa harina and salt into a wide bowl. Slowly add about 1 1/3 cups hot tap water, mixing as you go. The resulting dough should be soft and puttylike but not sticky. Add more water if you need it. Knead well and form into a smooth ball. Put the dough all in a plastic bag and set aside for 30 minutes or longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 10 smooth balls. Flatten the balls slightly to make small, smooth patties. Keep them covered with plastic. Divide the grated cheese into 10 portions and keep a bowl of lukewarm water nearby.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dampen a cupped palm with the lukewarm water. Take one dough patty, put it in the cupped palm, and press down on it until you have a slightly cupped 3-inch round. (If the edges break, fix them with dampened fingers.) Now put 2 to 3 tablespoons grated cheese into the cup (I can never fit quite this much and end up with cheese left over). Bring the edges of the cup together over the top of the cheese and form a ball again. Press down on the ball gently to make a patty. Make 9 other cheese-filled patties, keeping them covered on a sheet of wax paper as you work.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a cast-iron griddle or frying pan over a medium-high flame. It needs some time to heat up. Cut a plastic baggie into two pieces or prepare two pieces of wax paper about the size of your tortilla press. Put a stuffed dough patty between the two pieces of plastic and flatten in the tortilla press until it is about 5 inches in diameter. Make each pupusa right before you cook it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a paper towel to grease the griddle lightly. Remove the top layer of plastic from the pupusa and then invert the pupusa onto the hot griddle, peeling away the bottom layer of plastic as you do so. Cook for 30 seconds, then flip and cook the other side for 30 seconds. Flip again and use a small but thick wad of paper towel to rotate the pupusa by pressing down on its edge while giving it a slight turn. Quickly work your way around the whole pupusa. It should puff up a bit, but it won't always do so&mdash;don't worry about it. Turn after 20 seconds and keep pressing and spinning if it has not yet puffed. Keep turning every 15 seconds or so until the pupusa has a few brownish spots and has cooked 2 to 2 1/2 minutes in all. Remove from the griddle and keep covered with a towel while you cook the rest, stacking them atop each other as you finish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately or reheat by re-griddling 30 seconds per side or bundling in foil and baking at 350 for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Curtido (cabbage salad with oregano; serves 4 to 6):</strong> Combine all the ingredients in a large bowl and toss well to mix. Set aside for 1 hour or longer, refrigerating if necessary.</p>"}]}