{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100810pouleauriz_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["chicken", "Eat for Eight Bucks", "inexpensive", "peas", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Poule au Riz", "link": "https://www.seriouseats.com/recipes/2010/08/eat-for-eight-bucks-poule-au-riz-chicken-and-rice-recipe.html", "description": "I adapted <em><a href=\"http://www.amazon.com/dp/0375756647/?tag=serieats-20\">Clémentine in the Kitchen</a></em>'s <strong>poule au riz (chicken and rice)</strong> using chicken legs instead of a whole bird and served it with frozen peas and a salad. <strong>It fed two hungry adults and a toddler.</strong> What's more, it left me with a few coups of chicken stock to use over the course of the week's cooking.", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Eat for Eight Bucks", "Legumes"], "recipeIngredient": ["<strong>Shopping list: </strong>2 whole chicken legs, $2.82; 1 onion, $0.50; 1 bunch parsley, $0.69; 1/2 cup white rice, $0.50; 5 ounces frozen peas, $1.00; 1 head lettuce, $1.99; 1 egg, $0.25.", "<strong>Pantry items:</strong> Garlic, dried thyme, salt, pepper, sugar, white wine vinegar, vinaigrette.", "<strong>Total cost (for 2):</strong> $7.75", "2 whole chicken legs, bone-in, skin-on", "1 medium yellow onion, trimmed but unpeeled, quartered", "2 cloves garlic, unpeeled and crushed", "3/4 pound chicken parts for stock—necks, backs, wings, bones (optional, cost $0.75 from my butcher)", "1 bunch parsley", "Dried thyme", "Kosher salt", "Freshly ground black pepper", "1/2 cup uncooked white rice", "5 ounces frozne peas (about 1 cup)", "1 head green-leaf lettuce", "Sugar", "1 egg yolk", "1/2 teaspoon white wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chicken legs in a pot with the onion, garlic, and extra chicken parts. Add 2 sprigs parsley, 1/4 teaspoon dried thyme, 1/2 teaspoon salt, 1/4 teaspoon pepper, and 6 cups water. Bring to a simmer and then adjust the heat so that the water barely bubbles. You want to cook the chicken exceedingly gently; in my pot, bubbles never break the surface but can be observed rising in very tiny streams within the liquid. Maintain this state for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken legs to a plate. Raise the heat under the pot and let the stock boil vigorously for 20 to 30 minutes; taste after 20 minutes to see if it is chickeny enough. When the stock tastes delicious, turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the half cup of rice in 1 cup of the stock. At the same time, put the frozen peas in a saucepan with 1 lettuce leaf, 1/8 teaspoon dried thyme, 1/4 teaspoon sugar, and 1 sprig parsley; cover and turn the heat under the peas to low. Let the peas cook this way for 20 minutes (about the same time it takes to cook the rice and let it rest), stirring a couple of times. Remove lettuce leaf, taste peas, and add salt and pepper if you like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken legs are cool enough to handle, remove and discard the skin. Pull all the meat from the bones; you should get 7-8 ounces. You can slip the bits of meat into the pot of stock to keep warm and moist if you like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the rice and peas cook, make the sauce. In the top of a double boiler (or a bowl set over a pot of simmering water), whisk together the egg yolk and white wine vinegar. Gradually add 2/3 cup chicken stock, whisking all the while. Continue stirring and cooking the sauce over the simmering water until it thickens up a bit. (I cooked and stirred for 15 minutes without much thickening and decided to serve the sauce in its smooth but loose state, since it already tasted good.) Taste and correct seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the chicken pieces atop the rice with a bowl of sauce, still hot, on the side. Garnish the chicken with minced parsley if you like; I was in too much of a rush. To be very French, serve the peas as their own course, after the chicken, instead of making them share a plate. Toss the remaining lettuce and coarsely chopped parsley leaves with a simple vinaigrette for your salad.</p>"}]}