{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101130brandadelatkes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Kosher", "keywords": ["Chanukah", "cod", "Cook the Book", "hanukkah", "hanukkah latkes", "Jewish holidays", "Joan Nathan", "Kugels Quiches and Couscous", "latkes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Brandade Potato Latkes", "link": "https://www.seriouseats.com/recipes/2010/11/cook-the-book-brandade-potato-latkes-joan-nathan-hanukkah.html", "description": "Since I was on the prowl for Hanukkah recipes in <strong><a href=\"http://joannathan.com/\">Joan Nathan</a></strong>'s <strong><em><a href=\"http://www.amazon.com/Quiches-Kugels-Couscous-Search-Cooking/dp/0307267598/serieats-20\">Quiches, Kugels, and Couscous</a></em></strong>, a good latke was the first order of business. Nathan has three different potato pancake preparations in the book, but for me, these <strong>Brandade Potato Latkes</strong> truly capture the spirit of a <strong>French-accented Hanukkah</strong> celebration. The recipe combines <a href=\"http://en.wikipedia.org/wiki/Brandade\">brandade</a>, a whipped cod spread popular in the South of France with a mashed potato latke.", "totalTime": "", "recipeYield": "8, makes 16 latkes", "recipeCategory": ["Cook the Book", "Fish", "Kosher"], "recipeIngredient": ["2 pounds fresh cod, skin and bones removed", "Sea salt to taste", "½ cup olive oil", "1 cup milk", "5 sprigs fresh thyme, or 1 teaspoon dried thyme", "8 cloves garlic, crushed", "2½ pounds russet potatoes, peeled and halved ", "1 large egg, well beaten", "2 cups matzo meal or fine, dry bread crumbs, plus more if needed for batter", "Freshly ground pepper to taste", "Vegetable oil for frying "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Liberally coat each side of the cod with sea salt, about 3 tablespoons in all, and let rest for 15 minutes.  Rinse the cod with cold water, and pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cod in an 8- by- 12- inch baking dish or rimmed jelly- roll pan.  Pour the olive oil and the milk over it, and lay the thyme sprigs and garlic on top.  Cover with aluminum foil, and cook for 20 minutes, or until the fish is just cooked and begins to flake apart.  When the fish has cooked, remove it, reserving the thyme and the cooking liquid; discard the garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the potatoes in a large pot of cold water and season with 2 tablespoons sea salt.  Bring the water to a boil, and cook the potatoes until a knife passes effortlessly through them.  Strain in a colander and return to the pot, cooking over very low heat for about 4 minutes to get rid of any excess moisture.  Remove from the heat, and mash in the pot until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly beat the egg in a large bowl.  Stir the mashed potatoes, little by little, into the egg.  Add the leaves of the reserved thyme.  Using a fork, flake the cod, and then fold it into the mashed potatoes. If the batter is too stiff, mix ¼ cup to ½ cup of the reserved cod- cooking liquid into the batter.  On the other hand, if the batter does not hold together, add up to ¼ cup matzo meal.  Season with salt and freshly ground pepper if needed. Cover and refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat about ¼ inch of vegetable oil in a large skillet.  Scoop up ¼ or ½ cup of the cod- potato mixture. Form into a ½- inch- thick disk, and roll it in the matzo meal or bread crumbs.  Fry in batches of two or three for about 2 minutes on each side, or until golden.  Drain on paper towels. Repeat with the remaining cod- potato mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat, if necessary, on a baking sheet in a 350&deg;F oven.</p>"}]}