{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100831-dt-ancho-chicken-soup-with-hominy-dumplings.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Mexican", "keywords": ["anchos", "chicken soup", "Dinner Tonight", "dumplings", "masa", "Mexican", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Ancho Chicken Soup with Masa Dumplings", "link": "https://www.seriouseats.com/recipes/2010/08/dinner-tonight-ancho-chicken-soup-with-masa-dumplings-recipe.html", "description": "<strong>This chili-laced soup from Veracruz</strong> uses masa as a chewy dumpling&mdash;a Mexican version of chicken and dumplings. The heat from the chile and a squeeze of lime keep it refreshing enough even in summer, but I'm also filing this away for my next winter cold.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Mexican", "Soups and Stews"], "recipeIngredient": ["6 bone-in chicken thighs", "1/2 cup maseca masa flour plus 1/2 cup water", "2 dried ancho chiles, stems removed", "2 medium tomatoes, cut in half", "1 large onion, peeled and quartered", "3 cloves garlic, peeled", "2 chayote squash, or 2 large potatoes", "1 pound corn kernels", "Small bunch epazote, or substitute cilantro", "Fresh lime juice, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken in a medium pot and cover with cold water. Bring to a boil and simmer while preparing the rest of the ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together the masa and water, adding more of either as needed to create a relatively dry dough.  Roll into small dumplings.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, soak the ancho chiles in hot water for 10 minutes, until softened. Deseed them,  if desired, to lessen the spiciness. While the chiles are soaking, heat a dry, large, preferably heavy skillet over medium-high heat and cook the onions, garlic, and tomatoes, turning only occasionally, until softened and charred all over. (This can also be done under a broiler or on a grill). Discard the tomato skins and combine the tomatoes, garlic, onion, and rehydrated ancho chiles in a blender with a pinch of salt. Purée.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the chile mixture into the pot with the chicken and season to taste with salt and pepper.  Peel and cube the chayote squash or potato and add to the pot along with the masa dumplings and the epazote or cilantro.  When the squash or potato are nearly tender, add the corn. Season with salt, pepper, and lime juice and serve with a garnish of more epazote or cilantro.</p>"}]}