{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100928_GFTuesPumpkinBread.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "fall", "gluten free", "gluten-free bread", "holiday baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.625", "ratingCount": "8"}, "name": "Gluten-Free Tuesday: Pumpkin Bread", "link": "https://www.seriouseats.com/recipes/2010/09/gluten-free-tuesday-pumpkin-bread-recipe.html", "description": "One day I received an email from Rosie. She told me that while she didn't consider herself a baker, she always baked pumpkin bread for her family. This bread became an integral part of her family life. Although she was coping well with her celiac diagnosis, <strong>she really missed the pumpkin bread</strong>&mdash;as did the rest of her family. After a little tinkering in the kitchen, I created a gluten-free version of Rosie's spicy, sweet bread. Here's that recipe. If you have your own recipe you'd like me to adapt, click through to find my contact info so you can send it to me.", "totalTime": null, "recipeYield": "about 16 (Makes two 9-by-5-inch loaves)", "recipeCategory": ["Bread", "Breakfast and Brunch", "Breakfast Sweets", "Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["10 ounces (about 2 1/2 cups) white rice flour", "2 1/4 ounces (about 1/2 cup) cornstarch", "5 teaspoons pumpkin pie spice", "2 teaspoons baking soda", "1 1/2 teaspoons salt", "1 teaspoon xanthan gum", "4 large eggs", "1 cup vegetable oil", "1/2 cup orange juice", "24 ounces (about 3 cups) granulated sugar", "1 (15-ounce) can pure pumpkin (not pumpkin pie filling)", "Gluten-free non-stick cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350&deg;F. Spray two 9-by-5-inch loaf pans lightly with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, whisk together flour, cornstarch, pumpkin pie spice, baking soda, salt, and xanthan gum. In separate bowl, mix together eggs, oil and orange juice. Add sugar and pumpkin. Blend until thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pumpkin mixture to dry ingredients. Mix until ingredients are thoroughly combined and a smooth batter forms (use medium speed on a handheld mixer or medium-low speed on a stand mixer. If mixing by hand, use a balloon whisk and mix for two minutes). Scrape down sides and bottom of bowl once or twice with a rubber spatula while mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter evenly between prepared loaf pans. Bake for 1 hour or until a toothpick inserted into the center of the loaf comes out clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pans from oven and place on a wire rack. Allow bread to cool in the pan for 5 minutes. Remove bread from pans and place directly on wire rack. Allow bread to cool before slicing. Store bread wrapped in plastic wrap at room temperature for 3 to 5 days, or wrap and freeze for up to 3 months.</p>"}]}