{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2010-128396-malted-milk-sandwich-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Baked Explorations", "Cook the Book", "cookie month", "Cookies", "desserts", "holiday baking", "holiday cookies", "holiday sweets", "malted milk", "Matt Lewis", "Renato Poliafito"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Malted Milk Sandwich Cookies ", "link": "https://www.seriouseats.com/recipes/2010/12/malted-milk-sandwich-cookies-recipe.html", "description": "In these <strong>Malted Milk Sandwich Cookies,</strong> vanilla filling is sandwiched in between two chewy, malty, brown sugary cookies. Using a one-inch cookie cutter doubled my cookie output and made for macaron-sized cookies that you could eat at least two or three of with no problem.", "totalTime": null, "recipeYield": "30 sandwich cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the cookies:</strong>", "4 cups all-purpose flour", "3/4 cup malt powder", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 cup (2 sticks) unsalted butter, at room temperature", "1 cup firmly packed dark brown sugar", "1 cup granulated sugar", "2 eggs", "1/3 cup sour cream ", "2 teaspoons pure vanilla extract ", "<strong>For the vanilla filling:</strong>", "5 ounces vegetable shortening, at room temperature", "4 tablespoons (1/2 stick) unsalted butter, cut into small chunks, at room temperature", "3 1/4 cups confectioners’ sugar, sifted", "1/2 teaspoon salt", "1 tablespoon pure vanilla extract ", "1 teaspoon light rum "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cookies:</strong> In a large bowl, whisk together the flour, malt, baking powder, baking soda, and salt. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing mixer fitted with the paddle attachment, beat the butter and sugars together until light and fluffy. Scrape down the bowl and add the eggs, one at a time, beating until each is incorporated. Add the sour cream and vanilla and beat until just incorporated. Add half of the dry ingredients all at once and beat for 15 seconds. Again, scrape down the bowl, then add the remaining dry ingredients and beat until just incorporated. The mixture should come together almost in a ball. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Loosely shape the dough into two balls, wrap them tightly in plastic wrap, and refrigerate for at least 3 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Line two baking sheets with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide each dough ball in half, to make four portions. Place one portion on a lightly flour-dusted work surface and return the other three to the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the dough so that it is ¼ inch thick. The dough will be sticky, so you may have to flip and lightly flour it a few times while you work. Use a 2-inch round cookie cutter to create the sandwich tops and bottoms, and transfer them to the prepared baking sheets, leaving about 1 inch of space around each cookie. Extra dough scraps can be refrigerated and rerolled once more, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies for 10 to 12 minutes, or until they are just slightly browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the baking sheets on wire racks to cool for 5 minutes. Use a spatula to transfer the cookies to the racks to cool completely. While the cookies cool, prepare the filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the vanilla filling:</strong> In the bowl of a standing mixer fitted with the paddle attachment, beat the shortening and butter until lump free and smooth. Add the sugar in three parts, mixing each part until just combined. Add the salt, vanilla, and rum and beat again for 10 seconds. The filling should be thick but spreadable (like the inside of an Oreo). If it is too thick, add a drop or two of water as needed. Keep adding water to reach desired consistency, but do not add too much water or the filling will be too thin.</p>\n\n<p>Alternatively if the mixture is too thin, add a few tablespoons of confectioners’ sugar.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the malted milk sandwich cookies:</strong> Use a pastry bag or a small spoon to apply about 2 tablespoons of filling to the flat side of a cookie. Place another cookie, flat side down, on top. Press down slightly so that the filling spreads to the edges of the cookie. Repeat until all the sandwich cookies are made. Let them set up for about 15 minutes before serving. Store the cookies at room temperature in an airtight container for up to 3 days.</p>"}]}