{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100826-dt-sausage-kale-and-sungold-pasta.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "kale", "pasta", "sausage", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Fusilli with Sausage, Kale, and Sungold Tomatoes", "link": "https://www.seriouseats.com/recipes/2010/08/dinner-tonight-fusilli-with-sausage-kale-and-sungold-tomatoes-recipe.html", "description": "One of my pasta staples in the fall and early winter is the combination of sweet Italian sausage and earthy kale. So what was I doing cooking this in August?  Because I have a Sungold tomato plant in the backyard, which is considered by some to be the best of all cherry tomatoes, and inspiration struck: The sweet, intensely bright flavor of tomatoes would be the perfect acidic foil in this dish.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Kale", "Pasta"], "recipeIngredient": ["1 pound fusilli or other short pasta", " 1 large bunch kale, leaves chopped and stems discarded", "1 tablespoon olive oil", "3/4 pound sweet Italian sausage, removed from skins and crumbled", "1 clove garlic, minced", "2 tablepoons fennel seeds, crushed in a mortar and pestle (optional)", "1 teaspoon red pepper flakes", "12-15 whole cherry tomatoes, such as Sungolds", "1/2 cup Parmesan cheese, plus more for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring two pots of salted water to boil: 1 for the kale, 1 for the pasta. Cook the kale in boiling water until tender, then drain well and set aside. Cook the pasta until al dente, reserving 1 cup of the pasta cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat the olive oil in a large skillet over medium heat and crumble the sausage into the skillet. Cook, breaking up well with a wooden spoon, until the fat is rendered and the meat is starting to brown.  Add the garlic, red pepper flakes, and fennel seeds and continue cooking until the sausage is golden brown and caramelized.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the blanched kale and stir to coat well. Cook for 2-3 minutes, then add the cherry tomatoes and cook until they just begin to lose their shape. Add the drained pasta, tossing to coat in the fat, adding pasta water and Parmesan as necessary to create a silky sauce. Season to taste with salt and pepper and divide among bowls, topping with remaining Parmesan.</p>"}]}