{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100922_harvest_eggyzucchini.jpg", "author": {"@type": "Person", "name": "helenjane"}, "recipeCuisine": "", "keywords": ["eggs", "frittata", "pie", "Serious Entertaining", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eggy Zucchini Pie", "link": "https://www.seriouseats.com/recipes/2010/09/eggy-zucchini-pie-recipe.html", "description": "This creamy, eggy pie brings the most bountiful vegetable in our garden to new heights. This frittata-like dish is dense enough to fill a belly. It's also cheesy and creamy enough to please the pickiest eaters. Note: To chiffonade basil,...", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cheese", "Eggs", "Gluten-Free", "Vegetarian", "Zucchini"], "recipeIngredient": ["2 medium zucchini (about 1 1/2 pounds), thinly sliced crosswise", "8 eggs", "2 tablespoons heavy cream", "1/4 cup plus 2 tablespoons grated Parmesan, divided", "1 medium sweet onion (like Vidalia), sliced thin (about 1 1/2 cups)", "1/4 cup olive oil", "2 small cloves garlic, minced or grated on microplane (about 1 1/2 teapsoons)", "1/2 cup basil chiffonade (see note)", "Kosher salt and freshly cracked black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine eggs, cream and 1/4 cup Parmesan cheese in blender jar. Blend on high speed until combined, about 10 seconds. Set aside. Adjust broiler rack 6-inches away from element and preheat broiler to medium-high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a 10-inch heavy-bottomed nonstick or cast-iron skillet over a medium-high heat until shimmering. Add the sliced onions and cook, stirring frequently, until they begin to soften, about 2 minutes. Add garlic and cook, stirring frequently, until fragrant, about 1 minute. Add the zucchini and cook, stirring frequently until tender but not soft, about 2 minutes. Add basil and stir to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour egg mixture into sauté pan with the onions, garlic and zucchini and let sit until partially set, about 1 minute. Sprinkle with remaining 2 tablespoons Parmesan. Place pan under broiler and cook until cheese begins to brown and eggs have mostly firmed up, about 1 minute. Remove from broiler and allow to rest at room temperature until the eggs are fully set all the way through but still tender, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Loosen edges using a thin metal spatula and gently shake until frittata slides freely in pan. Place inverted plate on top of skillet. Holding both skillet and plate, flip frittata out onto the plate. Slice and serve immediately.</p>"}]}