{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100427stuffedpotato.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["cauliflower", "Eat for Eight Bucks", "potatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Eat for Eight Bucks: Twice-baked Potatoes and Cauliflower Vinaigrette", "link": "https://www.seriouseats.com/recipes/2010/04/eat-for-eight-bucks-twice-baked-potatoes-and.html", "description": "This humble but delicious dinner was designed to meet two requirements: after a weekend of eating out with visiting parents, I needed an all-vegetable meal, and at the head of a busy week, I needed to be able to prepare it ahead of time.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Eat for Eight Bucks", "Vegetarian"], "recipeIngredient": ["2 pounds baking potatoes, scrubbed and pricked with a fork", "1 bunch kale or other leafy greens, washed, center ribs removed", "3 tablespoons butter, softened", "1 cup grated sharp cheddar cheese", "Salt", "Pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the potatoes in a 400 degree oven. This will take about an hour, unless your potatoes are especially large or small, in which case you should adjust the cooking time accordingly. When the potatoes are baked, allow them to cool and adjust the oven temperature to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes bake, cook the kale in boiling salted water until it is tender, about 10 minutes. Drain in a colander; when cool enough to handle, squeeze out most of the liquid and chop the kale finely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are cool enough to handle, slice them in half and scoop the flesh into a bowl, leaving about 1/4 inch attached to the skin. Mash the flesh roughly with a fork and then mash in the butter, cheese, chopped kale, and salt and pepper to taste (I used 5 pinches of salt and 1/4 teaspoon pepper). Stir until evenly mixed; if you happen to have sour or heavy cream on hand, stir in a spoonful of that, too. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pack the potato skins full of stuffing and put them on a rimmed baking sheet. Bake immediately for 25 minutes or cover with plastic wrap, refrigerate, and bake later at 350 for 25-35 minutes, until heated through.</p>"}]}