{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201009121-dt-crisp-chipotle-shrimp-with-corn.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chipotle", "corn", "Dinner Tonight", "panko", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Crisp Chipotle Shrimp with Corn and Scallions", "link": "https://www.seriouseats.com/recipes/2010/09/dinner-tonight-crisp-chipotle-shrimp-with-corn.html", "description": "This recipe is a little bit Mexican (the chipotle), a little bit French (the gratin-style cooking), and little bit Japanese (the panko-coated shrimp). Half of the <strong>corn is puréed as a base</strong> and then tossed with scallions, a little mayonnaise, and adobo sauce. Piled atop this creamy base are the shrimp, which get a bath in the chipotle mayo before picking up the breadcrumbs.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight"], "recipeIngredient": ["1/3 cup mayonnaise", "2 teaspoons finely chopped chipotle chiles in adobo plus 1 teaspoon adobo sauce", "3/4 teaspoon salt", "4 cups corn (cut from about 7 ears)", "1/3 cup water", "4 scallions, thinly sliced", "1 pound peeled and deveined large shrimp (about 21 to 25 per pound)", "1 to 1 1/2 cups panko (Japanese bread crumbs)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 475°F. Whisk mayonnaise, chipotle chiles plus sauce, and the salt in small bowl. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1 1/2 cups corn with water and two tablespoons of chipotle mayonnaise in bowl of food processor. Pulse until coarse puree is formed, about 8 to 10 one-second pulses.  Transfer mixture to 2-quart ovenproof dish, then stir in the remaining corn and scallions. Transfer to the oven and cook until corn is tender, 20 to 25 minutes, </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toss shrimp with remaining chipotle mayonnaise. Add panko to large bowl. Toss mayo-coated shrimp with the panko until evenly coated, then spread on piece of parchment paper on a baking sheet on a single layer. Bake until golden and just cooked through, about 18 minutes. If corn is finished before shrimp, return to oven during last 2 minutes of shrimp cooking time to reheat. Place shrimp on top of corn, and serve immediately.</p>"}]}