{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101202-dt-roasted-chicken-bread-with-carrots-and-parsnips.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Dinner Tonight: Garlic-Roasted Chicken with Carrots and Parsnips", "link": "https://www.seriouseats.com/recipes/2010/12/dinner-tonight-garlic-roasted-chicken-with-carrots-and-parsnips-recipe.html", "description": "If you buy split chicken breasts with the bone in and skin still on, they can be wonderfully flavorful, especially in recipes like this one from Jennifer Rubell's <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/0060778474/serieats-20\">Real Life Entertaining</a></em> where they're roasted with carrots, parsnips, and two entire heads of garlic. The chicken-y juices and fat from the skin give the vegetables incredible flavor, while the garlic aroma permeates the entire dish.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["4 bone-in skin-on split chicken breasts (6 to 8 ounces each)", "7 carrots, peeled and cut into 2-inch sticks", "7 parsnips, peeled and cut into 2-inch sticks", "2 whole heads of garlic, broken into unpeeled cloves, plus three cloves, minced", "2/3 cup olive oil", "2 teaspoon kosher salt", "1 teaspoon freshly ground black pepper", "1 tablespoon picked thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F. Line sheet pan with aluminum foil and spread out chicken skin side up, carrots, parsnips, and garlic cloves in single layer.  Drizzle everything with olive oil, then sprinkle evenly with salt, pepper, and thyme leaves. Rub chicken pieces with minced garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer sheet pan to oven and roast until chicken registers 155°F on instant read thermometer and vegetables are tender, about 40 minutes, basting the chicken with the pan juices and tossing the vegetables once or twice during cooking. Cooking time may vary depending on size of chicken breasts. Monitor closely and add or subtract time as necessary.  Allow chicken to rest 10 minutes after removing from oven and serve immediately with roasted vegetables.</p>"}]}