{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100419_shrimppoboy2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "New Orleans", "oysters", "po boys", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: The Best Oyster Po' Boy Outside of New Orleans", "link": "https://www.seriouseats.com/recipes/2010/04/oyster-po-boy-recipe.html", "description": "It's such a simple sandwich, yet when you sit down with one of these, it's hard to imagine anything tasting better. The oysters are tossed in a flour and cornmeal mixture, then fried for just under a minute so the crust is crackly and golden brown, yet the oysters are still gushing with juice. <strong>The bread is important. It needs to be soft, but still have a nice crackly texture.</strong> Then it's just iceberg lettuce and mayonnaise.", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner Tonight", "Sandwiches"], "recipeIngredient": ["1 egg ", "1/2 cup milk ", "1 1/2 teaspoon salt ", "1 1/2 teaspoon black pepper", "1/2 cup flour ", "3/4 cup yellow cornmeal", "1 teaspoon cayenne", "18 small shucked oysters ", "vegetable oil for frying", "Soft French or Italian bread (about 10 inches long)", "mayonnaise ", "1 cup thinly sliced iceberg lettuce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While that's warming up, whisk together the egg, milk, 1/2 teaspoon salt, 1 teaspoon black pepper in a bowl. In a shallow dish, combine the flour, 1/4 teaspoon salt, and the rest of the black pepper. In a second shallow dish, whisk together the cornmeal, remaining salt, and the cayenne. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drag each oyster first through the flour, then the milk, and finally in the cornmeal. Place coated oysters on a wire rack and repeat until all are finished. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour enough oil to come about 3 inches high in a heavy bottomed pot. Turn the heat to medium-high, and bring the temperature to 375°F. Adjust the temperature to maintain this temperature.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oil is warming up, slice the bread in half crosswise, and then horizontally, so you'll have two five-inch sandwich segments. Place the tops back on the bottoms and then stick these in the oven until warm, about 5 minutes. When done, remove and set aside. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the oysters in batches for 45 seconds to 1 minute. Drain on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread a thin layer of mayonnaise on to the cut sides of the bread, top with lettuce, and then some of the oysters. Serve.  </p>"}]}