{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100627baked%20blintz.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["blintzes", "blueberries", "brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Baked Blintz Cake with Fresh Blueberry Sauce", "link": "https://www.seriouseats.com/recipes/2010/06/sunday-brunch-baked-blintz-cake-with-fresh-blueberry-breakfast-recipe.html", "description": "Instead of flipping endless pancakes while everyone else eats, please a crowd with Ina Garten's <strong>baked blintz cake:</strong> two thin layers of cake surrounding a layer of sweet cheese filling and topped with blueberry sauce.", "totalTime": "", "recipeYield": "a 9 x 13 cake", "recipeCategory": ["Blueberry", "Breakfast and Brunch"], "recipeIngredient": ["3/4 cup fresh orange juice (from 3 oranges)", "1 tablespoon cornstarch", "1 cup plus 2 tablespoons sugar", "2 pounds fresh blueberries", "4 teaspoons grated lemon zest (I used 3 lemons)", "3 tablespoons fresh lemon juice", "1 1/4 cups whole milk", "2 tablespoons sour cream or plain yogurt", "4 tablespoons melted butter", "1 1/3 cups flour", "1 tablespoons baking powder", "1 1/2 teaspoons vanilla", "6 eggs", "24 ounces (3 cups) ricotta ", "8 ounces mascarpone", "1 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the blueberry sauce. Put the orange juice, cornstarch, and 2/3 cup sugar in a medium saucepan and boil until translucent and thickened. Then stir in the blueberries, bring back to a bubble, and simmer 4-5 minutes. Turn off the heat, stir in 1 teaspoon lemon zest and 1 tablespoon lemon juice, and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cake. Preheat the oven to 350 and grease a 9 x 13 pan. Use a blender, food processor, or simply a whisk to blend until smooth the milk, sour cream or yogurt, melted butter, flour, baking powder, 1 teaspoon vanilla, 2 tablespoons sugar, and 4 eggs. Pour half of the batter into the greased pan and bake 10 minutes or until set. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the bottom layer of cake bakes, make the cheese filling. Use a whisk to blend thoroughly the ricotta, mascarpone, and salt with the remaining 2 eggs, 1/3 cup sugar, tablespoon lemon zest, 2 tablespoons lemon juice, and 1/2 teaspoon vanilla. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the bottom layer of cake comes out of the oven, carefully spread the cheese filling over it, completely covering the cake with an even layer of cheese filling. Then dollop the remaining batter over the cheese and gently use a spoon to spread the batter evenly. Bake 35-40 minutes until the top layer of cake is lightly golden and the filling is set. (I had to bake mine 20 extra minutes, perhaps because I did not have a 9 x 13 pan to use.) Let stand 10-15 minutes before cutting. Serve warm or chilled with blueberry sauce.</p>"}]}