{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100323splitpea_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Curried Yellow Split Pea Soup", "link": "https://www.seriouseats.com/recipes/2010/03/eat-for-eight-bucks-curried-yellow-split-pea-soup-recipe.html", "description": "Since it was a soup-heavy winter here at Eat for Eight Bucks, I meant to stay away from soup for a while. Unfortunately, I just discovered one <strong>so easy and inexpensive</strong> that I feel I have no choice but to share it now, before we forget our stock pots and fire up our grills.", "totalTime": "", "recipeYield": "4 generously", "recipeCategory": ["Eat for Eight Bucks", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["1 pound (about 2 cups) yellow split peas", "3 tablespoons butter", "1 large onion, chopped", "4 garlic cloves, chopped", "2 teaspoons curry powder (I used 1 teaspoon cumin, 1/2 teaspoon ginger, 1/2 teaspoon garam masala, and a dash of cayenne)", "1/2 teaspoon turmeric", "3 carrots, peeled and chopped into large chunks", "2 teaspoons kosher salt", "Plain yogurt and chopped cilantro to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the peas and put them in a large bowl. Pour over hot water to cover by 1 inch and let stand for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter in a heavy, large saucepan over medium heat. Saute the onion until translucent, about 5 minutes. Add the garlic, curry powder, and turmeric and stir for 1 minute. Drain the peas and add to saucepan along with 7 cups water, carrots, and salt. Bring to boil. Reduce heat to very low, cover, and simmer until the peas are very tender and beginning to fall apart, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree the soup until smooth. (I just fished out the carrot chunks and puréed them with about half of the soup, leaving the rest slightly chunky. If you want to avoid the blender altogether, you could dice the carrots before adding them to the pot instead of leaving them in chunks.) Season with salt and pepper to taste. Serve, topping each bowl with a spoonful of yogurt and a sprinkle of cilantro. </p>"}]}