{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100504friedrice.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "fried rice", "pork", "pork fried rice", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Eat for Eight Bucks: Pork Fried Rice", "link": "https://www.seriouseats.com/recipes/2010/05/eat-for-eight-bucks-pork-fried-rice.html", "description": "When you only have dinner delivered once or twice a year, you have to develop your own versions of fondly remembered takeout staples. Chinese food meant pork fried rice for me when I was growing up, and it took me many years to work out a home version that lived up to my memories of lip-smacking, meaty, salty abundance.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Eat for Eight Bucks", "Fried Rice", "Pork"], "recipeIngredient": ["1 cup uncooked white rice (or 3-4 cups cooked rice)", "1 1/2 pounds boneless pork butt or shoulder, cut into 1 1/2 inch cubes", "1/4 cup minced onion", "1 tablespoon ground ginger", "1 tablespoon sugar", "4 tablespoons soy sauce, plus more at table", "1 tablespoon plus 1 teaspoon minced garlic", "Salt", "Pepper", "Fish sauce (optional)", "1 pound baby bok choy", "3 to 4 tablespoons peanut or vegetable oil", "2 tablespoons minced scallion", "1/4 teaspoon crushed red pepper flakes", "2 eggs, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>A day in advance, if possible, cook the rice. Toss the pork in a bowl with the onion, ground ginger, sugar, 2 tablespoons soy sauce, 1 tablespoon minced garlic, 1 teaspoon salt, and 1/4 teaspoon ground pepper (and a few shakes of fish sauce, if you like). Cover the bowl and refrigerate the pork and the rice overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, preheat the oven to 375. Spread the pork in a roasting pan or on a rimmed baking sheet (it’s find if it’s crowded—it will shrink quite a lot). Bake for 45 minutes to 1 hour, stirring and shaking occasionally, until the pork is browned crispy on all sides. Remove pork from the pan with a slotted spoon and spread on paper towel to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam and roughly chop the bok choy. When cool enough to handle, chop the pork bits into smaller pieces, about 1/2 inch. Get all ingredients out and have them at the ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a Dutch oven or large, deep skillet over high heat for about a minute. Add the oil and wait about a minute more (but do not let the oil smoke). Add the scallion, red pepper flakes, and remaining teaspoon garlic and stir for about a minute. Lower the heat a bit and add the rice, breaking up any lumps as you go. Stir for about a minute, then toss in the pork bits and bok choy and stir for 2 to 3 minutes more more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a well in the center of the rice, scraping rice up against the sides of the pot until you can see its bottom. If you are very worried about sticking, add a bit more oil; I just let the eggs stick a little. Pour the eggs into the well and scramble them there. When they are cooked to your liking, quickly incorporate them into the rice with your spoon. Turn off the heat, stir in the remaining 2 tablespoons soy sauce, and serve immediately.</p>"}]}