{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/9.27.10bonbonjovi1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bonbons", "Cakespy", "chocolate", "confections", "holiday baking", "music", "peanut butter", "truffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Bonbon Jovi Truffles", "link": "https://www.seriouseats.com/recipes/2010/09/cakespy-bonbon-jovi-truffles-recipe.html", "description": "Bonbon Jovi Truffles: they may be slippery when wet, but they don't give love a bad name.", "totalTime": "2 hours", "recipeYield": "30", "recipeCategory": ["Cakespy", "Nuts"], "recipeIngredient": ["2 cups peanut butter", "12 tablespoons (1 1/2 sticks) butter", "4 1/2 cups confectioners' sugar", "3 cups puffed rice cereal", "8 to 10 ounces semisweet chocolate, coarsely chopped", "1 cup white chocolate chips", "Edible ink markers, or writing icing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt peanut butter and butter in a medium saucepan over low heat. Stir occasionally with wooden spoon until mixture is fully combined, smooth, and warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large separate bowl, stir together the confectioners' sugar and cereal. Pour peanut butter mixture over cereal mixture. Using hands, blend well, until it is easy to clump together and form balls. Form into roughly 30 balls about 1 1/2 inches in diameter and place on parchment-lined rimmed baking sheet. Chill in freezer for at least one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt chocolate in bowl set over simmering water, stirring occasionally with rubber spatula until melted and smooth (alternatively, heat in microwave-safe bowl at 15 second intervals, stirring with rubber spatula, until melted and smooth)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chilled bonbon centers from the freezer, and using a toothpick, dip each one in chocolate mixture, turning until coated. Remove toothpicks and place on waxed paper to set. Repeat with the remaining bonbons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare Jovi toppers. Using a double boiler or microwave, melt white chocolate chips (see directions in step 3). Cut 12-inch by 20-inch piece of wax paper. Fold in half crosswise to crease, then open again. Pour melted mixture onto half of prepared wax paper. Fold other half on top and use hands or a rolling pin to gently flatten chocolate. Let set until you can easily lift waxed paper up, about 5 minutes. Using small heart cookie cutter, press fully into white chocolate to form imprints but do not attempt to remove cutouts. Let set until white chocolate is fully cooled before removing, using small, sharp knife to assist (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top truffles with white chocolate hearts and serve.</p>"}]}