{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20101116%20ethereal%20crisps%202.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["appetizers", "bread baking", "crackers", "crisps"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Ethereal Crisps", "link": "https://www.seriouseats.com/recipes/2010/11/bread-baking-ethereal-crisps-appetizers-crackers.html", "description": "You can use these crisps for appetizers, to <strong>accompany a cheese or dip</strong>, or put them in the bread basket to add a little variety. They're light and airy, and people will be amazed that you made your own crackers, particularly crackers that are this amazingly thin.", "totalTime": "about 1 hour 20 minutes", "recipeYield": "", "recipeCategory": ["Bread Baking"], "recipeIngredient": ["4 1/2 ounces (1 cup) white whole wheat flour", "6 3/4 ounces (about 1 1/4 cups) bread flour", "1 cup cooked grits, cooled slightly", "1 teaspoon salt", "3 tablespoons warm water (more as needed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flours, grits, and salt into food processor and pulse several times to distribute ingredients. With processor running, add water through feed tube slowly, until mixture comes together in ball. You might need more or less water, depending on how wet your grits were. Don't add water too quickly, or you could add too much and end up with a sticky dough that requires a lot more flour to compensate. Continue processing until dough is relatively smooth and elastic. It will be bumpy from grits, but dough should be smooth and stretchy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set dough aside while your oven preheats to 550°F. For best results, use pizza stone. Alternatively, use baking sheet preheated in oven. When oven has heated, divide dough into 12 pieces. Keep covered with plastic wrap. Flour work surface and roll first ball until it is very thin roughly circular, about 8 inches in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush off excess flour and carefully transfer first piece to hot baking stone. Set timer for one minute. Flip cracker over after first minute. It should be somewhat stiff but still pale. Set timer for another minute and check cracker. It should be almost crisp enough, and possibly starting to color. Set timer for another minute and check cracker at intervals. Once it starts browning, it goes fast, so check time and use that to time remaining crackers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you're fast enough, you should be able to roll the next cracker as the previous one bakes. Let each cracker cool on rack before you begin stacking them. Store completely cooled crackers in covered container at room temperature.</p>"}]}