{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100812-rasam.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Indian", "keywords": ["amchoor", "amchur", "Indian", "mango powder", "rasam", "soups", "Spice Hunting", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rasam, Indian Tomato Soup", "link": "https://www.seriouseats.com/recipes/2010/08/rasam-indian-tomato-soup-recipe.html", "description": "[Photograph: Max Falkowitz] Rasam is a thin tomato soup often served as a dip or broth in Indian cuisine. This is very much my own version, with a flavor inspired by what's often found in restaurants, but bulked up by...", "totalTime": "40 minutes", "recipeYield": "4-6", "recipeCategory": ["Indian", "Soups and Stews", "Tomato", "Vegetarian"], "recipeIngredient": ["3 pounds plump, ripe tomatoes, cut into small dice or roughly puréed", "8 curry leaves", "1 green chile, such as a serrano, sliced", "4 cloves of garlic, minced", "2 teaspoons of amchoor, divided", "Pinch of asafoetida ", "1 teaspoon of cumin seeds", "2 teaspoons of coriander seeds, ground", "1/2 teaspoon of <a href=\"http://www.seriouseats.com/2010/08/spice-hunting-charnushka-nigella-onion-seed.html\">charnushka</a>", "2 teaspoons of black mustard seeds", "1 teaspoon of sweet paprika", "1 tablespoon of dark brown or raw sugar, optional", "3 tablespoons of ghee or vegetable oil", "Cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your soup pot on medium-high. Separate your spices into three groups that can be added to the pot easily: mustard seeds, \"wet\" spices (the curry leaves, chile, and garlic), and the dry spices (reserving a teaspoon of the amchoor for later).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the ghee or oil and let it heat till it shimmers and a cumin seed cracks instantly. Then add the mustard seeds and wait for them to pop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the mustard seeds are popping everywhere, add the wet spices and stir to coat with oil. A few seconds later, add the dry spices, and stir to coat again. When the pot is intensely aromatic, add the tomatoes. It's important to do this quickly, so the spices get just toasted, but don't start to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the soup to a boil, then reduce to a moderate simmer. Let it cook for about 20 to 30 minutes, tasting often to add seasoning, any necessary sugar (which can make a huge difference in tomato dishes), and any additional water (I added about 2 cups towards the end of simmering). The broth should be quite thin but still flavorful. After 20 to 30 minutes, the spices should have married well together. Shortly before serving, stir in the remaining amchoor. Garnish with cilantro and serve as an appetizer or as a dipping broth for fritters.</p>"}]}