{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100301-beef%20stew.JPG", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Aromatic Beef Stew", "link": "https://www.seriouseats.com/recipes/2010/03/slow-cooked-beef-stew-recipe.html", "description": "Try out the vegetable-sweating technique in this recipe for a slow-cooked beef stew that smells insanely good as it cooks. In addition to the aromatic vegetables, the stew is perfumed by <strong>fragrant spices, herbs, and red wine.</strong>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Beef", "Slow Cooker", "Soups and Stews"], "recipeIngredient": ["1 teaspoon black peppercorns", "10 allspice berries", "10 juniper berries", "4 cloves", "3 bay leaves", "Pinch freshly grated nutmeg", "2 tablespoons kosher salt", "3 pounds of well-marbled beef, cut into 2-inch cubes", "3 tablespoons grape seed oil", "5 tablespoons olive oil", "1/2 bottle or more of dry red wine", "1 smallish onion, cut into 1/4-inch dice", "1 carrot, cut into 1/4-inch dice", "1 stalk celery, cut into 1/4-inch dice", "5 cloves garlic, peeled, smashed, and roughly chopped", "2 tablespoons tomato paste", "2 cups chopped tomatoes, in their juice", "1 large sprig of fresh thyme", "1 large onion, cut into 1/2-inch wedges", "2 carrots or parsnips, cut into large chunks (but small enough to fit into a mouth)", "2 stalks celery, cut into large chunks", "3 turnips, cut into large chunks", "3 tablespoons chopped fresh flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grind peppercorns, allspice, juniper berries, cloves, and bay leaves to a fine powder. Blend with ground nutmeg and salt in a small dish. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a deep skillet or Dutch oven over high heat. Add 1 tablespoon of grape seed oil and 1 tablespoon of olive oil (this combination has a higher smoke point than just olive oil, but retains the nice aroma of olive oil).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the minute or so that the oil heats up, season on all sides only the beef that will be seared in the first batch (about a third of the beef cubes; if salted meat sits for a while before being seared, it will start releasing water and won't brown as well). When the oil is hot, add the seasoned beef to the skillet, making sure the pan is not crowded.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sear the beef on all sides, adjusting the heat as necessary. When beef is nicely browned, remove the pieces and set them aside in your slow cooker pot. If the bottom of the skillet has very dark bits, deglaze with wine and add the liquid to the browned meat. Continue seasoning and searing the other batches of meat. Deglaze the skillet with wine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons of olive oil to the pan and add the carrots, onions, and celery, along with a good pinch of the seasoned salt. After the first minute or two, add the garlic. Sweat the vegetables until softened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in tomato paste and cook for about a minute. Add 1 cup of the chopped tomatoes and juice. Scrape the bottom of the pot to deglaze. Bring the liquid to a simmer. Pour the mixture into the slow cooker over the beef. Add enough wine to cover the beef at least halfway. Add the sprig of thyme. Cover the slow cooker and cook on low for 5 to 7 hours, or until beef is fork tender. In the last hour or two of cooking, add the rest of the vegetables. And finally, in the last hour, add the rest of the chopped tomatoes and sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove thyme sprig and garnish with parsley. Serve over egg noodles or rice, or simply with some crusty bread.</p>"}]}