{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100928%20caramel%20apple%20bread%20prepared%20pan.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["apples", "baking", "bread", "bread baking", "fall", "holiday baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Bread Baking: Caramel Apple Bread", "link": "https://www.seriouseats.com/recipes/2010/09/bread-baking-caramel-apple-bread-recipe.html", "description": "I take my bread inspiration from many places. Lately I've been working on a recipe for a savory apple bread (thanks to conversations with <a href=\"http://www.seriouseats.com/user/profile/JerzeeTomato\">JerzeeTomato</a> on Facebook). For the two weeks it took me to complete that recipe, my house smelled like baked apples. I was happy with the results. But it wasn't enough. Once I starting thinking about the flavors of a caramel apple&mdash;the fresh tartness of the apple itself, covered with caramel and dipped in nuts&mdash;I had a new goal: sweet <strong>Caramel Apple Bread</strong>.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Apple", "Bread", "Bread Baking", "Breakfast and Brunch", "Breakfast Sweets"], "recipeIngredient": ["1 cup apple cider", "2 teaspoons instant yeast", "13 1/2 ounces (about 2 1/2 cups) bread flour, divided, plus more as needed", "2 tablespoons sugar", "1 1/2 teaspoons salt", "1/2 pound Jonathan apples (about 2 medium)", "2 tablespoons olive oil", "About 7 ounces dulce de leche", "1/2 cup peanuts, chopped", "1 tablespoon butter, softened (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the apple cider and instant yeast. Set aside until foamy, about 10 minutes. Add about 2/3 of the bread flour and stir to combine. Cover the bowl with plastic wrap and set aside for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining bread flour, sugar, and salt. Knead with the dough hook on low speed until the dough starts to become elastic, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel one apple, and working quickly so the apple doesn't go brown, grate it directly into the bowl, stopping at the core. Continue kneading dough on low speed until the apple is completely incorporated. Add flour as needed, until dough is supple and elastic, but no longer sticky (about 1/4 cup). Add olive oil and continue kneading until the oil is completely incorporated. Form the dough into a ball, drizzle with a bit of olive oil, and return to bowl. Cover bowl with plastic wrap and set aside until doubled in volume, about one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325 degrees. Spray 9-inch by 5-inch loaf pan with nonstick cooking spray or line with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add dulce de leche and peanuts to small nonstick pan and heat slowly on medium-low heat. As the caramel begins to melt, peel remaining apple, core, and cut into 1/4-inch dice. Add to caramel immediately before apple begins to brown. Cook on low for one more minute and remove from heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto floured work surface. Knead it briefly and form into rough square. Using rolling pin, roll dough into approximate 9-inch by 16-inch rectangle. Spread the caramel mixture onto the dough leaving 1/2-inch border along long edges and 2-inch border along short edges (rewarm caramel sauce as necessary if it is not spreadable)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting with one of the shorter ends, roll up dough jellyroll style, tucking in sides as you go and ending at the short end hat was left uncovered. Seal seam and the ends, and place in the prepared loaf pan. Cover loaf with plastic wrap and set aside to rise until doubled, about 40 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover loaf, slash as desired (see note), and bake at 325 degrees until golden brown, about 45 minutes.  For a soft brown crust, take the loaf out of the oven about five minutes before it is finished baking, and spread butter over top of loaf. Return loaf to oven and bake for the final five minutes. Cool loaf for five minutes in the pan, turn it out, transfer to a wire cooling rack, and let it cool completely before slicing.</p>"}]}