{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100313ChamomileScallops610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["chamomile", "scallops", "seafood", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Chamomile): Seared Sea Scallops with Chamomile Beurre Blanc", "link": "https://www.seriouseats.com/recipes/2010/03/seared-sea-scallops-with-chamomile-beurre-blanc-seafood-recipe.html", "description": "Sweet sea scallops enveloped in the fresh, mellow tang of a chamomile beurre blanc.  It is fancy, but also unusual.  The perfect way to start a celebratory supper.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Other Seafood", "The Secret Ingredient"], "recipeIngredient": ["1 shallot, chopped", "1 tablespoon white wine vinegar", "1/3 cup dry white wine", "1 tablespoons dried chamomile flowers", "1 tablespoon cream", "7 tablespoons unsalted butter, cubed and cold, plus 1 tablespoons", "4 large sea scallops"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin with the beurre blanc.  In a medium saucepan, place the shallots, vinegar, wine, and chamomile.  Bring to a low simmer, and cook until liquid is just evaporated, on a low flame, careful not to let it go so long that the pot burns.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 1 tablespoon of butter in a small skillet over medium heat.  Season the scallops on both sides with salt and pepper.  Sear each scallop on the first side until it is golden brown and then flip over, about 5 to 6 minutes in total, until the scallop is firm, opaque, and just cooked through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the reduction is \"dry,\" either keep the flame on very low heat, or take the pan off the heat altogether, using the residual heat from the pan to melt the butter.  First add the cream.  Then, whisk in bits of the remaining butter a few at a time, whisking continuously, so that as the butter softens, it does not melt, but stays opaque and emulsifies.  Strain the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Plate the scallops on a bed of beurre blanc.  Garnish with some fronds of chervil and a few dried chamomile flowers.  Serves one as a main, two as a starter.  Double the recipe for larger servings.</p>"}]}