{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100907%20monkey%20bread%20formed.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "Monkey Bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Bread Baking: Savory Monkey Bread", "link": "https://www.seriouseats.com/recipes/2010/09/bread-baking-savory-monkey-bread-recipe.html", "description": "It's a funny name, and it's a fun loaf of bread. I don't know what it is about pull-apart loaves, but they invite nibbling. People who would normally eat one slice of bread often find themselves unable to resist pulling off just one more little bit. And then one more. And then this little piece is dangling ... this bread simply doesn't last long. When most people think of monkey bread, they think of the cinnamon-sugar version, but <strong>there's no reason why you can't make an herby, savory version</strong> that's perfect for lunch, brunch, or dinner.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch"], "recipeIngredient": ["1 cup milk, scalded and cooled to lukewarm", "1 teaspoon sugar", "2 cups (10 ounces) all purpose flour", "1/2 cup (2 1/2 ounces) white whole wheat flour", "2 1/2 teaspoons active dry yeast", " 1 teaspoon salt", " 8 tablespoons (1 stick) unsalted room temperature butter, divided", "vegetable oil or nonstick cooking spray", "1 clove garlic", "1 teaspoon dried rosemary", "1 teaspoon dried thyme", "1/2 teaspoon sweet paprika"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of stand mixer fitted with dough hook attachment, combine milk, sugar, all-purpose flour, and yeast. Mix thoroughly, then cover bowl with plastic wrap and set aside at room temperature for one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add white whole wheat flour and knead until dough is smooth and elastic. Add salt and 4 tablespoons (1/2 stick) of the butter and continue kneading until all of the butter has been incorporated and the dough is smooth, shiny, and elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form dough into ball and coat with thin layer of oil or cooking spray. Return to bowl. Cover with plastic wrap and set aside to rise until the dough has doubled, 40 minutes to one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put garlic, rosemary, thyme, and paprika in bowl of food processor and pulse until the garlic has been chopped to small bits and the herbs are well mixed, scraping down bowl with rubber spatula as necessary, about 10-12 one-second pulses. Add remaining four tablespoons (1/2 stick) butter to herbs and process until thoroughly combined, about 10 seconds. Set mixture aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 325 degrees. Remove dough from bowl and knead for 10 seconds. Using bench scraper, divide in half. continue dividing each half in half until you have 32 even pieces. Roll pieces into balls. Using hands, coat each ball with butter mixture and add to greased 8x8 glass baking dish, cake pan, or bundt pan. Balls should be stacked together, but not compressed. Cover with plastic allow to rise until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the loaf is deep golden brown, about 35 minutes. Serve hot, warm, or cooled.</p>"}]}