{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100901indonesiangrilledribs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grill", "grilling", "Indonesian", "Planet Barbecue", "pork", "recipe newsletter", "rib", "ribs", "Steven Raichlen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Baby Backs with Sweet Soy Glaze", "link": "https://www.seriouseats.com/recipes/2010/09/indonesian-grilled-baby-backs-with-sweet-soy-glaze-recipe.html", "description": "[Photograph: Caroline Russock] The following recipe is from the September 1 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! These Grilled Baby Backs with Sweet Soy Glaze from Steven Raichlen's Planet Barbecue!...", "totalTime": null, "recipeYield": "2 to 4", "recipeCategory": ["Cook the Book", "Grilling", "Pork"], "recipeIngredient": ["1 cup Indonesian sweet soy sauce (kejap manis), or 1/2 cup each regular soy sauce and molasses", "1/2 cup sugar", "1 tablespoon minced, peeled fresh ginger", "2 cloves garlic, minced", "1 large shallot, minced", "Freshly ground black pepper", "1/4 teaspoon freshly ground white pepper, or more to taste", "2 racks baby back pork ribs (each 2 to 2 1/2 pounds)", "Coarse salt (kosher or sea)", "Garlic powder", "2 cups fruit wood chips or chunks (optional), soaked for 1 hour in water to cover, then drained "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sweet soy sauce, sugar, ginger, garlic, shallot, 1/4 teaspoon of black pepper, the white pepper, and 3 tablespoons of water in a heavy saucepan over high heat and bring to a boil.  Let the glaze boil until thick and syrupy and reduced to about 1 1/3 cups, 4 to 6 minutes, stirring often. If the glaze becomes too thick, add 1 to 3 additional tablespoons of water. The sweet soy glaze can be made several hours ahead of time and refrigerated, covered. Let it come to room temperature before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the thin, papery membrane from the back of each rack of ribs.   Season the ribs generously on both sides with salt, black pepper, and garlic powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up the grill for indirect grilling, place a drip pan in the center, and preheat the grill to medium. I urge you to get a charcoal grill for smoking, but you can use wood on a gas grill; you just won’t get as pronounced a wood flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, if you are using a charcoal grill, toss the wood chips or chunks, if using, on the coals. If you are using a gas grill, add the wood chips or chunks, if using, to the smoker box or place them in a smoker pouch under the grate. Brush and oil the grill grate. Place the racks of ribs bone side down in the center of the grate over the drip pan and away from the heat. (If your grill has limited space, you can stand the racks of ribs upright in a rib rack.)  Cover the grill and cook the ribs until tender, 1 1/4 to 1 1/2 hours. When the ribs are done, they’ll be handsomely browned and the meat will have shrunk back from the ends of the bones by about 1/4 inch. If you are using a charcoal grill, you will need to add fresh coals after 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>During the last 10 minutes of grilling, brush the ribs on both sides with the sweet soy glaze.  When the ribs have grilled for about 5 minutes after being glazed, move them directly over the fire. Brush the ribs on both sides with glaze again and grill them until the glaze is sizzling, 1 to 3 minutes per side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the ribs to a large platter or cutting board and cut the racks into individual ribs. Pour any remaining glaze over the ribs and serve at once.</p>"}]}