{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Aaron Mattis"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tomato Bread with Parmigiano-Reggiano and Fresh Thyme", "link": "https://www.seriouseats.com/recipes/2010/06/tomato-bread-with-parmigiano-reggiano-and-fresh-thyme-recipe.html", "description": "...", "totalTime": "", "recipeYield": "one large loaf", "recipeCategory": [], "recipeIngredient": ["3 tablespoons less than 3 cups unbleached all-purpose flour or bread flour, plus more for dusting", "3 tablespoons spelt flour or another whole grain flour", "1/2 cup finely grated Parmigiano-Reggiano", "2 or 3 sprigs fresh thyme, stripped from stems", "1 1/4 teaspoons kosher salt", "1/4 teaspoon instant yeast", "1 3/4 cups strained tomato juice", "Extra virgin olive oil", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together flours, Parmigiano-Reggiano, thyme, kosher salt, and yeast in a large, non-reactive bowl. Add tomato juice and stir until liquid is thoroughly incorporated and the mixture forms a loose, shaggy ball. The dough should be very sticky and wet; add more tomato juice or a little water if too dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat the sides of the bowl with olive oil to prevent dough from sticking and cover the bowl with plastic wrap. Let rise for 12 to 24 hours in a warm, draft-free environment such as a cool oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto a floured countertop. Fold in half several times, dust with flour, cover with plastic wrap, and let rest for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold dough in half repeatedly until it develops significant surface tension. Tuck corners in to form a ball. Place seam-side-down on a floured cotton towel, dust with flour, and fold sides of towel up and over to cover. Let rest for at least 1 hour or preferably 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line an oven rack with a pizza stone or unglazed quarry tiles and heat oven to 500°F, using convection heat if possible. When oven is almost fully heated, fill a large skillet or roasting pan with ice cubes and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto a floured peel or cookie sheet and quickly form into desired shape with your hands or 2 dough scrapers. Use a wet knife or razor blade to cut a 1/2-inch-deep slit along the length of the loaf. Sprinkle with coarse sea salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pan of ice cubes one rack below pizza stone. Bake bread on pizza stone for 45 minutes. Do not open the oven during this time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pan from oven. Continue to bake bread until it develops a deeply caramelized crust and sounds hollow when tapped on any side, 5 to 10 minutes. Remove excess flour with a pastry brush and let cool to room temperature on an elevated rack before slicing.</p>"}]}