{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100603apricotfoldoverpie.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apricots", "Cook the Book", "Deborah Madison", "pie dough", "pies", "Seasonal Fruit Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Deborah Madison's Apricot Fold-Over Pie", "link": "https://www.seriouseats.com/recipes/2010/06/deborah-madisons-apricot-fold-over-pie-recipe.html", "description": "After the weekend's resoundingly successful <a href=\"http://www.seriouseats.com/recipes/2010/05/apricot-cake-recipe.html\">Apricot Cake</a> made using admittedly subpar apricots, I decided to try my luck with another apricot recipe. This time I chose an <strong>Apricot Fold-Over Pie</strong> from <a href=\"http://www.deborahmadison.com/about.html\">Deborah Madison</a>'s <em><a href=\"http://www.amazon.com/Seasonal-Fruit-Desserts-Orchard-Market/dp/0767916298/serieats-20\">Seasonal Fruit Desserts</a></em>.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Apricot", "Cook the Book", "Desserts"], "recipeIngredient": ["Chilled Pastry for Pies or Galettes (<a href=\"#pastry\">recipe follows</a>)", "8 to 10 cups pitted and quartered apricots (about 2 1/5 pounds)", "1/3 to 2/3 cup organic sugar, plus extra for the crust", "3 tablespoons all-purpose flour", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground coriander or freshly grated nutmeg", "2 tablespoons unsalted butter, melted", "1 1/2 cups all purpose flour ", "1/2 cup whole wheat pastry flour", "1/2 teaspoon salt", "1 tablespoon organic sugar", "12 tablespoons (1 1/2 sticks) cold unsalted butter, cut into small pieces", "1 egg yolk", "1/2 teaspoon vinegar", "5 to 6 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450&deg;F.  Have the dough made, chilled, and ready to roll.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the apricots with the sugar, flour, and spices and let stand while you roll out the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the chilled dough into a large circle, roughly 1/8-inch thick.  Drape it into a deep 9-inch pie plate, allowing the edges, which will be considerable, to hang over. For a more even appearance, trim the edges with a knife or scissors. Add the fruit and fold the dough over the top. Brush the dough with melted butter, pouring any excess into the fruit, then sprinkle with a tablespoon or so of sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the folded pie plate on a cookie sheet to catch any juices. Bake in the center of the oven for 15 minutes. Lower the heat to 375&deg;F and bake until the fruit is bubbling and the crust is nicely colored, 40 to 50 minutes. Cool before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"pastry\"></a><h4>Chilled Pastry for Pies or Galettes</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 20 ounces, enough for 1 large or 2 smaller galettes, a double crust pie, or a fold-over pie -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the flours, salt, and sugar together in a bowl. Cut in the butter by hand or use a mixer with the paddle attachment, leaving some of the chunks the size of uncooked chickpeas. (If using a food processor, pulse until the butter is broken up.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the egg yolk and vinegar with 1/4 cup of the ice water. Sprinkle the liquid over the flour mixture by tablespoonfuls and toss until you can bring the dough together with your hands. Add the last one or two tablespoons of water if needed. (If using a food processor, don't take the dough all the way, but stop when it begins to look tacky and starts clumping together.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 2 pieces if making smaller galettes or leave in 1 large piece. Wrap in plastic wrap, press the dough into a disk, and refrigerate for at least 30 minutes or longer. Chilled dough is easier to roll out, easier to handle, and absorbs less extra flour, keeping the texture light and flaky, as it should be. The dough can be made a day or two ahead. Wrapped well, it can be frozen for up to month.</p>"}]}