{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100923-frenchtoast-primary.jpg", "author": {"@type": "Person", "name": "HeartofGlass"}, "recipeCuisine": "", "keywords": ["bagels", "French toast", "no bake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French Toast Bagels", "link": "https://www.seriouseats.com/recipes/2010/09/french-toast-bagels-recipe.html", "description": "I used a nonstick skillet, but Molly from the blog Orangette has said that oil makes for the superior 'finish' on any French toast recipe. Very stale bagels might require a longer marinade in the milk and egg mixture. For...", "totalTime": "40 minutes", "recipeYield": "4", "recipeCategory": ["French Toast", "No-Cook"], "recipeIngredient": ["4 small-to-medium sized bagels, preferably stale (approximately 3.5 ounces per bagel)", "4 large eggs", "1/2 cup skim or 2 percent milk", "1 tablespoon butter or oil", "Maple syrup, honey, butter, jam, or cream cheese for serv1 tablespoon butter or oil for greasing the pan, if ing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut bagels into halves. If using large bagels, cut horizontally into 3 slices. Combine milk and eggs in large bowl and whisk until frothy. Transfer to 13 by 9-inch baking pan. Add bagels to dish and allow to soak until easily pierced with fork, but not falling apart, flipping once during soak, 15 to 20 minutes total. Transfer bagels to large plate and repeat with remaining bagels as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in 12-inch nonstick skillet or griddle pan over medium high heat until foaming subsides. Add bagels face down and cook until golden, about 2 minutes. Flip bagel with thin spatula and cook on second side until golden, 2 to 3 minutes longer. Serve immediately with syrup, butter, honey, or jam. If desired, serve as 'stuffed' French toast with cream cheese, topped with syrup or honey.</p>"}]}