{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100127homemadepho.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Vietnamese", "keywords": ["Clifford A. Wright", "Cook the Book", "noodles", "soups", "The Best Soups in the World", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Phở", "link": "https://www.seriouseats.com/recipes/2010/01/how-to-make-pho-vietnamese-soup-recipe.html", "description": "\"This phở might not be quite as nuanced as the restaurant version but it's still entirely satisfying.\" [Photograph: Caroline Russock] Some people go straight for the chicken noodle when they are sick, but when I feel under-the-weather, only one soup...", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Cook the Book", "Soups and Stews", "Vietnamese"], "recipeIngredient": ["<strong>For the Broth</strong>", "1 tablespoon peanut oil", "2 large onions, cut into 1/4-inch slices", "2 1/2 pounds meaty beef soup bones", "2 1/2 pounds cooked chicken carcass or chicken wings, backbone, and/or feet", "5 quarts water", "2 carrots, peeled and julienned", "4 slices fresh ginger, peeled and julienned", "1 small cinnamon stick", "Seeds from 5 pods cardamom, lightly crushed", "2 star anise", "2 whole cloves", "2 whole garlic cloves, crushed with their peel left on", "1 teaspoon black peppercorns", "<strong>For the Soup</strong>", "1/2 pound beef sirloin, sliced very thin across the grain in bite-size pieces", "Salt and freshly ground black pepper", "1 large onion, sliced as thin as paper", "2 scallions, trimmed and thinly sliced", "2 cups (1/2 pound) fresh bean sprouts", "6 tablespoons chopped cilantro (fresh coriander) leaves", "4 fresh red or green serrano chiles, seeded and sliced in rings or julienned", "2 limes, quartered", "6 to 8 ounces rice sticks (thin rice noodles), soaked in hot water for  30 minutes, drained", "1/4 cup Vietnamese or Thai (<em>nuoc mam</em> or <em>nam pla</em>) fish sauce or more to taste "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The day before you plan to serve the soup, in a large stockpot, heat the peanut oil over high heat, then add the sliced onions and cook until browned on the edges, 8 to 10 minutes.  Remove the onions and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the beef and chicken pieces in the stockpot and cover with the water.  Bring to a near boil over medium heat, then reduce the heat to low and simmer, skimming the surface foam, for 15 minutes.  Add the reserved cooked onion slices and the carrots, ginger, cinnamon, cardamom, star anise, cloves, garlic, and peppercorns.  Bring to a boil over high heat, then reduce to low and simmer, partially covered, for 6 hours, skimming the surface of foam when needed.  Strain the stock through a strainer into a large bowl.  Strain again through a cheesecloth-lined strainer back into the cleaned stockpot or bowl.  Refrigerate overnight or until the layer of fat forms on top, then remove and discard the fat.  You will use 12 cups of broth.  (The broth can be frozen at this point if you wish.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve, attractively arrange the sliced beef sirloin, seasoned with salt and pepper, on a platter and garnish the platter with the paper-thin-sliced onion and scallions.  On another platter or plate, attractively arrange the bean sprouts, cilantro, chiles, and limes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thirty minutes before you want to serve the soup, bring a pot of water to a boil over high heat.  Turn off the heat, then add the rice sticks and let sit for 30 minutes.  Drain the rice noodles and place equal portions in each of the 8 soup bowls.  Cover and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring the beef broth to a boil over high heat and add the fish sauce and 1 teaspoon of black pepper; taste and add more broth if necessary.  Pour the broth into a chafing dish or soup tureen and place over a portable warmer to keep hot in the center of the table for diners to serve themselves.  Serve the soup, allowing each diner to add some beef and onion to a bowl.  Ladle hot broth over the meat, stirring to cook the meat.  Add the bean sprouts, cilantro, chiles, and a squeeze of lime to taste.</p>"}]}