{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100620eggbagelbig.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["eggs", "salmon", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Scrambled Eggs with Smoked Salmon", "link": "https://www.seriouseats.com/recipes/2010/06/sunday-brunch-scrambled-eggs-with-smoked-salmon-recipe.html", "description": "Slice a bagel into thirds and heap it with scrambled eggs full of smoked salmon, cream cheese, and sorrel for a rich and unusual brunch any restaurant would be proud to serve.", "totalTime": "", "recipeYield": "2 alone or 4 with bagels", "recipeCategory": ["Salmon", "Scrambled Eggs"], "recipeIngredient": ["6 eggs", "1 1/2 tablespoons butter", "Salt", "Freshly ground black pepper", "4 ounces smoked salmon, cut into 1/2-inch dice", "4 ounces cream cheese, cut into 1/2-inch dice", "1/2 cup shredded sorrel", "Minced chives for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the eggs, butter, and some salt and pepper in a saucepan or skillet with sloping sides. Turn the heat to medium high and begin to beat the mixture with a whisk, stirring almost constantly but not too fast; you do not want the mixture to become foamy. If you are using a nonstick pan or skillet, use a wooden spoon instead of a whisk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the butter has melted, the mixture will begin to thicken and develop small curds; this will take from 3 to 8 minutes, depending on your pan and cooktop. If the eggs begin to stick to the bottom of the pan, remove from the heat for a moment, continuing to whisk, and then return to the flame.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the eggs are very creamy, with small curds all over--not unlike very loose oatmeal--they are just about ready. Stir in the smoked salmon and cook for a minute, just to warm it. Remove from the heat, stir in the cream cheese and sorrel, and taste for salt and pepper. Garnish with chives and serve.</p>"}]}