{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100819Choux.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["choux pastry", "desserts", "French", "French in a Flash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash (Classic): Profiteroles", "link": "https://www.seriouseats.com/recipes/2010/08/french-in-a-flash-classic-profiteroles-recipe.html", "description": "These profiteroles are the crème de la crème of ice cream sandwiches. Bought strawberry ice cream is squashed between two cream-puff halved and soaked in melted dark chocolate. This is chocolate-covered strawberries on a whole other level.", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Desserts", "French"], "recipeIngredient": ["1 stick unsalted butter", "1 cup water", "1 tablespoon sugar", "1/8 teaspoon salt", "1 cup flour", "3 eggs", "1 11.5-ounce bag good quality dark chocolate chips", "6 tablespoons heavy cream", "2 pints good quality strawberry ice cream (recommended: Haagen-Dazs Five)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a covered saucepot, bring the butter, water, sugar, and salt to a boil. It is important to cover the pot so that the amount of liquid remains exact.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the pan off the heat, and dump in the flour. Stir vigorously to combine with a wooden spoon, and return to pan to medium-low heat.  Stir until the dough pulls away from the sides of the pan, and forms a ball.  Spoon the dough into a bowl, and set aside to cool slightly. Soak your pan now. Thank me later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a wooden spoon or electric beater, add the eggs one at a time, adding the next egg only once the one before it has been completely incorporated into the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use an ice cream scoop to place 8 round mounds on a Silpat-lined cookie sheet. Wet your finger and tap down any points in the dough that might stick out and burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the choux puffs for 10 minutes on 400, and then another 40 to 45 minutes on at 350&deg;F. They should be puffed, cracked, and golden.  Transfer to a cooling rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, heat the chocolate and cream gently in a double boiler until smooth and melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the pastry puffs in half horizontally.  Place one scoop of strawberry ice cream on the bottom half, and top with the top half.  Pour the chocolate sauce on top.</p>"}]}