{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100330potatoeggbread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "white bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: White Potato-Egg Sandwich Loaf", "link": "https://www.seriouseats.com/recipes/2010/04/white-potato-egg-sandwich-loaf-recipe.html", "description": "In this bread, <strong>instant mashed potatoes create a softer, fluffier texture.</strong> I almost always use them in dinner rolls for that reason. The instant potatoes I buy are little more than dehydrated cooked potatoes, with no strange preservatives, chemicals, or flavors. The resulting bread is a very pale yellow, and very soft and fluffy with just a hint of flavor from the egg.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons (1 package) instant yeast", "1 tablespoon demerara sugar (white sugar is fine)", "1/2 cup instant mashed potatoes", "1/4 cup semolina flour", "1 egg", "1/4 cup Greek yogurt", "1 teaspoon salt (I used a fine sea salt)", "2 cups bread flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, mix the water, yeast, and sugar. If you're not sure of the yeast's viability, wait a few minutes to make sure it foams. Add the potato flakes and semolina, whisk to combine, and let it rest for 10 minutes to hydrate the potatoes and get the yeast happy and active.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg, yogurt, salt and bread flour. Attach the bowl to the stand mixer and with the dough hook, knead until the dough cleans the sides of the bowl and is shiny and elastic. This dough is very soft and is a bit sticky even after it's shiny and properly stretchy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the mixer and drizzle the doughball with olive oil, on all sides. If you need the mixer bowl for another use, you can move the dough to a clean bowl, instead. Cover the bowl with plastic wrap and allow the dough to rise until doubled, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and sprinkle the bottom of a 9-by-5-inch loaf pan with cornmeal. Remove the dough from the bowl and form it into a log to fit the pan. Cover the pan with plastic wrap and allow it to rise until doubled. It should take about half as much time as the first rise, or about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slash the top of the loaf, and bake it for 30 to 40 minutes at 350°F, until it is nicely browned.</p>"}]}