{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "sandwiches", "The Burger Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flood Burgers", "link": "https://www.seriouseats.com/recipes/2010/02/flood-burgers-juice-disk-enhanced-hamburgers-recipe.html", "description": "Note: Want to read about the development of the Flood Burger? Check it out here....", "totalTime": null, "recipeYield": "4 burgers", "recipeCategory": ["Beef", "Burger", "Sandwiches", "The Burger Lab"], "recipeIngredient": ["2 pounds fresh ground, 85% lean ground beef", "Kosher salt", "Freshly cracked black pepper", "4 slices cheddar cheese (optional)", "4 hamburger buns, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure four 2-ounce portions of beef and form into balls. Season generously with salt and pepper. Heat heavy-bottomed 12-inch cast-iron or stainless steel skillet (or carbon steel crepe pan) over high heat for at least 5 minutes. Place balls of beef on skillet. Smash beef balls with back of heavy-duty spatula sprayed with non-stick cooking spray until 1/4-inch thick and 4-5 inches wide. Cook for 1 minute. Using spatula, carefully scrape patties from skillet and flip, taking care to scrape up any browned bits from bottom of pan. Cook for one minute longer, then remove patties to plate and allow to cool for 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using citrus juicer or hands and wire mesh strainer, squeeze patties firmly and catch juice in small bowl. Discard or save meat for another use (it works surprisingly well in long-simmered pasta sauces). Divide sauce into four small soup bowl and place in freezer until firmly frozen, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, divide remaining beef into eight 3-ounce balls and form into four-inch-wide patties. Take one patty and use fingers to form 1/4-inch ridge around rim of the patty, creating shallow cup shape. Repeat with three more patties. Remove frozen beef juice disks from bowls and place one disk in each ground beef \"cup.\" Top with remaining beef patties. Carefully crimp and seal edges, then form into even, 1/2- to 3/4-inch patty. Season generously on all sides with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon canola oil in heavy-bottomed 12-inch cast-iron or stainless steel skillet (or carbon steel crepe pan) over high heat until lightly smoking. Add patties and cook without moving for 1 1/2 minutes. Flip, using thin metal spatula. Using toothpick, poke hole in center of each burger to allow steam to escape. Continue cooking for 1 minute. Top with cheese and cook for 1 minute longer, or until center registers 130&deg;F on an instant-read thermometer for medium-rare. Place patties on toasted buns, and serve with napkins.</p>"}]}