{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100125-nastybits-vealkidney.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["kidney pie", "Steak and Kidney Pie", "The Nasty Bits", "veal kidneys"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Veal Kidney Pie", "link": "https://www.seriouseats.com/recipes/2010/01/the-nasty-bits-veal-kidney-pie-offal-recipe.html", "description": "[Photographs: Chichi Wang] More Bits Calf's Liver with Onions &#187; What, Pray Tell, Is Cod Milt? &#187; Every last nasty bit! &#187; The majority of kidney pies contain cubes of simmered steak. But when it comes to my savory pies,...", "totalTime": "", "recipeYield": "four as a main dish", "recipeCategory": ["Beef", "Mains", "Offal", "The Nasty Bits"], "recipeIngredient": ["1 veal kidney, trimmed of its fat and cut into 1/2 inch chunks", "2 medium potatoes, cubed", "1 turnip, cubed", "3 cups beef stock", "2 tablespoons butter or lard", "1 tablespoon flour", "<strong>For the pastry:</strong>", "1/2 cup butter or lard, cut into 1/2 inch squares", "1 1/2 cups all-purpose flour", "Pinch of salt", "Iced water", "<strong>To glaze:</strong>", "1 egg, beaten with 1 teaspoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pastry: Toss the butter or the fat in the flour until coated.  Add the salt.  Add a little ice water and bring the dough together with your hands, sprinkling no more than a few teaspoons of water.  On a well-floured surface, shape the dough into a square.  Sprinkle more flour onto the square to prevent sticking later; then roll out the dough into a rectangle approximately 1/2 inch thick.  Fold the rectangle lengthwise in the shape of an envelope; then roll and repeat.  Dust with flour as needed.  Repeat this procedure at least 3 or more times, preferably 5 times, taking care not to warm or soften the dough too much as you roll.  Cover the pastry with plastic wrap and chill in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling: Heat a heavy skillet or pan over high heat.   Add 1 teaspoon or so of butter.  Toss in the kidneys and quickly saute to brown the surface, leaving the interior raw.  Remove from the pan.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Deglaze the pan with the beef stock, reducing the liquid by half.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, make the roux:  Add the remainder of the butter to a saucepan and melt over low heat.  Add the flour, mixing to make a paste.  Toast the flour in the butter for a few minutes, until the roux is light golden brown.  Add the reduced stock and simmer gently, until the liquid is thickened and coats the back of of a wooden spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to boil and add the cubed potatoes and turnips.  Simmer for 10 minutes, until tender.  Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the pie: Place the kidney, turnips, and potatoes into a pie pan or ovenproof pot.  Cover the ingredients with the gravy so that the liquid comes up to approximately 3/4 of the kidneys and vegetables.  Roll out the chilled pastry into a sheet approximately 1/4 inch thick.  Carefully lay the pastry sheet over the kidney mixture and crimp the edges with a fork.  Puncture the surface once or twice to allow for air vents.  Lightly brush the egg glaze over the pastry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pie in the oven and bake for 20 to 30 minutes, until the pastry is golden brown and the interior is very hot.  Serve immediately. </p>"}]}