{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101216-128398-peanut-butter-and-jelly-bars.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Baked Explorations", "Cook the Book", "cookie bars", "cookie month", "Cookies", "holiday baking", "holiday sweets", "jelly", "Matt Lewis", "oats", "peanut butter", "Renato Poliafito", "Super Bowl desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Peanut Butter and Jelly Bars ", "link": "https://www.seriouseats.com/recipes/2010/12/cook-the-book-peanut-butter-and-jelly-bars.html", "description": "Sweet pastry topped with layers of peanut butter mousse, jam, and an oat crumble?  Even if they aren't exactly <em>cookies</em>, this was one bite-sized sweet that needed to be shared.  It's a bar for diehard fans of PB&amp;J, those who enjoy spoonfuls of peanut butter straight from the jar.", "totalTime": null, "recipeYield": "15 large barsÂ ", "recipeCategory": ["Nuts", "Other Grains"], "recipeIngredient": ["<strong>For the sweet pastry dough:</strong>", "1/4 cup granulated sugar", "1 1/2 cups all-purpose flour", "1/4 teaspoon salt", "1/2 cup (1 stick) cold unsalted butter, cut into 1/2-inch cubes", "1 large egg ", "<strong>For the peanut butter filling:</strong>", "1 cup (2 sticks) unsalted butter, at room temperature", "2 cups smooth peanut butter or 1 cup smooth peanut butter and 1 cup chunky peanut butter", "1 3/4 cups confectioners’ sugar", "1/2 teaspoon pure vanilla extract ", "<strong>For the crumb topping:</strong>", "3/4 cups all-purpose flour", "1/4 teaspoon salt", "1/2 teaspoon baking powder", "1/4 teaspoon baking soda ", "1/3 teaspoon cinnamon", "1/3 cup firmly packed dark brown sugar ", "2/3 cup rolled oats", "6 tablespoons (3/4 stick) cold unsalted butter, cut into 1/2-inch pieces  ", "<strong>For the assembly:</strong>", "2 heaping cups good-quality jelly or preserves  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the sweet pastry dough:</strong> Butter the sides and bottom of a glass or light-colored metal 9-by-13-inch pan. Line the bottom with a sheet of parchment paper, and butter the parchment. Put the sugar, flour, and salt in a food processor and pulse until combined. Add the butter and pulse until sandy (about 6 to 10 quick pulses). In a small bowl, whisk the eggs and pour them into the food processor. Pulse just until the dough begins to hold together. Form the dough into a disk, wrap it tightly in plastic, and refrigerate for at least 1 hour or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust a work surface with a sprinkling of flour. Using a rolling pin, roll the dough into a rectangle slightly larger than 9 by 13 inches (the size of the pan) and about ¼ inch thick. (The dough might be sticky. Make sure to turn it with a bench knife or offset spatula as needed and keep the working surface floured. Some people find it easier to roll the dough between two layers of parchment paper. This can make it easier to transfer and be a bit less messy.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ever so gently, guide the dough into the pan and lightly press it&mdash;without pulling&mdash;into the bottom; it is not necessary to bring the dough up the sides of the pan, only to completely cover the bottom of the pan. Trim off any excess. Place the pan in the freezer for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the freezer, line it with aluminum foil, and fill it three quarters full with pie weights or dried beans. Bake for 15 minutes, then remove the foil and weights and bake for another 10 minutes, or until the crust is lightly browned. Transfer the pan to a wire rack to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven temperature to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the peanut butter filling:</strong> In the bowl of a standing mixer fitted with the paddle attachment, beat the butter until it is completely smooth. Add the peanut butter and beat until combined. Add the confectioners’ sugar and vanilla and beat until smooth. Scrape down the sides of the bowl and beat again. Turn the mixture out onto the crust and, using an offset spatula, spread it into an even layer. Chill the peanut butter layer while you make the crumb topping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the crumb topping:</strong> In a large bowl, whisk together the flour, baking powder, salt, baking soda, and cinnamon. Add the brown sugar and use your hands to rub it in until the mixture is uniform in color. Stir in the oats. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dry mix in the bowl of a standing mixer fitted with the paddle attachment. Add the butter and beat on low speed until loose crumbs form. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the bars:</strong> Spread the jelly in an even layer over the peanut butter filling. Sprinkle on the crumb topping until the jelly is no longer visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the bars for 20 to 25 minutes, rotating the pan halfway through, or until the top is brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pan to a wire rack to cool completely, then cut the bars and serve.</p>\n\n<p><small><strong>Note:</strong> The bars can be stored in the refrigerator in an airtight container for up to 2 days. </small></p>"}]}