{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100215chickensweetpotatoenchilada.jpg", "author": {"@type": "Person", "name": "Tara Mataraza Desmond"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "enchiladas", "Meat Lite", "Mexican", "sweet potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meat Lite: Sweet Potato and Chicken Enchiladas with Chile Sauce", "link": "https://www.seriouseats.com/recipes/2010/02/sweet-potato-and-chicken-enchiladas-with-chile-sauce-recipe.html", "description": "The minimal addition of meat in these <strong>enchiladas</strong> adds texture and flavor but isn't the crux of the recipe. In this case, half a pound of chicken (for four people) poached in chile broth is a supporting player to <strong>the potato-and-onion filling.</strong>", "totalTime": "", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Mains", "Meat Lite", "Mexican", "Sweet Potatoes and Yams"], "recipeIngredient": ["3 dried guajillo chiles, stems and seeds removed", "3 dried ancho chiles, stems and seeds removed", "4 cups water", "1 medium onion, halved and sliced", "6 cloves garlic, divided", "2 tablespoons vegetable oil", "1 medium sweet potato, peeled and grated with a box grater or the shredder plate of a food processor", "1 teaspoon cider vinegar", "1/2 teaspoon salt", "8 ounces boneless skinless chicken breasts (about 2 small)", "12 corn tortillas", "1/2 cup grated cheddar cheese", "4 green onions, thinly sliced", "1/2 cup cilantro, chopped", "Sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large sauté pan over medium-high heat. When the pan is hot, add the chiles and toast them about 2 minutes on each side, just until they are fragrant and beginning to darken (do this in batches if you can't fit all six at once). Set the sauté pan aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the water in a medium pot and bring to a boil.  Add the toasted chiles, half of the sliced onions, and 3 cloves of garlic cut in half.  Partially cover the pot, reduce the heat to low and simmer for 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the chiles simmer, add the vegetable oil to the sauté pan over medium heat.  Add the remaining sliced onion and the grated sweet potato.  Sauté for about 10 minutes until the onions and potatoes are very soft.  Mince the remaining cloves of garlic and add to the onions and potatoes, stirring for about 30 seconds. Remove the pan from the heat and set aside. If a crust formed on the bottom of the sauté pan while the potatoes cooked, deglaze the pan with 1/4 cup of the chile liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the chiles have simmered for 30 minutes, transfer them, along with the onions and garlic, to a blender or food processor along with 1/2 cup of the liquid (reserve the rest in the pot).  Puree until very smooth and then push the puree through a mesh strainer into a small bowl.  Discard any solids that remain in the strainer.  Stir in the cider vinegar and the salt and then set the chile sauce aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pot and the remaining liquid to medium-low heat and bring to a bare simmer.  Add the chicken, cover the pot and poach the chicken for 15-20 minutes, until cooked through.  Remove the chicken from the liquid to cool slightly and then shred it with a fork.  Stir the shredded chicken into the potatoes and onions and season to taste with salt and pepper.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F.  Assemble the enchiladas.  Lightly oil the bottom of a medium baking dish.  Divide a few tablespoons of the chicken mixture among the 12 corn tortillas and roll them up into cigar-shapes about 1-inch in diameter.  Arrange them, seam-side down, close together in the baking dish.  Spread the chile sauce on top of the enchiladas and then top with the grated cheese.  Cover the dish with foil and bake for about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the hot enchiladas with the green onions and cilantro and serve with sour cream on the side.  </p>"}]}