{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100517SimplestWhiteBreadEver.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "white bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: The Simplest White Bread Ever", "link": "https://www.seriouseats.com/recipes/2010/05/bread-baking-the-simplest-white-bread-recipe-ever.html", "description": "<strong>You don't need fancy equipment or special ingredients to make a good loaf of bread.</strong> This recipe proves it. It's probably the simplest bread I've ever made, in terms of ingredients, equipment, and the amount of work required. If you've never made a loaf of bread before, this could be the gateway bread to lead you into the wonderful world of yeasty things.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Baking", "Bread", "Bread Baking", "Dairy-Free", "Vegetarian"], "recipeIngredient": ["1 tablespoon white sugar", "2 1/2 teaspoons (1 package) yeast", "1 cup lukewarm water", "2 1/2 cups (11 1/4 oz) all purpose flour", "1 teaspoon salt", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar and yeast to the water in your measuring cup and stir to combine. If you're using anything except and instant yeast, let it sit for 5 to 10 minutes, or until the mixture is lively and bubbly. If it's instant yeast, you can continue without proofing, or let it proof to ease your mind that the yeast is alive—your choice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour and salt into a medium bowl, and stir to distribute salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the water/yeast mixture to the the bowl with the flour, and stir to combine all the ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some flour on your countertop and dump the dough mixture onto the counter. Knead for a minute or two, adding flour as necessary to keep it from sticking. You don't need to knead until the dough is stretchy and elastic - just knead until it's a nice cohesive mixture and not a lumpy, sticky, blobby mess. Form it into a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the olive oil into a zip-top bag and plop the dough into the bag. Make sure the dough is completely coated with olive oil, zip the top, and stash it in the refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, take the bag out of the fridge and massage it a bit, still in the bag, to mash out all the bubbles in the dough. You may need to open the bag to let the air out, but reseal it after. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Leave the bag on the countertop until the dough has come to room temperature, about an hour. It will rise and expand a bit during that time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Sprinkle some cornmeal on the bottom of a loaf pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some flour on your counter top, and dump the dough onto the counter. You don't need to squeeze every bit of olive oil out of the bag, but don't try to hold it back, either. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Knead and fold it a bit to incorporate the olive oil into the dough, then form the dough into a log that will fit into your loaf pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the loaf into the pan, cover the pan with plastic wrap, and let it rise until it has at least doubled in size. I used an 8 1/2-by-4 1/2 pan and let it rise until it was slightly higher than the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap, slash the top, and bake at 350 degrees for 35 to 40 minutes, until the bread is golden brown and the loaf sounds hollow when tapped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let it cool completely on a rack before slicing.</p>"}]}