{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100302-beignets-02.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beignets", "Cook the Book", "desserts", "frying", "John Besh", "New Orleans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Beignets", "link": "https://www.seriouseats.com/recipes/2010/03/cook-the-book-john-besh-new-orleans-beignets-dessert-recipe.html", "description": "When I first visited New Orleans several years ago, I was a strict vegetarian. That meant I missed out on almost all the city's iconic culinary offerings&mdash;gumbo, po'boys, even red beans and rice. But not beignets. <strong>Light, sweet, and incredibly messy from the heavy dusting of powdered sugar</strong> they were finished with, they were entirely memorable. With the help of <strong>John Besh's beignet recipe,</strong> I stroll down memory lane.", "totalTime": "", "recipeYield": "30", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Cook the Book", "Deep Frying", "Desserts", "Doughnuts"], "recipeIngredient": ["1 cup lukewarm milk, about 110°F", "1/2 cup granulated sugar", "1 package dry yeast", "4 cups all-purpose flour", "1/2 cup melted butter", "1/2 teaspoon salt", "1/2 teaspoon vanilla extract", "4 to 6 cups canola oil", "1 cup powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the lukewarm milk into a large bowl.  Mix 1 tablespoon of the granulated sugar, the yeast, and a heaping tablespoon of the flour into the milk, mixing with a whisk, until both the sugar and the yeast have dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once bubbles have developed on the surface of the milk and it begins to foam, whisk in the butter, salt, and vanilla.  Add the remaining flour and sugar, folding them into the wet ingredients with a large rubber spatula.  Knead the dough by hand in the bowl for about 5 minutes, then cover the bowl with plastic wrap and refrigerate the dough for 6 to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and roll out on a floured surface to a thickness of 1/4 inch.  Cut into 2-inch squares, cover loosely with plastic wrap, and allow the beignets to rise for about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large deep skillet over high heat until it reaches 350&deg;F.  Use a candy thermometer to check temperature.  Fry the beignets in small batches in the hot oil, turning them every 30 seconds or so with tongs, until golden brown all over.  Use tongs to remove beignets from the oil and drain on paper towels.  Put the powdered sugar into a fine-mesh strainer and dust the warm beignets generously with the sugar.</p>"}]}