{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cabbage", "Cook the Book", "James Villas", "Pig: KIng of the Southern Table", "recipe newsletter", "red cabbage", "salads", "tangerines"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red Cabbage, Tangerine, and Bacon Salad with Bacon Vinaigrette", "link": "https://www.seriouseats.com/recipes/2010/05/red-cabbage-tangerine-and-bacon-salad-with-bacon-vinaigrette-recipe.html", "description": "The following recipe is from the May 19 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! As you might assume, Pig: King of the Southern Table by James Villas isn't the most...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Bacon", "Cook the Book"], "recipeIngredient": ["1 small head red cabbage (about 11/2 pounds)", "2 tangerines", "6 slices lean bacon", "1/4 cup red wine vinegar", "2 teaspoons Dijon mustard", "Salt and freshly ground black pepper to taste", "3 tablespoons peanut oil", "2 scallions (part of green tops included), thinly sliced  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quarter the cabbage, remove the core, shred the leaves, and place in a large salad bowl. Peel, section, and seed the tangerines, removing as much white pith as possible. Add the sections to the cabbage, toss, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, fry the bacon over moderate heat till crisp. Drain on paper towels and crumble coarsely. Pour off all but about 2 tablespoons of fat from the skillet, add the vinegar, and boil down till reduced by half. Add the mustard and stir till well incorporated. Remove from the heat, add the salt and pepper, and then gradually add the oil, stirring briskly to form a smooth dressing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the vinaigrette over the salad in the bowl, add the crumbled bacon and the scallions, and toss till the ingredients are well coated with the dressing. Chill briefly or serve at room temperature.</p>"}]}