{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100420greenkitchenonepotchicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alice Waters", "chicken", "Cook the Book", "In The Green Kitchen", "one-pot meals", "poultry", "roast chicken", "Thomas Keller"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Thomas Keller's One-Pot Roast Chicken", "link": "https://www.seriouseats.com/recipes/2010/04/thomas-kellers-one-pot-roast-chicken-recipe.html", "description": "<strong>Roasting a chicken is one of the most indispensable skills that a cook can hone,</strong> and no one has been championing the simple joys of a roast chicken more than <strong><a href=\"http://www.tkrg.org/showStaff.php?id=50\">Thomas Keller</a>.</strong> So it's not surprising Keller chose to contribute a recipe for <strong>One-Pot Roast Chicken</strong> to <strong><em><a href=\"http://www.amazon.com/Green-Kitchen-Techniques-Learn-Heart/dp/0307336808/serieats-20\">In The Green Kitchen</a></em></strong> by <strong><a href=\"http://www.chezpanisse.com/about/alice-waters/\">Alice Waters</a>,</strong> a collection of essential skills for home cooks.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["1 three-pound chicken", "Salt and fresh-ground black pepper", "3 potatoes, peeled and thickly sliced", "2 carrots, peeled and thickly sliced", "2 onions, peeled and quartered", "2 celery stalks, thickly sliced", "4 large shallots, peeled", "Fennel, squash, turnips, parsnips, or other vegetables (optional)", "2 bay leaves", "2 or 3 thyme sprigs", "2 to 3 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First prepare the chicken.  To remove the wishbone at the top of the breast, use a small knife to scrape along the bone to expose it, then insert the knife and run it along the bone, separating it from the flesh.  Use your fingers to loosen it further, grasp the tip of the wishbone, and pull it out.  Tuck the wing tips back and under the neck.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tying the chicken plumps the breast up and brings the legs into position for even roasting.  Cut a length of cotton string.  With the chicken on its back, slip the string under the tail and bring the ends up over the legs to form a figure eight.  Loop over the end of each leg and draw the strings tight to bring the legs together.  Draw the string back under the legs and wings on either side of the neck.  Pull tight, wrap one end around the neck, and tie off the two ends.  Salt the chicken evenly all around.  Coarse salt has a good texture of large grains that makes it easy to calibrate how much salt you are putting on the chicken; sprinkle it from up high, so that it falls like snow.  Season liberally with fresh-ground pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F, put all the vegetables and herbs together in the bottom of a large, heavy ovenproof pot, and season with salt and pepper.  Set the chicken on top, dot with the butter, and roast uncovered for 45 to 60 minutes (or longer), depending on the size of the chicken.  It is done when the leg joint is pierced with a knife and the juices run clear, not pink.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the chicken rest for a few minutes before carving, and serve family-style with all of the caramelized vegetables and juices from the pot on a platter and the chicken pieces on top.</p>"}]}