{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101217-ham-beans.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beans", "ham", "holidays", "kale", "leftovers", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Holiday Leftovers: Ham, Bean, and Kale Stew", "link": "https://www.seriouseats.com/recipes/2010/12/holiday-leftovers-ham-bean-and-kale-stew.html", "description": "So if you've been following along here, you already know everything you need to know to serve a perfect <a href=\"http://www.seriouseats.com/2010/12/the-food-lab-how-to-pick-and-cook-a-holiday-h.html\">holiday ham</a>. But what about the next day when you've got that big ol' ham bone and scraps to contend with? I've been obsessed with the combination of <strong>beans, pork, olive oil, and sherry vinegar.</strong> Both the oil and vinegar drizzled on right before serving enliven the stew significantly.", "totalTime": "1 day", "recipeYield": "8 to 10", "recipeCategory": ["Ham", "Kale"], "recipeIngredient": ["1 pound dried beans such as Great Northern, Cannellini, or Tarbais, soaked in water at room temperature overnight.", "1 pound leftover smoked ham bones, scraps, and/or meat", "3 quarts low-sodium chicken stock or water", "1 large onion, split", "1 large clove garlic", "3 bay leaves", "Kosher salt", "1 large bunch picked kale leaves (about 2 quarts loosely packed)", "Freshly ground black pepper", "Extra virgin olive oil", "Sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beans, ham, stock or water, onion, garlic, and bay leaves in large Dutch oven. Add 1teaspoon salt and bring to a boil over high heat. Reduce to medium low and simmer until beans are completely tender, about 45 minutes, adding water as necessary to keep beans covered at all times.. remove ham and set aside. Discard onion, garlic, and bay leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ham is cool enough to handle, shred meat into small pieces with fingers and return to pot with beans. Discard bones. Add kale to beans. Bring to a vigorous simmer and continue to cook, stirring occasionally, until some beans have broken down completely, liquid is reduced to thick stew-like consistency, and kale is completely tender, about 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season to taste with additional salt and black pepper and serve immediately in shallow bowls, drizzling with plenty of extra-virgin olive oil and a sprinkle of sherry vinegar. Serve with crusty bread toasted with olive oil.</p>"}]}