{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101012%20seedy%20wheat%20bread.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Seedy Wheat Bread", "link": "https://www.seriouseats.com/recipes/2010/10/bread-baking-seedy-wheat-bread-recipe.html", "description": "Morning toast should not feel like penance, and <strong>of all the whole wheat breads I've made, this may be my favorite.</strong> It might be the inclusion of <strong>sesame seeds</strong> that tips the balance, but the bread itself has a nice texture&mdash;soft but not gummy or crumbly, with enough body to make it feel substantial. It has a pleasant wheaty flavor with none of the bitterness that sometimes creeps into baked goods made from whole wheat.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch"], "recipeIngredient": ["8 1/2 ounces (about 2 cups) whole wheat flour", "1 1/4 cups water, divided", "2 1/2 teaspoons instant yeast", "1 teaspoon brown sugar", "3 3/8 ounces (1/2 cup plus about 2 tablespoons) bread flour", "1 teaspoon table salt", "2 tablespoons unsalted butter, room temperature", "2 tablespoons toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the whole wheat flour and 1 cup of water in bowl of stand mixer. Cover with plastic and allow to rest at room temperature over night.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, combine the remaining 1/4 cup of water, yeast, and brown sugar in small container and set aside for 10 minutes until it is foamy. Add yeast mixture to whole wheat mixture. Add bread flour. Knead with dough hook until the dough is elastic, about 10 minutes on low speed. Add butter, salt, and sesame seeds and continue kneading until fully incorporated, about 2 minutes. Cover bowl with plastic wrap and set aside until doubled, about 50 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Sprinkle cornmeal on a baking sheet. Turn the dough out onto floured work surface. Knead briefly, then form into desired shape. Place on baking sheet seam-side down and cover with plastic wrap. Set aside to rise until doubled, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap, slash as desired, and bake at 350 degrees until browned and center registers 210 degrees on an instant read thermometer, about 40 minutes. Cool completely on a rack before slicing.</p>"}]}