{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/22100329-dorieamarettirecipe.jpg", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "recipeCuisine": "Italian", "keywords": ["desserts", "Dorie Greenspan", "flourless", "Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dorie Greenspan's 15-Minute Magic Flourless Torte", "link": "https://www.seriouseats.com/recipes/2010/03/dorie-greenspans-15-minute-magic-dessert-amaretti-di-saronno-chocolate-passover-recipe.html", "description": "This recipe for <strong>15-Minute Magic,</strong> a non-kosher/non-Parve chocolate-amaretti torte, is hardly traditional Passover fare, but it's delicious and doesn't use flour. My favorite amaretti to use for this cake are <strong><a href=\"http://www.amazon.com/dp/B0001FQVMK/?tag=serieats-20\">amaretti di Saronno from D. Lazzaroni &amp; Co.</a></strong>  You'll find them in their beautiful red tins at specialty shops, Italian markets and some supermarkets.  That said, I've used just about every other brand available and have never eaten a torte I didn't love.", "totalTime": null, "recipeYield": "8 servings", "recipeCategory": ["Desserts", "Italian", "Passover"], "recipeIngredient": ["6 large double Amaretti di Saronna or 18 mini amarettini (see above)", "3 ounces almonds, blanched or not, whole, sliced or chopped", "1 stick (8 tablespoons; 4 ounces) unsalted butter, at room temperature", "1/2 cup sugar", "3 large eggs, at room temperature", "4 ounces bittersweet chocolate, melted ", "<strong>For the glaze:</strong>", "4 ounces bittersweet chocolate, finely chopped", "1/2 cup heavy cream", "2 tablespoons granulated sugar", "2 tablespoons water ", "<strong>For the cream (optional):</strong>", "3/4 cup cold heavy cream", "1/2 teaspoon pure almond extract", "1 1/2 teaspoons confectioners' sugar ", "1 or 2 amaretti, crumbled, or a few spoonfuls of toasted sliced almonds, for decoration "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong> Center a rack in the oven and preheat the oven to 350°F.  Butter an 8-x-2-inch round cake pan, line the bottom with parchment or wax paper and butter the paper.  Dust the inside of the pan with flour, tap out the excess and put the pan on a lined baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the amaretti and almonds in the workbowl of a food processor, pulse to grind them finely and evenly, then turn the ingredients out onto a piece of wax paper and set aside.  Put the butter, sugar and eggs into the workbowl and process for about 3 minutes, until the batter is very smooth and has a satiny sheen.  Stop to scrape down the sides of the bowl as needed to help the ingredients blend evenly.  Pour in the reserved amaretti and almonds and the melted chocolate and pulse just until they are thoroughly incorporated.  Turn the batter into the prepared pan and smooth the top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the sheet into the oven and bake 25 to 30 minutes, or until a knife inserted into the center of the cake comes out almost clean&mdash;streaky is more what you're looking for.  The cake will dome slightly and the top will look dry - it might even crack; don't worry.  Transfer the cake to a rack to cool for 15 minutes, run a blunt knife around the sides of the pan and unmold the cake onto the rack.  Peel off the paper, invert and cool to room temperature right-side up.  The cake will be very thin&mdash;that's just the way it's meant to be.  When you are ready to glaze the cake, put the rack over a sheet of wax paper&mdash;the drip catcher. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the glaze:</strong> Put the chopped chocolate in a 2-cup Pyrex measuring cup.  Stir the cream, sugar and water together in a small saucepan and put the pan over medium heat.  When the cream comes to the boil, pour it over the chocolate, wait 1 minute, then, using a small rubber spatula, gently stir until the ingredients are smooth, blended and shiny.  Pour the chocolate over the top of the cake and, with a long metal icing spatula, spread the glaze, allowing it to spill over the sides; smooth the glaze over the sides of the cake.  Chill the cake for about 30 minutes to set the glaze. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cream:</strong> Working in a mixer with the whisk attachment, whip the cream slowly until it holds soft peaks.  Beat in the almond extract, then sift the confectioners' sugar into the bowl and fold it into the cream with a rubber spatula.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> This cake is best served at room temperature and in slender slices&mdash;as sleek and low as it is, that's how rich it is.  At the table, top each slice with a spoonful of whipped cream and a sprinkling of crushed amaretti or toasted almonds. </p>"}]}