{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100517blondiebrownie.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bar cookies", "blondies", "brownies", "Cakespy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Blondie-Topped Brownies", "link": "https://www.seriouseats.com/recipes/2010/05/cakespy-blondie-topped-brownies-recipe.html", "description": "Blondies or brownies? <strong>It's a delicious dilemma:</strong> they're both bar cookie classics, one rich in brown sugar, the other redolent of chocolate. But why should you have to decide? Because they taste so much better when baked together, in layers.", "totalTime": "", "recipeYield": "about 36 small bars", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["<strong>For the brownie layer:</strong>", "1 1/4 cups unsweetened cocoa powder", "1 1/4 cups flour", "1/2 teaspoon salt", "1 1/2 cups (3 sticks) unsalted butter, melted", "3 cups sugar", "5 eggs", "2 teaspoons vanilla ", "optional (I didn't use them): 1 cup chopped nuts", "<strong>For the blondie layer:</strong>", "2 cups flour", "1 teaspoon baking powder", "1 teaspoon salt", "1 cup chopped nuts (the original recipe called for walnuts, but I used pecans)", "2/3 cup unsalted butter, melted", "2 cups packed dark brown sugar", "2 large eggs, lightly beaten", "2 teaspoons vanilla extract", "one 12-ounce bag semisweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously grease the bottom and sides of a large (I used a 3-quart oblong, 9x16-inch) baking pan. I imagine that you could probably split the batter between two 8x8-inch baking pans, as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the brownie layer. Whisk together the cocoa, flour, salt, and nuts (if you're using them), in a large mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With an electric mixer, beat the melted butter and sugar together in a separate mixing bowl. Beat in the eggs, one at a time, and continue beating until it has reached a smooth, light yellow color and creamy consistency. Beat in the vanilla. Add the dry mixture, bit by bit, beating on low speed until well blended. Spoon into your prepared pan or pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the brownies in the oven for 20 minutes. They will not be done, but will just be beginning to set at this point; while they are baking, go ahead and prepare your blondie batter. If your brownies have baked for 20 minutes before you are finished preparing the blondie batter, simply take them out of the oven and leave them in the pan; leave the oven on and heated to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/images/20100517blondiebrownies.jpg\"><img alt=\"20100517blondiebrownies.jpg\" src=\"https://www.seriouseats.com/recipes/assets_c/2010/05/20100517blondiebrownies-thumb-500x375-89716.jpg\" width=\"500\" height=\"375\" class=\"mt-image-none\" style=\"\" /></a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>It's time to make the blondie batter. Sift together the flour, baking powder, and salt into a medium-sized mixing bowl. Stir in the pecans or walnuts (or no nuts, if you don't want 'em) and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With an electric mixer, beat the melted butter and brown sugar together in a large mixing bowl. Beat in the eggs and vanilla. Beat in the flour mixture, bit by bit, mixing well after each addition. Fold in the chocolate chips last; your batter will be fairly thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently spoon the blondie batter on top of the partially baked brownie batter, trying to distribute the batter evenly on top; however, do not try to spread the batter on top of the brownie layer, because this will cause the brownie layer to break up unevenly. Don't worry too much if it looks uneven, as the heat from the oven will distribute the batter a bit more evenly. There will be some spots where the brownie mixture pokes out on top, but it's not such a bad thing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pan back in the oven, for 20-30 minutes or until the blondie layer is beginning to lightly brown and a toothpick inserted in the center comes out mostly clean. Let them cool in the pan; you might even consider refrigerating them for a few hours so that they can set up properly. </p>"}]}