{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100208-pecans.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Ad Hoc at Home", "appetizers", "nuts", "pecans", "Thomas Keller", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Candied Pecans and Herbed Toasted Walnuts", "link": "https://www.seriouseats.com/recipes/2010/02/candied-pecans-herbed-toasted-walnuts-recipe.html", "description": "\"I left these on my kitchen counter and by midafternoon the bowl was almost empty.\" [Flickr: elana's pantry] Memorable dinners don't have to begin with fancy canapés or the perfect amuse-bouche. More often than not, a bowl of mixed nuts...", "totalTime": null, "recipeYield": "3 cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Nuts"], "recipeIngredient": ["3 cups raw pecan halves", "3 tablespoons clover honey", "3/4 teaspoon ground <em>fleur de sel</em> or fine sea salt, plus a pinch", "3 cups raw walnut halves", "2 tablespoons (1 ounce) unsalted butter", "3/4 teaspoon finely chopped rosemary", "3/4 teaspoon finely chopped oregano", "3/4 teaspoon finely chopped thyme", "3/4 teaspoon finely chopped parsley", "Pinch of  ground <em>fleur de sel</em> or fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the racks in the lower and upper thirds of the oven and preheat the oven to 250&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper and spread the nuts on the pan.  Warm in the oven for 5 minutes (warming the nuts helps prevent them from crystalizing the honey).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour the honey unto a small saucepan and warm over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the nuts in a bowl, add the honey, and sprinkle with a pinch of salt.  Stir to coat the nuts evenly with the honey.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two baking sheets with Silpats and spread the nuts on the sheets.  Sprinkle with the remaining 3/4 teaspoon of salt.  Bake for 2 hours, rotating the pans halfway through baking.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pans from the oven and separate any nuts that cling together.  Let the nuts cool on the pans.  Store in an airtight container for up to 1 week. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Herbed Toasted Walnuts</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.  Line a baking sheet with parchment paper.  Set a cooling rack on a second baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the nuts on the lined baking sheet and toast them in the oven for 7 minutes.  Rotate the pan and toast for 5 to 8 minutes longer, until the nuts are fragrant and lightly colored.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the butter and herbs in a small saucepan over medium heat.  As soon as the butter begins to bubble, remove from the heat and set aside to infuse while the nuts toast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the butter mixture into a medium bowl, add the salt, and swirl the butter around the sides of the bowl.  Add the nuts and toss to coat.  Transfer the nuts to a rack and drizzle any remaining butter over them.  Let cool slightly.  Since these are coated in butter, they are best served warm.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To store, cool the nuts completely, then store in an airtight container for up to 1 week.  Reheat on a baking sheet in a warm oven before serving.</p>"}]}