{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100613TomatoCheeseBread.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Tomato-Cheese Bread", "link": "https://www.seriouseats.com/recipes/2010/06/tomato-cheese-bread-baking-recipe.html", "description": "<strong>My inspiration for this bread was my favorite grilled cheese sandwich,</strong> which includes a slice of tomato and a sprinkle of dried oregano. And if fresh tomatoes are out of season, that grilled cheese sandwich with a sprinkle of oregano pairs perfectly with a bowl of tomato soup. This recipe uses tomato powder, which can be found online if you don't have a local spice shop that carries it.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons yeast", "1 tablespoon sugar", "2 1/2 cups (11 1/2 ounces) bread flour, divided", "1 teaspoon dried oregano", "1 tablespoon tomato powder", "1 teaspoon salt", "1 generous cup (4 ounces) coarsely shredded sharp cheddar cheese", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine water, yeast, sugar, and one cup of the bread flour. Cover the bowl with plastic wrap and set aside for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining flour, oregano, tomato powder, and salt. Knead with the dough hook until the dough cleans the side of the bowl and starts becoming elastic. Add the olive oil and continue kneading until the dough is smooth and elastic and is no longer sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cheese and knead just until it is incorporated. You don't want to knead so much that the cheese disintegrates into the bread. It it's a little unevenly distributed, that's fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and set aside to rise until doubled in size, about 60 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and sprinkle some cornmeal on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and knead the dough briefly before you form it into your preferred shape. Put it on the baking sheet, cover with plastic wrap, and set aside to rise until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has risen, slash it as desired, then bake at 350 degrees for 45 minutes, until nicely browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool completely on a rack before slicing.</p>"}]}