{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100928CoqauRiesling610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["chicken", "coq au vin", "creme fraiche", "French", "French in a Flash", "lardons", "parsley", "pasta", "riesling"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "French in a Flash (Classic): Coq au Riesling", "link": "https://www.seriouseats.com/recipes/2010/09/coq-au-riesling-recipe.html", "description": "This classic dish, <strong>Coq au Riesling, is a chicken stew with mostly the same components as Coq au Vin</strong>&mdash;except the <em>vin</em> in the recipe is not red, but a fresh, mineral-rich Riesling.  The dish comes from Alsace, a region influenced by both French and German cuisines.  I love this dish because it's lighter than traditional Coq au Vin, but still heavy enough to be considered comfort food.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Bacon", "Chicken", "French"], "recipeIngredient": ["1 tablespoon unsalted butter", "3 thick-cut strips of bacon, cut into lardons", "1 chicken, in 10 pieces (2 breasts, cut in half, 2 thighs, 2 drumsticks, 2 wings)", "Sea salt", "1/2 onion, medium diced", "8 ounces cremini mushrooms, quartered", "1 1/2 cups dry Riesling", "Freshly cracked black pepper", "1/4 cup crème fraîche", "2 tablespoons chopped fresh flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in 12-inch, straight-sided sauté pan over medium high heat. Add bacon and cook, stirring occasionally, until crisp, about 8 minutes. Remove pan from heat. Using slotted spoon, transfer cooked bacon to paper-towel lined plate.  Reserve fat in pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken pieces dry with paper towel. Season with salt. Return sauté pan to medium high heat until lightly smoking. Add chicken pieces skin side down. Cook until golden brown on both sides, turning once, about 8 minutes total. Remove pan from heat and transfer chicken to large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all but 2 tablespoons of fat from pan. Add onions and mushrooms and cook on low heat until most of the exuded liquid has evaporated and onions have started to soften, about 3 minutes. Season lightly with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add Riesling, increase heat to high, and bring to a boil, scraping up any browned bits on the bottom of the pan with a wooden spoon. Return chicken to pan and cover. Lower the heat to low, and simmer for 40 minutes. Add bacon back to the pan, and season with black pepper.  Simmer uncovered an additional 15 minutes until chicken is done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, transfer chicken to large serving platter. Raise heat to medium-high, and reduce to thicken, about 2 minutes. Stir in the crème fraîche and parsley, and pour over the chicken.  Serve immediately, family-style, with warm, crusty, rustic bread or buttered wide egg noodles tossed with freshly chopped parsley.</p>"}]}