{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100205avatar2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Avatar", "Cakespy", "desserts", "Movie Awards Season Recipes", "pop-tarts", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Avatarts", "link": "https://www.seriouseats.com/recipes/2010/02/cakespy-avatart-oscars-movie-recipes-avatar-desserts.html", "description": "A sweet treat wherein <strong>pop culture and Pop Tart collide</strong> sweetly, in a pocket-sized morsel perfect for smuggling into the theater and decked out in full movie regalia.", "totalTime": "", "recipeYield": "6 to 8 tarts, depending on size and thickness", "recipeCategory": ["Cakespy"], "recipeIngredient": ["<strong>For the crust:</strong>", "1/2 teaspoon salt", "1/2 cup (1 stick) butter, softened and cut into cubes", "1 1/2 cups flour", "3 tablespoons cold water", "&nbsp", "<strong>For the filling:</strong>", "Jam, about 1 heaping teaspoonful per pastry (your choice of flavor; I used blueberry)", "&nbsp", "<strong>For the topping:</strong>", "Fondant or marzipan (I purchased a 2-pound tub of rolled fondant by Satin Ice; I had quite a bit left over)", "Blue, yellow, and red food coloring", "Black gel writing icing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450&deg;F.   Line a baking sheet with parchment paper; set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and salt in a large bowl. Add butter and blend with a fork, pastry cutter, or your impeccably clean hands. Blend until the mixture is fairly coarse. Add the water, bit by bit, gently mixing the dough after each addition, until the dough is cohesive enough to form a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dough on a lightly floured surface and roll into a rectangle, about 1/8 inch thick. Cut out rectangles approximately the size of index cards (3x5 inches), or smaller if you prefer a more modest portion (I didn't). Make sure you have an even number of cutouts. I think that mine might have been a little thicker than 1/8 an inch, but I ended up with 12 rectangles (for 6 pastries).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On half of the rectangles, place a small spoonful of the jam of your choice in the center. You don't want it to be too thick or the top crust will mound on top of it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining rectangles of dough on top of the ones with jam. Crimp all four edges by hand or with a fork to ensure that your filling won't ooze out. I also poked the top of each with a fork, to vent them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tarts on your prepared baking sheet, and bake for 7 to 8 minutes, or until light golden on the edges. Remove from the oven and let them cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare your topping. I took out about 1/4 pound of rolled fondant and mixed it with a few drops of blue food coloring until almost completely mixed (I left a few small swirls of blue showing). With smaller quantities of fondant (perhaps the size of a lemon) roll the icing with red and yellow food coloring respectively; these colors will work for the ears and eyes on the characters. Leave a small quantity of your icing white, for the eyes. If you want, you can color some if it brown too, if you want to add those creepy braids to your character.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the blue fondant out with a rolling pin until it is smooth and about 1/8 inch thick. Cut rectangles out in the same size of the top of your pastries. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out small leaf shapes to add to the top of the rectangle for ears, and a small log in the center of the rectangle for the nose. With a knife or with your fingers, smooth these pieces down so that they adhere to the rectangle of fondant and have a seamless appearance. Add small ovals with pointed ends on to either side of the nose for the eyes. Add small pieces of pink icing on top of the ears, and yellow circles on top of the white yes. Finish the eyes with a dot of black gel writing icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish, use a toothpick to draw on lips and freckles on the cheeks; if desired, add a small amount of yellow sprinkles to the temple area of the character. If you've chosen to add the creepy braid to the side of your Avatart, go ahead and add it last.</p>"}]}