{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101230-130566-slow-roasted-salmon-with-cabbage-bacon-and-dill.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fish", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Dinner Tonight: Slow-Roasted Salmon with Cabbage, Bacon, and Dill", "link": "https://www.seriouseats.com/recipes/2010/12/dinner-tonight-slow-roasted-salmon-with-cabbage-bacon-and-dill-recipe.html", "description": "The slow-cooking of fish is meant to turn the flesh particularly succulent&mdash;even custardy&mdash;so that it doesn't become dry or crumbly, which happens at higher heats. Poaching in oil is meant to accomplish the same thing, but I'm sure of one thing: Throwing it in a low oven is a lot easier than using cups and cups of oil.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bacon", "Dinner Tonight", "Pork", "Salmon"], "recipeIngredient": ["1 head savoy cabbage, halved, cored, and roughly chopped", "6 slices bacon", "1 onion, diced", "1 cup water", "4 fillets salmon, 4-6 ounces each, skin removed", "1 teaspoon chopped fresh dill, plus more for garnish", "4 tablespoons olive oil", "2 tablespoons butter", "Juice of 1 lemon", " Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 250&deg;F. In medium saucepan, place bacon and heat over medium. Cook, stirring occasionally, until fat is rendered from bacon and bacon is beginning to crisp. Add onion and cook for an additional minute, then add cabbage and water. Bring to a boil, then simmer until cabbage is tender, 20-25 minutes, adding more liquid if necessary. Once very tender, season with salt, pepper, and half the dill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, season salmon fillets with salt and pepper and place salmon on non-stick sheet pan. Drizzle olive oil over fillets, top with half the dill, and finish with small knob of butter. Cook 15-18 minutes for medium rare, or up to 25 minutes for medium, depending on thickness of fish. Remove from oven and drizzle with lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide cabbage and salmon among plates and garnish with more fill, if desired. Serve immediately.</p>"}]}