{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/8.16.10benatart2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "desserts", "music", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Pat Benatart", "link": "https://www.seriouseats.com/recipes/2010/08/cakespy-pat-benatart-tarts-recipe.html", "description": "As any 1980s music lover knows, running with the shadows of the night burns a <em>ton</em> of calories. You're going to need a slice or six of Pat Benatart to maintain your energy.", "totalTime": "", "recipeYield": "8 to 10", "recipeCategory": ["Cakespy"], "recipeIngredient": ["1 cup flour", "1/3 cup confectioners' sugar", "1/4 teaspoon salt", "1/2 cup cold unsalted butter, cut into cubes ", "5 ounces cream cheese, room temperature", "1/2 cup granulated sugar", "2 large eggs", "1/2 cup fresh lemon-lime juice (made from the juice of 1 large lemon and one large lime, or 2 medium lemons and 1 medium lime)", "1 tablespoon lemon-lime zest (use a bit from each, or just lemon or lime zest if you prefer)", "1 to 2 cups whipped cream, to top", "gel or writing icing, for decoration (optional)", "Pixie sticks, for decoration (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease the bottom of a 9-inch tart pan with a removable bottom. Or, if like me, you don't have one, use a 9-inch square or round foil pan. The foil pan makes for easy removal later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, combine the flour, confectioners' sugar, and salt.  Process to combine. Add the butter, and pulse until the pastry comes together in clumps. Place the pastry in the tart pan, and use your fingers to press it into the bottom of the pan and up the sides. Pierce the bottom crust a few times with the tines of a fork to keep it from puffing up when it bakes. Place the pastry crust in the freezer while you preheat the oven; this will keep it from shrinking away while it bakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chilled pastry in the oven and bake for about 10 to 15 minutes, or until the crust it lightly brown. Remove from the oven and let cool on a wire rack while you prepare the filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven temperature to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an electric mixer, mix the cream cheese until it is nice and smooth. Add sugar and mix again until incorporated and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs, one at a time, mixing after each addition until fully incorporated. Add the lemon juice and lime zest, and mix until thoroughly combined and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the filling into the pre-baked tart shell, and bake for about 22-30 minutes, or until the filling is set. Transfer to a wire rack to cool. After a half hour or so, cover and then refrigerate until chilled, at least an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the tart pan and transfer to a plate before putting the finishing touches on your tart. If you've used a foil pan, simply cut and peel away the foil and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with as much whipped cream as you'd like. If you want to go for the Pat-themed decoration, smooth the whipped cream into a flat layer, and freeze the tart for at least 2 hours (you want the whipped cream to be hard so that the gel / writing icing won't just bleed).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using gel or writing icing, draw your best Pat Benatar caricature and perhaps some of your favorite lyrics. Not an artist? This will probably make it even funnier, so don't worry about it. If desired, accent your illustration with some Pixie Stix-dust for rosy cheeks and blue eyeshadow. </p>"}]}