{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100326-seasian-noodles.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Asian", "keywords": ["belacan", "chicken", "curries", "curry laksa", "kare laksa", "noodles", "sambal", "Seriously Asian", "soups", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kare Laksa and Simmered Tofu and Vegetables", "link": "https://www.seriouseats.com/recipes/2010/03/using-sambals-kare-laksa-simmered-tofu-and-vegetables-recipe.html", "description": "Learn more about cooking with sambals here....", "totalTime": "", "recipeYield": "", "recipeCategory": ["Asian", "Chicken", "Soups and Stews", "Tofu"], "recipeIngredient": ["A few tablespoons oil, for sauteing ", "<strong>For the paste</strong>", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2010/03/javanese-nonya-malaysian-sambal-stir-fried-rice-with-sambal-recipe.html\">Sambal Belacan</a> (Nyonya Sambal) ", "2 tablespoons coriander (whole or ground)", "1 teaspoon cumin seed (whole or ground)", "1/2 teaspoon fennel seed (whole or ground)", "5 black peppercorns (whole or ground)", "2 teaspoons ground turmeric", "1 to 2 tablespoons of water", "3 chicken thighs, bone in, halved lengthwise", "1 stalk lemongrass, bruised", "1 cup coconut broth", "2 cups water", "2 star anise, whole", "2 sticks cinnamon", "1 tablespoon sugar", "1 1/2 teaspoons salt", "<strong>Accoutrements</strong>", "Egg noodles, cooked until al dente", "Fried tofu", "Bean sprouts, blanched in boiling water for 10 seconds", "Lime", "<a href=\"http://www.seriouseats.com/recipes/2010/03/javanese-nonya-malaysian-sambal-stir-fried-rice-with-sambal-recipe.html\">Javanese sambal</a> (optional, to serve on the side)", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2010/03/javanese-nonya-malaysian-sambal-stir-fried-rice-with-sambal-recipe.html\">Sambal Belacan</a> (Nyonya Sambal) ", "10 candlenuts", "8 ounces firm (cotton) tofu, cut into 2 inch cubes or triangles", "1 cup coconut milk", "3 cups water", "1 tablespoon sugar", "1 teaspoon salt", "<strong>Choice of vegetables</strong>", "Kale", "Cabbage", "Green beans", "Potatoes", "Carrots"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 1. </strong> To make the paste, combine the sambal belacan with the rest of the spices (the coriander, cumin, fennel, peppercorns, and turmeric). If you are using whole seeds, ground the seeds beforehand in a mortar and pestle before adding them to the sambal. Add enough water so that the paste is the consistency of a very thick cream soup.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 2. </strong> Place a soup pot or a heavy saucepan over low heat. Over medium heat, heat two tablespoons of oil. Place the paste into the oil and saute.  Lower the heat to low, stirring occasionally. The paste should sizzle slightly but not cook too quickly.  Continue to saute for 5 minutes, until the oil begins separates from the paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 3. </strong> Add the lemongrass and the chicken and stir well to combine. Raise the heat to medium and saute, stirring often, until the chicken is slightly browned on all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 4. </strong> Add the water, coconut milk, cinnamon stick, star anise, sugar, and salt and stir well to combine. Raise the heat and bring the soup to a simmer. Reduce the heat and cook for 35 to 40 minutes, until the chicken is tender. Add the fried tofu and continue to simmer for a few more minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the dish: Divide the bean spouts among 4 large soup bowls, covering the entire bottom of the bowls with a layer of spouts. Evenly mound the egg noodles on top of the bean sprouts. Ladle the kare laksa into the bowls. Eat immediately, with lime juice squeezed over the top.  If desired, serve the Javanese sambal on the side for eaters to spoon into their broths.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"tofu\"></a><h4>Simmered Tofu and Vegetables</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes enough for four to six servings as a side dish -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 1. </strong>  To deep-fry the tofu: dry the cut pieces of raw tofu with paper towels. Pour oil to a depth of 1 inch in a wok and place over high heat until the oil is hot but not smoking (around 350&deg;F.) Add the tofu pieces. The oil will begin to bubble vigorously around the tofu. Using chopsticks or a slotted spoon, flip the tofu around so that the all the pieces are golden brown and crispy, about 3-4 minutes. Transfer the fried tofu to a plate lined with paper towels to drain.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 2. </strong>Using a mortar and pestle, grind the candlenuts into a paste. Add the nuts to the sambal and mix thoroughly.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 3. </strong> Place a soup pot or a heavy saucepan over low heat. Over medium heat, heat two tablespoons of oil. Place the candlenuts and sambal paste into the oil and saute. Lower the heat to low, stirring occasionally. The paste should sizzle slightly but not cook too quickly. Continue to saute for 5 minutes, until the oil begins separates from the paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the water and coconut milk, sugar, and salt and stir well to combine. Raise the heat and bring the liquid to a simmer. Add the chopped vegetables and reduce the heat. Simmer the mixture until the vegetables are tender&mdash;this will vary according to whatever vegetables you choose. You may need to stagger the order the vegetables are added to the liquid: cubed potatoes will only take 10 to 15 minutes to cook, whereas kale will take at least 30 minutes. Fifteen minutes prior to when the last kind of vegetable will be cooked through, add the fried tofu and continue to simmer.  Serve immediately. </p>"}]}