{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101203-holidaypunch-610.jpg", "author": {"@type": "Person", "name": "Paul Clarke"}, "recipeCuisine": "", "keywords": ["apple cider", "holiday cocktails", "holiday punches", "holiday recipes", "rum", "winter drinks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flaming Holiday Punch", "link": "https://www.seriouseats.com/recipes/2010/12/flaming-holiday-punch-winter-cocktail-recipe.html", "description": "I've been mixing variations of a <strong>Flaming Holiday Punch (known in some circles as \"English Bishop\")</strong> every December for years now. The base recipe is from Esquire's <em>Handbook for Hosts</em>, from 1949, which is nice on its own but quite open to improvisation. <strong>The ingredients are a cinch:</strong> a bottle of aged rum poured into a punch bowl over baked oranges studded with cloves. Toss in a little sugar and some holiday spice, turn down the lights before you apply a match to the hot liquid (careful!) and conversation is pretty much guaranteed to stop.", "totalTime": "45 minutes", "recipeYield": "approximately 20", "recipeCategory": ["Rum"], "recipeIngredient": ["6 small oranges", "approximately 1/2 cup whole cloves", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground allspice", "1/2 teaspoon ground nutmeg", "1/4 cup sugar, to taste", "1 750ml bottle aged rum", "1/2 gallon unfiltered apple cider", "1 pint boiling water (optional, should you wish for further dilution)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350. Stud an orange with whole cloves by inserting the pointed end of the clove through the orange peel, pushing until only the bud protrudes. Repeat with remaining oranges; bake oranges until soft, about 30 minutes. Once the oranges have cooled slightly, place them in a heatproof punch bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the rum by placing the bottle in a pot of hot (not boiling) water for 10 minutes or so. While the rum warms, heat the cider in a large saucepan until steamy; pour into a pitcher and have ready for use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rum into the punch bowl, and add sugar. Lower the lights.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a heatproof ladle, scoop a up a small amount of the rum. Holding the ladle away from the punch bowl (and your face, and the curtains, and the dog), light the scoop of rum using a kitchen match -- if necessary, add a little high-proof rum to aid in ignition. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully drizzle the flaming rum into the punch bowl, which should ignite the rest of the rum. Sprinkle pinches of the spices into the flames.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After a minute or two, or whenever you're tired of the spectacle, douse the flames by gently adding the hot cider (and hot water if using), stirring with the ladle as you go. The flames may not immediately go out, but keep stirring and as the alcohol is diluted, they'll soon flicker and die. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve in punch cups.</p>"}]}