{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100322chocolatetomatocake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cakes", "Campbell's", "chocolate", "Cook the Book", "ganache", "Rose Levy Beranbaum", "Rose's Heavenly Cakes", "tomato soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rose Levy Beranbaum's Chocolate Tomato Cake with Mystery Ganache", "link": "https://www.seriouseats.com/recipes/2010/03/chocolate-tomato-cake-with-mystery-ganache-rose-levy-beranbaum-recipe.html", "description": "<strong><a href=\"http://www.realbakingwithrose.com/\">Rose Levy Beranbaum</a></strong> created this cake for Campbell's soup and explains in the recipe's introduction that the <strong>tomato soup adds both color and a zing</strong> to the cake.  She also claims that no one can ever guess what the mystery ingredient is when she brings it to a party.  So is it fantastic or kind of foul? I had to try it out for myself.", "totalTime": "", "recipeYield": "16 to 20", "recipeCategory": ["Bake the Book", "Cakes", "Chocolate", "Cook the Book"], "recipeIngredient": ["1 cup plus 2 tablespoons unsweetened cocoa powder", "1 cup tomato soup (preferably Campbell's, one can)", "4 large eggs, at room temperature", "1 tablespoon pure vanilla extract", "3 cups plus 2 tablespoons (or 2 3/4 cups) cake flour (or bleached all-purpose flour), sifted into the cup and leveled off", "2 cups superfine sugar", "1 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "3 1/2  stick unsalted butter, at room temperature ", "Mystery Ganache (recipe follows)", "<strong>Special Equipment</strong>: Two 9 by 2-inch round cake pans, coated with shortening, topped with parchment rounds, then coated with baking spray and flour.", "12 ounces dark chocolate, 60% to 62% cocoa, chopped", "Almost 1 1/2 cups (12 ounces) heavy cream", "1/4 cup tomato soup, preferably Campbell's", "About 59 4-inch Pirouette Wafer Cookies, preferably Pepperidge Farm brand (2 cans, optional)", "Red-tinted buttercream and red or clear piping gel (store bought is fine, optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Preheat the oven</strong>: Twenty minutes or more before baking, set an oven rack in the lower third of the oven and preheat the oven to 350°F/175°C.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the cocoa, tomato soup, eggs, and vanilla until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the flat beater, mix the flour, sugar, baking powder, and baking soda on low speed for 30 seconds.  Add the butter and half the cocoa mixture.  Mix on low speed until the dry ingredients are moistened.  Raise the speed to medium and beat for 1 1/2 minutes.  Scrape down the sides of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting on medium-low speed, with the mixer off between additions, add the remaining cocoa mixture in two parts.  Beat on medium speed for 30 seconds after each addition to incorporate the ingredients and strengthen the structure.  Scrape down the sides of the bowl.  Using a silicone spatula, scrape the batter into the prepared pans, being sure to press the thick and fluffy batter against the sides of the pans, and smooth the surfaces evenly with a small offset spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 30 to 40 minutes, or until a wire cake tester inserted into the centers comes out clean and the cake springs back when pressed lightly in the centers.  The cakes should start to shrink from the sides of the pan only after removal from the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool and unmold the cake:</strong> Let the cakes cool in the pans on a wire rack for 10 minutes.  Run a small metal spatula between the sides of the pans and the cakes, pressing firmly against the pans, and invert the cakes onto wire racks that have been coated lightly with nonstick cooking spray.  To prevent splitting, reinvert the cakes so that the top sides are up.  Cool completely.  The cakes will be slightly smaller at the tops (more so if you haven't pressed the batter up against the sides of the pan.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Make Mystery Ganache</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, process the chocolate until very fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 4-cup or larger microwaveable cup with a spout (or in a medium saucepan, stirring often), whisk together the cream and tomato soup and scald it (heat it to the boiling point; small bubbles will form around the periphery).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cakes are completely cool, spread a little of the ganache on a serving plate and set the first layer on top.  Slide a few wide strips of wax paper or parchment under the cake to keep the rim of the plate clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread about 1 cup of the ganache over the layer.  Place the second layer on top and use the remainder to frost the top and sides.  With the tip of a 1/4-inch-wide metal spatula, make wavy lines through the ganache on top of the cake.  Slowly slide the paper strips from under the cake.  If storing the cake under a cake dome, allow the ganache to set for a minimum of 3 hours or overnight before applying the Pirouettes or the moisture from the ganache will soften them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To surround the cake with the Pirouettes, you may first have to trim them to about 4 inches, using a small serrated knife.  Repair any broken ones using ganache and press them gently against the sides of the cake.  The ganache will hold them in place.  If the ganache becomes too firm, heat it by applying a spatula run under hot tap water and dried.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, pipe little flames of red buttercream on top of each Pirouette.  If not using a coupler or tip that screws into the tube of buttercream, hold the small star decorating tip in place with your hand.  Hold the tube of buttercream in a vertical position over the Pirouette and squeeze it with your free hand to pipe the flame onto the top of the cookie.  Allow to dry until set, about 30 minutes.  As a further option, you can enhance the look of the \"flames\" by painting them lightly with piping gel, brushing them very gently with the artist's paintbrush from the bottom of the flame to the tip.</p>"}]}