{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "cauliflower", "Cook the Book", "fish", "Fresh from the Market", "halibut", "hazelnuts", "Laurent Tourondel", "recipe newsletter", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-Seared Halibut with Caramelized Cauliﬂower &amp; Hazelnuts", "link": "https://www.seriouseats.com/recipes/2010/09/pan-seared-halibut-with-caramelized-cauliflower-and-hazelnuts-recipe.html", "description": "The following recipe is from the September 17 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! While thumbing through the pages of Laurent Tourondel's Fresh from the Market I was looking for...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cauliflower", "Condiments and Sauces", "Cook the Book", "Fish", "Nuts"], "recipeIngredient": ["<strong>For the Hazelnut Cream:</strong>", "1 tablespoon unsalted butter", "1/2 cup hazelnuts, skins removed and roughly chopped", "3/4 cup fish stock", "3/4 cup heavy cream", "<strong>For the Caramelized Cauliflower Cream:</strong>", "2 tablespoons unsalted butter", "1/2 pound cauliflower, sliced 1/2-inch thick", "3/4 cup heavy cream", "Sea salt and freshly ground black pepper", "<strong>For the Brussels Sprouts:</strong>", "3/4 pound medium Brussels sprouts, trimmed and halved  ", "3 tablespoons unsalted butter", "1/4 cup hazelnuts, roughly chopped", "1/2 teaspoon finely chopped garlic", "4 fresh sage leaves, thinly sliced", "<strong>For the Halibut:</strong>", "6 skinless halibut fillets, 6 ounces each", "4 tablespoons extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Hazelnut Cream:</strong> Melt the butter in a small saucepan over low heat. Add the hazelnuts and toast them until golden brown, stirring occasionally to keep them from burning, about 3 minutes. Add the ﬁsh stock and heavy cream and simmer for 5 minutes.</p>\r\n\r\n<p>Transfer to a blender or a food processor ﬁtted with a metal blade and purée until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Cauliflower Cream:</strong> Melt the butter in a large sauté pan over medium-high heat. Add the sliced cauliﬂower and cook until the slices are golden brown, about 2 minutes per side. Add the heavy cream and simmer until the cream has been reduced by half, about 2 minutes. Purée the cauliﬂower mixture in a blender until smooth. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook the Brussels Sprouts:</strong> Bring a large pot of salted water to a boil. Add the Brussels sprouts and cook until tender when pierced with a knife, about 5 minutes. Immediately transfer the sprouts to a bowl of ice water. Once cool, drain the sprouts.</p>\r\n\r\n<p>Melt the butter in a large sauté  pan over medium-high heat until foamy. Add the hazelnuts and sauté  until they just begin to color, about 2 minutes. Add the Brussels sprouts and continue cooking until the sprouts and hazelnuts are browned, about 5 minutes. Add the garlic and sage and cook until the garlic and sage soften, about 1 minute. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Sauté the halibut:</strong> Season the halibut with salt and pepper. Heat 2 tablespoons of the olive oil in a large sauté pan over medium-high heat.</p>\r\n\r\n<p>Place 3 halibut ﬁllets in the pan and cook until the ﬁsh begins to turn opaque, about 3 minutes. Turn the ﬁsh over and cook until the ﬂesh is opaque and begins to ﬂake, about another 3 minutes. The thickness of the ﬁsh will determine the cooking time. Remove the ﬁsh from the pan and cover it with foil to keep warm. Repeat with the remaining 2 tablespoons of olive oil and 3 halibut ﬁllets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Place a spoonful of cauliﬂower cream in the center of 6 plates. Top the cauliﬂower cream with the halibut, spoon the hazelnut cream on top of the ﬁsh, and scatter the Brussels sprouts around the ﬁsh. Serve immediately.</p>"}]}