{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101007-dt-pasta-alla-norma.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["Dinner Tonight", "eggplant", "Italian", "pastas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Pasta alla Norma", "link": "https://www.seriouseats.com/recipes/2010/10/dinner-tonight-pasta-alla-norma-recipe.html", "description": "My goal with this recipe for <strong>Pasta alla Norma</strong> was simple: to convince my wife that eggplant could be delicious. Since I hear complaints of \"greasy\" and \"bitter\" and \"slimy\" on a regular basis, I decided to ease her into the eggplant world with this recipe in which eggplant plays more of a complementary role. I pulled it from a feature in this month's issue of <em>Runner's World</em> with Joe Bastianich, famed restaurateur partner of Mario Batali, son of Lidia, and current judge on <em><a href=\"http://www.fox.com/masterchef/\">Masterchef</a>.</em> The eggplant melts into the sauce and gives the dish some meatiness without meat.", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Dinner Tonight", "Eggplant", "Italian", "Pasta", "Vegetarian"], "recipeIngredient": ["4 cups basic tomato sauce, jarred or homemade", "1 medium eggplant, peeled and cut into 1-inch cubes", "Kosher salt", "4 tablespoons flour", "4 tablespoons olive oil, divided", "2 medium cloves garlic, smashed", "1 medium onion, thinly sliced", "1 pound short pasta, such as rigatoni, penne, or casarecce (pictured)", "Salt and freshly ground black pepper", "1/4 cup roughly chopped fresh basil", "6 tablespoons ricotta cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil. In the meantime, sprinkle the eggplant with salt and allow to drain on paper towels for 10 minutes, then dust with flour. Heat 1 1/2 tablespoons of the oil in a 10-inch skillet over medium-high heat until shimmering, then add one of the smashed garlic cloves.  Cook until golden, about 1 minutes, then remove and add half the eggplant. Cook the eggplant, stirring occasionally, until golden but still tender on the inside, about 5 minutes. Remove to drain on paper towels. Repeat with the remaining garlic and eggplant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablespoon oil over medium heat in the same skillet until shimmering, then add the onion. Cook until lightly golden and soft, about 7 minutes. Meanwhile, heat the tomato sauce in a large saucepan.  Add the cooked onion to the tomato sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta until a couple minutes away from al dente, then drain, reserving 1 cup of the pasta cooking water.  Add the pasta to the sauce, using pasta water as necessary to keep the sauce a nice consistency, and cook until the pasta is al dente.  Season to taste with salt and pepper. Add the eggplant pieces and basil, stir to combine, and heat through.  Divide into bowls and top with the ricotta.</p>"}]}