{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100319spotteddog.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["breads", "Cook the Book", "Darina Allen", "Forgotten Skills of Cooking", "irish", "raisins", "soda bread", "UK"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Cook the Book: Spotted Dog", "link": "https://www.seriouseats.com/recipes/2010/03/spotted-dog-soda-bread-recipe.html", "description": "For our final recipe from <em><a href=\"http://www.amazon.com/Forgotten-Skills-Cooking-Time-Honored-Recipes/dp/1906868069/serieats-20\">Forgotten Skills of Cooking</a></em> by <a href=\"http://www.cookingisfun.ie/pages/about_us/#darina\">Darina Allen</a> I couldn't resist sharing this riff on an Irish Soda bread known as <strong>Spotted Dog</strong>. As far as I can tell, the whimsical name either refers to the spotting of raisins on the bread's surface, or it's a derivative of <a href=\"http://en.wikipedia.org/wiki/Spotted_dick\">spotted dick</a>, a steamed pudding dotted with currants.", "totalTime": "", "recipeYield": "1 loaf", "recipeCategory": ["Cook the Book", "Quick Bread"], "recipeIngredient": ["3 1/2 cups all-purpose flour", "preferably unbleached", "1 teaspoon baking soda", "1 teaspoon salt", "2 teaspoons sugar", "2/3 cup golden or seedless raisins (or more if you'd like)", "1 organic egg", "1 2/3 cups buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>mixing bowl, sift the flour and baking soda; then add the salt, sugar, and raisins. Mix well by lifting the flour and fruit up in to your hands and then letting them fall back into the bowl through your fingers. This adds more air and therefore more lightness to your finished bread. Now make a well in the center of the flour mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the egg into the base of a measuring glass and add the buttermilk to the 1 1/2  cups line (the egg is part of the liquid measurement) and mix together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour most of this milk and egg mixture into the flour. Using one hand with the fingers open and stiff, mix in a full circle drawing in the flour mixture from the sides of the bowl, adding more milk if necessary. The dough should be softish, but not too wet and sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The trick with Spotted Dog, like all soda breads, is not to overmix the dough. Mix it as quickly and gently as possible, thus keeping it light and airy. When the dough all comes together, turn it out onto a well-floured work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and dry your hands.  With floured fingers, roll the dough lightly for a few seconds - just enough to tidy it up. Then pat the dough into a round about 2in thick. Transfer to a baking sheet dusted lightly with flour. Use a sharp knife to cut a deep cross on it, letting the cuts go over the sides of the bread. Prick with a knife in the four triangles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put into the oven and immediately reduce the temperature to 400°F. Cook for 35-40 minutes.  If you are in doubt about the bread being cooked, tap the bottom: if it is cooked it will sound hollow.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This bread is cooked at a lower temperature than soda bread because the egg browns faster at a higher heat.  Serve freshly baked, cut into thick slices and smeared with butter and jam. Spotted Dog is also really good eaten with Cheddar cheese.</p>"}]}