{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100415-dt-parisian-chicken.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Parisian Chicken", "link": "https://www.seriouseats.com/recipes/2010/04/dinner-tonight-parisian-chicken-recipe.html", "description": "I pulled this recipe for <strong>Parisian Chicken</strong> from <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/1600850170/serieats-20\">Mother's Best</a>,</em> a collection of comfort food dishes from <a href=\"http://www.mothersbistro.com/\">Mother's Bistro and Bar</a> in Portland, Oregon. It's a classic preparation, coating the chicken with flour and egg to give it a golden crust, then making a quick pan sauce with vermouth, lemon juice, butter, and parsley. This delicious and quick dinner is elegant and not too difficult to make.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["4 boneless, skinless chicken breasts (about 1 1/2 pounds)", "2 tablespoons whole milk", "2 large eggs", "1/4 cup flour", "6 tablespoons unsalted butter", "1/2 cup dry vermouth", "Juice of 1 lemon", "1 tablespoon chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the breasts down on a cutting board and use a sharp knife parallel to the cutting board to cut them (carefully) almost all the way in half, leaving about 1/2 inch attached. Open the breasts like a book and cover with plastic wrap. Gently pound them with a meat mallet or heavy skillet to uniform, 1/4-inch thickness. Season both sides with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl, whisk the milk and the eggs, and spread the flour on a plate. Heat 2 tablespoons of the butter in a large skillet until the foam subsides. Dredge the chicken breasts in the flour, shaking off the excess, then dip them in the egg and transfer to the skillet. Cook until golden, 2-3 minutes per side, in batches as necessary (add an extra tablespoon of butter as needed).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chicken to a plate tented with foil, or into a warm oven, then add the vermouth and lemon juice to the saute pan. Increase the heat and scrape up any browned bits, then season to taste with salt and pepper. Reduce for a minute or so (about half) then whisk in the remaining 4 tablespoons of butter in pieces. Add the parsley for the last few seconds. Serve the chicken with the sauce poured over it.</p>"}]}