{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100222nokneadbread.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bread", "Cathy Erway", "Cook the Book", "no-knead bread", "parmesan", "pepper", "The Art of Eating In"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Peppercorn, Potato, and Parmesan No-Knead Bread", "link": "https://www.seriouseats.com/recipes/2010/02/peppercorn-potato-and-parmesan-recipe.html", "description": "\"This was one of those moments where I couldn't believe something that looked this professional came from my stove.\" [Photographs: Caroline Russock] A month into Cathy Erway's eating-in experiment she decided to learn how to make her own bread. While...", "totalTime": null, "recipeYield": "one 1 1/2-pound loaf", "recipeCategory": ["Bread", "Cook the Book"], "recipeIngredient": ["3 cups all-purpose flour, plus more for dusting", "1/4 teaspoon active dry yeast", "1 1/2 teaspoons salt", "About 3 tablespoons black peppercorns, cracked (I placed mine in a Ziploc bag and rolled over it with a rolling pin several times)", "1 5/8 cups water that was used to boil a potato, slightly cooled", "Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine flour, yeast, salt, and pepper.  Add water, and stir until blended; dough will be shaggy and sticky.  Cover bowl with plastic wrap.  Let dough rest for at least 12 hours, preferably about 18 (or two days), at warm room temperature, about 70&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dough is ready when its surface is dotted with bubbles.  Lightly flour a work surface and place dough on it; sprinkle it with a little more flour and fold it over itself once or twice.  Cover loosely with plastic wrap and let rest for about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using just enough flour to keep dough from sticking to work surface or your fingers, gently and quickly shape dough into a ball, tucking folded parts underneath.  Sprinkle and gently pat grated Parmesan across the top of the loaf.  Generously coat a cotton towel (not terry cloth) with flour, semolina, or cornmeal, and place the loaf seam-side down in it.  Coat another towel with flour and let rise for about 2 hours.  When it is ready, the dough will me more than double in size and will not readily spring back when poked with a finger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least half an hour before dough is ready, preheat oven to 450&deg;F.  Put a 6-8 quart heavy covered pot (cast iron, enamel, Pyrex, or ceramic) in the oven as it heats.  When dough is ready, carefully remove pot from oven.  Slid your hand under the towel and place dough Parmesan side up in the pot.  Cover with lid and bake 20 minutes; then remove lid and bake another 15 minutes, until loaf is beautifully browned.  Cool on a rack.</p>"}]}