{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100531garlicscapes.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["garlic scapes", "grill", "grilling", "pestos", "spring", "The Crisper Whisperer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "The Crisper Whisperer: 7 Things To Do with Garlic Scapes", "link": "https://www.seriouseats.com/recipes/2010/06/the-crisper-whisperer-what-to-do-with-garlic-scapes-recipe.html", "description": "Scapes are to garlic as fusilli is to rigatoni: the crazy-bastard college buddy who never really embraced adulthood. But they're more than that, too. With their substantial heft and a flavor that mellows dramatically when cooked, they're vegetable, aromatic and herb all in one. Check out these scapely suggestions, and <strong>share your own favorite uses for scapes</strong> in the comments.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Crisper Whisperer", "Garlic", "Pesto", "Sides", "Vegetarian"], "recipeIngredient": ["1/4 cup pine nuts", "3/4 cup coarsely chopped garlic scapes*", "Juice and zest of 1/2 lemon", "1/2 teaspoon salt", "A few generous grinds of black pepper", "1/2 cup extra virgin olive oil", "1/4 cup grated Parmigiano Reggiano cheese", "<small>*Or use half scapes and half herbs such as basil, dill and chervil</small>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small, dry pan set over very low heat, lightly toast the pine nuts, stirring or tossing occasionally until just beginning to brown, about 2-3 minutes. Remove from the heat and let cool for a few minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the scapes, pine nuts, lemon juice and zest, salt, and pepper in the bowl of a food processor fitted with the blade attachment. Pulse about 20 times, until fairly well combined. Pour in the olive oil slowly through the feed tube while the motor is running. When the oil is incorporated, transfer the pesto to a bowl and stir in the grated cheese. If you plan to freeze the pesto, wait to add the cheese until after you've defrosted it.</p>"}]}