{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100110deepfriedcupcake1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "cupcakes", "desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Deep-Fried Cupcakes on a Stick", "link": "https://www.seriouseats.com/recipes/2010/01/cakespy-deep-fried-cupcakes-on-a-stick-recipe.html", "description": "These deep-fried cupcakes on a stick are like the intersection of childhood nostalgia and greasy fair food.", "totalTime": "", "recipeYield": "12", "recipeCategory": ["Cakes", "Cakespy", "Deep Frying"], "recipeIngredient": ["12 mini cupcakes with buttercream frosting (smaller cupcakes work best; full-size cupcakes may not stay on the stick)", "8-12 cups of vegetable or peanut oil, quantity depending on your pan", "1 1/2 to 2 cups flour, divided", "1 tsp baking soda", "1/2 tsp salt", "1 cup milk", "2 tbsp white vinegar", "1 tbsp vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start out by peeling the wrappers off of your cupcakes, and spear each one with a popsicle stick, so that it is embedded into the frosting but does not poke through to the top. Freeze them for at least 2 hours, or even overnight--you want them to be like little rocks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When your cupcakes are nearing the end of the chilling period, it's time to start heating the oil for frying. I poured about 6 cups of vegetable oil into a medium saucepan, so that it was about 4-5 inches deep. The exact quantity of oil required will depend on the size of your saucepan. Turn the heat to medium-high, and insert a candy or frying thermometer. The oil needs to reach 375&deg;F on the thermometer, which will take about 10-12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oil heats, prepare the batter. Place 1/2 cup of flour in a shallow bowl and set aside for the moment. Place 1 cup of flour in a small bowl and stir in the baking powder and salt. In a mixing cup, stir together the milk, vinegar, and oil. Whisk the wet ingredients into the dry until smooth and free of most lumps. The batter should be thicker than a pancake batter--if it seems too liquidy (as if it might drip off when you dip the cupcakes in it), whisk in the remaining flour until it has reached the desired consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cupcakes on sticks from your freezer. I found that it is best to fry one cupcake at a time, so you could take them out of the freezer a couple at a time so that the cupcakes fried later on don't get too warm while sitting out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, dredge your cupcake in the flour, covering it completely. Tap off excess and roll into the wet batter mixture until it is completely coated on all sides (the bottom may be bare; this is okay). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly dip the battered cupcake into the oil, holding the stick from the very end (do not drop it or you might get oil spatter!). You will only be dipping each cupcake for a very short time, so keep a careful eye on it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I did not wear gloves for this part and I didn't get burnt or spattered, but since the oil is very hot, it might be a good idea to wear an oven mitt to decrease the likelihood of getting spatter on your hands. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the batter has reached a pleasing golden hue, remove the cupcake from the oil and transfer to a plate covered with paper towel to soak up the excess grease. Repeat the battering and frying process with the remaining cupcakes, battering them one at a time directly before dipping in the frying oil. While frying, be sure to monitor the temperature of the oil and adjust your heat up or down accordingly so that it remains at 375&deg;F. If the oil is too cold it won't fry quickly enough and the cupcakes will soak up too much grease; if it is too hot, the outside will get dark before the inside is fully warmed, leaving you with a delicious shell but a partially defrosted cupcake inside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Do you have extra batter?</strong> </p>\r\n\r\n<p>I had a tiny bit left after frying all of my cupcakes, so I used it to deep fry a couple of peanut butter cups. It was delicious.</p>"}]}