{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Middle Eastern", "keywords": ["middle eastern", "rice", "Spice Hunting", "spices", "za'atar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Za'atar Rice Pilaf", "link": "https://www.seriouseats.com/recipes/2010/07/zaatar-rice-pilaf-recipe.html", "description": "Learn more about za'atar here » Za'atar is a great last-minute seasoning on all sorts of starchy foods, such as rice. I like to make a pilaf using za'atar in two stages: First, it's toasted with the rice in olive...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chicken", "Middle Eastern", "Rice"], "recipeIngredient": ["2 cups long grain rice", "1/2 lb. chicken sausage, sliced thin", "2 large yellow onions, sliced into half-moons", "1 large carrot, shredded fine", "1 large red bell pepper, diced", "6 cloves of garlic, minced", "2 heaping tablespoons of za’atar, divided", "2 cups of chicken stock, vegetable broth, or water", "Juice of one lemon", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the rice until the water runs clear. Then set it in a bowl to soak while prepping your other ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large saut&eacute;e pan on very high heat, then add a thin film of olive oil, followed by the sausage. Sear the sausage well, then set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the pan regain its heat, then add some more olive oil, followed by the carrot. Let the carrot caramelize, about five minutes, till it smells intensely sweet and the oil has turned orange. Set the carrot aside with the sausage. Add some more olive oil to the pan if it looks dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onions, bell pepper, and garlic, along with some salt. Reduce the heat to medium. Scrape the browned bits from the bottom of the pan and let the vegetables soften for ten to fifteen minutes. Then remove them and set aside with the carrots and sausage. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the rice and add it to the pan, increasing the heat to high. Stir well and make sure each grain of rice is coated with oil. Then add the first half of the za’atar. When the rice has turned tan and smells fragrant, add in the sausage, vegetables, and chicken stock, as well as more salt to taste. Stir to combine, cover, and cook on medium heat for fifteen to twenty minutes, until the rice is softened (though still with a little bite) and the liquid has evaporated. If the rice is looking done but is still too wet, let it cook uncovered for a couple minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, stir in the remaining za’atar and the lemon juice.</p>"}]}