{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101018soyricechicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "greens", "rice", "rice cooker", "Roger Ebert", "soy", "soy sauce", "The Pot and How to Use It"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Soy Rice and Chicken", "link": "https://www.seriouseats.com/recipes/2010/10/soy-rice-and-chicken-recipe.html", "description": "This <strong>Soy Rice and Chicken</strong> recipe was submitted to Roger Ebert's blog by a commenter in Taiwan. It's a spin on a family favorite&mdash;bits of chicken mixed with flavorful rice infused with ginger, onions, shiitakes, and plenty of soy sauce.  Like all of the recipes in <em>The Pot and How to Use It</em>, it's simple to prepare, basically just a matter of sautéing the chicken, mixing it with other ingredients, and pressing the \"cook\" button on your rice cooker.", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Chicken", "Cook the Book", "Rice"], "recipeIngredient": ["1/2 cup Japanese sushi rice", "Handful of dried shiitake mushrooms, the small variety (if large, cut into strips) ", "3/4 (rice cooker measuring) cup soy sauce", "4 tablespoons oil, divided", "1 thin slice of gingerroot, cut into thin strips", "Handful of chopped, nibble-sized chicken pieces, preferably deboned thighs", "2 tablespoons soy sauce", "3 1/2 cups regular rice ", "2 garlic cloves, squashed", "1/2 white onion, sliced into half-rings", "3 tablespoons soy sauce", "4 1/2 (rice cooker measuring) cups water", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the sushi rice and soak thoroughly in water for half an hour. Put aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the dried shiitake mushrooms in 3/4 cup soy sauce. Put aside (soak until soft).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a nonstick pan, heat 2 tablespoons of oil, then sauté the ginger. Quickly add in the chicken pieces with 2 tablespoons of soy sauce (to give the chicken color). Stir-fry until the chicken is cooked. Set aside on a plate and let cool thoroughly; this is important.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the sushi rice of water. Wash the ordinary rice clean and drain of water, too. Remember to drain both rices well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hand, squeeze the shiitake mushrooms of soy sauce, but mind that you do not waste the soy sauce because it will be used afterward.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same nonstick pan, heat 2 tablespoons of oil. Sauté the garlic, the the onion, and then the mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put in all the rice, the sushi and the regular, and also the 3 tablespoons of soy sauce. Stir-fry until the rice is evenly coated with oil and soy. Don’t take too long in stir-frying the rice (less than a minute).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rice mixture and the chicken into the rice cooker. Pour in 4 1/2 (rice cooker measuring) cups of water. Also pour in the soy sauce that you used to soak the dried shiitake mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a dash of salt (only a teeny bit).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let stand to cool for about 5 minutes or more, all the while stirring to dissipate the heat. Dissipating the heat is important so as not to mess with the gauging system of your cooker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After cooling, begin to cook the usual way in your rice cooker.</p>"}]}