{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100914ratatouille_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["chickpeas", "Eat for Eight Bucks", "inexpensive", "ratatouille"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Ratatouille and Chickpeas", "link": "https://www.seriouseats.com/recipes/2010/09/eat-for-eight-bucks-ratatouille-and-chickpeas-recipe.html", "description": "As pictured, <strong>ratatouille and chickpeas make a filling but very simple meal.</strong> I eat this at room temperature like a hearty salad. If that sounds too plain for your tastes, spring for some goat cheese. You can crumble that over the beans and vegetables one day and then make goat cheese and ratatouille tartines (or pizzas, yum) the next.", "totalTime": "", "recipeYield": "4, with leftovers", "recipeCategory": ["Eat for Eight Bucks", "Legumes", "Vegetables"], "recipeIngredient": ["1/4 cup Extra virgin olive oil (plus up to 1/4 cup more)", "1 large yellow onion, peeled, halved, and thinly sliced (about 1 1/2 cups)", "1 pound eggplant cut into 3/4-inch dice (about 2 cups)", "1 green or red bell pepper, chopped (about 1 cup)", "1 pound zucchini cut into 3/4-inch dice (about 1 1/2 cups)", "3-4 sprigs fresh thyme or 1/4 teaspoon dried", "Kosher salt and freshly ground black pepper", "1 pound fresh tomatoes, seeded and roughly chopped (about 1 1/2 cups)", "1/2 teaspoon red wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/4 cup olive oil in Dutch oven over medium high heat until shimmering. Add onions and cook, stirring frequently until sizzling, about 3 minutes. Reduce heat to medium-low and cook, stirring occasionally, until softened but not brown, about 10 minutes. Add eggplant, pepper, zucchini, and thyme. Season with salt and pepper and cook until vegetables soften, about 10 minutes, stirring occasionally. Add up to 1/4 more olive oil if pan looks dry or ingredients stick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in tomatoes, cover pot, and reduce heat to low. Cook 30 minutes, stirring once or twice. Remove cover and cook, stirring occasionally, until thick stew-like consistency is reached, about 10 minutes longer. Add vinegar and season to taste with salt and pepper. Ratatouille can be eaten hot, warm, or cold but is best at room temperature.</p>"}]}