{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101012steakandeggskoreanstyle.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Brendan Vaughan", "kimchi", "Melissa Vaughan", "steak", "The Good Fork", "The New Brooklyn Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Steak and Eggs Korean Style", "link": "https://www.seriouseats.com/recipes/2010/10/steak-and-eggs-korean-style-recipe.html", "description": "The husband and wife team behind The Good Fork, <strong>Sohui Kim and Ben Schneider,</strong> have created a menu that leans on both Korean and new American flavors to make what is arguable their most famous creation, <strong>Steak and Eggs Korean Style.</strong> The dish begins by marinating skirt steak in an combination of rice wine, sesame oil, Korean hot pepper paste, and a slew of other Asian ingredients.  Once grilled the steak sits on top of a pile of spicy-sour-crispy <strong>kimchi fried rice</strong> and each portion is topped with a fried egg and a side of lightly dressed baby arugula.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Cook the Book"], "recipeIngredient": ["1/4 cup mirin (rice wine, available in the Asian section of supermarkets)", "2 tablespoons finely grated Granny Smith apple", "2 tablespoons soy sauce ", "2 tablespoons light corn syrup ", "1 1/2 tablespoons finely chopped scallion (white and light green parts)", "1 scant tablespoon korean hot pepper paste pepper paste (gochujang or kochujang) ", "1 scant tablespoon peeled and minced fresh ginger", "2 garlic cloves, minced ", "1 1/2 teaspoons toasted sesame oil", "1 1/2 teaspoons unseasoned rice wine vinegar", "Four 5-ounce pieces skirt steak", "<strong>For the kimchi rice:</strong>", "1 cup sushi rice or other short-grain rice", "Coarse salt", "2 tablespoons plus 1 teaspoon canola oil, divided ", "1 1/2 cups napa cabbage kimchi, coarsely chopped", "2 tablespoons unseasoned rice wine vinegar", "Freshly ground black pepper ", "4 large eggs ", "Chopped scallions, for garnish ", "1 cup baby arugula", "1 tablespoon extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To marinate the steaks,</strong> whisk the marinade ingredients in a large bowl. Add the steaks. Cover and chill overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the rice,</strong> bring 2 cups water to a boil in a small saucepan. Add the rice and 1 teaspoon salt and return to a boil. Reduce the heat to low, cover, and cook until the water is absorbed, about 20 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the grill for cooking or heat a ridged grill pan over medium-high heat until hot. Grill the steaks until they are slightly charred but still pink in the center, about 3 minutes per side. Transfer to a plate and let stand for about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the canola oil in a large skillet over medium heat. Add the kimchi and mirin and stir until heated. Fold in the rice. Season to taste with salt and pepper and keep warm.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining teaspoon of canola oil in a large nonstick skillet over medium heat. Crack the eggs into the skillet, being careful not to break the yolks. Sprinkle with salt and pepper. Cook until the whites are set, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, toss the baby arugula with the olive oil and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve,</strong> divide the kimchi rice among 4 plates. Slice the steaks thin across the grain and arrange over the rice. Top each plate with an egg, sprinkle with chopped scallions, and serve with arugula.<br />\n</p>"}]}