{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100629-dt-blt-salad.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["aioli", "Dinner Tonight", "salads", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Bacon, Lettuce, and Tomato Salad with Aioli Dressing", "link": "https://www.seriouseats.com/recipes/2010/06/bacon-lettuce-and-tomato-salad-recipe.html", "description": "Sometimes when you come across a recipe, a light bulb goes off&mdash;you know you have to cook it. This had that effect on me. More than anything, I was amazed this idea had never occurred to me. Why wouldn't <strong>the sublime combination of bacon, lettuce, and tomato translate from sandwich to salad?</strong>  This <a href=\"http://www.epicurious.com/recipes/food/views/Bacon-Lettuce-and-Cherry-Tomato-Salad-with-Aioli-Dressing-359533\">recipe from <em>Bon Appetit</em></a> claimed it would.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Bacon", "Dinner Tonight", "Salads"], "recipeIngredient": ["5 ounces thick-cut bacon, about 6 slices, cut crosswise into matchsticks", "12 cups torn romaine lettuce leaves, from 1 large head (about 13 ounces), washed and dried", "8 ounces cherry or grape tomatoes, halved, or larger tomatoes cut into wedges", "1 clove garlic, minced or pressed", "3 tablespoons mayonnaise", "1 1/2 tablespoons white wine vinegar", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bacon in large skillet over medium-high heat.  Once it begins to sizzle, turn the heat to medium-low and cook slowly until chewy and slightly crisp.  Remove to drain on paper towels, leaving a tablespoon of fat in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the heat to medium and add the garlic to the skillet.  Cook for a minute or two, until soft and fragrant, then remove from the heat.  In the meantime, place lettuce and tomatoes in a large salad bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the mayonnaise, vinegar, and garlicky bacon drippings in the skillet.  Season to taste with salt and pepper, then pour over lettuce and toss to coat.  Top with bacon and serve immediately.</p>"}]}