{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100921tortillasoupprim.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["black beans", "Eat for Eight Bucks", "Mexican", "soup", "tortilla soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Tortilla Soup", "link": "https://www.seriouseats.com/recipes/2010/09/eat-for-eight-bucks-tortilla-soup.html", "description": "I've made plenty of tortilla soups from cookbooks over the years, but none has pleased me as much as the simple one I improvised last week. Although my gut tells me that means it was the kind of success that comes only when the planets are aligned, I want to share the recipe because it's an ideal one for fridge-clearing. It's so flexible that it could be called <strong>tortilla soup with or without tortillas. </strong>", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Beans and Pulses", "Eat for Eight Bucks"], "recipeIngredient": ["1 cup canola oil", "2 corn tortillas cut into 1/3-inch strips (see note)", "Kosher salt", "1 tablespoon olive oil", "1/2 small onion, roughly chopped (about 1/2 cup)", "2 cloves garlic, crushed", "1 teaspoon chili powder (or 1 ground arbol chili combined with 1/2 teaspoon ground cumin and 1/2 teaspoon dried oregano)", "6 cups low-sodium chicken broth (see note)", "1 medium zucchini, cut into 1/2-inch dice (about 1 cup)", "1 medium tomato, chopped (about 1/2 cup, or 1/2 cup diced canned tomatoes)", "Kernels from 1 ear corn (about 3/4 cup, or 3/4 cup frozen corn)", "1/2 cup diced or shredded cooked chicken (optional)", "Freshly ground black pepper", "1/4 cup chopped cilantro", "2 ounces grated or crumbled pepper jack, jack, or feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add canola oil to heavy-bottomed 12-inch cast iron pan and set over high heat until shimmering, about 2 minutes (test oil temperature by dropping single tortilla strip in&mdash;it should bubble rapidly). Add strips and stir well to coat with oil. Stir once per minute until strips begin to stiffen and color, about 2 minutes. Reduce heat to medium and continue to cook, stirring frequently, until strips are as crisp and tanned, a few minutes longer. Use slotted spoon to remove to paper-towel-lined plate and salt lightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a heavy-bottomed three-quart saucepan over medium high heat until shimmering. Add onion, turn heat to medium low, and cook, stirring frequently, until very soft and translucent but not browned, about 10 minutes. Add garlic and chili powder and cook, stirring constantly, until fragrant, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in broth and bring to a boil. (If using bouillon powder, add water, bring to boil, and stir in powder before proceeding.) Add zucchini to pot, adjust heat so liquid simmers, and simmer 5 minutes. Add tomato and simmer 2 minutes. Add corn (and chicken, if using) and simmer 3 minutes. Taste zucchini for doneness; in the unlikely event that it is not yet ready to eat, simmer a minute or two more. Season to taste with salt and pepper and serve immediately with tortillas, cilantro, and cheese.</p>"}]}