{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100624whitebean.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["beans", "dips", "holiday dips", "vegetarian", "za'atar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mediterranean Flavors: White Bean Spread with Za'atar", "link": "https://www.seriouseats.com/recipes/2010/07/white-bean-spread-with-zaatar-recipe.html", "description": "Just because I like my white bean spread simple doesn't mean I like it boring. My favorite seasoning is <strong><a href=\"http://www.seriouseats.com/2010/07/spice-hunting-what-is-zaatar-how-to-use.html\">za'atar</a>,</strong> a blend of dried herbs (usually thyme, sometimes with others), sesame seeds, and spices like sumac.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Tastes of the Mediterranean", "Vegetarian"], "recipeIngredient": ["1 pound (2 cups) of small dried cannelini or Great Northern beans, soaked overnight", "6 cloves of garlic, peeled and smashed", "3/4 cup of extra virgin olive oil", "2 tablespoons of za’atar", "Zest of two lemons", "Juice of 1 1/2 lemons", "1/4 teaspoon of sugar, if needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring your beans and the garlic to a boil in a large, heavy pot for a couple minutes, then reduce to a simmer. Half-cover the pot and let the beans cook till very tender. Add salt to taste and let them cool in the pot. If you don’t have time for dried beans, two 15 oz. cans of beans are also fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside 1/2 cup of the cooking liquid (save the rest for another use) and transfer the beans to a food processor and pur&eacute;e. Through the feed tube, slowly pour in the reserved cooking liquid and the olive oil. If using canned beans, use more olive oil, stock, or water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the za’atar, lemon zest, and lemon juice, then pulse a few times to combine. Tinker with the salt, acid, and za’atar if needed. If the spread feels like it’s lacking a certain depth of flavor, that tiny pinch of sugar can go a long way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the spread to a bowl and sprinkle on some more za’tar and olive oil. Let the spread cool to room temperature before serving. If you want to save some for later, move it to a smaller container, cover it with a thin layer of olive oil, and store it in the freezer.</p>"}]}