{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100326-sliders-beauty.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "sandwiches", "sliders"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "The Ultimate Sliders", "link": "https://www.seriouseats.com/recipes/2010/03/the-ultimate-sliders-recipe.html", "description": "There's more than meats the eye between these diminutive buns: Check out the science here....", "totalTime": null, "recipeYield": "a dozen sliders", "recipeCategory": ["Beef", "Burger", "Sandwiches"], "recipeIngredient": ["1 large onion, finely minced (about 2 cups)", "Kosher salt", "1 1/8 pounds <a href=http://www.seriouseats.com/recipes/2009/10/the-blue-label-burger-blend-recipe.html\">freshly ground beef</a>", "1 medium onion, peeled and grated on the medium holes of a box grater, juices and pulp reserved (about 1 1/2 cups)", "Freshly ground black pepper", "12 silce American cheese (optional)", "16 slider-sized buns (about 2 1/2- to 3-inches across)", "24 thin dill pickle slices", "Condiments, as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss diced onion with 1 teaspoon kosher salt in medium bowl. Set aside at room temperature until fragrant, about 10 minutes. Meanwhile, divide beef into 12 evenly sized balls. Using damp hands, press balls into even, patties approximately 1/8th-inch thick, and 3 1/2-inches wide. Place on large plastic-wrap line plate. Patties can be stacked with layer of plastic wrap between each layer. Place in refrigerator until ready to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat heavy-bottomed 12-inch skillet over medium low heat until evenly heated, about 5 minutes. Reduce heat to low, and add half of diced onion, using spatula to spread into even layer across bottom of pan. Cook without moving until bottom of onions starts turning pale golden brown, about five minutes (onions should barely sizzle while cooking&mdash;adjust heat as necessary).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of grated onions and their juice to skillet. Stir onions with rubber spatula to release browned bits from bottom of pan and spread into thin, even layer. Arrange six hamburger patties on top of onion mixture. Season top of patties with salt and pepper. Add 6 slices of American cheese if desired. Place bun bottoms, cut-side-down, on top of patties. Place bun tops, cut-side-down, on top of bun bottoms, staggering arrangement to maximize exposure to steam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking over low heat until burgers are cooked through and cheese is fully melted, about 3 minutes, adding extra onion juice if pan runs dry, making sure to reserve at least half for second batch (there should be no sizzling sound, and mixture should steam constantly&mdash;in some rare cases, substituting water may be necessary if onion juice all runs out). Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift and bun with spatula. Pick up bun top, invert, and place underneath spatula (burger should now be fully assembled, upside down). Slide spatula out from between burger and bun top. Invert, and place on plate. Repeat with remaining 5 burgers. Spoon any remaining onions and melted cheese in skillet on top of each burger patty, along with two pickles, and condiments as desired. Consume immediately, before repeating with remaining 6 sliders.</p>"}]}