{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100818-coffeetoffee.jpg", "author": {"@type": "Person", "name": "Liz Gutman"}, "recipeCuisine": "", "keywords": ["chocolate", "coffee", "Serious Chocolate", "toffee"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coffee Toffee", "link": "https://www.seriouseats.com/recipes/2010/08/coffee-toffee-candy-recipe.html", "description": "Adapted from Smitten Kitchen...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["1 cup (2 sticks or 8 ounces) butter ", "1/2 cup light brown sugar", "1/2 cup white sugar", "1 1/2 teaspoons molasses (can swap corn syrup or honey)", "1/4 teaspoon salt (or a heaping 1/4 teaspoon flaky sea salt)", "1 1/2 teaspoons instant espresso powder", "1 cup semisweet chocolate chips, or 6 ounces semisweet chocolate, chopped ", "1/2 cup chopped hazelnuts (toasted, skinned and cooled) or another nut of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a small (9\"x13\") baking sheet with parchment paper or a silicone mat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium heavy saucepan (3 to 4 quarts) with a candy thermometer attached, melt the butter, brown sugar, white sugar, molasses, salt and espresso together. Cook over medium heat, stirring occasionally with a whisk (one that reaches into the corners is especially helpful here) until the temperature approaches 250°F, at which point you should stir constantly until it reaches 300°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour immediately into the prepared baking sheet&mdash;you can spread it more evenly with a offset or silicon spatula, but don't worry if you have neither. Sprinkle the chocolate chips over the toffee and let them sit for a minute until soft, then spread the chocolate evenly over the candy base. Sprinkle the chocolate with chopped hazelnuts; if you want to expedite the cooling process, you can slide the sheet onto a cooling rack in the freezer until the toffee is set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break into pieces and store in an airtight container. If your kitchen runs warm, you might prefer to keep it in the fridge so the chocolate doesn't get soft.</p>"}]}