{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100418mushroom%20tart_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["mushrooms", "Sunday Brunch", "tarts", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Mushroom Tart with Herb Salad", "link": "https://www.seriouseats.com/recipes/2010/04/sunday-brunch-mushroom-tart-with-herb-salad-recipe.html", "description": "Buttery, flaky pastry and perfectly cooked and seasoned mushrooms surrounding a layer of creamy, cheesy goodness: this gorgeous mushroom tart with herb salad is less labor-intensive but no less excellent than many of the other recipes in <em>Sunday Suppers at Lucques. </em>It can even be assembled hours in advance and then popped into a preheated oven when your guests arrive.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Mushrooms", "Vegetarian"], "recipeIngredient": ["1 sheet frozen all-butter puff pastry ", "2 egg yolks", "1 1/4 pound assorted mushrooms, cleaned and torn into large bite-size pieces", "5 tablespoons extra-virgin olive oil", "2 tablespoons unsalted butter", "Kosher salt", "Freshly ground black pepper", "1 1/2 cups sliced young onions, plus 1/4 cup diagonally sliced young onion tops", "1 teaspoon thyme leaves", "1/2 cup whole milk ricotta, drained if wet", "1/4 cup crème fraîche", "1/4 pound Gruyère, thinly sliced or grated", "1/2 cup flat-leaf parsley leaves", "1/4 cup tarragon leaves", "1/4 cup chervil sprigs or marjoram leaves", "1/4 cup 1/2-inch snipped chives", "1/2 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large saute pan over high heat for 2 minutes. Swirl in 2 tablespoons of olive oil and wait 1 minute. Add 1 tablespoon butter, and when it foams, scatter half the mushrooms into the pan. Season with 1/2 teaspoon salt and a healthy pinch of pepper. Saute about 5 minutes, stirring occasionally, until the mushrooms are tender and a little crispy. (The cooking time will depend on your particular mushrooms.) Transfer the cooked mushrooms to a baking sheet and repeat with the second half of the mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the second batch of mushrooms are just cooked, reduce the heat to low and toss in the spring onions, thyme, and 1/2 teaspoon salt. Stir gently 1 to 2 minutes, until the onions are just wilted. Stir in the onion tops. Transfer to the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the ricotta, remaining egg yolk, and remaining tablespoon olive oil into the bowl of a food processor. Puree until smooth and remove to a  mixing bowl. Fold in the crème fraîche and season with a healthy pinch of salt and a few grindings of pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the tart 20 to 25 minutes, rotating the baking sheet after 10 minutes, until the cheese is bubbling and the crust is golden brown. Lift the crust to peek underneath the tart to make sure the crust is really cooked through; if you underbake the tart, it will be soggy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the herbs in a small bowl with salt, pepper, a drizzle of olive oil, and a squeeze of lemon juice. After the tart has cooled for a few minutes, serve it on a cutting board at the table. Serve the herb salad on the side in a small bowl or scatter it over the tart.</p>"}]}