{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101221-129762-SeriousHeat-Chocolate-Chile-IceboxCake-LARGE.jpg", "author": {"@type": "Person", "name": "Andrea Lynn"}, "recipeCuisine": "", "keywords": ["cakes", "chiles", "chocolate", "graham crackers", "icebox cakes", "Serious Heat", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Serious Heat: Chocolate-Chile Icebox Cake", "link": "https://www.seriouseats.com/recipes/2010/12/chocolate-chile-icebox-cake-recipe.html", "description": "I have a love affair with icebox cakes. A tower of cookies layered with whipped cream or custard sits overnight in the fridge. After the stint, the cookies have absorbed the moisture, turning into a cakey consistency. Hands down, it's one of the simplest ways to create a cake, which comes in handy after a holiday season full of frenzied baking. And since I add a blast of heat to everything, the whipped cream for this chocolate icebox cake is flavored with cocoa powder, New Mexican chile powder and cayenne. The result is a chocolate-chile slice of heaven that has never been easier to create.", "totalTime": "30 minutes, plus overnight", "recipeYield": "4", "recipeCategory": ["Cakes", "Chocolate", "Serious Heat"], "recipeIngredient": ["1 1/2 tablespoons cocoa powder", "2 teaspoons New Mexican chile powder", "1 teaspoon cayenne powder ", "2 teaspoons confectioners’ sugar", "1 teaspoon vanilla extract", "1 cup heavy cream ", "1 (14.4-box) chocolate graham crackers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, add cocoa powder, chile powder, cayenne, sugar, extract and heavy cream. Beat with electric mixture on high speed until soft peaks are formed. Reserve 1/3 cup of whipped cream for later use. On a plate, use spatula to spread 1 tablespoon of whipped cream on plate to hold cake to plate. Top with two whole graham crackers placed side-by-side. Use the spatula again, and spread graham crackers with even layer of whipped cream. Top with two more remaining graham crackers, and repeat cycle until whipped cream is finished, ending with a layer of whipped cream, about 5 to 6 layers of graham crackers. Smooth top, and use reserved whipped cream to spread onto the sides of cake. Cover with plastic wrap and place in the fridge overnight before serving. </p>"}]}