{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100809-dt-steak-with-gribiche-sauce.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beef", "gribiche", "grill", "grilling", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Steak With Sauce Gribiche", "link": "https://www.seriouseats.com/recipes/2010/08/dinner-tonight-grilled-steak-with-sauce-gribiche-recipe.html", "description": "Gribiche is a classic French sauce, but that doesn't mean anyone can agree on how it's properly made.  It always seems to have egg in some form, that's a given--as well as plenty of herbs, oil, vinegar, and some piquant mix-ins like capers or cornichons. The hard-boiled version is a little less uniform, and the bits of egg white give it an appealing texture.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Dinner Tonight", "Grilling"], "recipeIngredient": ["2 pound steak, such as skirt or flank", "1 egg", "1 shallot, finely chopped", "2 tablespoons sherry vinegar or red wine vinegar", "1 tablespoon Dijon mustard", "Salt to taste", "1 1/2 cups mild olive oil, or a mix of neutral and olive oils", "3 tablespoons mixed chopped herbs, such as parsley, chives, tarragon, dill, etc.", "2 tablespoons capers, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a small pot of water to a simmer and carefully lower in the egg.  Bring to a boil, then turn down to simmer for 4 minutes.  Remove and cool completely under a cold faucet, or in a bowl of ice water.  Carefully remove the shell and place the egg in a bowl with the mustard, vinegar, shallots, and a good pinch of salt. Mash lightly to combine, then drizzle in the oil very slowly, whisking vigorously, to create an emulsion.  You can add the oil a little more quickly once a good emulsion has been formed, whisky all the while.  Add the herbs and capers and season to taste with salt and vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the steaks with salt, pepper, and a little oil. Grill to desired doneness on a grill or grill pan.  Remove from the heat and allow to rest at least five minutes, then slice and arrange on a platter. Spoon the sauce over the steaks, or serve it separately.</p>"}]}