{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101011brickchicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Brendan Vaughan", "chicken", "Cook the Book", "Marlow and Sons", "Melissa Vaughan", "mustard greens", "The New Brooklyn Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Brick Chicken with Mustard Greens", "link": "https://www.seriouseats.com/recipes/2010/10/brick-chicken-with-mustard-greens-recipe.html", "description": "This recipe for <strong>Brick Chicken with Mustard Greens</strong> is adapted from one of my favorite Brooklyn restaurants, <strong><a href=\"http://marlowandsons.com/\">Marlow and Sons</a></strong> in Williamsburg.  The daily menu consists of cheeses, oysters, charcuterie, and a few select entrees, but it's supplemented daily with a host of specials created with seasonality and sustainability in mind.  Marlow's Brick Chicken has been on the menu since the beginning of the restaurant's conception.  It's a simple dish that showcases Marlow's strengths&mdash;perfectly cooked proteins and raw, seasoned greens. Enter here to win a copy of the book.", "totalTime": null, "recipeYield": "2 to 3", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["4 tablespoons extra-virgin olive oil, divided", "1 tablespoon canola oil", "One 3- to 4-pound organic chicken, halved, with the backbone, rib cage, and thigh bones removed (the butcher will do this for you)", "Coarse salt and freshly ground black pepper ", "1/3 cup homemade chicken stock or prepared low-sodium chicken broth", "1 tablespoon freshly squeezed lemon juice", "1 bunch mustard greens (about 1 pound), washed, stems removed, and leaves cut into 1-inch pieces ", "2 tablespoons sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the olive oil and the canola oil in a 10-inch cast-iron skillet over high heat. Season the chicken generously with salt and pepper.  When the oil begins to smoke, add the chicken halves to the skillet, skin side down. Place another 10-inch skillet, right side up, on top of the chicken and gently place a heavy brick or soup cans in the top skillet to weigh it down.  The weight should be at least 20 pounds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium high and cook the chicken until the skin is golden brown and crisp, about 18 minutes. Remove the top skillet and weights, turn the chicken with tongs, and pour off any excess fat from the skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken stock and lemon juice and cook the chicken until an instant-read thermometer inserted into the thickest part of the thigh registers 160&deg;F, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the chicken finishes cooking, prepare the mustard greens. In a large bowl, combine the remaining 2 tablespoons olive oil and the sherry vinegar.  Add the greens and toss to coat. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the chicken and mustard greens with the pan juices.<br />\n</p>"}]}