{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101112altonbrownturkeywithstuffing.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alton Brown", "Cook the Book", "Good Eats: The Middle Years", "holiday recipes", "stuffing", "Thanksgiving turkeys", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Turkey with Stuffing", "link": "https://www.seriouseats.com/recipes/2010/11/turkey-with-stuffing-recipe.html", "description": "Having subscribed to <strong>Alton Brown's anti-stuffing school of thought</strong> for a long time, this was my first experience with stuffing actually cooking inside the turkey.  Once the turkey was brought up to the safe temperature of 170°F, I took it out of the oven and nibbled on a few preliminary bites. How different is <em>true</em> stuffing?  The cooking turkey juices had seeped inside, making for a bready mix that was <strong>much moister, meatier, and deeply flavored than usual.</strong>  It made me fully appreciate why so many folks swear by the stuffed bird; it really does taste better.", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Chicken", "Cook the Book", "Turkey"], "recipeIngredient": ["One 10- to12-pound turkey, giblets removed", "1 quart chicken broth", "2 ounces dried mushrooms", "1 cup onion, chopped", "1 cup celery, chopped", "1 cup green bell pepper, chopped", "1 tablespoon vegetable oil, plus extra for the turkey", "1 tablespoon kosher salt, plus extra for the turkey", "3 cups challah bread, cut into 1/2-inch cubes", "4 ounces dried cherries, about 1 cup", "2 ounces pecans, chopped", "2 large eggs, beaten", "2 teaspoons dried rubbed sage", "2 teaspoons dried parsley", "teaspoon freshly ground black pepper, plus extra for the turkey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the turkey in a deep bowl with the stuffing end up. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the chicken broth in an electric kettle (or in the microwave in a microwave-safe vessel). Put the mushrooms in a heatproof bowl and pour the broth over them. Cover and set aside for 35 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the onion, celery, and bell pepper with the oil and salt in a large mixing bowl. Spread the vegetables on a half sheet pan and roast for 35 minutes. During the last 10 minutes of cooking, spread the bread cubes over the vegetables, return to the oven, and continue cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the mushrooms in a colander or sieve, reserving 1 cup of liquid. Chop the mushrooms and put them in a large microwave-safe bowl with the vegetables and bread, reserved soaking liquid, cherries, pecans, eggs, sage, parsley, and black pepper. Stir well to break up the pieces of bread. Use your hands to combine, if necessary. Fill the produce bag, if using, with the stuffing (a flexible cutting board folded into a funnel shape is best for this). Heat the stuffing in the microwave on high for 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the stuffing is heating, rub the bird with oil and season with salt and pepper. Working quickly, place the stuffing in the cavity of the turkey to avoid losing heat (again, a flexible cutting board is best for this). Place the turkey on a rack in a roasting pan and season with salt and pepper. Roast on the middle rack of the oven for 45 minutes. Reduce the oven temperature to 350°F and cook for another 60 to 75 minutes, until the bird and the stuffing both reach an internal temperature of 170°F. Remove the stuffing if using the bag. Let the bird rest for 15 to 20 minutes before carving. Serve immediately.</p>"}]}