{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101012sauerbraten%20.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Brendan Vaughan", "brisket", "cabbage", "Cook the Book", "Frank Castronovo", "Frank Falcinelli", "Melissa Vaughan", "pretzels", "Prime Meats", "The New Brooklyn Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Beef Sauerbraten with Red Cabbage and Pretzel Dumplings", "link": "https://www.seriouseats.com/recipes/2010/10/beef-sauerbraten-with-red-cabbage-pretzel-dumplings-recipe.html", "description": "This recipe for <strong>Beef Sauerbraten with Red Cabbage and Pretzel Dumplings</strong> is a mix of old world and new&mdash;fairly standard brisket in a sour and aromatic marinade, slow-roasted and served with melting sweet and sour red cabbage.  The Franks' modern take comes in with the pretzel dumplings.  Day-old soft pretzels are mixed into a rich egg dough, rolled into logs, poached, and finally pan-fried into something that I can only compare to a crisp pretzel bread pudding.  When the <strong>super tender brisket, sweet cabbage, and carb-tacular dumplings</strong> come together they make for a knockout of a cold weather plate.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cabbage", "Cook the Book", "Desserts"], "recipeIngredient": ["<strong>For the beef sauerbraten:</strong>", "2 pounds beef brisket", "2 cups dry red wine", "1 cup red wine vinegar", "4 juniper berries", "2 teaspoons white peppercorns", "1 celery stalk, cut into large dice", "2 carrots, cut into large dice", "1 leek, sliced", "2 garlic cloves, peeled and cut in half", "4 yellow onions, 3 cut into 1/4-inch slices, and 1 diced", "1/4 cup canola oil", "Coarse salt and freshly ground black pepper", "2 Granny Smith apples, peeled and cut into 1/2-inch dice", "1 cup golden raisins", "1 bay leaf", "1 teaspoon fresh or dried thyme", "3/4  cup homemade beef or chicken stock or prepared low-sodium beef or chicken stock", "<strong>For the pretzel dumplings:</strong>", "1 cup whole milk", "6 day-old soft pretzels,* about 2 ounces each, sliced 1/8-inch thick", "Coarse salt and freshly ground black pepper", "3 to 4 tablespoons unsalted butter, divided", "1 medium Spanish onion, finely diced", "1/4 cup chopped fresh flat-leaf parsley", "1 large egg, lightly beaten", "<small><strong>Note:</strong> Buy soft pretzels in your supermarket's freezer section. Bake them one day, then use them to make the dumplings the next day.</small>", "<strong>For the sweet-and-sour cabbage:</strong>", "5 tablespoons unsalted butter", "1/2 cup diced red onion", "1 medium white onion, diced", "2 Granny Smith apples, peeled and cut into small dice", "1 large red cabbage, about 3 pounds, cored and sliced thin", "2/3 cup dried cherries", "1 1/2 cups dry red wine", "2 whole cloves", "1/3 cup brown sugar ", "1 bay leaf", "1/8 cup apple cider vinegar ", "Freshly squeezed juice of 1/2 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the sauerbraten,</strong> place the brisket in a deep pan or Dutch oven. Add the wine, vinegar, juniper berries, peppercorns, celery, carrots, leek, garlic, and 1 of the sliced onions. The brisket should be completely submerged. Cover and refrigerate for 4 days. Turn the meat once each day. After four days, remove the meat from the marinade and pat it dry. Strain and reserve the marinade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 275&deg;F. Heat the oil in a large Dutch oven over high heat until hot but not smoking. Add the brisket and brown it on all sides, about 10 minutes. Remove the meat, leaving the fat in the pan, and season with salt and pepper. Add the 2 remaining sliced onions. Reduce the heat to medium and cook, stirring occasionally, until the onions are tender and caramelized, about 15 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Deglaze the pan by adding the reserved marinade and scraping the bottom of the pan to release any browned bits. Add the apples, raisins, bay leaf, and thyme and stir to combine. Return the meat to the pan with any accumulated juices and bring to a simmer over medium heat. Cover the pot and transfer to the oven. Braise for 2 1/2 hours, or until the meat is very tender, turning the meat halfway through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the pretzel dumplings while the meat is braising.</strong> Warm the milk in a small saucepan over low heat. Place the pretzels in a large bowl and pour the warm milk over the top. Season lightly with salt and pepper. Cover the bowl with plastic wrap and let the pretzels soak for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a sauté pan, melt 1 tablespoon of the butter over medium heat. Add the onion and sauté until translucent. Season with salt and remove from the heat. Stir in the parsley, then add the seasoned onion to the dumpling mixture and, using your hands, mix to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of lightly salted water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg to the dumpling mixture and incorporate well. Using your hands, squeeze the mixture through your fingers to break it up. With slightly wet hands, form 3 smooth logs that are 2 inches across.<br />\r\nWrap each log in plastic wrap and twist the ends to secure them. Then wrap them in aluminum foil and secure the ends. Drop the logs into the boiling water. Return to a boil, then reduce heat and simmer, partially covered, for 30 minutes. Remove from the water, open the foil and plastic wrap to allow the logs to cool.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, prepare the cabbage.</strong> In a Dutch oven or large skillet fitted with a lid, melt the butter over medium heat. Add the onions and apples and sauté until the onions are translucent, about 5 minutes. Add the cabbage, cherries, red wine, cloves, brown sugar, and bay leaf, stirring to combine. Increase the heat to medium high and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan, reduce the heat, and simmer, stirring occasionally, for 1 hour. Remove the bay leaf and stir in the cider vinegar and lemon juice. Cook for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the brisket is tender, transfer it to a cutting board. Add the stock to the Dutch oven and reduce over medium heat, until the sauce is reduced by half, about 20 minutes. Season with salt and pepper to taste.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the brisket against the grain and return to the pot with the sauce. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To finish the pretzel dumplings,</strong> discard the foil and plastic wrap and cut the logs into 1/2-inch-thick slices. Melt 1 tablespoon of the butter in a large sauté pan over medium-high heat. Working in batches and using<br />\r\nmore butter as needed, add the sliced dumplings to the pan and sauté until golden, 1 or 2 minutes. Turn and cook for 1 minute more.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve,</strong> place a cup of braised red cabbage on each of 6 plates and top with 3 slices of brisket. Spoon the sauce over the meat and serve with 3 pretzel dumplings on the side.<br />\r\n</p>"}]}