{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["french fries", "potatoes", "sides", "The Burger Lab", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Perfect French Fries: Iteration 1", "link": "https://www.seriouseats.com/recipes/2010/01/perfect-french-fries-iteration-1-recipe.html", "description": "Note: Want to know why you have to double fry? Check it out here. If you don't have a fry cutter or thick mandoline, take your time cutting the potatoes thinly and uniformly&mdash;it will pay off in the results. If...", "totalTime": "", "recipeYield": "2 to 4, depending on how hungry or depressed they are", "recipeCategory": ["French Fries", "Sides", "The Burger Lab", "Vegetarian"], "recipeIngredient": ["4 large russet potatoes (about 2 pounds), peeled, cut into 3/8-inch matchsticks", "2 quarts peanut oil", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in bowl of cold water and rinse, changing water until water runs completely clear. Drain potatoes and dry thoroughly with paper towels or kitchen towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using oil thermometer or instant read thermometer, heat oil in large Dutch oven or wok (oil should come no more than half way up the sides) to 350&deg;F. Add potatoes and cook, stirring and turning frequently until pale blond with lightly bubbled surface, about 5 minutes (oil will drop in temperature when you add potatoes&mdash;adjust heat to maintain oil between 300 and 325 degrees F). Remove potatoes and drain on paper towel-lined baking sheet. At this point, potatoes can be refrigerated overnight, or frozen and kept in an airtight container in the freezer for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil to 425&deg;. Add potatoes and cook, stirring and turning frequently, until golden brown, about 2 minutes (oil will drop in temperature when adding fries&mdash;adjust heat to maintain temperature between 375 and 400&deg;F). Transfer to paper towel-lined bowl, season with salt, and toss to remove excess oil. Serve immediately.</p>"}]}