{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100614-dt-pork-chops-with-onion-and-apples.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Dinner Tonight: Thick-Cut Pork Chops with Apples and Onion", "link": "https://www.seriouseats.com/recipes/2010/06/dinner-tonight-thick-cut-pork-chops-with-apples-onion-recipe.html", "description": "This recipe, adapted from the stupendous cookbook <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/1579653561/serieats-20\">Mad Hungry</a></em>, pairs the pork with the classic flavors of apple and onion in a quick-to-prepare pan sauce that becomes a braising liquid to finish cooking the pork. Beer, wine, cider, or chicken broth are all options to base the sauce around, so I went with half beer and half chicken stock. The beer added a touch of bitterness against the sweet onion and apple. <strong>The resulting sauce is remarkably rich,</strong> making full use of the porky pan bits left after searing. This is really top-notch comfort food, enough to erase a thousand memories of the dry, thin pork chops of my childhood.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Mains", "Pork"], "recipeIngredient": ["4 bone-in thick-cut pork chops", "Salt and pepper", "1 tablespoon olive oil", "2 tablespoons butter", "1 large white onion, sliced", "2 to 3 apples, cored and sliced, about 3 cups", "1 cup beer, white wine, cider, or chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim any excess fat from the chops and season liberally with salt and pepper.  In a very large, heavy skillet (large enough to hold the chops with room to spare, preferably cast iron), heat the oil over high heat.  Once it is shimmering and very hot, add the chops carefully and cook undisturbed for a few minutes for a good sear, about 5 minutes.  Turn and sear the other side, then remove the chops to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to medium-low and swirl in the butter, then add the apple and onions. Cook until the onion is golden and the apple is softened, 8-10 minutes, then deglaze the pan with the beer or other liquid.  Return the chops to the pan and cook, turning occasionally and covering with the sauce, for an additional 5-10 minutes, until the chops are done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, remove the chops and turn the heat to high to thicken the sauce.  Serve the chops with the sauce draped over them.</p>"}]}