{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100315-braised%20artichoke%20primary.JPG", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Artichoke with Parsley and Fried Capers", "link": "https://www.seriouseats.com/recipes/2010/03/braised-artichoke-with-parsley-and-fried-capers-recipe.html", "description": "This is one of those dishes that deserve the extra effort of trimming artichokes. I made it the other day when I was home alone and it took every bit of self-restraint I had to keep myself from eating the whole thing before shooting the photos.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Other Vegetables"], "recipeIngredient": ["4 medium artichoke hearts, with trimmed stems attached", "2 to 3 tablespoons olive oil", "3 cloves garlic, cut into thin slices", "Kosher salt, to taste", "Ground black pepper, to taste", "1/2 cup white wine", "cup or so of grape seed oil for frying", "2 tablespoon capers, rinsed and dried well", "1/4 cup roughly chopped flat leaf parsley", "several thin shavings of Pecorino Romano", "lemon juice, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each artichoke heart into thick lengthwise slices, about 6 slices per artichoke. Heat a skillet or wide saucepan over medium heat. Add olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the artichoke slices evenly in the pan. Brown both sides of the artichokes, about 5 minutes on each side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the last 2 minutes on the second side, add the garlic slices and stir.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the garlic slices are fragrant and soft, add salt, pepper and wine, cover the pan, and cook the artichokes until tender over medium-low heat, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the artichokes are cooking, heat oil in a small, deep saucepan over medium heat until oil is about 360°F. The oil is hot enough when a caper dropped into the oil sizzles and bubbles form around it. Make sure the capers are dried very well to minimize splatter, and even then, be very careful. A tablespoon at a time, fry the capers for about a minute. When they are done, they will be crispy and have opened up like little flowers. Drain them on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the artichokes are done, remove from heat and toss in the parsley. Squeeze in a few drops of lemon juice, to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the artichokes onto a serving dish. Sprinkle with cheese and capers. Serve hot.</p>"}]}