{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100813-cremini-shiitake.jpg", "author": {"@type": "Person", "name": "Aaron Mattis"}, "recipeCuisine": "", "keywords": ["pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cremini and Shiitake Mushroom Pizza", "link": "https://www.seriouseats.com/recipes/2010/08/cremini-and-shiitake-mushroom-pizza.html", "description": "...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Pizza"], "recipeIngredient": ["1/2 recipe rustic country pizza dough, halved and formed into two balls", "1 lb. cremini mushrooms", "1 lb. shiitake mushrooms", "3 or 4 cloves garlic", "1 shallot", "Peanut oil or another neutral oil", "Kosher salt", "Freshly ground black pepper", "2 or 3 sprigs fresh thyme leaves, stripped from stems", "2 Tbsps. unsalted butter", "About 6 oz. crushed San Marzano tomatoes or premium plum tomatoes", "1 lb. fresh mozzarella", "Parmigiano-Reggiano", "Extra virgin olive oil", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from refrigerator 2 hours prior to baking. Let rest at room temperature on a lightly floured surface, dusted with flour and covered with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven on maximum with a pizza stone 1 hour prior to baking, using convection heat if possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe dirt from mushrooms with a dry paper towel or cloth. Trim stems of creminis so mushrooms can lie flat on both sides. Remove stems from shiitakes. Mince garlic and shallot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat a large skillet with peanut oil and heat over medium. Season mushrooms with kosher salt and pepper and brown thoroughly on both sides, working in batches if necessary to avoid crowding pan. Once all the mushrooms are browned, return to pan and reduce heat to medium-low. Add garlic, shallot, thyme, and butter and cook, stirring occasionally, until mushrooms are soft, about 5 minutes. Remove from heat and thinly slice when cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly season tomatoes with kosher salt and drain through a sieve lined with paper towels or cheesecloth. Reserve juice for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each pie, working on a lightly floured surface, carefully stretch a round of dough as thinly as possible. Transfer to a lightly floured peel and top with half the tomatoes, half the mushrooms, and half the mozzarella, torn into large chunks. Bake on pizza stone until crust is deeply caramelized and cheese is bubbly and lightly browned, about 5 minutes at 550°F. Top with finely grated Parmigiano-Reggiano, drizzle with olive oil, and sprinkle with coarse sea salt. Slice and serve.</p>"}]}