{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20102912-129635-vanilla-orange-marmalade-2.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["canning", "Edible DIY", "holidays", "jams", "marmalades", "oranges"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Vanilla-Orange Marmalade", "link": "https://www.seriouseats.com/recipes/2010/12/vanilla-orange-marmalade-recipe.html", "description": "This marmalade is bright, sweet, and bursting with citrus flavor. It tastes like the juiciest orange you ever ate, only slathered over buttered bread. Yum. While it may seem a bit fussy to use two different kinds of oranges, it...", "totalTime": "1 1/2 hours", "recipeYield": "Makes 8 half-pint jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Edible DIY", "Orange"], "recipeIngredient": ["2 medium juice oranges ", "2 large navel oranges", "2 lemons", "1/8 teaspoon baking soda", "1 vanilla bean", "One 1.75-ounce package powdered pectin", "6 1/2 cups granulated sugar", "1/4 teaspoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the jars and lids: place 8 half-pint jars on rack in large pot. Add enough water to cover jars and bring to boil over high heat. Boil for 10 minutes, turn off the heat and allow jars to rest in hot water. Meanwhile, put rims and lids in small saucepan and cover with water. Heat over medium heat until water is simmering; remove pan from heat and allow rims and lids to rest in hot water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the oranges and lemons. Remove the rinds in quarters and thinly slice them lengthwise. When all the rinds are sliced, roughly chop them crosswise into slightly smaller pieces. Put the rinds in a large pot and add 2 1/2 cups of water and the baking soda. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a sharp knife, split the vanilla bean open lengthwise and scrape the seeds into the pot. Add the vanilla bean to the pot and bring it to a boil. Reduce the heat, cover, and simmer for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, roughly chop the oranges and lemons and remove the seeds. Transfer the fruit to a food processor and pulse until it is evenly chopped but still a bit coarse. Add the fruit to the pot with the rinds and return to a boil. Cover and boil for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure out 4 1/2 cups of the fruit mixture. Make sure to get a good mixture of rind, fruit, and juice. Discard remaining fruit mixture and vanilla bean. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the reserved 4 1/2 cups of fruit mixture to the pot. Stir in the pectin and return to a boil. Boil vigorously for one minute. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar all at once and stir until combined. Stir in the butter. Return to a rapid boil, stirring frequently, and boil hard for one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot marmalade into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow to rest undisturbed on countertop for six hours or overnight.</p>"}]}