{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101308yogurtcherry.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["cherries", "frozen desserts", "frozen yogurt", "ice cream", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scooped: Actually Good Frozen Yogurt with Roasted Cherry Compote", "link": "https://www.seriouseats.com/recipes/2010/08/ice-cream-frozen-yogurt-roasted-cherry-compote-recipe.html", "description": "Yogurt from your local PinkMangoRedBerry outlet simply doesn't compare to the stuff you can make at home. <strong>This version has only two ingredients,</strong> and making it happens so quickly, you'll worry you missed a step. We decided to roast cherries for a luscious compote, brightened by lemon zest and intensified with cherry liqueur and toasted spices, to spoon on top.", "totalTime": "1 hour", "recipeYield": "8 to 10 (makes one generous quart of ice cream, 2 cups of compte)", "recipeCategory": ["Cherry", "Desserts", "Fruit Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>For the frozen yogurt</strong>", "1 quart plain whole milk yogurt (not Greek), store-bought or <a href=\"http://www.makeyourownyogurt.com/\">homemade</a>", "1 cup of sugar", "<strong>For the roasted cherry compote</strong>", "5 1/2 cups of plump, ripe cherries, stems removed, divided", "3 tablespoons of turbinado (raw) sugar", "2 tablespoons of maraschino liqueur", "1 teaspoon of allspice berries, toasted and ground", "1 small piece of star anise, toasted and ground", "3 cloves, toasted and ground", "1/2 teaspoon of nutmeg, freshly ground", "Zest of one lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the frozen yogurt</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk yogurt with sugar until sugar is dissolved, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the yogurt into ice cream machine and spin according to machine's instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For a soft-serve consistency, serve right away. Or scoop it into a container and let it harden in the freezer for a couple of hours. Serve with Roasted Cherry Compote (or other topping of your choice) and dig in!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the roasted cherry compote</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 450&deg;F. Put all but one cup of the cherries in a 12-inch saut&eacute; pan (or any other stovetop to oven vessel with high sides), keeping them in one layer. Toss the cherries with the turbinado sugar and a pinch of salt. While the oven is heating, slice the remaining cup of cherries in half and remove the pits. Set them aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the cherries for about half an hour, tossing now and then, or until they are very tender and amber bubbles stack on top of each other. The cherry juices will have concentrated into a rich, dark syrup. After 20 minutes keep an eye on them, as they can burn easily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven. Deglaze with the maraschino, then set it aside to cool a bit. When you can just handle the cherries, slice them in half and remove the pits. Add them back to the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to medium heat and add the spices, lemon zest, and reserved pitted cherries. Simmer for about ten minutes, stirring to prevent sticking. Serve immediately or at room temperature.</p>"}]}