{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100427-dt-mexican-fondue-with-chorizo.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Mexican", "keywords": ["appetizers", "cheese", "cheese dips", "Dinner Tonight", "fondue", "Mexican"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mexican 'Fondue' with Chorizo and Tomatillo Salsa", "link": "https://www.seriouseats.com/recipes/2010/04/dinner-tonight-mexican-fondue-with-chorizo-and-tomatillo-salsa-recipe.html", "description": "It didn't take long to convince my wife that we would indeed be eating a bowl of bubbling cheese for dinner. It would be stuffed with <strong>crumbled Mexican chorizo,</strong> I explained, then spooned into tortillas doused with a vibrant tomatillo salsa. It would be ready in about 15 minutes&mdash;as simple as grating some cheese, cooking the chorizo, and mixing them together to bake. <strong>Just think of it as a Mexican-style fondue (\"fundido\").</strong>", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Cheese", "Dinner Tonight", "Mexican"], "recipeIngredient": ["Corn oil, as needed", "1/2 pound fresh Mexican chorizo", "1 1/2 cups shredded Monterey Jack cheese", "1/2 cup grated queso Cotija, anejo, or manchego", "6 flour or corn tortillas", "Tomatilla salsa (homemade, or store bought--Frontera is an excellent brand)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F.  Heat a skillet over medium heat and add the chorizo to the pan, adding a little corn oil, if necessary, to help lubricate the meat and allow it to cook and crumble. It depends on the fat content of the sausage.  Cook, breaking up often with a wooden spoon, until the fat has completely rendered and the meat is beginning to crisp, 7-10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow ramekin or other flame-proof dish, spread half the cheese on the bottom and slide into the oven.  Cook for 5 minutes, until the cheese begins to melt, then remove and sprinkle the chorizo over it.  Cover with the remaining cheese and cook until it's completely melted, another 5-7 minutes.  Once melted, turn on the broiler and broil for 2 minutes until golden on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, wrap the tortillas in a damp paper towel and microwave on high for 30 seconds and allow to sit wrapped up as they steam and become pliable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the bubbling hot cheese with the warmed tortillas and the tomatillo salsa.</p>"}]}