{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/bolognese.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["Barbara Lynch", "bolognese", "Boston", "pasta", "tagliatelle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Barbara Lynch's Tagliatelle Bolognese", "link": "https://www.seriouseats.com/recipes/2010/11/barbara-lynchs-tagliatelle-bolognese-recipe-boston-chef-no-9-park.html", "description": "Yesterday, Boston correspondent<a href=\"http://www.seriouseats.com/user/profile/Liz%20Bomze\"> Liz Bomze</a> wrote about chef <a href=\"http://www.seriouseats.com/2010/11/boston-barbara-lynchs-tagliatelle-bolognese.html\">Barbara Lynch's sauce Bolognese</a>, which she serves at No. 9 Park and her other Boston restaurants. I stupidly wrote in the comments that you could email me and I'd send you the recipe when I should've just outright shared the recipe with all of you right here in the first place.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Condiments and Sauces", "Mains", "Pasta"], "recipeIngredient": ["1/4 cup extra-virgin olive oil", "1 pound coarsely ground pork shoulder", "1 pound coarsely ground veal", "1 pound coarsely ground lamb", "1/2 pound chicken livers, finely chopped", "1/2 cup minced fresh sage leaves", "1 large onion, finely diced", "2 stalks celery, finely diced", "2 large carrots, finely diced", "1 bottle dry red wine", "2 cups chicken stock", "2 cups veal stock (you can use all chicken if you'd like)", "1 (28-ounce) can whole peeled italian tomatoes, drained and squeezed between your fingers into medium-sized chunks (liquid reserved)", "1/2 cup chopped fresh basil leaves", "1/2 cup chopped fresh parsley leaves", "4 tablespoons butter", "2 cups heavy cream", "Kosher salt and freshly gound black pepper", "Torn basil leaves and Parmigiano-Reggiano to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of olive oil in a large saucepan or Dutch Oven over high heat until smoking. Add the pork, veal, and lamb, and cook, stirring occasionally and breaking up large chunks of meat until cooked through, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat another 1 tablespoon oil in 12-inch skillet over high heat until smoking. Add chicken livers and sage and cook, stirring constantly, until just cooked through, about 2 minutes. Transfer contents to pot with cooking meats. Add remaining 2 tablespoons olive oil to skillet and heat over high heat until shimmering. Add onion, celery, and carrots and cook, stirring and flipping frequently until beginning to soften but not browned, about 5 minutes. Transfer vegetables to pot with meats and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine to meats and bring to a boil over high heat. Allow to reduce until almost gone, about 15 minutes. Add chicken stock, veal stock, tomatoes, and half of basil and parsley. Bring to a boil, reduce to a bare simmer, and cook, stirring occasionally, until flavors are married and sauce is reduced to a thick, spoon-coating consistency, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter and heavy cream and bring to a boil. Season to taste with salt and pepper. For best flavor, remove from heat, allow to cool, and refrigerate at least overnight, and up to three nights. Fat will settle on top. Do not discard fat; stir it back into the sauce as you reheat it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat, stir in remaining basil and parsley, and serve over tagliatelle, pappardelle, or gnocchi with Parmigiano-Reggiano, torn basil, and freshly ground black pepper.</p>"}]}