{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/12082010chocolatepeppermintmarshmallows1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["chocolate", "confections", "desserts", "Edible DIY", "marshmallows"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Peppermint Marshmallows", "link": "https://www.seriouseats.com/recipes/2010/12/chocolate-peppermint-marshmallows-recipe.html", "description": "[Photograph: Lucy Baker] Forget plain, boring old vanilla marshmallows. These pack a double punch of chocolate and peppermint schnapps and are just the thing for topping off a mug of holiday cocoa....", "totalTime": "at least 5 hours", "recipeYield": "40 to 50 marshmallows", "recipeCategory": ["Chocolate", "Desserts", "Edible DIY"], "recipeIngredient": ["Confectioners' sugar", "1/3 cup cocoa powder", "6 tablespoons boiling water", "3 envelopes unflavored gelatin", "2 cups granulated sugar", "1/2 cup light corn syrup", "Pinch of salt", "2 large egg whites ", "1 tablespoon peppermint schnapps"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a 9x13-inch baking dish with nonstick spray and dust with confectioners' sugar. In a small bowl, combine cocoa powder and boiling water. Stir until cocoa dissolves. Pour 1/2 cup of cold water into large bowl and sprinkle with gelatin. Let stand until gelatin is hydrated, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium heavy saucepan, heat sugar, corn syrup, salt, and 1/2 cup water over low heat, stirring until the sugar is dissolved. Increase heat to medium and boil without stirring, until mixture reaches 240°F on candy thermometer, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sugar mixture into bowl with gelatin. Add cocoa mixture and stir until gelatin is dissolved. Beat sugar mixture with an electric mixer until it is thick, shiny, and tripled in volume, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In separate large bowl, with clean beaters beat egg whites until they hold stiff peaks. Beat egg whites and peppermint schnapps into sugar mixture. Pour mixture into prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let marshmallow stand for at least four hours, preferably overnight, uncovered or loosely covered, until set. When ready to cut marshmallow, dust cutting board with confectioners' sugar. Dust surface of marshmallow with confectioners' sugar. Invert pan over cutting board. Using fingers, carefully wiggle marshmallow out of pan. Cut marshmallow into squares and dust with more confectioners' sugar. Store in an airtight container for up to one week. </p>"}]}