{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Spanish", "keywords": ["appetizers", "Cook the Book", "croquettes", "ham", "Ines Ortega", "recipe newsletter", "Serrano ham", "Simone Ortega", "spanish", "tapas", "The Book of Tapas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ham Croquettes", "link": "https://www.seriouseats.com/recipes/2010/05/ham-croquettes-recipe.html", "description": "The following recipe is from the May 26 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! The croquetas de jamón served at tapas bars have always been among my favorite small plates....", "totalTime": null, "recipeYield": "8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Ham", "Pork", "Spanish"], "recipeIngredient": ["2 tablespoons sunflower oil", "3 tablespoons butter", "4 tablespoons all-purpose flour", "3 cups milk", "2 eggs", "3 cups bread crumbs", "Vegetable oil, for deep-frying", "Salt", "Fresh or fried parsley sprigs (see Note, optional) ", "7 ounces York ham, very finely chopped, or 5 ounces Serrano ham, finely chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, make a béchamel sauce. Heat the sunflower oil in a pan. Add the butter and when it has melted, stir in the flour with a wooden spoon. Gradually stir in the milk, a little at a time, and cook, stirring constantly, until the béchamel sauce thickens. Season with salt and stir in the ham, then spread the mixture out in a large, shallow dish to cool for at least 2 hours. Using 2 tablespoons, shape scoops of the mixture into croquettes. Finish forming the croquettes with your hands.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the eggs in a shallow dish. Spread out the bread crumbs in another shallow dish. Roll each croquette lightly in the bread crumbs, then in the beaten egg and finally in the bread crumbs again, making sure that each one is evenly covered. Heat the vegetable oil in a deep-fryer or deep pan to 350 - 375&deg;F, or until a cube of bread browns in 30 seconds. Carefully add the croquettes, in batches of about 6 at a time, and cook until crisp and golden brown. Using a slotted spoon, transfer them to a large colander set over a baking pan and place in a warm oven until all the croquettes have been cooked. Serve immediately on a dish garnished with sprigs of fresh or fried parsley. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong> To prepare fried parsley as a garnish, tie parsley sprigs together with thread and pan-fry in moderately hot oil.</small></p>"}]}