{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20090211-grilled-potato-skins.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["appetizers", "grill", "grilled potato", "grilling", "party food", "potato skins", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilling: Potato Skins", "link": "https://www.seriouseats.com/recipes/2010/02/grilling-potato-skins-recipe.html", "description": "[Photographs: Joshua Bousel] After four solid weeks of grilling up party foods, I thought I was done with that genre for a bit. That was until&mdash;at the bar the other night while we were collectively commiserating over the Knicks&mdash;it was...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Potato"], "recipeIngredient": ["4 large russet potatoes, scrubbed", "8 ounces bacon, chopped fine", "4 tablespoons unsalted butter, melted", "8 ounces cheddar cheese, shredded", "1/2 cup minced fresh scallions", "1/2 cup sour cream", "Kosher salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a chimney 3/4 full of charcoal. While the charcoal is lighting, thoroughly prick the potatoes with a fork. Microwave the potatoes on high for 8 minutes, turning them over after 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the charcoal is fully lit and covered in gray ash, pour the coals out and arrange them on either side of the charcoal grate, keeping the middle empty. Transfer the potatoes to grill, placing them in the middle of the grill, not over the coals, cover, and cook until a paring knife glides easily through the flesh, about 20 minutes. Remove from the grill, slice the potatoes in half lengthwise and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes are on the grill, cook the bacon in a 12-inch skillet over medium heat until brown and crisp, about 8 minutes. Transfer the bacon to a paper-towel-lined plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are cool enough to handle, use a spoon to scoop out and discard the flesh, leaving and 1/4-inch layer of potato on the inside of each skin. Brush the potatoes inside and out with the melted butter and season with salt and pepper. Move the potatoes back to the middle of the grill, cover, and let cook until they're light golden brown and crisp, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the potato skins evenly with the cheddar cheese and bacon, cover, and continue to cook until the cheese is bubbly, about 7 minutes more. Remove from the grill, let cool for 5 minutes, then sprinkle with scallions and dollop with sour cream and serve.</p>"}]}