{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100824-dt-alice-waters-gazpacho.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Alice Waters", "Dinner Tonight", "gazpacho", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Alice Waters' Gazpacho", "link": "https://www.seriouseats.com/recipes/2010/08/dinner-tonight-alice-waters-gazpacho-recipe.html", "description": "Gazpacho is all over the place in summertime.  It's the iconic chilled summer soup; refreshing and acidic and featuring the almighty tomato at its seasonal peak.  Many non-traditional ingredients find their way into modern recipes, though, such as avocado or watermelon, and many depend on tomato juice.  These are delicious in their own way (including a recipe <a href=\"http://www.seriouseats.com/recipes/2009/08/dinner-tonight-cool-summer-gazpacho-recipe.html\">already covered</a> in this column). However, the original recipe from Spain is pretty simple, featuring olive oil, tomatoes, bread, garlic, and garnishes.", "totalTime": "", "recipeYield": "6-8", "recipeCategory": ["Dinner Tonight", "Gazpacho"], "recipeIngredient": ["1 dried ancho chile, stemmed and soaked in warm water for 15 minutes", "2 cloves garlic, roughly chopped", "2 cups crustless crusty bread", "5 pounds tomatoes, cut in half horizontally", "1/4 cup olive oil", "salt to taste", "1/2 pound cherry tomatoes, halved", "1 cucumber, peeled and diced", "1/2 red onion, diced", "handful each of chopped chervil and basil", "2 tablespoons red wine vinegar", "1/4 cup olive oil", " salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mortar and pestle, pound the reconstituted ancho chile into a paste, then scrape out and set aside. Add the garlic and a pinch of salt to the mortar and pound into a paste.  Soak the bread in cold water for 2 minutes, then squeeze out the water and add that to the garlic.  Mash it all together until smooth. (Alternatively, you could do it in a food processor).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate the cut sides of the tomatoes on the medium holes of a box grater into a large bowl until only the skins are left; discard the skins.  Stir in the bread paste and add the chile puree to taste (this allows you to control the spiciness).  Add 1/4 cup of olive oil and salt to taste, then chill in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, mix together the remaining ingredients to create a relish.  Divide the soup among bowls and top each with a generous spoonful of relish.</p>"}]}