{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alice Waters", "beans", "cannellini beans", "Cook the Book", "In The Green Kitchen", "recipe newsletter", "white beans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "White Beans with Garlic and Herbs", "link": "https://www.seriouseats.com/recipes/2010/04/white-beans-with-garlic-and-herbs-recipe.html", "description": "The following recipe is from the April 21 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! In the introduction to this recipe for White Beans with Garlic and Herbs from In The...", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Beans and Pulses", "Cook the Book", "Sides", "Vegetarian"], "recipeIngredient": ["1 pounds dried cannellini beans, cranberry, or other dried beans", "Olive oil", "1 onion, peeled and diced", "1 carrot, peeled and diced", "1 celery stalk, diced", "4 garlic cloves, peeled and chopped", "1 bay leaf", "1 or 2 sprigs thyme, sage, savory, or rosemary", "Ham hock, or a piece of pancetta or bacon (optional)", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the beans and pick over, removing any small stones or debris.  If time allows, soak the beans, covered by an inch or so of water, for several hours or overnight. (Otherwise, proceed without soaking the beans first.) Cover the bottom of a large heavy pot or earthenware bean pot with olive oil, add the vegetables and herbs, and cook gently over medium heat for 10 minutes. Drain the beans and add to the pot along with enough water to cover by 2 inches. If you like, add a ham hock or other meat to the pot.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the beans to a boil, and let them boil for a minute or two.  Lower the heat to a very gentle simmer and cook the beans until soft and tender, 1 to 2 hours, depending on their variety and age. Add more hot water as needed during the cooking to keep the beans covered by at least an inch of water. When the beans are soft, add salt, taste after a few minutes, and add more salt if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the beans moistened with the cooking broth, and if you like, a drizzle of olive oil. If not serving right away, let the beans cool completely in the broth, and refrigerate. They will keep for 3 or 4 days in the refrigerator.  </p>"}]}