{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101218-129434-scribble-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2010", "chocolate", "Cook the Book", "cookie month", "Cookies", "Fany Gerson", "holiday baking", "My Sweet Mexico", "sandwich cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bake the Book: Scribble Cookies ", "link": "https://www.seriouseats.com/recipes/2010/12/scribble-cookies-recipe.html", "description": "While these <strong>Scribble Cookies</strong> from <em><strong><a href=\"http://www.amazon.com/My-Sweet-Mexico-Authentic-Beverages/dp/1580089941/serieats-20\">My Sweet Mexico</a></strong></em> aren't necessarily a traditional Mexican sweet, author <strong><a href=\"http://www.mysweetmexico.com/web/about/default.html\">Fany Gerson</a></strong>'s childhood fondness for them guaranteed them a spot in her cookbook.  These are the kind of cookies that little kids dream about&mdash;sandwiches of shortbread and creamy chocolate filling topped with squiggles of even more chocolate.", "totalTime": "", "recipeYield": "20 cookies", "recipeCategory": ["Bake the Book", "Cook the Book"], "recipeIngredient": ["<strong>Cookies</strong>", "3 cups all-purpose flour", "3/4 cup confectioner’s sugar", "1 cup unsalted butter, cut into cubes, at room temperature", "2 egg yolks", "1/2 teaspoon pure vanilla extract ", "<strong>Chocolate Filling</strong>", "5 1/2 ounces semisweet chocolate, finely chopped", "3 1/2 tablespoons unsalted butter, softened", "1/4 cup sour cream", "1/4 cup light corn syrup", "1/2 teaspoon pure vanilla extract ", "<strong>Topping</strong>", "1/4 cup whole milk", "2 1/2 tablespoons confectioner’s sugar, sifted", "3 ounces semisweet chocolate, finely chopped", "2 ounces cocoa butter, finely chopped, or vegetable oil  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Line 2 baking sheets with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cookies</strong>, place all the ingredients in a food processor and pulse until it starts coming together. Turn out onto a lightly floured surface and knead for a few minutes until you have a soft, uniform dough. Roll into a ball and flatten slightly with the palm of your hand. Roll out to about 1/4 inch thick. With a cookie cutter or glass, cut out forty 2-inch circles (with straight or ridged edges) and place on the prepared baking sheets about 1/2 inch apart. (You can re-roll scraps up to 3 times, if necessary.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until firm to the touch and sightly brown around the edges (make sure they are still white in the center), 15 to 20 minutes. Allow to cool for a few minutes on the baking sheets, then transfer to a wire rack to cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the filling,</strong> bring a saucepan of water to a simmer over low to medium heat. Place the chocolate in a metal bowl, set over the saucepan, making sure the water doesn’t touch the bottom of the bowl, and cook, stirring often, until completely melted, 7 to 10 minutes. Remove from the heat and set aside the saucepan with water. Add the butter, sour cream, corn syrup, and vanilla to the melted chocolate, and stir until well combined, being sure not to aerate the mixture. Place a small piece of plastic wrap directly on top of the mixture and let cool to room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the topping,</strong> return the saucepan of water to a simmer over low to medium heat. Combine the milk, confectioner’s sugar, and chocolate in a metal bowl and set over the saucepan, making sure the water doesn’t touch the bottom of the bowl, and cook, stirring often, until completely melted, 5 to 7 minutes. Add the cocoa butter and continue cooking until a smooth glaze is formed, about 3 minutes. Keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip over 20 of the cookies. Using a piping bag fitted with a flat tip, or two spoons, spread about 1 tablespoon of filling on each of the flipped cookies. Place the remaining 20 cookies on top to make a sandwich and press down slightly to ensure the filling reaches the edges and is evenly spread. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the warm chocolate topping over the cookies so that the top looks like a scribble. Let cool on a wire rack. </p>"}]}