{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201012sourdough.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "sourdough"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: More Sourdough Bread", "link": "https://www.seriouseats.com/recipes/2010/12/homemade-sourdough-bread-recipe-what-to-d.html", "description": "Have you been cultivating a <a href=\"http://www.seriouseats.com/tags/sourdough%20starter-along\">sourdough starter?</a> Then here's another bread recipe for you. Using <strong>more starter as the foundation of your bread will speed up the rising time</strong>. You'll also get a little more of that sourdough character in the finished loaf.", "totalTime": "about 6 hours", "recipeYield": "8 to 10", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["8 ounces starter (by volume) at 100% hydration", "4 ounces water", "12 ounces bread flour", "1 teaspoon kosher salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine starter, water, and 4 ounces bread flour in bowl of stand mixer or in large bowl. Mix well and and cover until mixture is bubbling and rising up in container, at least one hour (or more, depending on activity of starter).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining ingredients and knead the dough hook or by hand, adding flour or water as necessary until dough ball barely sticks to bottom of bowl when kneading. Form into ball, drizzle with olive oil, and put back into bowl. Cover bowl with plastic wrap and set aside to rise until doubled in volume, about 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from bowl and form into a ball, being careful not to deflate. Set dough on a prepared baking sheet or peel and cover with plastic wrap. Set aside until doubled, about 90 minutes. Meanwhile, adjust oven rack to lower middle position and preheat the oven to 350°F. When loaf has risen, slash  as desired and bake until bread is nicely browned, about 35 minutes.</p>"}]}