{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100503limemarshmallowpie.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "david lebovitz", "lime", "meringues", "pies", "Ready for Dessert"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "David Lebovitz's Lime-Marshmallow Pie", "link": "https://www.seriouseats.com/recipes/2010/05/david-lebovitzs-lime-marshmallow-pie-recipe.html", "description": "Lemon meringue pie was one of my favorite childhood desserts, and seeing all of those gloriously tall, peaked pies in diner display cases inspired me to try out this <strong>Lime-Marshmallow Pie</strong> from <em><a href=\"http://www.amazon.com/Ready-Dessert-My-Best-Recipes/dp/158008138X/serieats-20\">Ready for Dessert</a></em> by <a href=\"http://www.davidlebovitz.com/about/\">David Lebovitz</a>. Judging by the photo that accompanied the recipe in the book, this pie looked like a challenge.  Was there any way I could replicate the lovely swirls and peaks in my home kitchen?", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cook the Book", "Desserts", "Lime"], "recipeIngredient": ["<strong>For the crust:</strong>", "1 1/4 cups whole wheat flour", "3/4 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "1/8 teaspoon salt", "5 tablespoons unsalted butter, cut into 1/2-inch pieces and chilled, plus 3 tablespoons unsalted butter, melted", "2 1/2 tablespoons honey", "2 tablespoons sugar", "&nbsp", "<strong>For the filling:</strong>", "1/2 cup freshly squeezed lime juice", "1/2 cup sugar", "Pinch of salt", "2 large egg yolks", "3 large eggs", "6 tablespoons unsalted butter, cut into pieces", "Grated zest of 2 limes, preferably organic", "&nbsp", "<strong>For the topping:</strong>", "1 envelope unflavored gelatin", "1/4 cup plus 1/3 cup cold water", "1/3 cup light corn syrup", "1 teaspoon vanilla extract", "1/2 cup sugar", "3 large egg whites"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F.  Line a baking sheet with parchment paper or a silicone baking mat.  Generously butter a 9-inch pie plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the crust, in a stand mixer fitted with the paddle attachment (or in a bowl by hand), mix together the whole wheat flour, cinnamon, ginger, and 1/8 teaspoon salt on low speed until combined.  Add the 5 tablespoons chilled butter pieces and mix on medium speed (or cut them in with a pastry blender) until the butter is in very small pieces about the size of grains of rice.  Mix in the honey until the dough is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to the prepared baking sheet and pat into a circle about 1/8 inch thick.  Bake until the cracker is golden brown and slightly firm to the touch, about 15 minutes.  Let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor fitted with the metal blade, process about three-quarters of the cracker into fine crumbs, or crush in a sturdy plastic bag with a rolling pin.  Measure 1 1/2 cups crumbs into a small bowl.  (You can snack on the rest of the cracker.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the 2 tablespoons sugar and 3 tablespoons melted butter to the cracker crumbs in the bowl and mix until evenly moistened.  Pat the mixture evenly into the bottom and halfway up the sides of the buttered pie plate.  Bake until just set, about 10 minutes, cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, in a medium nonreactive saucepan, whisk together the lime juice, 1/2 cup of sugar, pinch of salt, eggs, egg yolks, 6 tablespoons butter, and the lime zest.  Cook over medium heat, stirring constantly until the mixture thickens and the edges just barely begin to bubble.  Don't let it boil.  Pour the mixture through a mesh strainer into the crust.  Bake until the filling is just set, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pie from the oven.  Position a rack in the upper third of the oven and increase the temperature to 450&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the topping, in a small bowl, sprinkle the gelatin evenly over the 1/4 cup of cold water and allow it to soften and swell for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan fitted with a candy thermometer, heat the remaining 1/3 cup water with the corn syrup and 1/2 cup sugar over medium-high heat.  When the sugar syrup reaches about 210&deg;F, in a stand mixer fitted with the whip attachment, start whipping the egg whites.  When the egg whites are frothy and the syrup temperature has climbed to 245&deg;F, increase the speed to high, and with the mixer running, slowly dribble the syrup into the whites, being careful to avoid pouring hot syrup on the beater (the beater will fling the syrup onto the sides of the bowl, where it will stick).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scape the softened gelatin into the still-warm saucepan used to make the sugar syrup and stir until melted.  With the mixer running, slowly drizzle the gelatin into the egg whites.  Add the vanilla and continue to beat until the mixture is cooled to room temperature, 5 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spatula, spread the topping over the filling, creating swirls and billowy peaks.  Bake until the topping is golden brown, 2 to 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve at room temperature or chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage:</strong>  The graham cracker crust can be made up to 2 weeks in advance.  The lime filling can be made up to 4 days in advance, and chilled.</p>"}]}