{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100827-purslane-primary.jpg", "author": {"@type": "Person", "name": "Katie Quinn"}, "recipeCuisine": "", "keywords": ["agnolotti", "corn", "mascarpone", "pasta", "polenta", "purslane", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Purslane Agnolotti", "link": "https://www.seriouseats.com/recipes/2010/08/purslane-agnolotti-recipe.html", "description": "Purslane has crept into seasonal restaurant menus this summer, but you might not actually know what it is. Pur-who? I had never heard of the sweet, mildly sour succulent, but once I caught wind of the purslane trend, I started noticing it at farmers' markets.  It turns out this exotic weed has a bit of a cult following.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Corn", "Pasta"], "recipeIngredient": ["<strong>For the pasta dough:</strong> ", "3 cups flour ", "1/2 cup semolina flour ", "10 egg yolks", " 2 whole eggs ", "1/4 cup whole milk", "<strong>For the filling:</strong>", "4 ears of corn ", "1/2 cup mascarpone", "2 cups of cooked polenta ", "2 tablespoon butter, softened", "<strong>For the dish:</strong>", "20 pieces of cleaned shrimp", "1 cup of cut corn ", "1 cup of corn puree ", "1 tablespoon butter ", "1 cup fresh purslane leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pasta dough:</strong> In a mixer, using a dough hook attachment, combine the all the ingredients and mix on low speed until the ingredients are fully incorporated. Remove the dough to a floured surface and knead it until it is smooth and slightly elastic. Wrap the dough in plastic and let rest in the refrigerator for at least 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the filling:</strong> Cut the corn off the cob and reserve one cup for later. Puree the remaining corn in a blender until smooth and pass it through a tamis or chinois. Whisk the corn puree in a bowl over a double boiler until it begins to thicken. It should become the consistency of cake batter. Cool the puree down and reserve 1 cup for later. Mix the remaining puree with the cooked polenta, mascarpone, and butter. Season with salt and pepper to taste. Place the mixture in a pastry bag with a half-inch tip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To roll the agnolotti, run the pasta through a pasta machine until it is thin enough to see the outline of your hand through it. The pasta sheet should be about 5 to 6 inches wide and approximately 2 feet long. Pipe a tube of the filling a half-inch in along the bottom edge of the pasta sheet the length of the sheet. Fold the pasta dough over the filling so that the pasta dough now encases the \"tube.\" Roll the tube over one more time then trim the pasta on the topside with a pastry cutter leaving a one-fourth of an inch. Starting at one side of the pasta \"tube\", pinch the tube at one-inch intervals to seal the sides of the agnolotti. Then using the pastry cutter cut the agnolotti's in the middle of the pinches to separate them. Lay the pasta out on to clean linen and allow to dry slightly, rotating them periodically. If they are not going to be cooked immediately, place them in the freezer to keep until ready to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the dish:</strong> Heat the butter up in a sauté pan and cook the cut corn until it is softened. Add the shrimp cook for 3 to 4 minutes then add the corn puree. Meanwhile Cook the pasta in rapidly boiling water until it begins to float to the surface. Remove the pasta to the pan with the shrimp and corn and add the purslane. Cook for 1 to 2 minutes and add salt and pepper to taste. Divide the pasta among 4 dishes and eat.</p>"}]}