{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100621blackberrybuttermilkbundtcake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bill Yosses", "blackberries", "bundt cake", "cakes", "Cook the Book", "The Perfect Finish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bill Yosses' Blackberry Buttermilk Bundt with Orange Glaze", "link": "https://www.seriouseats.com/recipes/2010/06/bill-yosses-blackberry-buttermilk-bundt-with-orange-glaze-recipe.html", "description": "My kitchen is pretty much at capacity, and purchasing more kitchen equipment is becoming borderline irresponsible.  What I once thought was a spacious kitchen seems shrinking with each new addition.  So, when I found this recipe for <strong>Blackberry Buttermilk Bundt  with Orange Glaze</strong> from <em><a href=\"http://www.amazon.com/Perfect-Finish-Special-Desserts-Occasion/dp/0393059537/serieats-20\">The Perfect Finish</a></em> by <a href=\"http://en.wikipedia.org/wiki/William_Yosses\">Bill Yosses</a> I was hesitant to go out and buy the Bundt pan this recipe called for. But the beautiful photo that accompanied the recipe and the wealth of blackberries at the market won me over and the pan was purchased.  And, I have to say that I'm very pleased with my new Bundt pan and the first cake it baked.", "totalTime": null, "recipeYield": "8 to 10", "recipeCategory": ["Cakes", "Cook the Book", "Desserts"], "recipeIngredient": ["2 2/3 cups all-purpose flour", "1 tablespoon baking powder", "1/2 teaspoon salt ", "1/2 teaspoon baking soda", "1/2 (2 sticks) pound unsalted butter, softened, plus additional for the pan", "1 3/4 cups sugar ", "4 large eggs, at room temperature", "2 teaspoons vanilla extract              ", "1/2 cup buttermilk", "2 pints blackberries", "<strong>Orange Glaze</strong>", "1/2 cup freshly squeezed orange juice (from about 1 medium orange)", "1/2 cup confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Preheat the oven to 350°F. Grease a 2-quart anti-adhesive Bundt pan with some butter, then spray lightly with nonstick cooking spray. You don't want this cake to stick! The new anti-adhesive cake pans prevent the bottom of the cake from sticking to the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the flour, baking powder, salt, and baking soda.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and sugar on medium-high speed until light and fluffy. Beat in the eggs one at a time until incorporated. Beat in the vanilla. Reduce the speed to low and mix in half the flour mixture. Mix in the buttermilk, then the remaining flour mixture. Using a wooden spoon, gently fold in the blackberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared Bundt pan. Bake the cake until a cake tester inserted in the center comes out clean, about 1 hour. Let the cake cool in the pan for 10 minutes, then invert onto the serving platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cake cools, combine the orange juice and sugar in a small saucepan and simmer over low heat until the sugar is dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a skewer or long thin knife, prick deep holes all over the surface of the cake. Pour half the glaze over the cake, letting it seep into the holes. Let the cake cool for 20 minutes more. Pour the remaining glaze over the cake and let set for 10 minutes. Slice and serve.</p>"}]}