{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100826kaffirlime.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["desserts", "frozen desserts", "kaffir lime", "lime", "sorbet", "star anise"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Scooped: Kaffir Lime, Ginger, Star Anise Sorbet", "link": "https://www.seriouseats.com/recipes/2010/08/kaffir-lime-ginger-anise-sorbet-recipe.html", "description": "<strong>Star anise contributes more depth of flavor,</strong> elevating this from a citrusy ice to something more exotic. You don't need much, and it doesn't need to steep for very long to impart its flavor. The coconut water base is subtle and anise easily overwhelms everything it touches. But when your flavors are balanced, you'll be rewarded with a dessert that's bright and exotic, with a tinge of gingery heat and a kiss of licorice sweetness.", "totalTime": "1 1/2 hours, plus chilling time", "recipeYield": "6 to 8 (makes about 1 quart)", "recipeCategory": ["Dairy-Free", "Desserts", "Ginger", "Ice Cream and Frozen Treats", "Lime", "Vegan", "Vegetarian"], "recipeIngredient": ["3 1/2 cups of coconut water (<em>not</em> coconut milk)", "12 kaffir lime leaves, slightly bruised in your palm", "2 small pieces of star anise", "1 tablespoon of ginger, shredded on a fine grater or microplane", "2 to 3 tablespoons of lime juice, to taste", "1 cup of sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the coconut water, kaffir lime leaves, and a tiny pinch of salt in a saucepan and bring to a bare simmer over medium heat, uncovered. Take your time with this and start with cold ingredients&mdash;more aromatic flavors will be extracted that way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pot is just bubbling and the leaves have faded to a dull olive green, take the pot off the heat and remove them. Stir in the sugar till dissolved and add the star anise. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the anise steep in the pot for ten to twenty minutes. The timing here isn't critical and is largely based on how much anise flavor you want in the final product. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pot to an ice water bath. To cool it down especially fast, run a thin stream of cold water through the bath and put an ice pack in the pot. If you're using a freezer bowl style of ice cream maker, you may want to chill the mixture further in the refrigerator to ensure that it'll churn properly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chilled, stir in the ginger and two tablespoons of lime juice. Give it a taste; if you want a little more tartness, add the last tablespoon of juice. Otherwise transfer it straight to your machine and freeze according to your manufacturer's instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The sorbet's texture improves after an hour or two in the fridge. Some potential toppings: lime zest, grass jelly cubes, or tapioca pearls.</p>"}]}