{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101201_GFTuesNutterButters.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "gluten-free baking", "gluten-free cookies", "Gluten-Free Tuesday", "holiday baking", "homemade Nutter Butters", "peanut butter cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Gluten-Free Tuesday: Chocolate Dipped Nutter Butters", "link": "https://www.seriouseats.com/recipes/2010/11/gluten-free-tuesday-chocolate-dipped-nutter-butters-peanut-butter-cookies.html", "description": "As much as I love the from-scratch cookies that come pouring out of kitchens this time of the year, I have a soft spot for the \"almost homemade\" cookies my aunt Rita makes. For years, she's taken store-bought cookies and dipped them in chocolate&mdash;dressing them up the way the right scarf makes a casual outfit seem a little more stylish. With the help of the premade peanut butter sandwich cookies, she churns out chocolate-peanut butter gems without turning on her oven.", "totalTime": "", "recipeYield": "makes about two dozen cookies", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["<strong>For the Cookie</strong>", "1.25 ounces (1/2 cup) gluten-free oats", "2 ounces (1/2 cup) white rice flour", "1 ounce (1/4 cup) cornstarch", "1.25 ounces (1/4 cup) sweet rice flour", "1/2 teaspoon salt", "1/4 teaspoon xanthan gum", "1/2 cup vegetable shortening", "2/3 cup granulated sugar", "1 large egg", "3 tablespoons smooth peanut butter. (Natural peanut butter does not work well in this recipe.)", " ", "<strong>For the Filling</strong>", "1/2 cup smooth peanut butter", "3/4 cup powdered sugar", "2 teaspoons water", " ", "<strong>For the Coating</strong>", "12 ounces milk, dark, or white chocolate, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Line a baking sheet with parchment paper. Set aside. Process gluten-free oats in a food processor until fine. In a medium mixing bowl, whisk together ground oats, rice flour, cornstarch, sweet rice flour, salt, and xanthan gum.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large mixing bowl or bowl of stand mixer, cream together vegetable shortening, smooth peanut butter, and granulated sugar. Cream for 30 seconds (use high speed on a handheld mixer or medium-high speed on stand mixer). Add egg and mix for additional 15 seconds. Scrape down sides of bowl and mix for additional 15 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce mixer speed to medium-low and add dry ingredients. Mix until dough forms. Divide dough in half. Pat each half into disk and wrap in plastic wrap.  Chill dough for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle white rice flour lightly over countertop. Using rolling pin, roll out one dough round until approximately 1/4-inch thick. Cut dough with 3-inch round cookie-cutter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cookies to prepared baking sheet. (I use a cookie spatula dusted with rice flour to transfer the dough to the pan.) Bake for 12-15 minutes or until cookies are lightly brown. Transfer cookies to a wire rack to cool. Repeat with remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>While cookies cool, prepare the filling:</strong> In small bowl, cream together peanut butter and confectioners’ sugar until smooth. Add water. Filling should be smooth. If filling is too thick to spread, add additional teaspoon of water. Sandwich cooled cookies together with a thin layer of filling. Place cookies on a baking sheet lined with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt chocolate in large bowl set over pot of simmering water, stirring frequently until smooth. Remove bowl from the heat. Dip cookies, one at a time, in melted chocolate. (If chocolate begins to harden before you've finished dipping the cookies, return the bowl to the double boiler.) Place dipped cookies back on the parchment-lined baking sheet. If desired, drizzle some of the melted chocolate over the top of each cookie. Once all the cookies have been dipped, chill for 20 minutes. Store cookies in airtight container at room temperature for up to 1 week.</p>"}]}