{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101102risottogreens.jpg", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["cheap", "Eat for Eight Bucks", "greens", "kale", "risotto", "southern cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Risotto with Southern Greens and Bacon", "link": "https://www.seriouseats.com/recipes/2010/11/risotto-with-southern-greens-and-bacon.html", "description": "I'm enamored with at least a few aspects of Southern cuisine. One, pork in everything. Two, slow-cooked greens. And three, pecan pie. I've included two of the three here in this somewhat rowdy risotto dish that's left its Italian heritage far, far behind.", "totalTime": "1 hour", "recipeYield": "2", "recipeCategory": ["Bacon", "Eat for Eight Bucks", "Kale"], "recipeIngredient": ["3 cups low sodium chicken broth", "3/4 teaspoon salt", "1 bunch kale (4-5 ounces)", "1 tablespoon vegetable or canola oil", "3 slices bacon, halved", "2 onions, 1 coarsely chopped, 1 thinly sliced", "2 plum tomatoes, blanched and peeled, or from a can", "4 cloves garlic, minced", "3/4 cup arborio rice", "1/2 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, bring 2 cups of the chicken stock to a boil over high heat. Add ¼ teaspoon salt and greens, reduce heat to medium, and cook until tender, about 15 minutes. Drain and reserve liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in large Dutch oven over medium-high heat until shimmering. Add bacon and fry until all their fat is rendered, about 8 minutes. Place bacon on paper towel to drain, and pour out all but 2 tablespoons of fat from pan (reserve the far you pour out). Reduce heat to low and add coarsely chopped onions. Cook, stirring, until soft, 4 to 5 minutes. Add 2 cloves garlic and cook another 2 to 3 minutes. Raise heat to medium, squeeze the tomatoes with your hands and add them. Cook, stirring occasionally, for 8 minutes. Add cooked greens and a ½ cup of reserved stock; simmer until heated through, about 5 minutes. Keep warm on the stove (or transfer to a bowl and reheat when you’re ready to eat).<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the risotto: Combine stock used to cook greens with remaining stock and warm to nearly boiling. Coat another Dutch oven with the remaining bacon fat (about 1 ½ tablespoons) and heat over medium-low heat. Add the sliced onion and cook until translucent, about 5 minutes. Add the remaining minced garlic and cook for one more minute. Pour in the rice and continue to cook, stirring frequently until grains are covered in oil and beginning to toast, about 2 minutes. Add salt and wine and cook, stirring, until nearly evaporated, about 1 minute. Raise heat to medium, and add 1 cup stock, stirring occasionally until the rice has absorbed the liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn heat down to medium-low and continue adding stock to pot in half cup measures, stirring occasionally until each batch is absorbed before adding more. Continue adding stock until rice is tender but retains a little bite, about 30 minutes (you may not use all the stock).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop risotto into two serving bowls. Top with half the greens, warmed, and 3 half slices of bacon. Repeat with remaining risotto, greens, and bacon.  Serve immediately.</p>"}]}