{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101130cranberrymuffins.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["cranberries", "cranberry sauce", "holiday baking", "muffins"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Browned Butter Cranberry Muffins", "link": "https://www.seriouseats.com/recipes/2010/11/bread-baking-browned-butter-cranberry-muffins-recipe.html", "description": "When we're done with turkey sandwiches, and the carcass and leftover vegetables have made their way into soup, <strong>there's usually one straggler left in the fridge: cranberry sauce. </strong>It lasts a long time before spoiling, like any jam or jelly. But there comes a point where I've had enough cranberry-smeared toast and it's time to get creative with the last of it.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread Baking", "Cranberry"], "recipeIngredient": ["1/4 cup butter", "1 1/2 cups all purpose flour", "1/3 cup sugar", "1 tablespoon baking powder", "1 teaspoon salt", "1/2 cup milk", "1 egg", "1/2 cup homemade cranberry sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and line a muffin pan with papers. Or, if you prefer, skip the papers and spray the pan with baking spray. In a small pan, melt butter over low heat, and continue cooking until it browns, stirring as needed. Watch it carefully - it goes from brown to burned quickly. Take it off the heat and allow it to cool while you assemble the rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, sugar and baking powder in a small bowl, and whisk to combine. In a medium bowl, whisk the egg and milk together, then add the melted butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the dry mixture and the cranberry sauce to the wet, and fold together, just until it is combined and the cranberries are well distributed. Portion the mixture into the muffin pan, filling about 3/4 full. Bake at 350 degrees for 25 minutes, or until the muffins bounce back when touched in the center, and a toothpick inserted in the center of a muffin comes out clean. Remove muffins to a rack to cool.</p>"}]}