{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100702-braising-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "eggplant", "pork", "sichuan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Braised Eggplant With Pork in Sichuan Sauce", "link": "https://www.seriouseats.com/recipes/2010/07/sichuan-style-braised-eggplant-recipe.html", "description": "Learn about the basics of wok-braising here. About the author: After graduating from MIT, J. Kenji Lopez-Alt spent many years as a chef, recipe developer, writer, and editor in Boston. He now lives in New York with his wife. Got...", "totalTime": "50 minutes", "recipeYield": "Serves 4 as part of a larger meal", "recipeCategory": ["Chinese", "Eggplant", "Mains", "Pork"], "recipeIngredient": ["3-4 Chinese or Japanese eggplants (1 1/2 pounds total)", "1/4 cup Shaoxing wine or dry sherry", "2 teaspoons cornstarch", "3/4 cup low-sodium chicken broth or chicken/ham broth", "1 tablespoon Sichuan fermented chili-bean paste (or generic Asian chili-garlic sauce if unavailable)", "3 tablespoons soy sauce", "2 tablespoons black vinegar (or 1 tablespoon sherry vinegar and 2 tablespoons cider vinegar)", "1 tablespoon sugar", "2 tablespoons ginger, finely chopped", "3 cloves garlic, finely chopped (about 2 tablespoons)", "4 scallions, whites and light green parts finely chopped, greens sliced", "2 small hot green chilies (preferably Chinese, but Serrano or Jalapeño will do fine), seeds and ribs removed, finely chopped", "3 tablespoons peanut or canola oil", "4 ounces ground pork"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice eggplant into quarters lengthwise, then cut into 3-4 inch lengths. Place pieces in bamboo steamer and steam in wok over medium heat until fully tender, about 15 minutes.  Indentation made with finger on eggplant should not spring back. Transfer eggplant to bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine Shaoxing wine and cornstarch in medium bowl and whisk until no dry cornstarch remains. Add broth, bean paste, soy sauce, black vinegar, and sugar and whisk to combine. Combine ginger, garlic, scallion whites, and chilis in small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in wok over high heat until just beginning to smoke. Add ground pork and stir-fry for 30 seconds until most of pink color is gone. Push pork to sides of wok to make space at bottom. Add ginger mixture and stir fry 30 seconds until aromatic. Add eggplant and toss to combine. Add sauce mixture and bring to a boil. Reduce to a simmer and cook, stirring occasionally, until sauce is rich, thick, and glossy, about 20 minutes. Stir in scallion greens, and serve immediately.</p>"}]}