{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["blt", "Cathy Erway", "Cook the Book", "recipe newsletter", "sushi", "The Art of Eating In"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "BLT Maki Rolls", "link": "https://www.seriouseats.com/recipes/2010/02/blt-maki-rolls-recipe.html", "description": "The following recipe is from the February 24 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! When you make a pledge to not eat out or get take-out for an extended period...", "totalTime": null, "recipeYield": "3 rolls", "recipeCategory": ["Bacon", "Cook the Book", "Pork"], "recipeIngredient": ["1 cup uncooked sushi rice", "4 tablespoons sushi vinegar or 3 tablespoons rice vinegar, 1 tablespoon water, and 2 teaspoons sugar, dissolved over heat", "1/4 cup mayonnaise", "1 teaspoon rice vinegar (or substitute white vinegar)", "1 teaspoon sugar", "1 garlic clove, minced", "3 square sheets of nori seaweed (can be found in packages at most Asian groceries)", "10-12 leaves of romaine lettuce, thick ribs removed", "6 strips bacon, cooked to crispy and drained on paper towels", "1 large, firm tomato, cut into 1/2-inch strips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the mayonnaise, rice vinegar, sugar, and minced garlic into a smooth sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a square of nori on top of a sushi-rolling mat (these are ideal because their long slats of wood distribute pressure throughout the length of the roll). Wet your fingertips, and place little handfuls of rice evenly on top of the nori square. Spread until you have reasonably even, light layer of rice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange a few lettuce leaves in a single layer on top of the rice. Pile a neat, small line of bacon and tomato strips about 1/2-inch from the edge closest to you. Spread a neat, thin layer of the garlic mayonnaise across the fillings. Lift up the straw mat on that same side, and roll until the nori covers the fillings. Without pressing too hard, continue to roll, lifting the straw mat out of the way as you go along, until the entire nori sheet is rolled up. Press down a little bit on the finished roll to secure the ends. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a very sharp knife, cut the roll into five or six pieces. Place the pieces cut-side-up or down on a plate. Serve with wasabi and soy sauce.</p>"}]}