{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/10.18.2010deepfrycandy.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy", "deep-fried", "desserts", "fall", "frying"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Deep-Fried Halloween Candy", "link": "https://www.seriouseats.com/recipes/2010/10/cakespy-deep-fried-halloween-candy-recipe.html", "description": "That's right. Batter up your Halloween candy and fry it in hot oil, and you've got yourself little nuggets that are beyond decadent, and bound to satisfy&mdash;one or two of these morsels is more than enough.", "totalTime": "2 1/2 hours", "recipeYield": "18-24", "recipeCategory": ["Cakespy", "Candy", "Deep Frying", "Halloween"], "recipeIngredient": ["18-24 miniature candy bars or Halloween candies", "8 cups vegetable oil, for frying", "1 1/2 cups flour, divided ", "1 teaspoon baking soda", "1 cup milk", "1 tablespoon white vinegar", "1 tablespoon vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin by freezing your bars: remove your desired bars from their wrappers, and place them on a plate or cookie sheet. Freeze them for at least 2 hours, until they are solid and frozen throughout.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're nearing the end of the chilling period, start heating the oil for frying. Pour vegetable oil into a large, heavy-bottomed saucepan until it is three inches deep (the amount of oil you use will depend on the size of your saucepan). Turn the heat to medium-high, and insert a candy/deep fry thermometer. Heat until the oil reaches 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While you're waiting for the oil to heat up, prepare your frying station and batter. Place 1/2 cup of flour in a bowl and set aside. Place the remaining  cup of flour in a small bowl and mix with the baking powder and salt; add the milk, vinegar, and oil, and whisking the wet ingredients into the dry until you have a relatively lump-free, smooth, thick batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the frozen candy from the freezer. It's go time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dredge each piece of candy in flour, covering it completely. Holding it gently, dip each piece of candy into the batter until it is fully covered. Wipe hands off with a clean paper towel between dips, because your hands will probably get a little messy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly place the battered candy into the heated oil, being careful not to drop it and cause oil to splash up. Keep a close eye on the candy, because it will fry up quickly. If it bobs to the surface before it has turned golden, gently push it back down with a slotted spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the candy has reached an appealing golden hue, remove from the hot oil with a slotted spoon and place on a plate covered with a paper towel to absorb excess grease. Repeat the battering and frying process with the remaining candy. While frying, be sure to monitor the temperature of the oil and adjust your heat up or down accordingly, as the candy will melt if it is too hot, and it will take too long to fry and become greasy if the heat is too low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool slightly, but serve while still warm. </p>"}]}