{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101011_dt_taquitos.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["avocado", "chiles", "Dinner Tonight", "masa", "Mexican", "potatoes", "taquitos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Taquitos de Papa", "link": "https://www.seriouseats.com/recipes/2010/10/taquitos-de-papa-recipe.html", "description": "Though I know the idea of a potato filling, like this one from Diana Kennedy's <em><a href=\"http://www.amazon.com/dp/0292722664/?tag=serieats-20\">Oaxaca al Gusto: An Infinite Gastronomy</a></em>, might seem too boring and starchy, it comes out absolutely delectable. The combination of <strong>waxy potatoes and the complex chili sauce</strong> comes together quickly and with little effort. It's so good that you could spoon this onto a store-bought tortilla and be done. I wouldn't complain.", "totalTime": "", "recipeYield": "4 people", "recipeCategory": ["Avocado", "Dinner Tonight", "Mexican", "Potato"], "recipeIngredient": ["1 1/4 pounds waxy potatoes, rinsed and cut into small cubes, skins left on", "salt ", "2 guajillo chiles, stemmed and seeded", "4 garlic cloves, skins left on", "1 1/2 tablespoons lard", "1 1/4 pounds fresh masa ", "chopped lettuce", "spicy red salsa ", "sliced avocado", "4 limes, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the potatoes to a medium pot. Cover with water, and turn the heat to high. Season with a big pinch of salt. Once it reaches a boil, reduce heat to medium-low and cook for about 10 minutes, or until the potatoes are tender. Reserve 1/3 cup of the potato water. Then drain the potatoes in a colander, and then dump in a large bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes are cooking, place a large iron skillet over medium heat. Lightly toast the guajillo chiles for 30 seconds to a minute on each side. Make sure they don’t burn. Transfer to a bowl and cover with hot water. Let them soak for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the unpeeled garlic into the skillet. Toss often and cook for 5 to 10 minutes, or until the garlic is lightly blackened and soft. Let cool for a minute, and then remove the skins. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the guajillo chiles, and tear into 1-inch pieces. Toss in the blender along with the garlic and the potato water. Blend well. Strain this mixture through a sieve in a large bowl and toss with potatoes. Divide this mixture into 12 small piles. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the fresh masa into 12 equally sized balls. Flatten the balls in between two pieces of plastic wrap using a tortilla press. When flat, carefully remove the top piece of plastic. Place one pile of the potato mixture towards the bottom of the masa. Using the plastic wrap, roll the bottom portion of the masa up toward the top. Peel back the plastic wrap from the bottom. Roll top portion toward the bottom to create a cigar shaped package that completely covers the filling. Repeat 11 more times. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lard to a large iron skillet. Turn the heat to medium-low. Add as many of the taquitos as will fit in one layer. Slowly brown on all sides, turning every other minute or so. This might take up to 10 minutes. Repeat with the remaining taquitos. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with chopped lettuce, avocado, limes, and a generous spoonful of salsa. </p>"}]}