{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["baking", "pan pizza", "pizza", "Whole Foods"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Pan Pizza", "link": "https://www.seriouseats.com/recipes/2010/02/easy-pan-pizza-with-premade-store-bought-pizza-dough-recipe.html", "description": "Note: Read the results of our Whole Foods Pizza Kit taste test here....", "totalTime": "", "recipeYield": "2 ten-inch pies", "recipeCategory": ["Bread", "Mains", "Pizza"], "recipeIngredient": ["Non-stick cooking spray", "22 ounces pre-made pizza dough, at room temperature", "All-purpose flour", "6 tablespoons extra-virgin olive oil", "1 cup pizza sauce (store-bought, or homemade)", "8 ounces shredded mozzarella cheese (about 2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>coat two mixing bowls with non-stick cooking spray. Divide dough into two even lumps. Shape into balls and place in separate bowls. Spray top surface with more nonstick cooking spray, cover tightly with plastic wrap, and let rise in warm place until approximately doubled in volume, about one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to lower-middle position and preheat oven to 425 degrees. Add 3 tablespoons olive oil to bottom of two 10-inch cast iron skillets, or two 10-inch pie pans and turn to coat. Place 1-2 cups all-purpose flour in medium bowl. Working one dough ball at a time, transfer ball to bowl of flour and turn to coat. Using rolling pin on lightly floured surface, roll ball into 10-inch disk and transfer to greased cast iron skillet or pie pan. Repeat with second ball. Cover with lids or plastic wrap, and allow to rise in warm place for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid or plastic wrap, and top each pizza with half of sauce and half of cheese, leaving 1/2-inch gap around edge (use more or less cheese and sauce to taste). Bake until top is pale golden brown and bubbly, 15-20 minutes. Remove from oven, allow to rest for 1 minute, transfer to cutting boards, slice, and serve.</p>"}]}