{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101216-cookie-swap-mandelbrei-610.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cookies", "holiday cookies", "Jewish holidays", "mandel bread", "mandelbrot", "Nick Malgieri", "SE Cookie Swap 2010"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Traditional Jewish Mandelbrot (Mandel Bread)", "link": "https://www.seriouseats.com/recipes/2010/12/traditional-jewish-mandelbrot-mandel-bread-recipe.html", "description": "Baked for the 2010 Serious Eats Cookie Swap \"Family recipes aren't as set in stone as we all like to think. Like for example, this mandel bread. I called my mom for the recipe, which I'd attributed to my Grandma...", "totalTime": null, "recipeYield": "Makes about 48 biscotti", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["2 cups all-purpose flour", "1 teaspoon baking powder", "1/4 teaspoon salt", "About 1 cup golden raisins, mini chocolate chips, and walnuts or a combination of the three (Malgieri's recipe calls for almonds, and no raisins or chocolate chips.)", "2 large eggs", "1/2 cup sugar", "1 teaspoon vanilla extract (Malgieri calls for a teaspoon of almond extract in addition to the vanilla extract, but I skip it.)", "1/2 cup grapeseed or other neutral oil", "1/2 cup sugar mixed with 1 teaspoon cinnamon for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set rack in middle level of the oven and preheat to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine flour, baking powder, and salt; stir well to mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl, whisk eggs by hand until well mixed. Add sugar and whisk until smooth. Whisk in extract and oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold flour mixture into egg mixture until all flour is absorbed. Fold in nuts, raisins, and chocolate chips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, press dough together. Divide dough in half and roll each half into a log the length of your pan (14 to 18 inches). Place each log on pan and flatten slightly.  Bake until well-risen and firm, about 25-30 minutes. Cool the logs on the pans and racks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reset racks in upper and lower thirds of oven. Using sharp serrated knife, slice baked logs diagonally about every 1/2 inch. Place cinnamon-sugar mixture in a shallow dish and turn the cut cookies in it. Return biscotti to the pans, cut side down, and bake until dry and crisp, up to 20 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store cooled cookies between sheets of parchment or wax paper in tin or plastic container with tight-fitting container.  </p>"}]}