{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101018_sweetpotatoturnover.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fall", "gruyere", "sweet potatoes", "thyme", "turnovers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sweet Potato and Gruyère Turnovers", "link": "https://www.seriouseats.com/recipes/2010/10/sweet-potato-and-gruyere-turnovers0recuoe.html", "description": "I am not a baker. I almost always screw something up, leaving my kitchen disheveled and covered in a sticky coating of flour. But while these may not be the prettiest turnovers to ever emerge from an oven, even I have to admit that they were remarkably easy to construct. What else should expect from <em><a href=\"http://www.realsimple.com/food-recipes/browse-all-recipes/big-batch-sweet-potato-gruyere-00000000039485/index.html\">Real Simple</a></em> magazine? Just purchase some premade frozen pie crusts, top with a filling, fold them over, and then pop these in the oven and in 25 minutes or so. That's dinner.", "totalTime": null, "recipeYield": "3 to 4", "recipeCategory": ["Dinner Tonight", "Sweet Potatoes and Yams"], "recipeIngredient": ["1 medium onion, grated", "3/4 pound sweet potatoes, peeled and grated", "1/4 cup olive oil ", "1 bunch Swiss chard, stems discard and leaves chopped", "1/4 pound Gruyère, grated", "1/2 tablespoon fresh thyme leaves", "kosher salt and black pepper", "2 refrigerated rolled piecrusts", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 400°F. Pour the oil into a medium saucepan and heat on medium high until shimmering. Add the onion, and cook, stirring frequently, until soft, about 8 minutes. Add the swiss chard, and cook until wilted, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to a large bowl. Mix in the grated sweet potatoes, Gruyère, fresh thyme, 1/2 teaspoon salt, and pinch of black pepper. Let cool for a few minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the pie crusts in half, so you have four half circles. Spoon about 1/2-cup of the sweet potato mixture on one side of each half circle, leaving 1/2-inch border. Fold the dough over and crimp the sides. Using a knife, slice three openings on the top of the turnover. Repeat with the other three half circles. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the egg into a bowl, and whip with a fork. Brush the top of each turnover with egg. Line a baking sheet with parchment paper, and place the turnovers on top. Bake in the oven until the turnovers are golden brown, 20 to 25 minutes </p>"}]}