{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101017MeatballsPrimary.jpg", "author": {"@type": "Person", "name": "Kalle Bergman"}, "recipeCuisine": "", "keywords": ["lingonberries", "meatballs", "pickles", "Scandinavian", "Seriously Scandinavian", "Swedish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Seriously Scandinavian: Swedish Meatballs", "link": "https://www.seriouseats.com/recipes/2010/10/seriously-scandinavian-swedish-meatballs-recipe.html", "description": "Where do you start a journey through the Scandinavian kitchen? Well, perhaps with the most iconic Scandinavian dish of them all. <strong>Swedish meatballs. </strong>Now, first of all, we need to settle something: <strong>Mom's meatballs are always the best</strong> in the world. Regardless of the Mom. And perhaps even regardless of the meatballs. Just like Italian sons and daughters have their mother's cooking as a frame of reference for good food, Mom's meatballs have the same function in Sweden.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Beef", "Mains", "Pickling", "Seriously Scandinavian"], "recipeIngredient": ["<strong>For the Pickles:</strong>", "1/2 cup water", "1/3 cup sugar", "Salt", "1/2 cup distilled white vinegar", "1/2 a large cucumber, finely diced (about1 cup)", "1 bay leaf", "1 fresh red chili split in half", "5 whole mixed peppercorns", " ", "<strong>For the Lingonberry Jam:</strong>", "1 1/2 cups lingonberries", "1 1/2 cups sugar", " ", "<strong>For the Meatballs:</strong>", "1 medium onion, peeled and coarsley grated on a box grater (about 3/4 cup)", "1 1/2 pounds fresh ground chuck", "Kosher salt and freshly ground black pepper", "3 tablespoons sunflower or canola oil", " ", "<strong>For the Cream Sauce:</strong>", "1 tablespoon unsalted butter", "1/2 cup low-sodium beef stock", "1 1/2 cups heavy cream", "Pinch of sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pickles:</strong> Mix water, sugar, salt and vinegar in a large bowl. Whisk until sugar and salt is dissolved completely. Finely dice the cucumber, and add to the bowl. Make sure they are completely covered by the liquid. Add bay leaf, chili and peppercorns, and place in the refrigerator for at least one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lingonberries:</strong> Rinse the lingonberries thoroughly and put them in a bowl. Pour in the sugar, and gently stir until sugar is dissolved. Store in the refrigerator until serving.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meatballs:</strong> Melt the butter in a 10-inch skillet over medium heat until foaming. Add the onions and cook, stirring occasionally, until golden brown, 7-8 minutes. Transfer to large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add beef to onions and season to taste with salt and pepper. Combine mixture thoroughly and allow to rest 10-15 minutes. Form the meat into small balls roughly one-inch in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 10-inch nonstick skillet over mediumhigh heat until shimmering. Add as many matballs as fit in a single layer and cook until well browned on all sides, about 8 minutes total. Transfer to a large plate and repeat with remaining meatballs. Keep meatballs loosely tented with foil while preparing the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cream Sauce:</strong>Add two tablespoons water and the stock to the pan, scraping up any browned bits with a wooden spoon or rubber spatula. Adjust heat to low and simmer until sauce is reduced by one third, about 3 minutes. Add the heavy cream and continue to cook until the sauce is at the desired consistency (you can add more butter at this stage to help thicken it if you'd like). Season to taste with salt and pepper, adding a pinch of sugar if desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve meatballs, sauce, lingonberry jam, and cucumbers immediately with mashed potatoes and a few sprigs of dill.</p>"}]}