{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100705fiestaatricks.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Fiesta at Rick's", "ice cream", "mezcal", "Rick Bayless", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: White Chocolate-Mezcal Ice Cream", "link": "https://www.seriouseats.com/recipes/2010/07/white-chocolate-mezcal-ice-cream-recipe.html", "description": "This White Chocolate-Mezcal Ice Cream is a wonderful and cooling way to end a week of inspired recipes from <strong>Rick Bayless,</strong> and a flavor combination that I'm pretty sure only he could come up with.", "totalTime": "", "recipeYield": "1 quart, serving 6 to 8", "recipeCategory": ["Bake the Book", "Cook the Book"], "recipeIngredient": ["1 cup half-and-half", "4 ounces pure white chocolate, chopped into 1/4-inch pieces ", "4 egg yolks", "1/2 cup sugar", "1 1/3 cups heavy cream", "2 tablespoon Oaxacan mexcal", "1 teaspoon vanilla extract, preferably Mexican vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Set up a double boiler:</strong>Set up a 4-quart saucepan with 1 inch of water. Choose a 3-quart stainless steel bowl that you can nestle into the pan without touching the water. Bring the pot of water to a boil over high heat while you're preparing the custard base.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan over medium heat, warm the half-and-half until it steams. Spread the chocolate into a thin layer over the bottom of a bowl, then pour on the warm half-and-half. Stir until the white chocolate has begun to melt. In the stainless steel bowl that is part of your double boiler, whisk together the egg yolks and sugar until thoroughly combined, then whisk in the chocolate mixture. Reduce the temperature under the pot of water to maintain a gentle simmer. Set the bowl of custard base over the simmering water and whisk frequently, scraping down the sides of the bowl regularly with a rubber spatula, until the mixture thickens noticeably, about 5 minutes. The custard is sufficiently cooked when it reaches 180 degrees on an instant-read thermometer. (You can also test it by dipping a wooden spoon into the custard, then running your finger through the custard: if the line holds clearly, the custard has thickened sufficiently.) For the finest texture, pour the custard through a fine-mesh strainer into a similar-size stainless steel bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl halfway with ice. Nestle the custard into the ice and whisk regularly until completely cool. Refrigerate if not using immediately.</p>"}]}