{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201012-129424-anise-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["anise", "Cook the Book", "Cookies", "Fany Gerson", "holiday baking", "holiday sweets", "lime", "My Sweet Mexico"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bake the Book: Anise Cookies", "link": "https://www.seriouseats.com/recipes/2010/12/anise-cookies-recipe.html", "description": "Adapted from <em><strong>Delicias de Antaño</strong></em>, a volume on the history and recipes of Mexican convents, these <strong>Anise Cookies</strong> are flavored with anise (both seed and liqueur), lime zest, and <em>canela</em>, Mexican cinnamon.  The shortening-based dough makes for a crumbly cookie and when dipped in the anise syrup and finished with a dusting of cinnamon sugar, they are almost candy-like.  The anise-lime-cinnamon combo brings is reminiscent of a digestif&mdash;sweet and herbal.", "totalTime": null, "recipeYield": "30 cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts", "Lime"], "recipeIngredient": ["<strong>For the cookies:</strong>", "2 cups all-purpose flour", "1/2 cup (4 ounces) vegetable shortening", "1 teaspoon anise seed", "1 tablespoon anise liqueur", "Zest of 1 lime", "<strong>For the syrup:</strong>", "1/4 cup water", "1/2 cup sugar", "1 teaspoon anise liqueur ", "Sifted confectioner’s sugar mixed with a bit of freshly ground <em>canela</em> or cinnamon, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour into a bowl. Melt the shortening in a small pan and add the aniseed. Heat for a couple of minutes over low-medium heat, making sure they don’t burn, and then pour onto the flour. Mix with a spoon carefully but rapidly so no lumps are formed. Add the liqueur and lime zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out onto a lightly floured surface and knead until a smooth and uniform dough is formed, 3 to 5 minutes. With your hands, roll out pieces about 5 inches wide and 1/2 inch thick, starting in the center and rolling outward so that the pieces are evenly thick. Connect one end of each piece to the other, making a ring, and place on a parchment-lined baking sheet, about 1 inch apart. Refrigerate until firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Bake the cookies until slightly firm to the touch, about 10 minutes. Transfer to a wire rack to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the syrup, combine the water and sugar in a small pot over medium heat and cook until the sugar dissolves, 3 to 5 minutes. Remove from the heat and add the liqueur. Dip the tops of the cookies into the syrup and let dry on a rack. Pour any remaining syrup over the cookies and let cool completely.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust with the confectioner’s sugar mixture and enjoy (they are best eaten the same day).</p>"}]}