{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/IMG_9081.JPG", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brussel sprouts", "holiday recipes", "vegetables"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Seared Brussels Sprouts With Bacon Lardons", "link": "https://www.seriouseats.com/recipes/2010/11/seared-brussels-sprouts-with-lardons.html", "description": "Note: Slab bacon is ideal for this recipe, though sliced bacon will work in a pinch. You can also substitute your favorite cured pork product. Prosciutto, guanciale, or Spanish dry-cured chorizo all work well. If your brussels sprouts are very...", "totalTime": "40 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Bacon", "Christmas", "Sides", "Thanksgiving", "The Food Lab"], "recipeIngredient": ["1/2 pound slab bacon, cut into 1/2-inch by 1/4-inch lardons", "3 tablespoons olive oil", "2 pounds small brussels sprouts, outer leaves discarded, stems trimmed, split in half", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon and olive oil to 12-inch nonstick skillet. Add enough water to barely cover and cook over medium-high heat, stirring to break up bacon. Allow water to completely evaporate, about 8 minutes. Continue to cook, stirring and tossing occasionally until bacon is crisp on all sides, about 8 minutes. Transfer to fine mesh strainer set over large heat-proof bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss sprouts in bowl with bacon fat until well coated. Wipe out skillet and add 1 teaspoon bacon fat. Heat over high heat until smoking. Add as many sprouts as fit in single layer face down to skillet and cook without moving until deeply charred, about 3 minutes. Flip and cook on until second side is charred and sprouts are tender-crisp throughout, about 3 minutes longer. Season to taste with salt and pepper and transfer to serving bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with remaining sprouts. Add rendered bacon to serving bowl and toss all to combine. Serve immediately.</p>"}]}