{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100316tamalepie_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["casserole", "corn", "Eat for Eight Bucks", "pies", "Southwestern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Tamale Pie", "link": "https://www.seriouseats.com/recipes/2010/03/eat-for-eight-bucks-tamale-pie-recipe.html", "description": "How did I make it through the first 30 years of my life without being aware of tamale pie, a cornbread-topped Southwestern-ish one-dish-meal that is right up my alley?", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Corn", "Eat for Eight Bucks"], "recipeIngredient": ["Olive oil", "1 onion, chopped", "1 tablespoon chopped garlic", "1 teaspoon cumin", "1/4 teaspoon cayenne", "Salt", "Pepper", "4 to 6 ounces frozen or defrosted corn kernels (about half a package)", "1 pound cooked shredded pork shoulder (2 cups packed)", "2 cups cooked beans", "1 cup bean cooking liquid or stock", "3/4 cup flour", "3/4 cup yellow cornmeal", "1 teaspoon baking powder", "3/4 teaspoon chili powder", "3/4 cup buttermilk or milk (I use buttermilk powder)", "4 tablespoons (1/2 stick) unsalted butter, melted", "1 large egg", "1 tablespoon honey", "1 cup coarsely grated pepper jack cheese", "Sour cream or yogurt and cilantro to serve, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Heat 1 tablespoon olive oil in a 10-inch ovenproof skillet, preferably cast-iron, over medium heat. (If you do not have an ovenproof skillet, you can prepare the filling in whatever you have and then transfer it to a 10-inch pie plate or other baking dish before topping with cornbread batter and baking.) When the oil is hot, add the onion and cook until soft and beginning to brown, about 10 minutes. Then stir in the garlic, cumin, and cayenne and season with salt and pepper. After about a minute, stir in the corn kernels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the corn kernels are no longer frozen, add the pork and beans to the skillet and stir until well combined. Then pour in the bean cooking liquid or stock and bring to a simmer. Simmer for a few minutes and then turn off the heat. Taste and adjust seasoning as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cornbread topping: Whisk the flour, cornmeal, baking powder, chili powder, and 3/4 teaspoon salt in a large bowl to blend. In a smaller bowl, whisk together the buttermilk, melted butter, egg, and honey. Stir the wet ingredients into the dry just until blended and then stir in 1/2 cup of the cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the remaining cheese over the pie filling in the skillet. Drop the cornbread batter in large spoonfuls over the top of the filling and then spread it evenly to cover the filling completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until cornbread topping is deep golden brown and a tester inserted into the center comes out clean, 30 to 40 minutes. Serve hot with sour cream or yogurt and cilantro for garnishes, if you like.</p>"}]}