{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100930PissaladièreSlice610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["anchovies", "French", "French in a Flash", "pizza", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pissaladière", "link": "https://www.seriouseats.com/recipes/2010/09/french-in-a-flash-classic-pissaladiere-recipe.html", "description": "Pissaladière is a kind of pizza or tart from the South of France, bathed in sweet onions and studded with anchovies and olives. Sweet and salty, meaty and satisfying, it's the perfect afternoon snack or lunch with a glass of wine.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["French", "Pizza"], "recipeIngredient": ["1 pound store-bought or <a href=\"http://www.seriouseats.com/tags/recipes/pizza%20dough\">homemade pizza dough</a>", "Olive oil or nonstick spray", "1 (2-ounce) can anchovies packed in olive oil", "1/2 cup milk", "3 tablespoons extra virgin olive oil, divided", "4 medium onions, thinly sliced (about 4 cups)", "Kosher salt", "19 pitted Niçoise olives", "2 stems fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 475°F. Shape dough into ball and place in medium bowl coated lightly with olive oil or nonstick spray. Cover tightly with plastic and set aside at room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine anchovy filets and milk in small bowl and set aside. Add 2 tablespoons olive oil to heavy-bottomed 12-inch sauté pan and heat over medium-high heat until shimmering. Add onions and season to taste with salt. Reduce heat to low and cook, stirring frequently until golden brown, about 40 minutes. If onions start to turn black, stir in one tablespoon water and continue to cook. Transfer to small bowl and allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll dough on well-floured work surface with rolling pin into even circle about 12-inches in diameter and 1/2-inch thick. Transfer to rimmed baking sheet. Spread onions evenly over surface, leaving one-inch border.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse anchovies gently in running water. Scatter anchovies, olives, and thyme sprigs over surface of pizza (see note)  Season lightly with salt (anchovies and olives are salty), and drizzle with remaining tablespoon olive oil. Bake until the crust is golden, puffed, and crisp, about 15 minutes. Serve immediately.</p>"}]}