{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100308thinminthowto.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "chocolate", "Cookies", "desserts", "Girl Scout Cookies", "mints", "Thin Mints"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "4"}, "name": "Cakespy: Homemade Thin Mints", "link": "https://www.seriouseats.com/recipes/2010/03/cakespy-homemade-thin-mints-girl-scout-cookies-recipe.html", "description": "<strong>Smug, smug little Girl Scouts.</strong> Those sweet-looking sugar-pushers can be found all over this time of year, lurking outside drugstores and markets with their addictive little missives of sweet cookies. Oh, they seem so friendly and accommodating now. But what happens in a month or so, when they're gone and you've got a serious jonesing for some Samoas or Thin Mints? <strong>You make your own,</strong> that's what you do.", "totalTime": "", "recipeYield": "about 36 cookies", "recipeCategory": ["Cakespy", "Chocolate", "Cookies"], "recipeIngredient": ["<strong>For the cookies:</strong>", "2 1/4 cups all purpose flour", "1/4 cup cornstarch", "6 tbsp unsweetened cocoa powder", "1/2 tsp salt", "1 cup white sugar", "1/2 cup butter, room temperature", "1/3 cup milk (any kind)", "1/2 tsp vanilla extract", "3/4 tsp peppermint extract", "<strong>For the dark chocolate coating:</strong>", "10 ounces dark or semisweet chocolate (I used Hershey's Special Dark) ", "1/2 cup butter, room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together flour, cornstarch, cocoa powder and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, cream together butter and sugar. With the mixer on low speed, add in the milk and the extracts. Mixture will look slightly curdled. Gradually, add in the flour mixture until fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape dough into two logs, about 1 1/2 inches in diameter. Wrap each log in plastic wrap and freeze for at least 1 to 2 hours (I did mine overnight), until dough is very firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the most authentic texture, slice dough into rounds not more than 1/4 inch thick (they will not be as crisp if they are thicker, but they're still delicious) and place on a parchment lined baking sheet. Cookies will not spread very much, so you don't have to leave too much space around each one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 13 to 15 minutes, until cookies are firm at the edges. Cool cookies completely on a wire rack before dipping in chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the coating. While the original recipe suggested preparing it in the microwave, I did mine on the stovetop by combining the chocolate on butter in a medium saucepan on low heat, stirring frequently until the mixture was melty and fully combined. The texture will be thicker than a chocolate syrup, but not so thick that cookies can't easily be dipped and removed. You can put the chocolate mixture back on heat as needed to keep the coating smooth and easy to dip your cookies into.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>Per the recipe I adapted, this can also be done in the microwave: in a microwave safe bowl, combine chocolate and butter. Melt on high power in the microwave, stirring every 45 to 60 seconds, until chocolate is smooth. Chocolate should have a consistency somewhere between chocolate syrup and fudge for a thin coating. (Note: Reheat chocolate as needed to keep it smooth and easy to dip into.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip each cookie in melted chocolate, turn with a fork to coat, then transfer to a piece of parchment paper or wax paper to set up for at least 30 minutes, or until chocolate is cool and firm.</p>"}]}