{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101119-chocolatesorbet.jpg", "author": {"@type": "Person", "name": "Ethan Frisch"}, "recipeCuisine": "", "keywords": ["chocolate", "dark chocolate", "ice cream", "sorbet", "UK"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Scooped: Really Dark Chocolate Sorbet", "link": "https://www.seriouseats.com/recipes/2010/11/really-dark-chocolate-sorbet-recipe.html", "description": "Brits love their multi-layered peanut-caramel-cookie-nougat-and-air-bubble-filled concoctions, but ask for <em>real</em> dark chocolate, and they start muttering about the fall of the British Empire. In an attempt to satisfy my craving for intense, bitter dark chocolate after moving to London, I tried this sorbet recipe: it's a wonderful, incredibly creamy frozen dessert that is so rich and smooth, no one will believe it's a sorbet.", "totalTime": "4-8 hours", "recipeYield": "1.5 quarts", "recipeCategory": ["Chocolate", "Dairy-Free", "Ice Cream and Frozen Treats"], "recipeIngredient": ["6 egg yolks", "12 oz dark chocolate (at least 70% cocoa solids), finely chopped", "3 cups (24 oz) bottled water", "1 cup sugar", "1 tablespoon instant coffee"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 3 tablespoons of water and 3/4 cup of sugar over medium heat until light golden caramel color is achieved. Reduce heat to low and add remaining water (sugar will sputter) and instant coffee.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk egg yolks with remaining 1/4 cup sugar until pale yellow. Whisking constantly, add one ladle of hot sugar mixture to eggs in slow steady stream. Whisking constantly, slowly pour egg mixture into pot with hot sugar mixture. Heat over low heat whisking constantly until thick enough to coat back of spoon. Pour through sieve into heatproof bowl with chopped chocolate. Mix with rubber spatula until fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool mixture in refrigerator at least 4 hours. Spin ice cream in ice cream machine according to manufacturer's instructions.</p>"}]}