{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100706bacontomatoguacamole.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["avocado", "Cook the Book", "Fiesta at Rick's", "guacamole", "Rick Bayless"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rick Bayless's Bacon and Tomato Guacamole", "link": "https://www.seriouseats.com/recipes/2010/07/bacon-and-tomato-guacamole-dip-recipe.html", "description": "<em><a href=\"http://www.amazon.com/Fiesta-Ricks-Fabulous-Great-Friends/dp/0393058999/serieats-20\">Fiesta at Rick's</a></em> by <a href=\"http://www.rickbayless.com/\">Rick Bayless</a> is a must-have for anyone who's enamored of all things avocado-related.  And if guacamole is your thing (but really, who doesn't love it?) <em>Fiesta at Rick's</em> has some of the tastiest variations out there.  With a fruit as creamy, rich, and versatile as the avocado there are countless ingredients that can be added to the mix&mdash;mango for sweetness, toasted pumpkin seeds for a nutty crunch, and, of course, bacon. This <strong>Bacon and Tomato Guacamole</strong> takes the classic flavors of a BLT and pairs them with smooth avocado, and spicy, smokey chipotles in adobo, along with the lime, onion, and cilantro.", "totalTime": "", "recipeYield": "about 3 cups, serving about 8 to 10 as a nibble", "recipeCategory": ["Avocado", "Bacon", "Cook the Book", "Guacamole"], "recipeIngredient": ["5 strips medium-thick bacon (full-flavored smoky bacon is great here)", "3 medium-large (about 1 1/4 pounds) ripe avocados", "1/2 medium white onion, chopped into 1/4-inch pieces", "2 or 3 canned chipotle chiles <em>en adobo</em> to taste, removed from the canning sauce, stemmed, split open, seeds scraped out and finely chopped", "1 medium-large round, ripe tomato, cored and chopped into 1/4-inch pieces", "1/4 cup (loosely packed) coarsely chopped cilantro (thick bottom stems cut off), plus a little extra for garnish", "Salt", "1 or 2 tablespoons fresh lime juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (10-inch) skillet, cook the slices of bacon in a single layer over medium heat, turning them occasionally, until crispy and browned, about 10 minutes. Drain on paper towels, then coarsely crumble.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut around each avocado, from stem to blossom end and back again, then twist the two halves apart. Dislodge the pit. Scoop the flesh from the skin into a large bowl. Using an old-fashioned potato masher or a large fork or spoon, mash the avocados into a coarse puree.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the onion into a small strainer and rinse under cold water. Shake off the excess water and transfer to the bowl, along with the chipotle chiles, tomatoes, cilantro (save out a little for garnish if you wish) and about 2/3 of the bacon. Gently stir to combine all of the ingredients. Taste and season with salt, usually about 1/2 teaspoon, and enough lime juice to add a little sparkle.</p>"}]}