{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100427-nasty-bits-pigs-head.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["Fleisher's", "headcheese", "Nasty Bits", "pig's head", "ramen broth"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Nasty Bits: Pig's Head", "link": "https://www.seriouseats.com/recipes/2010/04/the-nasty-bits-breaking-down-a-pigs-head-offal-headcheese-ramen-recipe.html", "description": "So I had some space issues this week. <a href=\"http://www.seriouseats.com/2010/04/the-nasty-bits-welcome-to-fleishers-meat-shop-kingston-ny-lambs-brains.html\">After my first few days as an apprentice at Fleisher's Meats</a> in Kingston, New York, I returned  to New York City laden with four garbage bags' worth of the finest meat around. <strong>But the crowning glory was the pig's head, molars and all.</strong>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Pork", "The Nasty Bits"], "recipeIngredient": ["1 pig's head", "1 bouquet garni, or 1 large section of ginger", "1 cup sake or cooking wine", "A dozen black peppercorns", "3 tablespoons salt, plus more to taste", "<strong>For seasoning the headcheese mixture:</strong>", "Juice of 1/2 lemon, or 1/4 cup rice or sherry vinegar", "More salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pig's head in the pot along with the rest of the ingredients.  Cover with water by 2 inches.  Bring to a simmer, then reduce the heat and very gently simmer for 5 hours, or until all the meat is tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the head from the pot and let cool slightly.  Peel away all the hefty sections of meat, such as the cheek and near the brains and set aside.  Place the head back into the pot, along with any bones that may have come loose during the transplant, and simmer for 3 hours longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the head from the pot once again.  Strain the cooking liquid through a sieve.  Spoon a bit of the stock into a small bowl or plate and chill the liquid to check the thickness of the gel.  If should be firm but not too rubbery.   If it doesn't gelatinize, reduce the liquid by 1/4 and retest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finish removing all the meat, collagen material, and skin from the head.  Cut the mixture into a rough 1 inch dice.  If you stewed a tongue alongside the head, cut that into a 1/2-inch dice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a terrine mold or loaf pan with plastic wrap, leaving enough overhang on the two long sides to fully cover the mold.  Combine all the meat in the mold, along with the lemon juice or vinegar, as well as more salt and pepper to taste.  You'll need to use your fingers to gently mix the meat with the tongue and make sure that the saltiness is to your liking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour enough of the cooking liquid over to just cover.  Fold the plastic wrap over the top and press down on the mixture to make sure that the mixture fills out the entire space of the mold.  Refrigerate overnight, or up to two weeks.</p>"}]}