{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100325porkagnolotti.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Italian", "keywords": ["Aeronuova", "coco", "Cook the Book", "Italian", "Mario Carbone", "pancetta", "pastas", "pork", "sauces", "tomato sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pork Agnolotti with Tomato Marmellata and Crisp Pancetta", "link": "https://www.seriouseats.com/recipes/2010/03/pork-agnolotti-with-tomato-marmellata-and-crisp-pancetta.html", "description": "This <strong>Pork Agnolotti with Tomato Marmellata and Crisp Pancetta</strong> adapted from the menu that Carbone contributed to <em><a href=\"http://www.amazon.com/Coco-World-Leading-Masters-Choose-Contemporary/dp/0714849545/serieats-20\">Coco</a></em> was inspired by a BLT, especially the B and T.", "totalTime": null, "recipeYield": "10", "recipeCategory": ["Cook the Book", "Italian", "Pasta", "Pork"], "recipeIngredient": ["<strong>For the pasta dough:</strong> 6 cups semolina flour", "20 egg yolks", "Semolina, for dusting ", "<strong>For the vegetable stock:</strong> 16 to 20 cups water", "1 carrot", "1 stick celery", "1 onion", "1 fennel bulb ", "<strong>For the filling:</strong> 3/8 cup extra-virgin olive oil", "One 10 to 11 pound pork shoulder, cut into 1-inch chunks", "5 white onions, sliced thickly", "A little less than one 6 ounce can of tomato paste", "2 tablespoon kosher salt, or more to taste", "12 black peppercorns", "4 bay leaves", "3 cups white wine", "3 cups vegetable stock ", "<strong>For the Tomato Marmellata:</strong> 3/8 cup extra-virgin olive oil", "2 cloves garlic, sliced", "6 to 7 San Marzano canned tomatoes, strained", "1 tablespoon salt", "Leaves from one large bunch fresh thyme", "<strong>For the pancetta:</strong> 5 to 6 ounces thinly sliced pancetta", "2 eggs, beaten with 3 teaspoons water", "Butter", "Thyme leaves", "Olive oil ", "Cracked black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the ingredients in a mixer with a dough hook and continue to mix on a low speed for 10 minutes. Remove the dough and let rest for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 10 equal pieces. Take 1 piece of dough and dust with semolina, then, starting on the widest setting, begin to pass it through your pasta machine. Reduce the number on your pasta attachment with every pass of the dough until you reach the smallest number on the roller. Dust with fresh semolina and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the vegetable stock:</strong> Simmer all the ingredients together for 3 hours, strain, cool and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the filling:</strong> Put the olive oil in a large pan, heat, add the pork, and sear on all sides. Remove the pork, drain off any excess fat, and add the onions and tomato paste. Cook for 2 minutes, then season with the salt, peppercorns, and bay leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pork to the pan, add the wine and stock, and braise for 2 1/2 hours or until tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish the filling, place the braised pork in a food processor and pulse quickly to create a smooth yet chunky consistency. Fill disposable pastry (piping) bags with the mixture and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the tomato marmellata:</strong> In a wide-based pot heat the olive oil and add the garlic. Cook until the edges of the garlic start to brown but not burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes, salt, and thyme. Cook for 10 minutes on medium heat, stirring constantly. As the water evaporates the sauce will thicken to a compote consistency. Remove from the heat and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pancetta:</strong> Preheat the oven to 325°F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pancetta slices on a metal rack set over a baking sheet. Bake for 15 minutes or until golden brown and crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble:</strong> Take 1 rolled pasta sheet and lay it flat on the counter. Pipe the pork filling out in 25-gram piles, leaving space in between them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a brush, apply a very thin layer of egg wash around the piles of filling and then gently lay a second sheet of pasta on top. With your fingers, gently pinch the dough between each pile of filling to seal the agnolotti, then cut around them using a knife or pasta wheel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the agnolotti in boiling salted water until they float (about 3 minutes). For each serving, place 10 agnolotti in a pan with 2 tablespoons butter, 2 sprigs of thyme, 2 tablespoons water, and 1 teaspoon olive oil. Toss until fully emulsified, and spoon onto a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the agnolotti with spots of the warm marmellata, fresh cracked black pepper, and the crisp pancetta.</p>"}]}