{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100602SorrelSalmon610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["en papillote", "fish", "French in a Flash", "salmon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Salmon with Sorrel and Asparagus en Papillote", "link": "https://www.seriouseats.com/recipes/2010/06/french-in-a-flash-salmon-with-sorrel-en-papillote-recipe.html", "description": "The classic combination of salmon and sorrel come together in a simple one-disposable-packet meal&mdash;asparagus and creamy, herby sauce included. Eat the fish out of the packet, perhaps with some five-minute fluffed couscous or plain boiled new potatoes or even crusty, warm baguette. Clean-up is virtually non-existent, the meal takes basically no work, and yet the combination of flavors is sophisticated, and innovative while being traditional.", "totalTime": "", "recipeYield": "1", "recipeCategory": ["French", "Salmon"], "recipeIngredient": ["5 ounces boneless, skinless salmon fillet", "10 stalks thin asparagus, woody ends trimmed off", "2 to 4 fresh sorrel leaves", "1 tablespoon crème fraîche", "1 tablespoon dry white wine", "lemon zest to taste", "salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold a large piece of parchment in half, and cut around to create a pouch shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the asparagus on one side of the parchment.  Place the salmon on top, season with salt and pepper, and then place the sorrel leaves on top.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with crème fraîche, white wine, and lemon zest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Seal by folding the edge in pleats, one overlapping the last.  The trick is to fold it in any way that does not allow steam to escape, using a couple staples if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>There are several ways to seal the parchment or foil when cooking <em>en papillote</em>.  The general rule of thumb is to do whatever you want just so long as the packet is very tightly sealed, allowing no steam to escape.  Foil, or foil lined with parchment, facilitates the process.  But if using just parchment, admittedly more aesthetically pleasing, work your way around, pleating the edges.  I have been known to staple the final pleat for security, both technical and emotional.  <a href=\"http://www.seriouseats.com/2010/03/how-to-cook-food-en-papillote-packages-vegetables-meat-fish.html\">Here are the full Serious Eats instructions</a> for traditional papillote cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Park the papillote packages on a baking sheet, and bake for 12 to 15 minutes.</p>"}]}