{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100114-cremebrulee.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Crème Brûlée", "desserts", "gluten free", "Make it Fast Cook it Slow", "slow cooker", "Stephanie O'Dea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Crème Brûlée", "link": "https://www.seriouseats.com/recipes/2010/01/creme-brulee-slow-cooker-recipe.html", "description": "<strong>The little custards cooked perfectly evenly in the slow cooker and the texture and flavors were spot on,</strong> and the sugar sprinkled on top caramelized in just a few minutes under the heat of the broiler, no torch needed. Crème brûlée coming out of my kitchen, made with a slow cooker no less&mdash;it's really kind of incredible.", "totalTime": null, "recipeYield": "makes 4 servings", "recipeCategory": ["Cook the Book", "Desserts", "Gluten-Free", "Puddings and Custards", "Slow Cooker"], "recipeIngredient": ["2 cups heavy cream", "5 egg yolks", "1/2 cup granulated sugar (baker's or fine sugar is best)", "1 tablespoon vanilla extract", "1/4 cup raw sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a 6-quart slow cooker and a heat-resistant dish that fits all the way inside your stoneware. I used a 1 1/2-quart casserole dish. Add water around the dish, until halfway up the side of the dish. (You are using the slow cooker as a bain-marie, or water bath.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, whip together the eggs, cream, sugar, and vanilla.  Pour the mixture into the dish, cover, and cook on high for 2 to 4 hours. The custard should be set with the center still a bit jiggly. Touch the surface lightly with your finger to check. Unlike an oven, it will be difficult to overcook this. Try not to worry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very carefully (use oven mitts!) remove the dish and let cool completely on the countertop, then chill in the refrigerator for 2 to 3 hours. Before serving, sprinkle raw sugar over the top and brown with a kitchen torch, or place under the broiler for 3 to 5 minutes, or until the sugar has browned. Chill again before serving.</p>"}]}