{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/on%20grill.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "grill", "grilling"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Lazy Day Summer Sandwich Bread", "link": "https://www.seriouseats.com/recipes/2010/09/lazy-day-summer-sandwich-bread-recipe.html", "description": "<strong>Good bread can't be rushed, but it can be delayed.</strong> When you're feeling lazy, this bread accommodates. There are the usual steps, but it's all at a slow pace. And perfect for the last remaining days of summer, I cooked this one in the gas grill. Why not? It's just a big outdoor oven.", "totalTime": "7 hours", "recipeYield": "8 (makes 1 loaf)", "recipeCategory": ["Bread Baking"], "recipeIngredient": ["1 cup cold water", "4.5 ounces (1 cup) white whole wheat flour", "2.75 ounces (1/2 cup) semolina flour", "1 package (2 1/2 teaspoons) instant yeast", "4.5 ounces (.82 cups) bread flour", "1 teaspoon kosher salt", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, combine water, white whole wheat flour, semolina flour, and yeast. Mix thoroughly with a spoon, then cover with plastic wrap and set aside at room temperature for two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After two hours, add bread flour and salt, and knead at low speed using dough hook until smooth and elastic, about 10 minutes. Add oil and continue kneading until the oil is completely incorporated, about 1 minute longer. Form dough into a ball, drizzle with a little oil, and return to bowl. Cover with plastic wrap and set aside to rise until doubled in volume, about one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle cornmeal on bottom of loaf pan and set loaf pan on top of rimmed baking sheet. Dust work surface with a little flour and knead dough with your hands briefly, then form it into a tight, smooth log. Place it, seam-side down in the prepared loaf pan. Cover the pan with plastic wrap and set aside to rise until doubled, about 30 minutes. Meanwhil, preheat gas grill to 350°F, leaving center burner off, or preheat oven to 350°F with rack set in middle position. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, slash the top of the loaf and place baking sheet in center of grill or oven. Bake until golden brown and center of bread registers 210 degrees on an instant-read thermometer, about 40 minutes. Let cool for five minutes remove from pan, transfer to wire cooling rack and allot to cool at least 2 hours before serving.</p>"}]}