{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100217-dt-pollo-piccante.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["chicken", "Dinner Tonight", "Italian", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Piquant Chicken", "link": "https://www.seriouseats.com/recipes/2010/02/dinner-tonight-piquant-chicken-recipe.html", "description": "[Photograph: Blake Royer] Some people like briny, piquant flavors like olives and capers, and some don't. Maybe it's an acquired taste. But all I know is that you can't go on just liking them for long: \"like\" eventually becomes \"love.\"...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Italian", "Mains"], "recipeIngredient": ["1 whole small chicken, about 2 1/2 pounds, or equivalent of bone-in chicken pieces", "1/4 cup olive oil", "2 cloves garlic, peeled and lightly crushed", "1/2 teaspoon red chile pepper flakes", "1/2 cup white wine", "2 tablespoons capers", "12 oil-cured black olives, pitted and quartered", "Small handful flat-leaf parsley, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the chicken is not already in serving pieces, cut it up into drumsticks, thighs, and cut each breast in half. Leave the skin on. Heat the oil in a large enough skillet to comfortably hold the chicken pieces without crowding, over medium heat. Add the garlic cloves and cook until golden, then remove them and add the chicken skin-side down. Cook until the skin releases from the pan and is golden, then brown the other side. The pieces should be golden brown all over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the chicken with the chile flakes and half the parsley, and cook for 30 seconds, then add the white wine. Bring to a boil and cook for 3 minutes, scraping up any browned bits in the bottom of the pan, then add the capers and olives. Cover, turn the heat to a simmer, and cook for 30 minutes until the chicken is tender and easily pierced with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift the chicken onto a warmed platter, then turn off the heat. After the juices have begun to settle and the fat has risen to the top, about 2 minutes, tilt the skillet and spoon off most of the fat, leaving behind the juices, capers, and olives. Spoon the sauce over the chicken and serve sprinkled with the remaining parsley.</p>"}]}