{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100914-dt-roasted-poblano-potato-salad-with-grilled-steak.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Roasted Poblano-Potato Salad with Grilled Steak", "link": "https://www.seriouseats.com/recipes/2010/09/dinner-tonight-roasted-poblano-potato-salad-with-grilled-skirt-steak-recipe.html", "description": "It's not exactly Mexican and not exactly European, but a nice compromise between the two.  The recipe can be made with a high-quality canned tuna or, in this variation, topped with thin slices of medium-rare skirt steak. But the real star is the mixture of warm potatoes, poblanos, and sweet slices of red onion, dressed lightly with rice vinegar and olive oil and seasoned with a little oregano.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Dinner Tonight", "Salads"], "recipeIngredient": ["2 fresh poblano chiles", "4 medium (about 1 pound total) red-skin potatoes, cut into 1/2-inch pieces", "salt as needed", "1/3 cup olive oil", "1 medium red onion, sliced 1/4-inch thick", "3 tablespoons mild vinegar, such as rice or champagne", "1 teaspoon dried oregano, preferably Mexican", "1/2 teaspoon ground black pepper", "1/2 pound skirt steak, seasoned with salt and pepper", "1/2 cup chopped cilantro", "1-2 heads Romaine, Boston, or Bibb lettuce for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over an open flame, roast the poblano peppers until charred all over, about 5 minutes.  Place in a bowl and cover with a plate or plastic wrap and let cool.  Slip off the skins and remove the stem and seeds. Rinse and cut into 1/4-inch strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, put the potatoes into a microwaveable bowl.  Toss with 1 teaspoon salt and cover with plastic wrap.  Microwave on high heat for 4-5 minutes, until completely tender.  Leave covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large (10 or 12-inch) skillet over medium-high heat until shimmering.  Add the onion and cook for 4-5 minutes, until golden but still slightly crunchy. Remove from the heat and stir in the poblano strips, vinegar, oregano, and black pepper.  Stir well to combine, then pour over the cooked potatoes and add the cilantro.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat a grill pan or grill and cook the steak to desired doneness.  Allow to rest for 5 minutes, then slice thinly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the salad leaves on a platter or individual plates, then top with the warm potato mixture and then the steak.  Drizzle any dressing in the bottom of the potato bowl and serve immediately.</p>"}]}