{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101118_habLARGE.jpg", "author": {"@type": "Person", "name": "Andrea Lynn"}, "recipeCuisine": "", "keywords": ["chicken", "habanero", "holiday recipes", "Serious Heat", "spicy", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Habanero-Brined Roasted Turkey", "link": "https://www.seriouseats.com/recipes/2010/11/habanero-brined-roast-turkey-thanksgiving.html", "description": "For the family who worships fiery food, this is a way to relish spiciness for Thanksgiving. <strong>Soaked in a habanero-filled brine,</strong> this turkey packs a punch you won't soon forget. If the family isn't totally on board for a spicy turkey, then pare down the brine recipe and use it for a chicken instead.", "totalTime": null, "recipeYield": "10 to 12", "recipeCategory": ["Chicken", "Serious Heat", "Turkey"], "recipeIngredient": ["<strong>For the brine:</strong>", "2 cups kosher salt", "1 cup sugar", "10 cloves garlic, peeled", "2 teaspoons coarsely ground pepper", "8 habanero chiles", "<strong>For the turkey:</strong>", "1 (12- to 15-pound) turkey", "1 onion, cut into quarters", "2 habanero chiles", "4 tablespoons butter, softened, plus extra", "freshly ground pepper", "3/4 cup chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the brine: In large stockpot with lid, combine salt and sugar with 21/2 gallons cold water. Stir to dissolve, and add garlic and pepper. Wearing gloves, slice habaneros almost into quarters, but leave stem-end intact. Place habaneros into brine, and stir. Remove giblets from turkey, and refrigerate. Rinse turkey with cool water, and place it into brine, making sure bird is fully submerged. Cover the stockpot with plastic wrap and lid, and refrigerate for 12 to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the turkey: When ready to cook turkey, preheat oven to 400°F. Wearing gloves, take turkey out of brine, discard brine, and pat dry. Place reserved giblets in the bottom of roasting pan, and place the turkey, breast-up on top of giblets. Place onion in bowl. Cut habaneros nearly in quarters, keeping stem end attached, and add to onions. In a small pan, melt 2 tablespoons of the butter, and pour over the onion and habaneros. Wearing gloves, toss mixture gently with your hands. Place inside turkey cavity. Rub the remaining butter all over the outside of turkey, and sprinkle with pepper. Tie drumsticks together with kitchen twine, and tuck wingtips up and under wings. Cover turkey breast with buttered sheet of aluminum foil, and place in oven. Roast for 50 minutes. Meanwhile, heat broth to just a simmer, and keep warm. After 50 minutes, remove foil from breast, and baste with 1/2 cup of warmed broth. Continue to cook, basting with pan juices every 30 minutes, until thermometer inserted into thickest part of thigh reads about 165°. Baste with remaining 1/4 cup broth if the pan becomes too dry. The turkey should need 2 1/2 to 3 hours total cooking time. If legs become too brown, cover them with foil while continuing to cook. Remove from oven, and allow to rest for at least 20 minutes. Carve, and serve.</p>"}]}