{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100504-butcherscuts-brisketscompared.JPG", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["mains", "pork", "The Butcher's Cuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Brisket Braised in Milk", "link": "https://www.seriouseats.com/recipes/2010/05/pork-brisket-braised-in-milk-recipe.html", "description": "Learn more about pork brisket here. [Photographs: Chichi Wang]...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Braising and Stewing", "Mains", "Pork"], "recipeIngredient": ["1 three to four pound skin-on, boned-out pork brisket, to be rolled and tied up", "Salt and pepper", "Fresh sage and thyme, 1 tablespoon of each, chopped, or 1/2 teaspoon dried", "2 tablespoons olive oil or lard", "1 tablespoon garlic", "1 quart whole milk", "2 bay leaves", "The juice of 1/2 lemon", "Zest from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the salt, pepper, and herbs all over the meat. Depending on the size of your roast, you will need about 1 1/2 to 2 teaspoons of salt and pepper, each. Roll and tie up the roast into a cylinder. The roast will benefit from being salted and kept in the refrigerator overnight, or you can proceed with the recipe immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F. In a dutch oven, heat the 2 tablespoons of oil or lard. Add the tied up roast and brown it on all sides, about 10 minutes total. 5 minutes into the browning, add the chopped garlic and let it brown alongside the meat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the meat from the pot and pour off all but 1 teaspoon of the fat. Add the milk, bay leaves, lemon juice and zest. Bring the mixture to a oil, deglazing the pot. Return the roast to the pot, placing the skin side up. Cover the pot and braise in the oven for 1 hour. Remove the cover and braise for 30 minutes longer, or until the internal temperature of the roast registers around 160 to 170&deg;F. The skin on the roast should be golden brown and crisp.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the roast from the pot and place it into a saute pan or hotel pan. Place the roast under the broiler for 30 seconds to 1 minute, to further crisp up the skin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> 5.</strong>  In the meantime, reduce the sauce: Take the braising milk in the pot and place it on top of the stove. Simmer the sauce for 5 to 7 minutes, until the sauce has formed light-brown curds. Remove the bay leaves. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice as much of the roast as you need into 1/2-inch thick slices, arrange on a platter, and spoon the sauce over them. Serve immediately. Leftovers may be refrigerated and sliced cold for use in sandwiches.</p>"}]}