{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101221-bread-baking-speedy-honey-buns.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Speedy Honey Buns", "link": "https://www.seriouseats.com/recipes/2010/12/bread-baking-speedy-honey-buns-dinner-rolls.html", "description": "This dough is sweet enough that you could use it for cinnamon rolls, but without the cinnamon/sugar combo these resemble dinner rolls I've had at some barbecue restaurants. Pizza yeast gives these a quick rise, while honey adds flavor.", "totalTime": "2 hours", "recipeYield": "15", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup milk", "1/2 stick (4 tablespoons) unsalted butter", "1/4 cup honey", "1 package pizza yeast*", "13 1/2 ounces (about 2 1/2 cups) bread flour", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat milk to boiling in a small saucepan, then pour it into the bowl of your stand mixer. Add butter and honey. Stir occasionally to encourage the butter to melt. When the milk has cooled to lukewarm, add yeast and about 1/3 of the flour and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the mixture sit until it bubbles, just a few minutes. Add the rest of the flour and the salt and knead with the bread hook until the mixture is smooth an elastic. Preheat the oven to 350 degrees and sprinkle some cornmeal on a baking sheet. (I used a quarter-sheet pan because I wanted the buns to touch during baking so the sides would be soft. Use a larger pan and spread the buns out if you don't want them to touch.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto your work surface and divide it into 15 pieces. Form each into a ball and place them seam-side down on the baking sheet. Cover with plastic wrap and set aside to rise until doubled, about an hour. When the buns have risen, bake at 350 degrees until golden, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>*If you don't have pizza yeast, you can use instant or active dry yeast. In that case, let the dough rise once in the bowl, then punch it down and form the rolls and let them rise a second time before baking.</p>"}]}