{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100212grandcentralscones.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "dried fruit", "Ellen Jackson", "Piper Davis", "scones", "The Grand Central Baking Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grand Central Bakery Scones", "link": "https://www.seriouseats.com/recipes/2010/02/grand-central-bakery-scones-recipe.html", "description": "\"They're moist in a way you don't expect scones to be.\" [Photograph: Caroline Russock] As far as breakfast pastries go, I'd never really been much of a scone enthusiast. Give me a danish or muffin over a dry, crumbly coffee...", "totalTime": null, "recipeYield": "6 large or 12 small scones", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["2 1/2 cups (12.5 ounces) all-purpose flour", "1/4 cup (1.75 ounces) granulated sugar", "1 tablespoon baking powder", "1 teaspoon salt", "1/2 teaspoon ground cinnamon", "1/2 cup (4 ounces, or 1 stick) cold unsalted butter", "1 cup dried fruit", "1/2 cup nuts, lightly toasted and coarsely chopped", "2 eggs", "1/2 cup (4 fluid ounces) buttermilk", "Egg wash", "1/4 cup (1.75 ounces) turbinado sugar", "&nbsp;", "<strong>Egg Wash</strong>", "1 egg", "1 tablespoon water", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare to bake: Preheat the oven to 350°F. Line a baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the dry ingredients: Measure the flour, sugar, baking powder, salt, and cinnamon into a bowl with high sides or the bowl of a stand mixer and whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut in the butter, then add the fruit and nuts: Dice the butter into 1/2-inch cubes. Use your hands or the paddle attachment of the stand mixer on low speed to blend the butter into the dry ingredients until the pieces of butter are the size of almonds. Add the dried fruit and nuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs and buttermilk: Whisk the eggs and buttermilk together, then add two-thirds of the mixture to the dry ingredients. Gently mix the dough just until it comes together, then add the remaining buttermilk mixture; the dough will look rough. Scrape the dough from the sides and bottom of the bowl and mix again to incorporate any floury scraps. The majority of the dough will have come together, on the paddle if using a stand mixer. Stop mixing while there are still visible chunks of butter and floury patches. The dough should come out of the bowl in one piece, leaving only some small scraps and flour on the sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form and cut the dough: Turn the dough out onto a lightly floured surface. Gather it and pat just a few times to get it to come together. The top won't be smooth, but the rough surface creates a crunch that is part of a scone's charm. Gently form dough into a 7- to 8-inch disk (or, for smaller scones, into two 4- to 5-inch disks), brush with the egg wash, and sprinkle with turbinado sugar. Cut the disk into 6 wedges, like a pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake: Place the scones on the prepared pan, in a grid with 3 by 2 for large scones and 4 by 3 for small scones. Bake for 30 to 35 minutes (20 to 25 minutes for small scones), rotating the pan halfway through the baking time. The scones should be golden brown.</p>"}]}