{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100629-kikkoman-panko2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "bread crumbs", "lemon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Asparagus with Lemon and Crispy Bread Crumbs", "link": "https://www.seriouseats.com/recipes/2010/06/grilled-asparagus-with-lemon-and-crispy-bread.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: After graduating from MIT, J. Kenji Lopez-Alt spent many years as a chef, recipe developer, writer, and editor in Boston. He now lives in New York with his wife. Got a suggestion...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Asparagus", "Grilling", "Lemon"], "recipeIngredient": ["1/2 cup panko breadcrumbs", "1 medium shallot, finely minced (about 2 tablespoons)", "1 clove garlic, minced on a microplane", "3 tablespoons extra-virgin olive oil, plus extra for drizzling", "Kosher salt and freshly ground black pepper", "1 1/2 pounds asparagus, trimmed and peeled if necessary", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine bread crumbs, shallot, garlic, and 2 tablespoons olive oil in heavy-bottomed 12-inch skillet. Cook over medium-high heat, stirring and tossing occasionally until bread crumbs are golden brown. Season to taste with salt and pepper. Transfer to small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss asparagus with remaining tablespoon olive oil in large bowl and season with salt and pepper. Grill asparagus over a prepared hot grill or grill pan set over high heat until charred in spots and tender-crisp. Return to bowl and toss with half of breadcrumbs and juice of half the lemon. Transfer to a serving platter, top with remaining breadcrumbs, and serve with remaining half lemon, cut into wedges.</p>"}]}