{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101005-dt-sea-scallops-alla-caprese.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["caprese", "Mario Batali", "salad", "scallops", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Dinner Tonight: Sea Scallops alla Caprese", "link": "https://www.seriouseats.com/recipes/2010/10/dinner-tonight-sea-scallops-alla-caprese.html", "description": "Taking a cue from the <em>piazza </em>style of cooking (which produces similar results to the Spanish technique of cooking seafood <em>a la plancha</em>), this recipe calls for cooking the scallops on a blazing hot surface inside of a grill. From there, it's pretty familiar: grilled red onion, a simple dressing of olive oil and lemon juice, and fragrant basil over the whole mess.  For me, it was all a lovely goodbye to summer.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Dinner Tonight", "Salads"], "recipeIngredient": ["2 pounds mixed heirloom tomatoes, cut into wedges or bite-size pieces", "24 fresh basil leaves", "2 medium red onions, cut into 1-inch thick slices", "Kosher salt and freshly ground black pepper to taste", "6 tablespoons extra virgin olive oil", "1 1/2 pounds large fresh dry scallops", "1 lemon, cut in half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a gas or charcoal grill with a piazza or large cast iron griddle inside, or heat the griddle on a stovetop (see note).  Place the red onion slices on the hot surface without oil and season the top with salt.  Cook until soft and charred, 5-7 minutes. Flip, season second side, and cook until second side is charred.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place tomatoes in a large mixing bowl and tear the basil leaves over them.  Once the onions have cooked and cooled slightly, separate into rings and scatter over the tomatoes.  Drizzle with 4 tablespoons olive oil and season to taste with salt and pepper. Lay tomato mixture on a platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully carve a checkerboard pattern into one side of each scallop (about 1/4-inch deep) and toss them with salt, pepper, and remaining 2 tablespoons olive oil.  Preheat cooking surface until very hot, then cook the scallops, design-side-down, until golden and almost cooked through, 5-7 minutes.  Flip and cook for just 30 seconds on the second side, then remove from the heat. Arrange on tomato salad, squeeze the lemon halves over everything, and top with flaky sea salt.  Serve immediately.</p>"}]}