{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100809sweetzucchinipancakes.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["Crisper Whisperer", "pancakes", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Zucchini Pancakes Redux", "link": "https://www.seriouseats.com/recipes/2010/08/the-crisper-whisperer-zucchini-pancakes-redux-recipe.html", "description": "Last week The Crisper Whisperer featured <a href=\"http://www.seriouseats.com/recipes/2010/08/the-crisper-whisperer-zucchini-pancakes-recipe.html\">savory zucchini pancakes</a>. I liked them. You liked them. From the looks of things, we ate quite a few. But still, growing out there in the garden and piling high at the market, there's <strong>more zucchini</strong>. So this week, there are more zucchini pancakes. These little guys are sweet, spiced like zucchini bread, and even more pancakey than last week's version.", "totalTime": "50 minutes", "recipeYield": "2", "recipeCategory": ["Crisper Whisperer", "Vegetarian"], "recipeIngredient": ["2 fairly large zucchini (about 3 cups shredded and loosely packed)", "1/4 teaspoon salt", "2 eggs", "1/4 cup sugar", "1/2 teaspoon pure vanilla extract", "1/2 teaspoon cinnamon", "1/4 teaspoon nutmeg", "1/2 cup flour", "1 teaspoon baking powder", "2 tablespoons peanut or other neutral oil, plus more if needed", "Butter and maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shred the zucchini on the large holes of a box grater or in a food processor with the shredding disk. Place the shredded zucchini in a colander in the sink and sprinkle with the salt. Toss to combine. Let drain for 30 minutes, then pick up by the handful and squeeze out as much moisture as possible. Place on a kitchen towel or double layer of paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the eggs, sugar, vanilla, cinnamon, and nutmeg. Beat well with a fork. Add the drained zucchini and mix together. Sprinkle the flour and baking powder on top and mix with a fork just until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat one tablespoon of the oil over medium-high heat in a wide, heavy pan. When the oil is hot, drop the batter into the pan by heaping tablespoonful. Cook for about three minutes on the first side, until nicely browned. Flip and cook for about two minutes more. Place the cooked pancakes on a rack and repeat with the remaining oil and batter. Serve with butter and maple syrup, if desired (though they're quite sweet on their own).</p>"}]}