{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100614frankiestomatosauce.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Frank Castronovo", "Frank Falcinelli", "The Frankies Spuntino Kitchen Companion &amp; Cooking Manual", "tomato sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Cook the Book: Frankies' Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2010/06/frankies-tomato-sauce-recipe.html", "description": "My quest for the perfect <strong>tomato sauce</strong> has been a long and arduous one, involving countless cans of tomatoes, garlic cloves, and liters upon liters of olive oil.  It's a question of finding the perfect balance of sweetness and acidity using a very limited amount of ingredients.  But after trying this one from <em><a href=\"http://www.amazon.com/Frankies-Spuntino-Kitchen-Companion-Cooking/dp/1579654150/serieats-20\">The Frankies Spuntino Kitchen Companion &amp; Cooking Manual</a></em> by <a href=\"http://www.frankiesspuntino.com/\">Frank Falcinelli and Frank Castronovo</a>, I think I've finally found my go-to sauce.", "totalTime": "", "recipeYield": "about 3 quarts", "recipeCategory": ["Condiments and Sauces", "Cook the Book"], "recipeIngredient": ["1 cup olive oil", "13 cloves garlic", "One 96-ounce can (or, if you can find it, 1-kg) or four 28-ounce cans Italian tomatoes Large pinch of red pepper flakes", "2 teaspoons fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the olive oil and garlic in a large deep saucepan and cook over medium-low heat for about 10 minutes, stirring or swirling occasionally, until the garlic is deeply colored&mdash;striations of deep brown running through the golden cloves&mdash;and fragrant.  If the garlic starts to smell acrid or sharp or is taking on color quickly, pull the pan off the stove and reduce the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the garlic is getting golden, deal with the tomatoes:  Pour them into a bowl and crush them with your hands.  We like to pull out the firmer stem ends from each of the tomatoes as we crush them and discard those along with the basil leaves that are packed into the can.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the garlic is just about done, add the red pepper flakes to the oil and cook them for 30 seconds or a minute, to infuse their flavor and spice into the oil.  Dump in the tomatoes, add the salt, and stir well.  Turn the heat up to medium, set the sauce simmering at a gentle pace, not aggressively, and simmer for 4 hours.  Stir it from time to time.  Mother it a little bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Check the sauce for salt at the end.  The sauce can be cooked with meat at this point, or stored, covered, in the fridge for at least 4 days or frozen for up to a few months.</p>"}]}