{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100328brik_eggs.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["eggs", "Sunday Brunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Brik-inspired Eggs", "link": "https://www.seriouseats.com/recipes/2010/03/sunday-brunch-brik-inspired-eggs-recipe.html", "description": "Colorful, fresh, and slightly spicy, one-skillet brik-inspired eggs with potatoes, feta, and harissa will be welcome at brunch or at supper.", "totalTime": "", "recipeYield": "3-4", "recipeCategory": ["Vegetarian"], "recipeIngredient": ["1 red bell pepper", "1/2 teaspoon cumin seeds", "1 teaspoon caraway seeds", "Olive oil", "1 tablespoon lemon juice", "2 cloves garlic, chopped", "Sambal olek or cayenne pepper", "Salt", "Freshly ground pepper", "1 pound boiling potatoes, quartered", "1/2 teaspoon turmeric", "4 eggs", "3 ounces crumbled feta", "4 6-inch round Middle Eastern flatbreads, such as pita", "1/4 cup chopped fresh cilantro or parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the cumin seeds and half of the caraway seeds in a small skillet until golden brown and fragrant, about 3 minutes over medium heat. Put them into a blender along with the red pepper, 2 tablespoons olive oil, lemon juice (I had none and used 1/2 tablespoon red wine vinegar), and garlic, and puree until smooth. Add sambal olek or cayenne to taste and season with salt and pepper. (I had no sambal olek and instead used 1/4 teaspoon cayenne, 1/4 teaspoon salt, and 1/4 teaspoon pepper. This was pleasantly spicy but not eye-watering.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put potatoes in saucepan with cold water to cover. Season with salt, bring to a simmer, and cook until just tender when pierced with a sharp knife, about 10 minutes. Drain, let cool, and dice (you can do this up to 2 days ahead).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in large, heavy skillet over medium heat. Add the potatoes, remaining caraway, and turmeric (I used only 1/4 teaspoon turmeric) and cook until potatoes begin to brown, about 10 minutes. Season with salt and pepper to taste. Push potatoes to edge of skillet and reduce heat to low. Crack eggs into skillet, spacing evenly. Sprinkle feta over eggs and drizzle with harissa. Cover and cook until whites are set but yolks are soft, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, brush the flatbreads with olive oil and heat on griddle until warm, turning once. Put one flatbread on each of 4 plates. Top with eggs and potatoes, sprinkle with cilantro, and serve.</p>"}]}