{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101026-dt-carrot-vichyssoise.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["carrots", "Dinner Tonight", "fall", "soups", "vichyssoise"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Carrot Vichyssoise", "link": "https://www.seriouseats.com/recipes/2010/10/carrot-vichyssoise-soup-recipe.html", "description": "The point of vichyssoise is the simplicity: a puree of potato, cream, stock provide the soup's body to showcase whichever vegetable is at hand. The addition of carrot gives it a beautiful color and sweetness; the result is basically essence of carrot in soup form.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Soups and Stews"], "recipeIngredient": ["2 tablespoons olive oil", "3 large leeks (1 1/2 pounds), white and light green parts coarsly chopped", "1 medium clove garlic, minced", "4 small Yukon Gold potatoes (1 1/2 pounds), peeled", "5 carrots (9 ounces), peeled", "2 1/2 cups chicken stock or low-sodium chicken broth", "1 1/2 teaspoons salt, or to taste", "1/8 teaspoon freshly ground black pepper, or to taste", "2 cups whole milk", "3 tablespoons snipped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the carrots and potatoes.  Cut half the potatoes into small chunks and half the carrots into 1/4-inch thick rounds.  Reserve the remaining potatoes and carrots.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a dutch oven or stock pot, heat the oil over medium heat until shimmering.  Add the leeks and garlic, cover, and cook, stirring occasionally, until wilted, about 10 minutes.  Add the cubed potatoes, sliced carrots, stock, salt, pepper, and two cups of water.  Bring to a boil, then simmer until vegetables are tender, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and stir in the milk, then transfer to a blender to puree until smooth.  Season to taste with salt and pepper.  If desired, chill in the refrigerator, or return to the heat to warm through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a saucepan of salted water to boil.  Cut the remaining potatoes and carrots into fine matchsticks and blanch them in the water until just tender, 2-3 minutes.  Drain and, if serving the soup cold, shock them in cold water.  Otherwise, add them to the soup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the soup in shallow bowls with the vegetable matchsticks and snipped chives.</p>"}]}