{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100812azoreankalesausageandbeansoup.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "David Leite", "kale", "kidney beans", "sausage", "The New Portuguese Table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Cook the Book: Azorean Kale, Sausage, and Bean Soup", "link": "https://www.seriouseats.com/recipes/2010/08/cook-the-book-azorean-kale-sausage-and-bean-soup-recipe.html", "description": "According to <strong><a href=\"http://leitesculinaria.com/about\">David Leite</a></strong>, author of <strong><em><a href=\"http://www.amazon.com/New-Portuguese-Table-Exciting-Flavors/dp/0307394417/serieats-20\">The New Portuguese Table</a></em>,</strong> a <em>caldo verde</em> only contains one slice of <em><a href=\"http://en.wikipedia.org/wiki/Chouriço\">chouriço</a></em>, not nearly enough for him, or for that matter, me.  I decided to go with a heartier version of this soup, an <strong>Azorean Kale, Sausage, and Bean Soup</strong>.", "totalTime": null, "recipeYield": "8 to 10", "recipeCategory": ["Beans and Pulses", "Cook the Book", "Kale", "Pork"], "recipeIngredient": ["1 1/4 cups dried red kidney beans, picked over, rinsed, and soaked overnight in water to cover by 3 inches ", "2 tablespoons olive oil, or more if needed", "12 ounces chouriço, linguiça, or dry-cured smoked Spanish chorizo, cut into 1/4-inch coins", "2 large yellow onions, chopped", "1 Turkish bay leaf", "3 garlic cloves, minced", "1/2 teaspoon crushed red pepper flakes", "4 cups homemade beef stock, or low-sodium store bought broth", "1 1/2 pounds red potatoes, peeled and cut into 1/2-inch cubes", "1/2 pound collard greens or kale, thick center stems and fibrous veins removed, roughly chopped", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans, dump them into a medium saucepan, and cover with water.  Bring to a boil, then reduce the heat to low and simmer, partially covered, until the beans are tender but still hold their shape, about 45 minutes.  Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the olive oil in a large pot over medium heat until it shimmers.  Toss in the chouriço and cook until browned, 7 to 10 minutes.  Fish out the slices with a slotted spoon and transfer to paper towels.   Pour off all but 3 tablespoons of the fat from the pot, or if the pot is dry, drizzle in more oil so you have 3 tablespoons.  Add the onions and bay leaf and cook, stirring often, until the onions are deeply golden brown, 20 to 25 minutes.  Adjust the heat as necessary to prevent the onions from burning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the garlic and red pepper flakes and cook for 1 minute.  Pour in the beef stock and 5 cups of water, add the potatoes, and bring to a boil over high heat.  Reduce the heat to low and simmer, covered, until the potatoes are just tender, 10 to 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the soup is simmering, spoon a third of the beans and a bit of the soup broth into a food processor.  Pulse to make a loose paste, then, if desired, pass the paste through a sieve.  Straining the paste gives the dish extra body without errant bean skins floating in your soup.  It's entirely optional but, I think, preferable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are cooked, stir in the collards, chouriço, bean paste, and beans.  Turn off the heat and let the soup sit for 10 minutes to marry the flavors.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bay leaf, season the soup with salt and pepper to taste, and ladle into warm bowls.</p>"}]}