{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101118CranberryIceCream610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["cranberries", "desserts", "holiday recipes", "ice cream", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "The Secret Ingredient (Cranberry): Cranberry Ice Cream with White Chocolate Chunks", "link": "https://www.seriouseats.com/recipes/2010/11/the-secret-ingredient-cranberry-ice-cream-dessert-recipe.html", "description": "The tartness of cranberry is one of the few things that can rein in that over-the-top sweetness of white chocolate.  What a perfect ice cream that would make, and what an unexpected Thanksgiving dessert to scoop next to a slice of pumpkin pie.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cranberry", "Desserts", "Ice Cream and Frozen Treats", "The Secret Ingredient"], "recipeIngredient": ["1 (12-ounce) bag cranberries", "1 cup granulated sugar, divided", "2 cups heavy cream", "1 cup whole milk", "Salt", "5 large egg yolks", "4 ounces white chocolate, cut into chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepot, heat cranberries and 1/3 cup sugar on medium-high heat until cranberries just begin to get hot. Cover pot and lower heat to medium-low.  Cook 10 minutes, stirring often, until berries soften and burst.  Transfer berry mixture to blender and purée.  Pass cranberry purée through fine mesh strainer.  The mixture should yield about 1 cup of smooth cranberry purée.  Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large saucepot, heat together cream, milk, 1/3 cup sugar, and pinch of salt over medium-low heat until just scalded (bubbles will form around edges of cream).  Meanwhile, use electric beater to beat together egg yolks and remaining 1/3 cup sugar, until mixture is pale and thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cream mixture is hot, pour 1/3 of it into egg yolk mixture and whisk quickly to temper egg yolks.  Pour mixture back into pot with remaining cream, and cook over low heat. Use wooden spoon to constantly stir custard until thick enough to coat back of spoon, about 170&deg;F.  Pass custard through fine mesh sieve into large bowl.  Whisk in cranberry mixture.  Cover cranberry custard, and chill in the refrigerator until thoroughly chilled, at least 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze according to the manufacturer’s directions.  Just before the ice cream is completely churned, add white chocolate chunks.  Transfer to lidded container, and freeze for at least 4 hours.  Let stand at room temperature 10 minutes before scooping and serving.</p>"}]}