{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100103-nastybits-calfsliver1.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["calf's liver", "Fergus Henderson", "liver", "liver and onions", "offal", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "The Nasty Bits: Calf's Liver with Onions", "link": "https://www.seriouseats.com/recipes/2010/01/the-nasty-bits-calfs-liver-with-onions-offal-recipe.html", "description": "\"Liver is the ultimate quick-cooking offal.\" Calf's liver. [Photographs: Chichi Wang] Although I've been gnawing on chicken feet for most of my life, my love affair with viscera began in earnest in college. I was the student who, between mouthfuls...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Mains", "Offal", "The Nasty Bits"], "recipeIngredient": ["2 to 3 tablespoons olive oil", "1 onion, sliced finely", "1/4 cup flour, seasoned with 1/2 teaspoon salt and ground pepper, to taste", "1/2 cup aged vinegar, such as balsamic, apple cider, or fig", "2 dozen sage leaves", "Additional oil, approximately 4 tablespoons, for frying the sage leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the liver into slices 1/3 inch thick. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of oil in a large, heavy frying pan over low heat.  Add the onions and sauté over low heat for 10 or so minutes, until the onions are tender and browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a little more oil to the pan and turn up the heat to high.  Lightly dredge the slices of liver in the flour mixture and lay them in the pan.  Cook for 1 to 2 minutes on each side, until the surface is deeply browned and the center is pink.  Transfer the cooked slices of liver to 4 warmed plates while you finish the sauce.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over medium to medium-low heat, deglaze the pan with the aged vinegar, scraping up the crusty bits that will have stuck to the pan.  Reduce the vinegar until only two tablespoons are left.  Drizzle the vinegar over the liver on the plates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate pan or wok, heat up a shallow pool of oil and briefly fry the sage leaves until they are crispy and lightly browned, about 10 seconds.  Scatter the sage leaves and onions all around the plates of liver.  Serve immediately.  </p>"}]}