{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/BlackberryDuck_rec.jpg", "author": {"@type": "Person", "name": "Sue Veed"}, "recipeCuisine": "", "keywords": ["berries", "blackberries", "couscous", "duck", "gastriques", "spring onions", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Crispy Duck with Blackberry Gastrique, Roasted Pearl Onions, and Israeli Cous-Cous", "link": "https://www.seriouseats.com/recipes/2010/09/crispy-duck-with-blackberry-gastrique-recipe.html", "description": "Fatty, rich duck breast is balanced by a sweet reduction of blackberries and red wine. Alongside Israeli cous-cous and sweet, roasted pearl onions, the duck makes for an elegant and satisfying dinner.", "totalTime": "40 minutes", "recipeYield": "4", "recipeCategory": ["Duck", "Other Meats"], "recipeIngredient": ["12 pearl or cipollini onions, ends trimmed, skins removed", "1 tablespoon extra-virgin olive oil", "Kosher salt and black pepper", "1/2 cup sugar", "2 tablespoons water", "1/2 cup red wine vinegar", "1 tablespoon dry red wine, such as cabernet", "2/3 cup fresh blackberries", "2 sprigs thyme", "1 teaspoon canola oil", "4 skin-on duck breast halves", "2 cups cooked Israeli cous-cous"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Toss onions and olive oil in medium bowl to coat. Season generously with salt and pepper. Transfer onions to rimmed baking sheet and roast until a knife tips slips easily in and out of the onion, about 35 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine sugar and water in small heavy-bottomed saucepan. Cook over medium-high heat until sugar is dissolved. Continue to cook without stirring until the liquid reaches a light blond caramel color, 5-8 minutes, swirling gently to help mixture cook evenly. Add red wine vinegar all at once (mixture will boil very rapidly). Continue to cook until sugar is re-dissolved, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine to pan and reduce until slightly syrupy, about 2 to 3 minutes. Add blackberries and thyme and cook until blackberries have broken down slightly and mixture is dark red with the texture of light maple syrup. Remove from heat and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the duck:</strong> Pat duck breasts dry with paper towels and season generously on both sides with salt and pepper. Heat canola oil in a 12-inch heavy-bottomed cast iron or stainless steel skillet over medium-high heat until shimmering, about 2 minutes. Gently place duck breasts in pan skin-side down and press down firmly with spatula to ensure good contact between skin and pan. Cook until the skin is golden brown and crispy, 6 to 8 minutes. Using tongs, flip breasts and cook on second side until thickest part of breast registers 130 degrees on an instant read thermometer for medium, about 3 minutes longer, or 140 degrees for medium-well, about 4 minutes longer. Transfer duck breasts skin-side-up to large plate, tent loosely with foil and allow to rest 3-5 minutes. Rewarm gastrique over low heat if necessary. Slice duck and serve with cous-cous, onions, and gastrique.</p>"}]}