{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101201_dt_drycookedcabbage.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["cabbage", "Dinner Tonight", "peas", "spicy", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Dry-Cooked Cabbage with Tofu and Peas", "link": "https://www.seriouseats.com/recipes/2010/12/dry-cooked-cabbage-with-tofu-and-peas-recipe.html", "description": "How can this be a dinner? I mean, it's just a bunch of cabbage and tofu. While I worried this recipe from <em><a href=\"http://www.saveur.com/article/Recipes/Dry-Cooked-Cabbage-with-Tofu-and-Peas\">Saveur</a></em> would be too light and insubstantial, <strong>I was hooked by the use of ginger, mustard, and coriander.</strong> It was too alluring to ignore. Good thing, too. <strong>Something strange happens to the tofu.</strong> After a thin coating of flour, it's pan-fried until golden. When mixed with the cooked cabbage, it takes on an almost potato-like flavor, which helps balance the aggressive spices and serranos. One plate should fill anyone up.", "totalTime": "40 minutes", "recipeYield": "4 people", "recipeCategory": ["Cabbage", "Dinner Tonight", "Legumes", "Tofu"], "recipeIngredient": ["1 cup flour", "1 (12-ounce) package firm tofu, cut into ½-inch cubes ", "10 tablespoons ghee or canola oil ", "2 teaspoons mustard seeds", "2 tablespoons grated fresh ginger", "1 tablespoons ground coriander, divided ", "1 teaspoon ground turmeric ", "½ teaspoon asafetida ", "1 serrano chile, stemmed, seeded, and finely chopped", "½ head cabbage, core removed, and thinly sliced ", "Kosher salt ", "1 cup frozen peas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry off tofu with paper towels. Dump flour onto large plate. Add half of tofu and toss gently until evenly covered. Shake off excess. Pour four tablespoons ghee or oil into 12-inch iron skillet set over medium-high heat. Heat until shimmering. Add flour-coated tofu. Cook tofu, turning occasionally, until golden brown on all sides, about five minutes total. Remove tofu and drain on paper towel-lined plate. Turn off heat, carefully clean out skillet, and repeat with remaining tofu. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour last two tablespoons of ghee or oil into medium-sized dutch oven set over medium high heat. Heat until shimmering. Add mustard seeds. Cook until they start to pop, about 30 seconds. Add ginger, two teaspoons coriander, turmeric, asafetida, and serrano. Stir well, and cook until fragrant, about one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cabbage and pinch of salt. Cook, stirring every minute, until very tender, about 15 minutes. Add remaining coriander, fried tofu, peas, and another pinch of salt. Stir well and cook until everything is warm, about two minutes. Season with more salt to taste. Serve with white rice. </p>"}]}