{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100228lemonpoppyseedcake.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "cakes", "lemons", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Lemon Poppy Seed Pound Cake", "link": "https://www.seriouseats.com/recipes/2010/02/sunday-brunch-lemon-poppy-seed-pound-cake-dessert-breakfast-recipe.html", "description": "This lemon poppy seed pound cake is one of those Platonic ideal recipes that everyone should have in her repertoire.", "totalTime": "", "recipeYield": "1 standard or 3 mini loaves", "recipeCategory": ["Cakes", "Lemon"], "recipeIngredient": ["3 tablespoons milk, room temperature", "3 large eggs, room temperature", "1 1/2 teaspoons vanilla", "1 1/2 cups (5 1/4 ounces) sifted cake flour", "1 cup plus 2 tablespoons sugar, divided  ", "3/4 teaspoon baking powder", "1/4 teaspoon salt", "1 tablespoon (6 grams) loosely packed grated lemon zest", "3 tablespoons (28 grams) poppy seeds", "13 tablespoons unsalted butter, softened", "1/4 cup freshly squeezed lemon juice (I got this out of 2 lemons easily)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°. Grease your pan(s), line bottom(s) with parchment paper, grease parchment, and flour pan interior. In a small mixing bowl, lightly combine the milk, eggs, and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine the flour, 3/4 cup of the sugar, the baking powder, salt, lemon zest, and poppy seeds. Mix on low speed for 30 seconds to blend. Add the butter and half the egg mixture. Mix on low speed until the dry ingredients are moistened. Increase speed to medium (high if using a hand mixer) and beat for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape down sides. Add remaining egg mixture in 2 batches, beating for 20 seconds after each addition. Scrape down sides and scrape batter into prepared pan. Bake until a wooden toothpick inserted in the center comes out clean, 55-65 minutes for an 8 x 4 inch loaf, 30-35 minutes for mini loaves. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shortly before the cake is done, put the lemon juice and the remaining 1/4 cup plus 2 tablespoons sugar in a small pan. Stir over medium heat until the sugar has dissolved. As soon as the cake comes out of the oven, put it on a rack, poke all over with a wire tester or a toothpick, and brush with half of the syrup. Cool in pan for 10 minutes, then invert onto greased wire rack. Poke bottom of cake with tester, brush with some syrup, and set right side up. Brush sides with remaining syrup and allow to cool before wrapping airtight. Store for 24 hours before eating for best results, to give syrup a chance to distribute evenly. (Good luck with that waiting.)</p>"}]}