{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101012artichokewhitebeansalad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["artichokes", "Brendan Vaughan", "Cook the Book", "Dressler", "Melissa Vaughan", "recipe newsletter", "salads", "salsa verde", "The New Brooklyn Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Warm Artichoke Heart Salad with White Beans, Arugula, and Salsa Verde", "link": "https://www.seriouseats.com/recipes/2010/10/warm-artichoke-heart-salad-with-white-beans-arugula-and-salsa-verde-recipe.html", "description": "[Photograph: Caroline Russock] As far as Michelin-starred Brooklyn restaurants go (not that there are very many of them) Dressler has to be the most unassuming. Tucked away in the south side of Williamsburg, Dressler puts out consistently elegant new American...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["<strong>For the beans:</strong>", "1/2  cup dried great northern beans, rinsed and soaked overnight in room- temperature water to cover", "1 carrot, halved", "1 celery stalk, halved", "1/2 yellow onion, peeled ", "1 small garlic clove, peeled", "Coarse salt and freshly ground black pepper", "<strong>For the salsa verde:</strong>", "1 cup fresh flat-leaf parsley leaves, coarse chopped", "1 tablespoon drained capers", "1 small garlic clove, minced", "1/2 cup extra-virgin olive oil", "<strong>For the artichokes:</strong>", "4 to 6 cups homemade chicken stock or prepared low-sodium chicken broth", "1 lemon, cut in half", "6 large globe artichokes, each 4 to 4 1/2 inches in diameter", "3 fresh thyme sprigs", "1 carrot, cut in half  ", "1 celery stalk, cut in half  ", "1/2 medium onion, cut in half ", "1 garlic clove", "<strong>For the creamy garlic dressing:</strong>", "1 large egg yolk ", "1 garlic clove, shaved on a Microplane or sliced as thin as possible", "2 tablespoons freshly squeezed lemon juice", "2 tablespoons red wine vinegar", "1 1/4 cups canola oil", "1/4 cup heavy cream", "1 teaspoon freshly ground black pepper", "2 tablespoons finely grated Parmigiano-Reggiano ", "Coarse salt", "<strong>For the arugula salad:</strong>", "2 cups loosely packed baby arugula", "1/2 cup shaved Parmigiano-reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare the beans,</strong> drain and rinse the beans. In a large saucepan, combine the beans with the carrot, celery, onion, and garlic and add enough cold water to cover. Bring to a boil over medium-high heat, then reduce the heat to low and simmer, covered, until the beans are tender, about 45 minutes. Remove and discard the vegetables. Allow the beans to cool in the braising liquid. Drain the beans and reserve both the beans and the braising liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the salsa verde,</strong> combine the parsley, capers, and garlic in a blender or small food processor and pur&eacute;e until smooth. With the motor running, add the olive oil in a slow stream and process until emulsified. Transfer to a bowl and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the white bean pur&eacute;e,</strong> combine 1/2 cup of the beans and 4 teaspoons of the reserved braising liquid in a food processor and pur&eacute;e until smooth. Season with salt and pepper and set aside. (Reserve the rest of the beans and braising liquid.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare the artichoke hearts,</strong> place the stock in a large saucepan. Squeeze the lemon into the stock and drop the lemon into the pot. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To clean the artichokes,</strong> cut off the stems and remove the outer leaves either one at a time or by cutting the leaves only at the base of the leaf with a paring knife, taking care not to cut into the hard heart while exposing the yellow and light green interior leaves. Locate the top of the heart and with a paring knife cut off and discard the top of the choke. Scrape out and discard the fuzzy choke from the heart and immediately place the artichoke hearts in the pot of stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the thyme, carrot, celery, onion, and garlic to the pot with the artichoke hearts. There should be enough stock in the pan to cover the vegetables by 2 inches; add a little more stock or water if necessary. Bring to a boil over medium heat. Reduce the heat to low and simmer gently until the artichoke hearts are tender, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the artichoke hearts to cool in the braising liquid. Remove the artichoke hearts, set aside, and reserve the liquid.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dressing,</strong> place the egg yolk, garlic, lemon juice, and red wine vinegar in a blender and blend well. With the blender on medium speed, slowly drizzle in the oil. It should look like loose mayonnaise. Pour the dressing into a bowl and whisk in the cream, pepper, and Parmigiano-Reggiano. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the artichoke hearts in a medium saucepan with 2 cups of the artichoke braising liquid over medium-low heat. Cook until heated through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the remaining whole white beans in a small saucepan with 1 cup of the bean braising liquid over medium-low heat and cook until heated through.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before plating the dish, dress the arugula with the creamy garlic dressing. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a dollop of white bean pur&eacute;e in the center of each plate. Top with an artichoke heart. Fill each heart with a spoonful of white beans topped with arugula salad and shaved Parmigiano-Reggiano. Drizzle the salsa verde on the plate around the artichoke heart and serve.<br />\r\n</p>"}]}