{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101220-129097-goosecaketop.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["buttercream frosting", "cakes", "Cakespy", "Christmas", "goose", "holiday sweets", "marzipan", "trompe l'oeil"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Christmas Goose Trompe L'oeil Cake", "link": "https://www.seriouseats.com/recipes/2010/12/cakespy-christmas-goose-trompe-loeil-cake-recipe.html", "description": "Paying homage to a classic Christmas dinner, this treat isn't meat&mdash;it's totally sweet! <strong>It's a trompe l'oeil designed to look like a Christmas goose,</strong> made from decadent cake crumbled with frosting and covered with rich marzipan.", "totalTime": "5 hours", "recipeYield": "12", "recipeCategory": ["Cakespy"], "recipeIngredient": ["1 single layer cake, your choice", "8-10 ounces buttercream frosting, your choice", "2 7-ounce tubes marzipan", "Red, yellow, and green or blue food coloring ", "Optional: a batch of cornflake wreath dough or candy salad, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take your cooled cake out of the pan. Crumble it with your fingers until you no longer see any large pieces of cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 6 ounces of buttercream frosting to the crumbled cake. Mix together, using the back of a large metal spoon, until thoroughly combined. If your mixture is not coming together into a malleable, shape-able form, add a bit more frosting, but don't add so much that it is too moist and sticky to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form into a ball and cover with plastic wrap. Refrigerate for several hours in the refrigerator, or put in the freezer for about 20 minutes if time is at a premium. You want the mixture to be firm, but not frozen.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the deep chill, and divide the ball of cake-and-frosting in half. Take one half and set to the side. Divide the other half into half again, so you have three parts altogether: one large, and two smaller. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>From the large piece, pinch off a fist-sized piece of the dough. Divide it in half, and set these pieces off to the side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the largest segment and form it into an oval.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the two halves of the initial piece of dough, form two \"drumsticks\" by making teardrop shapes, and then flattening the teardrop side. Set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the two small pieces of dough taken from the large piece, form two little \"arms\" by rolling the dough into logs and then bending it in the middle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the shaped cake pieces to the refrigerator while you prepare the marzipan to cover them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take your marzipan out. Reserve 1/4 of one of the logs of marzipan, and wrap it in plastic so it doesn't dry out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the rest of the marzipan, add mostly yellow, a touch of red, and a very tiny drop of either blue or green, and mix until you have a rich, burnt sienna type tone. Add more yellow and red as needed, but be very sparing with the blue or green.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the marzipan between two sheets of waxed paper or plastic wrap until you have a thin layer, but not so thin that holes form when you handle it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the \"arm\" and \"body\" sections with marzipan. Using the white reserved bits, form \"bones\" for the drumstick sections, and adhere to the cake dough. Then cover these bits with marzipan. You don't have to worry about fully covering both sides, as one side will be adhered to the body.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put all the pieces together, using sugar and water as \"glue\" if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place your finished \"beast\" on top of a bed of candy salad, artfully arranged cornflake wreath batter. Garnish with red candies or candied cherries.</p>"}]}