{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100819-dt-mustard-chicken-with-fresh-corn-polenta.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "corn", "Dinner Tonight", "mains", "polenta", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Dinner Tonight: Grilled Mustard Chicken with Fresh Corn Polenta", "link": "https://www.seriouseats.com/recipes/2010/08/dinner-tonight-grilled-mustard-chicken-with-fresh-corn-polenta-recipe.html", "description": "The chicken is soaked in mustard, lemon juice, and garlic, which ends up infusing into the meat as it grills (it's key to slip some of the marinade under the skin as well as on top of it). Once cooked, the sharp taste of the mustard is muted, leaving just a trace of its fragrance and a wonderful crust on the chicken.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight"], "recipeIngredient": ["6 green onions, finely chopped", "1/4 cup Dijon mustard", "1 tablespoon fresh lemon juice", "1 large garlic clove, pressed or minced", "6 large bone-in, skin-on chicken thighs", "Olive oil", "5 cups water", "1 cup polenta or cornmeal", "1 1/2 teaspoons kosher salt", "1 teaspoon sugar", "Fresh corn kernels cut from 3 large ears", "1/2 cup mascarpone cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the green onions, mustard, lemon juice, and garlic in a bowl and whisk to blend. Carefully loosen the skin on each chicken thigh, making sure to leave it attached, then slide half the marinade under the skin, dividing equally among pieces. Season both sides of the chicken pieces with salt and pepper, then spread the remaining marinade on top of the skin. Cover and refrigerate; the chicken can be used immediately or allowed to marinate for 6-8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to boil in a large saucepan, then whisk in the polenta in a slow stream to prevent clumping. Once it's all added, add the salt and sugar and reduce heat to low, stirring often as it thickens and the cornmeal becomes creamy, 25-30 minutes. Add the fresh corn kernels and cook an additional 5 minutes until they are soft, then mix in the mascarpone cheese. Season to taste with salt and pepper and keep warm until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, prepare a grill, grill pan, or broiler. Drizzle chicken with olive oil and/or brush the grill rack if using. Grill chicken over moderate heat to prevent burning until cooked through. Serve chicken atop polenta.</p>"}]}