{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100121-super-smokers-wings.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["chicken wings", "Super Bowl appetizers", "Super Bowl wings", "wings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Sweet and Spicy Chicken Wings", "link": "https://www.seriouseats.com/recipes/2010/01/grilling-super-smokers-bbq-barbecue-sweet-and-spicy-chicken-wings-super-bowl-recipe.html", "description": "[Photograph: Joshua Bousel] Ever since I started taking wings to the grill, I've been hooked. Less mess and more flavor than frying, It's becoming my preferred path to perfect wings. Building on this, I tried out a recipe from Super...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Grilled Chicken", "Grilling, Smoking, and Barbecue"], "recipeIngredient": ["2 1/2 tablespoons ground black pepper", "1 tablespoon onion powder", "1 tablespoon chili powder", "1 tablespoon garlic powder", "1 tablespoon seasoned salt", "5 pounds chicken wings, rinsed and dried", "1 cup honey", "1/2 cup hot barbecue sauce (or more to taste; use your favorite and the hottest sauce you can stand)", "3 tablespoons apple juice", "2 small chunks of apple wood", "1 disposable foil pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together the pepper, onion powder, chili powder, garlic powder, and seasoned salt in a small bowl. Place the chicken wings in a large Ziploc bag. Pour in the dry rub and shake to coat the wings well. Marinate for at least 30 minutes (at room temperature) or as long as 24 hours (in the refrigerator).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a chimney 3/4 full of charcoal. When charcoal is fully lit and covered in gray ash, pour coals out and arrange them on either side of the charcoal grate, keeping the middle empty. Add 1 small chunk of apple wood to both piles of charcoal. When the wood is lit and producing smoke, place the wings in the middle of the grill, not over the coals, cover, and cook for 25 minutes. Turn the wings and cook for another 20 to 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the wings are cooking, mix the honey, barbecue sauce, and apple juice together in a small saucepan. Cook over medium heat until warmed through. Place the wings in a disposable foil pan and pour the warm sauce over the wings. Toss to coat evenly. Cover and cook for another 20 to 30 minutes, stirring occasionally, until the glaze is finished the way you like it. Remove from the grill and serve immediately.</p>"}]}