{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100727eggplant%20caviar.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["appetizers", "caviar", "Eat for Eight Bucks", "eggplant"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Eat for Eight Bucks: Eggplant Caviar", "link": "https://www.seriouseats.com/recipes/2010/07/eat-for-eight-bucks-eggplant-caviar-recipe.html", "description": "It was a rich but simple spread that finally convinced me to seek out eggplant instead of merely tolerating it. I put this eggplant caviar out with bread and <a href=\"http://www.seriouseats.com/recipes/2008/03/essentials-alice-waters-stuffed-deviled-eggs-recipe.html\">deviled eggs</a> for guests to nibble with drinks a couple of times before realizing that I could happily skip dinner after the supposed snack. With good bread and a <a href=\"http://www.seriouseats.com/recipes/2008/02/essentials-jacques-pepin-vinaigrette-recipe.html\">thoughtfully dressed</a> green salad, the combination becomes a real meal (and a downright luxurious one, if you ask me).", "totalTime": "", "recipeYield": "", "recipeCategory": ["Eat for Eight Bucks", "Eggplant"], "recipeIngredient": ["1 medium eggplant (about 1 pound)", "Olive oil", "Salt", "Pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Cut the eggplant in half, rub the exposed flesh with a little bit of olive oil, and sprinkle with salt and pepper. Put the eggplant cut-side-down on a rimmed baking sheet and bake until very, very soft, about 45 minutes. A knife should slip easily into the stem end when the eggplant is cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the eggplant is cool enough to handle, spoon the flesh out of the skin and into a bowl. Whip the flesh energetically with a fork to create a rough puree. Stir in a tablespoon of olive oil. Taste for salt and pepper. Add more olive oil to taste. Eggplant caviar is also excellent with a squeeze of lemon juice, a pounded garlic clove, and/or a couple of tablespoons of chopped parsley or cilantro, if you happen to have any of those things around around.</p>"}]}