{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101209%20starer-along-sourdough-bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads", "sourdough"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Bread Baking: Starter-Along Sourdough Bread", "link": "https://www.seriouseats.com/recipes/2010/12/bread-baking-starter-along-how-to-make-sourdough-bread.html", "description": "If you've been following along with the <a href=\"http://www.seriouseats.com/tags/sourdough%20starter-along\">Starter-Along</a> series, you have a starter at 100 percent hydration in a jar, and you've harvested 4 ounces of that starter around <a href=\"http://slice.seriouseats.com/archives/2010/12/sourdough-starter-along-day-9-first-harvest.html\">Day 9</a>. At that point, we added 2 ounces of bread flour and 1 ounce of water and let the mixture sit, covered, at room temperature overnight. We'll call that our <strong>prepared starter.</strong>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["all of the prepared starter ", "8 ounces flour", "4 ounces water", "1 teaspoon salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the prepared starter, flour, and water into the bowl of your stand mixer. (You can also do this by hand&mdash;it doesn't require a lot of kneading.) If you're using a stand mixer, knead with the dough hook until the mixture becomes elastic, just a few minutes, then add the salt and oil and knead until combined. Turn dough out onto your work surface and knead by hand until the mixture is elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You have your choice of baking today or tomorrow. If you want to give this an overnight rest, drizzle the dough with olive oil and put it into a plastic bag. Let it rest in the refrigerator overnight. In the morning, remove from the refrigerator, give it a little massage in the bag, and let it come up to room temperature, about 2 hours, then continue with step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To bake today, form the dough into a ball, drizzle with olive oil, and place it into a bowl to rise until doubled, 2-3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the bowl (or plastic bag) and gently form it into your desired shape. Place it seam-side down on a baking sheet sprinkled with cornmeal. Cover with plastic wrap and let it rise until doubled, 1-2 hours. Meanwhile, preheat the oven to 350 degrees. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the loaf has fully risen, slash the top and bake at 350 degrees until the crust is golden, about 40 minutes. Let it cool completely on a rack before slicing.</p>"}]}