{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/11.29.2010pieleftoverse3.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "cinnamon rolls", "desserts", "holiday baking", "pies", "thanksgiving leftovers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Cinnamon Rolls Stuffed With Thanksgiving Pie Leftovers", "link": "https://www.seriouseats.com/recipes/2010/11/cinnamon-rolls-stuffed-with-pie-thanksgiving-leftovers-recipe.html", "description": "Get double duty out of your leftovers while also building up some endurance for the epic eating season ahead by preparing cinnamon rolls stuffed with Thanksgiving pie leftovers.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cakespy"], "recipeIngredient": ["1 tube jumbo pop-and-bake cinnamon rolls (or homemade version of your choice)", "1-2 slices leftover Thanksgiving pie per 6 cinnamon rolls"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven as directed on your tube of cinnamon rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your pie. Gently cut away the filling from the crust. Put the filling in a small bowl; set to the side. Dice the crust into small pieces, and set in a separate small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a work surface or plate, gently unroll your cinnamon rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon pie filling along the center of each unrolled cinnamon roll. You can put as much filling as you'd like, but keep in mind that the more filling you load on each unrolled cinnamon roll, the harder it will be to re-roll.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Re-roll the cinnamon rolls, and place them in a lightly greased baking tin or pie plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the cut-up pie dough pieces on top of the cinnamon rolls in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for the time specified on the package or the recipe you're using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once golden on the tops and edges, remove from the oven. Pause and reflect if it would be simply too much to add frosting; decide that no, it would not be, and liberally douse your cinnamon rolls with the frosting of your choice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately; these are best enjoyed the same day baked.</p>"}]}