{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100916coffeecakewithespressoglazeandcardamomcrumble.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cakes", "cardamom", "coffee cake", "Cook the Book", "Fresh from the Market", "holiday baking", "Laurent Tourondel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Coffee Cake with Espresso Glaze and Cardamom Crumble", "link": "https://www.seriouseats.com/recipes/2010/09/coffee-cake-with-espresso-glaze-and-cardamom-crumble.html", "description": "Although this <strong>Coffee Cake with Espresso Glaze &amp; Cardamom Crumble</strong> doesn't really have all that much to do with seasonal cooking or local purveyors, it's just too good of a cake not to share. The cake part is perfectly flavored and textured with a moist crumb and slight tang thanks to the sour cream in the batter.  After the cake bakes and cools, it's finished with a coffee glaze that seeps inside, acting as a glue for the cardamom-scented crumble topping.  It's one of those wonderfully deceptive recipes that at first looks like nothing fancier than your run-of-the-mill coffee cake, but one bite and the rich coffee flavors and aromatic cardamom are instantly apparent.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cook the Book", "Desserts"], "recipeIngredient": ["<strong>For the cake:</strong>", "Nonstick cooking spray", "1 cup sugar", "12 tablespoons unsalted butter", "2 large eggs", "2 teaspoons vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1 cup sour cream", "<strong>For the glaze:</strong>", "2 tablespoons brewed coffee", "1 1/2 teaspoons instant espresso powder  ", "3/4 cup confectioners’ sugar", "<strong>For the crumble:</strong>", "1/4 cup plus 1 tablespoon light brown sugar", "2 tablespoons sugar", "4 tablespoons unsalted butter, melted", "1/4 teaspoon ground cardamom", "Pinch of salt", "1/2 cup plus 3 tablespoons all-purpose flour", "1/2 cup roughly chopped toasted pecans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cake:</strong> Preheat the oven to 350˚F.  Spray an 8-inch bundt cake pan with nonstick cooking spray.  Using a stand mixer ﬁtted with the paddle attachment, beat the sugar and butter in the mixer bowl at medium-high speed until light and ﬂuffy, about 5 minutes. Add the eggs, 1 at a time and mixing well between each addition, and then add the vanilla.  </p>\n\n<p>Sift the ﬂour, baking powder, baking soda, and salt into another large bowl.  Add the dry ingredients to the butter mixture in 3 batches and mix until just combined between each addition.  Add the sour cream and mix until completely incorporated.Pour the batter into the bundt pan and bake until a knife inserted near the middle of the cake and comes out clean, about 30 minutes. Let cool on a wire rack for about 15 minutes and then invert the cake onto the rack and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the glaze:</strong> Stir the coffee and espresso powder in a small bowl until the powder has completely dissolved.</p>\n\n<p>Stir in the confectioners’  sugar. If the glaze is too thick, add a splash of regular brewed coffee or water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the crumble:</strong> Preheat the oven to 350˚F. Line a baking sheet with parchment paper. Combine both sugars in a medium bowl.</p>\n\n<p>Add the butter, cardamom, and salt and mix until well combined. Add the ﬂour and mix to form a pebbly consistency.</p>\n\n<p>Stir in the pecans. Scatter the crumble evenly over the lined baking sheet and bake until toasted, about 5 minutes.</p>\n\n<p>Remove from the oven and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Drizzle the glaze over the top of the cake. While the glaze is still wet, press the crumble into the glaze to set for 10 minutes before serving.</p>"}]}