{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100611-sous-vide-burger-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["burger"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Sous Vide Burgers", "link": "https://www.seriouseats.com/recipes/2010/06/sous-vide-burgers-recipe.html", "description": "You might ask, why sous-vide a hamburger? It's one of the simplest foods to make using traditional methods, so does precision cooking really have anything to bring to the table? For larger burgers, of the six- to eight-ounce range, sous-vide precision cooking is a wonderful method of ensuring that your burger comes out with an unparalleled level of juiciness every single time.", "totalTime": "1 hour 10 minutes to 4 1/2 hours", "recipeYield": "Makes four 6-ounce burgers", "recipeCategory": ["Beef", "Burger", "Sandwiches", "Sous Vide", "The Burger Lab"], "recipeIngredient": ["24 to 30 ounces freshly ground beef chuck", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil (if finishing on stovetop)", "4 slices cheese (optional)", "4 soft hamburger buns, lightly toasted", "Toppings, as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a water bath to desired final temperature using a sous-vide cooker, according to the chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide meat into four equal portions and gently shape each one into a patty slightly wider than your buns. Season generously with salt and pepper. Place patties in individual zipper-lock bags. Remove air from zipper-lock bags by closing the bags, leaving the last inch of the top unsealed. Slowly lower into the preheated water bath, sealing the bag completely just before it fully submerges. Cook according to the chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish in a Pan:</strong> Remove the burgers from the bags and place them on a paper towel&ndash;lined plate. Pat dry very carefully on both sides and season with additional salt and pepper. Let the burgers rest at room temperature for 10 minutes to dry their exteriors. Before searing the burgers, have your toasted buns and condiments ready to accept them. Heat the oil in a large cast iron or stainless steel skillet over high heat until lightly smoking. Add the burger patties and cook, without moving, until just browned, about 1 minute. Flip the burger and add a slice of cheese to the top surface (if using). Cook until the second side is browned and the cheese is melted, 45 seconds to 1 minute longer. Transfer the burgers to the prepared buns, top as desired, and serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Grill:</strong> Remove the burgers from the bags and place them on a paper towel&ndash;lined plate. Pat dry very carefully on both sides and season with additional salt and pepper. Let the burgers rest at room temperature for 10 minutes to dry their exteriors. Before searing the burgers, have your toasted buns and condiments ready to accept them. Light one chimney full of charcoal (about 5 quarts of coals). When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Scrape the grill grates clean with a grill scraper, then oil the grates by holding an oil-dipped kitchen towel or paper towels in a set of tongs and rubbing them over the grates 5 to 6 times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the burgers directly over the hot side of the grill and cook until a deep, rich crust has formed, about 45 seconds to 1 minute. Flip burgers and add cheese (if using). Cook until the second side is browned and the cheese has melted, 45 seconds to 1 minute longer. If the fire threatens to flare up as the burgers drip fat into it, suffocate the fire by closing the grill lid until the flames die out. Alternatively, using a long spatula, transfer the burgers to the cooler side of the grill until the flames subside. Do not allow flames to engulf the burgers. Transfer the burgers to the prepared buns, top as desired, and serve immediately.</p>"}]}