{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100922_steakcornsalsa.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["cilantro", "corn", "Dinner Tonight", "jalapenos", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sliced Steak with Roasted Corn Salsa", "link": "https://www.seriouseats.com/recipes/2010/09/sliced-steak-with-roasted-corn-salsa-recipe.html", "description": "This recipe from <em><a href=\"http://www.epicurious.com/recipes/food/views/Sliced-Steak-with-Roasted-Corn-Salsa-1031267\">Gourmet</a></em> is the kind that really only works in summer. When the winter hits and frozen corn and canned tomatoes are your only option, please stay away. But with the harvest pulling in, and ears of corn stacking up at the market, this is a perfect way to celebrate the season. The steak is just there to help bulk things out. The salsa is the best part.", "totalTime": null, "recipeYield": "4 people", "recipeCategory": ["Beef", "Corn", "Dinner Tonight"], "recipeIngredient": ["3 cups fresh corn (about 3 ears)", "4 scallions, white and green parts thinly sliced and separated ", "2 tablespoons (1/4 stick) unsalted butter", "2 medium cloves garlic, minced or grated on microplane grater (about 2 teaspoons)", "1 1/2 teaspoons kosher salt", "1 1/2 teaspoons whole cumin seeds, toasted and groung", "1 teaspoon chili powder", "1/2 teaspoon freshly ground black pepper", "2 tomatoes, stems removed and finely chopped", "1 jalapeño, stemmed and finely chopped", "1 tablespoon canola oil ", "Four 1/2-pound top sirloin steaks (about 1 1/2 inches thick)", "1/4 cup fresh cilantro, chopped", "2 limes "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400°F. Set 12-inch cast-iron skillet over high heat until smoking. Add the corn and cook, stirring often, until the corn is slightly blackened, 8 to 10 minutes. Set corn aside in large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium. Add butter and heat until melted, swirling pan to coat. Add  scallion whites, garlic, 1 teaspoon of salt, 1/2 teaspoon of cumin, 1/2 teaspoon of chili powder, and 1/4 teaspoon pepper. Cook until scallions are very tender, 4 to 5 minutes. Transfer to bowl with corn. Add  tomatoes and jalapeños to bowl and toss to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle remaining salt, cumin, chili powder, and pepper on both sides of each steak. Clean out the cast-iron skillet, and then place it over high heat. Add canola oil and heat until smoking. Add steaks and cook without moving until crust is formed, about 3 minutes. Flip steaks and cook 3 minutes longer. Transfer to oven and continue cooki until instant read thermometer inserted into center or steak registers 130°F. Transfer to plate, tent with aluminum foil, and allow to rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice steaks 1/4 inch thick, top with salsa, and sprinkle with the green scallion and cilantro. Serve immediately with lime wedges.  </p>"}]}