{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101216-cookie-swap-cran-shortbread-610.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cookies", "cranberries", "holiday sweets", "SE Cookie Swap 2010", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Shortbread", "link": "https://www.seriouseats.com/recipes/2010/12/cranberry-shortbread-recipe.html", "description": "Baked at the 2010 Serious Eats Cookie Swap \"My version of Martha's Cranberry Shortbread - my sister in law, Meredith, made these and they are now my favorite holiday cookies aside from my mom's sugar cookies. I added the white...", "totalTime": null, "recipeYield": "Makes about 1 1/2 dozen", "recipeCategory": ["Cookies", "Cranberry", "Desserts"], "recipeIngredient": ["1 cup (2 sticks) unsalted butter, room temperature", "3/4 cup sifted confectioners' sugar", "1 teaspoon pure vanilla extract", "2 cups sifted all-purpose flour", "1/2 teaspoon salt", "1/2 cup finely chopped dried cranberries or cherries", "6 ounces of white baking chocolate bar (should have no veg oil listed in ingredients)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 325&deg;F with a rack in center. Combine room temperature butter, confectioners’ sugar, vanilla, flour, and salt in large mixing bowl. Beat with wooden spoon until combined but not too creamy. Stir in dried cranberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat dough into an 8-inc square baking pan to shape the dough into a large square, then to turn it out onto a cutting board. Make parallel cuts to form long 1-inch wide strips, then cut each of those strips in half crosswise to produce sixteen to eighteen cookies approximately 1- by 4-inches. Transfer to a parchment-lined baking sheet. Bake until just beginning to turn golden on the bottoms, about 20 minutes. Place pan on cooling rack until cool enough to touch, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While cookies are baking cut chocolate into small pieces (1/4 inch or smaller). Fill small sauce pan with 1\" of water and heat till simmering (not boiling). Place chocolate pieces in small stainless steal bowl and place bowl on top of sauce pan with simmering water. Be patient :) and wait till chocolate appears to be just barely melting (looks sticky on edges). Using rubber spatula, gently stir chocolate until it appears melted with bits still in it. Remove bowl from the pan and place it on a paper towel to absorb any water/condensation on bottom of bowl so no water makes its way into chocolate. Continue to stir until chocolate is completely melted. It should appear glossy, not grainy. Pour chocolate into ziplock bag and cut very small piece off corner of the bag and squeeze chocolate onto your cooled cookies.</p>"}]}