{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101019stew.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["chicken", "dried limes", "limu omani", "Spice Hunting", "spices", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Chicken Rag&ugrave; with Limu Omani", "link": "https://www.seriouseats.com/recipes/2010/10/braised-chicken-ragu-stew-limu-omani-dried-limes-recipe.html", "description": "[Photograph: Max Falkowitz] When braised and well, chicken becomes meltingly tender, as delicious in its own right as red meat. And while coq au vin is the classic, there are plenty of other braises out there for the chicken. The...", "totalTime": "4 hours", "recipeYield": "8 to 10", "recipeCategory": ["Braising and Stewing", "Chicken"], "recipeIngredient": ["1 (5-6 lb.) stewing hen cut into 8 pieces, or 3 1/2 pounds mixed chicken legs and thighs", "Kosher salt", "1/2 cup olive oil, divided", "2 medium onions, diced, about 3 cups", "5 medium-sized carrots, diced, about 2 cups", "6 ounces tomato paste", "1 cup dry white wine", "3 cups low-sodium chicken broth", "4 dried limes (limu omani)", "2 teaspoons paprika", "2 sprigs rosemary", "1 teaspoon allspice, ground", "1/2 teaspoon juniper berries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat an oven to 300&deg;F. Cut the chicken into 8 pieces (for detailed instructions, see <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-break-down-a-chicken.html\">here</a>) and remove the skin. Pat them very dry and rub both sides with kosher salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/4 cup of olive oil in a large Dutch oven over high heat until it shimmers. Add 1/3 of chicken chicken pieces and brown thoroughly on all sides, about 8 minutes. Transfer to large plate. Repeat in two more batches with remaining chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 1/4 cup of olive oil to pot and heat until it shimmers. Add onions and carrots with a pinch of salt. As they release liquid, scrape up the browned bits on bottom of pot. Reduce heat to medium and cook until they soften and begin to color. Increase heat to high and add the tomato paste. Stir frequently until its color and aroma deepen, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine, broth, dried limes, paprika, rosemary, allspice, and juniper and stir to combine. Return chicken and nestle the pieces into the broth. Cover with a tight lid and transfer to the oven. Braise three hours (one hour for plain legs and thighs), or until meat easily peels away from the bones. During the braise, check on the pot now and then to see if the broth is boiling. If so, decrease temperature by 25 degrees. When finished, transfer the pot back to the stove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken pieces from the pot and pull the meat off the bones. Leave in chunks or shred to your taste. Return pulled meat to pot and let it cook in the residual heat for 10 minutes. Salt to taste and serve in wide bowls with crusty bread or over noodles.</p>"}]}