{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100625prezobamaburger.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["blue cheese", "Cook the Book", "Spike Mendelsohn", "The Good Stuff Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: The Prez Obama Burger", "link": "https://www.seriouseats.com/recipes/2010/06/prez-obama-burger-good-stuff-eatery-dc-spike-mendelsohn-recipe.html", "description": "The year that <a href=\"http://www.spikethechef.com/\">Spike Mendelsohn</a> opened <a href=\"http://www.goodstuffeatery.com/\">Good Stuff Eatery</a> in D.C. just happened to coincide with a pretty exciting presidential election.  Spike decided to hold his own race to the White House pitting the Obama burger against the McCain burger.  The Obama burger ended up beating out the McCain burger four to one. Politics aside, I'm pretty sure the toppings were the ultimate deciding factors in this burger race.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Bacon", "Burger", "Cheese", "Cook the Book"], "recipeIngredient": ["<strong>For the horseradish mayonnaise:</strong>", "2 cups Homemade Basic Mayonnaise (recipe follows)", "4 ounces prepared horseradish", "1 tablespoon cayenne", "11⁄2 teaspoon freshly ground black pepper", "Sea salt", "<strong>For the red onion marmalade:</strong>", "2 red onions", "1 cup red wine vinegar", "1 cup sugar", "<strong>For the burgers:</strong>", "30 ounces ground sirloin", "6 potato buns, cut in half", "Canola oil", "1 pound applewood smoked bacon", "Sea salt and freshly ground black pepper", "1 pound crumbled blue cheese", "2 large eggs", "4 teaspoons Dijon mustard", "2 teaspoons white wine vinegar", "1 teaspoon sea salt", "2 cups grapeseed oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the Horseradish Mayonnaise, add the basic mayonnaise, horseradish, cayenne, pepper, and salt to taste to a food processor or blender. Puree until smooth. The mayonnaise can be refrigerated in an airtight container for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the Red Onion Marmalade, slice both red onions 1⁄2 inch thick. Add the vinegar and sugar to a pot over medium heat. Bring to a simmer. Once the sugar is completely dissolved, add the onions. Cook, stirring constantly to prevent burning, until the onions are translucent and the liquid is reduced by half, about 5 minutes. Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the patties, roll six 5-ounce sirloin balls and form each ball into a patty. Arrange on a tray, cover, and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the buns and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet over medium-high heat and just add enough oil to cover the entire bottom. Line a plate with paper towels. When the oil begins to smoke, add the bacon and cook until crisp. Remove with a slotted spoon. Drain on the paper towels. Drain the fat from the pan but do not wipe clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium and place the patties into the skillet. Season the patties with salt and pepper and cook for 3 minutes. Flip, and cook on the other side for 1 minute more. Distribute the crumbled blue cheese equally among the patties and continue to cook 2 minutes more for medium-rare doneness. Cover with a lid for the last 30 seconds to melt the cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Homemade Basic Mayonnaise</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 2 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs, mustard, vinegar, and salt to a food processor or blender. Process for 30 seconds in the food processor, or for 10 seconds in the blender. With the motor running, drizzle in the oil slowly at first, then add in a thin, steady stream until all the oil is added and the mixture is smooth. Stop the motor and taste. If the sauce is too thick, thin it with a little hot water. If too thin, process a little longer. The mayonnaise can be refrigerated in an airtight container for up to 1 week.</p>"}]}