{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100427grilledspringonions.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["feta cheese", "grill", "grilling", "spring onions", "The Crisper Whisperer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Grilled Spring Onions", "link": "https://www.seriouseats.com/recipes/2010/04/the-crisper-whisperer-grilled-spring-onions-recipe.html", "description": "From the moment I first tucked into a savory, cheese-covered bowl of French onion soup as a kid, I've been hooked on the idea of <strong>onions as the star of a dish.</strong> Early springtime, when farmers' markets hold more in the way of promise than actual produce, is the perfect time to offer a little more plate space to the onion. These grilled spring onions, <strong>sprinkled with feta cheese and lemon juice,</strong> pair beautifully with grilled meats.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Crisper Whisperer", "Sides", "Vegetarian"], "recipeIngredient": ["2 bunches spring onions", "Olive oil for brushing", "Salt and pepper", "2 ounces feta cheese", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a grill or grill pan to low heat. Trim off and discard just the inedible portion of the root of each onion, making sure to leave enough at the bottom to hold the onion together. Then trim off the dark green tops of the onions and reserve. Slice the bulb and light green portion of each onion in half lengthwise from root to tip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush each onion half and the greens on all sides with olive oil and sprinkle with salt and pepper. Place the onion bulbs on the grill, cut-side down. Grill for about 5 minutes, depending on the size of the onion, until lightly charred on the underside and beginning to soften. Turn and grill 2 to 5 minutes more, until the whole onion is softened and nicely charred. Remove the bulbs to a plate and place the dark greens on the grill. Cook for just a minute or so per side, watching carefully, until nicely charred but not burned. (Alternatively, you can reserve the greens to use raw in another dish.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Plate the onions and sprinkle with a bit of additional salt, a drizzle of lemon juice, and some crumbled feta cheese.</p>"}]}