{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100629meat%20loaf.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "mains", "meat", "meatloaf"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Eat for Eight Bucks: Meatloaf", "link": "https://www.seriouseats.com/recipes/2010/06/eat-for-eight-bucks-meatloaf-recipe.html", "description": "Fast and filling, meatloaf can take its traditional place beside a vegetable and a starch, play second fiddle to any summer vegetable you like, or star in dinner-worthy sandwiches on the second day.", "totalTime": "", "recipeYield": "2 to 3", "recipeCategory": ["Beef", "Eat for Eight Bucks"], "recipeIngredient": ["1/2 pound ground beef", "1/4 pound ground pork", "1/2 teaspoon fennel seeds, toasted and lightly crushed", "1/4 teaspoon dried chile flakes", "1/4 cup plus 2 tablespoons ketchup", "3 teaspoons Worcestershire sauce (optional)", "1 1/2 teaspoons pepper vinegar sauce, such as Tabasco (optional) ", "1 medium yellow onion, finely chopped", "3 garlic cloves, peeled and minced ", "1/4 cup finely chopped flat-leaf parsley (optional)", "1/4 cup fresh bread crumbs", "Coarse salt", "Freshly ground black pepper", "1 large egg, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Put the beef and pork into a large bowl and break them up into chunks the size of golf balls. In a different bowl, whisk the fennel seeds and chile flakes into 1/4 cup ketchup, 2 teaspoons Worcestershire sauce, and 1 teaspoon pepper vinegar sauce. Pour this mixture evenly over the meat. Scatter the onion, garlic, and, if using, parsley over the meat, and then sprinkle the bread crumbs evenly over the top along with a rounded 1/4 teaspoon salt and a few grindings of pepper. Add the egg and use your fingers or two forks to blend the ingredients thoroughly, using as few and as gentle strokes as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the meat mixture on a rimmed baking sheet and pat it into a loaf shape. Bake for 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the meat loaf bakes, whisk the remaining 2 tablespoons ketchup, teaspoon Worcestershire, and 1/2 teaspoon pepper vinegar sauce together in a small bowl. When the meat loaf comes out of the oven, brush it generously with this glaze. Return the loaf to the oven and continue to bake until the glaze stiffens and darkens a bit, about 15 minutes. Let rest for 10 minutes before slicing and serving.</p>"}]}