{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100511MultiGrainBread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "multigrain bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Mega-Multigrain Bread", "link": "https://www.seriouseats.com/recipes/2010/05/bread-baking-mega-multigrain-bread-recipe.html", "description": "After making a few too many plain loaves of bread, I decided to go wild with grains and seeds. <strong>The resulting bread is a symphony of textures,</strong> with a nice crisp crust and bits of interesting things inside. <strong>This is also a very customizable bread.</strong> If you don't have one of the grains or seeds I used, substitute something similar.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup whey (or water)", "2 tablespoons demerara sugar", "2 1/2 teaspoons yeast", "1/2 cup quick cooking oats", "1/4 cup rye flakes", "1/2 cup malted wheat flakes", "1/4 cup red quinoa ", "1/4 cup coarse corn grits (polenta)", "2 cups bread flour, divided", "1/2 cup white whole wheat flour", "1/4 cup sesame seeds", "2 teaspoons salt", "1/2 cup pumpkin seeds", "1 1/2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix whey, sugar, yeast, oats, rye flakes and malted wheat flakes in the bowl of stand mixer, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook quinoa and grits in water to cover by a few inches, until grits are fully cooked and quinoa has softened; the quinoa can be a little snap to it, but should be chewable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the heat, and drain in a fine-mesh strainer to remove most of the water. Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one cup of the bread flour to the mixture in the stand mixer bowl, and knead with dough hook while you're waiting for the quinoa and grits to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the quinoa and grits have cooled to room temperature, add them to the to the mixture in the stand mixer bowl along the remaining cup of bread flour, and all of the rest of the ingredients. Knead until the mixture comes together in a ball and cleans the sides of the bowl. If it refuses to come together and form a ball, add more flour, as needed. It will still be sticky and a bit wet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle olive oil into a clean bowl and move the dough mixture to that bowl. Drizzle more oil as needed, to coat the surface. Cover the bowl with plastic wrap and put it in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 2 hours, punch down the dough, form it into a ball, put it back in the bowl, cover again with plastic wrap, and put it back into the refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove the bread from the refrigerator and let it warm up a bit on the counter, about an hour or so. It will still be cool, but it shouldn't be cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a floured surface, knead the dough a bit and form it into your preferred shape. Put it on a baking sheet sprinkled with cornmeal, cover it with plastic wrap, and set aside until doubled in size, about 45 minutes to an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slash the loaf as desired, and bake at 350 degrees for 50 minutes to an hour, until nicely browned.</p>"}]}