{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100422-dt-sausage-in-the-skillet-with-grapes.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["Dinner Tonight", "grapes", "Italian", "pork", "sausages"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Sausages in the Skillet with Grapes", "link": "https://www.seriouseats.com/recipes/2010/04/dinner-tonight-sausages-in-the-skillet-with-grapes-recipe.html", "description": "Though it's never occurred to me to throw <strong>green grapes in a skillet</strong> until they collapse into tart bursts of sweet and sour, I certainly wasn't against the idea. So when Lidia Bastianich recommended it as part of an Umbrian dish from central Italy, one that complemented the juiciness of <strong>pork sausage,</strong> I jumped on board.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Dinner Tonight", "Grapes", "Italian", "Mains", "Pork"], "recipeIngredient": ["1/4 cup extra virgin olive oil", "8 large garlic cloves, crushed and peeled", "2 1/2 pound sweet Italian sausage, about 8", "1/2 teaspoon crushed chili flakes", "1 1/4 pound seedless green grapes, washed (about 3 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) skillet, heat the olive oil over low heat. Add the garlic cloves and, when they begin to sizzle, add the sausages in one layer. Cover the pan and cook gently, turning the sausages and moving them around the skillet occasionally, as they begin to brown and release some fat. After 10 minutes add the chili flakes and continue cooking for an additional 10 minutes until the sausages are golden all over. Tilt the pan and remove all but a few tablespoons of the fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fish out the garlic cloves and add the grapes to the skillet, stirring to coat them well with the pan juices. Cover and cook until the grapes soften and release their juices, 7-10 minutes, then remove the cover and turn the heat to high. Reduce the pan juices, stirring and turning the sausages and grapes often, until they are glazed and caramelized.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the sausages (cut in half) with the grapes scattered over them and the pan juices drizzled over the top.</p>"}]}