{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100706OliveRosemaryFetaBread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "feta", "olives", "rosemary"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Olive, Rosemary, and Feta Loaf", "link": "https://www.seriouseats.com/recipes/2010/07/baking-olive-rosemary-and-feta-loaf-bread-recipe.html", "description": "I had a tasty slice of an <strong>olive bread</strong> the other day, and my first thought wasn't where to buy that bread but that I should make an olive loaf as soon as possible. Sometimes that's all it takes for me to start working on a new recipe. I liked the olive bread, but I knew that anything I made would be better. <strong>This bread cooks in a Dutch oven starting in a cold oven.</strong> It sounds a little strange, but it works well and there are several advantages to this method &mdash; all of which you can read here, along with the recipe.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Bread Baking", "Olives"], "recipeIngredient": ["1/2 cup liquid from feta at room temperature", "1/2 cup lukewarm water", "2 1/2 teaspoons instant yeast", "1 tablespoon sugar", "1/2 teaspoon dried rosemary, chopped", "2 1/2 cups (13.75 ounces) bread flour (divided)", "1/2 teaspoon salt", "2 tablespoons olive oil", "1/4 cup crumbled feta", "1/2 cup pitted kalamata olives, roughly chopped", "Additional bread flour, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine feta liquid, water, yeast, sugar, rosemary, and 1 cup of the bread flour. Cover and set aside for 15-20 minutes, at which point it should be light and airy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the bread flour and salt, and knead until the dough is smooth and elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the olive oil, feta, and olives and continue kneading until the olive oil is completely incorporated into the dough and the feta and olives are well distributed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle some olive oil into a plastic bag and put the dough into the bag, making sure the dough is coated on all sides. Close the bag and stash it the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After an hour or so, or before you go to bed, take the dough out of the fridge and knead it, still in the bag, to knock the air out of it. Return it to the fridge for its overnight nap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, take the dough out of the fridge and knead it in the bag again, this time giving it a more thorough kneading. Leave it on the counter to warm to room temperature. This can vary, depending on how warm your kitchen is and how cold the fridge was. I left mine out for a little over two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bread from the Dutch oven and let it cool completely on a rack before slicing.</p>"}]}