{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101010cookie.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["baking", "chiles", "chipotle", "chocolate", "cocoa powder", "Cookies", "desserts", "Spice Hunting", "spices"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Double Chocolate Icebox Cookies with Aji and Chipotle", "link": "https://www.seriouseats.com/recipes/2010/10/double-chocolate-icebox-cookies-aji-chipotle-chile-recipe.html", "description": "[Photograph: Andrew M. H. Alexander] These are intense little cookies. They've got two forms of chocolate, two layers of chile, and a fair amount of salt. The acidic natural cocoa in the dough is highlighted by aji panca, a light...", "totalTime": "2 hours", "recipeYield": "70 to 80 cookies", "recipeCategory": ["Chocolate", "Cookies", "Desserts"], "recipeIngredient": ["1 stick (8 tablespoons) butter, softened, plus more for greasing", "2/3 cup sugar", "1 teaspoon kosher salt", "1/4 cup highest-quality natural cocoa powder, such as Valrhona", "2 tablespoons aji panca chile, seeds removed and freshly ground, plus a little more for garnish", "1 small dried chipotle chile, seeds removed and freshly ground", "3/4 cup all-purpose flour, plus more for dusting", "1 large egg", "12-14 ounces dark chocolate (about 60 percent cacao), finely chopped", "Coarse salt, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer, beat the butter, sugar, and salt together till light and fluffy, about 3 minutes. Scrape down the sides with a spatula as needed. Turn down the speed on the mixer to low and add the cocoa and chiles, followed by the flour. Increase the speed when the dough looks crumbly and add the egg. Scrape down the sides again and mix till thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heavily dust a work surface with flour, then turn the dough out. Divide it into two even pieces and roll them into 1-inch diameter logs. You'll need to add flour from your work surface to keep the soft dough from sticking. Wrap each log in plastic wrap and chill in the freezer for one hour, or until stiff but not frozen solid. You can keep the cookies frozen this way for several months, slicing off and baking as needed. For long-term storage, wrap the dough in additional plastic and some aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>15 minutes before you plan to bake them, turn your oven to 350&deg;F and grease two half sheet pans. With a very sharp knife, slice the cookies into 1/8th-inch thin rounds and lay them on the sheet pans, leaving a 1/2-inch space between cookies. Chill in the refrigerator for two minutes before transferring to the oven. Bake 7-8 minutes for chewy cookies, or 11-12 minutes for crispy ones. Transfer to cooling rack and cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put an inch of water in a saucepan and bring it to a bowl with a large glass or ceramic bowl on top. When the water boils, reduce to a simmer and add the chocolate to bowl. Whisk constantly until chocolate is melted, making sure that it stays below 91°F (if it goes above that, <a href=\"http://www.seriouseats.com/2010/03/how-to-temper-chocolate.html\">here's</a> instructions on how to re-temper chocolate).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line your two half sheet pans with parchment and drop cookies into chocolate 4 to 5 at a time. Stir with a fork until evenly coated, then remove them and slide them off your fork with another fork onto the parchment. Scrape down the sides of your bowl with a spatula to use all the chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle cookies with extra ground chile and coarse salt while they're cooling, then set aside to cool completely. Store in a large, airtight container in a cool, dry place.</p>"}]}