{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101208_dt_ricecake.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Korean", "keywords": ["David Chang", "Dinner Tonight", "Korean", "mirin", "onions", "rice cakes", "sesame seeds", "soy sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Dinner Tonight: Roasted Rice Cake", "link": "https://www.seriouseats.com/recipes/2010/12/roasted-rice-cake-recipe.html", "description": "I've been infatuated with Korean cuisine for years now but never really understood rice cakes. They always seemed so mushy, bland, and covered in sweet sauce. But a recent midnight snack at a Korean bar changed everything. <strong>Instead of boiled, these were grilled, so they had that crackly outer layer,</strong> which gave way to a tender and succulent inside. They were also tossed with this fiery red sauce, which forced you to keep a drink close at hand.", "totalTime": "20 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Korean", "Rice"], "recipeIngredient": ["<strong>For the roasted onions:</strong>", "1 teaspoon canola oil ", "1 medium white onion, thinly sliced", "Kosher salt", "<strong>For the Korean Red Dragon Sauce:</strong>", "1/4 cup water", "1/4 cup sugar", "⅓ cup ssamjang (fermented bean and chile sauce)", "1 tablespoon light soy sauce", "½ teaspoon sherry vinegar", "½ teaspoon sesame oil", "<strong>For the roasted rice cakes:</strong>", "¼ cup mirin ", "¼ cup chicken broth ", "2 tablespoons canola oil ", "1 pound rice cake sticks", "1 tablespoon sesame seeds ", "2 scallions, ends trimmed, green parts thinly sliced  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in 12-inch cast-ion skillet over medium-high heat until lightly smoking. Add onions and cook, stirring occasionally until onions begin to brown, about 10 minutes. Season with salt and reduce heat to medium-low. Continue cooking, stirring occasionally until richly caramelized, about 30 minutes longer. Adjust heat as needed to prevent burning. Transfer cooked onions to bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the dragon sauce. Combine water and sugar in medium saucepan and bring to a boil over high heat. Stir constantly until sugar is dissolved then remove from heat. Let cool for one minute, then stir in ssamjang until dissolved. Add soy, sherry vinegar, and sesame oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the rice cakes, pour mirin and broth into a large heavy-bottomed saucepan and bring to a boil over high heat. Reduce to medium-high and cook until lightly thickened, about two minutes. Add red dragon sauce, reduce heat to medium, and cook until glossy and thick, about six minutes. Add roasted onions and stir well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, clean out iron skillet, and return to stove. Add two tablespoons canola oil and heat over medium-high heat until just starting to smoke. Add rice cakes and reduce heat to medium. Cook until light brown on all sides, about 3 minutes per side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss rice cakes with sauce. Garnish with sesame seeds and scallions. </p>"}]}