{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101214-128393-grasshopper-bars.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Baked Explorations", "chocolate", "Cook the Book", "cookie month", "Cookies", "holiday baking", "holiday sweets", "Matt Lewis", "mint", "Renato Poliafito", "Super Bowl desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bake the Book: Grasshopper Bars", "link": "https://www.seriouseats.com/recipes/2010/12/grasshopper-bars-brownies-holiday-baking-recipe.html", "description": "<strong>The grasshopper is a vintage cocktail</strong> made with crème de menthe, crème de cacao, and fresh cream&ndash;it definitely falls into the dessert-in-a-glass category of cocktails. They inspired these <strong>Grasshopper Bars</strong> from <strong><a href=\"http://bakednyc.com/page/about\">Matt Lewis and Renato Poliafito</a></strong>'s <strong><em><a href=\"http://www.amazon.com/Baked-Explorations-American-Desserts-Reinvented/dp/1584798505/serieats-20\">Baked Explorations.</a></em></strong>", "totalTime": "3 hours", "recipeYield": "12 large brownies or 24 small brownies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the brownie base:</strong>", "3/4 cups flour ", "1/2 teaspoon salt", "1 tablespoon dark unsweetened cocoa powder (like Valrhona)", "5 ounces good quality dark chocolate (60 to 72%), coarsely chopped ", "1/2 cup (1 stick) butter, cut into 1 inch cubes", "3/4 cups sugar", "1/4 cup firmly packed light brown sugar", "3 large eggs, at room temperature", "1 teaspoons vanilla extract ", "<strong>For the buttercream:</strong>", "3/4 cups sugar", "2 tablespoons flour", "3/4 cup milk", "2 tablespoons heavy cream ", "1 1/2 sticks (3/4 cup) butter, softened but still cool, cut into small cubes ", "3 tablespoons creme de menthe", "1 teaspoon peppermint extract", "<strong>For the chocolate glaze:</strong>", "6 ounces good-quality dark chocolate (60 to 72%), coarsely chopped", "1 teaspoon light corn syrup", "1/2 cup (1 stick) unsalted butter, softened, cut into cubes  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the brownie base:</strong> Preheat the oven to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter the sides and bottom of a glass or light-colored metal 9-by-13-inch pan. Line the bottom with a sheet of parchment paper, and butter the parchment. In a medium bowl, whisk together the flour, the salt, and cocoa powder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Configure a large size double boiler. Place the chocolate and the butter in the bowl of the double boiler and stir occasionally until the chocolate and butter are completely melted and combined. Turn off the heat, but keep the bowl over the water of the double boiler and add both sugars. Whisk the sugars until completely combined. Remove the bowl from the pan. The mixture should be at room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add three eggs to the chocolate/butter mixture and whisk until just combined. Add the vanilla and stir until combined. Do not overbeat the batter at this stage or your brownies will be cakey. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the flour/cocoa/salt mix over the chocolate. Using a spatula (do not use a whisk) fold the dry ingredients into the wet until there is just a trace amount of the flour/cocoa mix visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan, smooth the top with an offset spatula, and bake for approximately 12 to 15 minutes, rotating halfway through the baking time. The brownies should be just a tad underdone (not too gooey, but ideally, just 1 minute from being cooked through completely). A toothpick inserted into the brownies at an angle should contain a few loose crumbs. Remove the brownies from the oven and let cool completely while you make the creme de menthe filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the buttercream:</strong> In a medium heavy-bottomed saucepan, whisk the sugar and flour together. Add the milk and cream and cook over medium heat, whisking occasionally until mixture comes to a boil and has thickened, 5 to 7 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to the bowl of an electric mixer fitted with the paddle attachment. Beat on high speed until cool. Reduce the speed to low and add the butter and mix until thoroughly incorporated. Increase the speed to medium-high and beat until filling is light and fluffy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the creme de menthe and peppermint extract and mix until combined. If the filling is too soft, chill slightly in the refrigerator and then mix again until it is the proper consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the filling is too firm, place the bowl over a pot of simmering water and re-mix to proper consistency. Spread the filling evenly across the top of the brownie layer and place the pan in the refrigerator, for a minimum of 45 minutes, while you make the chocolate glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the chocolate glaze:</strong> In a large non-reactive metal bowl, combine the chocolate, corn syrup, and butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir vigorously for 1 minute to release excess heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture over the chilled creme de menthe layer and use an offset spatula to spread it into an even layer. Place the pan back in the refrigerator for 1 hour, or until the glaze hardens. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the refrigerator, wait about 15 minutes for the glaze to soften slightly, and cut the bars with a warm knife. Cut into squares and serve immediately. </p>\n\n<p><small><strong>Note:</strong> The bars can be stored in the refrigerated, tightly covered, for up to 4 days.</small></p>"}]}