{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101012chickenlivercrostini.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["appetizers", "Brendan Vaughan", "chicken liver", "Cook the Book", "crostini", "Franny's", "holiday appetizers", "holiday recipes", "Melissa Vaughan", "pâté", "The New Brooklyn Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken Liver Crostini", "link": "https://www.seriouseats.com/recipes/2010/10/chicken-liver-crostini-recipe.html", "description": "Franny's take on modern Italian begins with a great selection of appetizers including incredibly rich <strong>Chicken Liver Crostini.</strong> By adding capers, anchovies, rosemary, and sage to the browned livers the pâté takes on an incredible depth of flavor. And while the pâté could happily be spread on slices of rustic bread, at Franny's they up the ante by adding a smear of mayo and a crisp slice of pancetta.", "totalTime": "", "recipeYield": "1 cup of chicken livers, enough for 8 large crostini", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Cook the Book", "Offal"], "recipeIngredient": ["4 tablespoons extra-virgin olive oil, divided", "1/2 pound chicken livers, cleaned and patted dry", "Coarse salt and freshly ground black pepper", "1/2 cup dry vermouth, divided", "1 medium onion, cut into medium dice (about 1 cup)", "1 garlic clove, thinly sliced ", "3 anchovy fillets", "1 tablespoon chopped fresh sage ", "1/2 teaspoon chopped fresh rosemary", "1 1/2 tablespoons capers, drained", "1 loaf of rustic bread, sliced 3/4 inch thick ", "16 slices pancetta, about 1/16 inch thick", "3 tablespoons prepared mayonnaise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the olive oil in a large sauté pan over medium-high heat. When the oil is hot, but not smoking, season the livers with salt and pepper and cook until brown on all sides, about 5 minutes. Set the livers aside in a bowl and add 1/4 cup of the vermouth to the pan, scraping the bottom to release any browned bits. Reduce the vermouth over medium-high heat until it is slightly syrupy, about 3 minutes, and pour it over the chicken livers. Cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe the sauté pan clean and heat the remaining 2 tablespoons olive oil over medium-low heat. Add the onions and cook until they are soft and begin to caramelize, about 6 minutes. Add the garlic and cook for 1 minute. Add the anchovies and herbs and cook, mashing the anchovies until they melt into the mixture. Remove from the heat, add the capers, and stir to combine. Transfer the mixture to a separate bowl. Add the remaining 1/4 cup vermouth to the pan, scraping the bottom to release any browned bits. Cook for 2 minutes and pour over the onion mixture. Cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chicken livers and onion mixture to a food processor and pulse until the mixture is a rough pur&eacute;e. There should be visible bits of caper, onion, and garlic. (Chicken liver can be refrigerated up to 4 days. Bring to room temperature before spreading on the toasted bread.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;. Arrange the bread slices on a baking sheet and toast for 8 minutes, or until the bread starts to crisp but not brown. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the bread is toasting, cook the pancetta. Working in batches, lay the slices in a single layer in a sauté pan and cook, 1 minute each side, until golden and crispy.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, spread about 1 teaspoon mayonnaise on each slice of bread. Top with 2 tablespoons chicken liver and 2 slices pancetta.</p>"}]}