{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101101throwdowncocktail.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["basil", "Bobby Flay", "Bobby Flay's Throwdown", "cocktail recipes", "Cook the Book", "mint", "pineapple", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: The Throwdown Cocktail", "link": "https://www.seriouseats.com/recipes/2010/11/cook-the-book-the-throwdown-cocktail.html", "description": "On the <strong>Cocktails</strong> episode of <em>Throwdown</em>, Flay found himself pitted against <a href=\"http://www.barmagic.com/about.cfm\">Tobin Ellis</a>, Vegas bartender extraordinaire.  It was one of those challenges where Flay shouldn't have stood a chance but thanks to a consult with cocktail guru <a href=\"http://www.kingcocktail.com/\">Dale Degroff</a>, Flay was able to come up with a rum-based cocktail took the prize.  With sweet chunks of pineapple, herbal notes from basil and mint, a spicy ginger syrup, and rich float of coconut cream, <strong>The Thowndown Cocktail</strong> won the judges over.  I mixed up a pitcher of these <em>Throwdown!</em>-inspired cocktails at home&mdash;it only took one sip to figure out why Flay was the winner of this challenge.  <strong>The mix was sweet and tropical,</strong> but with enough bright and sour notes to keep it from being cloying.", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Cook the Book", "Pineapple", "Rum"], "recipeIngredient": ["2 lime wedges ", "1/4 cup finely diced fresh pineapple ", "6 fresh mint leaves, plus whole sprigs for garnish ", "4 fresh Thai basil leaves, plus whole sprigs for garnish ", "1 tablespoon sugar ", "2 tablespoons Ginger Simple Syrup (recipe follows)", "3 ounces golden rum ", "Ice cubes ", "2 tablespoons cream of coconut, such as Coco Lopez ", "<strong>Ginger Simple Syrup</strong>", "1/2 cup sugar ", "1 (4-inch) piece fresh ginger, peeled and sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Ginger Simple Syrup:</strong> Combine the sugar, 1/2 cup water, and the ginger in a small saucepan. Bring to a boil and cook until the sugar has dissolved, about 2 minutes. Remove from the heat and let cool. Strain out the ginger, cover, and refrigerate until cold, at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cocktails:</strong>  Combine the lime, pineapple, mint leaves, Thai basil leaves, sugar, and simple syrup in a cocktail shaker and muddle well. Add the rum and shake for 10 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill 2 rocks glasses with ice, pour the drink over the ice, and float 1 tablespoon of the cream of coconut over each drink. Garnish with mint and Thai basil sprigs.<br />\r\n</p>"}]}