{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100528radishsalad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["arugula", "Cook the Book", "Ines Ortega", "radishes", "salad greens", "Simone Ortega", "The Book of Tapas", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Radish Salad", "link": "https://www.seriouseats.com/recipes/2010/05/radish-arugula-salad-recipe.html", "description": "Radishes and arugula are two of my go-to salad ingredients&mdash;their shared pepperiness always makes for a bright and biting combination that cuts through any rich, fatty flavors in the rest of the meal.  The trouble is that when you are dealing with flavors as strong as these, <strong>a mustard- or lemon juice-based vinaigrette is sometimes too abrasive</strong> resulting in a palate-killing salad.  The mother-and-daughter Ortega team (Simone and Inés) have solved the problem by creating a dressing that uses <strong>cool and creamy yogurt in place of oil</strong> to dress these spicy components.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Leafy Greens", "No-Cook", "Salads"], "recipeIngredient": ["11 ounces mixed salad greens, such as lettuce, arugula, chicory and radicchio, well-rinsed and patted dry", "½ bunch radishes, thinly sliced ", "<strong>for the dressing:</strong>", "2/3 cup plain yogurt", "1 tablespoon chopped scallions (spring onions)", "1 tablespoon lemon juice", "Salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dressing, beat the yogurt, scallions and lemon juice in a bowl and season with salt and pepper. Cover and chill until required. Mix the salad greens and radishes together in a salad bowl, pour the dressing over it and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong> When washing the mixed greens, do not let them to soak for too long or they will start to lose their nutritional value. Green salad should always be seasoned at the last minute, but radishes should be seasoned when they are sliced. You can give this salad a personal touch by adding various herbs, such as parsley, mint, basil or chives. Cubes of apple are also delicious. A little mustard or some chopped herbs can also be added to the dressing.</small></p>"}]}