{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/2010103ccorncookieslice.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["baking", "Cakespy", "candy", "candy corn", "Cookies", "fall"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cakespy: Candy Corn Kaleidoscope Cookies", "link": "https://www.seriouseats.com/recipes/2010/10/cakespy-candy-corn-cookies-halloween-recipe.html", "description": "It's October, and you know what that means: <strong>it's officially candy corn season</strong>. But if you appreciate the iconic look more than the mellowcreme taste of the stuff, here's a solution: a reconfiguration of the <a href=\"http://www.cakespy.com/blog/2010/7/12/taste-the-rainbow-kaleidoscope-cookies-recipe.html\">Kaleidoscope Cooky</a> (yes, cooky) from the <strong><em><a href=\"http://www.amazon.com/dp/0764566377/?tag=serieats-20\">Betty Crocker's Cooky Book</a></em>,</strong> made to resemble the tricolor confection.", "totalTime": "", "recipeYield": "8 to 10 dozen", "recipeCategory": ["Cakespy", "Halloween"], "recipeIngredient": ["2 cups (4 sticks) butter, at room temperature", "2 cups sifted confectioners' sugar", "2 teaspoons vanilla extract", "4 1/2 cups (22.5 ounces) all-purpose flour", "Yellow and orange food coloring", "1/2 teaspoon table salt", "Coarse sugar sprinkles, for decoration (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix butter, sugar, and vanilla thoroughly in the bowl of a stand mixer fitted with the paddle attachment. In a separate bowl, mix flour and salt. With mixer running on slow speed, slowly add dry mixture to butter mixture, scraping the sides of the bowl down occasionally. Once fully mixed, dough should be soft and lightly sticky, but easy to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the dough into three equal parts. Leave one part white; add 2 drops yellow food coloring to the second part; add 2 drops orange (or 1 drop each red and yellow) to the third part. Incorporate food coloring by mixing on low speed in stand mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form each color of dough into two long logs (six logs altogether). Place on baking sheet and chill in refrigerator uncovered until firmed, 20-30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With your hand, lightly flatten the top of one of the yellow logs. Place an orange log on top of this, and then lightly flatten the top of this log as well. Add a white log on top, gently pressing down to ensure that the dough colors are adhering nicely. Wrap in waxed paper, and smooth down the sides and bottom of the stack so that they form a pyramid/triangle shape.Repeat with your second group of dough logs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let tricolor dough stacks chill in the freezer for several hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400&deg;F. Remove one cookie dough stack from freezer, and slice into 1/4 inch thick slices. If desired, roll the sides of each slice in sprinkles or coarse sugar. Place on an ungreased cookie sheet, leaving a little space around each one (they don't spread too much).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 8 to 10 minutes, or until dull on top and very lightly brown along the bottom. Cooled cookies can be stored in sealed container for up to 3 days.</p>"}]}