{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100409-Spotted%20Pig%20Burger%20-%2008.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bread", "buns", "burger"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.4", "ratingCount": "5"}, "name": "The Spotted Pig's Hamburger Buns", "link": "https://www.seriouseats.com/recipes/2010/04/the-spotted-pigs-hamburger-buns-recipe.html", "description": "Note: These buns are great for any burger, but go best with our recipe for The Spotted Pig's Chargrilled Burger....", "totalTime": null, "recipeYield": "8 four-inch burger buns", "recipeCategory": ["Bread", "Burger"], "recipeIngredient": ["1/2 cup warm whole milk", "3/4 cup warm water", "2 teaspoons active dry yeast", "1 1/2 tablespoons granulated sugar", "3 1/2 cups all-purpose flour", "2 teaspoons salt", "3 large eggs", "4 tablespoons unsalted butter, softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk, water, yeast, and sugar in small bowl or 2-cup glass measure. Let stand 5 minutes until foamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and salt in bowl of stand mixer fitted with dough hook attachment (or whisk together in large bowl if mixing by hand). Add water/milk mixture and mix on medium-low speed until combined. With mixer running, add two eggs, one at a time, waiting for eggs to become fully incorporated between additions. Add butter one tablespoon at a time until fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to mix on medium-low speed for 2-3 minutes. If dough appears too sticky, add flour, 1 tablespoon at a time, until it pulls away from sides of mixer (it will still stick to bottom). Continue kneading until dough is smooth and elastic, 5-6 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover bowl with plastic wrap and let rise until doubled in volume (about 2 hours at room temperature, or 8 hours in the refrigerator). Turn dough out onto lightly floured surface, and using bench scraper or sharp knife, cut into 8 equal pieces approximately 4 ounces each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two baking sheets with parchment paper. Form each dough chunk into a ball and place on baking sheets, four per sheet, about 3 inches apart. Spray with non-stick cooking spray (or brush with oil), cover loosely with plastic wrap, and allow to rise at room temperature until approximately doubled in volume (about two hours).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower-middle and upper-middle positions and preheat oven to 400&deg;F. Gently press dough balls down until approximately 4 inches wide and 2 inches high. Beat remaining egg with one tablespoon water and brush entire exposed surface of bun. Bake for 7 minutes. Remove buns from oven, brush with remaining egg wash, and bake until deep, shiny, golden brown, rotating pans top to bottom and front to back half way through baking, 10-15 minutes longer. Transfer buns to rack and allow to cool completely.</p>"}]}