{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101109%20harvest%20buns.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "rolls", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Harvest Buns", "link": "https://www.seriouseats.com/recipes/2010/11/bread-baking-harvest-buns-homemade-pumpkin-rolls-for-thanksgiving.html", "description": "If you're anything like me, before all the Thanksgiving prep is over, there's some canned pumpkin left over from another recipe, or an extra can in the pantry \"just in case.\" <strong>Why not get creative with some of that pumpkin?</strong> I often add mashed potatoes to my bread recipes when I want them to be fluffy. Pumpkin plays the same role in these buns, but it also add <strong>wonderful color, moisture, and subtle flavor</strong>.", "totalTime": "2 1/2 hours", "recipeYield": "", "recipeCategory": ["Bread Baking", "Pumpkin"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons (1 package) instant yeast", "1 tablespoon honey", "3 1/4 cups (13 5/8 ounces) bread flour", "1/2 cup (8 oz. by volume) canned pumpkin puree", "1 teaspoon salt", "2 tablespoons room temperature butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water, yeast and honey in bowl of stand mixer fitted with dough hook attachment and set aside until foamy, about 10 minutes. Add flour and pumpkin and knead at low speed until dough starts becoming elastic, about 5 minutes. This is a very soft dough and may still be a little bit sticky. Add salt and butter and continue kneading until dough is silky, shiny, and elastic, about 5 minutes longer. Form dough into ball, drizzle with a bit of olive oil, and put back in bowl. Cover bowl with plastic wrap and set aside to rise until doubled, about 50 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position, preheat oven to 350° and sprinkle some cornmeal on baking sheet. Flour work surface and knead dough briefly. Divide dough into 15 pieces. Form each piece into a ball and place onto prepared baking sheet. Cover with plastic wrap and set aside until buns are doubled, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until nicely browned, about 30 minutes. Remove to a wire rack to cool.</p>"}]}