{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101109pumpkinrajas.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["cumin", "rajas", "Spice Hunting", "spices", "squash", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Squash with Rajas, Cumin, and Crema", "link": "https://www.seriouseats.com/recipes/2010/11/roasted-pumpkin-rajas-poblanos-cumin-crema-sour-cream.html", "description": "I love pumpkin and winter squash, but after having it roasted or mashed a few times I start looking for new flavors to branch out. Cumin seeds, both roasted with the squash and tossed in right before serving, bring out...", "totalTime": "1 hour", "recipeYield": "6 as a side", "recipeCategory": ["Christmas", "Pumpkin", "Sides", "Squash", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["4 pounds pumpkin or butternut squash, peeled, cut into 1-inch cubes (8-10 cups)", "2-3 tablespoons neutral-flavored oil", "1 tablespoon cumin seed, divided", "4 poblano chiles", "Kosher salt", "1/3 cup crema"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper-middle and lower-middle positions and heat oven to 425&deg;F. In large bowl, toss squash with oil, half of cumin seeds, and heavy pinch of salt until thoroughly coated. Spread out in single layer on two rimmed baking sheets. Roast until squash gives a paring knife no resistance and is browned on one or two sides, about 35 minutes, flipping and testing for doneness every 15 minutes. Set aside in large mixing bowl, cover and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, roast poblanos on directly over flame of gas stovetop on medium-low heat, or under broiler. Let skin completely blister and blacken (some ash is okay) before turning until chilis are blackened all around. When chiles have softened and their skin is completely black, set aside and cover with plastic wrap for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove plastic wrap and scrape skin off with paring knife. Slice open chilis and remove central core and seeds. If you want milder chilis, scrape off inner membrane. Slice chilis into thin strips and add to squash. (Note: rajas can be made up to several days ahead.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast remaining cumin seeds in small skillet over high heat until just fragrant about 15 seconds, then add to squash and rajas. Toss everything until well combined. Season with salt. Serve immediately, passing crema at table.</p>"}]}