{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Aaron Mattis"}, "recipeCuisine": "", "keywords": ["lemon", "pizza", "ricotta", "roasted tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Tomato, Ricotta, and Lemon Pizza", "link": "https://www.seriouseats.com/recipes/2010/06/roasted-tomato-ricotta-and-lemon-pizza-recipe.html", "description": "...", "totalTime": null, "recipeYield": "Makes 2 fourteen-inch pies", "recipeCategory": ["Bread", "Lemon", "Mains", "Pizza"], "recipeIngredient": ["1/2 recipe <a href=\"http://www.seriouseats.com/recipes/2010/06/sourdough-pizza-crust-dough-recipe.html\">sourdough pizza crust</a>", "4 beefsteak tomatoes", "1 head garlic", "2 or 3 sprigs fresh thyme, stripped from stems", "Kosher salt", "Freshly ground black pepper", "Extra virgin olive oil", "About 10 large basil leaves", "1 cup ricotta, preferably homemade", "2/3 pound fresh mozzarella", "Zest of 1 lemon", "Parmigiano-Reggiano", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from refrigerator and let sit on counter 2 hours prior to baking to relax gluten and bring to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350°F. Core tomatoes and halve from pole to pole. Break up head of garlic into separate, unpeeled cloves. Combine tomatoes, garlic, and thyme in a large bowl. Season with kosher salt and pepper, drizzle generously with olive oil, and toss to coat. Arrange tomato halves cut-side-down a parchment-lined baking tray and distribute garlic and seasonings evenly. Bake for 30 minutes, and then spoon off accumulated juices, reserving for another use. Remove tomato skins and return to oven. Continue to bake, spooning off accumulated juices every 15 minutes, until caramelized and fairly dry, about 1 hour. Thickly slice each tomato half and set aside. Reserve roasted garlic for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven on maximum with a pizza stone for 1 hour prior to cooking, using convection heat if possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each pie, working on a lightly floured counter, carefully stretch out 1 ball of dough as thinly as possible. Transfer dough round to a lightly floured peel. Top with half of the tomatoes, half of the basil, half of the ricotta, and half of the mozzarella, torn into large chunks. Bake on pizza stone until crust is deeply caramelized and cheese is bubbly and lightly browned, about 5 minutes at 550°F. Top with the finely grated zest of half a lemon and finely grated Parmigiano-Reggiano. Sprinkle with coarse sea salt, drizzle lightly with olive oil, slice, and serve.</p>"}]}