{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100427shrimpbog.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Carole Topalian", "Cook the Book", "Edible: A Celebration of Local Foods", "rice", "shrimp", "Tracey Ryder"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Sullivan's Island Shrimp Bog", "link": "https://www.seriouseats.com/recipes/2010/04/cook-the-book-sullivans-island-shrimp-bog-recipe.html", "description": "This <strong>Sullivan's Island Shrimp Bog</strong> from <em><a href=\"http://www.amazon.com/Edible-Celebration-Local-Tracey-Ryder/dp/0470371080/serieats-20\">Edible: A Celebration of Local Foods</a></em> by <a href=\"http://www.traceyryder.com/\">Tracey Ryder</a> and <a href=\"http://www.topalianphoto.com/\">Carole Topalian</a> was one of those recipes that I was drawn to for its name. It conjured up images of marshy Carolina shores, tall grass, and rice paddies. This evocatively titled recipe captures a region where both shrimp and rice are staples and whose diverse culinary influences season the dish with flavors that are both unexpected and entirely satisfying.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Rice", "Shrimp"], "recipeIngredient": ["1 1/2 cups long-grain white rice", "1/2 pound sliced bacon, finely chopped", "2 medium onions, finely chopped", "1 teaspoon kosher salt, plus more if needed", "3/4 teaspoon freshly grated nutmeg", "1/4 teaspoon freshly ground black pepper, plus more if needed", "1/4 teaspoon ground cayenne, plus more if needed", "2 1/4 cups chicken broth, plus more if needed", "1 can (14.5 ounces) diced tomatoes", "2 teaspoons freshly squeezed lemon juice", "1 1/2 teaspoons Worcestershire sauce", "2 pounds medium shrimp (40 count), shelled and deveined", "1/4 cup very finely chopped flat-leaf parsley leaves", "1 lemon, cut into 6 wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a fine-mesh strainer, rinse the rice well under cold running water. Drain well; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heavy Dutch oven or stockpot, cook the bacon over medium heat until golden, about 5 minutes. Using a slotted spoon, transfer the bacon to a paper towel-lined dish; set aside. Pour off and discard all but 3 tablespoons of the bacon fat remaining in the pot. Add the onions to the pot and cook over medium heat, stirring occasionally, for 3 minutes. Add the drained rice, salt, nutmeg, black pepper, and cayenne and stir for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the broth, tomatoes with liquid, lemon juice, and Worcestershire sauce. Bring to a boil, cover the pot, reduce the heat, and simmer gently for 20 minutes. Stir in the cooked bacon and the shrimp and cook uncovered, stirring occasionally, until the shrimp is cooked through, adding more broth if the rice seems to be drying out, about 10 minutes. Stir the bog with a fork. Taste and adjust seasoning as needed. Sprinkle with parsley, garnish with lemon wedges, and serve immediately.</p>"}]}