{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100924allwhitesalad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apples", "Around My French Table", "cabbage", "celery", "Cook the Book", "Dorie Greenspan", "mushrooms", "salads", "vegetarian", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: All-White Salad", "link": "https://www.seriouseats.com/recipes/2010/09/all-white-salad-recipe-dorie-greenspan-around-my-french-table.html", "description": "This <strong>All-White Salad</strong> was created for the café in Paris's Le Bon Marché department store and comes with a predictably fashionable story. Adapted from <a href=\"http://doriegreenspan.com/about.html\">Dorie Greenspan</a>'s <strong><em><a href=\"http://www.amazon.com/Around-My-French-Table-Recipes/dp/0618875530/serieats-20\">Around My French Table</a></em></strong>, this salad was part of a group of salads that Greenspan's friend Hélène Samuel came up with for the café, each composed of ingredients of a single hue.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Apple", "Cabbage", "Cook the Book", "Mushrooms", "Salads", "Vegetarian"], "recipeIngredient": ["<strong>For the salad:</strong>", "6 celery stalks", "3 Granny Smith apples", "Fresh lemon juice", "10 ounces mushrooms (white, of course)", "1 small Napa (Chinese) cabbage ", "&nbsp; ", "<strong>For the yogurt vinaigrette:</strong>", "1 large egg yolk", "Scant 1/2 cup (1/2 cup minus 1 tablespoon) Greek yogurt", "Fleur de sel or other sea salt and freshly ground white pepper ", "3/4 cup olive oil (extra-virgin is nice but not necessary)", "Juice of 1/2 lemon", "Sesame seeds, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the salad:</strong> Trim the celery stalks and peel them with a vegetable peeler to remove the tough, stringy outer layer (or at least the tough strings, which the peeler will catch). At Delicabar, the celery was cut into ribbons. If you want to do this, cut each stalk crosswise in half, then use the peeler to shave thin strips. To curl the ribbons and keep them until serving time, put them in a bowl filled with ice cubes and water and store them in the refrigerator. Alternatively, you can simply cut the celery crosswise into thin slices and toss them into a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel, halve, and core the apples. Cut them into 1/4- to 1/2-inch cubes. Sprinkle and toss the apples with a little lemon juice to keep them from going brown, and add them to the celery. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Depending on how dirty your mushrooms are, brush them to remove any loose dirt or wipe them clean with a damp paper towel. If their feet are fat and spongy, snap them off and discard them (or pop them into the freezer to save for vegetable broth); if not, just trim them and leave them on. In either case, cut the mushrooms into thin slices. Sprinkle and toss the slices with a squirt of lemon juice and add them to the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove any tough outer leaves from the cabbage and quarter the cabbage the long way. Cut away the tough core at the base, then cut the cabbage crosswise into thin (coleslaw-like) slices. Add to the bowl and give everything a good mix. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the vinaigrette:</strong> You can make this dressing, essentially a mayonnaise, in a food processor or blender, or you can do it by hand with a whisk (which is the way I do it, because it’s fast and the cleanup is easy). Put the egg yolk in the processor, blender, or bowl, add 1 tablespoon of the yogurt, season with salt and white pepper, and pulse or whisk to blend. With the processor or blender running, or whisking constantly, add the olive oil drop by drop. When the mixture starts to look like mayonnaise, you can pour in the oil in a steady but gentle stream. When you’ve added about half of the oil, blend or whisk in most of the lemon juice, then return to the oil. Finally, add the remaining 6 tablespoons yogurt. Taste and add more lemon juice, salt, and/or white pepper, if you’d like. (The vinaigrette can be made up to a day ahead and refrigerated; whisk before using.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, drain the celery ribbons, if you made them, pat them dry, and mix them in with the rest of the vegetables in the bowl. Pour over the vinaigrette and give everything a good toss. Transfer to a serving bowl or salad plates and sprinkle over the sesame seeds. </p>"}]}