{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101203-veganmallows-500.jpg", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": ["marshmallows"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Vegan Marshmallows", "link": "https://www.seriouseats.com/recipes/2010/12/vegan-marshmallows-recipe.html", "description": "These marshmallows, a kind of mochi/marshmallow hybrid, are tasty eaten plain, added to hot cocoa, or toasted in the toaster oven with graham crackers and vegan chocolate.", "totalTime": "1 hour setting time", "recipeYield": "Makes 4 dozen one-inch marshmallow squares", "recipeCategory": ["Dairy-Free", "Desserts", "Recipes", "Vegan", "Vegetarian"], "recipeIngredient": ["2 tablespoons mochiko (sweet rice flour), plus more for dusting", "1 1/2 cups water, divided in three equal parts", "2 tablespoons agar agar flakes", "1 ½ cups granulated sugar", "2 tablespoons unflavored soy isolate powder", "¼ teaspoon xanthan gum powder", "¼ teaspoon guar gum powder", "1/8 teaspoon cream of tartar", "pinch table salt", "1 ½ teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare an 8- by 8-inch square baking pan by sifting mochiko onto the bottom of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place ½ cup of the water and agar agar flakes into a small saucepan. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, whisk together sugar and 2 tablespoons mochiko. Add ½ cup of water and whisk to combine. Bring to a boil over medium heat. Reduce heat and cook for another 5 minutes at a gentle boil, stirring occasionally to prevent lumps from forming.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While sugar and mochiko mixture is cooking and thickening, whisk soy isolate powder, xanthan gum, guar gum, cream of tartar, and salt together in the bowl of a stand mixer fitted with a whisk attachment. Stir in ½ cup of water. Begin with speed at low until mixture is well-combined and then increase the speed to high, beat until mixture holds stiff peaks and is almost tripled in volume, scraping bottom and sides of the bowl occasionally, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When sugar syrup is almost ready, bring agar agar mixture and water to a boil over medium-low heat, stirring to ensure agar agar flakes fully dissolve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very gradually, begin to drizzle hot syrup down the sides of stand mixer bowl and continue beating at high speed until shiny meringue-like thick ribbons form, 4-5 minutes. Beat in vanilla extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly drizzle in the hot agar agar liquid and continue beating for another minute or so until slightly thicker but still warm. Spread into prepared pan and sift mochiko over surface. Allow to set uncovered until firm and bouncy to the touch, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut into cubes and dust cut surfaces with mochiko, shaking off excess. Store, refrigerated, in a closed container for up to a week.  </p>"}]}