{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101019EspressoBark610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["chocolate", "coffee", "espresso beans", "holiday baking", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Coffee): Espresso Bean Dark Chocolate Bark", "link": "https://www.seriouseats.com/recipes/2010/10/the-secret-ingredient-coffee-espresso-b.html", "description": "When we were in our senior year in college, my friends and I were given a small room in the basement of the library.  Five of us kept our books and computers there and subsisted on nothing but chocolate-covered espresso beans, to sustain us through the long nights in the bowels of the earth.  I've never forgotten to be thankful for them. There's no sleeping after this coffee-laced chocolate studded with chocolate-covered espresso beans.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Chocolate", "Desserts", "The Secret Ingredient"], "recipeIngredient": ["10 ounces plus 2 ounces dark chocolate", "1/4 teaspoon instant espresso powder", "3/4 cup (one 4.3-ounce package) dark chocolate-covered espresso beans, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 10 ounces of chocolate in double boiler over simmering water, stirring often, until smooth.  Whisk in instant espresso powder.  Pour onto rimmed baking sheet lined with parchment paper to form rough 7-inch by 10-inch rectangle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bowl back on the double boiler, and add remaining 2 ounces chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press chopped espresso beans gently into rectangle of chocolate on parchment.  Pour remaining 2 ounces melted chocolate over top, spreading evenly with silicone spatula.  Allow to sit in fridge to harden for 2 hours.  Break into shards with hands.</p>"}]}