{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100706FireCrackers.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "crackers", "jalapenos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Fire Crackers", "link": "https://www.seriouseats.com/recipes/2010/07/bread-baking-fire-crackers-fourth-of-july-party-snacks.html", "description": "Hot bread might not be the next great thing, but <strong>spicy crackers are pretty darned good.</strong> In this recipe, there's just a hint of jalapeño Pepperspread (a little goes a long way?) so gives the crackers just enough heat so you feel it creeping up on you, but that the spice averse would probably be fine as well. Eat one cracker, and it's not spicy at all, but keep on eating, and you can feel the heat building.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread Baking"], "recipeIngredient": ["1/2 cup water", "1 teaspoon instant yeast", "1 teaspoon sugar", "1 cup bread flour", "1 teaspoon Hotheads Pepperspread", "1/4 teaspoon salt", "1 teaspoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the water, yeast, sugar, flour, and pepperspread in a bowl. Cover and set aside for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt and olive oil, and mix to combine as well as you can in the bowl. The gluten should be developing nicely, so it won't be as cooperative as it was during the initial mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn the dough out. If you wear contact lenses or have sensitive skin, consider wearing disposable food-safe gloves. (Don't ask me how I know this.) Knead briefly, form the dough into a ball, and return it to the bowl. The bowl will probably have some residual oil, but drizzle a little more over the dough to coat it. Cover the bowl and let it rest for about an hour, until doubled in size. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F and line a baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface again, and knead the dough to work out all the air bubbles, then roll the dough out to approximately 12x15 inches. It should be about the thickness of a dime. The edges will probably be thicker, so judge the thickness a little farther from the edge. Try to keep the dough rectangular, but don't stress about it being uneven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the crackers will rise during baking, you want to keep them from becoming little puffy hollow pillows. To keep them from puffing, use a dough docker or a fork to poke holes and/or dimple the dough. I have a rolling pin that I use for this sort of thing, but a fork works fine. If some of the crackers puff, it's not a big deal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can trim the dough to make it perfectly square, but I leave it uneven. Those misshapen pieces make a nice snack for the cook.</p>\r\n\r\n<p>Using a pizza wheel, pastry cutter, or knife, cut the dough into appropriate cracker shapes. I made 1-inch square crackers, but you can make random shapes or rhomboids. If you want to get fancy, you can use cookie cutters.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move the crackers to your parchment-lined sheet. You don't need to break them apart completely; it's fine if groups of them remain stuck together, and they're easier to handle in sections rather than individually. Once they're baked, they'll break apart cleanly at the score marks.</p>\r\n\r\n<p>Bake for 25-45 minutes, until the crackers are very lightly browned and dried all the way through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The crackers will probably bake unevenly, with those at the edges of the baking sheet getting brown faster. You can move them around to get them to bake evenly, or take out the browned ones as they're done baking. The fully-baked crackers will snap apart crisply, while the yet-unfinished ones will bend rather than snap. Also, the fully-cooked ones will feel lighter, since all the water will have cooked out.</p>\r\n\r\n<p>The more often you open the oven to rearrange the crackers, the longer the baking will take, but once they start browning, they can overbrown quickly. So watch them carefully.</p>\r\n\r\n<p>Cool them completely on a rack before you store them. Or just put them in a bowl and leave them out for snacking.</p>"}]}