{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100204quickfriedchicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "fried chicken", "Lucinda Scala Quinn", "Mad Hungry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Quick Fried Chicken", "link": "https://www.seriouseats.com/recipes/2010/02/quick-fried-chicken-recipe.html", "description": "[Photograph: Caroline Russock] If you still don't know what to serve for Sunday's big game, you might want to consider this Quick Fried Chicken from Mad Hungry by Lucinda Scala Quinn. Homemade fried chicken might seem like it falls into...", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Deep Frying", "Fried Chicken"], "recipeIngredient": ["1 quart buttermilk", "2 tablespoons Tabasco or other hot sauce", "One 3- to 3 1/2-pound chicken, cut into 8 pieces and each breast cut in half again (reserve the neck, back, and wing tips for another purpose)", "1 cup all-purpose flour", "1 1/2 teaspoons coarse salt, plus a little more for sprinkling", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon cayenne pepper", "2 cups peanut oil, vegetable oil, bacon fat, or lard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 9 x 13-inch baking dish, stir together the buttermilk and Tabasco. Submerge the chicken parts in the mixture and leave as long as possible, at least 10 minutes (but up to overnight-in the fridge-is even better).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a plastic or paper bag, combine the flour, salt, black pepper, and cayenne.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shake the chicken parts, 2 to 3 pieces at a time, in the flour. Repeat with the remaining chicken. Shake off the excess flour. In a 14-inch skillet (or two smaller skillets), heat 2 inches of oil over high heat until very hot. Test with a tiny bit of chicken skin. If the oil bubbles immediately, it is hot enough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken into the hot oil. Evenly distribute as many pieces as will fit in one layer in the pan, leaving 1/2 inch between pieces, and leave to fry undisturbed for about 15 minutes. Lower the heat as necessary to prevent excessive browning before the meat is cooked properly; the oil should continue to bubble steadily.  Turn the pieces and cook for an additional 15 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove to a rack to drain. Repeat the process to cook all of the chicken. To keep the first batch warm, place on a rimmed baking sheet in a 200&deg;F oven. Sprinkle with salt and serve.</p>"}]}