{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100203-seriouslyasian-fortunecookie1.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "Cookies", "fortune cookies", "Seriously Asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Walnut Fortune Cookies", "link": "https://www.seriouseats.com/recipes/2010/02/walnut-fortune-cookies-recipe-asian-lunar-new-years.html", "description": "...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Chinese", "Cookies", "Lunar New Year"], "recipeIngredient": ["2/3 cup all purpose flour", "3/4 cup walnuts", "1/2 cup unsalted butter, at room temperature", "1/2 cup confectioner's sugar", "Pinch of salt", "1 teaspoon vanilla extract or 1 1/2 teaspoons vanilla paste", "2 large egg whites"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, grind the walnuts with the flour until the mixture resembles a fine cornmeal.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the butter, confectioner's sugar and salt into the bowl of a stand mixer fitted with the paddle attachment.  Beat on medium speed until the butter is pale and fluffy, about 3 minutes.  Turn the speed to low and add the flour and nut mixture.  Then add the egg whites and mix until the dough comes together, taking an additional two minutes or so.  The mixture will be quite soft.  Transfer the mixture to a bowl and cover with plastic wrap. Chill in the refrigerator for at least 1 hour and up to 4 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, preheat the oven to 350 F.  Butter and flour a cookie pan and set aside.  You will also need a circular cookie stencil, about 4 inches in diameter.  To make your own, cut a circle in the middle of a plastic lid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the stencil on the cookie sheet and spread about 2 teaspoons of the cookie dough evenly inside the stencil, using a butter knife to smooth the surface.  Place the rounds of dough at least 1 inch apart on the cookies sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the rims are very dark brown and the top of the cookies are golden brown, about 5 to 6 minutes.  Remove the pan from the oven, and working quickly with gloves if needed, shape the cookies: Using a thin spatula or metal bench press, remove the cookies from the sheet.  Place a slip of paper in the center of a cookie and fold the cookie in half.  Then, picking up the folded cookie, crimp the edges of the cookie downwards over the rim of a glass to form the shape of the cookies.  Place the folded cookie inside a cup so that the cookies will hold their shape as they cool down and become crisp.  Set the cookies on a rack to finish cooling down.  The cookies may be stored for up to one week in an airtight container.  </p>"}]}