{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100316-dt-chicken-with-pancetta-and-sun-dried-tomatoes.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "cornmeal", "Dinner Tonight", "pancetta", "polenta", "sun-dried tomatoes", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken with Pancetta and Sun-Dried Tomatoes", "link": "https://www.seriouseats.com/recipes/2010/03/chicken-with-pancetta-and-sun-dried-tomatoes-recipe.html", "description": "I hardly ever cook with sun-dried tomatoes, mostly because they always seemed like a food fad. I have memories of picking them out of all kinds of things as a kid&mdash;salads, pastas&mdash;and no great fondness to return to them. Yet it was hard to pass up this recipe, where they work perfectly in <strong>a delicious stew of crisp pancetta and soft, caramelized red onions.</strong> They melt into the sauce and balance it with a nice acidity and brightness.", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Bacon", "Chicken", "Dinner Tonight"], "recipeIngredient": ["1 cup cornmeal", "2 ounces pancetta or bacon, cut into 1/4-inch strips", "2 tablespoons olive oil, or as needed", "1 boneless chicken breast or 2 thighs, cut into 1-inch chunks", "1 medium red onion, cut into 1/4 inch slices", "2 tablespoons oil-packed sun-dried tomatoes, cut into narrow strips", "3 small cloves garlic, peeled and minced", "1/3 cup chicken stock", "2 tablespoons fresh chopped basil", "2 tablespoons Nicoise olives (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In saute pan, cook the pancetta or bacon over low heat in a bit of olive oil until the fat begins to render and it is beginning to crisp.  Remove with a slotted spoon, leaving the fat behind.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to medium-high and, if needed, add some olive oil to the pan to cook the chicken (it depends on how much fat the pancetta or bacon rendered).  Cook the chicken pieces until golden all over and just cooked through.  Remove with a slotted spoon to a separate plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onion and cook until golden, about ten minutes, then stir in the pancetta or bacon, the sun-dried tomatoes, and the garlic.  Cook for two minutes, then add the chicken stock and scape up the brown bits in the pan.  Season to taste with salt and pepper. Allow to reduce a little, then stir in the chicken and half the basil to the pan.  Once heated through, spoon the polenta onto plates and top with the chicken. Top with the remaining basil.</p>"}]}