{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101020greensoup.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chard", "Cook the Book", "kale", "recipe newsletter", "rice cooker", "Roger Ebert", "soup", "The Pot and How to Use It", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Green Soup", "link": "https://www.seriouseats.com/recipes/2010/10/green-soup-recipe.html", "description": "[Photograph: Caroline Russock] From time to time we all need a detox&mdash;a healthy, clean meal that is healthful and reinvigorating. Sadly, \"healthful\" isn't always synonymous with \"tasty\" and these good-for-you meals leave you craving something a little more satisfying. This...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Kale", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["1 (8-ounce) bunch chard or spinach ", "1 (8-ounce) bunch kale", "2 tablespoons extra-virgin olive oil, plus more for garnish", "1 large yellow onion, chopped", "1 1/4 teaspoons sea salt, more to taste", "2 garlic cloves, chopped", "3 tablespoons Arborio rice", "3 cups water", "3 cups vegetable broth, homemade or canned", "4 to 5 green onions, sliced", "1/2 cup chopped fresh cilantro", "Pinch of cayenne", "2 tablespoons fresh lemon juice, plus more to taste", "Freshly ground black pepper ", "Crumbled fresh white cheese and homemade croutons, for garnish (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the greens thoroughly, trim off the tough kale stems, and slice the leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now the fun part—browning that onion. The rice cooker has only two settings: insanely high and barely warm. Put the 2 tablespoons olive oil into the Pot, plug in the Pot, and set it on insanely high (Cook); then, add the chopped onion and a big pinch of salt and cover the Pot. Every 5 minutes or so, lift the lid and give the onion a stir, and then cover again until the Pot switches itself to Keep Warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This is where you must dominate the Pot. Kick it back to Cook! I found that it will stay on Cook for about 3 minutes, several times in a row. When it absolutely refuses to go back to Cook (thinks it’s done, silly thing), let it rest on Keep Warm for a few minutes. Then go to Cook again, adding the chopped garlic this time, and keep at it until you have onion that is soft and brown. All this will probably take a total of about 40 minutes. The onion will not be as evenly and gently caramelized as it might be in a pan over a carefully adjusted medium low—but it’ll be good!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice, water, vegetable broth, and a teaspoon of sea salt to the onion and garlic in the Pot. Cover and set on Cook. As soon as the liquid is simmering, which shouldn’t take longer than about 5 minutes, start piling in the prepared greens, the green onions, and the cilantro. It will look like too much—it’s not. Push the greens down gently with a spoon until you can replace the lid. Cook for half an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unplug the Pot, and pur&eacute;e the soup carefully with an immersion blender. Alternately, allow the soup to cool a little and pur&eacute;e it in a normal blender, in batches, then return to the Pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cayenne and the lemon juice, grind in some black pepper, and stir. Now use your taste buds—correct the seasoning to your taste with a drop more lemon juice, another pinch of salt, or even a bit more pepper. Just add the right amount, honey, until you have the balance you like.</p>"}]}