{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100209-seriouslyasian-glutinousrice1.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Korean", "keywords": ["Asian", "desserts", "mochi", "red bean", "rice", "Seriously Asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seriously Asian: How to Make Mochi by Hand", "link": "https://www.seriouseats.com/recipes/2010/02/how-to-make-mochi-red-bean-asian-lunar-new-year-recipe.html", "description": "This Sunday marks the Lunar New Year for the Chinese, Vietnamese, and Korean cultures. While no single dish can represent the diverse practices of each cuisine, rice is a common thread, a symbol of wealth and plenty. This year, I'm...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Japanese", "Korean", "Rice"], "recipeIngredient": ["Glutinous sweet rice", "Potato or rice starch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor or spice grinder, coarsely process the glutinous sweet rice. Soak the rice in a large bowl of water for an hour, then arrange the drained rice on a steamer insert fitted with muslin or cheese cloth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam the rice for 40 to 45 minutes, until the broken grains of rice are translucent. Let rest in the steamer insert for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With wet fingers, transfer the cooked rice to a mortar and pestle. </p>\r\n\r\n<p>Depending on the size of the bowl, you may need to complete this step in batches. Pound the rice in an up-and-down fashion for 10 minutes or so.<br />\r\nAs you continue to pound the rice, have a bowl of warm water ready to add to the bowl if needed. The rice should be somewhat moist, but not wet, as you pound it. By the end of the pounding process, the rice will be one cohesive, sticky mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle potato or rice starch over your work surface. Wet your hands again and transfer the mochi to the surface. Now make sure your hands are completely dry and cleaned of residual sticky rice. Lightly knead the mochi, adding more potato starch as needed, until the mass of rice is no longer extremely sticky to the touch. Divide the mochi into 2-inch balls, rolling each around in a thin layer of starch.</p>\r\n\r\n<p>If you want to fill the mochi, use red bean paste or another filling of your choice. (I like mixing the highest-quality peanut butter and honey.) Flatten the ball of mochi and place a teaspoonful of filling in the center. Gather the ends of the circle together and roll again to form a ball with the enclosed filling. Eat as is, or proceed with toasting. In this form, the mochi can be kept underneath a wet towel for 10 to 12 hours. If you intend to the toast the mochi later, the rounds of rice can be stored for 24 hours.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Heat a heavy skillet or pan. Place each round of mochi onto the pan. You may either leave the mochi in its spherical form or use a spatula to flatten the mochi. Toast the bottoms of the mochi until they are golden brown, taking care not to move or disturb the balls as they cook. If the mochi is prematurely moved, the surface will not have time to harden and the balls will stick to the pan. Continue to toast the mochi on all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat the plain toasted rounds of mochi dipped in soy sauce or sugar. Or, place the balls of mochi in soup for a New Year's dumpling soup, where they will absorb the flavors of the broth. Eat the soup immediately upon serving to fully experience the delicate balance of the crisp, charred surface to the gooey, soft interior. The filled and toasted rounds of mochi may be eaten as they are.</p>"}]}