{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100829BLTquiche.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "eggs", "quiche", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Bacon, Leek, and Tomato Quiche", "link": "https://www.seriouseats.com/recipes/2010/08/sunday-brunch-bacon-leek-and-tomato-quiche-eggs-recipe.html", "description": "If it's somewhat shocking to put an entire package of bacon into a single quiche, it's also, unsurprisingly, over-the-top delicious. I was worried that two eggs wouldn't make enough custard, but I wouldn't change a thing about the filling.", "totalTime": null, "recipeYield": "6-10", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Eggs", "Quiche"], "recipeIngredient": ["3/4 cup (2 1/2 ounces) whole wheat pastry flour", "1/4 cup (1 ounce) plus 1 tablespoon all-purpose flour", "1/4 teaspoon baking powder", "1/8 teaspoon paprika or pimenton", "Pinch of cayenne or a few drops of hot sauce", "6 tablespoons (1 1/2 ounces) freshly grated Parmesan cheese", "Kosher salt", "4 tablespoons (2 ounces) cold unsalted butter", "1 tablespoon cold orange juice (or ice water)", "1 cup plus 2-3 tablespoons cold cream", "12 ounces bacon, fried and crumbled, fat drained and reserved", "8 ounces leek (1 fat or 4 thumb-sized), cleaned and trimmed, white and pale green parts sliced 3/4 inch thick", "12 ounces plum tomatoes, sliced 3/4 inch thick", "2 large eggs", "Freshly ground black pepper", "1 cup grated Swiss or Gouda cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the whole wheat pastry flour and 1/4 cup of the all-purpose flour in a bowl with the baking powder, paprika, cayenne or hot sauce, Parmesan cheese, and 1/4 teaspoon salt. Whisk to combine thoroughly. Slice the cold butter thinly into the dry ingredients and cut it in using your preferred method (fingers, pastry cutter, knives, fork, or mixer) until the mixture is crumbly. Sprinkle the orange juice over it and then stir in 2 to 3 tablespoons of cold cream, a tablespoon at a time. Work until the dough holds together; if you squeeze a handful of it, it should not fall apart. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the dough into a disk 1 inch thick, wrap it in plastic wrap, and refrigerate overnight. (Alternatively, put the freezer for a few hours instead, removing it to the refrigerator about 2 hours before planning to roll it out.) At least 30 minutes before you plan to assemble the quiche and put it in the oven, remove the dough from the refrigerator so that it can warm and soften a bit before rolling. When it is flexible enough, roll it out (I do this between two sheets of parchment) and fit it into a standard ceramic quiche dish or a 9-inch pie pan that is at least 1 1/4 inches deep. Trim any excess and refrigerate the crust until you are ready to fill it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons reserved bacon fat in a skillet and fry the sliced leeks over low heat until they are soft but not mushy, about 10 minutes. Salt very lightly and remove with a slotted spoon. Add 2 more tablespoons bacon fat to the skillet and fry the tomato slices over medium heat for 2 minutes per side. Season with salt to taste. The leeks and tomatoes can be refrigerated until you are ready to fill the crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble and bake, preheat the oven to 425°F. Arrange the leeks and tomatoes in the crust. Whisk together the remaining cup of cream, the eggs, the remaining tablespoon of flour, a generous 1/2 teaspoon salt, 1/4 teaspoon pepper, the Swiss cheese, and the crumbled bacon. Pour this mixture over the leeks and tomatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10 minutes at 425°F. Turn the oven down to 350°F, shield the crust with a piece of aluminum foil, and cook 25 minutes more. When the quiche is done, a knife inserted an inch from its edge should emerge wet but clean. Serve lukewarm, not hot, and keep leftovers in the refrigerator.</p>"}]}