{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100107-dt-alice-waters-chicken-soup.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Alice Waters", "chicken", "Dinner Tonight", "soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Alice Waters' Chicken Noodle Soup", "link": "https://www.seriouseats.com/recipes/2010/01/dinner-tonight-alice-waters-chicken-noodle-soup-recipe.html", "description": "[Photograph: Blake Royer] Sometimes the simplicity of a dish can be bracing. Many of the recipes I've cooked out of Alice Waters' cookbooks, with their emphasis on whole foods, simple technique, and letting the ingredients speak for themselves, just have...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight", "Soups and Stews"], "recipeIngredient": ["1 bone-in, skin-on chicken breast", "1 quart chicken stock", "1 small onion, diced", "1 carrot, diced", "1 stalk celery, diced", "1 small parsnip, diced", "1 sprig parsley", "1/4 pound egg noodles or fettuccine noodles broken up into pieces", "Chopped fresh dill, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, combine the stock and the breast. Bring to a boil, skimming off any foam that rises to the top, then lower to a simmer. Skim any remaining foam, then add half of the onion, carrot, celery, and parsnip, plus the sprig of parsley.  Cook at a gentle simmer for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 30 minutes, remove the chicken carefully to a plate to cool and strain the broth to remove the cooked vegetables. Return the broth to the pot and taste for salt. Start a second pot of boiling water to cook the noodles. When the chicken is cool, separate the meat from the skin and bones and shred it. Place in a small bowl and ladle some hot broth over it to keep it moist.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining onion, carrot, celery, and parsnip to the broth.  Simmer for an additional 15 minutes, until soft. In the meantime, cook the noodles in boiling salted water until tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cooked noodles, chicken and its broth, and taste for seasoning. Ladle the soup into bowls and top with the fresh dill.</p>"}]}