{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100504semolinabraid.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "braided bread", "bread", "bread baking", "semolina"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Semolina Braid", "link": "https://www.seriouseats.com/recipes/2010/05/bread-baking-semolina-braid.html", "description": "Of all the crazy and random additions I've made to bread doughs, <strong>semolina flour is the one that has become a regular component in my breads.</strong> It makes the bread a very pale yellow color and gives it a richer flavor. The first time I used it, it reminded me of a bread my mother used to buy from a local bakery when I was a kid, and that I hadn't tasted since.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 1/4 cups lukewarm water", "2 1/2 teaspoons yeast", "2 teaspoons honey crystals (or sugar)", "1 cup (5 3/4 ounces) semolina flour", "2 cups (9 ounces) bread flour", "1 teaspoon salt", "1 1/2 tablespoons olive oil", "Eggwash (optional)", "Sesame seeds (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the water, yeast, honey crystals or sugar, and semolina flour; let it hang out for 15 minutes to let it get bubbly and foamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bread flour and salt and knead with the dough hook until the dough comes together and starts to become stretchy. Add the olive oil and continue kneading until the dough is smooth, satiny and very stretchy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a ball put it back into the bowl (or a clean bowl, if you prefer) and drizzle it with olive oil, Cover the bowl with plastic wrap and set it aside to rise until the dough has doubled, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle a baking sheet with cornmeal (for this one, I place the dough on the diagonal on the sheet) and preheat the oven to 325 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface knead the dough briefly, then divide into three roughly equal pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form each piece into a rope about 15 inches long, then braid those pieces, tucking the ends underneath and pinching to secure them. Try not to stretch too much as you braid, or it won't fit on a baking sheet and won't have room to grow when it rises and bakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the braid on your prepared baking sheet and adjust it - you can stretch it longer or squish it a bit to make it shorter if you've stretched too much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the dough with plastic wrap and let rise until doubled in size, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 325 degrees for 45 minutes, or until the bread is a nice golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the bread cool completely on a rack before cutting.</p>"}]}