{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201012butterscotchpudding.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Brendan Vaughan", "butterscotch", "Cook the Book", "holiday baking", "Melissa Vaughan", "No. 7", "pears", "pudding", "The New Brooklyn Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Butterscotch Pudding with Sautéed Pears", "link": "https://www.seriouseats.com/recipes/2010/10/butterscotch-pudding-with-sauteed-pears-recipe.html", "description": "This recipe for <strong>Butterscotch Pudding with Sautéed Pears</strong> joins sweetly caramelized pears with a rum-spiked butterscotch pudding.  Cooking the pears down in a combination of olive oil, sugar, and lemon and orange juices renders them sweet with a welcome hit of citrus, perfect for cutting through the rich creaminess of the butterscotch pudding.  At No. 7 in Brooklyn, chef Tyler Kord and pastry chef Amanda Clarke serve their puddings with a dollop of freshly whipped cream and a few crisp shortbread cookies flavored with finely ground Turkish coffee.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Bake the Book", "Cook the Book", "Pear"], "recipeIngredient": ["<strong>For the sautéed pears:</strong>", "1 tablespoon extra-virgin olive oil", "2 firm bartlett pears, peeled and cut into 1/2-inch dice (about 2 1/2 cups)", "1/4 cup sugar", "2 teaspoons freshly squeezed lemon juice", "2 tablespoons freshly squeezed orange juice", "<strong>For the butterscotch pudding:</strong>", "3 large egg yolks", "2 tablespoons cornstarch", "1 tablespoon dark molasses ", "1/2 teaspoon kosher salt", "1 1/2 cups whole milk", "1 cup heavy cream", "1 vanilla bean, split, scraped, seeds discarded", "1/2 cup sugar", "2 teaspoons dark rum", "4 tablespoons (1/2 stick) cold unsalted butter, cut into 4 pieces", "Whipped cream", "Freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pears,</strong> heat the oil in a sauté pan over medium heat. Add the pears and sugar and sauté until the sugar begins to caramelize and the pears begin to soften, 6 or 7 minutes. Add the lemon and orange juices and cook until the liquid is reduced to a glaze, about 7 minutes.  Line a rimmed baking sheet with parchment paper and spread the pears in a single layer to cool. Place a heaping tablespoon of pears in the bottom of 6 individual serving bowls. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pudding,</strong> in a medium bowl, whisk the egg yolks and cornstarch until smooth. Add the molasses and salt and whisk to incorporate. Slowly whisk in 1/2 cup of the milk until the mixture is smooth; set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the heavy cream, the remaining 1 cup milk, and the vanilla bean in a medium saucepan over medium-low heat until the liquid begins to steam. Remove the vanilla bean and keep the mixture warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the sugar evenly over the bottom of a heavy medium saucepan and sprinkle with 2 tablespoons water; place over medium heat and cook, without stirring, until the sugar has caramelized to an amber color, about 15 minutes. Slowly add the cream mixture in a thin<br />\r\nstream. Stir well with a wooden spoon to thoroughly combine. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare an ice bath in a large bowl and place a clean metal bowl atop the ice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the egg yolk–cornstarch mixture, then temper by slowly pouring 1/4 cup of the hot caramel-milk mixture into the eggs, whisking constantly. Whisk in another 1/4 cup of the hot mixture. Pour the egg mixture into the pot with the remaining caramel milk and cook over medium heat, stirring constantly, until the mixture boils, 6 to 8 minutes. Cook for 1 more minute, stirring, until the mixture thickens. Immediately pour the pudding into the bowl over the ice bath. Stir in the rum. When the mixture has cooled slightly, transfer to a food processor or blender. Add the butter, 1 tablespoon at a time, and blend until smooth and emulsified. Pour into serving dishes over the sautéed pears to within 1/4 inch of the top. Wrap tightly with plastic. Chill for at least 4 hours, or up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve,</strong> top the pudding with whipped cream and sprinkle with freshly grated nutmeg. Serve 3 shortbread cookies with each bowl of pudding.</p>"}]}