{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101201UltrathinChocolateChunkCookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2010", "Alice Medrich", "Chewy Gooey Crispy Crunchy Melt-in-Your-Mouth Cookies", "chocolate chip cookies", "chocolate chips", "Cook the Book", "Cookies", "holiday baking", "Super Bowl desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Bake the Book: Ultrathin Chocolate Chunk Cookies", "link": "https://www.seriouseats.com/recipes/2010/12/ultrathin-chocolate-chunk-cookies-recipe.html", "description": "It seems only right to begin <strong>A Cookie a Day 2010</strong> with a chocolate chip cookie recipe, because, well, we love chocolate chip cookies.  These wafer-like <strong>Ultrathin Chocolate Chunk Cookies</strong> from <strong><a href=\"http://www.alicemedrich.com/\">Alice Medrich</a></strong>'s <strong><em><a href=\"http://www.amazon.com/Crispy-Crunchy-Your-Mouth-Cookies-Medrich/dp/1579653979/serieats-20\">Chewy Gooey Crispy Crunchy Melt-in-Your-Mouth Cookies</a></em></strong> fall solidly into crispy and chewy territory.   The chew comes from the addition of rolled oats and the crispness from a dough that spreads super thin (and super fast) during baking.  For me these thin, crisp chocolate chip cookies possessed an almost potato chip element, salty and virtually impossible to stop eating.", "totalTime": null, "recipeYield": "15 cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["1 1/3 cups (6 ounces) unbleached all-purpose flour ", "1/2 teaspoon baking soda", "10 tablespoons (1 1/4 sticks) unsalted butter, melted", "1/2 cup (1.5 ounces) quick rolled oats", "1/2 cup (3.5 ounces) granulated sugar", "1/4 cup (1.75 ounces) packed dark brown sugar", "2 tablespoons plus 1 teaspoon (2 ounces) light corn syrup", "2 tablespoons whole milk", "1/2 teaspoon salt", "7 ounces bittersweet or semisweet chocolate, chopped into chunks, or 1 generous cup chocolate chips or chunks "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Position racks in the upper and lower thirds of the oven.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour and baking soda in a small bowl and mix together thoroughly with a whisk or fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the melted butter, oats, sugars, corn syrup, milk, and salt.  Mix in the flour mixture. If the batter is warm from the butter, let it cool before adding the chocolate. Stir in the chocolate chunks. If possible, let the dough rest for at least several hours at room temperature or (better still) overnight in the fridge. The rest makes for an especially crisp and extra-flavorful cookie!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 15 equal pieces. Lay out 3 sheets of aluminum foil, cut to fit your cookie sheets, on the counter. Arrange 5 pieces of dough (4 in a square and 1 in the center) well apart on each sheet of foil, remembering that the cookies will spread to 5 inches.  Flatten each piece of dough until it is about 3 1/2 inches in diameter.  Slide two of the sheets onto baking sheets.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 20 to 25 minutes, until the cookies are thin and very brown. If they are too pale, they will not be crisp.  Rotate the pans from top to bottom and front to back halfway through the baking time to ensure even baking.  Slide the foil with cookies onto racks to cool completely before removing the cookies from the foil. Repeat with the third batch—you can even slide the next foil and cookie dough onto a hot baking sheet as long as you put the pan in the oven immediately.  Cool the cookies completely before stacking or storing.  May be kept in an airtight container for at least 3 days.</p>"}]}