{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101228-129767-rugelach.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2010", "Cook the Book", "cookie month", "hanukkah desserts", "holiday baking", "holiday sweets", "rugelach", "Sarabeth Levine", "Sarabeth's Bakery"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sarabeth's Rugelach", "link": "https://www.seriouseats.com/recipes/2010/12/cook-the-book-rugelach-cookies.html", "description": "I decided to give <strong>rugelach</strong> another go this year, this time with a recipe from <a href=\"http://goddessofbakedom.com/sb/sarabeth/about-sarabeth.html\">Sarabeth Levine</a>'s <strong><em><a href=\"http://www.amazon.com/Sarabeths-Bakery-My-Hands-Yours/dp/0847834085/serieats-20\">Sarabeth's Bakery</a></em></strong>.  I've had more than my fair share of rugelach from Sarabeth's storefront over the past year and I can honestly say that these were every bit as good as the ones from the bakery.", "totalTime": null, "recipeYield": "3 dozen cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["16 tablespoons (2 sticks) unsalted butter, at room temperature, cut into ½-inch cubes", "8 ounces cream cheese, softened, cut into ½-inch cubes", "2 tablespoons superfine sugar", "½ teaspoon pure vanilla extract", "⅛ teaspoon fine sea salt", "2¼ cups unbleached all-purpose flour", "Approximately ½ cup raspberry or apricot preserves", "Confectioners’ sugar, for serving ", "<strong>For the filling:</strong>", "¼ cup (1 ounce) finely chopped walnuts", "1 tablespoon superfine sugar", "1 tablespoon light brown sugar ", "½ teaspoon Dutch-processed cocoa powder", "½ teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter and cream cheese in the bowl of a heavy-duty stand mixer fitted with the paddle attachment on medium-high speed until evenly combined, stopping the mixer once or twice to scrape down the sides and bottom of the bowl, about 2 minutes. Beat in the superfine sugar, vanilla, and salt. Reduce the speed to low. Add 1¼ cups of the flour and mix just until incorporated, then repeat with the remaining 1 cup of flour. Do not overmix. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough onto a lightly floured work surface. Flour your hands well and gently knead to be sure that the ingredients are evenly distributed, about 10 seconds. Divide the dough into thirds. Shape each portion into a 1-inch-thick disk and wrap each in plastic wrap. Refrigerate until chilled and firm, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, combine the walnuts, superfine sugar, brown sugar, cocoa, and cinnamon in a small bowl; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the center and top third of the oven and preheat to 350°F. Line two half-sheet pans with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with one disk of dough at a time, unwrap and place on a lightly floured work surface. Sprinkle the top of the dough with flour, and roll out into a 13-inch-diameter circle. Using a small offset metal spatula, spread with about 2 tablespoons of the preserves, leaving a 2-inch-diameter space in the center of the dough, and a 1-inch border around the edge. Sprinkle the jam with about 2 tablespoons of the filling mixture. Using a sharp pizza wheel or large knife, cut the dough into quarters, then cut each quarter into 3 wedges, to give a total of 12 wedges. One at a time, starting at the wide end, fold the corners in about ¼ inch and then roll up. Do not roll the rugelach too tightly or the jam and filling will ooze out. Keep the outside of each cookie free of the jam and filling, or they’ll tend to burn. Wipe your fingers clean after making each rugelach, or you will transfer the sticky interior of the last cookie to the exterior of the next one. Place each rugelach on the pans about 1 inch apart, with the point of each facing down. Curve the ends of the rugelach slightly toward the point to make a crescent. Repeat this process with the other two disks of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until lightly browned, about 30 minutes. Cool completely on the pans. </p>"}]}