{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101004strozza.jpg", "author": {"@type": "Person", "name": "Maggie Hoffman"}, "recipeCuisine": "Italian", "keywords": ["Andrew Carmellini", "grapes", "Italian", "pasta", "sage", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Andrew Carmellini's Strozzapreti with Sausage, Grapes, and Red Wine", "link": "https://www.seriouseats.com/recipes/2010/10/carmellini-pasta-strozzapreti-sausage-grapes-red-wine-italian.html", "description": "Pasta and grapes may sound like a strange combination, but the flavors here are delicious together: the savory sausage, sweet grapes, sage, and a touch of vinegar make for a dish that's quite rich and complex. Note: Use small and...", "totalTime": null, "recipeYield": "4 to 6,", "recipeCategory": ["Grapes", "Italian", "Pasta"], "recipeIngredient": ["1 cup seedless red grapes ", "1 cup dry red wine", "1/4 cup sugar", "2 tablespoons red wine vinegar", "3 tablespoons olive oil", "1 1/2 lbs Italian sausage (about 4 links)", "1 medium onion, chopped (about 1 cup)", "10 sage leaves, roughly chopped", "1 lb strozzapreti pasta", "2 tablespoons unsalted butter", "1/2 cup grated pecorino cheese (about 1 ounce), plus more for serving", "1/2 teaspoon coarsely ground black pepper ", "1 tablespoon chopped flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the grapes in half lengthwise. Combine the grapes, wine, sugar, and vinegar and put in a covered container in the fridge overnight (at least 8 hours).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepot, bring the grape mixture to a boil over high heat. Cook at a boil until the liquid has reduced by half, about 10 minutes, then remove from heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the sausage casings open and remove the meat. Discard casings. Put a large pot of water on to boil for the pasta. Heat olive oil in a large pot over medium heat until shimmering. Add the meat and brown, stirring and breaking up the meat as you go, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat has begun to brown, add the onion and continue cooking, stirring well, until sausage is well browned and onions have softened, 5 to 7 minutes. Add the sage leaves and stir to combine. Add the grape mixture and stir well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water comes to a boil, cook the pasta until just al dente (subtract one minute from the directions on the package). Drain but do not rinse, reserving a few tablespoons of pasta water. Add the pasta to the sausage mixture and stir for 1 minute, adding a tablespoon of pasta water at a time to just moisten. Turn the heat off, add butter, cheese, and black pepper, stirring well. Add the parsley and serve immediately, topped with additional cheese. </p>"}]}