{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100806-pastrami-burger-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "pastrami", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "The Pastrami Burger Bomb", "link": "https://www.seriouseats.com/recipes/2010/08/the-pastrami-burger-bomb-recipe.html", "description": "For best results, grind your own beef. A straight chuck grind would work, but the Blue Label Blend is better....", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Beef", "Burger", "Sandwiches", "The Food Lab"], "recipeIngredient": ["20 ounces fresh ground beef, about 20% fat", "1/4 cup mayonnaise", "2 tablespoons ketchup", "2 teaspoons white vinegar", "1 teaspoon sugar", "2 teaspoons sweet pickle relish", "1/2 pound pastrami, sliced very thin", "4 hearty burger buns, toasted", "Kosher salt and freshly ground black pepper", "4 slices swiss cheese", "1 1/2 cups creamy cole slaw"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide beef into four even five ounce portions, gently pressing each into a patty about 4 1/2 inches wide. Cover with plastic and refrigerate until needed. Meanwhile, combine mayonnaise, ketchup, vinegar, sugar, and relish in small bowl. Stir with spoon until smooth. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place as much pastrami as can fit in one layer in a 12-inch non-stick or cast iron skillet or griddle and place over medium high heat. Cook until pastrami is well-browned and crisp on first side, about 3 minutes. Flip and cook until browned on second side, about 45 seconds longer. Transfer to paper towel-lined plate. Repeat with remaining pastrami, placing directly on hot skillet, using as many batches as necessary (you'll probably need about three batches). Set pastrami aside until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return empty skillet to heat (leave the pastrami fat) and add two buns, cut-side down. Toast until golden brown, about 1 minute. Repeat with remaining buns. Set aside</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pan to heat. Season burger patties generously with salt and pepper and add to pan. Cook until well browned on both sides and center of burger reads 130 degrees on an instant-read thermometer for medium rare, about 5 minutes total, flipping and adding cheese halfway through cooking. While burgers are cooking, divide mayonnaise mixture and cole slaw evenly between bottom buns. Top with cooked burgers, crispy pastrami, and bun tops. Serve immediately.</p>"}]}