{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Liz Gutman"}, "recipeCuisine": "", "keywords": ["angel food cake", "baking", "cake", "chocolate", "Serious Chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Angel Food Cake", "link": "https://www.seriouseats.com/recipes/2010/07/chocolate-angel-food-cake.html", "description": "Adapted from Joy of Baking....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["16 large egg whites (2 cups) (480 ml)", "4 tablespoons (30 grams) Dutch-processed cocoa powder", "1/4 cup (60 ml) boiling water", "2 teaspoons pure vanilla extract ", "1 3/4 cups (350 grams) granulated white sugar, divided ", "1 cup (100 grams) sifted cake flour", "1/4 teaspoon salt", "2 teaspoons cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F and place rack in center of oven.  Have ready a 10-inch two piece angel food cake (tube) pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate 16 eggs, whites in one bowl and yolks in another.  Cover whites with plastic wrap and bring to room temperature (about 30 minutes).  Cover yolks and store in refrigerator or freezer for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small measuring cup or bowl combine the cocoa powder and boiling water and stir until smooth.  Stir or whisk in the vanilla extract.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl whisk together  3/4 cup (150 grams) granulated white sugar, the sifted cake flour, and the salt.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, with the whisk attachment, beat the egg whites until foamy.  Add the cream of tartar and continue to beat until soft peaks form.  Gradually beat in the remaining 1 cup granulated white sugar until stiff peaks form.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove 1 cup of the beaten egg whites and whisk it into the cocoa powder mixture to lighten it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To the remaining egg whites, gradually sift the flour mixture over the egg whites (about 1/4 cup at a time) and gently but quickly fold the flour into the egg whites.  You can use a large wire whisk, large rubber spatula or a angel food cake folder for this task.  Once you have incorporated the flour mixture into the egg whites fold in the cocoa powder mixture.  (It is important not to overmix the batter or it will deflate.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the pan (it will be almost full) and run a metal spatula or knife through the batter to get rid of any air pockets.  Smooth the top and bake in the oven for about 40 to 45 minutes.  It is done when a wooden skewer inserted in the center of the cake comes out clean and the cake springs back when gently pressed.  The top of the cake will have cracks.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately upon removing from the oven invert the pan.  Suspend the pan by placing the inner tube on the top of a soda or wine bottle.  Allow the cake to cool for about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When completely cool, run a metal spatula or knife around the sides of the pan to loosen the cake and then remove the cake from the pan.  Next, run a metal spatula or knife along the bottom and center core of the pan and remove.  Place onto a serving plate.</p>"}]}