{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100912broccolini%20salad_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["broccolini", "burrata cheese", "olives", "red wine vinegar", "salads", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Broccolini Salad", "link": "https://www.seriouseats.com/recipes/2010/09/sunday-brunch-broccolini-salad-recipe.html", "description": "When French toast and omelets and sausages don't sound very tempting, a gorgeous salad that offers a variety of interesting tastes, textures, and colors can be a good choice for brunch: not the kind of thing you'd often bother to make on a weekday, but not an immobilizing gut-bomb, either. <strong>Many of you can probably pull this kind of beautiful cold plate together from the odds and ends in your vegetable drawer,</strong> but for people like me who live and die by the recipe and the shopping list, <em><a href=\"http://www.amazon.com/dp/1579653774/?tag=serieats-20\">Ad Hoc at Home</a> </em>offers an inspiring chapter on salads.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Olives", "Salads"], "recipeIngredient": ["<strong>For the salad:</strong>", "2 pounds broccolini, tough ends discarded, stalks peeled", "Kosher salt", "1 tablespoon sherry wine vinegar", "1 tablespoon red wine vinegar", "6 tablespoons extra virgin olive oil", "Freshly ground black pepper", "3 large button mushrooms (about 2 inches in diameter), stems discarded, caps sliced thin", "1/2 small red onion, sliced thin, about 1/4 cup", "1 cup black olives, preferably salt-cured such as Cerignola, pitted", "One (8-ounce) ball burrata cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the broccolini: Add 3 quarts water and 1/4 cup kosher salt to 4 quart saucepan. Bring to a boil. Meanwhile, fill large bowl halfway with water and one tray of ice cubes. Add broccolini to boiling water and blanch until crisp-tender, 3 to 4 minutes. Transfer broccolini to ice bath using tongs or wire mesh spider. Chill until completely cold, about 5 minutes. Transfer to colander to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While broccolini is chilling, combine sherry vinegar and red wine vinegar in medium bowl. Whisking constantly, slowly drizzle in olive oil. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss broccolini with half of vinaigrette in large bowl and season to taste with salt and pepper. Toss the mushroom slices in a small bowl with 2 tablespoons vinaigrette and season with salt and pepper. Select 20 of the most attractive onion slices. Arrange broccolini on platter or on individual plates. Top with mushrooms, olives, and selected onion slices. Tear burrata into 6 pieces and place on top of salad. Serve immediately.</p>"}]}