{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100126.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["cabbage", "Eat for Eight Bucks", "potatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Eat for Eight Bucks: Creamy Cabbage and Potatoes", "link": "https://www.seriouseats.com/recipes/2010/01/eat-for-eight-bucks-creamy-cabbage-and-potatoes-recipe.html", "description": "[Photograph: Robin Bellinger] Shopping List 1 onion: $0.50 1 pound cabbage: $1.99 2 pounds potatoes: $2.00 1 head lettuce: $1.99 Pantry items: Olive oil, butter, salt, pepper, apple cider vinegar, flour, milk, salad dressing Total cost (for 4 portions): $6.48...", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cabbage", "Eat for Eight Bucks", "Mains", "Potato", "Vegetarian"], "recipeIngredient": ["Olive oil", "3 tablespoons butter, divided", "1 largish onion, halved and sliced", "1 pound green cabbage, cored and sliced thinly", "Salt", "Pepper", "1 tablespoon apple cider vinegar", "2 pounds potatoes, baked", "1 1/2 tablespoons flour", "1 cup milk", "Whole nutmeg for grating (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Heat a glug of olive oil in a pot (large enough to hold the cabbage) over medium heat. Add 2 tablespoons butter, and when its foam subsides, add the onion slices. Toss to coat with fat and cook, stirring occasionally, until the onions are soft and just beginning to color, about 10 minutes. Stir in 1 teaspoon salt and 1/4 teaspoon pepper and then toss in the cabbage. Continue to stir until the cabbage and onions are completely mixed and the cabbage is beginning to wilt. Pour in the vinegar and a tablespoon of water, cover the pot, and turn the heat to low. Cook for about 10 minutes, stirring once or twice, until the cabbage is tender enough to eat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the potatoes and mash them roughly with a fork or your fingers. Melt the remaining tablespoon butter in a 10- or 12-inch skillet over. Add the flour all at once, turn the heat to medium low, and cook, stirring constantly, for about 2 minutes. Stir in the milk, raise the heat a bit, and cook until the mixture thickens, a few minutes. Stir frequently to break up lumps and prevent the mixture from sticking to the skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat off under the skillet and stir the potatoes into the sauce. Season with a few gratings of nutmeg, if you like, and then stir in the cabbage and onions. When the contents of the skillet are thoroughly mixed up, smooth the top with your spoon and bake for 15 to 20 minutes.</p>"}]}