{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/sliced%203.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "peanut butter", "whole grains"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Peanut Butter Bread with White Whole Wheat", "link": "https://www.seriouseats.com/recipes/2010/06/bread-baking-peanut-butter-bread-with-white-whole-wheat-flour-recipe.html", "description": "I've made <strong>peanut butter bread</strong> a number of different ways, but I didn't think about adding <strong>whole wheat flour</strong> to the recipe until recently. White whole wheat is the perfect ingredient, adding its own subtle nuttiness to the taste, and more texture as well. <strong>If you're trying to add more whole grains to your diet, this is a pretty unobtrusive way to get them in.</strong> Everyone will notice the peanut flavor and no one will notice the grains.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Bread Baking", "Nuts"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons yeast", "1 tablespoon brown sugar", "1 cup (4 1/2 ounces) white whole wheat flour ", "1 cup (4 1/2 ounces) bread flour", "1 teaspoon salt", "1/2 cup creamy peanut butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the water, sugar, and yeast, and set aside until it's foamy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the flours, salt, and peanut butter into the bowl of your food processor fitted with the dough blade (or whatever is recommended by the manufacturer). Pulse the processor a few times to distribute the salt and incorporate the peanut butter into the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some cornmeal on the bottom of an 8 1/2-by-4 1/2-inch loaf pan, and/or spray it with baking spray for added insurance.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the yeast mixture is foamy, stir it again. Then, with the food processor running, pour the yeast mixture into the food processor as fast as the dough will absorb it. Continue processing until the dough forms a ball and cleans the sides of the food processor bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Check the dough for texture and temperature. It should be smooth and elastic. If the dough is getting warm, let it rest a bit before you continue processing, as needed, until the dough is elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a clean bowl. There's no need to oil the bowl - there's enough oil in the peanut butter to keep it from sticking too much. Cover the bowl with plastic wrap and set it aside until it has doubled, about 40 minutes, depending on how warm your dough was after processing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch the dough down and reshape it into a ball and put it back into the bowl. Cover the bowl with plastic and let it rise until doubled again, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, take it out of the bowl and form it into a log that will fit in the pan. (You can also make a free-form loaf, if you prefer.) Cover the pan with plastic wrap and set it aside to rise until doubled, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has fully risen it should be just a bit above the top of the pan, and if you press it with a fingertip, the indent will remain instead of springing back. Slash the dough as desired, and bake for 45 minutes at 325°F, until the loaf is brown and sounds hollow when tapped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the loaf from the pan and allow to cool on a rack before slicing.</p>"}]}