{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100211easyasiannoodleshelenchen.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Chinese New Year", "Easy Asian Noodles", "Helen Chen", "noodles", "stir frying"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Five Shreds Longevity Noodles for the New Year from 'Easy Asian Noodles'", "link": "https://www.seriouseats.com/recipes/2010/02/five-shreds-longevity-noodles-recipe.html", "description": "five-shrea", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Mains", "Pasta", "Stir Frying"], "recipeIngredient": ["12 ounces Chinese wheat or egg noodles, or vermicelli or thin spaghetti", "6 medium dried black mushrooms", "2 teaspoons cornstarch", "2 teaspoons Chinese rice wine or dry sherry", "1/2 cup lean pork, shredded (about 1 cup)", "4 tablespoons oyster sauce", "3 tablespoons light soy sauce", "2 teaspoons sugar", "5 tablespoons canola oil", "3 slices unpeeled fresh ginger", "2 teaspoons minced garlic", "1 medium red bell pepper, cored and shredded", "2 cups bean sprouts", "4 ounces snow peas, ends snapped off, strings removed and shredded on the diagonal", "5 scallions, bulbs split and cut into 1-inch lengths", "2 teaspoons sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot of boiling water, cook the noodles until a little softer than al dente, about 3 minutes. This should take no more than 2 minutes if the noodles are the pre-cooked variety. Drain, rinse in cold water, drain again, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the mushrooms in hot water for 15 minutes to soften. Drain and squeeze dry, reserving 1/4 cup of soaking liquid. With scissors, trim off and discard the woody stems and shred the caps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small mixing bowl, whisk the cornstarch and wine together and add the pork. In another bowl, combine the oyster sauce, soy sauce, and mushroom soaking liquid. Stir until the sugar is dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wok, heat 3 tablespoons of the canola oil over high heat. Swirl the oil around the pan and when the oil is hot, but not smoking, toss in the ginger and garlic, and stir them around the pan for a few seconds until fragrant. Stir up the pork again and add it to the pan. Cook, stirring constantly, until the meat separates and is partially cooked, about 1 minute.  Add the mushrooms and pepper and cook, stirring, for about 30 seconds. Add the bean sprouts and snow peas and cook, stirring constantly, until the snow peas turn a darker green, about another minute. Remove and discard the ginger, if desired. Transfer to a flat platter.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pan, heat the remaining 2 tablespoons of canola oil.  Add the noodles and toss for about 1 minute, or until heated through. Pour the oyster sauce mixture over the noodles, return the vegetables and meat to the pan and cook, stirring, until the sauce is evenly absorbed into the noodles. Sprinkle with scallions and sesame oil and toss well. Transfer to a platter and serve immediately.  </p>"}]}