{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100725yeasted%20cake_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["cakes", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Yeasted Sugar Cake", "link": "https://www.seriouseats.com/recipes/2010/07/sunday-brunch-yeasted-sugar-cake-recipe.html", "description": "This cake is plain enough to be cut into cubes and included in a basket of bread and muffins, but with plenty fresh fruit it could be the centerpiece of a meal. If you make it a day in advance, warm it in the oven before serving.", "totalTime": "", "recipeYield": "one 9-inch cake", "recipeCategory": ["Breakfast and Brunch"], "recipeIngredient": ["2 1/4 teaspoons (1 envelope) active dry yeast", "1/4 cup sugar", "2 cups flour", "1/2 teaspoon salt", "1/2 cup warm milk", "2 eggs, at room temperature", "6 tablespoons butter, at room temperature", "1/4 cup light brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the yeast and 1 teaspon of the sugar into 1/4 cup warm water in a small bowl and let stand until foamy, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, whisk together the flour, remaining sugar, and salt. Add the yeast mixture, milk, and eggs and beat until smooth; I just used a wooden spoon. Add 4 tablespoons of the butter and beat vigorously until the batter is silky. Scrape down the sides, cover, and let rise until doubled, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly butter a 9-inch cake pan. Stir down the dough, scrape it into the pan, and pat it into a disk of uniform thickness. If possible, soften the remaining two tablespoons butter even more in a microwave or by letting them sit atop a hot stove for a minute. Rub this softened butter all over the dough and then sprinkle with the brown sugar. (My butter was not soft enough to rub, so I pinched it into small lumps and dotted the dough with butter before sprinkling with sugar.) Leave the dough to rise 30 minutes more and preheat the oven to 400.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cake until well risen and the sugar has begun to melt and brown, about 25 minutes. The surface should be covered with cracks. (I was using an 8-inch cake pan and it was still a little underbaked at 30 minutes, despite a very brown and crackly top.) Let cool briefly. Unmold and serve warm. (Cake can also be split and reheated in a 400 degree oven for 5 minutes or so.)</p>"}]}