{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100923-dt-panang-beef.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Thai", "keywords": ["beef", "curry", "Dinner Tonight", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Panang Beef Curry", "link": "https://www.seriouseats.com/recipes/2010/09/dinner-tonight-panang-beef-curry-recipe.html", "description": "Unlike Indian curries, which rely on dried spices toasted in oil or clarified butter for flavor, curries from Thailand use wet pastes simmered in coconut milk. <strong>Panang</strong> is an orange-red Thai curry paste. It's milder than most other Thai curries, but its flavors are more similar to Thai red curry paste (which is spicier than the yellow and green varieties).", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Beef", "Condiments and Sauces", "Dinner Tonight", "Thai"], "recipeIngredient": ["1 pound beef steak, such as sirloin, cut into 1/2-inch strips (about 2 cups)", "1 large red bell pepper, cut into 1-inch dice (about 1 cup)", "1 (15-ounce) can coconut milk", " 2 tablespoons Panang or other Thai red curry paste", " 1-2 tablespoons fish sauce, to taste", " 2 tablespoons palm sugar (or substitute brown sugar)", "2 tablespoons roasted peanuts, lightly crushed", "3-4 fresh kaffir lime leaves, slivered (substitute basil leaves if unavailable for a different flavor)", "1 fresh Thai or other red chile pepper, seeded and slivered (optional)", "Cooked jasmine rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside about 3 tablespoons coconut milk.  Heat the rest in a medium saucepan or wok until small pools of oil appear on the surface. Add the curry paste and stir well to incorporate. Cook until aromatic, 4-5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the beef and simmer until nearly cooked through, about 2 minutes. Add  bell pepper, fish sauce, and sugar. Let simmer for a few minutes, then taste, adding fish sauce or sugar as needed. Add kaffir lime (if using basil, do not add until step 3) and simmer until aromatic, 1 to 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and top with peanuts, chile pepper, and fresh basil leaves if using.  Spoon the reserved coconut milk over top and serve with rice.</p>"}]}