{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100506-dt-braised-chicken-with-leeks.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Braised Chicken with Leeks and Cream", "link": "https://www.seriouseats.com/recipes/2010/05/dinner-tonight-braised-chicken-with-leeks-and-cream-recipe.html", "description": "<strong>Chicken</strong> can braise in under an hour, and the thighs and legs are a perfect candidate for the job: They don't dry out like the breast, and they absorb tons of flavor from the cooking liquid. To keep things light, I used <strong>leeks and white wine</strong> as the base of the sauce, finishing with just a bit of cream. The key is a very good sear at the beginning to build flavor.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Braising and Stewing", "Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["2 chicken legs and thighs, skin-on and bone-in", "Salt and pepper", "1 tablespoon neutral oil, such as canola", "1 large leek, dark green part cut off, cut into thin strips", "2 cloves garlic", "1/4 cup white wine", "1 1/2 cups chicken stock or water", "2 tablespoons cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300&deg;F. Salt and pepper the chicken pieces on both sides and pat dry. In a large, heavy, oven-proof skillet with a cover, heat the oil over high heat. When it is shimmering hot, add the chicken pieces skin-side down and cook undisturbed until the skin is crisp and golden, at least 3 minutes. Turn over and brown the other side well, another few minutes. Remove the chicken pieces to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the leeks and garlic to the skillet and cook over medium heat until starting to soften, then add the wine. Deglaze the pan, scraping up any brown pan bits, until the wine is reduced to just a couple tablespoons. Add the chicken stock and nestle the chicken pieces skin-side up back in the skillet, adding water if necessary so that they are half submerged.  Cover and slide into the oven. Cook until the chicken is fork tender, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skillet from the oven and transfer the chicken pieces to a serving platter or plates. Bring the sauce to a simmer and taste. If desired, reduce it to concentrate the flavors and thicken. Add the cream, stirring to combine, then season to taste with salt and pepper and serve with the chicken.</p>"}]}