{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100712chicago%20dog.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "buns", "hot dog buns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Chicago-Style Hot Dog Buns", "link": "https://www.seriouseats.com/recipes/2010/07/bread-baking-chicago-style-hot-dog-buns-recipe.html", "description": "When I moved away from Chicago, I thought that the lack of poppy seed hot dog buns in my new hometown was something I could remedy by looking harder when shopping. <strong>It took awhile for me to figure out that poppy seed buns aren't popular outside Chicago.</strong> Everywhere I asked about them, I got quizzical looks, but no buns. Some hot dog vendors elsewhere sell Chicago-style dogs with poppy seed buns, but grocery stores don't sell them at all. Ever. <strong>Of course, my answer is to make my own.</strong>", "totalTime": null, "recipeYield": null, "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons instant yeast", "1 tablespoon sugar", "1/4 cup instant mashed potato", "1 teaspoon salt", "2 cups bread flour", "1/4 cup semolina flour", "1 tablespoon olive oil", "Poppy seeds", "Egg wash or Quick Shine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the water, yeast, sugar, and instant potatoes in the bowl of your stand mixer. Let stand for about 15 minutes until it is bubbly and frothy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt, bread flour, and semolina, and knead until the dough is smooth and is becoming elastic. Cover the bowl and let the dough rest for 20 minutes, then add the oil and knead until it is fully incorporated and the dough is shiny and elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl and let the dough rise until doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and sprinkle some cornmeal on a sheet pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface, and knead the dough briefly, then divide it into 8 equal pieces. Form each piece into a log 5-6 inches long, depending on how big your hot dogs are. Keep in mind that the buns will expand in length as they rise and bake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want poppy seeds or other toppings, brush the buns with an egg wash (one egg beaten with a tablespoon of water) or spray with Quick Shine to help the seeds adhere. You can also spray or brush the tops with water to make them sticky, but I find that I lose a lot more seeds that way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 350 degrees for 40-45 minutes, until the rolls are golden brown.</p>"}]}