{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100903uzbeckbeercanchicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beer", "chicken", "Cook the Book", "Planet Barbecue", "Steven Raichlen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Uzbek Beer Can Chicken", "link": "https://www.seriouseats.com/recipes/2010/09/uzbek-tandoori-chicken-recipe.html", "description": "The recipe begins by grinding a warm spice rub of <strong>ginger, paprika, coriander, turmeric, and cumin,</strong> then rubbing it into the chicken and letting it sit and soak for a few hours.  Even before the chicken is grilled, it takes on a lovely burnished tone.  After the spice rub has had enough time to work its way into the flesh, it's time to crack open a beer! Taking a few sips is part of the recipe.", "totalTime": null, "recipeYield": "2 to 4", "recipeCategory": ["Chicken", "Cook the Book", "Grilling"], "recipeIngredient": ["1 whole chicken (3 1/2  to 4 pounds)", "3 cloves garlic, coarsely chopped", "1 piece (1 inch) fresh ginger, peeled and coarsely chopped", "2 teaspoons coarse salt (kosher or sea)", "2 teaspoons sweet paprika", "2 teaspoons ground turmeric  ", "2 teaspoons ground coriander", "1 teaspoon ground cumin  ", "1 teaspoon freshly ground black pepper", "1/4 cup vegetable oil", "1 can (12 ounces) club soda or beer (optional)", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and discard the fat just inside the neck and body cavities of the chicken. Remove the package of giblets and set it aside for another use. Rinse the chicken, inside and out, under cold running water, then drain and blot it dry, inside and out, with paper towels. Remove the skin from the chicken, if desired. You can pull most of it off with your fingers; use a paring knife to cut the skin away from the wings and ends of the drumsticks. Make two deep slashes to the bone in both sides of the chicken breast and in each leg and thigh so that the spices and heat will penetrate the meat more easily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the garlic, ginger, salt, paprika, turmeric, coriander, cumin, and pepper in a mortar and pound them to a smooth paste with a pestle, then work in the oil. If you don’t have a mortar and pestle, you can make the spice paste in a food processor (a mini processor works better than a full-size processor, but you can use a full-size processor if you scrape down the side of the bowl often with a rubber spatula). Run the processor until the garlic and ginger are finely chopped, then gradually add the oil and puree to a smooth paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon about 1 tablespoon of the tandoori paste into the neck and body cavities of the bird, spreading it around with the spatula. Place the bird in a baking dish or aluminum foil pan just large enough to hold it. Spread the remaining spice paste over the chicken on all sides. (Alternatively, you can marinate the bird in a large, heavy-duty, resealable plastic bag.) Let the chicken marinate in the refrigerator, covered, for 6 hours or as long as 24; the longer it marinates, the richer the flavor will be.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up the grill for indirect grilling, place a drip pan in the center, and preheat the grill to medium.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are cooking the chicken on a can, pop the tab off the can and drink half of the club soda or beer (or pour it out). Using a church key–style can opener, make 2 additional holes in the top. If you are using a beer-can chicken roaster, pour half of the club soda or beer into it. Remove the chicken from the marinade, setting aside any remaining marinade. Hold the chicken upright, with the opening of the body cavity at the bottom, and position the bird on the can or chicken roaster so that it fits snugly into the cavity. If you are using a can, pull the legs forward to form a sort of tripod, so the bird stands upright. The rear “leg” of the tripod is the can. You don’t need to do this if you are using a chicken roaster. Tuck the tips of the wings behind the chicken’s back. Alternatively, truss the bird with butcher’s string or a bamboo skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, place the chicken, on the can or roaster if using, in the center of the grate over the drip pan and away from the heat. Spoon any remaining marinade over the chicken, then cover the grill. Grill the chicken until it is handsomely browned and cooked through, about 1 hour for a skinless bird, about 1 1/4 hours if the bird is skin-on. Use an instant-read meat thermometer to test for doneness, inserting it into the thickest part of a thigh but not so that it touches a bone. The internal temperature should be about 170°F. If the top of the bird starts to brown too much, loosely cover it with a small piece of aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chicken to a cutting board and let it rest for about 5 minutes. Carefully lift the chicken off the can or roaster, if using. Cut the chicken into pieces and serve with lemon wedges. </p>"}]}