{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/milk%20honey%20saffron.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "saffron", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Milk and Honey Bread (with Saffron)", "link": "https://www.seriouseats.com/recipes/2010/09/bread-baking-milk-and-honey-bread-with-saffron.html", "description": "The words \"milk and honey\" were bouncing around in my head when I was thinking about a new bread recipe. I didn't want a sweet bread, though. I wanted something that would be savory and interesting, but also useful for sandwiches.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch", "Sandwiches"], "recipeIngredient": ["1 1/2 cups milk, scalded", "1 1/2 tablespoons honey", "1 pinch of saffron", "2 1/2 teaspoons active dry yeast", "13.5 oz (about 2 1/2 cups) bread flour", "1 teaspoon salt", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the hot milk into the bowl of a stand mixer. Add the honey and saffron and stir with wooden spoon to melt the honey into the milk. Let cool to room temperature, about 10 minutes. Add yeast, stir to combine, and let sit until frothy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bread flour and knead with the dough hook on low speed until the dough is smooth and elastic, about 10 minutes. Add salt and olive oil and continue kneading until the oil is incorporated and the dough is smooth, shiny, and elastic, another 1 to 2 minutes. Form the dough into a ball and drizzle some olive oil over it to coat it. Return to the bowl, cover with plastic wrap, and set aside until doubled in size, about one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some cornmeal on baking sheet. When the dough has doubled in size, turn out and carefully form into tight, round ball, making sure not to allow dough to deflate completely. Place ball seam-side down on prepared baking sheet, cover with plastic, and set aside until doubled, about 30 minutes. Meanwhile, adjust oven rack to middle position and preheat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled in size, slash if desired and bake until golden brown, about 40 minutes. Allow to cool completely before serving.</p>"}]}