{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101119-herb-roast-turkey-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["comfort", "fall", "roast", "thanksgiving", "turkey @Thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Easy Herb-Rubbed Turkey and Giblet Gravy", "link": "https://www.seriouseats.com/recipes/2010/11/easy-herb-rubbed-turkey.html", "description": "Roast turkey with an easy gravy to boot. This is the recipe for you if you bake your stuffing outside the bird and you don't want to bother with any fancy butchering.", "totalTime": "5 hours", "recipeYield": "serves 10 to 12", "recipeCategory": ["Christmas", "Mains", "Roasting", "Thanksgiving", "The Food Lab", "Turkey"], "recipeIngredient": ["1 whole turkey, neck and giblets reserved, about 10 to 12 pounds (see note)", "12 tablespoons (1 1/2 sticks) butter, divided", "1/2 cup finely minced parsley leaves", "1 tablespoon finely minced fresh thyme leaves (or 2 teaspoons dried thyme)", "1 tablespoon finely minced fresh sage leaves", "1 tablespoon finely minced fresh rosemary leaves", "2 medium garlic, minced or grated on microplane (about 2 teaspoons)", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil", "1 large onion, roughly chopped", "1 large carrot, peeled and roughly chopped", "2 stalks celery, roughly chopped", "1 1/2 quarts <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 bay leaves", "1 teaspoon soy sauce", "1/4 teaspoon marmite", "1/4 cup flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to lowest position and place a baking stone or <a href=\"http://bakingsteel.com/\">Baking Steel</a> on it. Preheat oven to 500°F. Allow to preheat for at least 45 minutes before adding turkey. Meanwhile, rinse turkey and carefully pat dry with paper towels. Set a <a href=\"http://www.amazon.com/dp/B00005AL40/?tag=serieats-20\">V-rack</a> into a <a href=\"http://www.amazon.com/dp/B000G0KJG4/?tag=serieats-20\">rimmed baking sheet</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 8 tablespoons butter in small skillet or microwave until just melted (it should bubble). Transfer to a medium bowl. Whisk in parsley, thyme, sage, rosemary, garlic, and a generous amount of salt and pepper. Rub mixture evenly all over skin of bird (it should harden and clump a bit as it hits the cold bird).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bird on rack and transfer directly to the baking stone. Immediately close oven and reduce oven temperature to 300°F. Roast until golden brown and deepest part of breast registers  150°F on an instant read thermometer and legs register at least 165°F, 3 to 4 hours total, basting occasionally with browned butter from bottom of pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey is roasting, chop neck into 1-inch chunks with cleaver. Heat oil in medium saucepan over high heat until smoking. Add turkey neck, onions, carrots, and celery and cook, stirring occasionally, until well browned, about 10 minutes total. Add stock, bay leaves, soy sauce, and marmite. Bring to a boil then reduce to a simmer. Simmer for 1 hour then strain through fine mesh strainer. You should have a little over a quart of fortified stock. If not, add water or more chicken stock to equal 1 quart. Discard solids and set stock aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After turkey is cooked, transfer V-rack back to clean rimmed baking sheet. Pour hot melted butter from bottom of pan over turkey. Tent with foil and allow to rest for at least 30 minutes before carving. Meanwhile, set pan over burner and add fortified stock. Scrape up browned bits with wooden spoon. Pour stock through fine mesh strainer set in 1 quart glass measure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop turkey gizzard and liver (if desired). Melt remaining 4 tablespoons butter in medium saucepan. Add chopped giblets and cook, stirring frequently, until just cooked through, about 1 minute. Add flour and cook, stirring constantly until golden brown, about 3 minutes. Whisking constantly, add broth in thin steady stream. Bring to a boil, reduce to a simmer, and cook until thickened and reduced to about 3 cups. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2012/11/how-to-carve-a-turkey-thanksgiving-slideshow.html\">Carve turkey</a> and serve with gravy.</p>"}]}