{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20100820Chorizo.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["chorizo", "quesadilla", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Chorizo): Two-Cheese Chorizo Quesadillas with Watercress", "link": "https://www.seriouseats.com/recipes/2010/09/the-secret-ingredient-chorizo-quesadillas.html", "description": "Mexican chorizo is rendered until crisp; stacked with bitter-sharp watercress leaves; and finished with salty queso cotija and cheddar cheeses. Then, the quesadilla is crisped until the shell is hard and the cheese inside is soft and runny. It's a great way to update your quesadilla routine.", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "The Secret Ingredient"], "recipeIngredient": ["1/4 pound fresh Mexican chorizo, casing removed", "1/2 cup packed watercress leaves", "3 ounces crumbled cotija or feta cheese (about 1/2 cup)", "3 ounces shredded sharp white cheddar cheese (about 1/2 cup)", "2 tablespoons vegetable oil", "Two 8-1/2-inch flour tortillas", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chorizo to heavy-bottomed 10-inch non-stick skillet and cook over medium-high heat, stirring frequently until chorizo is crumbled and cooked through. Transfer to paper towel-lined plate to drain and reserve. Wipe out skillet with paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chorizo, watercress, cotija, and cheddar cheese to medium bowl and toss to combine. Spread half of mixture over half of one tortilla, leaving a 1/2-inch border around the edge. Fold tortilla in half and press down firmly. Repeat with remaining tortilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tablespoon oil to now-empty skillet and return to medium-high heat and heat until shimmering, about 1 minute. Add both tortillas to skillet. Brush top of tortillas with remaining tablespoon oil and season with salt. Cook until first side is crisp and golden brown, about 3 minutes. Using spatula, carefully flip tortillas. Season top side with salt. Cook until second side is crisp, about 3 minutes longer. Transfer to cutting board and allow to rest 1 minute. Cut into wedges and serve immediately with pico de gallo or guacamole.</p>"}]}