{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101110sandwiches.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["bourbon", "fall", "frozen desserts", "gingerbread", "holiday baking", "ice cream", "ice cream sandwiches", "sweet potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Holiday Treat: Sweet Potato and Gingerbread Ice Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2010/11/sweet-potato-bourbon-gingerbread-ice-cream-sandwich-recipe.html", "description": "<strong>This is a sweet potato dessert that won't get mistaken for pumpkin.</strong> We used almost a pound, lightly caramelizing it in butter first for good measure. We went light on the spices&mdash;just enough to enhance the potato's inherent spicy qualities without turning it into pie. But this isn't tame stuff&mdash;just ask the bourbon, a sweet potato's best friend. We added it after cooking the custard so its alcohol would remain in the ice cream, contributing to a fantastically creamy texture and a kick strong enough to remind those nosy relatives who's boss.", "totalTime": "2 hours (plus an overnight chill)", "recipeYield": "10 (makes 10 sandwiches)", "recipeCategory": ["Sweet Potatoes and Yams"], "recipeIngredient": ["<strong>For the Sweet Potato and Bourbon Ice Cream:</strong>", "2 cups (2/3 pound) sweet potatoes, peeled and grated on large holes of box grater", "2 tablespoons unsalted butter", "2 cups half-and-half (or 1 cup each cream and milk)", "1/2 teaspoon cinnamon", "1/2 teaspoon nutmeg, freshly grated", "4 cardamom pods", "1 teaspoon kosher salt", "6 egg yolks", "1/2 cup dark brown sugar", "2 tablespoons bourbon", "<strong>For the Gingerbread Cookies:</strong>", "1 cup (2 sticks) unsalted butter, at room temperature", "1 cup dark brown sugar", "1 1/2 teaspoons kosher salt", "1 teaspoon baking soda", "1/4 teaspoon coriander, freshly ground", "1/4 teaspoon black pepper, freshly ground", "3 cardamom pods, freshly ground", "1/2 teaspoon nutmeg, freshly grated", "1 teaspoon cinnamon", "1 1/2 tablespoons freshly grated ginger (with juice)", "1/4 cup molasses", "1 egg", "2 1/2 cups cake flour (or the lowest-protein flour you can find)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the ice cream:</strong> In 3 quart saucepan, melt butter over medium heat, then add sweet potatoes. Fry until bright in color with some flecks of caramelization, about 3 minutes. Add half-and-half, cinnamon, nutmeg, cardamom, and salt. Simmer uncovered for 20 minutes, or until sweet potatoes are completely tender. Remove cardamom pods and transfer to blender. Blend until very smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, whisk together egg yolks and sugar until ribbons fall from whisk and yolks have lightened in color. Add ladle of sweet potato mixture and whisk thoroughly. Continue, one ladle at a time, until bottom of bowl feels warm. Then return mixture to sweet potato pur&eacute;e and stir to combine. Cook on low heat until mixture coats back of spoon and leaves clean line when you swipe finger through it. Remove from heat, stir in bourbon, and pour into container to chill overnight, covered. Churn next day according to manufacturer's instructions. Put ice cream in freezer for at least one hour to firm up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cookies:</strong> In stand mixer, cream butter and sugar on high speed for several minutes, until mixture looks like fluffy mashed potatoes. Add salt, baking soda, spices, and ginger; mix to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape down sides of bowl, then add molasses. Mix until combined, then add egg. Add flour in three or four installments, scraping down bowl in between. Start mixer on low speed then increase to medium. Mix in flour just until combined&mdash;do not overmix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 325&deg;F, adjust racks to upper middle and lower middle position. Use two-tablespoon scoop to portion 20 balls of dough on two buttered rimmed baking sheets (leave plenty of space between portions). Chill in freezer for 10 minutes. Flatten dough into even discs. Bake until edges have turned a dark brown, tops of cookies are firm, and a thin metal spatula can easily lift them off the pan, about 20 minutes. Cool completely on cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembling and serving:</strong> Let ice cream soften on counter for 20 minutes. Scoop three tablespoons of ice cream onto half of cookies, then squash flat with other half of cookies. Serve immediately, or wrap individually in plastic wrap and freeze. If serving frozen, let sandwiches sit at room temperature for 10 to 15 minutes so ice cream can soften.</p>"}]}