{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100914grolledstuffedtunawithherbsandtapenade.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Fresh from the Market", "grill", "grilled tuna", "grilling", "Laurent Tourondel", "tapenades", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Tuna Stuffed with Herbs and Tapenade", "link": "https://www.seriouseats.com/recipes/2010/09/cook-the-book-grilled-tuna-stuffed-with-herbs.html", "description": "I always seem to forget that artichokes aren't exclusively a spring vegetable and that for a week or two at the end of the summer they make a brief, thistly appearance. Wanting to make the most of these late-season artichokes, I turned to the pages of <strong><a href=\"http://www.bltrestaurants.com/chef.html\">Laurent Tourondel</a></strong>'s <strong><em><a href=\"http://www.amazon.com/Fresh-Market-Seasonal-Cooking-Tourondel/dp/0470402423/serieats-20\">Fresh from the Market</a></em>.</strong>  The cool weather had me searching for a heartier, main dish of a recipe, something substantial but delicate enough to highlight the sweet artichokes. This recipe for <strong>Grilled Tuna Stuffed with Herbs and Tapenade</strong> was exactly what I had in mind.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book", "Fish"], "recipeIngredient": ["1 cup fresh basil leaves, roughly chopped", "1/4 cup store-bought black olive tapenade", "2 tablespoons salt-packed capers, rinsed and roughly chopped", "1 anchovy, rinsed and chopped", "1 finely chopped Thai chile  ", "3 tuna steaks, 14 ounces each", "1/3 cup plus 2 tablespoons extra virgin olive oil", "4 tablespoons freshly squeezed lemon juice", "2 tablespoons chopped fresh oregano", "1 1/2 tablespoons chopped fresh rosemary", "1 tablespoon cracked black peppercorns", "1 tablespoon finely chopped garlic", "3 baby artichokes", "Sea salt and freshly ground black pepper", "1 tablespoon balsamic vinegar", "2 ounces Sartori Stravecchio (or another domestic Parmesan cheese), shaved", "2 tablespoons fresh parsley leaves", "1 lemon, cut into 6 wedges  ", "Cerignola olives, cut in half (optional)  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the tuna:</strong> Mix the basil, tapenade, capers, anchovy, and chile in a small bowl. Using a sharp paring knife, make an incision along 1 side of each tuna steak. Move the knife back and forth to make a pocket. Divide the stufﬁng into 3 equal parts and stuff the tuna steaks. Place the steaks in a shallow nonreactive baking dish.</p>\r\n\r\n<p>Mix the 1/3 cup of olive oil with 3 tablespoons of the lemon juice, oregano, rosemary, peppercorns, and garlic in a small bowl. Pour the marinade over the ﬁsh and marinate in the refrigerator for 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the artichokes:</strong> Using a paring knife, trim an artichoke of all external green leaves as well as the green exterior of the stem. Once the artichoke has been trimmed down to the tender, yellow-hued leaves, cut it in half. Using a mandoline or a very sharp knife, very thinly slice the artichoke. Transfer the slices to a bowl of cold water with the remaining 1 tablespoon of lemon juice. Repeat this process quickly with the remaining artichokes, making sure they do not turn brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Grill the tuna:</strong> Preheat a grill or grill pan to medium-high heat. Remove the ﬁsh from the marinade and season with sea salt and pepper. Grill until the tuna is well seared but still medium-rare, about 3 minutes per side. Remove the tuna from the grill and cut it into 1-inch-thick slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Transfer the tuna to a platter, drizzle with the remaining 2 tablespoon of olive oil and the balsamic vinegar. Garnish with the shaved cheese, parsley leaves, artichoke slices, lemon wedges, and halved olives, if desired.</p>"}]}