{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100315WholeWheatSodaBread.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["breads", "healthy", "healthy and delicious", "irish", "soda bread", "whole-wheat flour"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Healthy &amp; Delicious: Whole-Wheat Irish Soda Bread", "link": "https://www.seriouseats.com/recipes/2010/03/whole-wheat-irish-soda-bread-st-patricks-day-recipe.html", "description": "An amalgam of seven different European ethnicities, my siblings and I grew up without a real culinary heritage. If anything, Ma usually made dishes from outside our own hotpot of cultures: goulash, spaghetti and meatballs, etc. <strong>The one exception was Irish soda bread.</strong> This one is a little hardier than others&mdash;more of a quick brown bread than a dessert.", "totalTime": "", "recipeYield": "12 to 16", "recipeCategory": ["Bread", "Healthy and Delicious", "St. Patrick's Day"], "recipeIngredient": ["2 cups unsifted whole-wheat flour", "2 cups unsifted all-purpose flour, plus more for dusting", "1 teaspoon baking soda", "1 teaspoon salt", "2 1/4 cups light buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450°F. Dust a clean surface with flour. Spray a baking sheet with Pam and dust with flour. (Note: Aim for the center when you do this, or you'll be scrubbing burnt, floured Pam off your bakeware.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine flours, baking soda, and salt. Whisk together. Make a well in the middle. Pour in about 2/3 cup of the buttermilk. With one hand, stir it into the dough in a circular motion. Add another 2/3 cup of the buttermilk. Stir again with your hand, until flour is incorporated. Repeat until buttermilk is gone, and you have a big ol' lump of dough, which should be, \"soft, but not too wet and sticky.\"</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out on to your floured surface. Clean your hands, dry them thoroughly, and dust them with flour. Lightly knead dough a few times, until it's a rounded loaf-like shape. Pat it down into a round, 2\"-thick disc. Transfer to baking sheet. With a serrated knife, cut a deep X across the bread. Prick each area a few times with the knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake 20 minutes on 450°F. Drop the heat to 400°F and bake an additional 30 to 35 minutes. Bread should appear finished and sound hollow when you knock on it. Remove from oven and cool on a wire rack until you're ready to dig in.</p>"}]}