{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/22100329-cabbage.jpg", "author": {"@type": "Person", "name": "Special to Serious Eats"}, "recipeCuisine": "", "keywords": ["Arthur Schwartz", "cabbage", "farfel", "hanukkah sides", "Jewish holidays", "matzo", "schmaltz", "spaetzle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sauteed Cabbage and Matzo Farfel 'Spaeztle'", "link": "https://www.seriouseats.com/recipes/2010/03/sauteed-cabbage-and-matzo-farfel-spaeztle-passover-recipe.html", "description": "This is an old Hungarian recipe (called <em>Krow Pletzla</em> in Hungarian Yiddish) that's <strong>the Passover version of cabbage and noodles.</strong> Author of <strong><em><a href=\"http://www.amazon.com/dp/1580088988/?tag=serieats-20\">Jewish Home Cooking</a></em></strong> and many other wonderful cookbooks, <strong>Arthur Schwartz</strong> makes this for Passover with little pieces of matzo farfel, which resemble noodles&mdash;actually spaetzle&mdash;and tosses them with well-wilted cabbage and onions.", "totalTime": null, "recipeYield": "about 8", "recipeCategory": ["Cabbage", "Passover"], "recipeIngredient": ["2 eggs ", "1/4 teaspoon salt ", "3 cups matzo farfel ", "Freshly ground pepper ", "2 1/2 to 3-pound cabbage ", "2 medium onions ", "4 tablespoons chicken fat or butter ", "1/2 teaspoon salt  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, beat the eggs and 1/4 teaspoon salt. Add the farfel and toss it well in the egg to coat the matzo thoroughly.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the farfel out on a baking sheet and place in a 350°F oven for 45 minutes, or until a golden tan, removing it after 15 minutes and separating the matzo by breaking it up in fistfuls. The matzo may be too hot for you to handle, so you may have to let it cool a few minutes to do this. Make sure to close the oven door while waiting. You may have to do this twice, after another 15 minutes or so. The goal is to make each piece of egg-coated matzo separate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the matzo has been toasted, set aside. Or, prepare as much as a day ahead: keep the dried farfel at room temperature in a covered bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the head of cabbage in half and cut out the hard core. Shred the cabbage as finely as possible. Rinse well in a colander, then dry well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the onions, cut in half through the root ends, then cut into thin slices. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 12-inch or larger skillet, heat the chicken fat or butter. Add the cabbage and onion, season with 1/2 teaspoon salt, toss well, then cook over medium heat, tossing regularly, until the cabbage is wilted, tender and has turned tan, at least 30 minutes. When done, set aside in the skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the farfel, bring a large pot of water to a rolling boil, salt the water lightly, then boil the farfel for 5 minutes. Drain in a colander. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the farfel with the cabbage and toss together over medium heat, seasoning to taste with freshly ground pepper. Serve hot. (The whole dish can be made ahead, cooled and refrigerated. Reheat&mdash;as many as several days later&mdash;in a dry skillet (no need to add more fat).</p>"}]}