{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101001eggspoachedintomatosauceoncouscouswithoreganoandparsley.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "couscous", "Deborah Krasner", "eggs", "eggs in purgatory", "Good Meat", "poach", "poached eggs", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Eggs Poached in Tomato Sauce on Couscous with Oregano and Parsley", "link": "https://www.seriouseats.com/recipes/2010/10/eggs-poached-in-tomato-sauce-on-couscous-with-oregano-and-parsley.html", "description": "This recipe for <strong>Eggs Poached in Tomato Sauce on Couscous with Oregano and Parsley</strong> is a hearty, meal-worthy take on the Italian classic <strong>eggs in purgatory</strong>.  A simple tomato sauce is enlivened with Greek oregano and acts as the poaching liquid for farm fresh, pastured eggs.  While the eggs gently poach in the sauce, couscous is steamed and croutons are fried.  The eggs and sauce are ladled onto the fluffy couscous, topped with crunchy croutons, and finished with parsley and shredded Parmigiano.  This is one of those preparations that lets the delicacy of fresh eggs really come through.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Poached Eggs", "Poaching"], "recipeIngredient": ["3 tablespoons extra-virgin  olive oil", "1 onion, chopped", "2 cloves garlic, chopped", "Salt", "1 tablespoon Greek oregano", "1 (28-ounce) can whole peeled tomatoes", "Freshly ground black pepper  ", "2/3 cup couscous", "4 to 6 pastured eggs, at room temperature", "1/4 cup freshly grated or shredded Grana Padano or Parmigiano-Reggiano", "3 thick slices artisanal white or whole wheat  bread, cut into cubes", "1/3 cup finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a wide saucepan or deep frying pan over low heat and add 1 tablespoon of the oil.  When it is thinned and fragrant, add the onion and sweat it down over low heat until the pieces are translucent.  Add the garlic and season with salt, and stir them in for a minute or so.  Crumble in the oregano and grind a generous amount of black pepper over all. Stir this in over low heat for another minute or two.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes and their juices to the pan, breaking up the tomatoes with a spatula.  Increase the heat to create little bubbles at the edges, then lower the heat to maintaining a steady, slow simmer for 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the couscous: Heat 1 tablespoon of the remaining olive oil in a saucepan over medium heat, and when it is hot, add the couscous.  Stir it around in the oil; add 1 1/3 cups water and salt to taste.  Cover the pan, and cook until all the water is absorbed, about 8 minutes.  Uncover and fluff the couscous grains with two forks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs one at a time into the simmering tomato sauce, spacing them evenly around the pan.  Sprinkle the grated cheese over the surface and cover the pan.  Poach the eggs for 10 minutes on medium-low heat, or until the whites are set and the yolks are creamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As the eggs cook, make croutons: Using a cast-iron frying pan, heat the remaining 1 tablespoon olive oil and fry the croutons over medium-high heat until they are crisp and golden on all sides, turning them as necessary. Remove these to a paper towel to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, fill shallow bowls with the couscous, then spoon on some tomato sauce and one of the eggs. Add more salt to taste; scatter croutons and the chopped parsley on top.</p>"}]}