{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101115cloverleafsweetpotatorolls.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "Cook the Book", "holiday recipes", "Lyniece North Talmadge", "rolls", "sweet potato bread", "sweet potatoes", "The Sweet Potato Lover's Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sweet Potato Cloverleaf Rolls", "link": "https://www.seriouseats.com/recipes/2010/11/sweet-potato-cloverleaf-rolls-recipe.html", "description": "Part of the fun of <strong>Lyniece North Talmadge</strong>'s <strong><em><a href=\"http://www.amazon.com/Sweet-Potato-Lovers-Cookbook-healthiest/dp/1402239114/serieats-20\">The Sweet Potato Lover's Cookbook</a></em></strong> is the possibility of making meals that incorporate sweet potatoes into every course. That was precisely my plan for recipe-testing from the book.  I began my day with these <strong>Sweet Potato Cloverleaf Rolls</strong>, lightly sweet, yeasted rolls with sweet potato purée mixed into the dough.", "totalTime": "", "recipeYield": "8 rolls", "recipeCategory": ["Cook the Book", "Sweet Potatoes and Yams"], "recipeIngredient": ["1 sweet potato, cubed ", "Reserve 1/4 cup cooking water from sweet potatoes ", "1/2 cup nonfat dry milk  ", "2 tablespoons firmly packed brown sugar ", "2 tablespoons unsalted butter at  room temperature, in 1/2 inch pieces ", "1/2 teaspoon Kosher salt ", "2 cups bread flour ", "1 teaspoon active dry yeast, instant or bread machine ", "Milk for brushing tops of rolls "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cubed sweet potatoes in a saucepan with water to cover by 1inch.  Bring to a boil, then reduce heat and simmer until potatoes are tender, about 15 to 20 minutes.  Drain, reserving 1/4 cup of cooking water.  Purée sweet potatoes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1⁄2 cup puréed sweet potatoes, cooking water, nonfat dry milk, brown sugar, butter, salt, bread flour, and yeast in baking pan fitted with kneading paddle.  Press “menu” and select “dough/pizza dough.”  Select “1 lb.” dough size. Press “start” to mix, knead, and rise.  When dough is ready, remove from baking pan and deflate.  Divide into nine equal portions. Lightly <br />\r\ncoat nine-hole muffin tin with cooking spray.  Divide each dough ball into three equal pieces. Roll each piece into a small ball.  Arrange three small dough balls in each muffin cup. Cover with plastic wrap and let rise until doubled, about 30 to 40 minutes. Preheat oven to 375°. When rolls have  doubled in size, brush tops with milk. Bake in preheated oven for 20 to 25 minutes, until lightly browned and hollow sounding when tapped. Remove from muffin tins and serve warm. May be made ahead and reheated to serve. </p>"}]}