{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101011AllAmericanChili.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["beans", "beef", "chili", "healthy and delicious"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Healthy &amp; Delicious: All-American Chili", "link": "https://www.seriouseats.com/recipes/2010/10/healthy-all-american-chili-recipe.html", "description": "<strong>Loaded with beans and vegetables</strong>, each sizable serving also contained about two or three ounces of hearty meat&mdash;enough to get some with every bite, but not so much I felt like I was eating a burger. <strong>The spice was dead-on</strong>, as well. A combination of chili powder, diced jalapeño pepper, and hot Italian turkey sausage punched everything up without overwhelming the other flavors. I served the dish with cornbread muffins, the way nature intended.", "totalTime": "120 minutes", "recipeYield": "8 to 10", "recipeCategory": ["Beef", "Chili", "Healthy and Delicious"], "recipeIngredient": ["6 ounces hot Italian turkey sausage (2 or 3 links), casings removed", "2 medium onions, chopped medium (about 2 cups)", "1 large green bell pepper, chopped medium (about 1 cup)", "8 garlic cloves, finely minced or grated on a microplane (about 8 teaspoons)", "1 pound ground sirloin", "1 jalapeño pepper, finely chopped", "2 tablespoons chili powder", "2 tablespoons brown sugar", "1 tablespoon ground cumin", "3 tablespoons tomato paste", "1 teaspoon dried oregano", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon salt", "2 bay leaves", "1 1/4 cups Merlot or other fruity red wine", "2 (28-ounce) cans whole tomatoes, undrained and coarsely chopped", "2 (15-ounce) cans kidney beans, drained", "1/2 cup (2 ounces) shredded reduced-fat sharp cheddar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large pot or Dutch oven over medium-high until hot (about 1 minute). Add sausage, onion, bell pepper, garlic, sirloin, and jalapeno. Cook, stirring frequently and breaking up meat with back of wooden spoon until meat is browned and onions are translucent, 8 to 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chili powder, brown sugar, cumin, tomato paste, oregano, black pepper, salt, and bay leaves. Cook until fragrant, stirring constantly, about 1 minute. Add wine, tomatoes, and beans. Increase heat to high and bring to a boil. Reduce to a simmer, cover, and cook until flavors have blended and liquid has reduced, about 1 hour, stirring occasionally to prevent it from sticking to bottom of pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove cover and cook an additional 30 minutes, stirring occasionally. Remove bay leaves. Scoop into bowls and sprinkle with graded cheddar. Serve with remaining wine.</p>"}]}