{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100923basicfrenchlentils.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Around My French Table", "Cook the Book", "Dorie Greenspan", "lentils"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Basic French Lentils", "link": "https://www.seriouseats.com/recipes/2010/09/basic-french-lentils-recipe.html", "description": "I had been trying my hand at French lentils with varying degrees of success for the past few years when I finally found the prefect recipe for <strong>Basic French Lentils</strong> in <a href=\"http://doriegreenspan.com/about.html\">Dorie Greenspan</a>'s <strong><em><a href=\"http://www.amazon.com/Around-My-French-Table-Recipes/dp/0618875530/serieats-20\">Around My French Table</a></em></strong>.  While I had always incorporated a combination of carrots, celery, and onions I was missing a few key ingredients&mdash;one lone clove, a bay leaf, a bit of cognac, and most importantly, plenty of stock to cook the lentils in.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beans and Pulses", "Cook the Book", "Sides"], "recipeIngredient": ["1 cup <em>lentils du Puy</em>", "1 clove", "1 small onion, peeled", "1 medium carrot, trimmed, peeled, and cut into 4 to 6 pieces", "1 celery stalk, trimmed, peeled, and cut into 4 to 6 pieces", "1 garlic clove, smashed, peeled, and germ removed", "1 bay leaf", "3 1/2 cups chicken broth, vegetable broth, or water", "1 tablespoon Cognac (optional)", "1 shallot, finely chopped, rinsed, and patted dry (optional)", "Freshly ground pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the lentils in a strainer and pick through them, discarding any bits of stone that might have escaped the packers; rinse under cold running water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the lentils into a medium saucepan, cover them with cold water, bring to a boil, and cook for 2 minutes; spill the lentils out into the strainer. Drain, rinse the lentils again, and rinse out the saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the clove into the onion and toss the onion, carrot, celery, garlic, and bay leaf into the pan. Pour in the broth or water, stir in the lentils, and bring to a boil. Lower the heat to a steady simmer and cook for 25 to 30 minutes, or until the lentils are almost tender. As the lentils cook, skim off the solids that rise to the top and stir as needed. Season with salt and pepper and cook until they’re tender, another 5 to 10 minutes, then pour in the Cognac, if you’re using it. Give everything a good stir and another minute over the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the lentils, reserving the cooking liquid if you’re going to want to reheat them. Remove the vegetables and either discard them all or discard the clove and bay leaf and finely chop the vegetables, which will be soft but tasty. Stir the vegetables back into the lentils. If you’re using the shallot, stir it in now (I think it adds a lot to the mix). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The lentils are ready to be served now, set aside and reheated over low heat in the liquid you’ve reserved, or used in other recipes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Storing:</strong> Once cooled, the lentils and their liquid can be packed airtight and kept chilled for up to 3 days. Warm in a covered saucepan over gentle heat.</small></p>"}]}