{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101007ScallopsEspressoBeurreBlanc610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["coffee", "scallops", "seafood", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Coffee): Seared Scallops with Espresso Beurre Blanc", "link": "https://www.seriouseats.com/recipes/2010/10/the-secret-ingredient-coffee-seared-scallops.html", "description": "This is a true secret ingredient recipe: using something right out of the pantry and altering it to an important but unidentifiable state.  The coffee in this recipe (instant espresso, in this case) provides sharp bitterness, contrasted by a luxurious creaminess in the sauce, and a caramel sweetness in the seared scallops.  It's the perfect easy recipe that lends a wow factor to any dinner party.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Mains", "Other Seafood", "The Secret Ingredient"], "recipeIngredient": ["1 small shallot, finely diced", "5 stems of parsley (stems only), coarsely chopped", "4 black peppercorns", "1 tablespoon plus 1 teaspoon cider vinegar", "1 teaspoon instant espresso dissolved in 1/4 cup recently boiled water", "1 tablespoon heavy cream", "1/4 teaspoon granulated sugar", "Fine sea salt", "1 stick (8 tablespoons or 4 ounces) very cold unsalted butter, cut into small cubes, plus 1 tablespoon", "12 to 16 large sea scallops"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepot, add the shallot, parsley stems, peppercorns, cider vinegar, and espresso powder dissolved in hot water.  Bring to simmer over medium heat and simmer until reduced to 2 teaspoons, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk in the heavy cream, then begin adding the stick of cubed butter, about 3 small cubes at a time, whisking constantly.  Add more butter only once the butter just added has melted into sauce.  Once all butter is incorporated, remove from heat, add sugar and season to taste with salt.  Strain into a bowl, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly, melt remaining tablespoon butter in a heavy-bottomed 12-inch stainless steel skillet over medium-high heat until butter foams at edge of pan.  Pat scallops dry on paper towel, and season lightly with fine sea salt.  Sear scallops 3 minutes on first side, until golden brown.  Turn and sear 2 minutes on reverse side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Plate the dish with a puddle of beurre blanc in the center, and scallops nestled on top.  Serve immediately.</p>"}]}