{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100908_roastedtomatosoup.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["carrots", "chickpeas", "cilantro", "Dinner Tonight", "eggplant", "soups", "tomato soup", "tomatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Dinner Tonight: Roasted Tomato and Eggplant Soup", "link": "https://www.seriouseats.com/recipes/2010/09/roasted-tomato-and-eggplant-soup-recipe.html", "description": "<strong>I usually hate tomato soup.</strong> I don't hate many things, but a bowl of bland off-red soup is a rare exception. Blended soups in general tend to be boring and homogeneous, and tomato is, at least for me, the worst offender. So why am I telling you about a tomato soup, especially when I could be whipping up another sublime BLT? Leave it to <strong>Martha Stewart</strong> to sort things out. Instead of simply blending all the vegetables, only the roasted tomatoes, carrots, and garlic are pureed.", "totalTime": null, "recipeYield": "6 people", "recipeCategory": ["Dinner Tonight", "Eggplant", "Legumes", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["3 pounds plum tomatoes, sliced in half, stems and cores removed", "1/2 pound carrots, chopped into 3/4-inch pieces", "10 garlic cloves", "4 tablespoons olive oil", "Salt and pepper ", "1 large eggplant, stem removed and cut into 3/4-inch chunks", "1 can chickpeas, drained and rinsed", "2 teaspoons curry powder", "1/2 cup cilantro, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F. Meanwhile, toss the tomatoes, carrots, and garlic with 2 tablespoons oil, 1 teaspoon salt, and 1/4 teaspoon pepper. Spread out on a large baking sheet, making sure to keep the tomatoes cut side down. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the eggplant, chickpeas, and curry powder with 2 tablespoons oil, 1 teaspoon salt, and 1/4 teaspoon pepper. Spread this mixture out on separate baking sheet. Place both baking sheets into the oven and cook for 45 minutes. Stir both about halfway through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove both baking sheets from the oven. Peel off the skin from the tomatoes. Toss all the contents from the baking sheet with the tomatoes into a blender. Process until smooth. Pour this mixture into a large pot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the contents from the second baking sheet to the large pot. Thin the soup with 3 cups of water. Turn the heat to medium and bring to a boil. Season with salt and pepper to taste. Then turn off the heat. Ladle into bowls, and serve with cilantro and some rustic bread. </p>"}]}