{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100716-seriouslyasian-chaca.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Vietnamese", "keywords": ["cha ca", "fish", "noodles", "rice noodles", "seafood", "Seriously Asian", "tumeric", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Seriously Asian: Chả Cá, Seared Fish with Turmeric Over Rice Noodles", "link": "https://www.seriouseats.com/recipes/2010/07/seriously-asian-cha-ca-seared-fish-with-tumeric-over-rice-noodles-vietnamese-recipe.html", "description": "The restaurant Chả Cá La Vong in Hanoi makes the definitive bowl of Chả Cá, but everywhere we went in Hanoi, there were noodle joints serving their unique version of the dish. The major elements of the dish were as follows: a <strong>white-fleshed fish</strong> like catfish or snakehead seasoned with turmeric, <strong>seared, with plenty of dill and green onions on top; a bed of rice noodles; roasted peanuts; and an assortment of herbaceous greens.</strong>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Fish", "Pasta", "Vietnamese"], "recipeIngredient": ["12 ounces fish fillets, either catfish or salmon, or another fish to your liking", "Dill and green onion, roughly chopped", "A few tablespoons of oil for frying", "White rice noodles, about 4 bunches suitable for 4 servings", "<strong>For the marinade</strong>", "Buttermilk to cover the fish ", "1 tablespoon ground turmeric", "3 tablespoons freshly grated galangal or ginger juice", "2 tablespoons shrimp paste", "<strong>To garnish</strong>", "Fish sauce and shrimp sauce, to taste", "Lime juice, to taste", "Lettuce, preferably romaine or butterhead ", "An assortment of herbs, such as Thai basil, mint, and perilla", "Roasted peanuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the fish in the marinade and mix well to coat. Keep it in the refrigerator for at least a few hours, preferably up to a day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the rice noodles in boiling water, according to the instructions on the packet.  Drain, rinse, and divide among four wide bowls for serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the peanuts and the assortment of herbs and lettuce into the bowls as well. Have your condiments&mdash;the fish sauce, shrimp paste, and lime&mdash;ready on the side.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the fish out the marinade and pat both sides dry. Heat a nonstick or well-seasoned skillet over medium heat. Add the oil to the pan and pan-fry the fish on both sides, about two minutes per side depending on the thickness of your fillets, turning carefully so as not to break up the meat. Take the fillets out and place them into your noodle bowls.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the oil and juices in the pan, lightly fry the green onions and dill and pour over the fish in the noodle platters. Serve immediately, having each guest mix the noodles to his or her liking with the assortment of condiments and herbs. </p>"}]}