{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100617-dt-smoked-trout-brandade.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fish", "seafod", "trout"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Dinner Tonight: Smoked Trout Brandade", "link": "https://www.seriouseats.com/recipes/2010/06/dinner-tonight-smoked-trout-brandade-recipe.html", "description": "Traditionally, <a href=\"http://en.wikipedia.org/wiki/Brandade\">brandade</a> is made with salt cod, an emulsification of the fish, olive oil, and often potato, milk, or cream, to create a silky, smooth pur&eacute;e. Salt cod is a wonderful ingredient, but one that's a bit of a hassle to use, requiring soaking and planning ahead. This <a href=\"http://www.foodandwine.com/recipes/smoked-trout-brandade\">recipe from <em>Food &amp; Wine</em></a> opts for <strong>flaked smoked trout</strong> instead, which lends a similar taste and makes for a simpler, quicker preparation.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Fish", "Mains"], "recipeIngredient": ["3/4 cup extra-virgin olive oil", "2 large garlic cloves, peeled and thickly sliced", "1/2 cup heavy cream", "1 pound Yukon Gold potatoes", "3 smoked trout fillets (4 to 5 ounces each), skin removed and flesh flaked", "Salt and freshly ground white pepper to taste", "1 tablespoon snipped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the potatoes with cold water in a pot and bring to a boil. Boil until tender, drain, and allow to cool slightly before slipping off the skins. Pass the potatoes through a ricer, sieve, or whip until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat the olive oil in a small skillet or saucepan over low heat, then add the garlic cloves. Cook very gently until the garlic has infused the oil and is soft and slightly golden, 5-7 minutes. Transfer the garlic to a small bowl, leaving the oil in the pan, and mash it with a fork. Once the oil has cooled slightly, add the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the mashed garlic and the cream-oil mixture to the potatoes, whisking to combine, then add the trout and salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Transfer the potato mixture to a shallow dish and bake until hot, about 15 minutes. Sprinkle with chives and serve.</p>"}]}