{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100302-tapas-composite-500px.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["appetizers", "entertaining", "small plates", "spanish", "tapas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Small Plates: 4 Spanish Tapas That Use Only 4 Ingredients Each", "link": "https://www.seriouseats.com/recipes/2010/03/small-cravings-4-spanish-tapas-4-ingredients-each-recipes.html", "description": "Intended as a cheap way to draw customers into drinking establishments, the most traditional tapas are easy to make, inexpensive, and go perfectly with booze. <strong>Nobody wants throwing a party to be a chore,</strong> least of all the cook. In that spirit, here are <strong>4 simple tapas that require only 4 ingredients</strong> (aside from salt, pepper, and olive oil). They're guaranteed to get the mixers mixing and the shakers shaking.", "totalTime": "", "recipeYield": "4-6 as an appetizer, or a dozen at a party", "recipeCategory": ["Sides", "Spanish"], "recipeIngredient": ["<strong> For Escalivada Catalana (Catalan-style Roasted Vegetables) </strong>", "1 medium eggplant", "1 large red onion, ends trimmed, skinned, and split in half from pole to pole", "2 red bell pepper", "1/3 cup extra-virgin olive oil", "2 teaspoons sherry vinegar", "kosher salt and freshly cracked black pepper ", " ", "<strong> For Queso Idazábal Marinado (Marinated Idiazábal cheese) </strong>", "1 pound Idiazábel cheese, cut into ¾-inch cubes", "3/4 cup extra-virgin olive oil", "4 garlic cloves, lightly smashed", "2 bay leaves", "3 sprigs fresh thyme", "24 whole black peppercorns", " ", "<strong> For Garbanzos con Chorizo  (Chickpea and chorizo stew) </strong>", "2 tablespoons extra-virgin olive oil", "4 ounces dry-cured Spanish style chorizo, cut into ¼-inch slices", "1 medium onion, finely sliced", "2 tablespoons tomato paste", "1 (14.4 ounce) can cooked chickpeas, undrained", "kosher salt and freshly cracked black pepper", " ", "<strong> For Coliflor con Pimentón  (Cauliflower with smoked paprika) </strong>", "1/4 cup extra-virgin olive oil", "3 garlic cloves, thinly sliced", "1 small head cauliflower, cut into 1-inch florets", "1 teaspoon smoked Spanish paprika (Pimentón de la Vera)", "2 teaspoons sherry vinegar", "kosher salt and freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> To Make Escalivada Catalana: </strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to lower middle position and preheat oven to 400 degrees. Rub eggplant, onion halves, and bell peppers with 2 tablespoons olive oil and season generously with salt and pepper. Place on foil-lined rimmed baking sheet and roast for 30 to 40 minutes until eggplant and peppers are fully softened and charred on the exterior, and onions are softened with a few charred spots, turning vegetables every ten minutes to achieve even cooking. Some vegetables may cook faster than others - remove them to large mixing bowl as they finish roasting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow vegetables to rest until cool enough to handle, then peel eggplant and pepper (skins should slip off fairly easily with fingers). Roughly chop all vegetables into strips and return to mixing bowl. Add sherry vinegar and remaining olive oil and stir to combine. Season to taste with salt and pepper. Serve warm or at room temperature with grilled or toasted rustic bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><Strong> To Make Queso Idazábal Marinado:</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add all ingredients to medium bowl and mix with rubber spatula or wooden spoon to combine. Cover with plastic and let marinate at room temperature for 8 to 12 hours, mixing occasionally. Serve at room temperature with toothpicks and crusty bread for dipping into olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> To Make Garbanzos con Chorizo </strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in 10-inch heavy-bottomed stainless steel skillet over medium heat until shimmering. Add chorizo and cook, stirring frequently until some fat render and sausage is starting to brown, about 10 minutes. Add onion and cook, stirring frequently, until onion is fully softened but not browning, 5-8 minutes. Add tomato paste and cook, stirring constantly, until paste begins to fry, about 2 minutes. Add chickpeas, stir to combine, bring to a simmer, reduce heat to low, and reduce until stew-like consistency is reached, about 10 minutes. Season to taste with salt and pepper, and serve immediately with toasted or grilled rustic bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> To Make Coliflor con Pimentón</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in 12-inch heavy-bottomed stainless steel skillet over medium-high heat until shimmering. Add sliced garlic and cook, stirring constantly, until garlic is light golden brown. Using slotted spoon or skimmer, remove garlic to small bowl and set aside. Add cauliflower to skillet and cook, stirring occasionally until fully tender and caramelized in spots. Remove from heat, add 1/2 teaspoon paprika, reserved garlic, and sherry vinegar (oil may spatter when adding vinegar&mdash;be careful). Stir to combine, season to taste with salt and pepper, transfer to wide serving dish, and sprinkle with remaining paprika. Serve with toasted or grilled rustic bread.</p>"}]}