{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100803greenpocket_big.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "inexpensive"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Eat for Eight Bucks: Green Pockets", "link": "https://www.seriouseats.com/recipes/2010/08/eat-for-eight-bucks-green-pockets-recipe.html", "description": "<strong>These little pockets match healthy mixed greens with a light yeasted bread.</strong> This recipe makes too much for two people, but you may wrap extras well and freeze them for later. They're a perfect solution if your CSA, like mine, is delivering endless quantities of kale or bok choy.", "totalTime": null, "recipeYield": "2", "recipeCategory": ["Eat for Eight Bucks", "Mains"], "recipeIngredient": ["<strong>Shopping list: </strong> 3 bunches greens, $5.00; 6 eggs, $2.29; 1 3/4 cups flour, $0.50", "<strong>Pantry items:</strong> Flour, yeast, sugar, salt, olive oil, garlic, cumin seed, coriander seed, pepper", "<strong>Total cost (for 2 plus leftovers to freeze):</strong> $7.79", "1 3/4 cups flour (I used a combination of all-purpose and white whole wheat)", "1 1/2 teaspoons rapid rise yeast", "1/2 teaspoon sugar", "Kosher salt", "2 eggs", "Olive oil", "2 pounds mixed sturdy greens (kale, chard, beet, mustard, dandelion), well washed, tough stems removed", "4 cloves garlic, peeled and roughly chopped", "1 teaspoon cumin seed", "1 teaspoon coriander seed", "Pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, yeast, sugar, and 1/2 teaspoon kosher salt in a large bowl and whisk well to combine thoroughly. In a smaller bowl, lightly beat an egg; then beat in 1/2 cup room temperature water and 3 tablespoons olive oil. Stir the wet ingredients into the dry until stirring becomes difficult. Then turn the dough out onto a lightly floured work surface and knead until smooth and springy, about 5 minutes, adding a little more flour if necessary. Put the dough into an oiled bowl, cover, and let rise until doubled, 45 minutes to an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the dough rises, prepare the greens. Bring about a quart of water to a boil in a 4 to 5 quart pot. Add 1 1/2 teaspoons salt and then the greens, a handful at a time, until they have all wilted down into the bubbling water. Adjust heat if necessary to tame the boil and cook until the greens are tender but still have some bite. (I used 2 bunches of lacinato kale and 1 bunch of rainbow chard, and I boiled the kale leaves for 10 minutes, added the chard leaves to the pot, and let everything cook 5 minutes more.) Drain the greens well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the greens are cool enough to handle, squeeze out excess liquid and chop finely. Pound the garlic, 1/2 teaspoon salt, cumin seed, and coriander seed in a mortar until they make a slightly chunky paste. Put this paste into a large pot or skillet and then add enough olive oil to coat the bottom of the pot. Turn the heat to medium and listen; once the garlic starts to sizzle, stir and cook for about 30 seconds more. Then stir in the greens. Lower the heat and cook and stir for about 5 minutes, until the greens are completely tender and well coated with flavored oil. Taste for salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled in bulk, turn it out onto a lightly floured work surface. Divide it into 8 pieces (or however many pieces you want), shape it into balls, and let rest under a towel for 15 minutes. Then roll the balls out into circles that measure about 4 inches across. If you do not plan to make the pockets right away, you may put the dough circles on baking sheets and refrigerate until you are ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375. Beat the second egg in a small bowl. Stir half of the beaten egg into the greens. Spoon a dollop of greens onto half of a circle of dough, and then fold the empty half over the filled half and pinch the edge together to seal. Repeat with the remaining 7 dough circles. Brush the pockets with the remaining beaten egg and bake for 20 minutes, until golden brown.</p>"}]}