{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100104minigalettes2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "French", "keywords": ["cakes", "Cakespy", "Christmas", "French", "French pastries", "galettes des rois", "holiday desserts", "puff pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Mini Galettes des Rois", "link": "https://www.seriouseats.com/recipes/2010/01/cakespy-mini-galettes-des-rois-three-kings-cake-recipe.html", "description": "Galette des Rois is a <strong>rich almond cream and puff pastry</strong> confection which commemorates the arrival of the three kings on the Epiphany. Within each galette is a hidden treasure&mdash;a <em>feve</em> (originally a bean, but often a trinket now), the finder of which is declared king.", "totalTime": "", "recipeYield": "about 12 to 18 mini galettes, depending on size", "recipeCategory": ["Cakespy", "French", "Pastry"], "recipeIngredient": ["1/4 cup almond paste", "1/4 cup white sugar", "3 tablespoons unsalted butter, softened", "1 egg", "1/4 teaspoon vanilla extract", "1/4 teaspoon almond extract", "2 tablespoons all-purpose flour", "1 pinch salt", "1 package frozen puff pastry, thawed", "1 dry kidney bean", "1 egg, beaten (for an egg wash)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the almond paste into a food processor with about half of the sugar, and process until well blended. Add the butter and remaining sugar; process until smooth. Blend in one of the eggs, vanilla extract, almond extract, flour and salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. Line a baking sheet with parchment paper and set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out one sheet of the puff pastry into an 11-inch square. Keep the pastry cool, do not knead or stretch. Using a cookie or biscuit cutter (I used the \"tartelette mold\" which Williams-Sonoma uses on their gift wrapping), cut out as many rounds as you can from the sheet and lay them on the prepared baking sheet. Mound a bit of almond filling in the middle of each round, leaving about half an inch all around it. If you'd like, put a little prize or bean (something tiny works best) inside of any (or all) of them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>I had some extra filling left even after adding it to all of my prepared rounds of puff pastry. If you have more puff pastry, by all means, make more galettes; the filling also works beautifully stirred into cake batter or sugar cookie dough, or as a filling for crescent rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out a second sheet of the puff pastry and repeat the cutouts, but this time place them on top of the ones with filling. Press down the edges to seal (I used a fork to press down the sides to ensure that they were sealed). Beat the remaining egg with a fork, and lightly brush onto the top of the galettes. Prick several small slits in the top to vent steam while baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in a preheated oven for about 15 minutes or until puffy and golden on the sides and top. Try to avoid opening the oven during baking (ideally an oven with a window works best) to ensure that the pastry puffs nicely.</p>"}]}