{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100402-seasian-chickenrendang.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Asian", "keywords": ["chicken", "Malaysian", "poultry", "rendang", "Seriously Asian", "Seriously Malaysian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Chicken Rendang", "link": "https://www.seriouseats.com/recipes/2010/04/chicken-rendang-recipe.html", "description": "[Photograph: Chichi Wang]...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Asian", "Chicken"], "recipeIngredient": ["2 thick stalks fresh lemongrass, de-stemmed with the bristly tops cut off", "5 medium sized shallots, coarsely chopped", "3 cloves garlic, coarsely chopped", "1 piece turmeric, 2 inches long, peeled and coarsely chopped, or 1 1/2 teaspoons ground turmeric", "1 piece galangal, 2 inches long, peeled and thinly sliced", "1 whole chicken, approximately 3 pounds", "3 tablespoons cooking oil, chicken fat, or lard", "2 pieces cinnamon sticks, each 4 inches long", "4 whole star anise", "2 cups coconut milk", "1 teaspoon sugar", "Kaffir limes, finely cut", "Salt to taste, about 1 teaspoon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the paste: Cut the aromatic part of the lemongrass into 1/4-inch thick slices. Place the cut lemongrass, shallots, garlic, turmeric, galangal, and chilies in a small food processor. Pulse until the consistency is chunky-smooth, adding a teaspoon or so of water if necessary to get the paste moving along.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the chicken into a dozen or so pieces and pat dry with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a shallow skillet (nonstick is best) over medium heat. Add the cinnamon and star anise, stirring it around for a minute. Add the paste and sauté for one to two minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the coconut milk, sugar, lime leaves, and salt. Bring to a gentle boil, then simmer for 20 minutes or so, until the liquid has reduced by 1/4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken to the coconut milk mixture and stir well to combine. Continue to simmer, uncovered, stirring every 20 minutes of so to prevent the chicken from sticking too much to the bottom of the pan. (A little crust building at the bottom of the pot is desirable.) Simmer for 1 1/2 hours, until the liquid has mostly reduced and the coconut oil is bubbling in the pot. Salt to taste, about 1 teaspoon.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to very low and brown the chicken in the coconut oil, stirring every 5 minutes. Take care not to break up the pieces of chicken, which will be extremely tender. Continue sautéing the chicken in the oil until the surface is a golden brown. This will take about 15 to 20 minutes. If there is too much oil left in the pan, depending on how rich your coconut milk was, remove the excess oil. (Do NOT discard the oil—it is delicious and flavorful, and exceptionally good for sauteing potatoes or other meats.) Let the dish rest for a few minutes, then serve.</p>"}]}