{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100307quiche.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "eggs", "pies", "quiches", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Simply Perfect Quiche", "link": "https://www.seriouseats.com/recipes/2010/03/sunday-brunch-simply-perfect-quiche-tartine-san-francisco-recipe.html", "description": "Tartine's quiche recipe is, unsurprisingly, simple but perfect. The incorporation of crème fraîche makes the custard irresistibly tastier and fluffier, almost like a savory dessert. Keeping the flavoring to thyme, salt, and pepper allows you really to appreciate the eggs and crust. You can, of course, use any unsweetened pastry crust to make quiche, but I thought this generous recipe worked particularly well.", "totalTime": null, "recipeYield": "6 to 8", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Quiche"], "recipeIngredient": ["Fully baked and cooled tart shell baked in a 10-inch ceramic quiche dish, deep 10-inch tart pan, or 10-inch pie pan", "5 large eggs", "3 tablespoons flour", "1 cup crème fraîche", "1 cup whole milk", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "1 tablespoon fresh thyme, finely chopped", "1 teaspoon salt", "2/3 cup water, very cold", "3 cups + 2 tablespoons (1 pound) all-purpose flour ", "1 cup + 5 tablespoons (10 1/2 ounces) unsalted butter, very cold"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have the pie shell ready for filling. Preheat the oven to 375°.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 1 egg and the flour in the bowl of a stand mixer or a large mixing bowl and mix at high speed or by hand with a whisk until smooth (I used a handheld mixer in a large bowl). Mix or whisk in the remaining 4 eggs until blended. In a medium bowl, whisk the crème fraîche until it is perfectly smooth and then whisk in the milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the egg mixture through a fine-mesh sieve held over the milk mixture. Whisk in the salt, pepper, and thyme. (You can prepare the custard up to 4 days in advance before baking; cover and refrigerate. The flour, thyme, and pepper will settle to the bottom of the storage container and might stick to it, so whisk well before using.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the egg mixture into the pastry shell. Put in the oven and bake for 10 minutes. Reduce the oven temperature to 325° and bake until the filling is just set, about 30 minutes longer (for me it was 40 minutes). When touched, the center of the quiche should feel slightly firm, not liquidy. Let cool on a wire rack for at least 20 minutes to allow the custard to set up, so that it will slice neatly. Serve warm or at room temperature. To reheat a fully cooled quiche, cover with foil and bake at 325 for about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Flaky Tart Dough</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>-two 9-inch or 10-inch tart or pie shells-</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the salt into the water until dissolved. Chop the butter into small pieces (1/2 to 1 inch). I stash the water and butter in the freezer for 20-30 minutes before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the top off the processor, sprinkle the flour-butter mixture with about half of the very cold water, replace the top, and pulse a couple of times. Then add the rest of the water and pulse until the dough begins to come together into a ball but is not completely smooth. You should still be able to see some butter chunks. (I think it is more common to pour the water through the feed tube with the top on while the processor is running, but that method usually leads me to over-process and still fails to distribute the water evenly.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, divide the dough into 2 equal balls and shape each ball into a disk 1 inch thick. Wrap well and chill for at least 2 hours or up to overnight. I accidentally froze (instead of refrigerating) my dough for 2 hours before rolling out and found it especially easy to work with.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface or between two pieces of parchment paper, roll the chilled dough out 1/8 inch thick, rolling from the center toward the edge in all directions. Work as quickly as you can and give the dough a quarter turn every few strokes to discourage sticking. Carefully transfer the dough to a pie dish or tart pan, easing it into the bottom and sides and then pressing gently into place. Trim or flute exess dough at the rim as you like. Chill until firm to the touch, 30 minutes to 1 hour (or wrap well and chill overnight).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°. Line the chilled shell with parchment paper and fill with pie weights. For a fully baked shell, bake until the surface looks light brown, about 25 minutes (peek under the paper to check). Remove from the oven and remove parchment and pie weights. Return shell to oven and bake until golden brown, about 5 minutes more. Cool completely on wire racks before filling.</p>"}]}