{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100803-dt-farfalle-with-summer-squash.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "pastas", "squash", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Farfalle with Summer Squash", "link": "https://www.seriouseats.com/recipes/2010/08/dinner-tonight-farfalle-with-summer-squash-recipe.html", "description": "This recipe came out of an old school book off the shelf at my wife's parents' house called <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/0452254485/serieats-20\">California Cookbook</a>,</em> a collection of recipes from the <em>Los Angeles Times.</em> I loved the simple headnote: \"A <em>Times</em> staffer had this dish at El Toula in Milan and immediately acquired the recipe.\" <strong>It cooks the squash gently in butter until it begins to soften but is still crisp, then showers it with minced rosemary and cranks up the heat.</strong> The woodsy herb gives it a depth you wouldn't expect, but the dish remains light and simple. It comes together in the time it takes the pasta to boil.", "totalTime": "", "recipeYield": "4-6", "recipeCategory": ["Dinner Tonight", "Vegetarian"], "recipeIngredient": ["1/2 cup butter", "1 clove garlic, minced", "2-3 summer squash (or zucchini), cut into large matchsticks", "1 sprig fresh rosemary leaves, minced", "Salt and pepper to taste", "1 pound farfalle or shells", "2 tablespoons minced fresh parsley", "1/3 cup grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salty water to boil and cook the pasta until al dente.  Reserve 1/2 cup of pasta cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large skillet, melt the butter over medium heat until the foam subsides. Add the summer squash and cook until crisp-tender, then add the garlic, rosemary, and a pinch of salt and pepper. Increase the heat and cook until the flavors come together, but before the squash is too soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the drained pasta to the skillet (or add the squash mixture to the drained pasta if it won't fit) and toss well. Add some pasta cooking water if necessary to create a glossy sauce over low heat. Add the parsley and most of the Parmesan and season to taste with salt and pepper. Serve immediately.</p>"}]}