{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100208converhearts1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Homemade Conversation Hearts", "link": "https://www.seriouseats.com/recipes/2010/02/homemade-conversation-hearts-recipe-how-to-make-candy.html", "description": "Avoid etiquette blunders and tell them how you <em>really</em> feel by <strong>making your own personalized homemade conversation hearts.</strong> They're surprisingly easy to make, just as sweet as the store bought kind, and you have the freedom to set the tone you want&mdash;whether it's sweet, snarky, or confessional.", "totalTime": "", "recipeYield": "over 100 conversation hearts", "recipeCategory": ["Cakespy", "Candy"], "recipeIngredient": ["1 packet (1/4 ounces, or 2 teaspoons) unflavored gelatin", "1/2 cup water", "2 teaspoons light corn syrup", "2 pounds (one bag) confectioners' sugar, plus extra for dusting your work surface", "Assorted flavoring extracts of your choice (I used almond extract)", "Assorted food colors, your choice", "Heart-shaped cutters (whatever size you'd like; I used a set of fondant heart cutters by Wilton in assorted sizes)", "Food coloring markers (I used <a href=\"http://www.amazon.com/Gourmet-Writer-Decorator-Assorted-Colors/dp/B0012DMI1S\">Gourmet Writer Food Pens</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the corn syrup, gelatin, and water in a small microwave-safe bowl. Stir until the gelatin is well-distributed. Microwave the mixture for 30 seconds, so the gelatin dissolves, and stir well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the gelatin mixture into the bowl of a stand mixer fitted with a paddle attachment. Add one cup of confectioners' sugar and turn the mixer to low, mixing until the sugar is incorporated. Scrape down the sides of the bowl to ensure that the sugar all gets mixed in.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to add the remaining confectioners' sugar, one cup at a time, mixing well, until all of the 2 pounds is added. While you're mixing, periodically stop the mixer and scrape down the bottom and sides of the bowl. The mixture will progress from a thin, watery liquid to a glaze-like texture to an extremely thick dough. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all of the sugar is incorporated, dust a work surface (I used a silicone mat) with some of your confectioners' sugar and scrape the candy out onto the work surface. The candy will be very sticky and stiff. Generously dust the top of the ball of candy with confectioners' sugar, and begin to knead the candy like bread dough, folding the ball of dough over onto itself, then use the heel of your hand to push it down. Give the candy a quarter-turn, and repeat the process, dusting it with more confectioners' sugar as often as necessary to prevent it from sticking to the board or your hands. Knead until the candy is no longer sticky, but smooth. The original recipe called the target texture \"satiny\", but I found it kind of like the texture of a pliable clay.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decide how many colors and flavors of conversation hearts you want to make, and divide the candy dough into that many portions. To flavor and color the candy, take one of the balls and flatten it into a palm-sized disc. Add a few drops of food coloring and a small dot of flavoring extract to the center of the disc, and fold it over on itself. (<strong>Note: </strong>It is a good idea to wear disposable plastic gloves during this step, or you will end up with hands that look like they've been tie-dyed). Knead the dough ball, just as you did before, until the color is evenly dispersed throughout the candy, and all streaks have disappeared. Repeat this process with remaining balls of candy dough until all of the bits are colored and flavored. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The mixing of the color and flavor into the dough does take some time. As I finished coloring each ball of dough, I wrapped each securely in plastic wrap so that they wouldn't dry out while I finished the rest.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust your work surface and a rolling pin with confectioners' sugar, and roll out one of the candy balls to your desired thickness. I rolled mine to about 1/3 inch thick for fairly fat little candies, but really, you can roll it to any thickness you like. Be aware that the thinner you roll it, the more fragile the candy will be.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use heart-shaped cutters to cut hearts out of the rolled candy, and transfer the hearts to a baking sheet lined with parchment paper. As the original recipe aptly notes, smaller hearts are more realistic, but larger hearts are easier for writing messages. Once you have cut out your hearts, you can re-roll the scraps to get more shapes out of the candy. Repeat with remaining candy balls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow your hearts to air-dry for at least 24 hours before writing on them. This step is VERY important, because the extra moisture in the hearts will cause the ink to run if you do not let them dry properly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> I tried writing on some hearts at 24 hours and some at 48 hours--while the ones that dried for only 24 hours were fine to write on, the ones that had dried for 48 hours were an even better writing surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the hearts have dried, use the food writing markers to write the messages that come from <em>your</em> heart. Store your conversation hearts in an airtight container at room temperature.</p>"}]}