{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/8.29.10bdayfrenchtoastdip.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["brunch", "cakes", "Cakespy", "desserts", "French toast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "5"}, "name": "Cakespy: Birthday Cake French Toast", "link": "https://www.seriouseats.com/recipes/2010/08/cakespy-birthday-cake-french-toast-recipe.html", "description": "Say hello to your new best friend, <strong>Birthday Cake French Toast.</strong> This recipe breathes new life into birthday cake that is past its prime, making use of the dry texture to absorb a rich, eggy mixture, which is then pan-fried (frosting and all) to yield a new breed of French toast that's beyond decadent. In the tradition of over-the-top morning foods such as <a href=\"http://www.seriouseats.com/recipes/2010/03/cakespy-cadbury-creme-eggs-benedict-dessert-breakfast-recipe.html\">Cadbury Creme Eggs Benedict</a>, this makes for a sugar bomb of a plate, tasting far better than it has any right to, in a so-bad-it's-good sort of way.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cakes", "Cakespy", "French Toast"], "recipeIngredient": ["6 to 8 slices leftover birthday cake, chilled in the refrigerator overnight", "4 eggs", "1/2 cup milk or light cream", "3 tablespoons sugar", "Dash of cinnamon or other spices, to taste", "2 to 4 tablespoons butter, for frying", "Confectioners' sugar glaze or sprinkles, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk the eggs, milk or cream, sugar, and any spices you'd like to add, until the mixture is fully combined and lightly frothy on the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove your cake from the refrigerator. It will work if you haven't chilled your cake too, but chilling it overnight keeps the frosting from melting all over when you pan fry the cake. Slice the cake into thick slices. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 2 to 4 tablespoons of butter into your frying pan. Heat the burner to medium-high, and let the butter melt. Once it is lightly bubbling, you're ready to start frying your cake slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip each cake slice in your egg mixture, coating it fully on both sides (go ahead and submerge each slice). Place the dipped slice directly in the frying pan; depending on the size of your pan, add 2 or 3 slices at one time. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let each slice fry for a minute or so, until it is lightly coming up on the sides (you can lift a side gently with a spatula to see if it is browning). Turn over and repeat on the opposite side, being sure to turn gently so that you don't let the frosting smear across the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the pan and transfer to a serving platter or directly to plates. Repeat with the remaining slices until you've finished them all. If desired, top with a confectioners' sugar glaze and sprinkles. Serve immediately.</p>"}]}