{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100412%20walnutbread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["apricot", "baking", "bread", "bread baking", "nuts", "thanksgiving", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Walnut Apricot Bread", "link": "https://www.seriouseats.com/recipes/2010/04/bread-baking-walnut-apricot-bread-recipe.html", "description": "I wasn't in the mood for sweet, sticky, chunky, nutty rolls. But when I thought about the flavor of walnuts, they seemed like they'd add an interesting flavor component to the loaf without overwhelming it. Rather than adding sugar, I wanted to go with a natural sweetness&mdash;that's where the Turkish apricots came in.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Apricot", "Bread", "Bread Baking", "Nuts"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons (1 package) yeast", "2 1/2 cups bread flour, divided", "1 cup raw walnuts", "14 dried pitted apricots (I used Turkish)", "1 tablespoon olive oil", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the water, yeast, and one cup of the bread flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the walnuts, apricots and olive oil into your food processor, blender, or other capable device, and process it until it is a mostly smooth homogeneous mixture. This should make about a cup, but a little more or less is fine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By the time the walnut mixture is smooth, the flour mixture should be bubbly. Add the rest of the bread flour and the salt to the flour mixture, and knead with the dough hook until it begins to come together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the walnut mixture to the dough, including all the liquid that may be separating from the walnuts. Knead until the mixture has incorporated fully into the dough and it starts becoming smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the mixer and let the dough rest for 10-15 minutes before continuing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the rest, continue kneading with the dough hook until the dough is smooth, shiny and elastic. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the mixer, form the dough into a ball. It shouldn't be sticky at all at this point. Put the dough ball back into he mixer bowl, cover the bowl with plastic wrap, and let it rest until doubled in size, about an hour and a half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle a baking sheet with cornmeal and preheat the oven to 350 degrees. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the dough out of the bowl, knead it briefly, and form into a tight ball. Place it, seam-side down, on the baking sheet. Cover the dough loosely with plastic wrap and set it aside to rise until doubled, about 30 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, slash the top. Be decorative if you want, or just slash an \"X\" in the top or make parallel lines or a square - whatever you prefer. To recreate the slashes I made, first make the large X in the top of the bread going almost to the base of the dough, then make short slashes in-between the long ones. Use small, sharp scissors to make tiny snips around the short slashes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 40 to 45 minutes. If it seems to be browning too fast, turn the oven temperature down to 325°F. </p>"}]}