{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100405blueribbonduckclub.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bromberg Bros. Blue Ribbon Cookbook", "Bruce Bromberg", "club sandwiches", "Cook the Book", "duck", "duck breast", "Eric Bromberg", "mayonnaise", "raisin bread", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Duck Club Sandwich", "link": "https://www.seriouseats.com/recipes/2010/04/cook-the-book-duck-club-sandwich.html", "description": "While a run-of-the-mill club sandwich might not be something to get worked-up over, the version served at Blue Ribbon certainly is.  Dry, bland turkey is replaced with seared duck breast, crisp and perfectly seasoned on the outside, moist and medium-rare within. A slightly sweet and cinnamony <strong>Raisin Walnut Bread</strong> takes over for bland white bread, and a homemade <strong>Olive Oil Mayonnaise</strong> brings the sandwich all together.", "totalTime": null, "recipeYield": "4 sandwiches", "recipeCategory": ["Bacon", "Bread", "Cook the Book", "Duck", "Other Meats", "Sandwiches"], "recipeIngredient": ["4 (8-ounce) Muscovy duck breasts", "Perfect Roast Seasoning (recipe follows) or kosher salt and freshly ground black pepper", "1/2 cup Olive Oil Mayonnaise (recipe follows) or regular mayonnaise", "12 slices Raisin Walnut Bread (recipe follows) or other raisin bread, toasted", "4 tablespoons crumbled cooked bacon (from 4 slices)", "2 cups shredded iceberg lettuce ", "2 small tomatoes, thinly sliced", "1 small red onion, thinly sliced", "1/4 cup plus 2 tablespoons kosher salt", "3 tablespoons freshly ground black pepper", "1 1/2 teaspoon dried thyme", "1 1/2 teaspoons red wine vinegar", "1/4 teaspoon kosher salt", "1 large egg", "1 large egg yolk", "2 teaspoons Dijon mustard", "3/4 cup canola oil", "1/2 cup extra-virgin olive oil", "Freshly ground black pepper", "1 1/8 teaspoons active dry yeast or 2 ounces fresh yeast", "3 large eggs, lightly beaten", "1/3 cup granulated sugar", "1/4 cup (packed) dark brown sugar", "1/4 cup honey", "5 3/4 cups bread flour", "2 teaspoons kosher salt", "1 1/2 teaspoon ground cinnamon", "8 tablespoons (1 stick) unsalted butter, cubed, at room temperature", "2 cups raisins", "1/2 cup chopped walnuts", "Nonstick cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, score the fat of the duck breasts, taking care not to cut through the meat.  Season the duck generously.  Heat a large skillet over medium-high heat until very hot.  Sear the duck breasts, skin side down, until the skin browns and the fat is rendered, about 8 minutes.  Transfer the duck, skin side up to a rimmed baking sheet.  Roast until a thermometer inserted into the thickest part of the duck registers 140&deg;F (the duck will continue to cook as it cools), about 15 minutes.  Remove from the oven.  Once cool, slice very thin against the grain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the sandwich, spread 1 tablespoon mayonnaise on each of the 4 slices of toast and sprinkle with half of the bacon.  Divide the lettuce evenly among the bread slices, and top each with half of the duck slices.  Top with a second layer of toast.  Spread the remaining mayonnaise over the slices.  Sprinkle with the remaining bacon.  Top with tomato slices, red onion, and the remaining duck.  Cover the sandwiches with the remaining slices of toast, cut into quarters, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Perfect Roast Seasoning</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 2/3 cup -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the salt, pepper, and thyme and store in a covered container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Olive Oil Mayonnaise</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1 3/4 cups -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the vinegar and salt until the salt dissolves.  Whisk in the egg, egg yolk, and mustard until fully combined.  Whisking constantly and vigorously, very slowly drizzle in the oils until the mixture is fully emulsified and thickened.  Season with pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Raisin Walnut Bread</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1 (9 x 4-inch loaf) -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the of an electric mixer with the hook attachment, combine the yeast with 1 1/2 cups lukewarm water.  Let the mixture stand at room temperature until it starts to foam, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs, both sugars, and honey and mix for several seconds to combine.  Add the flour gradually, mixing on medium speed until the dough starts to come together.  Sprinkle in the salt and cinnamon and continue mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter, cube by cube, and continue mixing.  Once it is fully incorporated, about 10 minutes, add the raisins and walnuts and mix until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease a large bowl with nonstick cooking spray.  Form the dough into a loose ball and place it in the bowl.  Grease plastic wrap and cover the dough loosely.  Allow the dough to rise until doubled in size, 1 1/2 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F.  Lightly grease a 9 x 4-inch loaf pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch down the dough, form into a loaf, and place it in the prepared pan.  Cover it loosely with plastic and let it rest until puffed up to the rim of the pan, about 30 minutes.  Uncover and bake for 50 minutes to 1 hour, or until the top is dark golden brown and the loaf sounds hollow when tapped.  Allow the bread to cool in the pan for 5 minutes before turning out onto a wire cooling rack.</p>"}]}