{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100629-kikkoman-panko1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["fried", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fried Crispy Shrimp Skewers", "link": "https://www.seriouseats.com/recipes/2010/06/fried-crispy-shrimp-skewers.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: After graduating from MIT, J. Kenji Lopez-Alt spent many years as a chef, recipe developer, writer, and editor in Boston. He now lives in New York with his wife. Got a suggestion...", "totalTime": "", "recipeYield": "12 skewers, serving 4-6 as an appetizer", "recipeCategory": ["Deep Frying", "Grilling", "Shrimp"], "recipeIngredient": ["<strong>For the sauce:</strong>", "1/2 cup sugar", "1/2 cup rice vinegar", "1 teaspoon Thai or Vietnamese fish sauce", "1 tablespoon red pepper flakes", "1 clove garlic, minced on microplane", "1 tablespoon juice from 1 lime", "sliced scallions or chives", "<strong>For the shrimp:</strong>", "12 colossal shrimp (about 1 pound), peeled and deveined", "1 cup all-purpose flour", "2 eggs, beaten", "1 1/2 cups panko bread crumbs", "1/4 cup sesame seeds", "1 teaspoon Japanese hot pepper (togarashi) or 1/2 teaspoon cayenne pepper", "Kosher salt and freshly cracked black pepper", "1.5 quarts peanut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>put sugar in small heavy-bottomed saucepot and add 2 tablespoons water to form a wet sand consistency. Cook over high heat until sugar turns a pale golden color, about 5 minutes total. Immediately add vinegar (mixture will bubble rapidly). Add fish sauce, pepper flakes, and garlic, and cook, stirring with a whisk until reduced to 1/2 cup and mixture is slightly syrupy. Remove from heat and allow to cool. Add lime juice and chives. Store sauce in covered container in the fridge for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shrimp flat on cutting board, leg-side down and press down until it lies flat and straight. Insert a wooden skewer from the tail to the head. Shrimp should be as straight as possible on skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a breading station: Put flour in one shallow dish, beaten eggs in second, and combine panko, sesame seeds, pepper, 1 teaspoon salt, and 1/2 teaspoon black pepper in third shallow dish. Working one skewer at a time, dredge lightly in flour and shake off excess. Dip in egg and turn until evenly  coated. Place in bread crumb mixture and press with bread crumbs until well-coated. Repeat with remaining skewers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large wok or Dutch Oven over high heat until it registers 350 degrees on an instant-read thermometer. Add shrimp and cook, flipping and agitating regularly until golden brown and crispy and shrimp is cooked through. Transfer shrimp to paper-towel lined baking sheet and turn to blot out oil. Season with salt. Wipe skewers with clean paper towel. Serve immediately with sauce for dipping.</p>"}]}