{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100523_doughnut.jpg", "author": {"@type": "Person", "name": "Robin Bellinger"}, "recipeCuisine": "", "keywords": ["brunch", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sunday Brunch: Glazed Buttermilk Cake Doughnuts", "link": "https://www.seriouseats.com/recipes/2010/05/sunday-brunch-glazed-buttermilk-cake-doughnut-recipe.html", "description": "All you need to make the best doughnuts you have ever eaten is patience with sticky dough, a frying or candy thermometer, and a willingness to turn a blind eye to the amount of oil it takes to cook them.", "totalTime": null, "recipeYield": "13", "recipeCategory": ["Breakfast and Brunch", "Desserts", "Doughnuts"], "recipeIngredient": ["3/4 cup buttermilk", "1 large egg", "3 large egg yolks", "1/3 cup grapeseed (preferred) or canola oil", "3 3/4 cups cake flour, plus extra for dusting", "1 cup granulated sugar", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1 1/2 teaspoons ground cinnamon", "1/4 teaspoon freshly grated nutmeg", "1 teaspoon kosher salt", "Finely grated zest of 1 lemon", "2 cups confectioners' sugar", "Peanut oil, for frying, enough to pour 2 inches deep in your frying pot"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the buttermilk, egg, egg yolks, and grapeseed or canola oil. Sift 2 cups of the flour into another bowl (or simply put it in the bowl and fluff it up with a whisk).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, combine the remaining 1 3/4 cups flour, the granulated sugar, baking powder, baking soda, cinnamon, nutmeg, salt, and lemon zest. Mix on low speed to combine. Add the buttermilk mixture and continue mixing just until the dough comes together. Remove the bowl from the mixer and use a spatula gently to fold in the 2 cups of flour you set aside. The dough will be very sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a 12 x 14 inch sheet of waxed or parchment paper. Put a second sheet of paper on top and roll the dough between the paper to an 8 x 10 inch oval 3/4 inch thick. Put the dough, still between the sheets of paper, on a baking sheet and freeze until it is firm enough to cut, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the dough from the freezer and remove the top sheet of paper. Dust the dough with flour and replace the paper. Flip the dough over and remove and discard the bottom sheet of paper (which is now on top). Now the dough is loosened from the paper and should be easy to cut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat a baking sheet with nonstick cooking spray or rub with a paper towel dipped in canola oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut out the doughnuts using a floured 3-inch round cutter. Cut out 1-inch centers (I used a knife, since I don't have a cutter that small; this was a pain in the neck but got the job done). Transfer the doughnuts to the prepared baking sheet. Re-roll the scraps and repeat to make a total of 13 doughnuts and 13 holes. Cover with plastic wrap and chill in the refrigerator for at least 30 minutes or up to 1 day. (If making dough ahead, bring it to room temperature before frying. I also experimented with freezing the dough, wrapped in parchment, at this point and defrosting completely before frying; the resulting doughnuts were excellent, but it was very hard to pry the defrosted dough from the parchment paper. I should have transferred the frozen donuts to a greased baking sheet, covered with plastic wrap, and defrosted in the refrigerator.)<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before frying, prepare the glaze by whisking together the confectioners' sugar and 1/4 cup hot water; use a bowl wide enough to dip a donut in. Prepare a plate lined with paper towel for draining the donuts and have your bowl of glaze waiting next to a rack set over a baking sheet (to catch drips).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large high-sided skillet or wide pot (I use my 5-quart Dutch oven), heat 2 inches of oil over a medium high flame until it registers 375°F on a candy or frying thermometer. Fry the doughnuts 3 at a time until golden brown, about 3 minutes total, carefully turning them with a wire skimmer or slotted spoon halfway through. I adjusted the heat to keep the temperature between 365 and 375 when it threatened to climb past 380. Use your skimmer to remove the doughnuts to the paper towel-lined plate to drain for a second and immediately dip one side of each doughnut into the glaze. Put the doughnuts, glaze side up, on the rack; let set until the glaze sets, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry doughnut holes 1 minute per batch. Drain, glaze, and let set. Serve the doughnuts and holes warm or at room temperature on the day they are fried.</p>"}]}