{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100625_mushroom_salad2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["arugula", "cremini mushrooms", "Dinner Tonight", "hazlenuts", "mushroom", "pecorino", "salads", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Dinner Tonight: Warm Mushroom Salad with Hazelnuts and Pecorino", "link": "https://www.seriouseats.com/recipes/2010/06/warm-mushroom-salad-with-hazelnuts-pecorino-recipe.html", "description": "What I really love about this recipe is how it feels totally hedonistic. <strong>The shallots, mushrooms, and pecorino all add meaty undertones to this dish, though no meat is actually involved at all.</strong> But it's still filling, and a perfect main course salad. <strong>Oh, and those hazelnuts.</strong> They provide a pleasing crunch to each bite. I'm glad I had them around.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Dinner Tonight", "Leafy Greens", "Mushrooms", "Salads", "Vegetarian"], "recipeIngredient": ["1/4 cup hazelnuts", "1 tablespoon shallots, diced", "1 1/2 tablespoons sherry vinegar", "4 1/2 tablespoons extra-virgin olive oil ", "1 pound cremini mushrooms, cleaned, stems removed, and thinly sliced", "1 tablespoons butter", "3 ounces greens (like arugula or frisé)", "1/2 cup fresh herbs (like chives, tarragon, or parsley)", "1/2 teaspoon fresh thyme, chopped", "2 tablespoons shallots, sliced", "1/8 pound pecorino, thinly shaved ", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Scatter the hazelnuts on a baking sheet and place in the oven for 8 to 10 minutes, or until toasted. Shake every other minute or so. When done, transfer to a towel and rub off the skins. Let cool, and then roughly chop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the diced shallots, sherry vinegar, and 1/4 teaspoon of salt in a bowl. Let sit for five minutes. Then slowly whisk in 2 1/2 tablespoons of the oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rest of the oil into a large skillet set over medium-high heat. Add 1/2 tablespoon of butter. When the butters starts to foam, add half of the mushrooms, along with half the thyme. Season with salt and pepper. Cook for 5 minutes, stirring often, until soft. Transfer the mushrooms to a bowl and repeat process with the other half of the mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the second batch of mushrooms is done, return the first batch along with the sliced shallots. Cook for two minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the greens on a platter. Add the herbs, and then the hot mushrooms and shallots. In the now empty skillet, pour in three-quarters of the vinaigrette. Stir it well, until it warms from the residual heat in the pan. Season the dressing with salt and pepper to taste. Then pour it over the salad. Top with the shaved cheese and chopped hazelnuts. </p>"}]}