{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100628_steak_eggs2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "eggs", "hanger steak", "paprika", "smoked paprika", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Steak and Eggs with Smoked Paprika", "link": "https://www.seriouseats.com/recipes/2010/06/steak-and-eggs-with-smoked-paprika-recipe.html", "description": "Google <strong>\"steak and eggs\"</strong> and it's kind of amazing what doesn't pop up. I was expecting hundreds of crazy renditions of this gluttonous breakfast classic. But most of them were shockingly traditional, if also kind of boring. <strong>But perhaps when you combine steak and eggs you don't really need anything else.</strong> The egg yolk is already a perfect sauce, and a well seasoned steak is a thing of utter beauty.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Beef", "Breakfast and Brunch", "Dinner Tonight", "Eggs"], "recipeIngredient": ["2 Yukon gold potatoes, skinned and cubed into 1/2 inch pieces ", "4 tablespoons butter ", "Salt and pepper", "Smoked paprika ", "1/2 pound hanger steak ", "1 tablespoon canola oil ", "2 eggs "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the potatoes to a large bowl along with 1 tablespoon of the butter and a pinch of salt. Cover with plastic wrap and set in the microwave for 6 minutes. Shake the bowl halfway through, being careful because the bowl with be hot. Before removing the bowl from the microwave, puncture the plastic wrap with a knife, and let the steam escape. After a few seconds, carefully remove the potatoes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoon of the butter in a nonstick skillet set over medium heat. When melted, add the potatoes. Pack them down with a spatula, until as many as possible are in a single layer. Cook for 5 to 7 minutes, or until browned. Flip, pack down again, and cook for another 5 to 7 minutes. Then reduce heat to medium low, and stir the potatoes every minute or so, until beautifully golden brown and crispy. Season to taste with salt and pepper. Remove and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the canola oil into a large skillet set over medium-high heat. Season the steak with salt and pepper to taste. Add the hanger steak. Brown on both sides, and cook for about 6 minutes total for medium rare. Remove the steak, and let set for five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the butter to the nonstick skillet set over medium heat. When melted, carefully slide in the eggs. Cover the skillet and turn the heat to medium-low. Cook until the egg whites have set. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add some of the hash browns to a plate. Sprinkle on some smoked paprika. Top the potatoes with the egg. Serve the steak along the side. Add more paprika to taste and season with salt and pepper to taste.  </p>"}]}