{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100621-dt-garlic-scape-pesto.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["garlic scapes", "inexpensive", "pesto", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pasta with Garlic Scape and Basil Pesto", "link": "https://www.seriouseats.com/recipes/2010/06/dinner-tonight-pasta-with-garlic-scape-and-basil-pesto-recipe.html", "description": "Around for just a short season, garlic scapes are one of those ingredients that you'll probably only find from a local farmer.  Curly and funny-looking, the sprouts are harvested when tender and young and have become a rather popular ingredient in stir-fries and, in this case, as the base for a unique kind of pesto.  The flavor of the scape is garlicky but not nearly as pungent as the bulb growing beneath.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Dinner Tonight", "Garlic", "Mains", "Pesto", "Vegetarian"], "recipeIngredient": ["4 to 5 garlic scapes, roughly chopped", "Large handful basil leaves", "1/4 cup almonds, toasted in a dry skillet until slightly browned", "1/2 cup olive oil", "1/2 cup Parmesan cheese", "1/2 teaspoon salt", "1 pound linguine or other pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic scapes, basil, and half the oil in a small food processor or blender.  Process or blend until the leaves and scapes are finely chopped, then add the nuts and remaining oil.  Process or blend until nicely pureed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove to a bowl and stir in the cheese.  If necessary, add more olive oil to create a loose paste. Season with more salt if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a large pot of salty water to boil and cook the pasta until al dente.  Drain, reserving 1 cup of the pasta water, and toss with the pesto.  If necessary, add some of the pasta water to create a creamy texture.  Serve with more grated Parmesan cheese.</p>"}]}