{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100831turkishlambkebabs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grill", "grilling", "kebabs", "lamb", "Planet Barbecue", "skewer", "Steven Raichlen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Ground Lamb Kebabs with Turkish Hot Peppers", "link": "https://www.seriouseats.com/recipes/2010/08/cook-the-book-ground-lamb-kebabs-with-turkish.html", "description": "[Photograph: Caroline Russock] Every night this summer when the temperatures have risen to cooking-prohibitive territory I've turned to my local Turkish delivery joint and ordered plates of Adana kebab served with grilled flat bread, a lemony cucumber and tomato salad,...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Cook the Book", "Lamb"], "recipeIngredient": ["<strong>For the Ground Lamb Kebabs</strong>:", "1 to 2 tablespoons Aleppo pepper, or 1 to 3 teaspoons hot red pepper flakes and 2 teaspoons fresh lemon juice", "1 1/2  pounds finely chopped ground lamb", "1/4 cup finely chopped fresh flat-leaf parsley", "1 tablespoon sweet or hot paprika, preferably Turkish", "1 1/2 teaspoons coarse salt (kosher or sea)", "1/2 teaspoon freshly ground black pepper", "2 large or 4 small pieces of lavash, for serving", "<strong>For the Onion Relish:</strong>", "1 red onion, cut in half lengthwise and thinly sliced crosswise", "1 teaspoon coarse salt (kosher or sea)", "1 bunch fresh flat-leaf parsley, coarsely chopped", "2 tablespoons sumac powder, or 1 tablespoon fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ground Lamb Kebabs:</strong> Place the Aleppo pepper in a small bowl with 1 tablespoon of hot water. Let stand until pastelike, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ground lamb in a mixing bowl. Add the pepper paste, parsley, paprika, salt, and black pepper. After lightly wetting your hands with cold water, knead the lamb mixture together by hand, squeezing out any air bubbles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the lamb mixture into 4 equal portions. Mold the lamb mixture onto the skewers to make flat skinless sausages that are about 7 inches long, 1 inch wide, and A inch thick, pinching the meat with your thumb, middle finger, and ring finger. Place the kebabs on a baking dish with raised sides, or on a platter lined with plastic wrap. Refrigerate the kebabs, covered, until you are ready to grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up the grill for direct grilling and preheat it to high. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, brush and generously oil the grill grate, if using. Arrange the kebabs over the heat and grill them until browned outside and cooked to taste, 3 to 4 minutes per side for medium. (Turks prefer their meat well-cooked.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the lavash to protect your hands, slide the grilled kebabs off the skewers onto a platter or plates. Blot the lamb fat off the kebabs onto the lavash, then grill it until lightly toasted, 1 to 2 minutes per side, turning with tongs. Watch the lavash; it can burn quickly. Cut the toasted lavash into 4-inch squares for serving with the lamb, and serve at once with the onion relish on the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Onion Relish:</strong> Place the onion in a mixing bowl lined with a clean cotton dish towel. Add the salt and toss to mix. Let the onion mixture stand for about 5 minutes. Working over the bowl, squeeze the onion as tightly as possible by gathering up and twisting the ends of the dish cloth to wring out the onion juice. Set the onion water aside for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the onion, parsley, and sumac in a mixing bowl and toss to mix. Serve the relish within 1 hour of mixing.  </p>"}]}