{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100512shrimpsummerrolls.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "rice", "rice paper", "shrimp", "shrimp rolls", "The Gloriously Gluten-Free Cookbook", "Vanessa Maltin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Shrimp and Mint Summer Rolls", "link": "https://www.seriouseats.com/recipes/2010/05/shrimp-and-mint-summer-rolls-gluten-free-recipe.html", "description": "These <strong>Shrimp and Mint Summer Rolls</strong> from <em><a href=\"http://www.amazon.com/Gloriously-Gluten-Free-Cookbook-Spicing-Italian/dp/0470440880/serieats-20\">The Gloriously Gluten-Free Cookbook</a></em> by <a href=\"http://www.beyondricecakes.com/about.html\">Vanessa Maltin</a> are a testament to the incredible grain that is rice.  When ground into a flour, rice can be transformed into sheer, pleasantly chewy wrappers and wonderfully fresh noodles to make these summer rolls.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cook the Book", "Grilling", "Rice", "Shrimp"], "recipeIngredient": ["<strong>For the dipping sauce:</strong>", "1/4 cup fresh lime juice", "1/4 cup sugar", "1/4 cup Thai fish sauce", "1 teaspoon minced Thai chiles (or to taste, optional)", "1 garlic clove, minced", "3 tablespoons finely shredded carrots", "1/4 cup warm water", "<strong>For the rolls:</strong>", "2 ounces thin rice noodles, (about 1 cup cooked)", "12 (8 1/2-inch) round rice paper wrappers", "12 large shrimp, peeled, deveined, cooked, and cut in half lengthwise", "1 cup peeled seedless cucumber, sliced into thin strips", "1/4 cup carrots, sliced into thin strips", "1/4 cup fresh mint leaves", "12 pieces fresh green leaf lettuce (3 by 5 inches), cut along the rib and rib removed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the lime juice, sugar, fish sauce, chile, and garlic and stir until the sugar is dissolved. Stir in the carrots. Add the warm water as needed to dilute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>n a large pot, bring 6 cups of salted water to a boil. Cook the rice noodles until softened, 2 to 4 minutes. Drain and rinse with cold water. Shake off the excess water and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread a damp clean towel on a counter. Fill a pan with hot water. (Keep a bowl of hot water next to the pan and towel, as you will need to occasionally refill the pan with water.) Arrange all the ingredients within reach.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the pan of hot water, dip one sheet of rice paper to wet it completely. Set the paper on the damp towel; the rice paper should become soft and pliable immediately. Arrange 2 pieces of shrimp in a horizontal line on the bottom third (2 1/2 inches from the bottom and 1 inch from right-hand side) of the rice paper wrapper. Place a small portion of rice noodles over the shrimp. Distribute some cucumber, carrots, and 4 to 5 mint leaves over the noodles. Place one lettuce leaf over the mint leaves. Fold the bottom half of the rice paper wrapper over filling, while using your fingers to press down on the ingredients. Fold the right-hand side of the rice paper over to enclose the ingredients at the bottom of the roll.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pressing gently on the ingredients with your fingers, tuck in the ends, and gently roll the rice paper up tightly to form a cylinder. Repeat these steps to make the remaining spring rolls. Serve immediately with the dipping sauce.</p>"}]}