{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100503-nastybits-shoulder.JPG", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["pig tails", "pork", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Deep Fried Pig's Tails, Revised", "link": "https://www.seriouseats.com/recipes/2010/05/offal-deep-fried-pigs-tails-recipe.html", "description": "Read more about frying pigs tails and breaking down a pig here....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Mains", "Pork", "The Nasty Bits"], "recipeIngredient": ["6 dozen pigs tails", "2 quarts water, or enough to cover the tails", "1/2 onion, roughly chopped", "3 cloves garlic, smashed", "1/2 cup dry white wine or sake", "<strong>For seasoning the broth</strong>", "1 bouquet garni and 1 bay leaf, or 2 tablespoons each of soy sauce and fish sauce", "2 quarts canola oil, for deep-frying", "<strong>For dressing the tails</strong>", "1 teaspoon vinegar of your choice", "2 teaspoons soy sauce", "1/2 teaspoon sugar", "1/2 teaspoon chili oil, or to taste", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all the oil in a deep wok or narrow and tall pot. Bring the oil to 350&deg;F. Make sure the tails have been blotted for moisture, then add them to the pot one by one&mdash;as many as will comfortably fit in your vessel. Deep-fry the tails for 5 minutes, until the skins are golden brown. Remove the tails from the hot oil. Keep the oil in the wok for now.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tails in a soup pot and add enough water to the pot to cover. Then add the aromatics and bring the pot to a boil. Reduce the water to a steady simmer and cook for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tails from the pot and place onto a rack to drain.  Reserve the stock for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring the wok of oil to 350&deg;F again. When the oil has reached the proper temperature, slip one to three tails into the oil (depending on the size of the vessel) and immediately cover the wok with a lid. You will hear quite a bit of bubbling for the first 30 to 60 seconds. After two minutes, lift the lid and check on the progress of the tails, turning them over in the oil if necessary. In all, it should take around 4 minutes for the tails to become golden brown. Carefully remove the tails from the bubbling oil, taking care not to squeeze the tails in case residual moisture seeps out and makes contact with the oil. Repeat with the remaining tails. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all the ingredients for the dressing in a large and shallow bowl and toss the tails in the dressing. Serve immediately.</p>"}]}