{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100415cookthebookpizzaingredients.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Mario Batali", "Mark Ladner", "Molto Gusto", "Otto", "peppers", "piquillo peppers", "pizza @pizzarecipes", "pizza dough", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pizza with Sausage &amp; Peppers", "link": "https://www.seriouseats.com/recipes/2010/04/pizza-with-sausage-and-peppers-recipe.html", "description": "In <em><a href=\"http://www.amazon.com/Molto-Gusto-Easy-Italian-Cooking/dp/0061924326/serieats-20\">Molto Gusto</a></em> by <a href=\"http://www.mariobatali.com/about_mario.cfm\">Mario Batali</a> and <a href=\"http://www.luparestaurant.com/restaurant-chef.html\">Mark Ladner</a>, the par-baking method of pizza making that is employed at Otto is broken down for the home kitchen. The recipes I tested ended being some of the most picturesque and tasty pizzas that have ever come out of my oven.", "totalTime": null, "recipeYield": "enough topping for one 9- to 10-inch pizza", "recipeCategory": ["Bread", "Cook the Book"], "recipeIngredient": ["One par-baked pizza crust (recipe follows)", "3 ounces sweet or hot Italian sausage (about 1/2 large link), casing removed", "<strong>Peppers</strong>", "1 tablespoon extra virgin olive oil", "1 garlic clove, slivered", "1 teaspoon salt-packed capers, rinsed and soaked overnight in cold water (change the water often)", "1 teaspoon balsamic vinegar", "Maldon or other flaky sea salt", "Generous pinch of hot red pepper flakes, or to taste", "2 1/2 medium piquillo peppers, drained well and quartered lengthwise", "1/4 cup <a href=http://www.pomionline.it/\">Pomì</a> strained tomatoes", "1/4 cup shredded fresh mozzarella", "1/4 cup shredded cacio di Roma", "1 1/4 cups warm water (95°F)", "One 1/4-ounce package active dry yeast", "1 1/2 teaspoons sugar", "3 1/2 cups \"00\" flour", "Scant 2 tablespoons salt", "1/4 cup extra virgin olive oil", "Semolina for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble the sausage into a small sauté pan and cook over medium heat, stirring occasionally and breaking up any lumps, until golden brown, about 8 minutes. Using a slotted spoon, transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the oil and garlic in a small sauté pan and cook over medium-low heat just until the garlic is barely golden, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the capers and balsamic vinegar in a small bowl and whisk in the garlic and oil. Season with salt to taste and the red pepper flakes. Add the peppers, stirring gently to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the tomato sauce evenly over the par-baked pizza crust, leaving a 1/2-inch border. Scatter the sausage over the sauce and arrange the peppers on top. Scatter the cheeses evenly over the pizza. Broil as directed, then cut into 6 slices and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a name=\"dough\"></a><h4>Pizza Dough</h4></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 2 pounds -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the warm water, yeast, and sugar together in a bowl. Let stand in a warm place for 10 minutes, or until the yeast is foamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour and salt in the bowl of a stand mixer fitted with the dough hook and mix well. With the mixer on low, add the yeast mixture and oil, mixing well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to mix, gradually increasing the mixer speed to medium-high, until the dough is smooth and elastic. Transfer the dough to a lightly floured surface and give it a few turns by hand to finish kneading it; it will still be slightly sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternatively, combine the flour and salt in a large bowl and whisk together. Make a well in the center of the dry ingredients and add the yeast mixture and oil. Using a wooden spoon, stir the wet ingredients into the dry ingredients until the mixture is too stiff to stir, then mix with your hands in the bowl until the dough comes together and pulls away from the sides of the bowl. Turn the dough out onto a lightly floured work surface and knead, adding only as much flour as necessary to prevent sticking, until smooth, elastic, and only slightly sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a large oiled bowl, turning to coat, cover with a kitchen towel or plastic wrap, and let rise in a warm place for 1 to 1 1/2 hours, until doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch down the dough and turn it out onto a well-floured work surface. Divide it into 8 pieces (about 4 ounces each) and shape each one into a ball. Cover with a tea towel and let stand for 15 minutes before stretching the dough. Or, for easier handling, transfer the balls to a floured baking sheet and refrigerate until cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust a large work surface with a mixture of flour and semolina. If the dough has been refrigerated, transfer one ball to the work surface and let stand just until still cool but not cold (about 60°F if tested with an instant-read thermometer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the griddle pan over medium heat until very hot, about 5 minutes (at the restaurant, we use a digital infrared thermometer to gauge the temperature of the griddle, which, ideally, should be 375°F).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands, begin to press and stretch the dough into a 9- to 10-inch round, adding only enough additional flour and semolina to the work surface to keep the dough from sticking; using one hand as a guide, slope a slightly thicker rim all around the circle of dough. Work quickly, and be careful not to overwork the dough; if it resists or shrinks back as you shape it, let it rest briefly before proceeding. (If you prefer, you can roll out the dough with a rolling pin. Lightly flour the work surface and the rolling pin; sprinkle the rolling pin with more flour as necessary to prevent sticking.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully place the dough round on the preheated griddle pan and cook until barely tan on the first side and browned in a few spots, 2 to 3 minutes. As the crust cooks, if you see any parts that remain undercooked, especially any thicker parts, simply press them against the pan so they cook a bit more; once the dough has set, you can move the crust around as necessary for more even cooking. Flip the crust over and cook until the second side is completely dry, about 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>We recommend making only one pizza at a time and serving each one as soon as it is done. If you need to make a lot for a large party, cook several of them once (slightly undercook them) and then reheat them in a warm oven before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the parbaked pizza crust on a pizza peel or baking sheet. Spread the tomato sauce evenly over the crust, leaving a 1/2-inch border all around, and top with any remaining ingredients as specified in the individual recipe. (Do not put the sauce and any other ingredients on the pizza crust until ready to broil it, or the crust may become soggy.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the pizza under the broiler, about 4 inches from the heat source, and broil for 7 or 8 minutes (or as otherwise noted in the individual recipe), until the topping ingredients are heated and/or cooked through and the crust is charred and blistered in spots.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": null}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finish the pizza with any remaining ingredients, as described in the individual recipe, and cut into slices with a pizza wheel, kitchen shears, or a very sharp knife. Serve hot.</p>"}]}