{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "healthy and delicious", "Jamie Oliver", "Jamie's Food Revolution"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Perfect Roast Chicken", "link": "https://www.seriouseats.com/recipes/2010/01/perfect-roast-chicken-recipe.html", "description": "A good roasted chicken is one of the great pleasures in life, but I probably don't need to tell you that. It can be a great weeknight meal or the centerpiece for a special occasion. It's simple, elegant, entirely satisfying,...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["1 approximately 3 1/2 to 4 pound chicken, preferably free-range, organic or higher welfare", "2 medium onions", "2 carrots", "2 stalks celery", "1 bulb of garlic", "Olive oil", "Sea salt and freshly ground black pepper", "1 lemon", "A small bunch of fresh thyme, rosemary, bay, or sage, or a mixture"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare your chicken: </strong>Take your chicken out of the refrigerator 30 minutes before it goes into the oven. Preheat your oven to 475&deg;F. There's no need to peel the vegetables&mdash;just give them a wash and roughly chop them. Break the garlic bulb into cloves, leaving them unpeeled. Pile all the vegetables and garlic into the middle of a large roasting pan and drizzle with olive oil. Drizzle the chicken with olive oil and season well with salt and pepper, rubbing it all over the bird. Carefully prick the lemon all over, using the tip of a sharp knife (if you have a microwave, you could pop the lemon in there for 40 seconds at this point as this will really bring out the flavor.  Put the lemon inside the chicken's cavity, with the bunch of herbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken on top of the vegetables in the roasting pan and put it into the preheated oven. Turn the heat down immediately to 400&deg;F and cook the chicken for 1 hour and 20 minutes. Baste the chicken halfway through cooking and if the vegetables look dry, add a splash of water to the pan to stop them burning. When cooked, take the pan out of the oven and transfer the chicken to a board to rest for 15 minutes or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove any string from the chicken and take off the wings. Carefully cut down between the leg and the breast. Cut through the joint and pull the leg off. Repeat on the other side, then cut each leg between the thigh and drumstick you so end up with four portions of dark meat. Place these on a serving platter.  You should now have a clear space to carve the rest of your chicken. Angle the knife along the breastbone and carve one side off, then the other. When you get down to the fussy bits, use your fingers to pull the meat off, then turn the chicken over to get all the tasty, juicy bits from underneath. You should be left with a stripped carcass, and a platter full of lovely meat that you can serve with piping hot gravy, and roasted vegetables.  </p>"}]}