{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101202amaretti.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "Chewy Gooey Crispy Crunchy Melt-in-Your-Mouth Cookies", "Cook the Book", "Cookies", "holiday baking", "meringues", "Super Bowl desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Bake the Book: Amaretti", "link": "https://www.seriouseats.com/recipes/2010/12/cook-the-book-amaretti-cookies-recipe.html", "description": "The recipe began eerily similar to <em>macarons</em>: the almonds and confectioners' sugar whirred together to make a light, floury powder instead of a dense paste. When the egg whites were mixed in, the batter held its airiness. Piped onto the cookie sheets, the soft, peaked domes baked perfectly&mdash;puffed-up and crisp on the outside with that perfect chewy-meets-light inside, plus a super charged almond flavor from the ground almonds and extract.", "totalTime": "1 hour", "recipeYield": "90 cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["1 2/3 cups (8 ounces) blanched almonds", "2 cups (8 ounces) powdered sugar", "1/2 cup egg whites (from about 4 large eggs), at room temperature", "1/4 teaspoon cream of tartar ", "2 teaspoons almond extract", "1/2 cup (3.5 ounces) granulated sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300°F.  Position racks in the lower and upper thirds of the oven.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the almonds and powdered sugar in a food processor. Process until the almonds are finely ground, pulsing to avoid turning the mixture into a paste and scraping the sides as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, beat the egg whites with the cream of tartar until soft peaks form when the beaters are lifted.  Add the almond extract and continue to beat, gradually adding granulated sugar, until the egg whites are fluffy and very stiff with a dull sheen.  Pour the almond mixture over the meringue. Fold with a large rubber spatula just until the dry mixture is fully incorporated. Scrape the batter into the pastry bag.  Pipe low domes about 1 1/2 inches in diameter and 3/4 inches high, 1 inch apart, on the lined cookie sheets.  If your domes are pointy, smooth them with a wet finger. Without a pastry bag, use a spoon to scoop tablespoons of batter 1 inch apart onto the pans.  While the first two pans are baking, pipe or scoop any remaining batter immediately onto a third lined sheet or onto a parchment liner to be transferred to a baking sheet when the oven is free.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 30 to 35 minutes, until the cookies are golden. (Or, if you prefer them crunchy on the outside and a little soft and chewy within instead of thoroughly crunchy, bake them for only 12 minutes at 350°F.)  Rotate the pans from top to bottom and from front to back halfway through the baking time to ensure even baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pans or just the liners on racks to cool. Let the cookies cool completely before storing.  Repeat with the remaining cookies.  May be kept in an airtight container for weeks.</p>"}]}