{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100816duck.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["duck", "grains of paradise", "poultry", "Spice Hunting", "spices"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Duck of Paradise", "link": "https://www.seriouseats.com/recipes/2010/08/duck-of-paradise-pan-seared-duck-breast-recipe.html", "description": "[Photograph: Sam Sobolewski] Duck is the perfect creative canvas for the home cook. It can be prepared simply or gussied up&mdash;wherever your whims may take you. This relatively straightforward pan-seared duck breast is enlivened by my favorite homemade spice rub,...", "totalTime": "40 minutes", "recipeYield": "2-3", "recipeCategory": ["Duck", "Mains", "Other Meats"], "recipeIngredient": ["2 duck breasts", "1 tablespoon of grains of paradise, toasted and ground", "1 tablespoon of coriander, toasted and ground", "1 tablespoon of kosher salt, plus more as needed", "1 tablespoon turbinado sugar (or other coarse raw sugar)", "Zest of one lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the spices, sugar, salt, and lime zest in a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently slice just through the skin on the duck breasts three or four times, only far enough to expose some fat. Apply a couple small pinches of the rub on each side of the breast, along with some extra salt (this allows you to moderate how much salt you need). You only need a bit&mdash;too much rub on the outside will burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a sharp paring knife, slice in between the layer of fat and meat on the breasts, leaving one long side attached to create a hinge. \"Unfold\" your duck breasts and liberally work the rub into the meat, again with some extra salt. The meat here should be fully covered in rub. By keeping most of the rub beneath the skin you prevent it from burning and allow it to directly season the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the breasts sit for about half an hour. Then heat a cast iron skillet on medium-high heat. Pat the duck breasts dry with some paper towel. When hot (but not ripping hot, or the skin will burn and you'll have to remove it), add the breasts, skin side down. Cover them with the other skillet, which creates even contact with the pan and will prevent the skin from curling up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After a few minutes (two to five, depending on the heat and thickness of your breasts), lift up a corner of the breasts and check the skin. If it's anything less than dark brown, leave it for another minute or two. If done, flip the breasts over and cook them for another few minutes, again covered with the other skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To check the meat for doneness, remove it to a plate and lift up the skin. The meat underneath should be rare but not raw&mdash;dull red instead of shiny. When done, let the meat rest a few minutes before slicing on a diagonal. Sprinkle on a little more of the spice rub.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>There should be plenty of rendered duck fat in your skillet. If you have any leftover cooked rice in the fridge and some red curry paste, some fried rice topped with the juice of that zested lime may not be a bad idea. Just sayin'.</p>"}]}