{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100525MaltedBarleyDarkRye.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "barley", "bread", "bread baking", "malted barley", "rye bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Malted Barley Dark Rye Sandwich Loaf", "link": "https://www.seriouseats.com/recipes/2010/05/bread-baking-malted-barley-dark-rye-sandwich-bread-recipe.html", "description": "For this loaf, I used <strong>a pale chocolate malt.</strong> The grains smelled a bit like chocolate with a hint of coffee. One of my previous loaves used a darker roasted malt called Pearl Black that smelled very much like roasted coffee and had a much stronger flavor in the finished loaf. If you don't have dark malted barley, <strong>you could simply leave it out and use this recipe to make a standard rye.</strong> It will be a lot paler, and not as complex, but still a nice loaf of rye.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons yeast", "1 tablespoon pale chocolate barley malt", "1/2 cup dark rye flour", "1/2 cup rye flakes", "2 tablespoons sugar", "2 cups bread flour", "2 teaspoons salt", "1/4 cup Greek-style yogurt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine water, yeast, barley malt, rye flour, rye flakes, and sugar. Whisk to combine it all, cover the bowl with plastic wrap, and set aside for a hour. It will be bubbling vigorously and look like something that dinosaurs used to fall into.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bread flour, salt, yogurt, and olive oil. Knead with the dough hook until the dough gathers around the dough hook, cleans the sides of the bowl, and becomes elastic. It will still be sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle with a little more olive oil to cover all sides of the dough in the bowl. Cover the bowl with plastic wrap again, and set aside until doubled in size, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and sprinkle cornmeal on the bottom of a 9-by-5-inch loaf pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle flour on your work surface and transfer the dough to the counter. Knead the dough by hand a bit, then form into a log that will fit the length of the loaf pan, and place it in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the loaf pan with plastic wrap and set aside until it has risen to just above the top of the pan, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the loaf has fully risen (if you poke the side of the dough gently with a fingertip, the indent will stay rather than bouncing back), slash the top of the loaf as desired and bake at 350°F for 35 to 45 minutes, until nicely browned and the loaf sound hollow when tapped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the loaf from the pan and cool completely on a rack before slicing.</p>"}]}