{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100329nokneadbread.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baking", "bread", "Cook the Book", "Jim Lahey", "My Bread", "no-knead bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Basic No-Knead Bread", "link": "https://www.seriouseats.com/recipes/2010/03/basic-no-knead-bread-dough-jim-lahey-recipe.html", "description": "I was a little late to jump on the <strong>No-Knead Bread</strong> bandwagon&mdash;it was one of those recipes that I'd been meaning to try but never got around to, until about a month ago.  Ever since that first loaf, <strong>Jim Lahey's no-knead bread has become an instant staple in my kitchen</strong> and I try to have a bowl of dough proofing on my counter at all times.", "totalTime": "", "recipeYield": "1 loaf", "recipeCategory": ["Bread", "Cook the Book", "Dairy-Free", "Vegan", "Vegetarian"], "recipeIngredient": ["3 cups (400 grams) bread flour", "1¼  teaspoons (8 grams) table salt", "¼ teaspoon (1 gram) instant or other active dry yeast", "1¹⁄³ cups (300 grams) cool (55 to 65 °F) water", "wheat bran, cornmeal, or additional flour for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir together the flour, salt, and yeast. Add the water and, using a wooden spoon or your hand, mix until you have a wet, sticky dough, about 30 seconds. Make sure it's really sticky to the touch; if it's not, mix in another tablespoon or two of water. Cover the bowl with a plate, tea towel, or plastic wrap and let sit at room temperature (about 72 degrees F), out of direct sunlight, until the surface is dotted with bubbles and the dough is more than doubled in size. This will take a minimum of 12 hours and (my preference) up to 18 hours. This slow rise--fermentation--is the key to flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the first fermentation is complete, generously dust a work surface (a wooden or plastic cutting board is fine) with flour. Use a bowl scraper or rubber spatula to scrape the dough onto the board in one piece. When you begin to pull the dough away from the bowl, it will cling in long, thin strands (this is the developed gluten), and it will be quite loose and sticky--do not add more flour. Use lightly floured hands or a bowl scraper or spatula to lift the edges of the dough in toward the center. Nudge and tuck in the edges of the dough to make it round.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><br />\r\n<strong>3.  </strong>Place a cotton or linen tea towel (not terry cloth, which tends to stick and may leave lint in the dough) or a large cloth napkin on your work surface and generously dust the cloth with wheat bran, cornmeal, or flour. Use your hands or a bowl scraper or wooden spatula to gently lift the dough onto the towel, so it is seam side down. If the dough is tacky, dust the top lightly with wheat bran, cornmeal, or flour. Fold the ends of the towel loosely over the dough to cover it and place it in a warm, draft-free spot to rise for 1 to 2 hours. The dough is ready when it is almost doubled. If you gently poke it with your finger, making an indentation about 1/4 inch deep, it should hold the impression. If it doesn't, let it rise for another 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Half an hour before the end of the second rise, preheat the oven to 475 degrees F, with a rack in the lower third position, and place a covered 41/2 - to 51/2 -quart heavy pot in the center of the rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using pot holders, carefully remove the preheated pot from the oven and uncover it. Unfold the tea towel, lightly dust the dough with flour or bran, lift up the dough, either on the towel or in your hand, and quickly but gently invert it into the pot, seam side up. (Use caution, the pot will be very hot.) Cover the pot and bake for 30 minutes.</p>"}]}