{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100429lamburger.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["cumin", "lamb", "Spice Hunting"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Lamb with Cumin and Chiles", "link": "https://www.seriouseats.com/recipes/2010/05/lamb-cumin-chiles-recipe.html", "description": "Cumin's Perfect Compliment: Lamb", "totalTime": null, "recipeYield": "2 to 3", "recipeCategory": ["Lamb"], "recipeIngredient": ["12 oz. lamb shoulder, cut into 1/4 inch cubes, trimmed of most excess fat and gristle", "Neutral oil, for marinade and cooking", "4 tablespoons cumin seeds, toasted till fragrant, divided", "3 garlic cloves, roughly chopped", "2 tablespoons soy sauce", "1 tablespoon Chinese rice wine, or dry sherry", "1 small onion, cut into short, thin slices", "3 scallions, thinly sliced", "2 jalapeños (or other green chiles), stemmed, seeded, and chopped", "Fresh cilantro, roughly chopped, for garnish if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine lamb, 1 tablespoon of oil, 3 tablespoons of the cumin seeds, garlic, soy sauce, and rice wine in a bowl. Let the lamb marinate while you prep your other ingredients, or up to half an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a wok or a large, heavy skillet on high and pour in enough oil to thinly cover the bottom. When very hot, add the lamb in one layer. Let it sear well on one side, then brown on all sides. After the initial sear, keep the lamb moving. Burnt cumin is nasty stuff.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onions and a pinch of salt while scraping up any browned bits. When the onions have developed some color, add enough water to go halfway up the lamb. Bring it to a boil, then reduce it to a moderate simmer. Simmer till the lamb is tender, adding more water as needed when things are looking too dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the lamb is mostly tender and the pan is mostly dry, add the scallions, jalapeños, and the rest of the cumin. Stir often until the jalapeños are softened but still bright green. Add salt, sugar, or soy sauce if needed, and cilantro if using. Serve over rice or noodles, or in a crusty bun.</p>"}]}