{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100610SCRAMBLED_EGGS_LEADOFF.jpg", "author": {"@type": "Person", "name": "Aaron Mattis"}, "recipeCuisine": "", "keywords": ["craime", "eggs", "scrambled eggs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "How to Make the Creamiest Scrambled Eggs", "link": "https://www.seriouseats.com/recipes/2010/06/how-to-make-creamy-scrambled-eggs-creme-fraiche-breakfast.html", "description": "<strong>These are the scrambled eggs dreams are made of</strong>, or would be made of if you dreamed about scrambled eggs, which would be weird. The ideal scrambled eggs have the texture of <strong>the interior of a soufflé</strong>, fluffy and light yet creamy and rich. Their flavor is <strong>pure, unadulterated egg</strong>, both more delicate and more flavorful than standard egg preparations. To achieve these results you need to cook the eggs very lightly, which entails <strong>slow cooking over low heat.</strong>", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Scrambled Eggs"], "recipeIngredient": ["1 1/2 tablespoons unsalted butter", "3 large eggs", "Kosher salt", "Freshly ground black pepper", "1/2 tablespoon crème fraîche", "A dash of minced parsley", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter over low heat in a nonstick or cast iron skillet. Meanwhile, crack eggs into a bowl, season with a dash of kosher salt and a pinch of pepper, and beat very lightly, just enough to break up yolks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the skillet off the heat and add eggs. The eggs will begin to coagulate as soon as they hit the pan, so scramble immediately to avoid lumps. When the pan has cooled enough that the eggs are no longer coagulating, return to heat, stirring gently but constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the eggs begin to coagulate, take them off the heat again and, constantly stirring, wait until the pan cools enough for the eggs to no longer coagulate to return them to the heat. Continue to alternate cooking on the heat and off the heat until the eggs are no longer runny or wet but still creamy and moist. They should resemble fresh ricotta or the interior of a soufflé.</p>"}]}