{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100616sweetpotatoraviolibefore.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Frank Castronovo", "Frank Falcinelli", "pasta", "ravioli", "sage", "sweet potatoes", "The Frankies Spuntino Kitchen Companion &amp; Cooking Manual", "vegetarian", "wonton skins"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sweet Potato Ravioli in Cheese Broth", "link": "https://www.seriouseats.com/recipes/2010/06/sweet-potato-ravioli-in-cheese-broth-recipe.html", "description": "For as long as I've been eating at <a href=\"http://www.frankiesspuntino.com/\">Frankies Spuntino</a>, I've been trying to figure out what makes their <strong>Sweet Potato Ravioli in Cheese Broth</strong> so incredible.  It's the <em>one</em> dish I order without fail, and I've been trying to uncover what sets these ravioli apart, aside from the fact that <strong>they use wonton wrappers instead of a more traditional (and labor intensive) pasta dough.</strong>  It was the first recipe I looked up when getting my hands on a copy of <em><a href=\"http://www.amazon.com/Frankies-Spuntino-Kitchen-Companion-Cooking/dp/1579654150/serieats-20\">The Frankies Spuntino Kitchen Companion &amp; Cooking Manual</a></em> by <a href=\"http://www.frankiesspuntino.com/\">Frank Falcinelli and Frank Castronovo</a>. There it was in the ingredients list&mdash;the secret was the Chinese five-spice powder.", "totalTime": "", "recipeYield": "8", "recipeCategory": ["Cook the Book", "Pasta", "Sweet Potatoes and Yams", "Vegetarian"], "recipeIngredient": ["3 large sweet potatoes, scrubbed", "A negligible amount of olive oil", "Fine sea salt and freshly ground white pepper", "2 tablespoons honey", "1/4 teaspoon Chinese five-spice powder", "48 round wonton wrappers", "4 tablespoons unsalted butter", "5 or 6 sage leaves", "8 cups Cheese Broth (recipe follows)", "4 scallions, white and very light green parts only, cut into long, fine julienne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 350&deg;F.  Slick the potatoes with oil, sprinkle with salt and white pepper and wrap individually in aluminum foil.  Bake for 1 hour, or until very tender.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve the sweet potatoes and scoop the flesh into a mixing bowl.  Add the honey, five-spice powder, and a large pinch of salt.  Stir to combine, then taste and adjust as needed.  Let it cool down a little.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prep your pasta-making station: the bowl of ravioli filling, the pile of wonton wrappers, a cutting board to work on, a small bowl of water (to seal the ravioli), and a baking sheet lined with parchment paper or plastic wrap.  Put a teaspoon of filling into the center of a wonton skin, dip your finger in the bowl of water and use it to wet the rim of the wonton skin, then fold the wrapper closed, pinching the edges to seal.  Lay the ravioli on the baking sheet and repeat until they are all stuffed.  The ravioli can be used right away or frozen on the baking sheet.  (Once they have frozen solid, transfer them to a freezer bag or other container and store for up to a month.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a wide saucepan over medium heat.  Add the sage leaves and cook them for a minute or so, just until aromatic.  Add the cheese broth, season it with a pinch of salt and a few turns of white pepper, and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the ravioli into the pot of salted water; they should bob to the surface of the pot in about 3 minutes.  Remove the ravioli from the water and divide among the serving bowls.  Ladle a cup or so of the broth into each bowl and garnish with a scattering of scallions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Cheese Broth</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1 quart -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h5>Procedure</h5>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the rind of (the dry outer half inch of or so of a hard cheese) for a good-sized chunk of Pecorino Romano (or Parmesan or any grating cheese) with a quart of water and simmer for 2 hours, or as long as you can.  Strain and use, or store it&mdash:up to a week in the fridge or for months in the freezer.</p>"}]}