{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100201-thenastybits-fishsoup2.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["fish eyes", "fish head soup", "offal", "seafood", "soups", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Nasty Bits: Fish Head Soup", "link": "https://www.seriouseats.com/recipes/2010/02/the-nasty-bits-fish-head-soup-offal-recipe.html", "description": "\"I grew up with all the eyeballs I could eat.\" Eat them up, yum! [Photographs: Chichi Wang] More Nasty Bits! Stir-Fried Frogs with Bell Peppers in Black Bean Sauce &#187; Dashi-Simmered Eel &#187; All Nasty Bits coverage &#187; During Thanksgiving...", "totalTime": "", "recipeYield": "", "recipeCategory": ["Fish", "Mains", "Offal", "Soups and Stews", "The Nasty Bits"], "recipeIngredient": ["2 large fish heads, such as croaker or salmon, approximately 1 ½ pounds total", "6 cups of oil for frying", "1 tablespoon Shao Xing rice wine, or sake", "a few thick slices of ginger", "2 green onions, sliced thickly on a bias", "one 6-ounce tin of Sichuan pickled mustard greens", "bean thread noodles, optional", "finely sliced green onions for garnishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wok, bring the oil to 400 F. Thoroughly blot the fish heads on a paper towel, and split each head in half with strong kitchen shears. When the oil reaches 400, slip the halves of the head into the oil, one or two halves at a time. Fry until golden brown on all sides. Drain and blot dry again with a paper towel.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring 3 or so cups of water to boil. When all the sections of head are done frying, add the heads to the boiling water. If needed, add just enough additional water to cover the heads.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice wine, ginger, green onions, and the entire contents of the tin of pickled greens. Bring the pot to a simmer and cook gently for 20 minutes, until the flesh of the heads is falling off the bones and the broth has turned a milky-white color. If a lot of oil has risen to the top, skim it off with a shallow spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, add bean thread noodles: soften the noodles first in warm water, then simmer then gently along with the fish heads during the last 3 minutes of cooking. Garnish with the thinly sliced green onion, and serve immediately.</p>"}]}