{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20101102%20cinnamon%20knots%20on%20sheet.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "cinnamon bread", "Cinnamon Buns", "cinnamon knots", "holiday baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Cinnamon Knots", "link": "https://www.seriouseats.com/recipes/2010/11/bread-baking-cinnamon-knots-cinnamon-buns.html", "description": "I was out shopping and out of the corner of my eye, I saw some tempting \"Cinnamon Pretzels.\" They were in the shape of pretzels, and huge, but it looked like they might have been made from a sweet dough. I almost bought one, then changed my mind. The last time I gave in to a store-bought sweet dough temptation, I was disappointed. So this time, I <strong>put it on the list to bake at home.</strong>", "totalTime": "1 day", "recipeYield": "Makes 16 Cinnamon Knots", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch", "Breakfast Sweets"], "recipeIngredient": ["1/2 cup lukewarm water", "2 1/4 teaspoons instant yeast", "1/4 cup honey divided", "2 eggs", "1/2 cup scalded milk, cooled to room temperature", "1/4 cup instant mashed potatoes", "15 3/4 ounces (a bit more than 2 3/4 cups) bread flour", "1 teaspoon salt", "4 tablespoons room temperature butter", "1/4 cup sugar (more as needed)", "1 tablespoon cinnamon (or to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of stand mixer combine water and yeast. Dip spoon into honey, and use to stir water/yeast mixture until honey dissolves off spoon. Set mixture aside for ten minutes until foamy. Add remaining honey, eggs, milk, instant potatoes, and bread flour. Knead with dough hook at low speed until dough is smooth and elastic, about 4 minutes. Add salt and butter and continue kneading until butter and salt are completely incorporated, about 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle small amount of olive oil into zipper-lock bag. Form dough into ball (it will be very soft) and put it into bag, making sure that it's coated with oil all over. Put bag in refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next morning, remove bag from refrigerator and lightly knead while still in bag, to knock out air. You may need to open bag to let air out; reseal it. Let bag sit out until it has come to room temperature, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper middle and lower middle position and preheat oven to 350°F. Line 2 baking sheets with parchment paper. Mix cinnamon and sugar in a flat rimmed plate or pie pan. Flour work surface. Remove dough from bag and knead briefly. Divide dough into 16 roughly equal pieces. Roll each piece into a rope about 6 inches long, flouring work surface only as much as needed to keep the dough from sticking. You want the finished ropes to be a little sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each rope in sugar/cinnamon mixture to coat (they will tend to shrink up as you do this, don't worry about it), then tie each rope into a knot and place on prepared baking sheet. When all knots are formed, sprinkle any remaining sugar/cinnamon mixture on top of them, adding extra cinnamon/sugar, if deisred).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pans with plastic wrap and set aside to rise until doubled, about 45 minutes. Remove plastic wrap and bake until nicely browned, about 25 minutes. Remove to cooling rack to cool or serve immediately.</p>"}]}