{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100121-dt-butternut-fennel-soup.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "soup", "squash", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Squash and Fennel Soup with Candied Pumpkin Seeds", "link": "https://www.seriouseats.com/recipes/2010/01/dinner-tonight-squash-and-fennel-soup-with-candied-pumpkin-seeds-recipe.html", "description": "[Photograph: Blake Royer] Sometimes at fancy restaurants the waiter will begin the meal with a flourish, quietly intoning words to the effect of \"compliments of the chef,\" making you feel as if you're a special guest of the restaurant. The...", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pumpkin", "Soups and Stews", "Squash", "Vegetarian"], "recipeIngredient": ["2 pounds winter squash, such as butternut", "2 medium bulbs fennel", "4 tablespoons olive oil", "2 teaspoons fennel seeds", "4 tablespoons butter", "2 cups sliced onions", "1 tablespoon fresh thyme leaves", "2 dried red chiles de arbol, or a fat pinch of crushed red pepper flakes", "1 bay leaf", "3/4 cup sherry", "8 cups water", "1/4 cup crème fraîche (I substituted Greek yogurt)", "<strong>For the pumpkin seeds:</strong>", "1/2 cup raw pumpkin seeds", "1/4 teaspoon ground cumin, or whole seeds ground", "1 tablespoon butter", "1 tablespoon sugar", "Generous pinch each of cinnamon, paprika, and cayenne", "Salt to taste", "1 teaspoon honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 400&deg;F. Peel and cut the squash up into 1-inch wedges, discarding the peel and seeds. Peel and core the fennel and chop it up into equally-sized wedges. Roast, drizzled with the olive oil and a pinch of salt and pepper, until soft and caramelized, about 35 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, toast the fennel seeds in a dry skillet until fragrant, then grind or pulverize in a mortar and pestle. Heat the butter over medium-high heat in a heavy, large pot (like a Dutch oven) until it foams, then add the seeds, onion, thyme, chiles, bay leaf, and a pinch of salt and pepper. Cook until the onions are soft and translucent, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the squash and fennel finish roasting, prepare the pumpkin seeds: melt the butter in a small skillet over medium heat, then add the seeds, sugar, spices, and a pinch of salt. Toss well to coat the seeds and cook until they begin to pop and color slightly, moving them around the pan often. Remove from the heat, wait 30 seconds, then add the honey and toss quickly to coat. Spread on a plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the contents of the roasting pan with the onion in the heavy pot, and pour in the sherry. Allow to reduce for a few minutes, then add the water and bring to a boil. Simmer for 20 minutes. Transfer about a third of the solids to a blender (pur&eacute;e it in batches to ensure the perfect consistency) and add 1/2 cup or so of the liquid. Turn on at low speed until the solid are completely pur&eacute;ed, then add another 1/2 cup broth and turn the speed to high, adding liquid little by little until the soup has the consistency of heavy cream. Blend for at least a full minute on high speed.  Follow this process for the rest of the soup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the soup with some crème fraîche or Greek yogurt spooned in, scattered with the pumpkin seeds.</p>"}]}