{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101220almondconvent.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["almonds", "Cook the Book", "cookie a day 2010", "Cookies", "Fany Gerson", "holiday baking", "holiday sweets", "My Sweet Mexico"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bake the Book: Convent Cookies", "link": "https://www.seriouseats.com/recipes/2010/12/cook-the-book-convent-cookies-almond.html", "description": "These cookies from Fany Gerson's <em><strong><a href=\"http://www.amazon.com/My-Sweet-Mexico-Authentic-Beverages/dp/1580089941/serieats-20\">My Sweet Mexico</a></strong></em> are crumbly, sweet, and bursting with deep almond flavor.", "totalTime": "", "recipeYield": "3 to 4 dozen cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Nuts"], "recipeIngredient": ["1 cup whole almonds, skins on", "1 cup sugar, plus extra for topping", "1/4 cup water", "7 ounces (scant 1/2 cup) unsalted butter, softened", "5 egg yolks ", "1/4 teaspoon salt", "2 1/4 cups all-purpose flour, sifted", "2 egg whites", "Sliced or slivered almonds, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the almonds on a baking sheet and toast until golden in the center, 8 to 10 minutes. Remove from the oven and let cool completely. Place a nonstick mat on a baking sheet or lightly grease the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the 1 cup sugar and the water in a small saucepan, wiping the edges with a wet brush or your wet hands so no crystals form, and cook until it turns a golden caramel color. Add the almonds and stir quickly with a heatproof spatula or wooden spoon. Pour onto the prepared baking sheet. Let cool, and then grind in a food processor until the consistency resembles little sugar rocks but not powder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cream the butter in a mixer until pale and fluffy, and then add the egg yolks, one at a time. In a small bowl, combine the salt and flour and add gradually to the batter, scraping the sides as needed. Add the ground caramelized almonds until just combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put about one-fourth of the mixture between two pieces of parchment paper (the size of your baking sheet) and roll out to about 1/4-inch thickness. Keeping the rolled-out mixture between the parchment sheets, transfer to the baking sheet then place in the freezer for 10 minutes; repeat the process with the rest of the dough. Remove the baking sheets from the freezer, one at a time, beginning with the one that has been in the freezer the longest. Carefully peel off one of the parchment pieces to expose the cookie dough, and then put it back lightly, flip over the cookie dough, and peel off the other sheet. (This step makes the cookies easier to handle.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper. Cut out 21/2-inch circles of dough (or whatever shape you desire) and place on the baking sheet. Repeat the process with the rest of the dough and gather the scraps to roll again. The scraps can be rerolled up to three times. If the dough starts to feel sticky, refrigerate or freeze it briefly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg whites lightly and brush the tops of the cookies. Decorate with sliced or slivered almonds and a bit of sugar. Bake until the edges begin to brown, about 10 minutes. Let cool for 5 minutes in the pan, and then transfer to a wire rack to cool completely.</p>"}]}