{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101203CardamomCaramelPalmiers.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Cookie a Day 2010", "Alice Medrich", "cardamom", "Chewy Gooey Crispy Crunchy Melt-in-Your-Mouth Cookies", "Cook the Book", "Cookies", "holiday baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bake the Book: Cardamom Caramel Palmiers", "link": "https://www.seriouseats.com/recipes/2010/12/cardamom-caramel-palmiers-recipe.html", "description": "<a href=\"http://en.wikipedia.org/wiki/Palmier\">Palmiers</a> are some of my favorite cookies. I'd always thought of them as the perfect combination of flaky pastry dough and crisp cookies mixed with just the right amount of caramelized sugar. But this recipe for <strong>Cardamom Caramel Palmiers</strong> from <strong><em><a href=\"http://www.amazon.com/Crispy-Crunchy-Your-Mouth-Cookies-Medrich/dp/1579653979/serieats-20\">Chewy Gooey Crispy Crunchy Melt-in-Your-Mouth Cookies</a></em></strong> by <strong><a href=\"http://www.alicemedrich.com/\">Alice Medrich</a></strong> took these cookies to the next level by mixing in aromatic cardamom and a pinch of salt.", "totalTime": null, "recipeYield": "48 cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies", "Desserts", "Pastry"], "recipeIngredient": ["<strong>For the Dough:</strong>", "2 1/2 cups (11.25 ounces) unbleached all-purpose flour", "2 tablespoons sugar", "1/4 teaspoon salt", "1/2 pound (2 sticks) unsalted butter, cold ", "8 ounces cream cheese, cold ", "<strong>For the Filling:</strong>", "1 cup (7 ounces) sugar", "1 teaspoon ground cardamom", "2 pinches of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using a Stand Mixer to Make the Dough:</strong>  Combine the flour, sugar, and salt in the mixer bowl. Using the paddle attachment, mix briefly to distribute the ingredients. Cut each stick of butter into 8 pieces and add them to the bowl. Mix on low speed until most of the mixture resembles very coarse bread crumbs with a few larger pieces of butter the size of hazelnuts. Cut the cream cheese into 1-inch cubes and add them to the bowl. Mix on medium-low speed until the mixture is damp and shaggy looking and holds together when pressed with your fingers, 30 to 60 seconds. Dump the dough onto the work surface, scraping the bowl. Knead two or three times to incorporate any loose pieces. There should be large streaks of cream cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using a Food Processor to Make the Dough:</strong>  Combine the flour, sugar, and salt in a food processor and pulse a few times to mix. Cut the butter into 3/4-inch cubes and add to the flour mixture. Pulse until the butter pieces range in size from coarse bread crumbs to hazelnuts. Cut the cream cheese into 1-inch cubes and add to the mixture. Pulse until the dough looks damp and shaggy and holds together when pressed with your fingers. Dump the dough onto the work surface, scraping the bowl. Knead two or three times to incorporate any loose pieces. There should be large streaks of cream cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 2 equal pieces and shape each into a 4-by-5-inch rectangular patty about 1 inch thick. Wrap and chill the dough until firm, at least 2 hours and up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator. If necessary, let the dough sit at room temperature until pliable enough to roll, but not too soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Filling:</strong>  Mix the sugar with the cardamom. Transfer 2 tablespoons of the mixture to a small cup and mix thoroughly with the salt. Set aside. Divide the remaining cardamom sugar equally between 2 bowls; you will use one bowl for each piece of dough you roll out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the work surface liberally with some of the cardamom sugar from one of the bowls. Set 1 piece of dough on the sugared surface and sprinkle it with more cardamom sugar. Turn the dough frequently and resugar it and the work surface liberally as you roll the dough into a 24-by-8-inch rectangle that’ s less than 1/8 inch thick. Use the cardamom sugar generously to prevent sticking and to ensure that the cookies will caramelize properly in the oven. Trim the edges of the rectangle evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mark the center of the dough with a small indentation. Starting at one short edge, fold about 2 1/2 inches of dough almost one-third of the distance to the center mark. Without stretching or pulling, loosely fold the dough over two more times, leaving a scant 1/4-inch space at the center mark. Likewise, fold the other end of the dough toward the center 3 times, leaving a tiny space at the center. The dough should now resemble a tall, narrow open book. Fold one side of the dough over the other side, as if closing the book. You should have an 8-layer strip of dough about 2 1/2 inches wide and 8 inches long.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the remaining cardamom sugar under and on top of the dough. Roll gently from one end of the dough to the other to compress the layers and lengthen the strip to about 9 inches. Wrap the dough loosely in wax paper (not plastic wrap, which might cause moisture to form on the outside of the dough and will dissolve the sugar). Refrigerate the dough for at least 30 minutes and up to 4 hours. Meanwhile, repeat with the second piece of dough and the second bowl of cardamom sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Position racks in the upper and lower thirds of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove 1 piece of dough from the refrigerator, unwrap it, and use a sharp knife to trim the ends evenly. Cut 1/3-inch slices (I mark the dough at 1-inch intervals and cut 3 slices from each inch) and arrange them 1 1/2 inches apart on the ungreased or lined cookie sheets. Bake for 8 to 10 minutes, until the undersides are deep golden brown. Rotate the pans from top to bottom and from front to back halfway through the baking time to ensure even baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pans from the oven. Turn the cookies over. Sprinkle each one with a pinch or two of the salted cardamom sugar, reserving half of the sugar for the second round of baking. Return the sheets to the oven and bake for another 3 to 5 minutes, until the cookies are deep golden brown. Rotate the pans and watch the cookies carefully at this stage to prevent burning. If the cookies brown at different rates, remove the dark ones and let the lighter ones continue to bake. For lined pans, set the pans or just the liners on racks to cool; for unlined pans, use a metal spatula to transfer the cookies to racks. Making sure the cookie sheets are completely cool, repeat with the second piece of dough. Cool the cookies completely before storing. May be kept in an airtight container for up to 4 days.</p>"}]}