{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100805-dt-bean-and-cheese-tlacoyos.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Mexican", "keywords": ["black beans", "cilantro", "Dinner Tonight", "masa", "Mexican", "Oaxaca cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Tlacoyo Masa Pockets", "link": "https://www.seriouseats.com/recipes/2010/08/tlacoyo-masa-pockets-recipe.html", "description": "<strong>Tlacoyos</strong> are Mexican cornmeal dough pockets similar to Salvadorian pupusas.  (Doesn't every culture in the world have some kind of edible pocket stuffed with filling? Calzones? Pork buns?)  Working with masa is quick, and so is the filling: a can of beans mashed up with <strong>sauteed onion and garlic, and Oaxaca cheese,</strong> which is basically a Mexican version of string cheese.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Mexican", "Pastry"], "recipeIngredient": ["1 cup masa flour", "3/4 cup water, more if needed", "1/4 teaspoon salt", "2 tablespoons lard, bacon fat, or oil", "1/2 onion, minced", "1 clove garlic, minced", "1 can black beans", "2 oz shredded Oaxaca cheese (or substitute Monterey Jack)", "Salt to taste", "4 tablespoons neutral oil for frying", "Salsa for serving", "Chopped onion and/or cilantro for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine the masa, water, and salt.  Form into a ball so that all the flour is incorporated.  Add more water if needed to make a moist dough.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet, heat the lard, bacon fat, or oil over medium heat.  Add the onion and cook for 3 to 4 minutes, until soft, then add the garlic.  Cook for an additional 3 to 4 minutes until starting to color.  Add the beans, undrained, and raise the heat to high. Cook for a couple minutes, then mash roughly with a spatula and remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the masa dough into 4 pieces and flatten them between two pieces of plastic wrap using a heavy skillet or tortilla press.  Lay them on a cutting board and divide the beans and cheese among them, then carefully fold over and pinch to create a half-moon shaped pocket.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the frying oil in a large skillet over high heat and add the pockets (cook them in two batches to avoid crowding).  cook for 3 to 4 minutes per side, until golden, then drain on paper towels.  Serve with the salsa and garnishes.</p>"}]}