{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/031710-dt-bangersandmash2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["bangers", "irish", "mashed potatoes", "pork", "potatoes", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Bangers and Mash with Onion Gravy", "link": "https://www.seriouseats.com/recipes/2010/03/bangers-and-mash-with-onion-gravy-recipe.html", "description": "Bangers and mash sounds like a relatively simple, two-ingredient dish, but there's actually <strong>a third, equally important component</strong> that doesn't get main billing: <strong>onion gravy,</strong> the glue that holds this meal together.", "totalTime": "", "recipeYield": "2", "recipeCategory": ["Dinner Tonight", "Mains", "Mashed Potatoes", "Pork", "St. Patrick's Day"], "recipeIngredient": ["2 pork sausages (preferably British bangers, though a good pork sausage would do)", "2 tablespoons canola oil ", "1 large onion, sliced in half and thinly sliced", "1/2 tablespoon flour ", "3/4 cup chicken or beef stock ", "splash of red wine ", "salt and pepper ", "2 large russet potatoes, peeled and chopped.", "3/4 cup milk, warmed", "5 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour a tablespoon of oil into a skillet and add a tablespoon of butter. Turn the heat to medium and add the onions. Cook those, stirring often, for 20 to 25 minutes minutes, or until caramelized and golden brown. Meanwhile, bring one pot of water to about 149°F, using a meat thermometer to check. Gently drop the sausages in and cook for 20 minutes, checking the temperature often to make sure it cooks properly. Also at the beginning, bring second pot of water to a boil and add the potatoes. Cook those for 20 minutes as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the onions are well caramelized, sprinkle the flour on top and cook for another minute. Then add a splash of red wine. When that has evaporated, add the chicken or beef stock. Reduce heat to a simmer, and cook for 10 to 15 minutes. Season with salt and pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sausages are done, remove them from the water and dry with some paper towels. Pour about 1 tablespoon of canola oil into a large skillet and cook them over medium heat until they are browned all over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are done, drain in a colander. Pass the potatoes through a potato ricer into the empty pot, or mash them with a potato masher. Add the rest of the butter and warmed milk. Stir well and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add some potatoes to a plate, top with some sausage and the onion gravy. Serve.</p>"}]}