{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cabbage", "Cook the Book", "Darina Allen", "Forgotten Skills of Cooking", "irish", "kale", "potatoes", "recipe newsletter", "UK"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Colcannon", "link": "https://www.seriouseats.com/recipes/2010/03/colcannon-recipe.html", "description": "The following recipe is from the March 17 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! I must have made Colcannon at least twenty times before I realized that it was a...", "totalTime": null, "recipeYield": "about 8", "recipeCategory": ["Cabbage", "Cook the Book", "Gluten-Free", "Kale", "Potato", "Sides", "Vegetarian"], "recipeIngredient": ["1 pound Savoy, spring cabbage, or kale (kale is the most traditional)", "", "About 1 cup milk", "Salt and freshly ground black pepper", "4 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrub the potatoes, put them in a saucepan of cold water, add a good pinch of salt, and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are half-cooked after about 15 minutes, strain off two-thirds of the water, replace the lid on the saucepan, and put over a low heat, leaving the potatoes to steam until they are cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, if using cabbage, remove the dark outer leaves, wash the remainder, cut it into quarters, remove the core, and cut finely across the grain. Boil in a little boiling water or bacon cooking water until soft. Drain and season with salt, freshly ground pepper, and a little butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are just cooked, put the milk and the finely chopped shallots into a saucepan and bring to a boil. Pull the peel off the potatoes and discard. Mash the potatoes quickly, while they are still warm, and beat in enough boiling milk to make a fluffy purée. (If you have a large quantity, put the potatoes in the bowl of a food mixer and beat with the flat beater.) Then stir in the cooked cabbage and taste for seasoning. For perfection, serve immediately in a hot dish with a lump of butter melting in the center.</p>"}]}