{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2010/09/chiliforchilidogs.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "chili", "sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Chili for Chili Burgers, Chili Dogs, or Chili Fries", "link": "https://www.seriouseats.com/recipes/2010/09/chili-for-chili-burgers-dogs-fries-recipe.html", "description": "[Photograph: J. Kenji Lopez-Alt] This chili ends up with a homogeneous, saucy texture perfect for topping burgers, hot dogs, or fries. Leftover chili can be stored in the fridge for up to 1 week. The chili is best with the...", "totalTime": "95 minutes", "recipeYield": "about 8", "recipeCategory": ["Beef", "Burger", "Chili", "Condiments and Sauces", "Sandwiches", "The Burger Lab", "The Food Lab"], "recipeIngredient": ["2 whole Ancho or Pasilla chiles, stemmed, seeded, and torn into strips", "1 whole New Mexico red, California, Costeño, or Choricero chile, stemmed, seeded, and torn into strips", "1 whole Cascabel, Arbol, or Pequin chile, stemmed, seeded, and torn in half", "2 tablespoons butter", "1 medium yellow onion, diced fine (about 1 1/2 cups)", "2 cloves garlic", "1 1/2 teaspoons whole cumin seed, toasted and ground", "1 teaspoon coriander seed, toasted and ground", "1 whole clove, toasted and ground", "1 whole star anise, toasted and ground", "1/2 teaspoon dried oregano", "3 tablespoons tomato paste", "2 teaspoons soy sauce", "1 anchovy filet, minced (optional)", "1/2 teaspoon Marmite (optional)", "1 teaspoon sugar", "1 1/2 pounds 80/20 ground chuck or short rib", "1 quart chicken stock", "2 tablespoons masa harina", "1 tablespoon Frank's Red Hot", "1 tablespoon bourbon (optional)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all chiles in a medium microwave-safe bowl and cover with water. Microwave on full power for 2 minutes. Remove bowl from microwave and allow chiles to soak for 10 minutes. Using immersion blender or upright blender, blend soaked chiles until smooth, adding soaking water as needed to keep texture loose.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter over medium-high heat in Dutch oven. When foaming subsides, add onions and garlic. Cook, stirring frequently, until onions are softened but no browned, about 6 minutes. Add ground spices and oregano and continue to cook, stirring frequently, until aromatic, about 1 1/2 minutes. Add tomato paste, soy sauce, anchovy, Marmite (if using), and sugar, and cook, stirring frequently until paste begins to stick to bottom of pan, about 1 1/2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pan from heat and add 2 cups of chicken broth. Scrape up any browned bits from bottom of pan with wooden spoon. Add ground beef and break up using whisk until mixture is completely homogeneous (no large chunks of beef should remain). Add remaining chicken stock and return to stovetop and set over medium high heat. Cook, whisking frequently, until mixture comes to a simmer. Cover with lid slightly ajar, reduce heat to low, and cook for 75 minutes, stirring occasionally, until mixture is thick and intense.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine masa harina and 2 tablespoons water in a small bowl and mix until homogeneous. Add masa mixture, hot sauce, and bourbon to chili and stir to combine. Bring to a boil and simmer until thickened, about 2 minutes. Season to taste with salt and serve immediately on top of burgers, hot dogs, or fries.</p>"}]}