{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100503newpotatoeandasparagussalad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["asparagus", "Cook the Book", "new potatoes", "Simon Hopkinson", "spring", "The Vegetarian Option"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Warm Salad of Asparagus and New Potatoes", "link": "https://www.seriouseats.com/recipes/2010/05/warm-salad-of-asparagus-and-new-potatoes-recipe.html", "description": "We can't sustain on brightly dressed young lettuces alone so my thoughts turned to the more substantial salads of summer.  This <strong>Warm Salad of Asparagus and New Potatoes</strong> from <em><a href=\"http://www.amazon.com/Vegetarian-Option-Simon-Hopkinson/dp/1584798475/serieats-20\">The Vegetarian Option</a></em> by <a href=\"http://www.bibendum.co.uk/people.html\">Simon Hopkinson</a> is a wonderful way to make a meal out of the best that your local farmers' market has to offer this time of year.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["3/4 pound new potatoes, scrupulously scraped or peeled", "Salt", "2 large mint sprigs", "2 scant tablespoons unsalted butter", "1/2 pound asparagus tips", "Hearts of 2 Boston lettuces, leaves separated, washed and carefully dried", "Maldon sea salt", "2 hard boiled eggs, shelled", "Handful of chervil sprigs", "<strong>For the sauce:</strong>", "Juice of 1 lemon", "Pinch of superfine sugar", "5 tablespoons cold unsalted butter, cut into small chunks", "Freshly ground white pepper", "1 tablespoon chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer the potatoes in lightly salted water just to cover, with the mint, until tender.  Drain over another pan or bowl, keep the water for now, and return the potatoes to the pan with the butter.  Stir together, cover, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the sauce, take a roomy and shallow, stainless steel or enameled saucepan and squeeze in the lemon juice.  Add 6 tablespoons of the potato cooking water and the sugar, then simmer this mixture until reduced by half.  Now slowly incorporate the butter, one chunk at a time, whisking over a thread of heat until limpid and homogenous (this is essentially a light butter sauce).  Season with pepper.  Again, keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the asparagus tips from just below the bud and slice them in half lengthwise.  Add to a pan of boiling well-salted water and boil rapidly for about 1 to 2 minutes (eat one to see if they are cooked; they should be just tender, not almost raw), then drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the warm potatoes and add these, together with the asparagus, to the butter sauce.  Turn them gently through the sauce with the chives, until all are evenly coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the lettuce leaves on four plates and divide the asparagus and the potatoes between them.  Sprinkle them with Maldon sea salt and judiciously grate the egg over.  Generously scatter over chervil sprigs, which are not there just to look pretty; their faint anise flavor is very pleasing. </p>"}]}