{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100802zucchinipancakes.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["pancakes", "The Crisper Whisperer", "vegetables", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "The Crisper Whisperer: Zucchini Pancakes", "link": "https://www.seriouseats.com/recipes/2010/08/the-crisper-whisperer-zucchini-pancakes-recipe.html", "description": "It's <em>that</em> time of year again. The time when residents of carefree, throwback towns start locking their front doors and parking their cars in the garage. The time when lucky children find green, woody baseball bats by the dozen strewn atop the compost heap. The time when perfectly reasonable people are driven to silent, guilt-ridden, unreasonable ends. In other words, it's zucchini season. Savory, crave-worthy zucchini pancakes to the rescue.", "totalTime": "50 minutes", "recipeYield": "2 to 3", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Crisper Whisperer", "Mains", "Vegetarian", "Zucchini"], "recipeIngredient": ["2 medium zucchini", "1/2 medium yellow onion", "1/2 teaspoon salt", "2 eggs", "1 clove garlic, finely minced", "1/4 cup parmesan cheese", "1/4 teaspoon minced fresh thyme or oregano", "1/4 teaspoon grated lemon zest", "1/8 teaspoon freshly ground black pepper", "6 tablespoons flour", "1 teaspoon baking powder", "2 tablespoons olive oil, plus more if needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shred the zucchini and onion on the large holes of a box grater or in a food processor with the shredding disk. Place the shredded vegetables in a colander in the sink and sprinkle with the salt. Toss to combine. Let drain for 30 minutes, then pick up by the handful and squeeze out as much moisture as possible. Place on a kitchen towel or double layer of paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the eggs, garlic, cheese, herbs, lemon zest, and pepper. Beat well with a fork. Add the drained zucchini mixture and mix together. Sprinkle the flour and baking powder on top and mix with a fork just until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat one tablespoon of the olive oil over medium-high heat in a wide, heavy pan. When the oil is hot, drop the batter into the pan by heaping tablespoonful. Cook for about three minutes on the first side, until nicely browned. Flip and cook for about two minutes more. Place the cooked pancakes on a paper towel-lined plate and repeat with the remaining oil and batter. Serve with a dollop of Greek yogurt, sour cream, tzatziki or applesauce. </p>"}]}