{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100929beefjerky.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "beef jerky", "Cook the Book", "Deborah Krasner", "Good Meat", "jerky"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Beef Jerky", "link": "https://www.seriouseats.com/recipes/2010/09/beef-jerky-recipe.html", "description": "This recipe for <strong>Beef Jerky</strong> wasn't exactly what I had in mind when I did my shopping for the week, but seeing the thin slices of grass-fed top round laid out behind glass I knew that it was meant to be. The recipe is adapted from <em><a href=\"http://homesicktexan.blogspot.com/\">Homesick Texan</a></em>, a blog that celebrates the foods of Texas in New York.  The meat is partially frozen for ease of slicing and then marinated in a mix of Worcestershire, garlic, and chiles overnight for maximum jerky flavor. The strips are then laid out on a baking sheet and dried in the oven for a few hours to reach that perfect chewy-snappy texture.", "totalTime": null, "recipeYield": "about 45 pieces", "recipeCategory": ["Beef", "Cook the Book"], "recipeIngredient": ["1/2 pound boneless grass-fed beef top round or sirloin tip roast, fat trimmed, partially frozen", "1/4 cup Worcestershire sauce", "2 tablespoons water", "1 garlic clove, finely chopped", "1 teaspoon chili powder", "1/2 teaspoon ground dried chipotle", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon salt", "1/4 teaspoon cayenne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a meat slicer or a food processor, cut the partially frozen meat into thin strips about 1/8 inch thick and as long as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Choose a medium bowl and mix the Worcestershire sauce, water, chopped garlic, chili powder, chipotle, black pepper, salt, and cayenne.  Put the meat strips into this marinade and turn everything over with your hands. Cover the bowl with plastic wrap and refrigerate overnight to allow the flavors to blend and penetrate the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, heat the oven to 175&deg;F. Line 2 baking pans with foil.  Arrange the meat strips side by side on the pans, discarding any bits of garlic and blotting off any liquid clinging to the meat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slow-roast the strips for 3 hours, then turn them over and roast for another hour or two more. The goal is a leathery texture that is <em>still pliable</em>. The jerky will keep, refrigerated, for 3 weeks. It is stable enough to pack in lunches or for trips as long as a day without refrigeration.</p>"}]}