{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2010101carrot.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Middle Eastern", "keywords": ["carrots", "desserts", "halvah", "ice cream", "Indian", "middle eastern", "Tahini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scooped: Carrot Halvah Ice Cream", "link": "https://www.seriouseats.com/recipes/2010/10/carrot-ginger-sesame-cinnamon-halvah-ice-cream-recipe.html", "description": "<strong>Carrots may sound like an odd dessert ingredient,</strong> but they're certainly not just health food. They're starchy and sweet, and when cooked down slowly with milk, practically become candy on their own. Consider them an alternative sweetener, like honey, but with an even more complex sweetness. In a dessert, carrots can build a mild but flavorful base for more intense ingredients to play. Our result is <strong>something of a hybrid between Indian and Middle Eastern halvah.</strong>", "totalTime": "1 1/2 hours (plus overnight chilling)", "recipeYield": "8 to 10 (makes about 1 quart)", "recipeCategory": ["Ice Cream and Frozen Treats", "Indian", "Middle Eastern"], "recipeIngredient": ["2 cups heavy cream", "3/4 cup whole milk", "1/2 cup firmly packed shredded carrots, about 5 medium", "3 tablespoons ginger, grated", "2 tablespoons tahini (sesame paste)", "1 teaspoon spicy cinnamon (often labelled as \"Vietnamese\" or \"Saigon\")", "4 cardamom pods", "2 cloves", "1/4 teaspoon nutmeg", "Salt", "4 large egg yolks", "2/3 cup turbinado sugar (or 1/2 cup packed brown sugar)", "3/4 cup toasted and roughly chopped pistachios"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine cream, milk, carrots, ginger, tahini, and spices over medium heat. Heat on a bare simmer, stirring now and then, for 15 to 20 minutes, until carrots and ginger have softened. Add salt in small pinches to taste. Remove the cloves and cardamom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together egg yolks and sugar till thoroughly combined and lighter in color. While whisking, add two to three ladles of cream mixture into the bowl until the bottom feels warm. Then return the egg mixture to the pot and stir on medium heat till you can swipe a clean line through the base on the back of a spoon, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the base to a blender and purée until smooth, about 2 minutes (remove small cap on the lid of the blender and cover the hole with a kitchen towel to prevent explosions). Pour the base into a bowl and chill overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Churn according to your machine's instructions. In the last minute of churning, add the pistachios. Serve immediately for soft serve, or chill another two hours for firmer ice cream.</p>"}]}