{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100803blueberryorangegranita.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["basil", "blueberries", "Cook the Book", "Danilo Zecchin", "F.W. Pearce", "frozen desserts", "granita", "orange juice", "The Ciao Bella Book of Gelato and Sorbetto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Blueberry Orange Basil Granita", "link": "https://www.seriouseats.com/recipes/2010/08/cook-the-book-blueberry-orange-basil-granita-recipe.html", "description": "The solution to my temporary lack of an ice cream maker was simple and refreshing <strong>Blueberry Orange Basil Granita</strong>.  The granita originated in Sicily and I've always thought of it as the Italian version of a slushie.  I adapted this recipe from a basic template outlined in <em>The Ciao Bella Book of Gelato and Sorbetto</em>.  Blueberries and orange juice are pureed and then placed in a shallow pan in the freezer.  The mixture is chilled for 3 to 4 hours, and stirred every half hour to break up the forming ice crystals.  When finished the granita should be almost frozen and then scraped into light flakes of shaved ice.", "totalTime": "", "recipeYield": "1 1/2 quarts", "recipeCategory": ["Blueberry", "Cook the Book"], "recipeIngredient": ["2 cups blueberries ", "2 cups orange juice", "Basil, finely chopped, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the blueberries and orange juice in a food processor or blender and puree until smooth, then pour into fine-mesh strainer placed over a bowl, pressing the solids to extract the blueberry puree.  Discard the seeds and skins.  Stir in the finely chopped basil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into a 9 by 12-inch baking dish and place in the freezer.  Freeze for 3 to 4 hours, stirring with a fork every 30 minutes to break up the ice crystals, until the granita is almost completely frozen and the texture is like shaved ice.  To serve, scrape the surface of the granita with a fork or ice cream scooper to create shaved crystals.  Scoop into chilled glasses and serve immediately.</p>"}]}