{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100301cremebenedicthow.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["brownies", "brunch", "Cadbury", "cadbury creme eggs", "Cakespy", "candy", "eggs", "eggs benedict"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Cadbury Creme Eggs Benedict", "link": "https://www.seriouseats.com/recipes/2010/03/cakespy-cadbury-creme-eggs-benedict-dessert-breakfast-recipe.html", "description": "Can Eggs Benedict be recreated in a totally sweet form? You bet your bottom silver dollar pancake: <strong>say hello to Cadbury Creme Eggs Benedict.</strong> It's made of stacks of doughnut, brownie, melty Creme Eggs (complete with oozing yolk!), and a topping of rich frosting, all accompanied by a mound of fried pound cake to give the effect of side potatoes.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Breakfast and Brunch", "Cakespy", "Desserts", "Doughnuts", "Eggs Benedict"], "recipeIngredient": ["2 Cadbury creme eggs", "1 plain cake doughnut", "1 brownie, the fudgier the better", "2 to 4 tablespoons' worth of buttercream frosting, to taste", "1 large slice pound cake, cut into small cubes", "1 tablespoons butter", "Red sugar sprinkles, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the \"side potatoes\" by melting 1 tablespoon of butter in a frying pan. Add your cubed pound cake slices and fry on medium heat for about 2 minutes. Flip the pieces and fry for 2 more minutes. Once they are lightly crispy on the edges, they're ready; put them on the side of your serving plate, leaving half of it clear for the Benedict stacks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your plate. Slice your doughnut in half; place the halves, cut side up, side by side on your plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut your brownie in half, the way that you would slice a bagel (so that you have two fully sized but thin brownie pieces). Either cut or shape each piece into a circle so that it is slightly smaller in circumference than the doughnut halves. Place the circles on top of the doughnut halves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note: </strong>While I realize that brownies might not have an accurate hue to represent the layer of ham, I chose them for their sturdy texture and for their deliciousness quotient. A pink cookie or layer of colored marzipan could be substituted if you really wanted a hammy look, though.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the Creme Eggs. The idea here is to get them lightly melty, but not so much that the yolk oozes out. I found that the best way to do this was to either put them on a sheet of aluminum foil atop a baking sheet and put them in either a toaster oven on high or a preheated moderate oven for about a minute. As soon as the tops of the chocolate eggs starts to get a bit shiny, remove them from heat, and very carefully (so as to not puncture the chocolate and let the yolk ooze out) transfer each egg to the top of your two prepared brownie and doughnut stacks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put your buttercream frosting in a small, microwave-safe bowl, and microwave on high for about 10 seconds, with additional increments of 5 seconds each if needed, until the frosting is soft enough that it drips lightly when spooned (you don't want it to be pourable though). Spoon as much as you'd like onto each prepared \"egg\" stack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle each finished stack with red sugar sprinkles; serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/recipes/images/20100301cremebenedictooze.jpg\"><img alt=\"20100301cremebenedictooze.jpg\" src=\"https://www.seriouseats.com/recipes/assets_c/2010/02/20100301cremebenedictooze-thumb-500x375-76218.jpg\" width=\"500\" height=\"375\" class=\"mt-image-none\" style=\"\" /></a></p>"}]}