{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101122-oysters.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["diabetic", "holiday recipes", "oysters", "pine nuts", "sausage", "stuffing", "thanksgiving", "Tom Valenti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Oyster and Sausage Stuffing", "link": "https://www.seriouseats.com/recipes/2010/11/thanksgiving-stuffing-with-oysters-and-sausage-recipe.html", "description": "From chef Tom Valenti's You Don't Have to Be Diabetic to Love This Cookbook...", "totalTime": null, "recipeYield": "8", "recipeCategory": ["Clams, Mussels, and Oysters", "Nuts"], "recipeIngredient": ["1/2 cup pine nuts", "1 tablespoon canola oil", "4 ounces white button mushrooms, cut into large dice", "12 ounces chicken sausage, preferably Italian style (fennel and garlic), casings removed and discarded, sausage crumbled into small pieces", "6 large cloves garlic, very thinly sliced", "3 ribs celery, cut crosswise into 1/4 inch slices", "1 large Spanish onion, diced", "1 1/2 to 2 cups dry croutons, cut from day-old country bread or whole wheat bread", "1 cup dry white wine", "12 oysters, such as bluepoint or Malpeque, shucked and coarsely chopped", "1 cup store-bought low-sodium chicken broth", "1 tablespoon chopped fresh marjoram leaves", "1 teaspoon fresh thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350° F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pine nuts in a heavy bottomed pan and toast over medium heat, shaking the pan to prevent scorching, until lightly toasted, about 3 minutes.  Transfer the pine nuts to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully wipe out the pan and set it over medium-high heat. Add the oil and let it get nice and hot. Add the mushrooms and cook them until they begin to give off their liquid, about 5 minutes. Transfer the mushrooms to the bowl with the pine nuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sausage to the pan and cook over medium heat until the fat is rendered and the sausage browns, about 8 minutes. Add the garlic, celery, and onion to the pan and cook until softened but not browned about 4 minutes. Transfer the sausage and vegetables to the bowl. Add the croutons to the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the stove top over medium heat. Add the white wine and cook, stirring to loosen any flavorful bits stuck to the bottom of the pan. Add the oysters and cook gently, about 2 minutes. Stir in the chicken broth and bring to a boil, then immediately pour the oysters and liquid over the contents of the bowl.  Add the marjoram and thyme and, using 2 wooden spoons or latex-gloved hands, work everything together. (If you are using your hands, let the mixture cool slightly before delving in.) Transfer the stuffing to a casserole dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the stuffing until crusty on top and heated through, 35 to 40 minutes. Serve the stuffing hot.</p>"}]}