{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100930-dt-spaghetti-with-celeriac-puree.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["celeriac", "chile", "Dinner Tonight", "Jamie Oliver", "pasta", "spaghetti", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Spaghetti with Thyme-Chile Celeriac Puree", "link": "https://www.seriouseats.com/recipes/2010/09/spaghetti-with-thyme-chile-celeriac-puree-recipe.html", "description": "In this recipe, the noodles are draped in a <strong>gently spicy and fragrant mash of celeriac</strong>&mdash;the texture of the pasta plays a starring role. Celeriac, a cousin of celery, is grown for its large root rather than the stalks we all recognize. It has that same wonderful grassy, aromatic flavor. A hit of fresh chile, thyme, and garlic round out the flavor.  The puree comes from a <strong>Jamie Oliver</strong> recipe that uses it as a stuffing for ravioli. (I took the shorter route of simply tossing it with pasta.)", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pasta"], "recipeIngredient": ["1 pound spaghetti", "1 tablespoon olive oil", "1 large celeriac, peeled and diced into 1/2-inch cubes", "1 tablespoon fresh thyme leaves", "2 cloves garlic, peeled and minced", "1/2 fresh red chile, minced, or a crushed red pepper flakes to taste", "2 tablespoons unsalted butter", "1/2 teaspoon minced fresh parsley, for garnish", "Grated Parmesan cheese, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large (12-inch) skillet over medium heat until shimmering, then add the celeriac along with a pinch of salt and pepper.  Cook until the celeriac has begun to color, then add the thyme leaves, garlic, and chile and continue to cook for another 3 to 4 minutes.  Add about 1/2 cup of hot water to the skillet, cover, and turn the heat to low.  Simmer until the celeriac is tender, about 20 minutes, adding more water if the pan gets completely dry. Once tender, mash the celeriac with a potato masher or wooden spoon to create a rustic puree.  Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a large pot of salty water to boil.  Cook the pasta until a minute away from al dente.  Reserve 1 cup of pasta water before draining, then add the noodles to the puree along with some of the pasta cooking water.  Cook on low, adding pasta water as needed, until the pasta is al dente.  Finish with the butter to create a silky sauce, then serve with fresh parsley and Parmesan.</p>"}]}