{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101209-127960-eat-for-eight-bucks-gnocchi-and-red-cabbage-gratin.JPG", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["affordable", "cabbage", "Eat for Eight Bucks", "gnocchi", "gratin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat For Eight Bucks: Gnocchi and Red Cabbage Gratin", "link": "https://www.seriouseats.com/recipes/2010/12/eat-for-eight-bucks-gnocchi-cabbage-gratin.html", "description": "Potatoes and cabbage remind me of the diet Charlie Bucket and his family survived on before Willy Wonka's golden ticket came their way. But prepare these humble ingredients with a little Italian flair, and you'll have an elegant, affordable dish.", "totalTime": "2 hours", "recipeYield": "3-4", "recipeCategory": ["Cabbage", "Eat for Eight Bucks"], "recipeIngredient": ["1/4 cup olive oil, plus more for drizzling", "3/4 teaspoon caraway seeds", "2 tablespoons unsalted butter", "1 onion, thinly sliced", "About 5 cups thinly sliced red cabbage (from 1.5 pounds)", "salt", "1 pound fresh potato gnocchi", "1 cup fresh sourdough breadcrumbs, made from 2 slices stale soudough bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil over high heat until it shimmers. Add the caraway seeds and cook them for about 30 seconds. Add the butter and let it melt, then add the onion and cabbage and cook for 1-2 minutes, tossing to coat all the vegetables with the fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to low, cover the pot, and cook for 45 minutes, stirring occasionally. The cabbage should be completely wilted, almost buttery. Add ¾ teaspoon salt and stir to distribute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When there are about 20 minutes left to go on the cabbage, bring a pot of water to boiling. Salt it generously, then add the gnocchi. Cook for just 1 minute—any more and they’ll start to fall apart. Drain in a colander and rinse with cool water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 9 x 13 inch baking pan, spread about ¾ of the cabbage. Arrange the gnocchi on top of the cabbage in one layer. Top with heaps of the remaining cabbage, making sure not to leave some gnocchi exposed so they get crispy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the breadcrumbs across the top and top with freshly ground pepper. Drizzle with a bit more olive oil. Bake for 30-40 minutes, until the breadcrumbs are toasted and the gratin is  bubbly. Serve immediately.</p>"}]}