{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100203chili.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beans", "chilis", "Cook the Book", "Lucinda Scala Quinn", "Mad Hungry", "spicy", "Super Bowl chilis"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Chili", "link": "https://www.seriouseats.com/recipes/2010/02/spicy-chili-recipe.html", "description": "\"All along I had been searching for a chili that tasted like chiles, and this one was it.\" [Photograph: Caroline Russock] Recently I have been craving nothing but spicy food&mdash;really spicy food. Not just hot sauce spicy but tingling, lip-burning,...", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Chili", "Cook the Book", "Mains"], "recipeIngredient": ["5 dried red chilies (Mexican ancho, New Mexican Hatch, or Anaheim)", "1 tablespoon olive oil", "1 cup chopped onion", "3 garlic cloves, minced (1 tablespoon)", "2 pounds ground beef", "1 tablespoon coarse salt", "1 teaspoon ground cumin", "1/4 teaspoon crushed red pepper flakes, or pinch cayenne pepper", "1/2 teaspoon dried oregano", "1 bay leaf", "1/4 cup pickled jalapeños, chopped (optional)", "1 28-ounce can tomatoes, broken up, with juice", "12 ounces beer", "1 15-ounce can beans (pinto, kidney, black, or a combination), drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a dry large skillet over high heat, lightly toast both sides of the chilies for a few minutes.  After roasting, remove from pan to slice open, then remove and discard the stem and seeds.  Cover the chilies in boiling water and let soften for 5 minutes.  In a blender or food processor, puree the chiles with enough soaking liquid to form a thick paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the skillet again over medium-high heat, then add the olive oil.  Saute the onion and garlic until translucent, about 3 minutes.  Increase the heat and add the beef, stirring occasionally to pick up browned bits on the bottom of the pan as the moisture evaporates, about 15 minutes.  If the meat is excessively fatty (your judgement call), spoon off some of the fat, but leave some for flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the cumin and cook for 30 seconds.  Add the chile paste, red pepper flakes, oregano, bay leaf, jalapeños, and the remaining teaspoon of salt.  Stir to combine well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes and beer and simmer for 30 minutes.  Add the beans and cook for an additional 20 minutes.  Add water if needed for consistency.  Serve with preferred condiments.</p>"}]}