{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100412superlemonysouffles.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["citrus", "Cook the Book", "david lebovitz", "desserts", "lemon", "Ready for Dessert", "souffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "David Lebovitz's Super-Lemony Soufflés", "link": "https://www.seriouseats.com/recipes/2010/04/david-lebovitzs-super-lemony-souffle-recipe.html", "description": "Truth be told, I was a little nervous about this whole soufflé endeavor (visions of fallen soufflés haunted me).  But as it turned out, these little lemony concoctions were a breeze, not more involved than making a stovetop custard and folding in whipped egg whites.  And once they came out of the oven, perfectly puffy and lightly browned on top, I realized they might just be the ideal summer dessert.", "totalTime": null, "recipeYield": "6", "recipeCategory": ["Cook the Book", "Desserts", "Lemon", "Puddings and Custards"], "recipeIngredient": ["3 tablespoons (25 g) all-purpose flour", "1/3 cup (65 g) plus 1 1/2 tablespoons sugar, plus more for sprinkling", "Pinch of salt", "2/3 cup (160 ml) whole milk", "4 large eggs, separated", "2 tablespoons (1 ounce/30 g) unsalted or salted butter", "Grated zest of 1 lemon, preferably organic", "1/4 cup (30 g) Soft-Candied Lemon Peel ", "&nbsp", "<strong> Soft-Candied Citrus Peel </strong>", "3 1/2 tablespoons (50 ml) plus 1 1/2 teaspoons freshly squeezed lemon juice", "5 lemons (preferably organic), washed", "2 cups (500 ml) water", "1 cup (200 g) sugar", "1 tablespoon light corn syrup  (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position an oven rack in the upper third of the oven and preheat the oven to 400&deg;F.  Butter six 4-ounce (125 ml) ramekins or soufflé molds.  Pour some sugar into each and tilt the ramekin to coat the sides; gently tap out any excess.  Set the ramekins in a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the soufflé base, in a medium saucepan, whisk together the flour, 1/3 cup (65 g) sugar, and the salt.  Whisk in about one-third of the milk to make a smooth paste, then whisk in the rest of the milk.  Cook the mixture over medium heat, stirring frequently, until thickened to the consistency of thin yogurt, about 5 minutes.  Remove from the heat and whisk in the egg yolks and butter.  Return to the heat and cook until the mixture just begins to boil and a few bubbles pop on the surface.  Transfer to a bowl that holds at least 4 quarts (4 liters).  Stir in the fresh and candied lemon zest and let cool for 15 minutes.  Stir in 3 1/2 tablespoons (50 ml) lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the stand mixer fitter with the whip attachment (or in a bowl by hand), whisk the egg whites on low speed until frothy.  Increase the speed to high, gradually add the remaining 1 1/2 teaspoons of sugar, and continue whisking until the whites form shiny, stiff peaks.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold one-quarter of the whipped egg whites into the soufflé base, then gently fold in the remaining whites, taking care not to deflate them.  A few streaks of egg whites are preferable to an overfolded and deflated soufflé mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the soufflé mixture evenly among the prepared ramekins.  Sprinkle each with a light, even dusting of sugar and 1/4 teaspoon lemon juice.  Bake until the tops are light brown and the soufflés quiver when gently nudged, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the soufflés right away.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Storage:</strong>  You can prepare and refrigerate the soufflé base up to 1 day in advance, then whip and fold in the egg whites when you are ready to bake.  The soufflé mixture, once divided among the ramekins, can stand at room temperature for 1 hour before baking.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Soft-Candied Citrus Peel</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp vegetable peeler and working for pole to pole, remove the zest from the citrus fruits in strips about 1 inch (3 cm) wide.  Try to remove only the colored portion of the rind and leave the bitter white pith on the fruit.  (If you've peeled too deeply, you can lay the strips flat on a counter, pith side up, and carefully trim away the pith with a knife.)  Using a sharp knife, cut the strips of zest lengthwise into pieces about as narrow as a wooden match.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the peel in a medium saucepan and add water to generously cover.  Bring to a boil and cook until the peel is soft and translucent, 5 to 6 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the peel and discard the water.  In the same saucepan, bring the 2 cups of water, sugar, and corn syrup, if using, to a boil, stirring to dissolve the sugar.  Add the drained peel, decrease the heat to maintain a gentle boil, and cook until the peel is translucent and the syrup is thick, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you like you can use a candy thermometer to gauge doneness; the mixture should register about 210&deg;F (100&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool, then transfer the peel and syrup to a clean jar, cover tightly, and refrigerate until ready to use.</p>"}]}