{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100426pretzelcombo.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "chocolate", "Combos", "food holidays", "pretzels"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Chocolate-Filled Pretzel Nuggets", "link": "https://www.seriouseats.com/recipes/2010/04/cakespy-homemade-chocolate-filled-pretzels-nuggets-recipe.html", "description": "Guess what? <strong>Today is National Pretzel Day. </strong>But how to celebrate? On the one hand the answer is painfully obvious&mdash;eat pretzels. But what <em>kind</em> of pretzels? Well, here's a suggestion for those who like plenty of sweet with their salty: chocolate-filled pretzel nuggets. These pillow-like nuggets are sort of like <strong>Combos meet chocolate-covered pretzel</strong>&mdash;that is to say, the pinnacle of sweet and salty pretzel perfection.", "totalTime": "", "recipeYield": "about 40 nuggets, or 10 large pretzels", "recipeCategory": ["Cakespy", "Chocolate"], "recipeIngredient": ["<strong>For the pretzel dough:</strong>", "1 3/4 cups warm water", "1 package active dry yeast", "1 tablespoon sugar", "1 teaspoon salt", "2 3/4 cups flour", "<strong>For the filling:</strong>", "1/2 stick butter (1/4 cup)", "1/2 bag (about 1 cup) chocolate chips", "10 cups water", "2/3 cup baking soda", "Egg wash, as needed", "1/4 cup salt", "<strong>Special Equipment:</strong>", "Slotted spoon for removing nuggets from poaching water (optional, but helpful)", "Deep sauté pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the dough. Combine warm water, yeast, sugar, and salt; mix well and allow to sit until foamy. Pour yeast mixture into a large mixing bowl and add flour, a bit at a time, to form a dough. Once the dough does not stick to the sides of the bowl, turn out onto a floured work surface and knead for 5 to 10 minutes, adding flour as needed to prevent the dough from sticking. Form the dough into a ball, place in an oiled bowl, cover with a dish towel and allow to rise in a warm place until doubled in size--about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your filling. In a medium saucepan, combine chocolate chips and butter on low heat, stirring frequently, until the mixture is smooth and glossy. This can also be done by heating the mixture in the microwave in 20 second intervals until melted. Put your chocolate mixture off to the side for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 450&deg;F. divide the dough into quarters and roll, one quarter at a time, into a 1/6-inch sheet. Cut the dough sheet into squares, about an inch and a half each. Place 1/4 teaspoon of the chocolate mixture in the center of each of the dough squares; bring the corners to the center and pinch together to seal. They'll look like little pillows at this point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the water and baking soda in a deep sauté pan. Poach the pretzel nuggets for about 30 seconds. (As I learned from <a href=\"http://www.garrettkern.com/?p=212\">Garrett's Table</a>, \"the alkali water causes the dough to gel immediately on the outside of the pretzel, ensuring a rich brown, shiny, and crunchy crust\"). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the nuggets from the poaching liquid and place on a baking sheet lined with parchment paper. </p>"}]}