{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/dt-blackeyedpeacurry.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["660 Curries", "black eyed peas", "cinnamon", "Dinner Tonight", "peas", "Raghavan Iyer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Cinnamon-Flavored Black-Eyed Peas", "link": "https://www.seriouseats.com/recipes/2010/02/cinnamon-flavored-black-eyed-peas-recipe.html", "description": "\"Each bite is layered and intense.\" Last time I ate black-eyed peas, I was nestled up to the bar at Ed Mitchell's barbecue joint, The Pit, in Raleigh, North Carolina. They looked familiar and comforting, swimming in a porky broth...", "totalTime": null, "recipeYield": "3 to 4", "recipeCategory": ["Dinner Tonight", "Legumes", "Vegetarian"], "recipeIngredient": ["1 cup dried black-eyed peas", "1/4 large red onion, thinly sliced", "3 tablespoons canola oil", "4 garlic cloves, peeled", "2 tablespoons tomato paste", "2 teaspoons kosher salt", "1/2 teaspoon cayenne", "1/4 teaspoon ground turmeric", "2 cinnamon sticks", "2 bay leaves", "2 cardamom pods", "2 tablespoons fresh cilantro, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump the black-eyed peas into a large pot. Pour enough water in to cover, then stir with your fingers. The water might appear slightly dirty. Drain this water off and repeat this process twice, then pour in 3 cups of water and turn the heat to high. When boiling, cover the pot, reduce heat to medium-low and cook for 35 to 45 minutes or until tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour 1 tablespoons of the oil into a small skillet set over medium heat. Add the red onion. Stir often, and cook until they are well caramelized and dark purple. It should take about 25 to 30 minutes. When done, add this to a blender along with 1/4 water and the garlic cloves. Blend until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic and red onion mixture with 1/2 cup water, tomato paste, salt, cayenne, and turmeric in a bowl. Stir well until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the rest of the oil into a skillet over medium-high heat. Add the cinnamon sticks, bay leaves, and cardamom pods. Cook for about 30 seconds, or until fragrant, then add spice mixture. Stir well, then reduce heat to medium-low. Partially cover the pan and simmer for 8 minutes. When done, turn off the heat and wait for the black-eyed peas to finish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the black-eyed peas are tender, pour in the sauce from the skillet. Simmer the blacked-eyed peas for another 10 minutes, stirring occasionally. Remove the cinnamon sticks, bay leaves, and cardamom pods.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serves with white rice and a sprinkling of cilantro. </p>"}]}