{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100910-duck-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "beer", "Chinese", "duck", "honey", "pancakes", "Peking duck", "plum sauce", "soy sauce", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "5"}, "name": "Peking Duck with Mandarin Pancakes and Plum Sauce", "link": "https://www.seriouseats.com/recipes/2010/09/peking-duck-mandarin-pancakes-plum-sauce-recipe.html", "description": "For best results, use a Pekin breed duck. Maltose syrup can be found in most Chinese supermarkets. If you can't find it, honey can be used in its place. To handle maltose, keep your hands and measuring equipment wet at...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Chinese", "Duck", "Other Meats"], "recipeIngredient": ["<strong>For the Duck:</strong>", "1 whole duck, about 4 pounds", "1/4 cup maltose syrup or honey (see note)", "2 teaspoons soy sauce", "2 tablespoons kosher salt", "2 teaspoons baking powder", "One 16-ounce tall boy of beer, emptied and refilled half way with water", "<strong>For the Mandarin Pancakes</strong>", "2 cups (10 ounces) all-purpose flour", "2/3 cup (about 5 ounces) boling water", "1/4 cup sesame oil", "<strong>For the Plum Sauce:</strong>", "1/4 cup sugar", "1/4 cup distilled white vinegar", "8 Italian prune plums or 4 regular plums, split in half and pitted", "1 tablespoon soy sauce", "2 teaspoons grated fresh ginger", "1 tablespoon Chinese chili garlic sauce", "<strong>To Serve:</strong>", "6 scallions, white and light green parts only, finely sliced lengthwise", "1 small cucumber, seeded and cut into 4-inch long matchsticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Duck:</strong> Dry duck carefully with paper towels and place on wire rack set in foil-lined rimmed baking sheet. Using fingers or dull handle of a wooden spoon, carefully separate skin from breast meat by inserting fingers through bottom of breasts and slowly working your way up. Be careful not to tear skin. Combine maltose and soy sauce with 1 tablespoon water in small microwave-safe bowl. Microwave on high until maltose is softened, about 20 seconds. Stir together mixture with spoon until homogeneous. Spoon mixture over duck and rub over entire surface, making sure to coat all exposed skin. Combine salt and baking powder in small bowl. Sprinkle evenly over all surfaces of duck. Refrigerate duck, uncovered, at least 12 and up to 36 hours until surface is completely dry with leathery appearance.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust rack to lowest position and preheat oven to 350&deg;F. Bring 4 quarts water to a rolling boil in a large stockpot. Place duck on wire rack set in sink. Pour half of boiling water over top surface of duck, making sure to cover skin evenly. Flip duck and pour remaining boiling water over second side. Allow duck to dry 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stand duck vertically by inserting beer can into cavity and place on wire rack set in rimmed baking sheet. You may need to break or remove the duck's tail to get it to stand. Roast, rotating after 30 minutes until skin is a deep mahogany, about 1 hour. Reduce heat to 250 and continue roasting until fat stops dripping from cavity, about 30 minutes longer. Carefully remove duck from beer can and transfer to cutting board. Allow to rest 10 minutes before carving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pancakes:</strong> Combine flour and boiling water in medium bowl and stir with wooden spoon until shaggy dough forms. Turn out on floured countertop and knead until dough is smooth and elastic, about 5 minutes. Cut dough into 24 even pieces about 1 tablespoon each. Cover with damp towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On floured surface, roll one piece of dough into three-inch circle. Repeat with second ball. Using pastry brush, coat top of first ball with thin film of sesame oil. Place second ball on top of first. Roll balls together into 8 to 10-inch circle (the thinner the better). Preheat heavy-bottomed 12-inch cast iron or non-stick griddle pan or skillet over medium-high heat until hot. Place pancakes on griddle and cook until lightly browned in spots on first side, about 1 minute. Flip and repeat on second sides, about 30 seconds longer. Transfer to plate lined with clean kitchen towel and carefully peel pancakes apart. Fold towel over cooked pancakes to keep warm and repeat with remaining dough balls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Plum Sauce:</strong> combine sugar with 1 tablespoon water in heavy-bottomed 2-quart saucepot. Melt over high heat and continue to cook, gently swirling pan, until sugar is deep golden brown, about 3 minutes. Immediately add all of vinegar in one go (sugar will bubble rapidly) and cook until sugar redissolves, about 1 minute.add plums, soy sauce, ginger, and chili garlic sauce, reduce heat to medium low, and cook, mashing plums with back of wooden spoon until plums are completely broken down, about 10 minutes. Blend sauce with immersion blender or in standing blender until smooth. Transfer to small bowl to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Carve duck, making sure to remove all skin, including skin on the back and legs. Spread one pancake with sauce, top with cucumber and scallion, and add duck meat and skin sparingly, arranging all ingredients in a vertical line through center of pancake. Fold up bottom quarter of pancake to center, then roll pancake, enclosing ingredients. Eat immediately.</p>"}]}