{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100316-crabby-falafel.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["crab", "falafel", "seafood", "sliders", "small plates"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crabby Falafel 'Sliders'", "link": "https://www.seriouseats.com/recipes/2010/03/small-plates-crabby-falafel-sliders-recipe.html", "description": "These crab and chickpea \"sliders\"* start with a slightly streamlined, miniaturized version of Mantuano's Falafel Crab Cakes (I use canned chickpeas, tweak the spice blend to make it more sandwich-friendly, and add a tiny bit of flour to help the patties hold together more easily during the frying stage), which he describes as from \"southern Spain, which owes many culinary inspirations to the Moors of Northern Africa.\"", "totalTime": null, "recipeYield": "12 sliders", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Lobster and Crab"], "recipeIngredient": ["One (14.4 ounce) can chickpeas beans, drained", "1/2 teaspoon baking powder", "1 teaspoon ground cumin", "1/2 cup loosely packed, roughly chopped cilantro leaves", "2 scallions, roughly chopped", "1 tablespoon grated lemon zest, from 1 lemon", "1/2 jalapeño pepper, seeds and ribs removed, chopped fine (optional)", "1 garlic clove, peeled and grated on microplane or passed through garlic press", "2 tablespoons flour", "1/2 pound fresh picked lump blue crab meat", "Kosher salt and freshly ground black pepper", "1/2 fennel bulb, cored, and thinly sliced on a mandoline", "1 tablespoon juice from 1 lemon", "1/2 cup olive oil", "12 slider-sized potato rolls, toasted", "1/2 cup harissa aioli (recipe follows)", "5 tablespoons mayonnaise", "3 tablespoons harissa paste", "1 teaspoon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chickpeas, baking powder, cumin, cilantro, scallions, lemon zest, jalapeño (if desired), garlic clove, and flour in bowl of food processor. Pulse until mixture holds together, but chunky bits of chickpea still remain, about 8-10 one-second pulses (do not process into paste). Transfer mixture to large bowl and gently fold in crab meat. Season to taste with salt and pepper, and mix again until homogenous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss shaved fennel with lemon juice and olive oil in medium bowl. Season to taste with salt and pepper. Form crab mixture into 12 equal portions and form into patties roughly two inches across. Refrigerate crab cakes and fennel until ready for use, up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining oil in heavy-bottomed 12-inch non-stick or cast-iron skillet over medium-high heat until just beginning to smoke. Carefully add crab patties (if oil continues to smoke after crab patties are added, reduce heat to medium). Cook, gently shaking pan occasionally until deep golden brown, 2-4 minutes. Carefully flip using tongs, and continue to cook, gently shaking pan occasionally, until golden brown on second side, 2-4 minutes. Transfer cooked patties to plate lined with double layer of paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>spread harissa mayonnaise evenly over bun tops and bottoms. Place a small pile of shaved fennel over each bun bottom. Top with crab patties, close sandwich, and serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Harissa Mayonnaise</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes 1/2 cup - </em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> Harissa is a spicy North African condiment made with chiles, spices, and vegetables. It can be found in cans or jars in the international aisle of many supermarkets, or is available online. I recommend <a href=\"http://www.amazon.com/Harissa-Condiment-Tube-Spicy-150/dp/B002L0IRQG/ref=sr_1_5?ie=UTF8&s=gourmet-food&qid=1267989988&sr=8-5\">DEA brand harissa</a>, which balances out chile heat with complex vegetal flavors, and comes in a resealable metal tube.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all ingredients in small mixing bowl and whisk to combine. Store in airtight container, refrigerated, for up to 1 week.</p>"}]}