{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100830CremeBrulee610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["Crème Brûlée", "desserts", "French in a Flash", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash (Classic): Vanilla Bean Crème Brûlée", "link": "https://www.seriouseats.com/recipes/2010/09/french-in-a-flash-classic-vanilla-bean-creme.html", "description": "Classic, excellent crème brûlée takes only four ingredients and ten minutes of your time, and you can make it ahead. In fact, you should.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Desserts", "French"], "recipeIngredient": ["2 1/2 cups heavy cream", "1 vanilla bean, split and scraped", "1/3 cup plus 6 teaspoons granulated sugar, divided", "4 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 300°F. Add heavy cream, vanilla bean seeds, and pod to small saucepot. Heat over medium-high heat, stirring frequently until little bubbles form around sides of the cream in the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Combine egg yolks and 1/3 cup sugar in bowl of stand mixer fitted with whisk attachment. Whisk on medium speed until pale yellow and yolks fall off of whisk in ribbons, about 2 minutes, scraping bowl as necessary. With mixer running on medium-low speed, slowly add hot cream mixture. Whisk until thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a folded kitchen towel (or a few paper towels) on the bottom of a roasting pan or glass baking dish large enough to hold six 6-ounce ramekins. Place ramekins on top of towel and ladel custard base evenly between them. Remove one ramekin and carefully pour hot water into baking dish until it comes 1/2 way up sides of ramekins. Replace missing ramekin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until custard is set but still jiggles in center, about 40 minutes. Remove from oven and allow to cool to room temperature without removing ramekins from water bath. Once cool, cover ramekins in plastic and refrigerate until set, at elast 4 hours, and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, sprinkle each ramekin with 1 teaspoon sugar. Brown with kitchen torch, and serve immediately.</p>"}]}