{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/mintleaf.jpg", "author": {"@type": "Person", "name": "Ethan Frisch"}, "recipeCuisine": "", "keywords": ["chocolate", "espresso", "espresso beans", "gelato", "ice cream", "mint"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scooped: Ginger Mint and Chocolate-Covered Espresso Bean Gelato", "link": "https://www.seriouseats.com/recipes/2010/10/ginger-mint-chocolate-covered-espresso-bean-gelato-recipe.html", "description": "Gelato just might be the most misunderstood form of ice cream in our great, ice cream-lovin' nation. We know it's smooth, intense and delicious but <strong>what makes a gelato real gelato?</strong> Here are the three elements that differentiate real-deal gelato from the traditional American stuff, and a recipe for a caffeinated twist on mint 'n' chip.", "totalTime": "8 hours", "recipeYield": "1 quart", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["2/3 cup milk", "3 1/3 cups heavy cream", "5-6 stalks of fresh mint, roughly torn (stems and leaves still attached)", "About half an inch of fresh ginger, peeled and roughly chopped", "1/2 cup sugar", "1/3-1/2 cup chocolate covered espresso beans, crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the milk and cream in a heavy pot and set on low heat. Add mint and ginger. Cook until mint and ginger are infused into milk, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the dairy through a fine sieve to remove the mint and ginger, and whisk in the sugar. Let the mixture cool overnight (or for at least 4 hours) in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spin the mixture in your ice cream machine according to manufacturer's instructions. While spinning, place large mixing bowl in freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the ice cream is finished spinning, remove it from the machine directly into frozen bowl and fold in the crushed espresso beans. Return bowl to freezer until ice cream solidifies, at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass around some spoons and share it directly out of the bowl. Gelato doesn't really improve with age, so try to force yourself to eat it within a few days of making it. But we don't really foresee that being a problem.</p>"}]}