{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100104-broccoli.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["broccoli", "Cook the Book", "healthy", "Jamie Oliver", "Jamie's Food Revolution", "pasta", "pesto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Broccoli and Pesto Tagliatelle", "link": "https://www.seriouseats.com/recipes/2010/01/broccoli-and-pesto-tagliatelle-pasta-recipe.html", "description": "[Flickr: poluz] I constantly have to remind myself that every dinner doesn't have to be a production&mdash;nor does every meal have to require a special trip to the market for new ingredients. Sometimes all you have to do is look...", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Broccoli", "Cook the Book", "Pasta", "Pesto"], "recipeIngredient": ["1 medium potato", "1 head broccoli", "A large bunch of  fresh basil", "Sea salt", "1 pound dried tagliatelle", "1/4 cup green pesto", "3 ounces Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and peel the potato and cut it into very thin shavings using a speed peeler.  Cut little broccoli florets off the head and put them to one side.  Halve the thin stalk lengthwise, then slice thinly.  Pick the basil leaves and discard the stalks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pan of salted water to a boil.  Add the tagliatelle and broccoli stalks and cook according to the tagliatelle package instructions.  Two minutes before the the tagliatelle is cooked, add the broccoli and potato slices.  Drain everything in a colander over a large bowl, reserving some of the  cooking water, and return to the pan.  Roughly chop half of your basil leaves and add to the pan with the pesto and half of the Parmesan.  Give it all a good stir and if the sauce is too thick for you, add a splash of the cooking water to thin it out a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta between your serving bowls.  Sprinkle over the rest of the Parmesan and the remaining basil leaves.  Serve it a lovely big bowl of salad.</p>"}]}