{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100722roastedbeetsaladwithwalnutdressing.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beets", "chard", "cheese", "Cook the Book", "dandelion greens", "Emeril Lagasse", "Farm to Fork", "salads", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Roasted Beet Salad with Walnut Dressing and Cheese Crisps", "link": "https://www.seriouseats.com/recipes/2010/07/roasted-beet-salad-with-walnut-dressing-and-cheese-crisps-recipe.html", "description": "Once I brought the beets and chard home I turned to the pages of <em><a href=\"http://www.amazon.com/Farm-Fork-Cooking-Local-Fresh/dp/0061742953/serieats-20\">Farm to Fork</a></em> by <a href=\"http://www.harpercollins.com/books/Farm-to-Fork-Emeril-Lagasse?isbn=9780062003584&amp;HCHP=TB_Farm+to+Fork\">Emeril Lagasse</a> for a bit of inspiration.  And what I found was this <strong>Roasted Beet Salad with Walnut Dressing and Cheese Crisps</strong>.  Roasted beets?  Yes, please.  But raw chard?  I had never used it in its raw state but the young chard that I brought home had much thinner, softer leaves that seemed like they would work beautifully in a salad.", "totalTime": "", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["3 to 4 small red and/or golden beets, tops removed, washed", "1/2 cup plus 2 tablespoons olive oil", "3 tablespoons water", "1/2 teaspoon salt, plus more for seasoning", "1/4 teaspoon freshly ground black pepper, plus more for seasoning", "1/4 cup sherry vinegar or Banyuls vinegar (see note)", "1 tablespoon finely chopped shallot", "1 tablespoon honey", "1/4 teaspoon Dijon mustard", "1/2 cup chopped toasted walnuts", "1 teaspoon minced fresh tarragon leaves", "1 bunch baby dandelion greens, stems removed, leaves rinsed and cut into bite-size", "(about 6 cups or 6 ounces of greens)         ", "1 bunch rainbow chard, stems removed, leaves rinsed and cut into bite-size pieces", "Cheese Crisps (recipe follows) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a piece of aluminum foil about 12 inches square. On one half of the square, place the beets, 2 tablespoons olive oil, water, 1/4 teaspoon of the salt, and 1/8 teaspoon of the pepper. Fold the opposite side of the foil over to cover the beets, and seal all the edges tightly to form a packet. Place the packet on a baking sheet, transfer it to the oven, and cook until the beets are tender, about 45 minutes. (The beets are done when a paring knife is easily inserted into the middle.) Remove the packet from the oven and set it aside, unopened, for about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the beets from the foil packet. When the beets are cool enough to handle, gently rub off the skin, using a paper towel. Slice the beets into 1/4-inch thick rounds (use a mandoline if you have one), and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the vinegar, shallot, honey, mustard, remaining 1/4 teaspoon salt, and remaining 1/8 teaspoon pepper in a blender, and mix well. While the blender is still running, add the oil in a slow, steady stream, blending until the vinaigrette is emulsified. Transfer the dressing to a mixing bowl, and stir in the walnuts and tarragon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dandelion greens and the chard in a large bowl. Pour 2 tablespoons (or more to taste) of the dressing over the greens, and season with a pinch of salt and pepper. Toss to coat. In a separate mixing bowl, toss the sliced beets in 1 tablespoon of the dressing, and season with a pinch of salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the greens among four to six serving plates, and garnish with the sliced beets and the Cheese Crisps. If desired, spoon more dressing over each salad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong>  Banyuls vinegar is made from Banyuls wine, which is a fortified wine from southern France and is considered to be the French version of port. Banyuls vinegar has a sweet and nutty flavor, which is generally thought to be milder than red wine vinegar or balsamic vinegar. It tastes something like a cross between balsamic vinegar and sherry vinegar and either can be used as a good substitute. Banyuls vinegar can be found in specialty markets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Cheese Crisps</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Line a baking sheet with a Silpat, or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spacing them 1 to 2 inches apart, place 1-tablespoon mounds of the cheese on the Silpat. Place the baking sheet in the oven and cook until the cheese melts and turns golden brown, about 7 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and set aside to cool on the baking sheet. Use the crisps as a garnish for soups and salads. </p>"}]}