{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100123-rabbitpie.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["pies", "prunes", "rabbit", "savory pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rabbit, Prune, and Onion Pie", "link": "https://www.seriouseats.com/recipes/2010/01/rabbit-prune-and-onion-pie-recipe.html", "description": "...", "totalTime": "", "recipeYield": "serves 6 to 8", "recipeCategory": ["Mains", "Other Meats"], "recipeIngredient": ["Savory pie dough, for double crust deep pie (preferably lard-based)", "1 whole white rabbit, skinned, 3 1/2 to 4 pounds (or one 3 1/2 to 4 pound chicken), broken down into 8 pieces", "Kosher salt and freshly ground black pepper", "All-purpose flour", "2 tablespoons vegetable oil", "1 glass dry sherry or vermouth", "1 1/5 quarts low-sodium chicken broth (preferably home made)", "1 yellow onion, roughly chopped", "2 large carrots, peeled, divided", "3 stalks celery, peeled, divided", "6 sprigs thyme, divided", "3 bay leaves", "1/2 teaspoon whole fennel seeds", "1/2 teaspoon whole coriander seeds", "1/2 teaspoon whole black peppercorns", "4 tablespoons butter, divided", "16 pearl or small cippolini onions, peeled", "12 prunes, pitted and cut into 1/4-inch pieces", "1 pound root vegetables (carrots, parsley, rutabaga, turnip, whatever) cut into 1/2-inch dice", "1 tablespoon finely minced parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season rabbit pieces with salt and pepper and dust with all purpose flour. Heat vegetable oil over medium high heat in large, heavy-bottomed stock pot until just smoking. Add rabbit and cook until well browned on all sides, 6 to 10 minutes total. If pan starts to smoke or fond begins to burn, lower heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sherry or vermouth and cook, scraping bottom of pan with wooden spoon or spatula to loosen browned bits. Reduce liquid to about 2 tablespoons, then add chicken stock, onion, 1 carrot, 2 stalks celery, 3 sprigs thyme, bay leaves, fennel seeds, coriander seeds, and black pepper. Bring to a boil, then reduce to a simmer and cook, skimming occasionally, for 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove rabbit pieces with tongs, and allow to cool slightly. Pick meat from bones, shred into 1-inch pieces, and set aside in refrigerator. Return bones to stock, and continue to simmer for further 1 1/2 hours, adding hot water as necessary to keep bones mostly submerged.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain stock into large bowl and discard solids (you should have about 1 quarts of stock). Heat 1 tablespoon butter in 10-inch heavy-bottomed sautee pan over medium heat until foaming subsides. Add onions, turn heat to low, and cook, stirring frequently, until onions are completely tender, and well caramelized (interior of onions may squeeze out. Don't worry). Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dice remaining carrots and celery into 1/2-inch pieces. Pick leaves off of remaining thyme sprigs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter over medium-high heat in large stockpot over medium-high heat. Add flour and cook, stirring frequently, until golden brown and fragrant. Slowly add stock while whisking constantly, and bring to a boil. Simmer until thickened, and reduced to 3 cups. Add rabbit, onions, diced carrots, diced celery, thyme leaves, prunes, root vegetables, and parsley. Season to taste with salt and pepper. Allow filling to cool completely in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to lower middle position, and preheat oven to 400°F. Roll out pie dough according to recipe directions and line bottom of deep dish pie plate, small casserole, or large cast-iron skillet. Add filling, and cover with top crust, sealing edges. Cut vents in top with knife or tines of a fork. Bake for 15 minutes. Reduce heat to 350°F, and continue to bake until golden brown and hot throughout, 45 minutes to 1 hour longer. Allow to cool slightly before slicing and serving.</p>"}]}