{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100812curriedmussels.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "curry", "David Leite", "mussel", "mussels", "The New Portuguese Table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Curried Mussels", "link": "https://www.seriouseats.com/recipes/2010/08/cook-the-book-curried-mussels.html", "description": "While perusing the seafood chapter of <strong><a href=\"http://leitesculinaria.com/about\">David Leite</a></strong>'s <strong><em><a href=\"http://www.amazon.com/New-Portuguese-Table-Exciting-Flavors/dp/0307394417/serieats-20\">The New Portuguese Table</a></em></strong> I have to say that this recipe for <strong>Curried Mussels</strong> had me scratching my head. What does curry have to do with Portuguese cooking?  According to Leite, curry has had a place in Portuguese cuisine for over 500 years dating back to bearded explorer <a href=\"http://en.wikipedia.org/wiki/Vasco_da_Gama\">Vasco de Gama</a>'s first voyage to the East. The spices that de Gama brought back from India made their way into Portuguese cuisine.", "totalTime": "", "recipeYield": "6", "recipeCategory": ["Cook the Book"], "recipeIngredient": ["3 tablespoons olive oil", "2 large yellow onions, chopped", "3 garlic cloves, minced", "3 medium tomatoes, peeled, cored, seeded, and chopped", "2 to 3 tablespoons curry powder ", "1/2 teaspoon ground ginger ", "Pinch of ground cinnamon", "6 pounds mussels, scrubbed, debearded, and rinsed", "1 1/2 cups dry white wine", "2/3 cup heavy cream", "Piri-piri sauce or store bought hot sauce", "Kosher salt and freshly ground black pepper ", "5 cups cooked white rice", "2 tablespoons chopped fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large skillet over medium heat until it shimmers. Drop in the onions and cook, stirring occasionally, until golden brown, about 15 minutes. Add the garlic and cook for 1 minute more. Stir in two thirds of the tomatoes and cook for 2 minutes. Sprinkle in the curry powder, ginger, and cinnamon and cook, stirring occasionally, until fragrant, about 1 minute. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard any mussels that feel heavy (which means they're full of sand), have broken shells, or don't close when tapped. Pour the wine into a roomy pot. Clatter in the mussels, cover tightly, and cook over high heat, shaking the pan occasionally, until the shells pop open, 7 to 10 minutes.  Toss out any mussels that refuse to open, then pluck all but 18 from their shells. Strain the mussel liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 1/2 cups of the mussel liquid to the skillet with the tomato mixture, then add the cream and bring to a boil over high heat to thicken slightly. If you prefer a brothy curry, add more mussel liquid; if it's a creamy curry that you're after, reduce the mixture more. Season with piri-piri sauce, salt, and pepper to taste. Take the pan off the heat and stir in the shelled mussels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the rice in to 6 bowls and top with the mussels. Garnish each with mussels in their shells, and shower with the remaining tomatoes and the cilantro. Pass the piri-piri sauce at the table.</p>"}]}