{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100202beefempanadas.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "cream cheese", "empanadas", "entertaining", "Lucinda Scala Quinn", "Mad Hungry", "pastry doughs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Beef Empanadas", "link": "https://www.seriouseats.com/recipes/2010/02/cook-the-book-beef-empanadas-recipe.html", "description": "[Photograph: Caroline Russock] When it comes to foods we enjoy while watching sports, most have a few things in common. Hot dogs, pretzels, popcorn&mdash;no utensils needed, easily eaten with your hands, and maybe a napkin or two. Football food is...", "totalTime": null, "recipeYield": "10 empanadas", "recipeCategory": ["Beef", "Cook the Book", "Mains"], "recipeIngredient": ["1 tablespoon olive oil", "1 small onion, chopped", "1 small green bell pepper, chopped", "1 pound ground beef", "1 teaspoon ground cumin", "3/4 cup pimento-filled green olives, sliced", "3/4 cup raisins", "1 teaspoon honey", "1 teaspoon coarse salt", "1/4 teaspoon freshly ground black pepper", "Several dashes of hot sauce", "2 large eggs, separated", "1 recipe Cream Cheese Pastry (recipe follows)", "8 tablespoons (1 stick) unsalted butter, at room temperature", "4 ounces cream cheese, at room temperature", "1/4 cup heavy cream", "1 1/2 cups plus 2 tablespoons all-purpose flour, plus more for rolling the dough", "1/2 teaspoon coarse salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, heat a large skillet over medium heat, and then swirl in the olive oil.  Add the onion and bell pepper.  Saute until the onion is translucent, 3 to 4 minutes.  Raise the heat to high and add the beef.  Cook, stirring constantly, to brown, about 5 to 7 minutes.  Add the cumin and cook for another minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the olives, raisins, honey, salt, pepper, and hot sauce.  Cook until the meat is golden brown, the liquid has evaporated, and the flavors have blended, about 4 more minutes.  Cool the mixture completely in the fridge.  Stir in the egg whites.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F.  Butter or line a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the empanadas, work with half of the disk of dough at a time, rolling out on a floured work surface.  Using an overturned bowl (about 5 inches across), cut out circles about 3 or 4 at a time from each piece of dough.  Gather all the dough scraps together, reroll once, and cut.  Place 1/4 cup filling on one side of the dough circle.  Wet the edges of the dough with water.  Fold the dough over to form a half circle.  Pinch the edges of the dough together.  Crimp the edges with a fork.  Repeat the process until all of the filling is used.  The empanadas can be frozen at this point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the empanadas on the prepared baking sheet and chill for a few minutes.  Prick each pie on top twice with a fork.  When ready to bake, beat the egg yolks with 1 tablespoon of water.  Brush the egg wash over each empanada.  Bake for 20 to 25 minutes, until golden brown.  Let rest for 5 minutes before serving.  The empanadas can be cooled and frozen to reheat in a microwave.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<h4>Cream Cheese Pastry</h4>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>- makes about 10 pocket pies, or one double-crusted 10-inch pie -</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process the butter, cream cheese, and cream in a food processor, electric mixer or by hand to thoroughly combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour and salt.  Process until just combined and the dough holds together in a ball.  Turn the dough out onto a well-floured surface.  Divide into 2 pieces.  Flatten into disks and wrap each in plastic wrap.  Refrigerate for at least 30 minutes before rolling out.  If the dough is chilled overnight, take it out 15 minutes before rolling out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub flour all over a rolling pin.  Working with one dough disk at a time, pace the disk on a clean, well-floured work surface.  Applying some pressure with the rolling pin, roll gently from the center of the dough to the top and bottom edges.  Rotate the the disk, and roll to the top and bottom edges again.  Reflour the work surface and rolling pin, turn the dough over, and continue to roll the dough from the center out to the edges.  Turn over and roll again, rotating the disk to ensure even rolling until the dough is about 12 inches in diameter, then but not transparent.</p>"}]}