{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100729gingerpeachescat.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["canning", "Cook the Book", "fruit", "peaches", "pickling", "preserving", "Put 'em Up!", "Sherri Brooks Vinton", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pickled Ginger Peaches", "link": "https://www.seriouseats.com/recipes/2010/07/pickled-ginger-peaches-recipe.html", "description": "To those of you not familiar with this classic Southern pickle, adding copious amounts of vinegar and sugar to perfectly ripe summer peaches might sound a little strange.  But bear with me here&mdash;the combination of vinegar, sugar, and a few choice spices turn summer peaches in to a spectacular pickle that can be enjoyed well after peach season is over.", "totalTime": "", "recipeYield": "makes 2 quarts", "recipeCategory": ["Cook the Book", "Ginger", "Peach", "Pickling", "Vegetarian"], "recipeIngredient": ["6 (500 mg) vitamin C tablets, crushed", "2 quarts cold water", "2 cups ice", "5 pounds peaches (10–12)", "4 cups distilled white vinegar", "4 cups sugar", "1 (2-inch) knob ginger, sliced into coins", "2 cinnamon sticks", "1 teaspoon ground allspice", "1 teaspoon whole cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large nonreactive bowl, cooler, or your impeccably clean kitchen sink, create an antibrowning ascorbic-acid bath by dissolving the crushed vitamin C tablets in the cold water. Add the ice.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Working in batches of 2 peaches at a time, blanch the fruit in the boiling water for 30 seconds to loosen the skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the peaches out of the water and plunge them into the prepared ice water. Repeat with the remaining peaches. Drain. Using a small paring knife, peel, pit, and halve the peaches, returning them to the ice bath as you go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the vinegar, sugar, ginger, cinnamon, allspice, and cloves to a boil in a large nonreactive saucepan, stirring to dissolve the sugar. Add the drained peaches, return to a boil, and then reduce the heat and simmer until tender, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Refrigerate:</strong> Ladle into bowls or jars. Cool, cover, and refrigerate for up to 3 weeks.</p>\r\n\r\n<p><strong>Can:</strong> Use the boiling-water method. Ladle into clean, hot quart canning jars, covering the peaches by 1/2 inch with liquid. Leave 1/2 inch of headspace between the top of the liquid and the lid. Screw lids on the jars temporarily. Gently swirl each jar to release trapped air bubbles. Remove the lids and add syrup, if necessary, to achieve proper headspace. Wipe the rims clean; center lids on the jars and screw on jar bands. Process for 20 minutes. Turn off heat, remove canner lid, and let jars rest in the water for 5 minutes. Remove jars and set aside for 24 hours. Check seals, then store in a cool, dark place for up to 1 year. </p>"}]}