{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100707greenherbceviche.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["avocado", "ceviche", "Cook the Book", "cucumbers", "Fiesta at Rick's", "fish", "Rick Bayless"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Herb Green Ceviche with Cucumber", "link": "https://www.seriouseats.com/recipes/2010/07/cook-the-book-herb-green-ceviche-with-cucumber-recipe.html", "description": "My goal for Cook the Book this week was to put together a menu for a summer party that would be cool and stress free for the host, minimizing time spent in a hot kitchen but still filled with dishes that were not only easy to prepare but also really enjoyable.  And this this Herb Green Ceviche with Cucumber</strong> from <em><a href=\"http://www.amazon.com/Fiesta-Ricks-Fabulous-Great-Friends/dp/0393058999/serieats-20\">Fiesta at Rick's</a></em> by <a href=\"http://www.rickbayless.com/\">Rick Bayless</a> hits all of the marks.", "totalTime": "", "recipeYield": "about 4 1/2 cups, serving 8 to 10 as a starter", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Avocado", "Cook the Book", "Fish"], "recipeIngredient": ["<strong>For a scant 1 cup of herb seasoning:</strong>", "1/2 head garlic, cloves broken apart, unpeeled", "2 to 3 fresh serrano chiles", "1 medium bunch cilantro (thick bottom stems cut off)", "1 small bunch flat-leaf parsley (thick bottom stems cut off)", "1/2 cup olive oil", "Salt", "<strong>For finishing the ceviche:</strong>", "1/4 cup lime juice", "1 1/2 pounds \"sashimi-quality\" skinless, boneless fish fillets", "2 (7 ounces total) small \"pickle\" cucumbers or Persian (baby) cucumbers, cut into 1/2-inch cubes", "2 ripe large avocados, pitted, flesh scooped from skin and then cut into cubes", "Lettuce leaves (butter lettuce works great here), for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a dry skillet over medium heat. Lay in the unpeeled garlic cloves and chiles. Roast, turning frequently, until soft and blotchy brown in spots, about 10 minutes for the chiles and 15 minutes for the garlic. Cool until handleable, then slip the skins off the garlic, pull the stems off the chiles and roughly chop (no need to remove the seeds). Place in a food processor along with the cilantro (about 1 cup if packed), parsley (about 1 cup if packed), oil and 2 generous teaspoons salt. Process until nearly smooth (it will be pasty). Scrape into a storage container and refrigerate until serving time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the lime juice and 1/2 cup of the herb seasoning. (Cover and refrigerate the remainder for another preparation.) Add the fish and cucumber, and stir to combine. To blend the flavors, cover and refrigerate for a half hour (for best results no more than an hour). Taste and season with a little more lime juice or salt if you think necessary, gently stir in the avocado (save out a little for garnish if you want), then serve on lettuce leaf-lined plates or in martini glasses.</p>"}]}