{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110604-155086-mostly-not-potato-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Heidi Swanson", "potato salad", "potatoes", "salad", "sides", "Super Natural Every Day", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mostly Not Potato Salad", "link": "https://www.seriouseats.com/recipes/2011/06/mostly-not-potato-salad-recipe.html", "description": "Potato salad isn't generally a very salad-y salad.  It never contains more than a couple vegetables and as far as healthy points go, it comes in at pretty much nil once you get all the creaminess involved. But potato salad is a summer staple. Where would barbecues and picnics be without some sort of chilled, dressed spud salad? <a href=\"http://www.101cookbooks.com/about/#heidi\">Heidi Swanson,</a> author of <em><strong><a href=\"http://www.amazon.com/Super-Natural-Every-Day-Well-loved/dp/1580082777/?tag=serieats-20\">Super Natural Every Day,</a></strong></em> has brilliantly solved the salad-y potato salad equation with this <strong>Mostly Not Potato Salad</strong>.", "totalTime": "40 minutes", "recipeYield": "4 to 6", "recipeCategory": ["Cook the Book", "Potato Salad", "Salads", "Vegetarian"], "recipeIngredient": ["4 small pink or red-skinned potatoes, unpeeled, quartered ", "Big handful of green beans, trimmed and sliced into 1-inch / 2.5cm pieces", "2 tablespoons whole grain mustard", "2 tablespoons red wine vinegar", "Extra-virgin olive oil", "1/2 teaspoon natural cane sugar or agave nectar", "Fine-grain sea salt", "1/4 cup / .25 oz / 10 g finely chopped dill ", "1 small leek, white and tender green parts, trimmed and chopped", "6 stalks celery, trimmed and diced", "1 cucumber, unpeeled, seeded and cut into tiny cubes", "6 ounces / 170 g baked or extra-firm tofu, cut into small cubes", "1 tablespoon chopped fresh chives "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to a rolling boil. Salt generously, add the potatoes, and cook until tender but not falling apart, about 10 minutes. Thirty seconds before the potatoes are done cooking, add the green beans to the pot. Drain the potatoes and beans and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, make the dressing by whisking together the mustard, vinegar, 1 tablespoon olive oil, the sugar, and 1/4 teaspoon salt in a bowl. Alternatively, combine the ingredients in a mason jar and shake until blended. Taste and adjust if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, sauté the dill in a splash of olive oil over medium-high heat. Add a couple pinches of salt, stir in the leek, and sauté until golden and slightly crispy, 4 to 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, gently toss the potatoes and green beans, celery, cucumber, tofu, chives, and half of the leek with most of the dressing. Taste, and add a sprinkling of salt, if needed. Turn out onto a platter and finish with a final drizzle of dressing and the remaining leek. Serve chilled or at room temperature.</p>"}]}