{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110718-160957-fortunecookie3.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "Cookies", "fortune cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Fortune Cookies", "link": "https://www.seriouseats.com/recipes/2011/07/how-to-make-fortune-cookies-recipe.html", "description": "Choose your own destiny by baking your own fortune cookies: this way, you can stuff them with any kind of fortunes you want.", "totalTime": "20 minutes", "recipeYield": "6", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["Paper for fortunes", "1 egg white", "1/8 teaspoon vanilla extract", "1/8 teaspoon salt", "1/4 cup flour", "1/4 cup granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Write out 6-8 fortunes on paper. Have them ready. I printed out a series of short fortunes, done in 8-point Arial type, and cut them out so that they were each on an individual strip of paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400 F. Line two cookie sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the egg white and vanilla until foamy but not stiff. Sift the flour, salt, and sugar and blend into egg white mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place teaspoonfuls of the batter at least 4 inches apart on one of the prepared cookie sheets. Using a spoon, spread each round of batter until it is about 3 inches in diameter. Be careful to make batter as round and even as possible. Since you'll have to work pretty quickly once they've baked, do three per sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 5 minutes or until the cookies have turned golden at the edges. The center will remain paler. You can prepare your second sheet while the first is baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and quickly move the first cookie with a wide metal spatula and place upside down on a wooden board. Quickly place the fortune close to the middle of the cookie and fold the cookie in half so it becomes a half-moon. Bring corners together gently (you can do this over the rim of a cup) to form the signature fortune cookie shape. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place folded cookies into the cups of a muffin tin (or silicone baking cups) to hold their shape until firm. Repeat with the rest of the cookies. You can eat them after they have cooled, but they will be soft; for crispy cookies, wait a couple of hours before consuming.</p>"}]}