{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111128-181323-beer-run-cupcakes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beer", "chocolate", "cupcakes", "David Arrick", "pretzels", "stout", "The Butch Bakery Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beer Run Cupcakes", "link": "https://www.seriouseats.com/recipes/2011/11/beer-run-cupcakes-stout-cupcakes-with-pretzels-recipe.html", "description": "We think these chocolate stout cupcakes topped with pretzels would fit right in at your local bar. Not exactly standard pub fare, but pretty close.", "totalTime": "2 hours", "recipeYield": "makes 12 cupcakes", "recipeCategory": ["Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Chocolate Stout Cupcakes:</strong>", "12 tablespoons (1 1/2 sticks) unsalted butter, softened ", "1/2 cup cocoa powder", "3/4 cup dark stout, such as Guinness, poured and settled before you measure", "2 large eggs, broken into a small bowl", "1/2 cup full-fat sour cream", "1 1/4 cups unbleached all-purpose flour", "1 1/4 cups sugar", "1 teaspoon baking soda", "1/4 teaspoon salt", "&nbsp;", "<strong>For the Vanilla Stout Buttercream:</strong>", "8 tablespoons (1 stick) unsalted butter, softened", "3 cups confectioners’ sugar, sifted through a strainer", "3 tablespoons dark stout, such as Guinness, poured and settled before you measure ", "1/4 teaspoon pure vanilla extract ", "Pinch salt", "&nbsp;", "<strong>Topping:</strong>", "3/4 cup crushed chocolate-covered pretzels"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Cupcakes:</strong> Place a baking rack in the center of the oven and preheat the oven to 350&deg;F. Line two 6-cup jumbo-size muffin pans with liners and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan over low heat, melt the butter. Remove from the heat, add the cocoa powder, and stir until smooth. Then stir in the stout. You’ll think that you have some stout left to drink, but hold your horses! You’re going need some for the frosting, too. Set aside to cool, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-size mixing bowl, whisk together the eggs and the sour cream. Add the cooled chocolate mixture, incorporating well. Add the flour, sugar, baking soda, and salt, and whisk until smooth, scraping down the bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each prepared muffin cup with 1/3 cup batter, about 2/3 full. Bake, rotating the pans halfway through, until the tops are just firm to the touch and a tester inserted in the center of a cupcake comes out clean, about 23 minutes. Leave the cupcakes in the pan on a rack to cool for 5 to 10 minutes. Transfer the cupcakes to the wire rack to cool completely before frosting, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Buttercream:</strong> In a medium-size mixing bowl, with an electric mixer on medium-high speed, beat the butter until light and fluffy, about 1 minute. Add the confectioners’ sugar, stout, vanilla, and salt into the bowl, and continue to beat until very smooth and creamy, 2 to 3 minutes, scraping down the bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cupcake Construction:</strong> Get out that ice cream scoop (2 to 2 1/4 inches in diameter) and top each cupcake with a scoop of frosting. Sprinkle each cupcake with a tablespoon of the crushed pretzels. Cupcakes can be refrigerated for up to 3 days in an airtight container, or frozen for 1 month.</p>"}]}