{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/2011082-163694-GFTues-TomatoTart.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "Gluten-Free Tuesday", "rosemary", "tarts", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Tuesday: Tomato Tart with Parmesan-Rosemary Crust", "link": "https://www.seriouseats.com/recipes/2011/08/gluten-free-tomato-tart-with-parmesan-rosemary-crust-recipe.html", "description": "To say I await tomato tarts all year is not an exaggeration. In fact, I blame my love of tomato tarts for the ridiculous number of tomato plants in my garden each spring. Just the promise of a tart influences my tomato selection. I'm always thinking, \"How will this kind look/taste in a tart?\"", "totalTime": "about 1 1/2 hours", "recipeYield": "4", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday", "Tomato"], "recipeIngredient": ["<strong>For the Crust</strong>", "4 ounces (about 1 cup) white rice flour", "3/4 cup freshly grated Parmesan cheese (omit if dairy-free)", "1.25 ounces (about 1/4 cup) sweet rice flour", "1 ounce (about 1/4 cup) tapioca starch", "1 teaspoon rosemary, chopped", "1/2 teaspoon salt (increase salt to 3/4 teaspoons if dairy-free)", "4 ounces (1 stick) butter, chilled and cut into six pieces ( use 10 tablespoons shortening if dairy-free.)", "2 ounces (1/4 cup) ice water", "2 tablespoons butter or olive oil", "<strong>For the Filling</strong>", "1 large onion, peeled and cut into ¼-inch pieces", "6 slices deli slices provolone or 4 ounces, grated", "2 large tomatoes, about 16 ounces, cut into (about) 1/4-inch slices", "nonstick cooking spray", "Olive oil", "Kosher salt", "About three basil leaves", "2 tablespoons butter or olive oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of food processor, combine white rice flour, cheese, tapioca starch, sweet rice flour, rosemary, and salt. Pulse to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter. Pulse until no large pieces remain. Add water, run food processor until dough forms. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly spray a 10-inch tart pan. Pinch off one-tablespoon pieces of dough and place into bottom of tart pan. When all dough is in the pan, press dough down to cover bottom and sides of the pan. Lightly cover pan with plastic wrap and freeze tart for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While tart is chilling, begin the filling: Melt butter in heavy-skillet over medium-high heat and add onions.  Stir onions frequently. When onions begin to brown, reduce heat to low. Cook, stirring frequently until onions are soft and very brown, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375 degrees F. Remove tart from freezer and pull off plastic wrap. Bake tart until lightly golden brown, about 20 minutes. Remove tart from oven and place on wire rack. Increase oven temperature to 425 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Place cheese evenly in bottom of tart. (If dairy-free, lightly brush tart with olive oil.)  Spoon cooked onions evenly over cheese and top with tomatoes. Drizzle lightly with olive oil and sprinkle with a little kosher salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until tomatoes soften, about 18 minutes. Place tart on wire rack to cool for about five minutes before cutting. Chop basil and sprinkle over tart. Cut tart into wedges and serve. </p>"}]}