{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110117-132658-sticknewtons.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy", "chocolate", "fig newtons", "food holidays", "foods on a stick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Chocolate Covered Fig Newtons on a Stick", "link": "https://www.seriouseats.com/recipes/2011/01/cakespy-chocolate-covered-fig-newtons-on-a-stick-recipe.html", "description": "Did you know that yesterday was<strong> National Fig Newton Day?</strong> If you dropped the ball on this little-known holiday, don't despair. Here's an easy (and delicious) way to create a belated celebration: dress up your Newtons by putting them on a stick and coating them in chocolate.", "totalTime": "3 hours", "recipeYield": "12-14", "recipeCategory": ["Cakespy", "Chocolate", "Cookies"], "recipeIngredient": ["12-14 Fig Newtons", "1 cup chocolate chips (semisweet, milk chocolate, or dark chocolate, your choice)", "1 tablespoon vegetable shortening"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spear each of your Fig Newtons with a popsicle stick in the exposed fruit side, making sure it goes almost, but not quite, to the top of the cookie. Be sure to insert the stick right in the center, otherwise you might crack the cookie part.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan or double boiler, melt your chocolate chips and shortening over medium-low heat until all of the chocolate has melted and your mixture is smooth. If you are simply melting it in a saucepan, stir very frequently to prevent scorching the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once melty, remove the pan from the heat source. One at a time, dip your Fig Newtons on sticks into the mixture, making sure to evenly coat each side. Allow excess chocolate to drip off, and then lay the coated cookie on a sheet of nonstick paper or a silicone mat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the remaining cookies. Let them sit at room temperature until the chocolate coating has set, about 2 hours. </p>"}]}