{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/10012011-cuttys-pork-rabe-primary.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["a sandwich a day", "broccoli rabe", "Cutty's", "Cutty's Week", "pork", "pork shoulder", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Roast Pork with Broccoli Rabe and Provolone from Cutty's", "link": "https://www.seriouseats.com/recipes/2011/10/the-roast-pork-with-broccoli-rabe-and-provolone-sandwich.html", "description": "Note: This recipe will make far more roast pork than you need for the sandwiches. It can be stored in a sealed container in the fridge for up to 5 days....", "totalTime": "3 days", "recipeYield": "Makes 4 large sandwiches", "recipeCategory": ["Pork", "Sandwiches"], "recipeIngredient": ["1 small whole pork shoulder, about 3 pounds", "Kosher salt", "1/2 pound broccoli rabe", "4 medium garlic cloves, minced", "pinch red pepper flakes", "1/4 cup extra virgin olive oil, plus more for drizzling", "1/2 cup shredded provolone cheese", "4 large sesame-seed cemita-style rolls (or any soft crusty sandwich roll)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub pork shoulder with 1/4 cup kosher salt. Set in rack in a baking dish, wrap in plastic wrap, and refrigerate for two to three days. When ready to cook, preheat oven to 475°F and adjust oven rack to lower-middle position. Unwrap pork, pat dry with a paper towel, and roast until lightly browned, 35 to 40 minutes. Flip roast over, reduce heat to 300°F, and continue to cook until center registers 170°F on an instant read thermometer, 2 to 3 hours. Remove from oven and let rest for at least 45 minutes. Meanwhile, make the broccoli rabe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a gallon of water to a boil over high heat. Add broccoli rabe and 2 tablespoons salt. Cook, stirring constantly until water returns to a boil, about 1 minute. Transfer broccoli to bowl of ice water and let sit 2 minutes. Drain well in a salad spinner and chop into 1-inch pieces. Transfer to medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic, pepper flakes, and olive oil to a small skillet and heat over low heat until garlic is sizzling, about 5 minutes. Pour garlic oil over broccoli rabe and toss to combine. Season with salt and pepper to taste, then stir in cheese. Slice pork as thinly as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut sandwich rolls in half and toast under the broiler or in a toaster oven. Lightly drizzle rolls with extra virgin olive oil. Top with pork followed by broccoli rabe. Close sandwiches, cut as desired, and serve.</p>"}]}