{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110502-texas-beef-council-marinated-grilled-flank-steak-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["beef", "fajita", "flank steak", "Mexican", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Grilled Marinated Flank Steak Fajitas", "link": "https://www.seriouseats.com/recipes/2011/05/grilled-marinated-flank-steak-fajitas-recipe.html", "description": "You can go all out and serve these fajitas restaurant-style with grilled peppers and onions, but that's just gilding the lily--well-cooked meat doesn't need much more than a squeeze of lime, some chopped onions and cilantro, and s bit of fresh salsa.", "totalTime": "at least 1 1/2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Beef", "Mexican"], "recipeIngredient": ["1/4 cup soy sauce", "1 tablespoon dried ground ancho chile (or 1 tablespoon chili powder)", "2 teaspoons ground cumin", "1 tablespoon dried oregano", "1/4 cup lime juice", "2 tablespoons sugar", "four cloves garlic", "1/4 teaspoon cayenne pepper", "1/2 cup chopped fresh cilantro leaves", "2 1/2 pounds flank steak (about 1 whole flank steak)", "1/3 cup oil", "1 large yellow onion, finely diced", "12 to 16 flour tortillas, warmed", "2 whole limes, cut into wedges", "Salsa, sour cream, and/or guacamole for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine soy sauce, ground chile, cumin, oregano, lime juice, sugar, garlic, cayenne, and 2 tablespoons cilantro leaves in a medium bowl. Whisk until sugar is dissolved. Slowly add oil, whisking constantly. Place flank steak inside a gallon-sized zipper-lock bag with marinade. Press out air, seal bag, and allow meat to marinate, turning occasionally, for at least 1 hour and up to 12.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove steak from marinade and pat dry with paper towels. Ignite a large chimney full of coals and wait until they're covered in grey ash. Spread evenly over 1/2 of grate, leaving the other half empty. Put the cooking grate in place, cover, and allow grill to preheat for 5 minutes. Scrape cooking grates clean, then place flank steak over hot side of grill. cook until well charred, about 3 minutes. Flip steak and continue to cook until second side is well charred, about 3 minutes longer. Transfer steak to cooler side of grill, cover, and cook until the center of the steak registers 125°F on an intant-read thermometer for medium-rare, or 135° for medium, about 5 minutes longer. Transfer to a cutting board, tent with foil, and allow steak to rest for at least 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice steak thinly across the grain, then cut each slice into 1/2-inch pieces. Serve immediately with warm tortillas, diced onions, chopped cilantro, lemon wedges, and salsa as desired.</p>"}]}