{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110729karendemascoapricotcake.jpg", "author": {"@type": "Person", "name": "Karen DeMasco"}, "recipeCuisine": "", "keywords": ["apricot", "cake", "Jam"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Karen DeMasco's Almond Cake with Apricot Preserves", "link": "https://www.seriouseats.com/recipes/2011/07/almond-cake-with-apricot-preserves-karen-demasco-recipe.html", "description": "This is my all time favorite non-chocolate cake. The almond paste lends great flavor and moisture. This cake is as light as an angel food cake, but with all the benefits of butter.", "totalTime": "", "recipeYield": "1 8-inch cake", "recipeCategory": ["Apricot", "Cakes"], "recipeIngredient": ["4 ounces almond paste", "3/4 cup granulated sugar", "2 sticks (8 ounces, 16 tablespoons) unsalted butter, cut into pieces, soft", "1/2 teaspoon vanilla extract", "3 large eggs", "1 cup cake flour", "1/2 teaspoon baking powder", "1/2 teaspoon kosher salt", "1/2 rounded cup apricot preserves", "Powdered sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg; F. Grease an 8-inch cake pan with non-stick spray or softened butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the almond paste and sugar in the bowl of a food processor and pulse until well combined, with no visible lumps of almond paste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place this almond paste mixture in the bowl of a tabletop mixer with the butter and vanilla extract. Cream this with the paddle attachment on medium speed until it is light and fluffy, about 5 minutes. Scrape down the sides of the bowl, and turn the mixer back on to medium speed, adding the eggs, one at a time. Wait until each egg is fully incorporated before adding the next. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, whisk together the cake flour, baking powder, and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape down sides of the bowl again, and add about half of the flour, slowly mixing at first, then turning the mixer back up to medium speed once the flour is mixed in. Let it mix for about 1 minute, until the mixture is once again light and fluffy. Add the remaining flour mixture and combine again, slowly and then on medium speed for about a minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the batter into prepared pan, place the pan on a baking sheet, and then move them into the oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for about 40 minutes without opening the oven so that the cake will set, then rotate the pan, and cook for another 5 to 10 minutes, until the cake is golden brown, springs back to the touch, and a cake tester comes out with a moist crumb. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cake cool to room temperature on a cooling rack, then turn it out of the pan. Using a long serrated knife, slice the cake in half horizontally. It may help to use the bottom of a springform pan or removable bottom of a tart pan to hold the cake steady.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the jam on the bottom layer, from edge to edge. Place the top half of the cake back on top. Dust cake with powdered sugar right before serving. </p>"}]}