{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110114-131805-caramelized-orange-cheesecake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cakes", "cheesecakes", "citrus", "Cook the Book", "desserts", "oranges", "The Sunset Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Cook the Book: Caramelized Orange Cheesecake", "link": "https://www.seriouseats.com/recipes/2011/01/caramelized-orange-cheesecake-recipe.html", "description": "Super creamy with a great graham crust, lightly orangey filling, and an almost stained glass-like caramelized orange topping, this cheesecake was almost as good to look at as it was to eat.", "totalTime": "2 1/4 hours, plus 3 1/2 hours to cool and chill", "recipeYield": "12", "recipeCategory": ["Cook the Book", "Desserts", "Orange"], "recipeIngredient": ["<strong>For the topping:</strong>", "1 large firm thin-skinned orange, such as Valencia ", "1 cup sugar", "2 teaspoons fresh lemon juice ", "<strong>For the cheesecake:</strong>", "1 1/4 cups graham cracker crumbs (from about 17 squares)", "3 tablespoons butter, melted", "3 packages (8 ounces each) cream cheese, at room temperature ", "3/4 cup sugar", "4 eggs, at room temperature", "2 tablespoons flour ", "1/2 cup sour cream ", "1 tablespoon orange-flavored liqueur, such as Grand Marnier or Cointreau, or 2 teaspoons vanilla extract", "3 tablespoons fresh orange juice "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make topping:</strong> With a sharp knife, slice orange into thin rounds (between 1/8 and 1/16 in. thick), discarding ends and seeds. In a deep 10-inch frying pan or pot over medium-high heat, stir sugar, 3/4 cup water, and lemon juice until sugar is dissolved. Add orange slices and bring to a simmer. Cover and simmer 5 minutes. Uncover and simmer gently, keeping slices in a single layer and turning occasionally, until they’re slightly candied and translucent and liquid has consistency of a thin syrup, about 20 minutes (there should be about 1/2 cup liquid in pan; if less, add enough hot water to make that amount and shake pan to mix water into syrup). Let cool in pan. Cover and chill at least 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make cheesecake:</strong> Preheat oven to 300&deg;F. Pour cracker crumbs into a 9-inch springform pan (with side at least 2 1/4 inch high); add butter and mix. Press mixture evenly over bottom and 1/2 inch up sides of pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, with a mixer on medium speed, beat cream cheese and sugar until smooth. Add eggs, one at a time, beating well after each addition. Beat in flour, sour cream, and liqueur just until incorporated. Pour into crust-lined pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until center barely jiggles when cake is gently shaken, 60 to 70 minutes. Run a thin-bladed knife between cheesecake and pan rim. Cool completely at room temperature, then cover with plastic wrap and chill until cold, at least 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pan rim. If any moisture has collected on top of cake, gently blot dry with a paper towel. Gently lift candied orange slices from syrup, reserving syrup, and blot dry. Arrange slices, slightly overlapping, over top of cheesecake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring reserved syrup to a boil over high heat. Stir occasionally until syrup is deep golden brown, 1 to 3 minutes. Remove from heat and carefully stir in orange juice (mixture will bubble up). Let cool to room temperature and generously brush over orange slices (you may have extra syrup).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut cake slices with a serrated knife, running knife under hot water and wiping clean after each slice.</p>"}]}