{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110412-146192-ratatouille-crepes.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["buckwheat", "crepes", "Crisper Whisperer", "ratatouille", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Ratatouille in Buckwheat Crepes", "link": "https://www.seriouseats.com/recipes/2011/04/the-crisper-whisperer-ratatouille-in-buckwheat-crepes.html", "description": "<strong>Ratatouille in Buckwheat Crepes is not a recipe.</strong> Well, technically it is a recipe, fine. But it's more than that, too. It's a first-rate problem solver. It solves the age-old paradox of feeding brunch to a houseful of vegetarians without plunging them directly into diabetic coma. I love a good [insert baked good here] as much as the next guy, but it's always nice to have some variety on a brunch menu.", "totalTime": "", "recipeYield": "Serves 6 (makes 16 crepes with extra filling)", "recipeCategory": ["Crepe", "Crisper Whisperer", "Vegetarian"], "recipeIngredient": ["<strong>For the Ratatouille</strong>", "1/3 cup olive oil, divided", "1 medium eggplant, cut into 3/4-inch dice", "1/2 teaspoon salt", "1 large red onion, diced", "1 red bell pepper, diced", "1 orange or yellow bell pepper, diced", "2 zucchini, diced", "1 28-ounce can whole tomatoes", "Pinch of cayenne pepper flakes", " 2 tablespoons capers", "1 teaspoon sugar", "</br>", "<strong>For the Crepes</strong>", "2 1/2 cups milk", "4 tablespoons butter", "1 cup sifted buckwheat flour", "1 cup sifted unbleached all-purpose flour", "1/4 teaspoon salt", "4 eggs", "Vegetable oil for the pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the ratatouille</strong>: Heat half the oil over medium-high heat in a heavy 5-quart pot. Add the diced eggplant, sprinkle with the salt, and cook, stirring occasionally, until browned, about 5 minutes.  Remove eggplant to a dish.  Heat remaining oil in the pot. Add onion and peppers and cook, stirring occasionally, until starting to soften, about five minutes. Add zucchini and cook two minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return eggplant to the pot. Crush the whole tomatoes with your fingers and add to the pot along with their juices. Stir in the cayenne, capers, and sugar. Bring to a boil. Partially cover the pot, reduce heat to maintain a simmer, and cook until vegetables are very tender and sauce has thickened, 20 to 30 minutes. Serve warm or at room temperature, spooned into crepes. Ratatouille keeps well in the fridge for several days and usually tastes even better the second day. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the crepes</strong>: Place the milk and butter in a small pot. Warm over medium-low heat until the butter melts. Set aside to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine the buckwheat flour, all-purpose flour, and salt. Pulse for a moment to blend. Then, with the motor running, carefully pour in the milk and butter through the feed tube. Add the eggs one at a time and process until just blended. Let stand for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next to the stove, set a dinner plate covered with a kitchen towel. Place a 7-inch crepe pan or nonstick skillet over medium heat. Brush with vegetable oil and heat until smoking. Pour 1/4 cup batter into the pan while swirling the pan with your other hand to spread a thin layer of batter evenly over the bottom of the pan. Cook for about 3 minutes, until the underside is nicely browned. Flip and cook 1 to 2 minutes more, until the second side is nicely browned. Slide the crepe out onto the towel-covered plate and repeat until all the batter is used. Brush a little bit of oil onto the pan before cooking each crepe. Cooked crepes keep well in the refrigerator for a day or so and also freeze beautifully, layered with waxed paper and tightly wrapped.</p>"}]}