{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110824-glorious-pasta-of-italy-cover-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "Bolongese", "Cook the Book", "Domenica Marchetti", "pasta sauce", "pork", "recipe newsletter", "sauces", "The Glorious Pasta of Italy", "veal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ragù alla Bolognese From The Glorious Pasta of Italy", "link": "https://www.seriouseats.com/recipes/2011/08/ragu-alla-bolognese-recipe.html", "description": "<a href=\"http://www.domenicacooks.com/about-2/\">Domenica Marchetti</a>'s Bolognese from <em><a href=\"http://www.amazon.com/Glorious-Pasta-Italy-Domenica-Marchetti/dp/0811872599/?tag=serieats-20\">The Glorious Pasta of Italy</a></em> has its own curious ingredient, mortadella, which makes perfect sense since mortadella comes from Bologna. Marchetti's ragù is pretty genius, rich and meaty with melting diced carrots, onions, and celery and surprisingly little tomato paste. It makes for the perfect sauce for a Lasagna Bolognese, layered with bechamel, or atop a mound of fresh tagliatelle.", "totalTime": "", "recipeYield": "makes about 8 cups", "recipeCategory": ["Beef", "Condiments and Sauces", "Pasta", "Pork"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "3 tablespoons unsalted butter", "2 cloves garlic, minced", "2 large carrots, peeled and finely chopped", "2 large celery ribs, finely chopped ", "1 large yellow onion, finely chopped", "1 tablespoon minced fresh flat-leaf parsley", "1 pound ground beef ", "1 pound ground pork", "1 pound ground veal", "1 cup dry white wine or dry sherry", "Kosher or fine sea salt ", "Freshly ground black pepper", "Pinch of freshly grated nutmeg", "1 cup whole milk", "1 (7-ounce) tin tomato paste", "2 cups homemade meat broth or best-quality low-sodium, fat-free commercial beef broth", "1 cup heavy cream", "4 ounces thinly sliced mortadella, cut in julienne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the olive oil and the butter in a large Dutch oven or other heavy-bottomed pot over medium heat. When the butter is melted and begins to sizzle, stir in the garlic, carrots, celery, onion, and parsley. Reduce the heat to medium-low and sauté the vegetables for about 10 minutes or until they are softened and golden. Add the beef, veal, and pork and mix well, using a wooden spoon to break up the meats. Cook over medium-low to low heat, stirring frequently, until the meat turns a deep brown and is crumbly but still tender and not at all hard. This will take about an hour or slightly longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat is ready, raise the heat to medium, stir in the wine, and mix for a few minutes until the wine evaporates. Season with a little salt and pepper, add the nutmeg, and stir in the milk. Cook, stirring, for 3 to 4 minutes, or until the milk has been absorbed. In a small bowl, dilute the tomato paste/puree with a splash or two of beef broth and add to the sauce. Mix well and add the remaining broth. Cover partially, reduce the heat to low, and let the sauce simmer slowly for 2 hours or more, until it is very thick and all of the vegetables have more or less melted into the sauce. Stir in the cream and mortadella and cook at a gentle simmer until heated through.</p>"}]}