{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110619-127355-dinner-tonight-potato-pea-curry.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["At Home with Madhur Jaffrey", "curries", "Dinner Tonight", "Madhur Jaffrey", "peas", "potatoes", "vegetarian", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Potato and Pea Curry with Yogurt, Cumin, and Ginger", "link": "https://www.seriouseats.com/recipes/2011/06/potato-and-pea-curry-with-yogurt-cumin-ginger-recipe.html", "description": "I nearly lost it when I saw fresh peas at the farmers' market. I handed over my money as quickly as possible for the neon green specimens. Though properly enthused, I didn't exactly have a recipe. There are loads of options for peas and pasta, but few of them actually give the peas top billing. I didn't want them to be a minor component of some bigger dish; I wanted to showcase the fresh peas in the most dramatic way possible.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Legumes", "Potato", "Vegetarian"], "recipeIngredient": ["1 pound small red potatoes, about 1 ½-inches wide, scrubbed ", "3 tablespoons olive oil ", "⅛ teaspoon asafetida", "¼ teaspoon whole cumin seeds", "2 cups fresh peas (you can substitute frozen peas)", "8 tablespoons plain yogurt, divided ", "1 ½ teaspoons finely grated fresh ginger", "¾ teaspoon salt ", "¼ teaspoon cayenne pepper", "1 tablespoon ground coriander "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Add the small red potatoes, reduce heat to a simmer, and cook until a knife easily slips into the flesh, 15 to 20 minutes. Drain the potatoes in a colander, and allow to cool for a few minutes. Cut the potatoes in half, and then remove their skins. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a 12-inch nonstick skillet over medium-high heat. When oil is shimmering, add the asafetida and cumin seeds. Let them cook for 10 seconds, and then add the potatoes. Cook, stirring occasionally, until the potatoes are lightly browned, two to three minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add three tablespoons of yogurt, the peas, the ginger, salt, and cayenne. Stir well, and let cook until the yogurt is absorbed by the potatoes. Add another three tablespoons of yogurt and the coriander. Stir and let cook until the yogurt is once again absorbed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the yogurt, stir, and let cook for one minute. If you used frozen peas, you are done at this point. If you used fresh peas, add three tablespoons of water, turn heat to low, cover the skillet, and cook until peas are tender, four to six minutes. Serve the curry with rice. </p>"}]}