{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111204-suckling-pig-08-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["holiday entrees", "pork", "suckling pig"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Whole Roasted Suckling Pig", "link": "https://www.seriouseats.com/recipes/2011/12/whole-roasted-suckling-pig-recipe.html", "description": "Whole tender, juicy, crisp-skinned suckling pig for the holiday table.", "totalTime": "5 to 6 hours", "recipeYield": "Serves 12 to 16", "recipeCategory": ["Christmas", "Mains", "Pork", "The Food Lab"], "recipeIngredient": ["1 whole suckling pig, about 20 pounds (see note)", "Kosher salt and freshly ground black pepper", "20 whole cloves garlic", "1 six-inch piece of fresh ginger, cut into 1/2-inch slivers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F. Season pig inside and out with plenty of salt and pepper. Fill cavity with garlic and ginger. If pig fits on a single rimmed baking sheet or roasting pan, place him on the baking sheet back-up and transfer to the oven. If pig is too large, remove a rack from the oven and place on your range. Overlap two rimmed backin sheets so that they fit on the oven rack and line the whole thing with foil. Transfer the pig to the overlapped baking sheets then lift the whole oven rack and return to the oven so that the pig is in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast until an instand read thermometer inserted into the deepest part of the shoulder blade registers at least 160°F, about 4 hours. If ears or tail begin to burn, cover with foil and continue roasting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase oven temperature to 500°F and cook until skin is crisp all over, about 30 minutes longer. Remove pig from oven, tent with foil, and allow to rest for 30 minutes. Serve by tearing skin into serving-sized pieces and removing flesh with your fingers and piling it onto a serving platter.</p>"}]}