{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110106-127355-dinner-tonight-pork-chops-chile-colorado.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chiles", "Dinner Tonight", "pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Pork Chops with Chile Colorado", "link": "https://www.seriouseats.com/recipes/2011/01/pork-chops-with-chile-colorado-recipe.html", "description": "Not that this should come as any big shocker, but the fatty chops paired perfectly with the robust, if only slightly <a href=\"http://www.gourmet.com/recipes/2000s/2000/12/chilesauce\">spicy sauce from <em>Gourmet</em></a>. To be sure, the sauce is a whole lot more nuanced than might seem possible.", "totalTime": "1 hour", "recipeYield": "2 people", "recipeCategory": ["Dinner Tonight", "Pork"], "recipeIngredient": ["<strong>For the Red Chile Sauce</strong>", "3 dried New Mexico chiles, stemmed and seeded", "3 dried guajillo chiles, stemmed and seeded", "2 cups boiling water", "1 ½  tablespoons white onion, finely chopped", "2 garlic cloves, minced", "¾ teaspoon ground cumin", "¼ teaspoon dried oregano", "1 tablespoon canola oil", "½ tablespoon all-purpose flour", "½ tablespoon kosher salt", "1 teaspoon Sherry vinegar", "½ teaspoon sugar", "<strong>For the Pork Chops</strong>", "2 bone-in pork chops, about 1-inch thick", "1 tablespoon canola oil", "salt and pepper", "1 scallion, end trimmed, white parts discarded, green parts chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the red chile sauce: Preheat 10-inch cast iron pan over medium heat. Toast chiles, skin sides up, until very fragrant but not burned, about 30 seconds. Transfer to large bowl and cover with boiling water. Place small plate on top to keep them submerged, and let them sit for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chiles and ¾ of soaking liquid to blender. Do not discard remaining soaking liquid. Puree chiles until smooth. Pass this chile puree through a sieve into a bowl to remove tough skins, and then whisk in reserved soaking liquid. Sauce should be fairly thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour oil into medium-sized saucepan set over medium-low. Add onion, garlic, cumin, and oregano. Cook until onion turns soft and everything is fragrant, about two minutes. Sprinkle in flour, and whisk until evenly distributed. Continue to whisk occasionally until flour turns a light brown, about another two minutes. Whisk in chile sauce. Partially cover saucepan, whisking occasionally, turning heat down to low if splattering too much. Cook until thick and dark red, 20 to 30 minutes. Turn off heat, and whisk in salt, vinegar, and sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the pork chops: Wipe out 10-inch cast iron pan, and then place over medium-high heat until starting to smoke. Meanwhile, dry chops with paper towels, and season both sides with salt and pepper. Add oil to pan, and when it just starts to smoke, add chops. Cook until well browned on both sides, three to four minutes a side. Check temperature with meat thermometer. It should register around 145&deg;F. If it is below that, return chops to pan, reduce heat to medium, and cook for an extra minute on each side. Transfer chops to plate and let rest for a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, ladle some of the sauce a plate, and place chop on top. Sprinkle chopped scallions on top.</p>"}]}