{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110629-luchetti-cesandwiches.jpg", "author": {"@type": "Person", "name": "Emily Luchetti"}, "recipeCuisine": "", "keywords": ["Cookies", "Emily Luchetti", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fudge Cookie and Mint Chip Ice Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2011/06/fudge-cookie-ice-cream-sandwiches-recipe.html", "description": "The cookies for this sandwich are somewhat like a traditional ice cream sandwich cookie, but with a much more intense chocolate flavor. Use with any kind of ice cream, homemade (I'm including my mint chip recipe here) or store-bought. I like my mint chip ice cream white, but if you need to have it green, add a tiny bit of green food coloring.", "totalTime": "", "recipeYield": "Makes 10 sandwiches", "recipeCategory": ["Chocolate", "Cookies", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>Mint Chip Ice Cream</strong>", "2 1/4 cups heavy (whipping) cream", "3/4 cup milk", "3/4 cup lightly packed fresh mint leaves", "1 cup sugar", "4 large egg yolks", "1/8 teaspoon kosher salt", "8 ounces bittersweet chocolate, chopped", " ", "<strong>Fudge Cookies</strong>", "2 ounces (4 tablespoons) unsalted butter", "12 ounces bittersweet chocolate, coarsely chopped", "1/3 cup all-purpose flour", "1/4 teaspoon baking powder", "1/4 teaspoon kosher salt", "3 large eggs", "3/4 cup sugar", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the ice cream:</strong> In a medium, heavy saucepan, heat the cream, milk, mint, and 1/2 cup of the sugar over medium heat, stirring occasionally, until almost simmering. Turn off the heat, cover the pan, and steep the mint in the cream for 15 minutes. In a medium bowl, whisk together the egg yolks, the remaining 1/2 cup sugar, and the salt. Slowly pour the hot liquid into the eggs, whisking as you pour. Return the mixture to the pan and cook over medium-low heat, stirring constantly with a heat-resistant plastic or wooden spatula, until it reaches 175°F and lightly coats the spatula. Strain the mixture into a clean bowl, discarding the mint. Cool over an ice bath until room temperature. Refrigerate for at least 4 hours or up to overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, using on-off pulses, grind the chocolate into small pieces. Put the chocolate in a bowl in the freezer. Churn the ice cream base in an ice cream machine according to the manufacturer’s instructions. Place the ice cream in the bowl with the chocolate and fold the two together. Freeze until scoopable, about 4 hours, depending on your freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cookies:</strong> Preheat the oven to 350°F. Line 3 baking sheets with parchment paper. Melt the butter and chocolate together in a double boiler over hot water. Stir to combine. Let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour and baking powder. Add the salt. With an electric mixer on high speed, whip the eggs, sugar, and vanilla extract together until thick. By hand, stir in the cooled chocolate mixture. Stir in the flour mixture and let the batter rest until it thickens slightly. How long this takes will depend on how warm the chocolate was when you added it. It could take anywhere from 5 -15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an ice cream scoop 2 1/4 inches in diameter for each cookie, scoop the batter onto the prepared pans at least 2 inches apart. There should be at least 20 cookies. Bake for about 10 minutes, or until the tops crack. They will look set and no longer shiny on top. Let cool and then remove them from the pans with a spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 10 of the cookies, bottom side up, on a baking sheet lined with parchment or waxed paper. Place a scoop of ice cream on top of each cookie. Top with a second cookie and gently press down on the top cookie to adhere the sandwiches together. Serve immediately, or freeze until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>In Advance:</strong> The cookies can be made 1 day before you assemble the sandwiches. Store at room temperature wrapped in plastic wrap.</p>"}]}