{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111111-127355-dinner-tonight-pork-chop-molasses-mustard-glaze.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["apple", "apple butter", "Bobby Flay", "Dinner Tonight", "grill", "grilling", "mustard", "pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Molasses-Mustard Glazed Pork Chops with Apple Butter", "link": "https://www.seriouseats.com/recipes/2011/11/molasses-mustard-glazed-pork-chops-apple-recipe.html", "description": "I have a real soft spot for pork chops and apples, especially around this time of the year. That's initially why I was into this recipe from <em><a href=\"http://www.amazon.com/dp/0307351424/?tag=serieats-20\">Bobby Flay's Grill It!</a></em>, as the apple butter seemed like an interesting twist.", "totalTime": "1 hour", "recipeYield": null, "recipeCategory": ["Apple", "Dinner Tonight", "Pork"], "recipeIngredient": ["<strong>For the Apple Butter</strong>", "2 tablespoons canola oil ", "1 small onion, finely chopped", "1 garlic clove, finely chopped", "2 large Granny Smith apples, peeled, cored, and chopped", "3 tablespoons light brown sugar", "1 teaspoon ground cinnamon", "1/4 teaspoon kosher salt ", "6 tablespoons unsalted butter, softened ", "&nbsp;", "<strong>For the Pork Chops</strong>", "1/4 cup Dijon mustard", "2 tablespoons whole-grain mustard", "1/4 cup molasses", "salt and black pepper", "4 pork chops (about 1-inch thick) ", "2 tablespoons canola oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the apple butter: Pour the two tablespoons of canola oil into a large skillet set over medium-high heat. When shimmering, add the onion and cook until soft, three to four minutes. Add the garlic, stir well, and cook until fragrant, about 30 seconds. Add the apples and brown sugar. Cook, stirring occasionally, until apples are softened somewhat but haven't broken down, five to seven minutes. Add the cinnamon and salt, stir well, and cook for one minute. Then turn off the heat, and transfer half of the mixture to a food processor and the other half to a medium-sized bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the apple mixture in the food processor. Puree the mixture, making sure to occasionally scrape the sides with a spatula. When smooth, transfer mixture to a bowl and place in the fridge to cool. If you have the time, let this hang out for an hour.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the pork chops: In a medium-sized bowl, whisk together the Dijon mustard, whole-grain mustard, and molasses. Season with a pinch of salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using a grill (totally recommended) heat the grill to high. Otherwise, heat a cast iron grill pan over high heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat both sides of the chops with the canola oil, and season each with salt and pepper. Place each on the grill or grill pan and cook until the bottom is lightly browned, three to four minutes. Brush the top of each pork chop with the mustard glaze. Then flip each, and cook until each has been cooked to medium, four to five minutes. During the last minute of cooking, brush the top of each with more glaze. When done, set aside and let them rest for five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the chops with the cooked apples along the side. Top each with a tablespoon or so of the apple butter.  </p>"}]}