{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110905-169250-plum-meringue-610x458-21.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["meringue", "pie", "plums"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Plum Meringue Pie", "link": "https://www.seriouseats.com/recipes/2011/09/plum-meringue-pie-recipe.html", "description": "When it comes to meringue everyone usually thinks of lemon, because nothing cuts through the sweet clouds of caramelized meringue quite like the smooth acidity of lemon custard or curd. It stands to reason that meringue would play well with other acidic fruits, such as plums.", "totalTime": "4 hours", "recipeYield": "8", "recipeCategory": ["Fruit Desserts", "Pies, Tarts, and Crumbles", "Plum"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One single crust recipe for Easy Pie Dough</a>, shaped and chilled in a pie plate", "12 red plums, pitted and cut into eighths", "1/4 to 1/2 cup of granulated sugar for fruit, additional 1/2 cup granulated sugar for meringue", "1/4 cup instant tapioca", "3 egg whites", "1/8 cup water", "pinch of cream of tartar", "pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg; F. Place the plums in a bowl. Taste them to get a feel for how sweet they are; if they are bracingly tart add the full 1/2 cup of sugar, but if they are on the sweeter side add only 1/4 cup. Add the tapioca, toss the mixture together until the fruit is evenly coated, and set aside for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Evenly distribute the plum mixture inside the chilled, prepared pie crust and place in a 425&deg;F oven. Rotate the pie after ten minutes and bake for an additional five before lowering the oven to 350&deg;. If the plums start to burn, place a tented, loose piece of tin foil over the filling. Bake for another 20-25 minutes, until the filling starts to bubble all over. Remove the pie from the oven and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once pie has cooled, place the egg whites, cream of tartar, and sait in the bowl of a mixer fitted with a whisk attachment. Put the sugar and water in a small saucepan and mix it so there are no dry spots, taking care not to splatter any sugar on the edges of the pot. Bring the sugar mixture to a boil and continue to cook until it reaches 235&deg;, frequently washing down the sides of the pot with a brush dipped in water. As the sugar approaches the desired temperature, begin beating the eggs so they are foamy but still quite wet. Slowly drizzle the sugar into the bowl of the mixer as it runs on low to medium speed, then increase the speed and whisk  until the meringue holds firm peaks, about 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the pie with the meringue and use a spoon to shape it into desired look. Place the pie under the broiler in the oven and watch it carefully as the meringue's surface caramelizes and turns golden brown. This will happen quickly, so be sure to watch it carefully and pull it out when it has reached your desired level of darkness. Serve immediately.</p>"}]}