{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/tree%20before%20baking'.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "holiday nibbles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Christmas Tree Bread", "link": "https://www.seriouseats.com/recipes/2011/12/christmas-tree-bread.html", "description": "Why make buns or a plain loaf of bread, if you can have a pull-apart Christmas tree on the table?", "totalTime": "2 hours 45 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 1/4 cups water", "2 1/4 teaspoons instant yeast", "1 tablespoon sugar", "3 cups (13 1/2 ounces) bread flour", "1 teaspoon salt", "1 teaspoon dried rosemary", "1 teaspoon dried thyme", "1 tablespoon olive oil", "Rice flour (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast, sugar, and about half of the flour in the bowl of your stand mixer. You don't need to be precise about that half - just eyeball it. Stir to combine, and set aside for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the bread flour along with the salt. Knead with the dough hook until the dough is smooth and elastic. Add the rosemary, thyme, and olive oil, and continue kneading until the herbs and oil are incorporated. Form the dough into a ball and drizzle it with olive oil. Cover the bowl with plastic wrap and set aside until the dough has doubled in size, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and line a baking sheet with parchment paper. When the dough has risen, flour your work surface and turn out the dough. Knead briefly, just to know out the air. Divide the dough into quarters, then divide those quarters into 4 pieces each. You should now have 16 pieces. Divide each of those in half, so you have 32 pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each piece into a ball, and arrange the balls on your prepared baking sheet in a tree patten, leaving just a little bit of space between them so they will touch when they rise. Use about 2/3 of the balls for the bottom layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a second layer on top of the first, piling more in the center and leaving the edges at a single layer. If you have some gaps that you want to fill, cut some of the remaining balls in half. This doesn't have to be a perfectly symmetrical tree.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want a snowy effect, sprinkle some rice flour on top of the tree - or you can also use regular flour. Cover the dough with plastic wrap and set aside until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 350 degrees until nicely golden - about 35 minutes. If you won't be ripping the bread apart while it's warm, let it cool on a rack.</p>"}]}