{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110727-163330-buttermilk-espresso-cake-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["buttermilk", "cakes", "coffee", "espresso", "layer cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Buttermilk Cappuccino Cake", "link": "https://www.seriouseats.com/recipes/2011/08/buttermilk-espresso-cake-layer-cake-recipe.html", "description": "The cake is moist and tender, with the subtle tang from the buttermilk and just a hint of nutmeg. I soak the layers in a coffee syrup to add additional moisture and flavor, and then cover it with an espresso-flavored Swiss buttercream.", "totalTime": "3 hours", "recipeYield": "8-10", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>For the cake:</strong>", "3 1/3 cups sifted cake flour", "1 tablespoon plus 2 teaspoons baking powder", "1/2 teaspoon salt", "1/2 teaspoon freshly grated nutmeg", "2 1/4 cups granulated sugar", "8 oz butter, softened plus more for greasing pans", "4 eggs, room temperature", "2 egg yolks, room temperature", "2 teaspoons vanilla extract", "1 2/3 cups buttermilk, room temperature", "&nbsp;", "<strong>For the soaker:</strong>", "1 cup water", "1/2 cup granulated sugar", "1/4 cup instant espresso powder", "&nbsp;", "<strong>For the icing:</strong>", "5 egg whites", "1 1/4 cups granulated sugar", "1 lb. butter, room temperature", "1 teaspoon vanilla extract", "1/4 cup instant espresso powder", "Optional: dark chocolate shavings for decoration"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the cake: Preheat oven to 350°F. Grease three 8-inch cake pans with butter and line with rounds of parchment paper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift flour, baking powder, nutmeg, and salt together, and set aside. In the bowl of a stand mixer fitted with a paddle attachment, cream butter and sugar on high speed for approximately five minutes, stopping periodically to scrape down the sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to low and begin adding the eggs, yolks, and vanilla in three additions, mixing thoroughly each time and stopping to scrape down the sides and bottom of the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the mixer and add half the dry mixture and half the buttermilk. Mix on low until just incorporated. Scrape down the sides and add the rest of the dry ingredients and buttermilk. Mix on low speed until just incorporated. Scrape down the sides and finish mixing by hand with a large spatula. Take care not to over mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly between the three prepared cake pans and bake at 350°F for approximately 20 minutes, rotating halfway through. Remove from the oven when the tops are golden brown and a tester inserted into the center comes out clean. Cool in the pan for 20 minutes, then run a knife along the edges to loosen and carefully invert onto cooling racks. slowly peel off the parchment and allow to cool completely before decorating.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the soaker: </strong>Combine water and sugar in a small saucepan and cook over medium heat until the sugar has dissolved. Remove from the heat and stir in the espresso powder. Allow the mixture to cool before use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the frosting: </strong>Bring a medium-sized pot of water to a boil. Set a mixing bowl containing the egg whites and sugar over the pot of water and whisk vigorously and continuously for approximately 6 minutes, until the mixture reaches 140°F on an instant read thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the mixture has reached 140°F, quickly remove it from the heat, attach the bowl to a stand mixer fitted with a whisk attachment, and whip the mixture on high speed until it reaches firm peaks and the bowl barely feels warm. Reduce the speed to medium and begin feeding butter into the bowl one tablespoon at a time. Whisk for 8-10 minutes, until the buttercream begins to stand up on its own. Add vanilla and espresso powder and whip on high speed until the powder dissolves, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the cake:</strong> Place the first layer on a serving plate or cake stand. Brush with the soaker, then cover the top with just shy of 1/4 inch of frosting in an even layer. Place the 2nd layer on top and do the same, covering with the 3rd layer. Brush the 3rd layer with soaker, then smooth a very thin layer of frosting over the entire exterior of the cake (crumb coat) and move to the fridge for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the crumb coat has chilled, frost the cake with the remaining frosting, reserving a small amount for piping. Pipe decorations around the edges of the top and bottom of the cake. Sprinkle with chocolate shavings if desired. Refrigerate if not using right away, but be sure to allow the cake to sit out for 20 minutes away from heat before serving.</p>"}]}