{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111003-173559-apple-cheddar-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["apple desserts", "apple pie", "cheddar", "fall desserts", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cheddar Crusted Apple Pie", "link": "https://www.seriouseats.com/recipes/2011/10/apple-pie-with-cheddar-crust-recipe.html", "description": "This recipe is designed to honor the cheddar cheese served along side. The crust has grated cheddar cheese baked into the layers, which causes it to brown more quickly than traditional pie crust, and creates an addictive, toasted cheese taste. The filling is also tailored to be paired with cheese, using firm, tart apples, and less sugar and cinnamon than traditional apple pies. A nice hit of freshly grated nutmeg is the prefect complement to the sharp cheddar, both inside and outside the crust.", "totalTime": "5 hours", "recipeYield": "8", "recipeCategory": ["Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["12.5 ounces all purpose flour", "2 tablespoons sugar", "1 teaspoon salt", "4.5 ounces butter, very cold and cut into 1/2 inch chunks", "4 ounces coarsely grated white cheddar cheese, frozen", "6 tablespoons ice water", "10 apples (Empire, Liberty, Fiji, Northern Spy, or Idareds preferred), peeled, cored, and cut into 1/2 inch wedges", "110 grams sugar", "1.5 teaspoons freshly grated nutmeg", "0.5 teaspoon ground cinnamon", "4 tablespoons heavy cream (for brushing the top)", "Slices of sharp, white cheddar cheese for serving (optional, but recommended)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine two-thirds of the flour, sugar, and salt in the bowl of a food processor. Pulse twice to incorporate. Spread butter chunks and frozen, grated cheese evenly over surface. Pulse until no dry flour remains and dough just begins to collect in clumps, about 25 short pulses. Use a rubber spatula to spread the dough evenly around the bowl of the food processor. Sprinkle with remaining flour and pulse until dough is just barely broken up, about 5 short pulses. Transfer dough to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle with water then using a rubber spatula, fold and press dough until it comes together into a ball. Divide ball in half. Form each half into a 4-inch disk. Wrap tightly in plastic and refrigerate for at least 2 hours before rolling and baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough has chilled, roll out each disk into a round sheet. Shape one sheet in a pie plate, and place both in the fridge to chill for 30 minutes or more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the apples in a bowl and toss with the sugar and spices until all of the pieces are coated. Pour the apples into the shaped bottom crust, cover with the chilled top sheet, and shape the edges of the crust. Cut patterns and/or slits into the top. Preheat the oven to 375&deg;F. Chill the shaped pie for another 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the top of the chilled pie with cream just before baking. Place the pie on the center rack of the oven for 20 minutes, rotating halfway through. Turn the oven down to 325&deg;F, and move the pie to the bottom rack and bake for an additional 20 minutes rotating halfway through, or until the filling is bubbling and the outside is golden brown. Allow the pie to cool for 30 minutes before serving. Serve with slices of cheddar cheese if desired.</p>"}]}