{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111101-dt-roasted-tomato-risotto-with-fresh-mozzarella.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "rice", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Roasted Tomato Risotto with Fresh Mozzarella", "link": "https://www.seriouseats.com/recipes/2011/11/roasted-tomato-risotto-with-fresh-mozzarella-recipe.html", "description": "As tomatoes disappear from the market, they start to get cheap. Last weekend I picked up four pounds of heirlooms for $4 and I immediately thought of an old recipe that's made an appearance in this column before: <a href=\"http://www.seriouseats.com/recipes/2008/09/roasted-tomato-sauce-for-pasta-recipe.html\"><em>The River Cottage</em>'s roasted tomato sauce</a>. It's a concentrated puree (roasted and strained) that's fantastic with pasta, but it's also the perfect balance to risotto's richness.", "totalTime": "50", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Rice", "Tomato"], "recipeIngredient": ["4 pounds tomatoes, cut into quarters", "4 cloves garlic, roughly chopped", "2 tablespoons olive oil", "6 cups vegetable stock", "2 tablespoons butter", "1 large white onion, finely chopped", "1 pound risotto rice", "Sea salt and freshly ground black pepper", "1 4-ounce ball of buffalo mozzarella, torn or cut into chunks", "microgreens or arugula for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees.  Toss the tomatoes in a bowl with the garlic and olive oil and spread them out on a baking sheet. Season generously with coarse salt and roast, turning occasionally, until soft, collapsed, and caramelized, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the tomatoes (and all the roasting juices) into a strainer or food mill and push them through into a bowl to make a thick puree.  The skins and seeds will remain in the strainer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tomatoes are roasting, bring the vegetable stock in a medium pot to a simmer.  In a large, heavy pot (such as a dutch oven), heat the butter over medium heat until the foam subsides, then add the onion and cook until soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the risotto rice to the onions and stir well to coat the grains in fat.  Continue cooking to toast the rice (it will turn partially translucent), then add 1 cup of the vegetable stock and cook until absorbed. Continue adding the stock 1 cup at a time as it's absorbed into the rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all the stock is added, taste a grain; it should be soft and still have some bite left.  If necessary, continue adding a little water to finish cooking the rice. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the roasted tomato puree and cook for a few minutes longer, then remove from the heat and stir in the fresh mozzarella.  Cover and allow to sit for a few minutes. Serve with a drizzle of olive oil and a pile of micro greens.</p>"}]}