{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/2011-04-18-147628-carrotcaketruff2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "carrot", "carrot cake", "truffles", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cakespy: Carrot Cake Truffles", "link": "https://www.seriouseats.com/recipes/2011/04/cakespy-carrot-cake-truffles-recipe.html", "description": "Composed of dense carrot cake mixed with cream cheese to form a decadent filling, a coating of high-quality white chocolate adds a sweet finish, making for a hoppy, er, <em>happy</em> eating experience. Even if you don't capture the Easter Bunny, your happiness is pretty much guaranteed.", "totalTime": "2 hours", "recipeYield": "48 truffles", "recipeCategory": ["Cakes", "Cakespy", "Candy", "Easter"], "recipeIngredient": ["1 9x13-inch (or 2 8x8-inch layers) carrot cake, unfrosted", "1 1/2 cups cream cheese frosting", "2 pounds (32 ounces) white chocolate candy coating, or 4 cups white chocolate chips", "Sprinkles, writing icing, or marzipan, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once your pre-baked carrot cake is at room temperature after baking, crumble the entire cake into a large mixing bowl. You should not see any large pieces of cake in the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 1 cup of the frosting to the bowl, and mix well with the crumbled cake, using the back of a metal spoon, until thoroughly combined. If the mixture is easy to handle and form into balls, you do not need to add the rest of the frosting; however, if it is still somewhat crumbly, add the rest and mix until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the mixture into about 48 1 1/2 inch balls, and chill in the freezer for about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two baking sheets with waxed paper; set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a double boiler, melt half of your candy coating over low heat, stirring occasionally, until it is smooth and completely melted. Note: You want to melt only half of the mixture at one time, because if you melt it all at once, the mixture may begin to harden before you've dipped all of your truffles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take a few of the balls out of the freezer at a time to dip. Place one ball at a time into the candy coating, using a spoon to coat any uncovered areas. Life the coated truffle out of the candy mixture with a spoon, and place it on your prepared sheet of waxed paper to set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the second half of your candy coating and the remainder of your truffles (or cover up the uncoated truffles and freeze until desired, up to a week).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, garnish with sprinkles, gel writing icing, or Easter candy on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the coating set for about an hour before serving.</p>"}]}