{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111005-173854-trompe-loeil-bagels-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Cakespy", "CakeSpy Presents Sweet Treats for a Sugar-Filled Life", "frosting", "Jessie Oleson"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Trompe L'oeil Bagels with Cream Cheese", "link": "https://www.seriouseats.com/recipes/2011/10/cakespy-book-trompe-loeil-bagels-with-cream-cheese-recipe-food-jokes.html", "description": "What looks like an innocent enough poppyseed bagel with cream cheese is in fact a clever cover for a doughnut sandwich with buttercream frosting.  We won't tell if you don't.", "totalTime": "10 minutes", "recipeYield": "1", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Desserts", "Doughnuts"], "recipeIngredient": ["1 plain cake doughnut", "1 teaspoon butter, melted", "Poppy seeds or sesame seeds for topping", "1 generous dollop Vanilla Buttercream Frosting (recipe follows) or your favorite cream cheese frosting, at room temperature", "&nbsp;", "<strong>Vanilla Buttercream Frosting</strong>", "2 sticks (1 cup) unsalted butter, softened", "6 to 8 cups confectioners' sugar, sifted", "1/4 cup heavy cream", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Vanilla Buttercream Frosting:</strong> In the stand mixer with the paddle attachment, mix the butter on medium speed until it is very fluffy. Add 4 cups of the confectioners' sugar, and mix on low speed until smooth and incorporated. Pause to scrape down the sides of the bowl, and add the cream and vanilla. Beat on medium speed until smooth and creamy, 3 to 5 minutes, continuing to add sugar until it has reached your desired consistency.  If your frosting becomes too stiff, you can thin it out by adding more cream, but be careful to add the cream in small (teaspoon) increments so that the frosting does not become too thin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the doughnut horizontally in half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small microwave-safe dish, melt the butter by heating it in the microwave for about 10 seconds. Using a pastry brush, lightly brush the top side of the doughnut with the melted butter (oh, get over it&mdash;they’re already fried, anyway). Immediately sprinkle poppy seeds on top of the buttered halves. Some seeds will fall off, but enough will stick to give you the right effect.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply a generous dollop of frosting to the bottom half of the doughnut and gently spread it to the edges. Note: it’s very important that the frosting be at room temperature, because if it is cold the doughnut may break apart when you try to spread it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the poppy seed-laden piece on top and consume immediately. Not to boss you around or anything, but they taste great with coffee.</p>"}]}