{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110130HotdogVolAuVent2.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["appetizers", "French in a Flash", "hot dogs", "puff pastry", "Super Bowl"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash (Super Bowl): Hotdog Vol-au-Vent", "link": "https://www.seriouseats.com/recipes/2011/02/french-in-a-flash-super-bowl-hot-dog-vol-au-vent-pigs-in-a-blanket-recipe.html", "description": "There is definitely something rustic-glam about making your own pigs in a blanket, replete with sweet onion Dijon mustard, and light-as-air puff pastry. Gone by halftime&mdash;promise!", "totalTime": "40 minutes", "recipeYield": "makes 12", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "French"], "recipeIngredient": ["1 sheet (1/2 box) frozen puff pastry, thawed but cold ", "1 tablespoon canola oil", "1 1/2 yellow onions, finely sliced on a mandoline", "3/8 teaspoon granulated sugar", "Kosher salt", "1 tablespoon Dijon mustard", "4 hot dogs, cut into thirds", "1 egg, beaten with a splash of water", "Poppy seeds (optional)", "Fleur de sel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thaw the puff pastry in the refrigerator overnight.  Preheat the oven to 400&deg;F.  Heat the canola oil in a wide sauté pan over medium heat, and add the onions, sugar, and salt.  Sauté, stirring often, until the onions are golden and soft, 7 to 8 minutes.  While they are cooking, add 1 tablespoon of water whenever the bottom of the pot gets brown.  Drain the onions of extra oil or liquid in a paper towel.  Stir the dry onions with the mustard in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the puff pastry in 1 1/2-inch strips.  Then cut each strip in half the short way.  Spread some of the onion-mustard mixture on each strip, and roll each strip around 1 piece of hot dog.  Place seam-side-down on a rimmed baking sheet, leaving space for the pastry to puff.  Repeat with the remaining pastry, onion mixture, and hot dogs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a pastry brush to lightly brush each pig in a blanket with eggwash.  Top with poppy seeds and a touch of fleur de sel.  Bake until puffed, golden, and crisp: 22 to 25 minutes.  Serve right out of the oven.  You could easily make as many multiples of this recipe as your want.  I would budget 3 per person.</p>"}]}