{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110511-127355-dinner-tonight-denver-omelet.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["brunch", "Dinner Tonight", "egg", "ham", "omelets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Denver Omelet", "link": "https://www.seriouseats.com/recipes/2011/05/denver-omelet-recipe.html", "description": "In the back of my mind I knew I'd eventually learn to make a Denver omelet; I've just been putting it off for as long as possible. It's hard to face up to dishes that you used to love when you were young. I worried that this diner classic would seem heavy handed and greasy now. It usually features a whole mess of eggs along with ham, peppers, onions, and handfuls of cheese. It was never elegant, but strangely satisfying, even if finishing one always seemed like a dare.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Breakfast and Brunch", "Dinner Tonight", "Ham", "Omelettes"], "recipeIngredient": ["1 tablespoon canola oil ", "8 ounces thick cut ham, diced", "1 green pepper, stemmed, seeded, diced", "½ white onion, diced", "8 ounces button mushrooms, cleaned, stems removed, diced", "8 ounces cheddar cheese, grated", "2 tablespoons butter", "salt and pepper ", "8 large eggs "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large non-stick skillet. Turn the heat to medium high and add the diced ham. Cook, stirring often, until the ham is lightly browned and crisp, about two minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the green pepper, onion, and mushrooms to the skillet. Stir occasionally, and cook until the vegetables are tender but still a little crisp, about two minutes. Season with salt and pepper to taste. Transfer mixture to a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean out the skillet, and then set back on the stove. Crack two eggs into a medium-sized bowl and whisk with a fork until combined. Season with a pinch of salt and pepper. Add ½ tablespoon of the butter to the skillet and turn the heat to medium-high. When melted, add the whisked eggs. Let the eggs cook for a few seconds. Then, using a spatula, push the cooked eggs towards the center of the pan, tilting the pan down to let the uncooked eggs drip towards the sides. When the middle is still a little runny, pile a quarter of the ham and onion mixture and a quarter of the cheese on half of the omelet. Carefully fold the omelet over. Let cook until the cheese melts, flipping halfway through. Transfer the omelet to a plate. Repeat process three times. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with salsa, hot sauce, sour cream, or however you’d like. </p>"}]}