{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110923appleciderjellyu.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["apple", "apple cider", "jelly", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Caramel Apple Cider Jelly", "link": "https://www.seriouseats.com/recipes/2011/09/caramel-apple-cider-jelly-recipe-apple-jelly.html", "description": "Because apple cider is unfiltered, this jelly looks a bit cloudy in the jar&mdash;much like a glass of apple cider. The intense, tangy apple flavor is complemented by a luxurious, molasses note from the brown sugar. I used cinnamon sticks, cloves, and lemon zest, but any toasty, fall-friendly spices would be delicious. Experiment with whole allspice berries, star anise, cardamom pods, or slices of fresh ginger.", "totalTime": "1 hour", "recipeYield": "Makes 6 half-pint jars", "recipeCategory": ["Apple", "Condiments and Sauces", "Fruit Desserts"], "recipeIngredient": ["5 cups apple cider", "1 cinnamon stick", "1 strip lemon or orange zest", "1/2 teaspoon whole cloves", "2 cups granulated sugar", "1 package low or no sugar needed powdered pectin (such as Ball)", "1 cup packed brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jelly, prepare the jars and lids: place six half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure 1/4 cup of granulated sugar into a small bowl and add the pectin. In another medium bowl, combine the remaining 1 3/4 cups of granulated sugar and the brown sugar. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the apple cider into a large, heavy-bottomed pot. Tie the cinnamon stick, lemon zest, and cloves in piece of cheesecloth and add it to the pot. Bring to a boil over high heat. Add the sugar-pectin mixture and return to a full rolling boil, stirring constantly. Stir in remaining sugar mixture and return to a full rolling boil. Boil hard for one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and discard the cheesecloth. Skim any foam from the surface of the jelly with a cold metal spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}