{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110925-172068-mac-and-cheese-with-soubise.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "macaroni and cheese", "Michael Ruhlman", "pasta", "Ruhlman's Twenty", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Cook the Book: Mac and Cheese with Soubise", "link": "https://www.seriouseats.com/recipes/2011/09/mac-and-cheese-with-soubise-recipe.html", "description": "Even with all of the rich ingredients that goes into baked mac and cheese, more often than not, there is something about the final dish that is bland. Somehow the sharpness of the cheese gets buried in the bechamel base, resulting in a side that's rich in texture but lacking the rich flavor we're looking for. To counter this blandness, Ruhlman has turned the bechamel base into an oniony soubise for this <strong>Mac and Cheese with Soubise</strong>, a baked mac and cheese that is never wanting for deeply warm, cheesiness.", "totalTime": "45 minutes", "recipeYield": "serves 6", "recipeCategory": ["Cheese", "Cook the Book", "Mac and Cheese", "Vegetarian"], "recipeIngredient": ["<strong>Soubise</strong>", "4 tablespoons butter", "1 medium onion, sliced", "Kosher salt", "1 shallot, roughly chopped", "3 tablespoons all-purpose flour", "1 1/2 cups milk", "1 tablespoon white wine vinegar", "3 tablespoons sherry", "1 tablespoon fish sauce", "1 to 2 teaspoons dry mustard", "1/4 teaspoon freshly ground black pepper", "6 or 7 gratings fresh nutmeg", "1/4 teaspoon cayenne (optional)", "1/4 teaspoon smoked paprika (optional, substitute cayenne if you wish) ", " ", "12 ounces macaroni, penne, or cellentani", "3 tablespoons butter, melted", "1 pound Comté, Gruyère, Emmenthaler, Cheddar, or a combination of these cheeses, grated", "1/4 cup grated Parmigiano-Reggiano, tossed with 2 tablespoons melted butter (optional)", "1/2 cup panko bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Soubise:</strong> Melt half the butter in a medium pan over medium heat and add the onions and a four-fingered pinch of salt.  Cook, stirring until the onions is nicely caramelized. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan over medium heat, melt the remaining butter. Add the shallot and a three-finger pinch of salt and cook until some of the water has cooked out of the butter, about 1 minute. Add the flour, stir to mix it with the butter, and cook until the mixture has taken on a toasted aroma, a few minutes. Gradually whisk in the milk and stir with a flat-edged wood spoon or spatula, to make sure the flour doesn’t stick to the bottom of the pan, until the sauce comes up to a simmer and thickens, a few minutes more. Stir in a three-finger pinch of salt, the white wine vinegar, sherry, fish sauce, dry mustard, black pepper, nutmeg, cayenne, and smoked paprika (if using). Add the onion to the sauce and stir until heated through. Transfer the sauce to a blender and process until puréed, or purée in the pan with a hand blender. Keep the sauce warm over low heat. You should have about 2 cups.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta just until al dente, drain, the return it to the pot. Use 1 tablespoon of the butter to spread on a 9-by-13-inch baking dish or another appropriately sized, ovenproof vessel. Place the pasta in a large bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle half of the Comté cheese into the soubise and stir until melted. Remove from the heat and pour over the pasta. Toss the pasta and pour it into the baking dish. Top with the remaining Comté. The pasta can be baked immediately or later in the day, or it can be covered and refrigerated for up to 3 days before baking. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the pasta with the Parmigiano-Reggiano (if using). In a small bowl, toss the panko with the remaining melted butter and spread this over the top.  Cover with aluminum foil and bake until heated through, about 30 minutes (longer if it has been chilled in the refrigerator). Remove the foil and bake until the cheese is nicely browned, or turn on the broiler/grill and broil/grill until the top is browned, 15 to 20 more minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately. </p>"}]}