{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110217-dt-meatballs-with-sriracha-marinara.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["Dinner Tonight", "Italian", "marinara", "marinara sauce", "meatballs", "pasta sauces", "Sriracha", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Dinner Tonight: Sriracha Marinara with Meatballs", "link": "https://www.seriouseats.com/recipes/2011/02/sriracha-marinara-with-meatballs-recipe.html", "description": "I'm not sure why it's never occurred to me to <strong>squeeze some Sriracha into tomato sauce.</strong> The complex spiciness goes well on just about everything, and in a marinara, it's a bit more interesting than a basic pinch of red chile flakes which you see much more often.  What you end up with is a sauce that's slightly sweet, slightly vinegary, slightly garlicky, and definitely spicy.  It does wonders to liven up a mainstay.", "totalTime": "50", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Italian", "Tomato"], "recipeIngredient": ["For the meatballs", "1 pound ground pork or turkey half of each", "10 oz frozen chopped spinach, thawed and squeezed of excess moisture", "3 tablespoons plain dried breadcrumbs", "1 egg white", " 1/2 teaspoon dried oregano", "3/4 teaspoon salt", "1/4 teaspoon black pepper", "cooking spray", "For the sauce", " 2 teaspoons olive oil", "1 small onion, diced", "1 clove garlic, chopped", "1 28-oz can crushed tomatoes", "2 tablespoons sriracha sauce, or more to taste", "1 pound spaghetti", "1/4 cup fresh parsley leaves, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the meat, spinach, bread crumbs, egg whites, oregano, salt, and pepper in a bowl and mix well by hand in a large bowl.    Roll into about 20 meatballs, arrange on a baking sheet, and spray with oil.  Alternatively, you can roll them individually in a small dish of oil to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler, then cook meatballs until golden brown, about 10 minutes, turning sheet once to ensure even cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat olive oil in a large, heavy pot over medium until shimmering.  Add onion and cook until translucent, about 5 minutes, then add garlic and cook for 1 minute longer.  Add tomatoes and sriracha and bring to a boil.  Simmer 10 minutes, then add meatballs and continue simmering until they are cooked through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pasta in a large pot of salted water until al dente, reserving 1 cup of pasta water before draining.  Drain pasta, add to sauce, and toss well to coat, adding pasta water if necessary to create a loose sauce.  Sprinkle with parsley and serve.</p>"}]}