{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111027-176354-grilled-hangar-steak-with-korean-flavors.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Anita Lo", "Cook the Book", "Cooking Without Borders", "potato pancakes", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Hanger Steak with Korean Flavors and Spicy Potato Pancakes ", "link": "https://www.seriouseats.com/recipes/2011/10/grilled-hanger-steak-with-korean-flavors-spices-recipe.html", "description": "A simple steak frites is that kind of meal that has the ability to please just about everyone, vegetarians aside, of course.  For this <strong>Grilled Hanger Steak with Korean Flavors and Spicy Potato Pancakes</strong>, <a href=\"http://www.annisarestaurant.com/people.htm\">Anita Lo</a> has taken the steak-fries-and-salad combo on a trip east, accenting the plate with a selection of Korean elements that elevate the dish while retaining its simple integrity.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Beef", "Cook the Book"], "recipeIngredient": ["<strong>For the steak and marinade:</strong>", "¼ cup soy sauce", "¼ cup sugar", "1 teaspoon finely chopped garlic", "1 tablespoon finely chopped scallion white", "½ teaspoon toasted sesame seeds", "Black pepper to taste", "4 (6-ounce) trimmed hanger steaks ", "&nbsp;", "<strong>For the potato pancakes:</strong>", "3 large Idaho potatoes, peeled", "1 teaspoon Korean ground chile (gochu garu) or any mild ground chile", "2 tablespoons thinly sliced (on a bias) scallion greens", "Salt and black pepper to taste", "½ cup neutral-flavored vegetable oil ", "&nbsp;", "<strong>For the salad:</strong>", "1 teaspoon soy sauce", "1 teaspoon rice vinegar", "Pinch of sugar", "1 tablespoon neutral-flavored vegetable oil", "A few drops of sesame oil", "A large handful of mixed greens, preferably an Asian mesclun", "Salt and black pepper to taste ", "<strong>For the sauce (optional):</strong>", "2 tablespoons gochujang (Korean chile paste)", "2 tablespoons water", "1 scant tablespoon sugar ", "&nbsp;", "<strong>To serve:</strong>", "Salt and black pepper to taste ", "Neutral-flavored vegetable oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the steak and marinade:</strong> Combine the soy sauce, sugar, garlic, scallion, sesame seeds, and pepper and pour over the steaks. Cover and put in the refrigerator to marinate for at least 4 hours, turning once halfway through, or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the potato pancakes:</strong> Working quickly to prevent oxidation, grate the potatoes on the largest holes of a box grater or in a food processor. Put in a clean kitchen towel and squeeze to extract as much liquid as possible. Place in a bowl and combine with the Korean ground chile and scallion. Season with salt and pepper. Heat a 12-inch saute pan over high heat. Add half of the oil and when lightly smoking, add the potatoes, divided into 4 even balls. Press down to form round cakes about 1/2 inch thick. Lower the heat to medium-high and cook until the cakes are deep golden brown. Turn and add the remaining oil if necessary (the potatoes will absorb some oil) and brown the other side. Drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the salad:</strong> Combine the soy sauce, vinegar, and sugar in a bowl and whisk in the oils. Dress the greens with the vinaigrette and season with salt and pepper.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the sauce, if desired:</strong> In a small bowl, combine all the ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Remove the steaks from the marinade and scrape off any excess marinade. Season with pepper and a little bit of salt. Rub both sides with a little oil and grill to desired doneness. Reheat the potato pancakes, if necessary, in a 375°F oven. Place one in the center of each large serving plate and ring with 1 tablespoon of the sauce (if using). Slice the steaks against the grain and arrange over the top of the pancake. Garnish the top with the salad and serve.</p>"}]}