{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110924shuna-cake.jpg", "author": {"@type": "Person", "name": "Shuna Lydon"}, "recipeCuisine": "", "keywords": ["cakes", "Guest Star", "lemon", "Shuna Lydon", "Shuna Lydon Week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon Seed Cake", "link": "https://www.seriouseats.com/recipes/2011/09/lemon-seed-cake-recipe.html", "description": "Lemon seed cake will keep, wrapped well, refrigerated for up to 10 days. I like it best the next day because its flavors tend to marry and the cake moistens, but who can say no to a slice of just-baked cake with sticky glaze?", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakes", "Lemon"], "recipeIngredient": ["<strong>For the Cake:</strong>", "145 grams unsalted butter", "200 grams sugar", "1/2 teaspoon Kosher salt", "160 grams all-purpose flour", "2 teaspoons baking powder", "2 large egg yolks", "3 large eggs", "85 grams milk, room temperature", "1-2 lemons, zested", "1 1/2 tablespoons poppy seeds", "2 teaspoons anise seeds", " ", "<strong>For the Glaze:</strong>", "450 grams fresh lemon or lime juice", "150 grams sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Preheat oven to 350&deg;F. Aggressively butter and parchment-line loaf pan.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with a paddle attachment on medium speed, cream butter until fluffy and lighter in color. You may want to scrape down bowl with a small spatula a few times to make sure all butter is getting creamed evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you’re sure butter is the lightest and fluffiest it will be, turn mixer down and add sugar and salt at once. When incorporated, turn mixer back on to medium-high and cream ferociously until pillowy light and bunny tail fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While mixture is creaming, sift flour and baking powder, set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine eggs and yolks in small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If milk is cold, warm slightly. You don’t want milk to be cold, I promise you. It makes a difference.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Zest lemon, being careful not to zest too much white pith&mdash;you only want yellow shavings. With your thumb and forefinger, smush lemon zest into poppy and anise seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you’ve scraped down the creaming butter-sugar mixture and you’re delighted by the lightness of your aerated mixture, slow mixer down and add lemony seed mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn mixer up to medium-high and add egg mixture in three additions, watching carefully&mdash;do not add more eggs in until creaming mixture is uniform. When all eggs are in, scrape down bowl and mix for 2 minutes on the high side of medium speed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn mixture down to lowest setting and, alternating between the dry ingredients and the room temp milk; start and end with dries. I call the method “D, W, D, W, D.” It’s important that each ingredient is added to mixture while previous one is still visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When batter is complete do something baking daredevilish&mdash;turn mixer speed up to very high for a count of 8 seconds and shut off immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula, fold batter top to bottom a few times to make sure nothing is hiding at the bottom of the bowl; wet or unincorporated batter tends to hide at the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon batter into prepared pan and place on baking sheet in middle rack of oven. Set first timer for 30 minutes and turn to face other direction, setting timer for 15 minutes. Cake is done when pressed middle “bounces back,” cake pulls away from sides of pan and skewer inserted in dead-center middle comes out dry. Do not pull cake out because it “looks done,” as cake attracts a lot of color in the oven. Under-baking this cake proves disastrous. If your oven runs hot you can protect the top by placing another baking sheet on rack above cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cake tin on cooling rack when done. Gently turn out of baking tin about 15-20 minutes later, right side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Glaze:</strong> Boil juice and sugar in non-reactive saucepan until reduced by half and feels sticky like honey. Reserve at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spoon or a pastry brush, generously slather lemon seed cake with citrus glaze. Twenty minutes later, brush on another coat. In case you want to gild the lily, just before slicing and eating, spread on a bit of Meyer lemon marmalade. </p>"}]}