{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/2011121-181897-sunday-supper-lancashire-hot-pot-2.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["hot pots", "kidneys", "lamb", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Lancashire Hotpot", "link": "https://www.seriouseats.com/recipes/2011/12/lancashire-hotpot-lamb-stew-recipe.html", "description": "A simple casserole for a Sunday afternoon, the Lancashire hotpot is a lamb stew baked with sliced potatoes.  Traditional recipes often include kidneys, blood sausage, or both; this version uses kidneys. If you choose to omit them, add a few more chunks of lamb.", "totalTime": "2 hours", "recipeYield": "Serves 4 hungry people", "recipeCategory": ["Lamb", "Mains", "Offal", "Sunday Supper"], "recipeIngredient": ["1 tablespoon flour", "3 lamb kidneys, cleaned and internal membrane removed", "1 tablespoon butter", "Vegetable oil", "Kosher salt and cracked black pepper", "2 pounds lamb stewing meat, cubed", "3 cloves garlic, minced", "1 carrot, chopped", "1 rib celery, chopped", "1 small onion, chopped", "1 small bunch thyme", "24 ounces beef broth", "4 large baking potatoes, peeled and cut into 1/2 inch rounds", "Butter to top casserole", "Chopped parsley to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust kidneys with flour.  Melt butter in large skillet, then fry kidneys until browned, about 2 minutes per side.  Once kidneys are brown, remove from pan and add a large swirl of vegetable oil; sear stewing meat in batches until brown on all sides and reserve.  Add garlic, carrot, celery, onion and thyme to the pan, and cook until vegetables begin soften, scarping brown bits from bottom of the pan, about 6 minutes.  Add beef stock and bring to a simmer, then turn to low while you prepare baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F.  Place half the potatoes in an overlapping pattern on the bottom of a large ovenproof baking dish with a tight fitting lid.  Pour stew over the potatoes, and top with the rest of the sliced potatoes in an overlapping pattern.  Cover with lid and place in the oven until potatoes are soft, about 1 hour.  Remove from oven and dot with bits of butter.  Turn oven to broil and brown potatoes until deep golden; allow to rest for 10 minutes before serving.  Garnish with chopped parsley and serve with a large glass of brown ale.</p>"}]}