{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110314-entertaining-doublepeapasta.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["fish", "pasta", "peas", "salmon", "seafood", "Serious Entertaining"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Double Pea Pasta with Salmon", "link": "https://www.seriouseats.com/recipes/2011/03/double-pea-pasta-with-salmon-recipe.html", "description": "[Photograph: Carrie Vasios] Check out other recipes from An Early Spring Dinner....", "totalTime": "30 minutes", "recipeYield": "6", "recipeCategory": ["Legumes", "Pasta", "Salmon"], "recipeIngredient": ["2 to 3 skinless salmon filets (about 1 pound total)", "Kosher salt and freshly ground pepper", "3 tablespoons olive oil", "1 pound small pasta, such as torre annunziata or orecchiette", "12 ounces peas, either fresh or thawed if frozen", "4 cups pea shoots", "2 tabelspoons chopped fresh mint", "4 tablespoons fresh lemon juice", "Zast of one lemon", "3/4 cup extra virgin olive oil", "1 cup grated parmesan cheese, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season salmon with salt and pepper on both sides. Heat 1 tablespoon olive oil in a grill pan over medium-high heat until smoking. Add salmon to pan and cook without moving until first side is well marked, about 4 minutes. Flip salmon, reduce heat to medium, and continue cooking until salmon is cooked through (you can peek with a knife or a fork), about 4 minutes longer. Transfer to a paper towel-lined plate, let cool for 5 minutes, then flake with a fork. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, cook pasta in well-salted water until al dente according to package instructions. Drain, reserving 1/4 cup pasta water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pan, heat remaining 2 tablespoons of olive oil over medium heat. Add pea shoots and peas and sauté until shoots have started to wilt and peas are warmed through, about 3 minutes. Add remaining olive oil, lemon juice, lemon zest, and mint. Stir to mix. Add pasta and Parmesan cheese, stirring to mix. If pasta looks dry, add reserved pasta water, one tablespoon at a time. Add the salmon and gently toss. Season with salt and pepper. Pass around extra cheese for garnish, if desired.</p>"}]}