{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110110-131525-swiss-chard-turkey-sausage-polenta.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["healthy", "healthy and delicious", "polenta", "sausage", "swiss chard", "turkey sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Healthy &amp; Delicious: Swiss Chard and Turkey Sausage Over Polenta", "link": "https://www.seriouseats.com/recipes/2011/01/healthy-delicious-swiss-chard-and-turkey-sausage-recipe.html", "description": "<strong>Is there a greater leafy green than Swiss chard?</strong> It's more versatile than Meryl Streep. It's edible both raw and cooked. It's packed with vitamins A, K, and C. Plus, it's related to the sea beet, which is really fun to say out loud. Bitter, but not so much as broccoli rabe, chard is lovely own its own, in soups, or as part of a bigger recipe.", "totalTime": "30", "recipeYield": "2 to 3", "recipeCategory": ["Corn", "Healthy and Delicious", "Turkey"], "recipeIngredient": ["3 links (9 or 10 ounces) sweet Italian turkey sausage, cut into 1/3-inch rounds", "1/2 tablespoon extra virgin olive oil", "2 medium clove garlic, minced (about 2 teaspoons)", "1/4 teaspoon red pepper flakes", "1 bunch Swiss chard, stems removed, leaves torn into bite-size pieces", "Kosher salt and freshly ground black pepper", "3 1/4 cups water", "1/2 teaspoon salt", "1 cup instant polenta", "1 tablespoon butter", "1/3 cup grated Parmesan cheese, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large dry nonstick skillet, brown sausage 6 to 8 minutes over medium heat, flipping once halfway through cooking. Remove sausage to bowl and set aside. Add olive oil to now-empty skillet and heat until shimmering. Add garlic and red pepper flakes. Cook, stirring frequently until fragrant, about 30 seconds. Add Swiss chard and cook, stirring frequently, until lightly wilted, 2 to 3 minutes. Cover and steam until fully wilted, stirring occasionally and adding water if necessary, about 4 minutes total. When chard is almost fully wilted, add sausage back to pan and heat through. Season with salt and pepper to taste. Keep warm while polenta cooks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in medium pot, bring 3 1/4 cup water and 1/2 teaspoon salt to boil over medium-high heat. Slowly add cornmeal, whisking constantly. Drop heat to a simmer and cover. Cook 4 or 5 minutes, stirring occasionally, until polenta reaches desired consistency. Remove from heat and stir in butter and Parmesan. Serve immediately with sausage and kale mixture</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon polenta into bowl. Top with chard mixture. Serve, sprinkled with Parmesan if desired.</p>"}]}