{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111020-175534-croissants-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "croissants", "pain au chocolat", "pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "2"}, "name": "Classic French Croissants", "link": "https://www.seriouseats.com/recipes/2011/10/croissants-and-pain-au-chocolat-make-at-home-recipe.html", "description": "Croissants, with their golden brown, crisp exterior and creamy, buttery interior, are always a welcome treat. To make them, you create a yeasted dough, into which you secure a sheet of butter. The flaky layers in the end product are the result of folding the dough many times, a process called lamination. From mixing and proofing, to laminating and resting and shaping, croissants are certainly not a quickie project, but with practice, the results can be amazing.", "totalTime": "2 days", "recipeYield": "Makes 12 Croissants", "recipeCategory": ["Chocolate", "Desserts", "Pastry"], "recipeIngredient": ["1/2 cup (4 ounces) hot water", "1 cup (8 ounce) whole milk", "1 tablespoon instant or rapidrise yeast", "3/4 cup sugar", "1 tablespoon kosher salt", "17.5 ounces (3 1/2 cups) all-purpose flour", "13 ounces cold butter", "1 egg, thoroughly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the dough: </strong>Combine the milk, water, and yeast in a bowl and stir. Set aside for five minutes. Meanwhile, combine the flour, salt, and sugar in the bowl of a stand mixer. Add the yeast mixture and mix on medium speed with the dough hook attachment until the dough is elastic and smooth. Transfer the dough to a clean bowl, cover with plastic wrap, and let rest at room temperature for 45 minutes. Unwrap dough, fold a few times to deflate, cover, and continue to proof until doubled in size, about 1 hour longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the butter: </strong>Cut the cold butter into 1 inch chunks and place them between two pieces of plastic wrap with a lot of overhang. Pound the butter flat, gather it back up into a mound, and pound it out again, until it is cold and pliable. Place butter between two sheets of plastic wrap or parchment paper. Using a rolling pin, roll out the butter into a 7- by 10-inch rectangle. Transfer to the refrigerator to chill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Create the layers: </strong>On a floured surface, press the dough into a large rectangle, fold into thirds, and allow it to proof on the bench for 20 minutes. Roll the dough out into a 21- by 10-inch rectangle. Place the butter sheet in the center of the dough. Fold the long dough flaps over the top to seal in the butter. Turn the dough 90 degrees so the line where the two flaps meet is vertical. Carefully roll the dough out into a large rectangle. Fold the sides towards the center in thirds like a business letter, wrap in plastic, and chill for 30 minutes. Repeat rolling and folding steps two more times. Wrap the dough in plastic and chill weighted under a heavy pan overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shape the croissants/pan au chocolat:</strong> Carefully roll out the chilled dough into an approximate 22- by 9-inch rectangle, taking care not to press the brittle, chilled butter through the dough. Trim edges to make a 21- by 8-inch rectangle, then make small marks every three inches along the top edge of the dough. Do the same on the bottom, offsetting the marking 1 1/2-inches from the edge of the dough (connecting the top markings and bottom markings should create long skinny triangle). Cut diagonal lines between the marks, forming triangles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with 1 triangle at a time, place the triangle on a lightly floured work surface with the point facing away from you. Cut a 1/2-inch slit in the center of the base and spread the dough gently apart. Begin rolling the croissant from the two flaps of dough created by the cut, and roll up to the point of the triangle. The point should end up tucked under the croissant. Bring the two ends together to form a crescent shape. Transfer to a parchment-lined baking sheet. Repeat with remaining croissants, leaving 3 inches of space between each croissant (you will need two trays total). Set in a warm spot and let rise until roughly doubled in size, about 45 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Carefully brush the croissants with egg wash.  Bake for 20 minutes, rotating halfway through, then reduce the heat to 375°F and continue baking until the croissants are golden brown, 10 to 20 minutes longer. Remove from oven and allow to cool before serving.</p>"}]}