{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111028-176743-prebake.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "carrot cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cake Baked in a Pumpkin", "link": "https://www.seriouseats.com/recipes/2011/10/cake-baked-in-a-pumpkin-halloween.html", "description": "What happens when you bake a cake in something unexpected? Like a pumpkin?", "totalTime": "3 hours, 30 minutes", "recipeYield": "12 to 14", "recipeCategory": ["Cakes", "Cakespy", "Halloween", "Pumpkin"], "recipeIngredient": ["1 pumpkin, approximately 3 pounds", "1 1/2 cups vegetable oil", "2 cups sugar", "4 eggs, well beaten", "2 cups shredded carrots", "2 1/2 cups all purpose flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "2 teaspoons cinnamon", "1 cup chopped nuts", " ", "For the frosting:", "1 package (8 ounces) cream cheese, softened", "1 cup butter, softened", "1 (1 pound) box confectioners' sugar", "1 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the pumpkin. Cut off the top third of the pumpkin, and remove all of the \"guts\". Get the insides as clean as you can; reserve the seeds, because you can roast the seeds and snack on them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 350&deg;F. Line a baking sheet with parchment paper. Set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your cake batter. Mix vegetable oil, sugar, eggs, carrots, flour, baking soda, salt, and cinnamon together in a large bowl with a wooden spoon until fully incorporated. Add nuts and fold in lightly. Pour batter into pumpkin until it is 3/4 full. If you have extra batter, use it to bake up some cupcakes. If you haven't filled the pumpkin quite 3/4 full, don't despair; the cake will rise a bit, and you can fill it in with more frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the filled pumpkin on your prepared baking sheet (the parchment will catch any dripping cake batter). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 40 to 50 minutes, or until the top of the cake is beginning to brown. Reduce heat to 275&deg;F and bake for up to 40 more minutes or until a cake tester or toothpick inserted comes out mostly clean. This will depend on the size of your pumpkin; it may need to bake longer or shorter depending on the size. This is significantly longer than most cake recipes call for; the moisture of the pumpkin has an effect on the bake time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and let cool for about 10 minutes; transfer to a plate, and put in the refrigerator to chill for 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cake cools, prepare your frosting. Cream the cream cheese and butter in an electric mixer fitted with the paddle attachment on medium speed until fluffy and incorporated; add about 1/3 of the sugar and the vanilla and beat well until incorporated, scraping down the sides of the bowl periodically. Add the remaining sugar, bit by bit, until you have a thick frosting which is still fairly easy to spread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the cake with frosting. If you don't care for a high dome of frosting, reserve the frosting to serve in small dishes with each serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, either slice the pumpkin with a sharp knife, which will yield slices which guests can slice the cake away from the pumpkin shell, or if you are feeling decadent or very messy, just spoon heaping servings right from the shell. No judgment. </p>"}]}