{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110822-167318-anellini-alla-ecorara.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Domenica Marchetti", "eggplants", "pasta", "ragu", "The Glorious Pasta of Italy", "tomato", "tomato sauces", "zucchinis"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Anellini alla Pecorara", "link": "https://www.seriouseats.com/recipes/2011/08/anellini-alla-pecorara-recipe.html", "description": "The recipe is a three-parter, beginning with Ragù all'Abruzzese, a slow cooking tomato sauce that's simmered with three types of meat, beef, lamb, and pork that enrich the sauce with all sorts of lovely meaty, fatty notes.  The curious thing about this particular ragù is that the meat is removed before serving so that it can be used in another dish such as filling for cannelloni or tortellini.", "totalTime": "4 hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Cook the Book", "Pasta", "Tomato"], "recipeIngredient": ["<strong>Pasta Dough</strong>", "4 to 4 1/4 cups unbleached all-purpose/plain flour, plus more for dusting the work surface ", "1 tsp fine sea salt", "4 extra-large eggs ", "2 tbsp extra-virgin olive oil", "About 1/4 cup tepid water", " ", "Vegetable oil for frying", "2 small eggplants, cut into small dice", "3 small zucchini, cut into small dice", "3 red bell peppers, seeded and cut into small dice", "1 batch Ragù all’Abruzzese (recipe follows), heated to a simmer", "1 cup sheep’s milk ricotta cheese or drained whole cow’s milk ricotta cheese", "Freshly grated Parmigiano-Reggiano or pecorino pomano cheese for serving", " ", "<strong>Ragù all’Abruzzese</strong> ", "3 tbsp vegetable oil or olive oil (not extra-virgin)", "6 oounces boneless beef chuck roast, cut into 4 equal pieces", "6 ounces boneless pork shoulder, cut into 3 equal pieces", "6 ounces boneless lamb shoulder, cut into 3 equal pieces", "Kosher or fine sea salt", "Freshly ground black pepper ", "3 pounds whole or diced canned tomatoes, with their juice (about 7 1/2 cups)", "2 tbsp extra-virgin olive oil", "1 yellow onion, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Ragù all’Abruzzese:</strong> Warm the vegetable oil in a large Dutch oven or other heavy-bottomed pot placed over medium heat. Season the pieces of meat with a little salt and pepper and add them to the pot. Brown for 3 to 4 minutes, then turn the pieces to brown the other side, another 3 to 4 minutes. Continue to brown the meat until it is nicely seared all over. Remove the pieces to a deep plate or bowl. Set the pot aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass the tomatoes through a food mill fitted with the disk with the smallest holes. Discard the solids. Set the milled tomatoes aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pot to medium heat and add the extra-virgin olive oil. Stir in the onion, reduce the heat to medium-low, and sauté for about 5 minutes, or until the onion is shiny and beginning to soften. Pour in the tomatoes, raise the heat to medium-high, and bring to a simmer. Return the meat to the pot and reduce the heat to medium-low or low to maintain a gentle simmer. Cover partially and let the sauce simmer, stirring it from time to time, for about 3 hours, or until the meat is very tender and the sauce is thickened. Add a splash or two of water if the sauce thickens too much before the meat is done. Taste and adjust the seasoning with salt and pepper, if you like. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat. Remove the meat from the pot before using the sauce. <small><strong>Note:</strong> The meat, by the way, would never be discarded by resourceful Italians: it is either served as a second course, or chopped finely and used as a stuffing for cannelloni or ravioli.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pasta dough:</strong> Put 4 cups of the flour and the salt in a food processor and pulse briefly to combine. Break the eggs into the work bowl and drizzle in the olive oil. With the motor running, slowly begin to add the water, adding only as much as you need for the mixture to form crumbs that look like small curds. Pinch together a bit of the mixture and roll it around. It should form a soft ball. If the mixture seems dry, drizzle in another 1 to 2 drops of water. If it seems too wet and sticky, add additional flour, 1 tbsp at a time, and pulse briefly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the mixture out onto a clean work surface sprinkled lightly with flour and press it together with your hands to form a rough ball. Knead the dough: Using the palm of your hand, push the dough gently but firmly away from you, and then fold it over toward you. Rotate the dough a quarter turn, and repeat the pushing and folding motion. Continue kneading for several minutes, or until the dough is smooth and silky. Form it into a ball and wrap it tightly in plastic/cling film. Let the dough rest at room temperature for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover a large space with a clean tablecloth and sprinkle the cloth with flour. This is where you will put the anellini once they are shaped. Pinch off a piece of dough about the size of a walnut and rewrap the rest. On a lightly floured work surface, roll the piece of dough into a thin rope about 1/8 inch in diameter. Use your palms to roll back and forth and your fingers to spread and stretch the rope as you roll. I find it is helpful to <em>very lightly</em> moisten my palms with water every so often to assist the rolling, so I keep a small bowl of water nearby. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rope is the correct diameter, cut it into 3 1/2-ich lengths. Bring the two ends of each length together to form a ring, and then roll the connecting seam together between two fingers to seal securely. As the rings are ready, place them on the flour-dusted cloth. Once you have finished shaping the first rope, pinch off a second walnut-sized piece of dough, roll it out, and shape and seal more rings. Continue to shape the anellini until you have used up all the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>There is a traditional way to form anellini you may want to try. It takes some practice and agility, but it is fairly easy to master and a little bit quicker. Rather than cut the rope into shorter lengths, lift it up with the thumb and middle finger of one hand, and wrap the end of it loosely around the index finger of your other hand, to form a loop with a tail. Pinch off the tail and seal the loop, then continue to form more loops with the remaining portion of rope.</p>\r\n\r\n<p>(If you are serving the anellini the same day, your can leave them out on the cloth for up to a couple of hours before cooking.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a very large pot or stockpot of water to a rolling boil and salt generously.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the water is heating, pour the vegetable oil to a depth of 1/4 inch into a large frying pan and place over medium-high heat. Place a platter lined with a double layer of paper towels/absorbent paper or a large, plain brown-paper bag near the stove. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully add the eggplant pieces (the oil may spatter) and fry, turning them occasionally with a slotted spoon, for 4 to 5 minutes, or until golden. Using the slotted spoon, transfer the pieces to the prepared platter to drain. Fry the zucchini in the oil in the same way, moving the pieces around in the frying pan, for about 5 minutes, or until golden. Transfer them to the same platter. Then fry the peppers for about 5 minutes, or until golden in spots and just tender. Transfer them to the platter with the other vegetables. Carefully transfer all but about 1 cup of the vegetables to the pot of ragù, gently stirring them in. Set aside the reserved vegetables for garnishing the finished dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water is boiling, carefully drop the anellini into the pot and stir to separate. Cover the pot until the water returns to a boil, then uncover and cook the pasta for about 15 minutes, or until al dente. Drain the pasta in a colander set in the sink, reserving about 1 cup of the cooking water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pasta to the pot and spoon about two-thirds of the sauce over it. Gently toss until the pasta is evenly coated with the sauce, adding a splash or two of the cooking water if necessary to loosen the sauce. Transfer the dressed pasta to a warmed serving bowl or shallow individual bowls and spoon the remaining sauce over the top. Sprinkle the reserved vegetables over the top, and then top with the ricotta and with a little Parmigiano. Serve immediately.</p>"}]}