{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111016-174878-preserved-banana-butter-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["bananas", "Jam", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Banana Butter with Pumpkin Pie Spice", "link": "https://www.seriouseats.com/recipes/2011/10/banana-butter-with-pumpkin-pie-spice-homemade-spread-recipe.html", "description": "This recipe yields a luscious spread with a jam-like consistency and a bold banana flavor. Best of all, it's relatively low in fat and calories, so you can savor all that banana bread deliciousness without the guilt.", "totalTime": "About 1 1/2 hours", "recipeYield": "Makes six half-pint jars", "recipeCategory": ["Banana", "Breakfast and Brunch", "Condiments and Sauces", "Desserts"], "recipeIngredient": ["8 large very ripe bananas", "1/2 cup freshly squeezed lemon juice", "One (1.75-ounce) package regular powdered fruit pectin", "1/2 teaspoon butter", " 6 cups granulated sugar", "1 tablespoon pumpkin pie spice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the butter, prepare the jars and lids: place six half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mash the bananas thoroughly with a potato masher or in a food processor or blender. Measure exactly four cups of mashed fruit and transfer it to a heavy-bottomed medium saucepan. Add the lemon juice, pectin, and butter and stir to combine. Bring the mixture to a boil over high heat, stirring constantly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in sugar and pumpkin pie spice all at once. Return the mixture to a boil and boil hard for one minute. Remove the pot from the heat and allow it to cool for a couple of minutes. Skim any foam from the surface of the butter with a cold metal spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot butter into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}