{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110127-134837-stuffed-pork-tenderloin.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "mains", "pork", "tenderloin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Jacques Pepin's Stuffed Pork Tenderloin", "link": "https://www.seriouseats.com/recipes/2011/01/dinner-tonight-jacques-pepins-stuffed-pork-tenderloin-recipe.html", "description": "After catching Jacques Pepin's recipe on an <a href=\"http://www.kqed.org/w/morefastfoodmyway/episode219.html\">episode of Fast Food My Way</a>, I jotted down the ingredients and set off to make it that night. The stuffing of winter greens is ideal this time of year, while the cherry tomatoes are a burst of summer as January drags on.", "totalTime": "45", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Lamb", "Pork"], "recipeIngredient": ["4 tablespoons olive oil", "1/2 cup chopped onion", "1/2 pound baby spinach or other cooking green such as Swiss chard", "1/2 teaspoon salt", "3/4 teaspoon freshly ground black pepper", "1 large pork tenderloin (about 1 1/4 pounds), trimmed of fat or silverskin and butterflied", "3/4 cup grated cheddar cheese", "1 box grape tomatoes (about 1 1/2 pints)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In 12-inch skillet, heat 2 tablespoons olive oil over medium-high heat until shimmering.  Add onion and cook briefly until beginning to soften, about 1 minute, then add spinach or other greens along with 1/4 teaspoon each salt and pepper. Cover and cook until wilted, 2-10 minutes depending on ingredient, adding water if necessary to keep moist.  Remove lid and cook further, if necessary, until all moisture is evaporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange half spinach mixture down center of pork tenderloin, top with cheese, and finish again with spinach. Fold in sides and roll tenderloin carefully to distribute filling evenly. Using butcher's twine or 2 1-inch strips of aluminum foil, wrap tenderloin at both ends to secure filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining oil in ovenproof skillet over medium heat until shimmering.  Season pork with remaining salt and pepper and brown pork on all sides, turning carefully, about 5 minutes. If using foil, remove, then transfer to oven and bake 10 minutes, until pork is cooked but slightly pink in center. Remove and transfer pork to plate to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatoes to skillet along with a pinch of salt and 2 tablespoons of water and saute over high heat until just softened, 2-3 minutes, and pan drippings are reconstituted. Slice tenderloin and arrange tomatoes around it. Serve immediately.</p>"}]}