{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110815-166259-fish-sticks.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Canal House Cooking Volume No. 6", "Christopher Hirsheimer", "cod", "Cook the Book", "fish", "fish sticks", "Melissa Hamilton", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Canal House Cooking's Fish Sticks", "link": "https://www.seriouseats.com/recipes/2011/08/fish-sticks-recipe.html", "description": "Until I ran across this fish sticks recipe in <em><a href=\"http://thecanalhouse.com/buythebook.html\">Canal House Cooking Volume No. 6</a></em> by Christopher Hirsheimer and Melissa Hamilton I was pretty sure these little logs of breaded fish were born in a box. I'd always equated them with childhood dinners and could perfectly envision them sliding out of the box and onto the toaster oven tray. But one look at those panko-coated fingers of cod in <em>Canal House Cooking</em> and it was clear that fish sticks didn't have to exist only in the frozen foods aisle.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Fish"], "recipeIngredient": ["1 1/2 cups panko", "1 cup flour", "3 eggs", "1 pound cod filet, preferably center cut", "Salt and pepper", "Canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse the panko in a food processor until the crumb is fairly fine, then transfer it to a wide dish. Put the flour in another wide dish. Beat the eggs in a third wide dish. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the fish into fat, evenly thick sticks about 3/4 inch thick by 3 inches long. Season them all over with salt and pepper. Dredge the fish, one piece at a time, first in the flour, then in the eggs, then in the panko. If you like, set the fish sticks on a wire rack to rest as you bread them, up to an hour before frying them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough oil to a large cast-iron skillet to reach a depth of 1–2 inches.  Heat the oil over medium heat until it is hot but not smoking, ideally to a  temperature of 350°F (use a candy thermometer to check the temperature). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches to avoid crowding the skillet, fry the fish sticks in the hot oil until golden brown all over, 5–6 minutes. Transfer the fish sticks with metal tongs or a slotted spatula to a wire rack set over paper towels to drain. Season with salt while still hot. Serve with lemon wedges and/or tartar sauce. </p>"}]}