{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111224-chinese-american-jewish-christmas-4.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["dumpling", "pierogi", "wonton"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Pierogi Wontons", "link": "https://www.seriouseats.com/recipes/2011/12/pierogi-potstickers-wontons.html", "description": "[Photographs: J. Kenji Lopez-Alt]...", "totalTime": "1 hour", "recipeYield": "approximately 50 wontons", "recipeCategory": ["Appetizers and Hors d'Oeuvres"], "recipeIngredient": ["3 medium sized russet potatoes", "4 ounces farmer's cheese, crumbled", "2 ounces cheddar cheese, shredded with the medium-sized hole in grater (about 1/2 cup)", "2 tablespoons soy sauce", "1 teaspoon sesame oil", "1 teaspoon Chinese fermented bean paste or fermented chili bean paste", "3 tablespoons chopped fresh cilantro leaves", "1/4 teaspoon freshly ground black pepper", "1/4 teaspoon roasted and ground sichuan peppercorns (optional)", "Kosher salt", "50 square store-bought wonton skins", "Canola or vegetable oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the potatoes by placing them in a 400 F oven until tender, about 1 1/2 hours.  Let cool, then scoop out the roasted potato flesh. Discard skins. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling: In a medium sized mixing bowl, break up the potato slightly with a fork. Add farmer's cheese, cheddar cheese, soy sauce, sesame oil, fermented bean paste, cilantro, black pepper, and sichuan peppercorns and toss to combine, taking care not to break down the potatoes too much. There should still be discernible chunks of potatoes in the mixture. Season to taste with salt. Filling for wontons may be stored in a sealed refrigerated container for up to two days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a 1/2 to 3/4 teaspoon of filling in the center of a wonton wrapper and moisten the edges with water. Fold one corner towards the opposite corner, creating a triangular pouch. Seal, taking care to push out as much air as possible. Once sealed, bring the two corners of the long end of the triangle together to form a rounded pouch. Transfer the wonton to a rimmed baking sheet lined with parchment paper. Repeat until all the filling is used, making sure not to let wontons touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to boil and add 1/4 of the wontons. Cook until they just begin to float, about 30 seconds. Remove with a slotted spoon or wire mesh spider and transfer to a parchment lined baking sheet. Separate the wontons so they don't touch. Repeat with remaining three batches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons vegetable oil in a 12-inch cast iron or non-stick skillet over medium heat over medium heat until shimmering. Add as many wontons as you can fit in a single layer and cook, swirling pan occasionally, until golden brown and crisp on the bottom. Transfer the wontons to a sering plate with the crisp side up. Repeat with remaining batches. Serve with chili oil or soy sauce for dipping. </p>"}]}