{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110825-167809-steak-kidney-pie.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["kidneys", "offal", "savory pies", "steak", "Steak and Kidney Pie", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Steak and Kidney Pie", "link": "https://www.seriouseats.com/recipes/2011/10/steak-and-kidney-pie-british-recipe.html", "description": "The smell of this pie cooking will envelope your kitchen with smells that make you feel like you've just gotten in from hunting pheasant (or maybe fox), and like you're looking forward a glass of port while you wait for your supper to be served.  This recipe uses all beef stock, but you could easily replace some of the stock with strong ale and get fantastic results.", "totalTime": "2 hours 30 minutes", "recipeYield": "4-6", "recipeCategory": ["Beef", "Mains", "Offal", "Sunday Supper"], "recipeIngredient": ["1 recipe pie crust ", "1/2 cup flour", "Kosher salt and cracked black pepper", "1 tablespoon vegetable oil", "vegetable oil", "1 pound beef kidney, rinsed, cleaned and separated", "2 pounds beef stew meat", "1 onion, finely chopped", "8 ounces white mushrooms, sliced", "2 tablespoons flour", "3 cups beef stock, warmed", "1 egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out a top and bottom crust to fit your pie shell; fit one half into pie dish and other half on sheet tray, and chill in fridge until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter and 1 tablespoon vegetable oil in large skillet over medium high heat. Season flour with salt and pepper and dredge the kidneys in the flour.  Sear kidneys in skillet until crust has formed, about 5 minutes, then flip and sear until just beginning to cook through, about 3 minutes.  Remove kidneys from skillet and reserve on a plate.  Dredge beef stew meat in seasoned flour, add another large drizzle of vegetable oil to skillet, and sear beef in small batches until all sides are brown, about 8 minutes per batch.  Remove beef to another plate and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions to hot pan and stir, scraping bits of kidney and beef off of bottom of pan.  Cook until onions are just starting to brown, about 8 minutes.  Add sliced mushrooms and continue to cook until mushrooms have released their liquid and are beginning to color, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add beef and kidneys back to pan and stir to combine with mushrooms and onions.  Sprinkle with remaining flour and stir until flour is incorporated throughout the pan.  Pour over beef stock, stir, and bring to a simmer until gravy has thickened, about 8 minutes.  Season to taste with salt and pepper.  Remove from skillet and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Once beef mixture has completely cooled, fill prepared pie plate.  Brush edges with beaten egg, then gently place top crust on pie.  Trim and seal edges.  Brush top crust with egg, then cut steam vents in top of pie crust.  Place in oven and bake until top crust is deep golden brown, about 40 minutes.  Serve with mushy peas and bitter ale.</p>"}]}