{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110927-172610-grilled-fig-sundae.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["balsamic", "Farmers' Market Desserts", "figs", "herb", "ice cream", "sundaes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Fig Sundaes with Balsamic \"Fudge\"", "link": "https://www.seriouseats.com/recipes/2011/10/grilled-fig-sundaes-with-balsamic-fudge-farmers-market-desserts-recipe.html", "description": "The sweet-tart balsamic \"fudge\" drizzled over rosemary skewered grilled figs appears brings the layers of sweetness, herbal flavors, and rich dairy together for a perfect early fall dessert.", "totalTime": "30 minutes", "recipeYield": "4", "recipeCategory": ["Bake the Book", "Desserts", "Fruit Desserts"], "recipeIngredient": ["<strong>Sauce</strong>", "1/3 cup balsamic vinegar", "3 tablespoons sweet or dry red wine ", "1 to 2 tablespoons granulated sugar ", "&nbsp;", "<strong>Figs</strong>", "8 branches fresh rosemary, about 6 inches long", "16 to 20 small to medium fresh figs", "Extra virgin olive oil, for brushing", "Best-quality sea salt, such as gray salt or fleur de sel ", "Freshly ground black pepper ", "1 pint premium vanilla ice cream "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, combine the vinegar, wine, and sugar (1 tablespoon if you are using a sweet wine, or 2 tablespoons if using a dry wine) in a small, nonreactive saucepan over medium heat, stirring until the heat is completely dissolved. Reduce the heat to a bare simmer and cook, stirring occasionally, until the sauce is thick and reduced by about half, 12 to 15 minutes. Set aside to cool (the sauce will thicken as it cools). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a gas, charcoal, or stove-top grill to medium heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the figs, pinch your fingers near one end of a rosemary branch and, leaving a small tuft of needles at the top of the branch, pull down along the branch toward the opposite end to remove the needles. Repeat with remaining branches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the stripped branches in water to cover for at least 20 minutes to help prevent them from catching fire on the grill. Chop enough of the removed rosemary needles medium-fine to yield about 4 teaspoons, and set aside to use as a garnish (reserve any remaining needles for another use). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the grill is hot and the branches are well soaked, trim the stems from the figs, cut the figs in half through the stem end, and line up five small or four larger fig halves, cut side down, on a flat surface. Thread a rosemary branch through the backs of the figs to secure them on the branch. Brush the figs lightly with olive oil on all sides, and sprinkle the cut sides very lightly with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the figs, turning once or twice, until they are warm, soft, and beginning to brown in spots, 6 to 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the ice cream into 4 bowls. Drizzle the cooled sauce over the ice cream, and sprinkle lightly with sea salt. Crisscross 2 fig skewers over each bowl and sprinkle with the chopped rosemary. Invite guests to push the figs from the skewers over the ice cream. If you have not used all the sauce, serve the remainder in a small pitcher at the table.</p>"}]}