{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110815-166247-braised-escarole-with-white-beans.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beans", "Canal House Cooking Volume No. 6", "Christopher Hirsheimer", "Cook the Book", "escarole", "Melissa Hamilton", "recipe newsletter", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Braised Escarole with White Beans", "link": "https://www.seriouseats.com/recipes/2011/08/braised-escarole-with-white-beans-recipe.html", "description": "<strong>Christopher Hirsheimer</strong> and <strong>Melissa Hamilton</strong>, authors of <em><a href=\"http://thecanalhouse.com/buythebook.html\">Canal House Cooking Volume No. 6</a>,</em> have done this bitter green justice with this recipe for <strong>Braised Escarole with White Beans</strong>.", "totalTime": "1 hour 30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Dairy-Free", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1 head escarole, dark green outer leaves  discarded, inner leaves separated and  trimmed of dark green tops", "1/4 cup good extra-virgin olive oil ", "1 or 2 cloves garlic, thinly sliced  ", "1 or 2 cups cooked white beans with  some of their cooking liquid or a  small ladleful of water (recipe follows) ", "Salt and pepper  ", "&nbsp;", "<strong>Basic Cooked Dried Beans</strong> ", "2 cups dried beans, unsoaked or soaked for 4 hours or overnight", "1 or 2 cloves garlic ", "1 branch fresh thyme, optional ", "2 bay leaves ", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the beans:</strong> Drain the beans and put them into a medium, heavy-bottomed pot. Cover them with cold water by 2 inches or so. Add the garlic, thyme, if using, and bay leaves. Bring the beans just to a simmer over medium heat, stirring occasionally. Reduce the heat to low and very gently simmer them until they are swollen and tender, 30–90 minutes (or more), depending on the freshness of the dried beans. Remove the pot from the heat. Stir in a generous pinch of  salt. Let the beans cool to just warm or to room temperature in the cooking liquid. (The beans will keep in the refrigerator for up to 4 days.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the escarole:</strong> Wash the escarole leaves well and shake off some of the water. Put the olive oil and garlic into a large nonreactive skillet and warm over medium heat until fragrant, about 1 minute. Add the escarole and cook briefly, turning the leaves as they begin to wilt. Add the beans and their cooking liquid or water, season with salt and pepper, and braise just until the beans are warmed through and the escarole is still bright and colorful, 3–5 minutes. </p>"}]}