{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/Bread-baking-flatbreads.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "cheese", "flatbreads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Cheese and Sesame Flatbreads", "link": "https://www.seriouseats.com/recipes/2011/07/bread-baking-cheese-and-sesame-flatbreads.html", "description": "Flatbreads are fun. They puff up when they bake like little pillows. The cheese bits add a heckuvalot of flavor and the bottoms get a little crisp in spots. Use these in place of buns, wraps, or flour tortillas. It's also a great way to use cheese that's starting to dry up.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes 8 flatbread", "recipeCategory": ["Bread", "Bread Baking", "Cheese"], "recipeIngredient": ["2 ounces medium-hard cheese", "9 ounces (about 2 cups) all purpose flour", "1 teaspoon salt", "1 teaspoon instant yeast", "1 tablespoon sesame seeds", "3/4 cup cold water (more, if needed)", "oil (for bowl)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the cheese roughly and put it in the bowl of your food processor fitted with the chopping blade.  Process until you have fine pieces. Change to the dough blade and add the flour, salt, yeast, and sesame seeds. Pulse a few times to distribute the ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the food processor running add the water as fast as the flour will absorb it. The dough should form a ball, If it still seems dry, add more water, a tablespoon at a time. Continue processing until the dough is elastic. (It won't be smooth because of the seeds.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the food processor, form it into a ball, drizzle with olive oil, and put it in a bowl. Cover with plastic wrap and set side until doubled, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven with a baking stone inside at 500 degrees. When the dough has doubled, flour your work surface lightly. Turn out the dough and knead it briefly, then divide it into eight pieces. Form each piece into a ball, then flatten each ball into a disk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each piece into a circle about 6 inches in diameter. You can bake them one at a time as you're done rolling them, or bake them in batches - as many as will easily fit on your stone at one time. Bake for 2 1/2 - 3 minutes until there are patchy brown spots on the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pile the flatbreads on top of each other and cover with a clean kitchen towel as they cool. If you need to deflate the flatbreads, do it carefully, protecting yourself from the hot steam.</p>"}]}