{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111026-174187-zombiecake2a.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cake", "Cakespy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zombie Graveyard Cake", "link": "https://www.seriouseats.com/recipes/2011/10/zombie-graveyard-cake-halloween-dessert-recipe.html", "description": "Starting with a generous amount of grass green-tinted frosting, the cake is then lined with cookie crumbles to resemble the residual grave-escape dirt, dotted with cookie \"graves\", and decorated with zombie cutout cake picks to form a delightful dessert that is creepy and cute all at once.", "totalTime": "1 hour", "recipeYield": "12", "recipeCategory": ["Cakes", "Cakespy", "Halloween"], "recipeIngredient": ["1 baked 9-inch square or circle cake, flavor of your choice", "1 cup butter (2 sticks)", "6 to 8 cups confectioners' sugar", "1/4 cup cream (you may not use all of it)", "1 teaspoon vanilla extract", "Several drops green food coloring", "2 cups coarsely crumbled chocolate wafer cookies", "Rounded cookies such as Vienna Fingers, to use as \"graves\"", "Writing icing", "Printed <a href=\"http://www.flickr.com/photos/cakespy/6275669144/sizes/o/in/photostream/\">zombie illustrations</a>", "Toothpicks", "Tape"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the frosting: Cream the butter in a mixing bowl fitted with the paddle attachment, mixing on medium speed until smooth and creamy in texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 4 cups of the confectioners' sugar, half of the cream, and the vanilla extract. On medium speed, beat until smooth and creamy, 3 to 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually add the remaining sugar, 1 cup at a time, beating well after each addition (about 2 minutes), until the icing is thick enough to be of good spreading consistency. You may find that you don't need all of the sugar. If desired, the remaining cream can be used to make the frosting easier to spread. Add the food coloring in last, mixing until the coloring is even.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply a small quantity of the frosting to the top and sides of the cake to be used as a crumb coat. Chill the cake for 20-30 minutes or until the crumb coat layer is firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply the rest of the frosting to the cake, applying most generously to the top of the cake, but putting enough on the sides of the cake so that there is an opaque layer covering the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately after frosting the cake, press the crumbled chocolate wafer cookies on the sides of the frosted cake. If you'd like, sprinkle a few crumbs on top, too.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your \"graves\". On the top half of a sandwich cookie (I used Vienna fingers for their oblong shape), write \"RIP\" or a spooky message. Let the writing icing set for a couple of minutes, and then press the cookie into the cake until half of it is submerged. It will resemble the shape of a grave in the cake. Repeat to form as many gravestones as you'd like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Create several zombie cake picks by cutting out  <a href=\"http://www.flickr.com/photos/cakespy/6275669144/sizes/o/in/photostream/\">these printable illustrations</a> and taping them (on the back side) to toothpicks. Insert zombie picks into cake. Finish the cake by adding whatever other spooky garnishes you'd like (meringue skulls, candy mushrooms, et cetera).</p>"}]}