{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/4182011-148001-zwiebelkuchen.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "cake", "onions", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sunday Brunch: Zwiebelkuchen", "link": "https://www.seriouseats.com/recipes/2011/04/zwiebelkuchen-onion-cake-breakfast-brunch-recipe.html", "description": "Zwiebelkuchen (which translates literally to onion cake) is, in the most basic sense, some sort of bread or crust, filled or topped with onions. The recipe here uses a thicker bread base and tops it with softly cooked onions and bacon suspended in soft custard. This Eastern European dish is traditionally served in the fall, but I feel the addition of some fresh scallions makes it perfect for a hearty spring brunch.", "totalTime": "2 hours", "recipeYield": "4", "recipeCategory": ["Bacon", "Bread", "Breakfast and Brunch"], "recipeIngredient": ["1/2 cup warm water", "1 teaspoon sugar", "1 package active dry yeast", "3 cups all-purpose flour", "1 teaspoon salt", "5 tablespoons butter, melted", "1 egg", "1/2 cup milk", "1/2 pound bacon", "4 large onions, sliced", "1/3 cup sour cream", "3 tablespoons heavy cream", "1 egg", "2 scallions, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine warm water, yeast and sugar and let sit until yeast begins to foam.  Place flour and salt in large bowl and stir to combine.  Combine melted butter, egg, and milk, and once the yeast is proofed, the yeast and water mixture.  Pour over flour and stir with wooden spoon until all the ingredients are incorporated and a sticky dough forms.   Place in well-greased bowl and allow to double in bulk, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook bacon in skillet until almost crisp; remove and drain on paper towels and roughly chop.  Pour off all but 1 tablespoon of bacon fat and place back on heat.  Add onions to pan and cook over medium heat, stirring often until very soft and brown, about 15 minutes.  Combine sour cream, heavy cream and egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;.  Place dough in well-oiled 9x13 pan and, using fingertips, stretch until it covers the pan completely.  Place onions and chopped bacon on dough, then pour over cream/egg mixture and sprinkle with scallions.  Bake until dough is golden brown, about 40 minutes.  Remove from pan, slice, and serve.</p>"}]}