{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110510-bread-baking-long-loaves.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "long loaves", "sandwich bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Long Loaves", "link": "https://www.seriouseats.com/recipes/2011/05/bread-baking-long-loaves.html", "description": "I'm not going to call these French bread or baguettes, because they are neither. What they are, though, is good. My secret weapon, semolina flour, adds a richness to the bread that I love. These are softer loaves. Still substantial, but also a bit airy. They're perfect for sandwiches&mdash;soft enough to bite into without breaking teeth or gouging the roof of your mouth with sharp crusty shards, but hearty enough to stand up to whatever fillings you choose.", "totalTime": "2 hours, 30 minutes", "recipeYield": "Makes 4 loaves", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["2 cups lukewarm water", "1 tablespoon yeast", "1 tablespoon sugar", "1/2 cup semolina flour", "1 pound, 2 ounces (about 3 1/4 cups ) bread flour", "2 teaspoons salt", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast, sugar, and semolina flour in the bowl of your stand mixer and set aside until it's bubbly, about 10 minutes. Add the flour and knead with dough hook until the mixture is smooth, supple, and elastic. Add the salt and olive oil and continue kneading until both are incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn out the dough. Knead briefly, and form the dough into a ball. Drizzle it with a bit of olive oil to coat the surface, and return it to the bowl. Cover the bowl with plastic wrap and set aside to rise until doubled in size, about 50 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and sprinkle cornmeal on 2 baking sheets. Turn out the dough and divide it into 4 roughly equal pieces. Roll each piece into a log about 12 inches long. Place 2 logs on each baking sheet. They'll look a little narrow, but they will grow impressively.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the dough with plastic wrap and set aside to rise for 20 minutes. Remove the plastic wrap. If it seems to be sticking, flour the surface a bit; rice flour is nice, for this but regular flour is fine. Slash the loaves as desired, and cover them with plastic wrap again. Let rise for another 10 minutes. They should be doubled in size, maybe a little more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 350°F until golden brown, about 25 minutes, rotating the pans about halfway through the baking time. Let the loaves cool completely on a rack.</p>"}]}