{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111219-182959-cscookies.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "christmas cookies", "Cookies", "holiday cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Candy Cane Striped Cookies", "link": "https://www.seriouseats.com/recipes/2011/12/candy-cane-striped-cookie-recipe.html", "description": "It's true: Italian Flag Cookies, or Rainbow Cookies, as they're sometimes called, are already sort of Christmas-hued. But if you, like me, prefer something more substantial than preserves between layers, you might adore this equally festive frosting-filled <strong>Candy Cane Striped Cookie</strong> variation.", "totalTime": "1 hour, 15 minutes", "recipeYield": "makes 48 cookies", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["1 can (8 ounces) almond paste", "1 cup (2 sticks) butter, softened", "1 cup sugar", "4 eggs, separated", "2 cups all-purpose flour", "1/4 cup buttercream frosting", "red food coloring (the amount will depend on the type you're using)", "1/4 teaspoon peppermint extract for frosting (optional)", "6 ounces semisweet chocolate (or 1 cup semisweet chocolate chips)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease (or line with parchment paper) the bottoms of three matching 13 x 9-inch baking pans. Set to the side. (Note: if you don't have three pans, you can re-use one three times).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place almond paste in a large bowl; break up with a fork. Cream with butter, sugar and egg yolks until light, fluffy and smooth. Stir in flour. In another bowl, beat egg whites until soft peaks form. Fold into dough, mixing until thoroughly blended.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into three even parts. Spread the dough into the prepared pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Bake at 350&deg;F for 10-12 minutes or until edges are light golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert onto wire racks; remove the parchment paper, if you used it. Place another wire rack on top and turn over. Cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one of the layers on top of a large piece of plastic wrap. Spread evenly with frosting. Top with the second layer and spread with more frosting. Layer the third piece on top (do not frost the top), forming a 3-layer stack of cake. Bring plastic wrap over layers. Slide onto a baking sheet and set a cutting board or heavy, flat pan on top to compress layers. Refrigerate for at least an hour, or as long as overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Later or the next day, melt chocolate in a double boiler. Spread over top layer; allow to harden. With a sharp knife, trim edges. Cut into 1/2-inch strips across the width; then cut each strip into 4-5 pieces. Store in airtight containers.</p>"}]}