{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100110-132200-vadouvan-lamb-chops.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["curry", "curry powder", "lamb", "lamb chops", "sauces", "Spice Hunting", "spices", "vadouvan", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vadouvan Crusted Lamb Chops with Toasted Garlic Yogurt Sauce", "link": "https://www.seriouseats.com/recipes/2011/01/vadouvan-crusted-lamb-chops-toasted-garlic-yogurt-sauce-recipe.html", "description": "Slightly smoky vadouvan's a perfect partner for gamey lamb. The two get along even better after an overnight marinade in yogurt before meeting blistering heat. The result tastes far more complicated than it is, but don't hesitate to take all the credit.", "totalTime": "40 minutes (plus an overnight marinade)", "recipeYield": "3 to 4", "recipeCategory": ["Condiments and Sauces", "Lamb"], "recipeIngredient": ["<strong>For the lamb</strong>", "5 to 6 lamb chops, about 1 pound", "1 1/2 tablespoons vadouvan, plus more for the table", "2 teaspoons kosher salt", "1 cup whole fat yogurt", "<strong>For the toasted garlic yogurt sauce</strong>", "1/4 cup olive oil", "4 cloves garlic, sliced", "2 4-inch sprigs rosemary", "1 cup whole fat yogurt", "1 egg white", "2 teaspoons cornstarch", "Juice of half a lemon", "1/2 cup minced dill weed, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large zip-top bag, combine lamb, vadouvan, salt, and yogurt. Mix until thoroughly combined, then marinate 2 to 24 hours (longer is better).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust broiler rack to three inches from heat source. Slide large cast iron skillet int broiler and heat for 15 minutes. While skillet is heating, combine olive oil, garlic, and rosemary in small saucepan and heat on lowest possible heat. Cook until garlic browns and smells toasty, about ten minutes, then remove from heat. Discard rosemary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, whisk together yogurt, egg white, and cornstarch until thoroughly combined. Slowly pour in olive oil, whisking constantly, until fully incorporated. Then transfer yogurt to pot and cook on lowest possible heat just until hot and slightly thickened, about five minutes. Stir in lemon juice and salt to taste and set aside. Sauce will continue to thicken, especially as it cools. Keep warm while preparing lamb chops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skillet is hot enough when drop of water instantly evaporates from surface. Add lamb chops, leaving plenty of space between them, and broil until browned, three to four minutes. Flip over and broil until second side is well-browned, another three to four minutes. Lamb should register 135°F on an instant read thermometer for medium-rare. Remove chops and set aside to rest for five minutes, then serve immediately with yogurt sauce, dill, and additional sprinkle of vadouvan.</p>"}]}