{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110808-tongue-sandwich.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["pickled tongue", "pickling", "The Nasty Bits", "tongues"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pickled Tongue", "link": "https://www.seriouseats.com/recipes/2011/08/pickled-tongue-recipe.html", "description": "Squeamishness aside, the tongue is such an appealing cut: tender and fatty, and delicate in taste (unlike kidneys or liver, for instance, which have a more distinctive flavor). I enjoy tongue sandwiches.  Like corned beef or pastrami, the thin slices of tongue are so rich and satisfying that it's perfect between two slices of rye bread. All it needs is some horseradish and mustard, and maybe a dill pickle.", "totalTime": "4 hours 30 minutes for cooking; 1 week for brining and cooking", "recipeYield": "6 or more", "recipeCategory": ["Beef", "Offal", "Pickling", "The Nasty Bits"], "recipeIngredient": ["1 calves or beef tongue", "<strong>For the brine: </strong>", "3 quarts water", "9 ounces brown sugar", "27 ounces coarse sea salt", "1 teaspoon black peppercorns", "1 teaspoon juniper berries", "2 cloves", "<strong>For simmering: </strong>", "1 bouquet garni", "1 carrot, chopped", "1 onion, chopped", "1 celery stalk, chopped", "1 garlic bulb, halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put all the ingredient from the brine into a large saucepan and stir well over low heat until the sugar and salt have dissolved.  Bring to a boil, then turn off the heat and leave to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tongue in a plastic container and pour the brine over the tongue, using something heavy such as a ceramic bowl to weigh down the tongue in the liquid.  Refrigerate for 4 to 5 days.  On the fifth day, remove the tongue from the brine and soak in fresh water overnight in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the salted tongue in a pot along with the simmering ingredients. Bring to a boil, then reduce the heat to low and simmer for 3.5 to 5 hours, depending on the kind of tongue and the size. The tongue is ready when it is very soft.  Peel away the rubbery lining.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the tongue, both hot and cold, with horseradish and mustard. Thinly sliced tongue may be used for a sandwich on rye with plenty of mustard and horseradish.</p>"}]}