{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111003-173559-poaching-pears-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["fall sweets", "fruit", "fruit desserts", "pears"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Poached Pears", "link": "https://www.seriouseats.com/recipes/2011/10/how-to-poach-pears-recipe.html", "description": "Poached pears make a great dessert on their own, but my favorite use for them is as an ingredient in baked goods. Poaching the pears before using them in quick breads, muffins, cakes, and pies gives them vibrant, spicy flavor and ensures that they won't be undercooked or dried out. Feel free to customize the spice combination that you use to your taste.", "totalTime": "2 hours", "recipeYield": "6", "recipeCategory": ["Fruit Desserts", "Pear"], "recipeIngredient": ["1 quart water", "1 cup sugar", "1/4 cup honey", "1 cup dry white wine", "1 tablespoon fresh ginger, minced", "1 pod from a vanilla bean (saved from another project, or the whole, scraped vanilla bean and seeds)", "2 star anise", "2 cinnamon sticks", "6 whole peeled pears (Bartlett, Bosc, or Anjou, on the slightly under-ripe side)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water, sugar, honey, wine, ginger, vanilla bean, star anise, and cinnamon sticks in a large pot and bring to a simmer. Add the pears, taking care that they are all covered by the poaching liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a round of parchment large enough to cover the pot with an extra inch around the sides. Cut a 1 inch hole in the center of parchment and press the round, with the hole directly in the center, directly on top of poaching liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer pears in the liquid until they are fork-tender and slightly translucent (depending on the pears, this can take anywhere from 45 minutes to 1 hour) Allow pears to cool in liquid before serving or using for baking. To serve, cut the pears in half the long way and scoop out the seeds with a melon ball scoop. Cut out the pith from the stems and the base. </p>"}]}