{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110311-141826-spicy-fried-rice-with-bean-sprouts-and-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "fried rice", "Mark Bittman", "pad Thai", "rice", "The Food Matters Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "'The Food Matters Cookbook': Spicy Fried Rice with Bean Sprouts, Chicken, and Peanuts", "link": "https://www.seriouseats.com/recipes/2011/03/the-food-matters-cookbook-spicy-fried-rice-with-bean-sprouts-recipe.html", "description": "My first foray into the world of Bittman's new take on responsible eating was this <strong>Spicy Fried Rice with Bean Sprouts, Chicken, and Peanuts</strong>, a spin on (not that great for you) pad thai and fried rice.  Bittman uses a few simple rules to turn takeout go-tos into an inexpensive, simple to make, easy to enjoy one-plate meal that is far more enjoyable than anything that comes in a styrofoam container.", "totalTime": "30 minutes", "recipeYield": "4", "recipeCategory": ["Chicken", "Fried Rice"], "recipeIngredient": ["3 tablespoons vegetable oil", "1/2 cup sliced scallions", "1 carrot, chopped", "3 cups bean sprouts", "8 ounces boneless, skinless chicken breast or thighs, cut into pieces of the  same size", "1 tablespoon minced garlic, or to taste", "2 cups cooked long-grain brown rice, preferably chilled", "1 egg", "1/2 cup coconut milk", "2 tablespoons nam pla (fish sauce)", "Salt and black pepper", "1/4 cup chopped peanuts", "1/2 cup chopped fresh basil, preferably Thai", "1 or more small fresh hot green chiles (preferably Thai), seeded and sliced ", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 1 tablespoon of the oil in a large skillet over high heat. When it’s hot, add the scallions, carrot, and bean sprouts and cook, stirring occasionally, until they soften and begin to brown, 3 to 5 minutes. Lower the heat if the mixture threatens to scorch. Transfer the vegetables to a bowl with a slotted spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add another tablespoon of the oil to the pan, followed by the chicken pieces; cook, stirring occasionally, over high heat until the chicken is no longer pink, 3 to 5 minutes. Add to the bowl with the vegetables, leaving as much oil in the pan as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the remaining 1 tablespoon oil in the skillet, followed by the garlic.  About 15 seconds later, begin to add the rice, a bit at a time, breaking up any clumps with your fingers and stirring it into the oil. When all the rice is added, make a well in its center and break the egg into it; scramble it a bit, then incorporate it into the rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the chicken and vegetables to the pan and stir to integrate. Add the coconut milk and cook, stirring, until most of the liquid has boiled off, just a minute or so. Add the fish sauce, then taste and season with salt and pepper. Turn off the heat and stir in the peanuts, basil, and chiles. Serve with the lime wedges.</p>"}]}