{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110506-150334-goat-cheese-blintzes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "goat cheese", "Goat: Meat Milk Cheese", "Mark Scarbrough"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Goat Cheese Blintzes", "link": "https://www.seriouseats.com/recipes/2011/05/goat-cheese-blintzes-recipe.html", "description": "If you've never made blintzes at home,  this recipe for <strong>Goat Cheese Blintzes</strong> from <strong><em><a href=\"http://www.amazon.com/Goat-Meat-Cheese-Bruce-Weinstein/dp/1584799056/serieats-20\"></a>Goat: Meat, Milk, Cheese</em></strong> by <a href=\"http://www.realfoodhascurves.com/\">Bruce Weinstein and Mark Scarbrough</a> is a great place to start. As you might have surmised from this week's slew of goaty recipes, this version swaps out the usual cow dairy in favor of goat&mdash;in this case goat milk&mdash;cheese, and even goat butter.  These subtle substitutions make for an elegant blintz, not cloyingly sweet like the Jewish deli versions filled with sugary farmers cheese and topped with canned cherries.", "totalTime": "40 minutes", "recipeYield": "16 blintzes, serves 4 to 8", "recipeCategory": ["Breakfast and Brunch", "Cheese"], "recipeIngredient": ["<strong>For the crepes:</strong>", "2 large eggs, at room temperature", "1 cup (240 ml) regular or low-fat goat milk (or cow milk, if you must)", "1 cup (125 g) all-purpose flour", "1/4 teaspoon salt", "Goat butter (or unsalted cow butter, if you must), for greasing the skillet", "<strong>For the filling:</strong>", "8 ounces (225 g) fresh chèvre or soft goat cheese ", "1 large egg yolk", "2 tablespoons sugar", "1/2 teaspoon vanilla extract", "4 tablespoons (55 g) goat butter (or unsalted cow butter, if you must)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whir the two eggs and the milk in a blender (preferably) or a food processor fitted with the chopping blade until creamy. Add the flour and salt; blend or process until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease an 8-inch (20-cm) nonstick skillet with a little butter on some wadded up paper towel. Set the skillet over medium heat, let it warm up a bit, then pour in 2 tablespoons of the flour batter. Swirl and shake the skillet so that the batter evenly covers its bottom. Cook until set, about 30 seconds. Flip the crepe, then cook for another 30 seconds or so, just until firm. Transfer the crepe from the skillet to a plate or cutting board; cover with a clean kitchen towel. Butter the skillet again, add 2 more tablespoons of batter, and keep going, repeating ad nauseam, until you have 16 crepes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the filling, stir the fresh chèvre or soft goat cheese, egg yolk, sugar, and vanilla in a big bowl until creamy. Set one of the crepes on your work surface, mound 2 teaspoons of this cheese mixture in the middle of the crepe, flatten the filling a little, fold the two sides of the crepe to your left and right over the filling, fold up the bottom, the part nearest you. Now roll the crepe away from you so that it folds up into a little packet. Set aside under a clean kitchen towel and continue filling all the crepes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet over medium heat. Add 2 tablespoons of the butter and about half the blintzes. Fry them on both sides until crisp and brown, about 4 minutes in all, turning once. Transfer these to a serving platter, add the remaining 2 tablespoons butter to the skillet, and fry the rest of them.</p>"}]}