{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111213-cookie-swap-13-melissa-payard.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["cookie swap 2011", "Cookies", "holiday cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Flourless Chocolate-Pecan Cookies", "link": "https://www.seriouseats.com/recipes/2011/12/flourless-chocolate-walnut-cookies.html", "description": "[Photograph: Robyn Lee] Swapped at the 2011 SE cookie swap by Melissa Zhang. Adapted from François Payard's Flourless Chocolate-Walnut Cookies....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["2 3/4 cups pecan halves", "3 cups confectioners’ sugar", "1/2 cup plus 3 tablespoons unsweetened Dutch-process cocoa powder", "1/4 teaspoon salt", "4 large egg whites, at room temperature", "1 tablespoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350. Spread the pecan halves on a large-rimmed baking sheet and toast in the oven for about 9 minutes, until they are golden and fragrant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool slightly, then transfer the pecan halves to a work surface and coarsely chop them. Position two racks in the upper and lower thirds of the oven and lower temperature to 320. Line two large-rimmed baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk (or combine in an electric mixer on low speed) the confectioners’ sugar with the cocoa powder and salt followed by the chopped pecans. While whisking (or once you change the speed to medium), add the egg whites and vanilla extract and beat just until the batter is moistened (do not overbeat or it will stiffen).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the batter onto the baking sheets in 12 evenly spaced mounds, and bake for 14 to 16 minutes, until the tops are glossy and lightly cracked; shift the pans from front to back and top to bottom halfway through to ensure even baking. Slide the parchment paper (with the cookies) onto 2 wire racks. Let cookies cool completely, and store in an airtight container for up to 3 days.</p>"}]}