{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110823-167444-carrot-and-ricotta-gnocchi.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["carrot", "Cook the Book", "Domenica Marchetti", "gnocchi", "The Glorious Pasta of Italy", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Cook the Book: Roasted Carrot and Ricotta Gnocchi with Herbed Butter", "link": "https://www.seriouseats.com/recipes/2011/08/roasted-carrot-and-ricotta-gnocchi-herbed-butter-recipe.html", "description": "Domenica Marchetti finishes these rich little gnocchi by tossing them in an herbed butter and baking them in the oven under a shower of finely shredded Parmigiano. Similar to another autumn pasta, butternut squash ravioli, these carrot gnocchi tread the line between sweet and savory in the best possible way, sweetly carroty and buttery with a welcome hit of salt from the Parmigiano and a brightness from the chopped herbs.", "totalTime": "1 hour", "recipeYield": "4 to 6 first-course servings", "recipeCategory": ["Cook the Book", "Pasta", "Vegetarian"], "recipeIngredient": ["<strong>For the gnocchi:</strong>", "1 1/2 pounds carrots, peeled (1 pound after trimming), cut into chunks", "Extra-virgin olive oil", "Kosher or fine sea salt", "2 teaspoons unsalted butter ", "1 tablespoon minced shallots ", "1 cup sheep’s milk ricotta cheese or drained whole cow’s milk ricotta cheese ", "2 large egg yolks, lightly beaten", "3/4 cup freshly grated Parmigiano-Reggiano cheese", "Pinch of freshly grated nutmeg", "Freshly ground black pepper", "1/4 cup unbleached all-purpose flour, plus more for rolling the gnocchi", " ", "<strong>For the herbed butter:</strong>", "6 tbsp unsalted butter", "1 heaping tablespoon mixed minced fresh herbs such as parsley, sage, rosemary, and oregano)", "1/4 cup freshly grated Parmigiano-Reggiano cheese, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the gnocchi:</strong> Heat the oven to 400°F. Place the carrots in a single layer on a rimmed baking sheet or shallow roasting pan, and drizzle 1 tbsp olive oil over them. Sprinkle with a little salt and toss with a spatula. Roast the carrots for 30 to 40 minutes, or until they are completely tender and browned in spots. Remove from the oven and reduce the oven temperature to 375°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter in a frying pan placed over medium heat. When the butter is melted and begins to sizzle, stir in the shallots and sauté, stirring frequently, 4 to 5 minutes, or until they begin to soften. Add the roasted carrots and toss to combine them with the shallots. Remove from the heat and let cool to room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the carrots to a food processor and process until fairly smooth (a few little bits are good for texture). Scoop out the carrot puree into a bowl. Add the ricotta, egg yolks, Parmigiano, ½ tsp salt, the nutmeg, and a few grinds of pepper. Gently stir in the ¼ cup flour, taking care to combine everything thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a scoop of flour in a shallow bowl. Have two standard tablespoons at hand. With one spoon, scoop up about 1 tbsp of the carrot mixture and then transfer it to the other spoon. Transfer the mixture back and forth a few times to help shape the mixture into a ball (it does not have to be perfectly round). Gently drop the ball into the bowl of flour and coat it lightly. Then roll the ball between your palms to produce a chestnut-sized nugget. Transfer to a lightly floured rimmed baking sheet/tray. Repeat until you have used up all the mixture. You should end up with 32 to 36 gnocchi.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a rolling boil and salt generously.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the herbed butter:</strong> Melt the butter in a small frying pan placed over medium-low heat. When the butter is melted and begins to sizzle, stir in the herbs and cook, stirring occasionally, for just a couple of minutes, or until the butter has taken on the flavor of the herbs. Remove from the heat. Spoon some of the herbed butter into a baking dish large enough to hold all the gnocchi in one snug layer. Set the dish near the stove. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water is boiling, carefully drop half the gnocchi into the pot. Cover the pot until the water returns to a boil, then uncover and cook the gnocchi for about 5 minutes. They will float to the top when they are nearly done. Using a skimmer or a large slotted spoon, remove the gnocchi to the prepared baking dish. Cook the remaining gnocchi in the same way and add them to the baking dish. Drizzle the remaining herbed butter over the gnocchi. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the ¼ cup Parmigiano cheese over the gnocchi and place in the oven. Bake the gnocchi for about 15 minutes, or until they are hot throughout and the cheese is melted. Serve immediately. Pass additional cheese at the table. </p>"}]}