{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110310-dt-pasta-e-broccoli.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["broccoli", "Dinner Tonight", "Italian", "pasta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Dinner Tonight: Pasta e Broccoli", "link": "https://www.seriouseats.com/recipes/2011/03/dinner-tonight-pasta-e-broccoli-recipe.html", "description": "What really works with the famous pasta e broccoli is that if you cook it long enough, the parboiled broccoli breaks up into the pasta and almost melts into a pasta-clinging sauce when combined with the cooking water. Increasing the ratio of broccoli-to-pasta not only makes the dish a bit healthier, but better too. While this version is a simple one with garlic, pepper flakes, and Parmesan, another route might melt some anchovies into the oil and skip the Parmesan. Either way, this is, at the very least, a delicious way to eat your broccoli.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Broccoli", "Dinner Tonight", "Italian", "Pasta", "Vegetarian"], "recipeIngredient": ["1 pound pasta ", "1 large head broccoli, cut into florets", "4 tablespoons olive oil", "3 cloves garlic, chopped", "1/2 teaspoon red chili flakes, or to taste", "1/2 cup freshly grated Parmesan cheese", "salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil and add the broccoli florets.  Cook until tender, then remove with a slotted spoon.  Add the pasta and cook until al dente, reserving 1/2 cup cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy skillet, heat olive oil over medium heat until shimmering.  Add garlic and red chile flakes and cook until fragrant, about 1 minute, then add broccoli and toss well in the oil, cooking until completely tender, 1-2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pasta to the pan with the broccoli and toss well to coat. Add half the Parmesan and reserved pasta cooking water little by little until it creates a sauce that clings to the noodles.  Season to taste with salt and pepper. Serve immediately with remaining Parmesan.</p>"}]}