{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111130-181724-old-fashioned-cupcakes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cupcakes", "David Arrick", "orange", "The Butch Bakery Cookbook", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Old-Fashioned Cupcakes", "link": "https://www.seriouseats.com/recipes/2011/12/old-fashioned-cupcakes-orange-buttercream-recipe.html", "description": "Whiskey-soaked orange cupcakes topped with Old-Fashioned buttercream?  All you need is a maraschino cherry on top to complete these cocktail inspired cupcakes.", "totalTime": "2 hours", "recipeYield": "makes 12 cupcakes", "recipeCategory": ["Bake the Book", "Cakes", "Orange"], "recipeIngredient": ["<strong>For the Extreme Orange Cupcakes:</strong>", "1 1/2 cups plus 2 tablespoons cake flour ", "1 1/2 teaspoons baking powder", "1/2 teaspoon salt", "12 tablespoons (1 1/2 sticks) unsalted butter, softened ", "1 1/4 cups sugar", "3 large eggs, broken into a small bowl", "1/4 cup plus 2 tablespoons freshly squeezed orange juice, from 3 large oranges", "1 tablespoon orange zest, from 1 large orange", "1/4 teaspoon orange extract", "1 teaspoon pure vanilla extract", "1/4 cup full-fat sour cream", "&nbsp;", "<strong>For the Real “Old-Fashioned” Buttercream:</strong>", "12 tablespoons (1 1/2 sticks) unsalted butter, softened", "4 1/2 cups confectioners’ sugar, sifted through a strainer ", "1/4 cup plus 2 tablespoons whiskey, such as Jack Daniel’s", "9 dashes Angostura bitters", "3/4 teaspoon orange extract ", "1/2 teaspoon orange zest", "&nbsp;", "<strong>For the Soaking Liquid:</strong>", "1/4 to 1/2 cup whiskey, such as Jack Daniel’s ", "&nbsp;", "<strong>Topping:</strong>", "Orange Sawdust (recipe follows)", "&nbsp;", "<strong>For the Orange Sawdust:</strong>", "2 tablespoons sugar ", "1/2 teaspoon grated orange zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Orange Sawdust:</strong> In a small bowl, mix together the sugar and the orange zest. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Cupcakes:</strong> Place a baking rack in the center of the oven and preheat the oven to 350°F. Line two 6-cup jumbo-size muffin pans with liners and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a strainer over a medium-size mixing bowl and sift together the cake flour, baking powder, and salt. Set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another medium-size mixing bowl, with an electric mixer on medium-high speed, beat the butter and sugar together until light and fluffy, 2 to 3 minutes. Scrape down the sides of the bowl, and add the eggs, beating until combined. Add the flour mixture, orange juice, orange zest, orange extract, and vanilla, beating on low speed just until all the dry ingredients are incorporated. Add the sour cream and beat again to incorporate, scraping down the sides of the bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each prepared muffin cup with a rounded 1/3 cup batter, about 3/4 full. Bake, rotating the pans halfway through, until the tops are just firm to the touch and a tester inserted in the center of a cupcake comes out clean, about 24 minutes. Leave the cupcakes in the pan on a rack to cool for 5 to 10 minutes. Transfer the cupcakes to the wire rack to cool completely before frosting, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Buttercream:</strong> In a large-size mixing bowl, with an electric mixer on medium-high speed, beat the butter until light and fluffy. Scrape down the sides of the bowl, reduce the speed to medium, and add half of the confectioners’ sugar, the whiskey, bitters, orange extract, and orange zest, beating to incorporate. Add the rest of the confectioners’ sugar, beating on medium-high for 2 to 3 minutes until very smooth and creamy, scraping down the sides of the bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cupcake Construction:</strong> Using a wooden skewer, poke about 15 holes in the top of each cupcake and slowly spoon 1 to 2 teaspoons of the whiskey over the top of each cupcake. Let them sit for 10 minutes to allow the whiskey to be absorbed. Now get out that ice cream scoop (2 to 2 1/4 inches in diameter) and top each cupcake with frosting. Sprinkle the tops with 1/4 to 1/2 teaspoon of the orange sawdust, if desired. Cupcakes can be refrigerated for up to 3 days in an airtight container, or frozen for 1 month.</p>"}]}