{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/buns%20(2).JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "rolls", "sweet potatoes", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Bread Baking: Maple and Sweet Potato Buns", "link": "https://www.seriouseats.com/recipes/2011/11/bread-baking-maple-and-sweet-potato-buns.html", "description": "These buns are sweet from the potatoes, but not too sweet. It's not like they're breakfast buns. They'd make great dinner rolls, particularly one involving ham. Or to make ham sandwiches from the leftovers.", "totalTime": "3 hours", "recipeYield": "Makes 15 buns", "recipeCategory": ["Bread", "Bread Baking", "Sweet Potatoes and Yams"], "recipeIngredient": ["2 teaspoons instant yeast", "1 cup lukewarm water", "2 tablespoons maple syrup", "3 cups (13 1/2 ounces) bread flour", "1 cup mashed sweet potatoes", "1 teaspoon maple extract", "1 teaspoon salt", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the yeast, water, and maple syrup and 2 cups of flour in the bowl of your stand mixer. Stir to combine and set aside for 10 minutes to get bubbly. Add the remaining bread flour, sweet potatoes, and maple extract. Knead with the dough hook until you have a smooth, elastic dough. Add the salt and the butter and continue kneading until both are incorporated. Cover the bowl with plastic wrap and set aside until the dough has doubled in size - about an hour and 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface, line a baking sheet with a sheet of parchment, and preheat the oven to 350 degrees. Turn out the dough and divide it into 15 pieces. Form each into a ball and place it on the prepared baking sheet. Cover with plastic wrap and set aside until the rolls are doubled in size, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap and bake at 350 degrees until the buns are nicely browned, about 30 minutes. Place the buns on a rack to cool.</p>"}]}