{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111220-184601-chocolate-covered-sandwich-cookies-with-dulce-de-leche.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chocolate", "Cookies", "dulce del leche", "holiday cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fine Cooking's Chocolate-Covered Sandwich Cookies with Dulce de Leche", "link": "https://www.seriouseats.com/recipes/2011/12/fine-cookings-chocolate-covered-sandwich-cookies-with-dulce-de-leche-alfajores.html", "description": "<em>Alfajores</em> can be filled with jam or chocolate mousse, but our favorite version is stuffed with dulce de leche.", "totalTime": "1 hour 30 minutes plus overnight chilling time", "recipeYield": "makes about twenty-eight 2-inch sandwich cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["12 ounces (2 2/3 cups) unbleached all-purpose flour; more for rolling", "6 ounces (1 1/3 cups) whole-wheat flour", "2 teaspoons baking powder", "1 teaspoon table salt", "1/2 pound (1 cup) unsalted butter, softened at room temperature", "3/4 cup granulated sugar", "1 1/2 teaspoons finely grated orange zest", "2 cans Nestlé dulce de leche (13.4 ounces each)", "1 pound bittersweet chocolate, chopped", "1 pint heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the cookies:</strong> In a medium bowl, whisk both flours with the baking powder and salt. Using a stand mixer fitted with the paddle attachment, cream the butter and sugar on medium speed until light and fluffy, 2 to 3 minutes. Stir in the orange zest and vanilla. Scrape down the bowl and paddle with a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer on low, gradually add the flour mixture to the butter mixture. After adding the last of the flour but before it’s fully incorporated, add 1/4 to 1/3 cup cold water and mix just until a smooth dough forms, 1 to 2 minutes. Divide the dough, shape into two disks, and wrap each in plastic. Chill overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and heat the oven to 350°F. Line two cookie sheets with parchment. Roll out the cold dough on a lightly floured surface until it’s 1/8 to 3/16 inch thick. With a 2-inch plain or fluted round cookie cutter, cut the dough into rounds&mdash;you can gather and reroll the scraps once. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake one sheet at a time until the edges are very lightly browned and the cookies puff up slightly, 8 to 10 minutes. Let the cookies cool on a rack and store in an airtight container for up to 3 days or freeze for up to 1 month, until you’re ready to fill and coat them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fill the cookies:</strong> Lay out the cookies, flat side down. Put a heaping 1/2 tablespoon of the dulce de leche on half of the cookies. Cover each with a top cookie, flat side up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Coat the cookies:</strong> Put the chocolate in a small, deep, heatproof bowl. In a small saucepan over medium-high heat, bring the cream just to a boil. Pour over the chocolate and let sit for 10 minutes. Stir the mixture very gently, incorporating the cream steadily and without overworking, until glossy and completely mixed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two cookie sheets or rimmed baking sheets with parchment. Pick up a sandwich cookie with a small offset spatula. Immerse in the chocolate mixture, flipping the cookie to coat completely. Pick up with the spatula and tap a couple of times on the side of the bowl to get rid of excess chocolate. With another spatula in the opposite hand, gently smooth out the top of the cookie and then run the spatula along the bottom. Transfer to the parchment-lined sheet. Repeat with the remaining cookies. Allow the coating to set at room temperature for a few hours and then serve. </p>"}]}