{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/08112011-165628-technique-baking-cakes-21.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cream", "pastry cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "3"}, "name": "Pastry Cream", "link": "https://www.seriouseats.com/recipes/2011/08/pastry-cream-recipe-for-cakes-eclairs-pastries.html", "description": "Pastry cream is ubiquitous in the dessert world. It's used to fill all sorts of treats, such as cakes, eclairs, cream puffs, fresh fruit tarts, and all kinds of French puff pastry items. It's a lot like pudding, but usually made richer and a bit thicker with the addition of extra egg yolks. Be sure to whip chilled pastry cream thoroughly before using to ensure that it is completely smooth.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["2 cups whole milk", "1 cup granulated sugar, divided", "1 vanilla bean, scraped", "pinch of salt", "3 egg yolks", "1 egg", "2 1/2 tablespoons cornstarch", "3 tablespoons butter, softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dampen the surface and sides of a cookie sheet. Line the bottom and sides of the sheet with plastic wrap. Have more plastic wrap at the ready and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine milk, 1/2 cup sugar, the seeds and pod of the vanilla bean, and salt. Slowly bring to a low boil over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As the milk mixture heats up: In a small bowl, whisk together 1/2 cup sugar and cornstarch and set aside. Stabilize a medium sized bowl by placing it on top of a wet cotton towel on the countertop. Add the yolks and egg. Whisk for 30 seconds, until the yolks are broken up and the mixture begins to look homogenous. Add the starch mixture and whisk until you can no longer see any clumps, about 2 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the milk mixture comes to a low boil, remove it from the heat. Remove the pod of the vanilla bean. <a href=\"http://sweets.seriouseats.com/2010/05/how-to-temper-eggs.html\">Temper the egg mixture with the hot liquid</a> in three additions, whisking briskly as you go. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the mixture to the original saucepan and whisk vigorously over medium heat. After about a minute, the mixture will begin to thicken. Continue to whisk, and watch for bubbling. Once you see bubbles, whisk for two additional minutes. Remove the saucepan from the heat and whisk in the butter, until it completely disappears into the pastry cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the pastry cream into the prepared lined pan. Immediately press plastic wrap gently over the entire surface. Chill for at least 2 hours before using. Whip the pastry cream mixture until it is smooth and creamy just before using.</p>"}]}