{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111024-176368-blueberry-and-cream-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "blueberries", "Christina Tosi", "Cookies", "Momofuku Milk Bar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Momofuku Milk Bar's Blueberry and Cream Cookies", "link": "https://www.seriouseats.com/recipes/2011/10/blueberry-cream-cookies-momofuku-milk-bar-recipe.html", "description": "<a href=\"http://www.momofuku.com/restaurants/milk-bar/bios/\">Christina Tosi</a>'s Compost Cookies might get all of the attention but these <strong>Blueberry &amp; Cream Cookies</strong> might just be the sleeper hit at all of the <a href=\"http://www.momofuku.com/restaurants/milk-bar/\">Milk Bar</a> locations due to their awesome inspiration&mdash;the crumbly tops of blueberry muffins.", "totalTime": "1 hour 30 minutes", "recipeYield": "15 to 20 cookies", "recipeCategory": ["Blueberry", "Cookies", "Desserts"], "recipeIngredient": ["16 tablespoons (2 sticks, 225 grams) butter, at room temperature", "3/4 cups (150 grams) sugar", "2/3 cups (150 grams) light brown sugar, tightly packed", "1/4 cup (100 grams) glucose or 2 tablespoon (35 grams) corn syrup", "2  eggs", "2 cups (320 grams) flour   ", "1/2 teaspoon (2 grams) baking powder", "1/4 teaspoon (1 1/2 grams) baking soda", "1 1/2 teaspoons (6 grams) kosher salt", "1/2 recipe Milk Crumb (recipe follows)", "3/4 cup (130 grams) dried blueberries", "&nbsp;", "<strong>Milk Crumb</strong>", "1/2 cup (40 grams) milk powder", "1/4 cup (40 grams) flour", "2 tablespoons (12 grams) cornstarch  ", "2 tablespoons (25 grams) sugar   ", "1/2 teaspoon (2 grams) kosher salt  ", "4 tablespoons (1/2 stick, 55 grams) butter, melted  ", "20 g  milk powder  1/4 cup", "3 ounces (90 grams) white chocolate, melted "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Milk Crumb:</strong> Heat the oven to 250&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the 40 grams (1/2 cup) milk powder, the flour, cornstarch, sugar, and salt in a medium bowl. Toss with your hands to mix. Add the melted butter and toss, using a spatula, until the mixture starts to come together and form small clusters.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the clusters on a parchment- or Silpat-lined sheet pan and bake for 20 minutes. The crumbs should be sandy at that point, and your kitchen should smell like buttery heaven. Cool the crumbs completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble any milk crumb clusters that are larger than 1/2 inch in diameter, and put the crumbs in a medium bowl. Add the 20 g (1/4 cup) milk powder and toss together until it is evenly distributed throughout the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the white chocolate over the crumbs and toss until your clusters are enrobed. Then continue tossing them every 5 minutes until the white chocolate hardens and the clusters are no longer sticky. The crumbs will keep in an airtight container in the fridge or freezer for up to 1 month.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cookies:</strong> Combine the butter, sugars, and glucose in the bowl of a stand mixer fitted with the paddle attachment and cream on medium-high for 2 to 3 minutes. Scrape down the sides of the bowl, add the eggs, and beat for 7 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to low and add the flour, baking powder, baking soda, and salt. Mix just until the dough comes together, no longer than 1 minute. (Do not walk away from the machine during this step, or you will risk overmixing the dough.) Scrape down the sides of the bowl with a spatula.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Still on low speed, add the milk crumbs and mix until they’re incorporated, no more than 30 seconds. Chase the milk crumbs with the dried blueberries, mixing them in for 30 seconds.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a 2 3/4-ounce ice cream scoop (or a 1/3-cup measure), portion out the dough onto a parchment-lined sheet pan. Pat the tops of the cookie dough domes flat. Wrap the sheet pan tightly in plastic wrap and refrigerate for at least 1 hour, or up to 1 week. Do <em>not</em> bake your cookies from room temperature&mdash;they will not bake properly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the chilled dough a minimum of 4 inches apart on parchment- or Silpat-lined sheet pans. Bake for 18 minutes. The cookies will puff, crackle, and spread. After 18 minutes, they should be very faintly browned on the edges yet still bright yellow in the center; give them an extra minute or so if that’s not the case.</p>"}]}