{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110322-143677-honeydew-cucumber-shake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Adam Ried", "cucumber", "Drink the Book", "honeydew", "ice cream", "milkshakes", "Thoroughly Modern MIlkshakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Drink the Book: Honeydew Cucumber Shake with Cucumber Granita", "link": "https://www.seriouseats.com/recipes/2011/03/drink-the-book-honeydew-cucumber-shake-with-cucumber-granita-recipe.html", "description": "Before getting my hands on a copy of <a href=\"http://adamried.com/\">Adam Ried</a>'s <strong><em><a href=\"http://www.amazon.com/Thoroughly-Modern-Milkshakes-Classic-Contemporary/dp/0393068773/serieats-20\">Thoroughly Modern Milkshakes</a></em></strong> I'd never thought about milkshakes as an elegant way to end a meal.  ut after checking out this recipe for <strong>Honeydew Cucumber Shake with Cucumber Granita</strong> I have a feeling that milkshakes are going to be my new go-to desserts for the spring and summer.  This pale green shake blends chunks of sweet, mild honeydew with an icy cucumber-lime granita, sweet and milky on the bottom with flakes of refreshing citrusy ice on top.", "totalTime": "8 hours", "recipeYield": "4", "recipeCategory": ["Cucumber", "Drink the Book", "Ice Cream and Frozen Treats", "Milkshake", "Non-Alcoholic"], "recipeIngredient": ["2 tablespoons  sugar (about 1 ounce/24 grams) ", "2 tablespoons water (about 1 ounce/  30 milliliters)  ", "Pinch of salt ", "1 tablespoon freshly  squeezed lime juice  3⁄4 medium cucumber  (about 8 ounces/  227 grams), peeled,  seeded, and roughly chopped (about 1 cup)", "1⁄2 small, ripe  honeydew melon  (about 1 pound/  454 grams), peeled,  seeded, and cut into  1 1⁄2-inch (4 centimeter)  chunks (about 3 cups) ", "6 medium scoops  vanilla bean or original  vanilla ice cream  (about 1 1⁄2 pints/  18 ounces/510 grams),  soft ened until just  melty at the edges "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the granita:</strong> Bring the sugar and water to a gentle boil in a small saucepan over medium- high heat, swirling the pan to dissolve the sugar; reduce the heat to medium and simmer for 2 <br />\r\nminutes. Off the heat, cool the syrup to room temperature. Place the syrup, salt, 2 teaspoons of the lime juice, and the cucumber in a blender and puree until smooth. Pour the cucumber mixture into a shallow container. Cover and freeze until softly frozen (not solid), 2½ to 3 hours. Remove from the freezer and gently run a dinner fork through the frozen mass to break it down into loose, icy crystals. Cover the container and return it to the freezer. Freeze until ﬁrm, checking and raking the granita with the fork every hour or two to keep the crystals loose and ﬁne, at least 7 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the shake Place ½ cup (about 2½ ounces/70 grams) of granita, the honeydew, and the remaining 1 teaspoon of lime juice in a blender and blend to break down the honeydew completely, about 1 minute. Add the ice cream and pulse several times to begin breaking it up. With the blender motor off, use a ﬂexible spatula to mash the mixture down onto the blender blades. Continue pulsing, stopping, and mashing until the mixture is well blended, thick, and moves easily in the blender jar, roughly 30 to 90 seconds. Pour into a chilled glass or glasses, top each with ½ cup (about 2½ ounces/70 grams) granita, and serve at once. </p>"}]}