{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110308GuinnessCookies&Mousse_2.jpg", "author": {"@type": "Person", "name": "Caroline Ford"}, "recipeCuisine": "", "keywords": ["chocolate desserts", "Cookies", "Guinness Week", "mousse"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Guinness Week: Stout and Chocolate Mousse with Guinness Oatmeal Cookies", "link": "https://www.seriouseats.com/recipes/2011/03/guinness-chocolate-mousse-with-guinness-oatmeal-cookies-st-patricks-day-dessert.html", "description": "The mousse is light and fluffy, but with amazing depth <strong>thanks to the malt and coffee notes in the beer</strong> teamed up with rich dark chocolate. And then the chewy, crisp-edged cookies...I had to bag them up to stop eating them.", "totalTime": "3 hours 30 minutes", "recipeYield": "8-10 servings, plus lots of extra cookies!", "recipeCategory": ["Cookies"], "recipeIngredient": ["<strong>For the Mousse</strong>", "8 ounces dark chocolate (60%), roughly chopped", "1 stick unsalted butter, cut into 1 inch pieces", "1/2 cup Guinness", "1 teaspoon vanilla extract", "1/4 teaspoon sea salt", "4 large eggs, separated", "1/3 cup granulated sugar", "1 cup heavy whipping cream", " ", "<strong>For the Cookies</strong>", "1 cup Guinness", "2 sticks unsalted butter, at room temperature", "1 cup packed light brown sugar", "1/2 cup sugar", "2 eggs", "1 teaspoon vanilla extract", "2 cups oats", "3/4 cup all-purpose flour (spooned and leveled)", "3/4 cup whole wheat flour (spooned and leveled)", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1 cup dark chocolate chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt chocolate and butter in a double boiler over a low simmer, stirring frequently until melted. Remove from heat and stir in Guinness, vanilla, and salt. Whisk in egg yolks one at a time, until thoroughly combined. Cool 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in an electric mixer fitted with a whisk attachment, whip egg whites on high speed into soft peaks. With mixer running, slowly add sugar, until thick and shiny. Slowly fold 1/3 of egg whites into chocolate mixture, then fold in remainder of egg whites until just incorporated, being careful not to overmix or mousse will lose volume.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an electric mixer fitted with whisk attachment, whip cream on high speed into stiff peaks. Slowly fold into chocolate mixture until completely incorporated. Put into serving bowls; cover and refrigerate for at least 2 hours for flavors to meld. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cookies</strong>, cook Guinness in a small saucepan over medium-high heat until reduced to 1/2 cup. Set aside. Preheat oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place butter and both sugars in an electric mixer fitted with a paddle attachment. On medium-high speed, cream until light and fluffy, 2-3 minutes. Add eggs, reduced Guinness, and vanilla, beat until combined, scraping down the bowl as needed. Add oats, both flours, baking powder, baking soda, and salt until just combined, 15-30 seconds. Stir in chocolate chunks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop 1/2 tablespoon portions of cookie dough onto parchment lined baking sheet, leaving a 1 inch space between each. Bake 6-9 minutes, cookies should look slightly underdone when you remove them from the oven. Let cool on cookie sheet 5 minutes, transfer to wire rack to cool completely. Keep raw cookie dough in refrigerator while baking. </p>"}]}