{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110311-141836-mark-bittmans-crab-cakes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["celery root", "crab cakes", "Mark Bittman", "The Food Matters Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.3333333333333", "ratingCount": "3"}, "name": "'The Food Matters Cookbook': Mark Bittman's New Crab Cakes", "link": "https://www.seriouseats.com/recipes/2011/03/the-food-matters-cookbook-mark-bittmans-new-c.html", "description": "Embracing a less-is-more philosophy when it comes to animal products, these <strong>New Crab Cakes</strong> are made with equal parts lump crab (preferably responsibly caught and American-sourced) and creamy, mild celery root.  If it sounds like an odd combination, all I can say is, don't knock it until you try it.  There's something about the sweet shredded celery root that mimics the texture of crab beautifully.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["Lobster and Crab"], "recipeIngredient": ["8 ounces fresh lump crab meat, picked over for cartilage  and shell", "1 small celery root (8 to 12 ounces), peeled and grated", "1 egg", "Salt and black pepper", "2 tablespoons bread crumbs, preferably whole grain and homemade, or more as needed ", "2 tablespoons mayonnaise", "1/3  cup Dijon mustard", "1 small cucumber, peeled, seeded, and chopped  ", "1 red bell pepper, chopped", "1/2 cup chopped scallions ", "About 1 cup whole wheat flour", "2 teaspoons curry powder, optional", "1/4 cup vegetable oil", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together the crab meat, celery root, egg, and some salt and pepper. Add enough bread crumbs to bind the mixture just enough to form into cakes that don’t crack too easily; start with 2 tablespoons and use more if you need it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you have time, refrigerate the mixture for at least 30 minutes or up to several hours; it will be easier to shape. Meanwhile, combine the mayonnaise, mustard, cucumber, bell pepper, and scallions in a small bowl. Sprinkle with salt and pepper and stir until well mixed; refrigerate the sauce until you’re ready to eat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the flour with salt and pepper, and stir in the curry powder if you’re using it. Heat a large skillet (preferably cast iron) over medium-high heat for 2 to 3 minutes. Add the oil and heat until it shimmers. Shape the crab meat mixture into 1-inch-thick cakes, dredge each in the flour, and cook, adjusting the heat as necessary and turning once (very gently), until golden brown on both sides, about 5 minutes per side. (Work in batches if you’re making small cakes; you don’t want to crowd the pan.) Serve with lemon wedges and the mustard relish.</p>"}]}