{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111224-chinese-american-jewish-christmas-1.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Kosher", "keywords": ["Chinese", "hanukkah desserts", "Jewish", "red bean paste", "red beans", "rugelach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red Bean Rugelach", "link": "https://www.seriouseats.com/recipes/2011/12/red-bean-rugelach.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: Sweet red bean (adzuki) paste is widely available from either a can or in a bag, the latter in the refrigerated section of your typical Chinese grocery store. I've had much better luck with good...", "totalTime": "2 hours 30 minutes", "recipeYield": "makes approximately 4 dozen rugelach", "recipeCategory": ["Chinese", "Cookies", "Desserts", "Kosher"], "recipeIngredient": ["<strong>For The Dough: </strong>", "One (8-ounce) package cream cheese, softened by placing at room temperature for a few hours", "1 cup butter, softened by placing at room temperature for a few hours", "1/4 cup sugar", "1 teaspoon pure vanilla extract", "2 cups all purpose flour", "1/4 teaspoon salt", "&nbsp;", "<strong>For The Filling:</strong>", "1/4 cup sugar", "1/2 teaspoon ground cinnamon ", "1/2 cup sweet red bean paste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a wooden spoon, mix together the softened butter and cream cheese until well combined.  (Alternatively, you can soften the cream cheese and butter by creaming them together with the paddle attachment  of your stand mixer.) Add the flour, sugar, and salt and mix until well blended.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half. Lay down two pieces of plastic wrap at least 16 by 12 inches. Form each dough half into a 6- by 3-inch rectangular block of dough. Cover and chill in the refrigerator for at least 2 hours and up to 4 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to roll, remove the dough from the refrigerator and allow it to sit on the counter for about 30 minutes or until it is malleable enough to roll.  In the meantime, place 2 oven racks in the upper and lower thirds of the oven and preheat oven to 350°F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Fill:</strong> In a medium bowl, combine the sugar and cinnamon. Set aside. Roll out each block of dough between two sheets of parchment paper or plastic wrap into a 12- by 18-inch rectangle, about 1/4-inch thick. Place in freezer for 10 minutes until slightly firm (rugelach dough can be left in freezer for up to 2 weeks, tightly wrapped). Return to counter and remove top sheet of paper. Sprinkle half the cinnamon sugar evenly so that the surface is lightly covered. Spread half the red bean paste in a 1/2-inch wide strip across one long end of the rectangle. Carefully roll the dough up, starting at the end with the red bean paste into a large baton.  Freeze the dough again for at least 10 minutes. Cut the dough into 3/4- to 1-inch segments and freeze again for 10 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 to 20 minutes, until the bottoms are deeply browned.  Let cool and sprinkle with powdered sugar.  Leftover rugelach may be stored in an airtight container for up to 4 days.</p>"}]}