{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110412-146260-GFTues-MozzSticks.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["cheese", "gluten free", "Gluten-Free Tuesday", "mozzarella sticks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Tuesday: Mozzarella Sticks", "link": "https://www.seriouseats.com/recipes/2011/04/gluten-free-tuesday-mozzarella-sticks.html", "description": "<strong>Cheese melts. </strong> I was reminded of this when I first attempted to make gluten-free mozzarella sticks. The cheese sticks kept melting in the hot oil. Instead of crispy sticks with oozy centers, I had cheese that was a runny mess. Then I remembered a technique I hadn't used in years: double dipping during the first part of the standard breading procedure. While double dipping is never, ever welcome at parties, it's more than welcome in this recipe.", "totalTime": "20 minutes", "recipeYield": "six", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["4 ounces (1 cup) white rice flour", "1 teaspoon dried basil", "1/4 teaspoon salt", "Pinch (little less than 1/8 teaspoon) granulated garlic", "Pinch freshly ground black pepper", "2 large eggs, beaten", "5 ounces (1 cup) dried gluten-free bread crumbs", "12 pieces string cheese, cold and unwrapped ", "Vegetable Oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line up three plates on your counter. On first plate, whisk together white rice flour, granulated garlic, salt, dried basil, and freshly ground black pepper. On second plate, whisk eggs until smooth. On third plate, place bread crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut cheese sticks in half. Roll string cheese in white rice flour, coating well. You don’t want any bare spots on the cheese stick. Take care to coat ends of cheese stick with flour. This prevents stick from “leaking” during frying.<br />\n </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll cheese stick in egg, coating thoroughly. Return cheese stick to white rice flour and coat again. Return again to egg and coat thoroughly. Finally, roll coated sticks in bread crumbs. Place coated stick on a baking pan or large dish. Repeat until all sticks are coated. Chill cheese sticks for five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/2-inch of oil in an 8-inch frying pan. Sprinkle a little white rice flour on the surface of the oil. If flour sizzles, oil is ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove cheese sticks from refrigerator. Place six cheese sticks into the pan. Fry for 30 seconds. Using a heat-proof spatula, roll sticks in oil to turn. Fry an additional 30 seconds or until the sticks are golden brown. If any cheese begins to leak, remove sticks from oil.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with remaining cheese sticks. Serve with sauce and enjoy! </p>"}]}