{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110209-136751-french-lentils-sausage-arugula.JPG", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "French", "keywords": ["arugula", "beans", "cloves", "French", "french lentils", "lentils", "sausage", "Spice Hunting"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French Lentils with Sausage, Wilted Arugula, &amp; Dijon Mustard", "link": "https://www.seriouseats.com/recipes/2011/02/french-lentils-with-sausage-wilted-arugula-and-dijon-mustard-recipe.html", "description": "If I had one week left to live, I'd have to devote a meal to a plate of French lentils. They have a flavor and bite lacking in the common supermarket variety, which too often melts into starchy mush. Not that this dish is much of a looker: It's olive drab lentils with brown sausage. The arugula, which you'd hope would add color, wilts down to puny green strands that snake through the bowl. But what it lacks in aesthetics it makes up for in flavor, which packs a wallop. Cloves add sweet and spicy balance to the peppery arugula and mustard. Their flavor is there but not overwhelmingly so, exactly where it should be.", "totalTime": "1 hour", "recipeYield": "8", "recipeCategory": ["Beans and Pulses", "French", "Leafy Greens", "Mains", "Pork", "Sides"], "recipeIngredient": ["1 tablespoon oil", "1 pound sausage (see note), sliced or crumbled", "1 large onion", "10 whole cloves", "1 pound (2 1/4 cups) <em>Puy</em> (French) lentils, rinsed", "3 bay leaves", "2 tablespoons dijon mustard", "4 ounces arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large, straight-sided pan that has a lid until oil shimmers, then add sausage. Stir sausage to brown for several minutes, cooking until fat has rendered out and sausage is very crispy. Reduce heat if sausage looks like it will burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While sausage is browning, trim 1/8 to 1/4 inch from the root and blossom ends of onion (leaving enough so onion leaves will stay intact), then slice in half. Remove skin and stud onion with cloves. Add to pan with lentils, bay leaves, and 4 1/2 cups water. Bring mixture to a boil, then reduce to a simmer and cover. Cook until lentils are tender but still have a bite, about 45 minutes. After half an hour of cooking, add a pinch of salt to season lentils (reserving some to add at end).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When lentils are done, turn off heat and fold in mustard and arugula until arugula just wilts. Salt to taste and serve.</p>"}]}