{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111015pbj.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate", "custard", "jelly", "PBJ", "peanut butter", "pot de creme", "red wine", "syrup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peanut Butter Pot de Crème with Red Wine Suicide", "link": "https://www.seriouseats.com/recipes/2011/10/peanut-butter-pot-de-creme-with-red-wine-syrup-recipe.html", "description": "The red wine \"suicide\" is a really great way to use up a splash of this and a splash of that after a dinner party, but by no means do you have to use an assortment of wine. I've made this before using Grenache and Zinfandel, and both worked splendidly.", "totalTime": "1 hour", "recipeYield": "Six 5 ounce portions", "recipeCategory": ["Desserts", "Nuts", "Puddings and Custards"], "recipeIngredient": ["8 ounces milk", "8 ounces heavy cream", "6 ounces creamy peanut butter (commercial or natural both work fine)", "1/3 ounce dark chocolate", "4 ounces egg yolks (from 8 to 12 eggs)", "4 ounces sugar", "1 ounce honey", "1/2 tsp salt", "1 1/2 teaspoons vanilla extract", "&nbsp;", "<strong>Red Wine \"Suicide\"</strong>", "7 ounces red wine, from a variety of wines if possible", "3 1/2 ounces sugar", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the water bath: </strong> Preheat the oven to 300&deg; F and take a second to prepare the water bath: set a large pot of water on the stove to boil. When it comes to a boil, shut off the heat and let it sit until needed. </p>\n\n<p>Arrange 6 large ramekins (6 ounce size) in a baking dish with tall sides. I use a 9x13\" brownie pan. Set aside. Also have a large piece of foil standing by.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the peanut butter custard:</strong> In a medium pot, combine the milk, cream, peanut butter, and chocolate. Turn the heat to medium and whisk periodically until hot and both peanut butter and chocolate have completely melted into the dairy. </p>\n\n<p>Meanwhile, combine egg yolks, sugar, honey, and salt in a large bowl, whisking to combine. When the peanut butter mixture begins to steam and perhaps bubble, whisk a ladleful into the eggs. Temper in another two ladles of the hot milk, whisking all the while.</p>\n\n<p>Whisk warm egg mixture into the pot of milk/cream. Turn heat to medium low and cook, using a heat resistant rubber spatula to stir constantly, until the mixture registers 140&deg; on a candy thermometer. (Or, until hot to the touch, if you lack a thermometer.) </p>\n\n<p>Strain through a sieve suspended over a medium bowl. Portion the mixture evenly between the ramekins (about 5 ounces each) then place them in the pan. Fill the pan about 3/4 full with the prepared hot water. Cover the whole thing over with foil and very carefully transfer to the preheated oven.</p>\n\n<p>Bake between 30 and 45 minutes, or until the custards have a gentle set. If they appear liquid when giggled, continue baking. The custards will have a slight, Jello-like wiggle when they've cooked enough, and a skin that will not stick to your finger when lightly touched.</p>\n\n<p>Sometimes, based on hot spots in your oven, custards need to be rescued on a case by case basis; don't hesitate to remove ones that seem done, while letting others continue to bake.</p>\n\n<p>Once baked, let them cool to room temperature. Wrap in plastic and refrigerate about four hours before consuming. </p>\n\n<p>The custards have a terrific shelf life and will keep, covered and refrigerated, for about week. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Red Wine Suicide:</strong> In a small sauce pot, bring the red wine to a simmer on medium heat. Turn the heat to medium low and continue to simmer gently until the red wine has reduced by half, about ten minutes. Then add the sugar and salt and simmer another 5 minutes, stirring occasionally with a rubber spatula, until the sugar has fully dissolved.</p>\n\n<p>Cool the syrup to room temperature and store, refrigerated. Serve with peanut butter pot de crème and <br />\n<a href=\"http://bravetart.com/recipes/ShortBREAD\">shortbread cookies</a>, if you like. </p>"}]}