{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110221-127355-dinner-tonight-chicken-paprikash.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Amanda Hesser", "chicken", "Dinner Tonight", "paprika"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Dinner Tonight: Chicken Paprikash", "link": "https://www.seriouseats.com/recipes/2011/02/chicken-paprikash-recipe.html", "description": "This recipe from Amanda Hesser's <em><a href=\"http://www.amazon.com/dp/0393061035/?tag=serieats-20\">The Essential New York Times Cookbook</a></em>, is straightforward. The chicken pieces are sauteed in butter then cooked with a bit of chicken stock. Only at the very end is the sour cream added. With so few ingredients, the quality of the paprika is paramount. You can use a standard paprika, but I took the Hesser's advice and went with a smoked sweet paprika.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["one 3-pound chicken, cut into serving pieces", "salt and black pepper", "3 tablespoons unsalted butter", "1 cup thinly sliced onions (from about ½ medium onion)", "1 tablespoon minced garlic (from about two garlic cloves)", "1 tablespoon smoked sweet paprika (or regular paprika, smoked hot paprika)", "½ cup chicken broth ", "1 cup sour cream", "1 tablespoon all-purpose flour ", "1 pound egg noodles "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, season the chicken pieces with salt and pepper. Add two tablespoons of the butter to a heavy-bottomed 12-inch stainless steel sauté pan with lid set over medium-high heat. When butter begins to foam, add chicken pieces skin side down. Cook until well browned, about 5 minutes. Flip pieces and cook until well browned on the other side, about five more minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions and garlic to skillet. Stir well, and cook until garlic is fragrant, about 30 seconds. Sprinkle in paprika, and stir again. Pour in broth, bring to a boil, then reduce heat to medium, cover pan, and simmer until the chicken breasts are cooked, about ten minutes. Remove breasts and set aside. Leave chicken legs to cook until done, about five minutes. Set those aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off any excess fat. Mix flour and sour cream together in a medium-sized bowl. Add this to pan and stir well. Simmer for about one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook egg noodles in pot of boiling water, according to the directions on box. Drain, and then toss with one tablespoon of butter in a bowl. Divide noodles between four plates. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a chicken piece on top of noodles, and ladle sauce on top. Serve with more salt and pepper to taste. </p>"}]}