{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110314-142108-pork-and-liver-pate.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["At Elizabeth David's Table", "brandy", "charcuterie", "Cook the Book", "Elizabeth David", "juniper berries", "liver", "pâté", "pork", "veal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork and Liver Pâté", "link": "https://www.seriouseats.com/recipes/2011/03/pork-and-liver-pate-recipe.html", "description": "Making this pâté at home, it was a struggle to wait until it had cooled with all those heady, meaty aromas and the lovely layer of bacon on top.  Slicing into it, the texture was rustically grainy with an over-the-top porky flavor. It's fatty enough to easily spread on toast.  Juniper and brandy come through in a big herbal way.  Sliced thin and served alongside crusty bread with a bit of mustard and cornichons (and of course, a glass of wine) this pâté is probably the most authentically French dish to come out of my kitchen.", "totalTime": "", "recipeYield": "8 to 10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "Cook the Book", "Offal", "Pork"], "recipeIngredient": ["1 pound pork belly (without rind), ground ", "1pound lean veal, ground", "1/2 pound pig’s liver, ground", "4 ounces sliced bacon or pork back fat", "1 clove of garlic, crushed", "6 black peppercorns, crushed", "6 juniper berries, crushed ", "1 to 2  teaspoon salt", "1/4 teaspoon ground mace", "3 to 4 tablespoons dry white wine", "2 tablespoons brandy"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To the ground meats, all thoroughly blended, add 2 ounes of the bacon or pork fat cut in thin, irregular little dice, the garlic and seasonings, and the wine and brandy. mix very thoroughly and, if there is time, leave to stand for an hour or two before cooking, so that the flavors penetrate the meat. turn into one large 4-cup capacity terrine, or into 2 or 3 smaller ones, 2 1/2 inches deep. Cut the remaining fat or bacon into thin strips and arrange it across the top of the pâté. Place the terrines in a baking pan half-filled with water and cook, uncovered, in a slow oven, 325°F, for 1 1/4 to 1 1/2 hours. the pâtés are cooked when they begin to come away from the sides of the dish. Take them from the oven, being careful not to spill any of the fat, and leave them to cool. They will cut better if, when the fat has all but set, they are weighted. to do this, cover with parchment paper and a board or plate which fits inside the terrine and put a weight on top. however, if this proves impractical, it is not of very great importance. if the terrines are to be kept longer than a week, cover them completely, once they are cold, with a sealing layer of just-melted pure pork lard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong> When cooking any pâté remember that it is the depth of the terrine rather than its surface area which determines the cooking time. the seasonings of garlic and juniper berries are optional.  The proportions of meat, liver and seasonings making up a pâté can be altered to suit individual tastes, but always with due regard to the finished texture of the product. a good pâté is moist and fat without being greasy, and it should be faintly pink inside, not grey or brown. a dry pâté is either the result of overcooking, or of too small a proportion of fat meat having been used.</small></p>"}]}