{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/682011-155747-eggy-bread.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Eggy Bread", "link": "https://www.seriouseats.com/recipes/2011/06/eggy-bread-recipe-brunch-savory-french-toast.html", "description": "It may be hard for some people to fathom, but there are some of us out there who simply do not like sweet things for brunch.  And for those of us who need salt first thing in the morning, a big plate of eggy bread and some bacon can be just the trick.  Eggy bread is a simple savory French toast that can be served with bacon, fresh veggies or any other savory topping or side you can think of. (I recommend ketchup.)", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Bread", "Breakfast and Brunch", "Eggs"], "recipeIngredient": ["8 pieces of bread", "4 eggs", "4 tablespoons milk", "Kosher salt and cracked black pepper", "1-2 tablespoons butter", "bacon (optional)", "sliced scallions (optional)", "chopped tomatoes (optional)", "Ketchup (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut crusts off of pieces of bread.  Beat eggs and combine with milk in a dish large enough to hold all the slices of bread side by side.  Season with salt and pepper.  Place sliced bread in egg mixture and turn to coat; let sit for at least 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat frying pan or griddle over medium high heat.  Add a tablespoon of butter to the pan and allow to melt, then add egg-soaked bread in an even layer.  You may need to cook the bread in more than one batch depending on the size of your pan.  Cook for 1 minute, or until golden brown; then flip and cook other side and cook until done.  Serve with any savory garnish you can think of and a big pot of tea.</p>"}]}