{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110825-dt-brown-rice-with-summer-squash-favas-and-mint.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "rice", "risotto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Brown Risotto with Summer Squash, Favas, and Mint", "link": "https://www.seriouseats.com/recipes/2011/08/dinner-tonight-brown-risotto-with-summer-squash-favas-and-mint-recipe.html", "description": "Nigel Slater's brown rice risotto&mdash;cooked with a short-grain brown rice, which is essential to giving it its starchy, creamy consistency&mdash;is slightly chewier and nuttier than a traditional risotto, but lightened up with vegetal shredded summer squash and a punch of mint leaves added in at the last moment. If you can find short-grain brown rice, give this one a try.", "totalTime": "55 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Rice", "Vegetarian"], "recipeIngredient": ["1 pound zucchini or summer squash", "Salt", "1/4 pound unsalted butter", "3 shallots or 1 large onion, finely chopped", "1 pound fava bean pods, beans removed from pods", "1 pound short-grain brown rice", "1 cup white wine", "2 quarts vegetable stock", "1/2 cup grated Parmesan", "1/4 cup chopped mint leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the root end of the zucchini or squash and grate on the large holes of a box grater. Sprinkle with a couple pinches of salt, toss well, and allow to drain in a colander in the sink while preparing the rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy pot, heat 3 tablespoons of the butter over medium heat until the foam subsides. Add the shallot or onion and cook, stirring often, until soft but not browned. In the meantime, bring the vegetable stock to boil in a separate pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice to the shallots, stirring well to coat in the butter, and cook until the rice begins to look translucent, about two minutes. Pour in the wine all at once and turn the heat to high. Cook, stirring often, until the liquid is absorbed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a few ladles of the vegetable stock and cook, stirring often, until absorbed. Add all the remaining vegetables stock, cover the pot, and cook until all the stock is absorbed, 45-50 minutes. Every 5 minutes or so, stir well to prevent the rice sticking to the bottom. If the stock is absorbed and the rice is not yet tender, add boiling water as needed until it's no longer hard in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the rice cooks, bring a pot of salted water to boil and cook the fava beans for 5 minutes. Drain, transfer to a bowl of ice water to cool, then slip them out of their skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rice is nearly done, squeeze out the water from the shredded zucchini or squash and stir into the rice. Once the rice is cooked, stir in the fava beans, Parmesan, and remaining butter. Add a little water, if necessary, to give the rice a loose consistency. Stir in the chopped mint, season with black pepper and salt (if necessary) and serve.</p>"}]}