{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/loaf.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Italian-Style Bread with White Whole Wheat", "link": "https://www.seriouseats.com/recipes/2011/06/bread-baking-italian-style-bread-with-white-whole-wheat-recipe.html", "description": "When I was a kid, bread fell into several categories. First, and most common, was plastic-bagged grocery store bread. Second was paper-wrapped skinny loaves of French bread. Third was paper-wrapped fatter loaves of Italian bread. And last, bakery bread, which meant there was a special event of some kind.", "totalTime": "3 hours", "recipeYield": "1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "1 tablespoon sugar", "2 1/4 teaspoons instant yeast", "1/2 cup semolina flour", "2 1/4 ounces (1/2 cup) white whole wheat flour", "6 3/4 ounces (about 1 1/4 cups) bread flour", "1 teaspoon salt", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the water, sugar, yeast, semolina, and white whole wheat flour in the bowl of your stand mixer. Stir to combine and set aside for 20 minutes. It will be very foamy. Add the bread flour and knead with the dough hook until the dough is smooth and elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter and salt and continue kneading until both are fully incorporated. Form the loaf into a ball, drizzle with a bit of olive oil, and return it to the bowl. Cover the bowl and set aside until the dough has doubled in size, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and line a baking sheet with parchment paper. When the dough has doubled, remove it from the bowl and gently form it into a log about 10 inches long. Place it on the prepared pan, seam-side down. Cover with plastic wrap and set aside until doubled, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make 3 diagonal slashes on top of the loaf and bake at 350 degrees until golden brown, about 35 minutes. Let the loaf cool completely on a rack before slicing.</p>"}]}