{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/soft%20focaccia.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "focaccia"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Soft, Cheesy 'Focaccia'", "link": "https://www.seriouseats.com/recipes/2011/11/bread-baking-soft-focaccia.html", "description": "Softer and fluffier than focaccia or pizza, think of this as a flat loaf of very flavorful bread topped with gooey cheese. If you want it a little crisper, just bake it longer. And here's a bonus: you can make it well ahead of time, then reheat it in the oven so you've got warm bread with melty cheese whenever you need to serve it.", "totalTime": "2 hours, 50 minutes (plus overnight rise)", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 teaspoon instant yeast", "1 tablespoon sugar", "1 tablespoon mixed Italian herbs", "1 tablespoon tomato paste", "3 cups (13 1/2 ounces) all purpose flour", "1 1/2 teaspoons salt", "2 tablespoons olive oil (plus more for drizzling)", "1 1/4 cups water", "4 ounces cheese (your choice of type) thinly slices or shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all ingredients (except the cheese) and knead (using your favorite method) until well combined and gluten is starting to develop. Drizzle a zip-top bag with a little bit of olive oil, transfer the dough to the bag, and close the bag. Refrigerate over night.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove the dough from the refrigerator and let it warm up on the counter for an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F and flour your work surface. Turn out the dough and knead it briefly, then stretch and cajole it to fit a baking sheet. Cover it with plastic wrap or use another baking sheet of the same size as a \"lid\" for te pan. Set aside to rise until it feels soft and puffy - about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the bread with the cheese and bake at 400°F until the bread is browned and the cheese is melted, about 25 minutes. Check the underside of the bread to make sure it's browned and as crisp as you like it. Remove the bread from the pan as soon as you can handle it and place it on a rack so the bottom doesn't get soggy as it cools.</p>"}]}