{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110727-in-n-out-telway-white-manna-sliders-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "sandwich", "sliders", "The Burger Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The In-N-Out/Telway/White Manna Ultimate Animal-Style Slider Mashup", "link": "https://www.seriouseats.com/recipes/2011/07/the-in-n-out-telway-white-manna-ultimate-animal-style-slider-mashup-recipe.html", "description": "For best result, use freshly ground beef with at least 80 percent fat. Try <a href=\"http://www.seriouseats.com/recipes/2009/10/the-blue-label-burger-blend-recipe.html\">this recipe</a> for our Blue Label Burger Blend. Sliders can be cooked in a 12-inch cast iron or stainless steel skillet in batches of six if you don't have an electric griddle.", "totalTime": "30 minutes", "recipeYield": "Makes twelve 2-ounce sliders", "recipeCategory": ["Beef", "Burger", "Sandwiches", "The Burger Lab"], "recipeIngredient": ["6 tablespoons mayonnaise ", "2 tablespoon ketchup ", "4 teaspoons sweet pickle relish ", "1 teaspoon sugar ", "1 teaspoon distilled white vinegar ", "2 tablespoons finely chopped kosher dill pickles, with 1 teaspoon pickle juice", "Kosher salt and freshly ground black pepper", "About 3 tablespoons yellow mustard", "24-ounces freshly ground beef (see note), divided into twelve 2-ounce pucks", "1 large onion, sliced paper thin on a mandoline (about 1 1/2 cups total)", "6 slices American cheese, cut in half", "12 Slider Rolls (preferably Martin's brand Sliced Sandwich Rolls)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine mayonnaise, ketchup, relish, sugar, white vinegar, pickles, and pickle juice in a food processor. Process until almost smooth. Season to taste with plenty of black pepper and a little salt (depending on how salty your pickles were, you may not need any extra salt). Set spread aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat an electric griddle to 400°F. Squirt twelve dots of mustard of about 3/4-teaspoons each in an evenly spaced grid over the surface of the griddle, leaving about 3-inches between each dot. Place one ball of meat on top of each dollop. Season generously with salt and pepper, then smash down with a stiff spatula into patties approximately 1/4-inch thick and 3-inches wide. Spread onions evenly over surface of burger patties and press down with spatula. Allow to cook for 1 minute on first side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip patties so that onions are underneath (patties will not necessarily be colored&mdash;this is ok; the flavor in sliders comes from steam, not from browning). Top each patty with a half slice of American cheese. Place top buns cut-side-down on top of patties and top with bottom buns, also cut-side-down. Drape a towel over the whole griddle to trap steam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, pressing gently down on towel occasionally until buns are heated completely through and burger patties are cooked, about 2 minutes. Remove towel and transfer bottom buns to a serving platter. Divide spread evenly between bottom buns. Top each bottom bun with a burger patty and top bun, making sure to get all of the onions off of the griddle. Serve immediately.</p>"}]}