{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011131-135446-turkey-poblano-chili.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["beans", "chili", "Sunday Supper", "Turkey Chili"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Turkey and Roasted Poblano Chili", "link": "https://www.seriouseats.com/recipes/2011/02/turkey-and-roasted-poblano-chili.html", "description": "<strong>This chili uses braised turkey thighs</strong> as the protein, and roasted poblano peppers to add some smoky flavor.  When picking out a chili powder, try to find one that lists the various chilis in the ingredient list; all chili powders are different, so it may take some time to find the best brand for your needs.  This chili, as with most chilis, really benefits from a night in the fridge. Serve this chili with lots of cornbread and beer.", "totalTime": "2 hours", "recipeYield": "4-8, depending on hunger level", "recipeCategory": ["Chicken", "Chili", "Mains", "Sunday Supper"], "recipeIngredient": ["2 1/2 pounds turkey thighs (about 2 pieces)", "3/4 teaspoon ground cumin", "2 small onions, chopped", "4 cloves garlic, chopped", "1 1/2 cups (12 ounces) Chicken stock", "1 cup dried navy beans", "2 cloves garlic, crushed", "1 poblano pepper", "1 (28-ounce) can diced tomatoes", "1 tablespoon chili powder", "1/2 teaspoon smoked paprika", "Kosher salt and cracked black pepper", "Bunch of scallions thinly sliced, optional", "Sour cream, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325&deg;. Remove skin from turkey thighs and sprinkle meat with cumin.  Heat large braising dish over medium high heat and drizzle with olive oil.  Once oil is shimmering add thighs and sear until golden brown, about 5-8 minutes per side.  Remove thighs from braising dish and reserve.  Place braising dish back on heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chopped onions and garlic to pan, scraping browned bits off of bottom of pan until onions are soft, about 6 minutes.  Add thighs back to pan and cover with chicken stock.  Bring to a simmer on the stove, then cover and place in oven until turkey thighs are fully cooked, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine dried navy beans, 2 cups water, crushed garlic cloves and a pinch of black pepper in small pot on the stove and bring to a simmer.  Cook until beans are tender, about 40 minutes, adding more water as necessary.  Drain beans and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse poblano pepper and place directly on burner (if you have a gas stove) or under broiler until skin is charred and black.  Place charred pepper into bowl and cover tightly with plastic wrap.  Once cool enough to handle carefully remove charred skin from pepper and dice into small pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once turkey thighs are cooked remove from braising liquid.  Allow thighs to cool and add cooked beans, can of tomatoes, chili powder and paprika to braising dish.  Bring to gentle simmer.  Carefully remove meat from turkey thighs and tear or chop into bite sized pieces, add cooked meat to simmering chili.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste for seasoning and adjust with salt and pepper.  Serve hot with a few thinly sliced scallions and a dollop of sour cream.</p>"}]}