{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/IMG_4511.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barley", "beef", "kale", "soup", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Short Rib and Barley Stew", "link": "https://www.seriouseats.com/recipes/2011/01/short-rib-and-barley-stew.html", "description": "<strong>Short rib and barley stew is fantastic because it:\n</strong>a) is dumb easy to do\nb) is made with pantry and fridge staples (aside from the short rib)\nc) lasts for days and gets better with time\nd) soothes the soul or warms the cockles of your heart, or if you're really lucky, both at the same time, and\ne) tastes really, really good.", "totalTime": "2 1/2 hours", "recipeYield": "6 to 8", "recipeCategory": ["Beef", "Kale", "Soups and Stews"], "recipeIngredient": ["2 pounds boneless beef short ribs, cut into 1-inch chunks", "Kosher salt and freshly ground black pepper", "2 tablespoons canola oil", "2 medium carrots, split in half and sliced into 1/2-inch chunks (about 1 cup)", "2 medium ribs celery, split in half and sliced into 1/2-inch chunks (about 1 cup)", "1 large onion, finely diced (about 1 1/2 cups total)", "1/2 teaspoon marmite", "1 teaspoon soy sauce", "2 medium cloves garlic, grated on a microplane grater (about 2 teaspoons)", "1 tablespoon tomato paste", "1 quart low-sodium chicken broth (preferably homemade)", "1 (14.4) ounce can whole peeled tomatoes, drained and roughly chopped", "1 cup pearl barley", "2 bay leaves", "4 cups loosely packed kale leaves, roughly torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season short ribs with salt and pepper and toss in a large bowl to coat. Heat the oil in a Dutch oven or large saucepan over high heat until smoking. Add the beef and cook without moving until well-browned on first side, about 5 minutes. Stir beef and continue cooking, stirring occasionally until browned all over, about 10 minutes total, reducing heat if bottom of pan begins to burn. Return meat to bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pan to medium-high heat and add carrots, celery, and onion. Cook, stirring frequently until vegetables begin to brown, about 4 minutes total. Add marmite, soy sace, garlic, and tomato paste and cook, stirring constantly, until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add broth and scrape up browned bits from bottom of pan with wooden spoon. Add tomatoes, barley, and bay leaves. Return beef to pot. Increase heat to high and bring to a boil. Reduce to lowest possible heat and place cover on pot, leaving lid slightly ajar. Cook, stirring occasionally until beef is completely tender and barley is cooked through, about 2 hours. Stir in kale leaves and cook, stirring constantly until wilted, about 2 minutes. Season to taste with salt and pepper. Serve immediately, or for best flavor, chill and refrigerate in a sealed container for up to 5 days.</p>"}]}