{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110209-pizza-lab-calzone%20-%2017%20-%20large.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["calzone", "Italian", "Pizza Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spinach, Provolone, and Pepperoni Calzone", "link": "https://www.seriouseats.com/recipes/2011/02/spinach-provolone-and-pepperoni-calzone.html", "description": "In last week's <a href=\"http://slice.seriouseats.com/archives/2011/02/which-oven-rack-should-i-put-my-pizza-stone-on.html\">Pizza Lab</a>, I promised a calzone recipe. Well, here it is!", "totalTime": "", "recipeYield": "3-4 (makes 2 large calzones)", "recipeCategory": ["Italian", "Pizza", "The Pizza Lab"], "recipeIngredient": ["11 ounces (about 2 cups) bread flour, plus more for dusting surfaces", "2 teaspoons sugar", ".15 ounces salt (about 1 1/2 teaspoons)", "1 teaspoon instant yeast", "4 tablespoons extra-virgin olive oil", "6 1/2 ounces (1 cup minus 3 tablespoons) lukewarm water", "1 (6-ounce) bag baby spinach", "8 ounces provolone cheese, cut into small cubes", "4 ounces pepperoni or sopressata slices, cut into 1-inch by 1/2-inch pieces", "2 ounces parmesan cheese, finely grated", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>\u2028\u2028Combine flour, sugar, salt, and yeast in bowl of food processor. Pulse 3 to 4 times until incorporated. Add 1 1/2 tablespoons olive oil and water. Run food processor until mixture forms ball that rides around the bowl above the blade, about 15 seconds. Continue processing 15 seconds longer.\u2028\u2028<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough ball to lightly floured surface and knead once or twice by hand until smooth ball is formed. Divide dough into 2 even parts and place each in a covered quart-sized deli container or in a zipper-lock freezer bag. Place in refrigerator and allow to rise at least one day, and up to 5.\u2028\u2028<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>\u2028\u2028At least two hours before baking, remove dough from refrigerator and shape into balls by gathering dough towards bottom and pinching shut. Flour well and place each one in a separate medium mixing bowl. Cover tightly with plastic wrap and allow to rise at warm room temperature until roughly doubled in volume.\u2028\u2028<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place spinach in microwave-safe bowl and cover with large plate. Microwave on high heat until wilted, about 1 minute. Transfer spinach to a triple layer of paper towels and roll tightly. Press to remove excess moisture. Roughly chop spinach and transfer back to bowl. Add provolone, pepperoni, parmesan, and remaining olive oil. Season to taste with salt and pepper and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>\u2028\u20281 hour before baking, adjust oven rack with pizza stone to upper-middle position and preheat oven to 500°F. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, turn single dough ball out onto lightly flour surface. Gently flatten ball with fingers. Using a flour rolling pin, roll into a circle 10 to 12 inches in diameter. Repeat with remaining dough ball. Working quickly, divide between dough discs, spreading it over half of each one. Fold the dough over and fold and crease the edges to seal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully transfer to floured wooden pizza peel and slide onto stone. Bake until deep golden brown and crisp, about 15 minutes. Remove from oven and let rest 5 minutes before serving.</p>"}]}