{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111220-184589-chocolate-glazed-hazelnut-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chocolate", "Cookies", "hazelnuts", "holiday cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fine Cooking's Chocolate-Glazed Chocolate-Hazelnut Cookies", "link": "https://www.seriouseats.com/recipes/2011/12/fine-cookings-chocolate-glazed-chocolate-hazelnut-cookie-recipe.html", "description": "If Nutella is the way to your heart, these Chocolate-Glazed Chocolate-Hazelnut Cookies are going to be the highlight of your holiday cookie baking season.", "totalTime": "1 hour 45 minutes", "recipeYield": "makes 6 to 7 dozen 2 3/4- to 3-inch cookies", "recipeCategory": ["Chocolate", "Cookies", "Desserts", "Nuts"], "recipeIngredient": ["<strong>For the cookies:</strong>", "5 ounces (1 cup) whole hazelnuts, toasted ", "1 1/2 teaspoons instant espresso powder", "3 ounces bittersweet or semisweet chocolate (not unsweetened), broken up or coarsely chopped", "5 1/3 ounces (2/3 cup) unsalted butter, slightly softened", "3/4 cup granulated sugar ", "1 1/8 ounces (1/3 cup) unsweetened Dutch-processed cocoa powder", "1 large egg ", "1 1/2 teaspoons pure vanilla extract", "1/4 teaspoons table salt ", "8 1/4 ounces (1 3/4 cups) unbleached all-purpose flour", "Butter or nonstick spray for the baking sheets", "&nbsp;", "<strong>For the glaze:</strong>", "16 ounces bittersweet or semisweet chocolate (not unsweetened), broken up or coarsely chopped", "1 tablspoon corn oil or other flavorless vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the cookies:</strong> In a food processor, process the hazelnuts and espresso powder until they’re ground to the consistency of a nut butter, 2 to 3 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the chocolate in a microwave or on the stove. Set aside to cool\u2028until warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat the butter, sugar, cocoa powder, and hazelnut mixture with a stand mixer (use the paddle attachment) or a hand-held mixer on medium speed until very well blended and fluffy, 1 1/2 to 2 minutes; scrape the bowl as needed. Add the egg, vanilla, and salt; beat until completely blended and smooth, about 1 1/2 minutes. On low speed, mix in half of the flour and then the melted chocolate just until evenly incorporated. Mix or stir in by hand the remaining flour until evenly incorporated. Set aside for 10 minutes; the dough will firm up slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough into thirds. Set each third between sheets of parchment or waxed paper. Roll out each portion to 1/8 inch thick; check the underside and smooth any wrinkles. Stack the rolled pieces (paper still attached) on a tray. Refrigerate until firm, about 45 minutes, or for several hours (or freeze for about 20 minutes to speed chilling).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and heat the oven to 350&deg;F. Butter several large baking sheets or coat with nonstick spray. Working with one piece of dough at a time and keeping the remainder chilled, gently peel away and then replace the top sheet of paper. Flip the dough over. Peel off and discard the second sheet of paper. Cut out the cookies using a 2 1/2 - to 2 3/4-inch fluted round, oval, or other cutter. (If the dough softens too much to handle easily, transfer the paper and cookies to a tray and refrigerate until firm again.) Using a spatula, carefully transfer the cookies to the baking sheets, arranging them about 11/2 inches apart. Reroll the dough scraps. Continue cutting out the cookies until all dough is used; refrigerate as necessary if it becomes too soft to handle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies one sheet at a time (keep the rest refrigerated) until they feel dry and almost firm when pressed in the center, 7 to 10 minutes. Let cool on the sheets for 3 or 4 minutes before transferring to racks to cool completely. Prepare the cookies for glazing by freezing them for at least 20 minutes or up to several hours. (You can also freeze the cookies at this point, tightly wrapped, for up to 2 months.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the glaze:</strong> Line several small trays or baking sheets with aluminum foil. Combine the chocolate and oil in a medium metal bowl. Set the bowl over a saucepan containing about an inch of barely simmer-ing water and stir with a spatula until melted. Turn off the burner under the saucepan but leave the bowl over the hot water to keep the chocolate warm; stir the chocolate occasionally. (Replace the water in the pan with hot water as it cools off during the dipping process, but be careful not to splash water into the chocolate.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with only about five or six cookies at a time (keep the remainder frozen), glaze them by dipping in the chocolate glaze as directed below. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the bowl tipped so that the chocolate pools on one side, hold a cookie vertically and dip until half is submerged in the chocolate. Lift the cookie out and shake off excess chocolate. Gently scrape the bottom of the cookie against the side of the bowl to remove excess chocolate from the bottom surface. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the dipped cookies on the foil-lined sheets, spacing them slightly apart. When a pan is full, refrigerate it for 30 minutes so the chocolate can firm up. Then peel the cookies from the foil, pack them in airtight containers, and return them to the refrigerator.<br />\n</p>"}]}