{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110113VanillaCreamFish.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["fish", "seafood", "The Secret Ingredient", "tilapia", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Vanilla): Almond-Crusted Tilapia with Vanilla Sauce", "link": "https://www.seriouseats.com/recipes/2011/01/the-secret-ingredient-vanilla-almond-crusted.html", "description": "Vanilla, for being so common and ubiquitous, has a very exotic history.  This dish is a bit exotic itself, even though I had a version of it at the now defunct Hoot, Toot, and Whistle in Delray Beach, Florida.  I crust tilapia with almonds and panko, and fry it until golden and crisp, and serve it with a mild and creamy vanilla beurre blanc.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Fish", "Mains", "The Secret Ingredient"], "recipeIngredient": ["2 shallots, chopped", "2 tablespoons white wine vinegar", "2/3 cup dry white wine", "1 vanilla bean", "1/4 cup heavy cream", "2 sticks unsalted butter, cubed and very cold", "Fine sea salt", "Freshly cracked black pepper", "4 6-ounce boneless and skinless tilapia fillets", "1 cup all-purpose flour", "2 eggs, beaten with 2 tablespoons water", "2 cups panko", "1 cup slivered almonds, finely chopped", "Vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin making the beurre blanc.  Put the shallots, vinegar, and wine in a medium saucepot.  Split the vanilla bean, and scrape out the seeds.  Add the seeds and the pod to the pot, and cook over medium heat until there is barely any liquid left in the pot.  Whisk in the cream, and over low heat, add in the cold, cubed butter, a little bit at a time, whisking constantly until the sauce is thick and emulsified.  Take off the heat, and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bread and fry the fish.  Mix together the panko and almonds.  Season with fish with salt and pepper, then dredge in flour.  Dip in the egg wash, and crust in the panko-almond mixture.  Heat about 1/4 cup vegetable oil in a wide skillet over medium heat until the oil shimmer.  Fry the fish in 2 batches for about 2 to 3 minutes per side, using a slotted fish spatula to turn over the fish.  Allow the fish to drain on paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the beurre blanc, and serve it immediately alongside the hot fish.</p>"}]}