{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110603-seriously-asian-green-papaya-salad-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Thai", "keywords": ["green papaya", "salad", "Seriously Asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Green Papaya Salad", "link": "https://www.seriouseats.com/recipes/2011/06/green-papaya-salad-recipe.html", "description": "Green papaya, which can also be pickled or added to soups, is commonly used for salads in Vietnam and Thailand. Dressed in fish sauce, lime, and chilies, the shreds of papaya are sweet and refreshing. The salad can be as simple or complex as you choose&mdash;for a vegetarian salad, stick with other vegetables that also benefit from being dressed in lime and fish sauce, such as carrots, daikon, and cucumbers. Parboiled shrimp and squid are fine additions. Another Vietnamese favorite uses shreds of Asian beef jerky, which softens as it soaks up some of the lime and chili dressing.", "totalTime": "45 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["No-Cook", "Salads", "Thai"], "recipeIngredient": ["1 green papaya, about 2 pounds", "1 large carrot", "3 tablespoons finely chopped cilantro", " ", "<strong>For the dressing:</strong>", "1/4 cup fresh lime juice (about 2 limes)", "3 tablespoons fish sauce", "2 tablespoons sugar", "1 clove garlic, grated with a microplane grater or finely minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dressing: combine all the ingredients and set aside to let the sugar dissolve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the papaya with a vegetable peeler or sharp knife. Halve the papaya lengthwise. With a spoon, scoop out the seeds and discard. Use a Benriner slicer or a sharp knife to julienne the papaya. Alternatively, run chunks of the papaya through the largest setting on your food processor for shorter, fine slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the carrots to the same width and length as the papaya and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the shredded papaya in a colander and add the sugar and salt. Use your hands to massage the salt and sugar into the papaya. After a minute, the papaya will become slightly slimy. The shreds should still be somewhat firm.  Rinse the papaya under cold running water and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a clean towel, wring out the papaya for excess moisture, working in batches. Transfer the papaya to a large bowl and fluff out the slices. The papaya can be prepared in this manner up to a day in advance.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shreds of carrot to the bowl with the papaya. Add the dressing spoonful by spoonful and toss until you have a balance of flavor that you like, adjusting for the sourness or saltiness as needed.  Serve immediately.  </p>"}]}