{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110324-143219-pistachio-millionaire-shortbread-butterscotch.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["Cookies", "coriander", "desserts", "holiday cookies", "millionaire's shortbread", "pistachios", "sauces", "SE Cookie Swap 2011", "shortbread", "Spice Hunting", "spices", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Pistachio Millionaire's Shortbread With Coriander Butterscotch", "link": "https://www.seriouseats.com/recipes/2011/03/pistachio-millionaires-shortbread-with-coriander-butterscotch-recipe.html", "description": "[Photograph: Robyn Lee Millionaire's shortbread is one of those \"I can't believe we ate the whole thing\" desserts. It's not to be taken lightly. But if you have the power to resist inhaling a batch of warm, gooey, caramel- and...", "totalTime": "1 1/2 hours, plus chilling time if making bar cookies", "recipeYield": "8-10 (at least)", "recipeCategory": ["Christmas", "Desserts", "Nuts"], "recipeIngredient": ["<strong>For pistachio lemon shortbread</strong>", "1 cup (two sticks) unsalted butter, softened", "3/4 cup sugar", "1 1/2 teaspoon kosher salt", "Zest of one lemon", "1 1/4 cup (8 ounces) shelled pistachio nuts", "1 1/2 cup all-purpose flour", "<strong>For coriander butterscotch</strong>", "1/2 cup (1 stick) unsalted butter", "1 1/2 cup raw (turbinado) sugar", "1/2 cup heavy cream", "1/2 cup Irish whiskey", "2 tablespoons coriander, toasted and freshly ground, plus more for dusting", "2 teaspoons kosher salt", "<strong>For chocolate topping</strong>", "8 ounces dark chocolate, about 70% cacao, chopped fine", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For pistachio lemon shortbread:</strong> Preheat oven to 350&deg;F. In an electric mixer with the paddle attachment, cream butter, sugar, salt, and lemon zest on high until pale, fluffy, and almost smooth. Scrape down sides of bowl with a rubber spatula as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, crush pistachios to a fine meal. Small chunks are fine. Decrease mixer speed to medium and add pistachios. Turn mixer down to low and add flour in half-cup installments, scraping down bowl as needed. When all flour is incorporated, increase speed to high and mix just until dough comes together in large clumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto a sheet pan and press down with hands to a 1/2-inch rectangle, approximately 12 inches by 9 inches. Bake on the middle rack of oven for 15 minutes, or until edges brown and top is dry but still slightly sticky. Do not overbake: center of shortbread should still look underdone. Let shortbread cool for 5 to 10 minutes before serving warm, or cool completely for bar cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For coriander butterscotch:</strong> In a heavy 3 quart saucepan, melt butter over medium heat. Increase heat to high, add sugar, and stir to toast sugar for about 30 seconds. Add cream, whiskey, coriander, and salt, stirring to dissolve sugar. Bring sauce to a boil, stirring constantly for five to seven minutes, or until a spoon leaves a dry trail across the pan. Set aside to cool slightly. If butterscotch hardens in saucepan, reheat on low, stirring in an extra tablespoon of cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For chocolate topping:</strong> In a small saucepan, melt chocolate and butter together over low heat, stirring frequently to keep chocolate from burning. When chocolate is mostly melted, remove from heat and stir until no lumps remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble:</strong> Trim browned edges off warm shortbread and cut into even squares, placing each in center of a plate. Spoon warm butterscotch on top, then drizzle on chocolate topping. To drizzle, gather melted chocolate on a spoon and rapidly flick spoon back and forth about eight inches over plate. Garnish with additional ground coriander, if desired. Serve warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make bar cookies,</strong> spread butterscotch over completely cooled shortbread with an offset spatula. Refrigerate or freeze until butterscotch hardens, then spread cooled chocolate on top in a thin layer. Top with a sprinkle of ground coriander and refrigerate until chocolate is firm and glossy. Cut into one-inch squares and serve or wrap in plastic before freezing. Cookies will keep in freezer for 1 month.</p>"}]}