{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111219FinesHerbesWholeFishRaw.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French in a Flash", "mains", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Whole Fish in Fines Herbes Sauce", "link": "https://www.seriouseats.com/recipes/2011/12/whole-fish-in-fines-herbes-sauce-recipe.html", "description": "Whole white fish is soaked in a vibrant green sauce of fines herbes&mdash;parsley, chervil, tarragon, and chives&mdash;then roasted and charred with whole cherry tomato baubles. It's a lighter, fresher alternative to a Christmas roast.", "totalTime": "25 minutes, plus overnight marination", "recipeYield": "4 to 6 servings", "recipeCategory": ["Fish", "French", "Mains"], "recipeIngredient": ["2 ounces flat leaf parsley leaves, roughly chopped", "2 ounces mixed chervil, chives, and tarragon, roughly chopped", "3/4 cup olive oil, plus a drizzle", "4 whole trout, branzino, sea bream, or other individually sized whole fish, gutted and scaled", "Kosher salt", "Freshly cracked black pepper", "4 branches of small cherry tomatoes on the vine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the herbs and 3/4 cup olive oil in the food processor and let it whiz for 5 minutes, until it’s vibrantly green and almost homogenous.  Set half of the sauce aside in a small bowl covered with plastic wrap and refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the 4 fish in a rimmed roasting tray large enough to hold all fish in a single layer.  Rub the fish, inside and out, with the remaining half of the herb sauce.  Cover the tray with plastic wrap, and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, preheat the broiler, with the oven rack in the second position down from the top (not just under the broiler, but slightly farther down). Season the fish liberally, inside and out, with salt and pepper.  Lightly drizzle the tomatoes on their branches with olive oil and salt.  Arrange the tomatoes around the fish. Broil for 10 to 11 minutes, pull out the fish, and carefully turn them over with a fish spatula. Broil for another 10 to 11 minutes, then serve with the remaining herb sauce on the side.</p>"}]}