{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-177675-cranberry-walnut-pie-610x458-33.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cranberries", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Cranberry Walnut Pie", "link": "https://www.seriouseats.com/recipes/2011/11/cranberry-walnut-pie-thanksgiving-desserts-recipe.html", "description": "This is a wonderful closer to a meal, featuring tart cranberries and toasted walnuts, sweetened lightly with a caramel custard. It's even better served with a scoop of vanilla ice cream.", "totalTime": "8 hours", "recipeYield": "8", "recipeCategory": ["Cranberry", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "10 ounces fresh cranberries, washed and dried", "6 ounces chopped walnuts, lightly toasted and cooled", "4 egg yolks", "5.6 ounces light brown sugar", "6 ounces dark corn syrup (or light, if dark is not available)", "4 ounces butter, melted and cooled", "3 ounces heavy cream", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. When the oven is at temperature, line the shaped, chilled crust with parchment or foil and fill with weights (I use and re-use dried beans for this purpose). Place the pie in the center of the lowest rack of the oven and bake for 20 minutes, rotating halfway through. Remove the weights and liner and bake for an additional ten minutes, or until the crust is light golden brown on the bottom. Remove pie from the oven, and turn oven down to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cranberries and chopped nuts into a large bowl and set aside. In a smaller bowl, whisk together the egg yolks, brown sugar, corn syrup, butter, cream, and salt (do not allow the eggs to sit with the other ingredients without whisking them right away, the sugar will \"cook\" the egg yolks). Pour the mixture over the cranberries and nuts and stir to incorporate. Pour the filling into the baked pie crust and return it to the oven on the lowest rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pie for approximately 30 minutes, until the filling looks golden on the top and is slightly puffed. If you are concerned that the crust is getting too dark, cover it lightly with strips to foil to protect it from the heat. Allow the pie to cool completely before serving.</p>"}]}