{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110908-169806-mint-thins.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chocolate", "Cookies", "mint", "The Cookiepedia"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mint Thins", "link": "https://www.seriouseats.com/recipes/2011/09/mint-thins-thin-mints-girl-scout-cookie-recipe.html", "description": "Just like the minty, chocolaty Girl Scout cookies, but even better, since these are available year round.", "totalTime": "1 hour 30 minutes", "recipeYield": "3 1/2 dozen cookies", "recipeCategory": ["Bake the Book", "Cookies", "Desserts"], "recipeIngredient": ["1 cup unsalted butter, at room temperature", "1 cup powdered sugar", "1 egg", "1 teaspoon vanilla extract", "1 1/2 cups all-purpose flour", "2/3 cup cocoa powder", "1/4 teaspoon salt", "12 ounces semisweet chocolate", "1/4 cup unsalted butter", " 3/4 teaspoon peppermint flavor "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cream the butter until it’s light and fluffy. Add the powdered sugar and continue mixing, stopping to scrape the sides of the bowl as needed. Mix in the egg and vanilla extract. Sift together the flour, cocoa powder, and salt. Add the flour mixture by halves, beating to incorporate after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough onto a clean surface and form it into a disk with your hands. Split the disk in half and place them in the fridge to firm up for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working on a floured surface (you’ll need a decent amount, since the dough is sticky), roll out the dough to 1/8-inch thick. Shape the cookies using a 1 1/2-inch round cutter and place them on a parchment-paper-lined baking sheet.  Bake for 10 to 12 minutes, then let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break up the chocolate into a bowl and set it over a small pot of simmering water (make sure the bowl doesn't touch the water). Add the butter and peppermint flavor and stir the mixture steadily until it's fully melted and looks glossy and smooth.  Remove the bowl and let the chocolate cool slightly.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One by one, drop the cookies into the chocolate, then scoop them out with a fork to let the excess drip off. (Tap the cookies against the side of the bowl to help drain the extra chocolate.) Move them carefully to a wire rack or parchment paper-lined baking sheet. When they're all coated, move the sheet to the refrigerator for freezer to set. </p>"}]}