{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111027cookiesnmilkchocolate610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "chocolate", "Cookies", "holiday cookies", "Keebler", "shortbread cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Keebler Fudge Stripe Cookies", "link": "https://www.seriouseats.com/recipes/2011/11/homemade-keebler-fudge-stripe-cookies-recipe.html", "description": "You can use any chocolate you like for the \"fudge\" but a sweeter, less dark chocolate tastes most authentic.", "totalTime": "45 minutes", "recipeYield": "25 cookies", "recipeCategory": ["Cookies", "Dairy-Free", "Vegan"], "recipeIngredient": ["3 3/4 ounce all purpose flour, sifted", "3/4 teaspoon baking soda ", "2 ounces corn syrup", "1 1/2 ounce <a href=\"https://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">clarified butter</a> (unsalted), melted", "1/2 ounce vanilla extract", "additional flour for dusting", "8 ounce chocolate, tempered or melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cookies: Preheat the oven to 350&deg;F and have two parchment lined sheet pans at the ready. Using a hand or stand mixer, combine the flour, soda, corn syrup, clarified butter, and vanilla. Mix until a smooth dough forms. Use your hands to lightly knead the dough into a ball. Wrap with plastic and refrigerate for about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, use a rolling pin to roll the dough to 1/4\" thickness. Run an offset spatula or thin knife between the dough and the counter, to ensure it doesn't stick in any places.</p>\r\n\r\n<p>Dock the dough all over with a fork to mimic the design stamped onto real Fudge Stripe Cookies.</p>\r\n\r\n<p>Use a 3\" cutter to stamp out as many cookies as you can, transferring them to the cookie sheet. Use the smallest round cutter you have (or a plastic coupling from a pastry bag) to cut a hole from the center of each cookie. Gather up these holes along with the remaining cookie scraps, knead together, reroll, dock and cut again. </p>\r\n\r\n<p>Bake the cookies approximately 12 minutes, or until just lightly browned all over. Cool thoroughly.</p>\r\n\r\n<p>Gather the cookies into a stack. Throw away the used parchment and cover each cookie sheet with a fresh piece of parchment paper.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decorate the cookies: Temper the chocolate (or simply melt) and transfer to a small bowl. </p>\r\n\r\n<p>Drop the cookies into the chocolate one at a time, polka dotted side up. Using your fingers, gingerly lift the cookies back out and transfer each to the clean parchment. If may notice a thin film of chocolate covering the hole in the center; you can lightly blow on it to break the film, or touch it lightly with a toothpick to do the same.</p>\r\n\r\n<p>Once all of the cookies have been coated in chocolate on one side, transfer the remaining chocolate to a small pastry bag fitted with a small, plan tip. You may also use a plastic baggie with a hole poked in one corner.</p>\r\n\r\n<p>In either case, drizzle each cookie with five wide stripes.</p>\r\n\r\n<p>If you're using tempered chocolate, it will set up on its own in a few minutes. If you're using melted chocolate, transfer the cookies to the fridge for about 5 minutes to solidify the chocolate.</p>\r\n\r\n<p>In either case, after the chocolate sets, peel the cookies off the parchment and store in an airtight container. Cookies coated in untempered chocolate must be stored in the refrigerator.</p>"}]}