{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-177675-modern-mince-pie-610x458-33.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["mincemeat", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bacon Mincemeat Pie", "link": "https://www.seriouseats.com/recipes/2011/11/modern-mincemeat-pie-with-bacon-recipe.html", "description": "Lacking the acquired taste for mince pies, both the beefy suet and vegetarian versions, I decided to try substituting bacon. In my quest to appreciate mince pies, the results were the most pleasing so far, and will definitely be enjoyed by traditional mince pie lovers looking to try something new.", "totalTime": "3 days", "recipeYield": "8", "recipeCategory": ["Bacon", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "3 pounds apples (recommend: Pippins or other tart baking apple), peeled, cored, and diced into 1/4 inch pieces", "1 pound uncured bacon, cut into thick lardons", "1/2 cup chopped prunes, pits removed", "1/2 cup golden raisins", "1/2 cup dried cherries", "1/2 cup chopped figs", "2 tablespoons light molasses", "1/4 cup brandy", "1/4 cup orange juice", "1/4 cup butter", "Zest of 1 orange", "Zest of 1 lemon", "1/4 teaspoon ground cloves", "1/4 teaspoon ground nutmeg", "Pinch of salt", "Egg wash: 1 egg and 1 pinch of salt, beaten together"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Saute bacon lardons in a frying pan over medium heat, cooking until just crispy and most of the fat has rendered out. Strain the contents of the pan, reserving 1/2 cup of the bacon fat and the lardons. The remaining fat may be discarded. Allow the bacon fat to cool a bit at room temperature, then place it in the fridge for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all of the ingredients except for the crust and egg wash in a large bowl. Press plastic wrap down on the surface of the mixture and cover the bowl. Allow the mixture to soak in the fridge at least overnight (2 days is preferred).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. Fill the chilled bottom crust with the mixture and cover the top with the rolled out, chilled top crust. Shape the edges and cut slits in the top. Allow the shaped pie to chill for 1/2 hour in the fridge. Brush the top with egg wash and place the pie on the lowest rack of the preheated oven. Bake for 20 minutes at 425&deg;F, rotating the pie halfway through. Then, turn the oven down to 375&deg;F and bake the pie for 30 minutes, turning halfway through, or until the top is golden brown and the filling is bubbling all over. If you are concerned that parts of the crust are becoming too dark, place a patch of foil over the effected areas to protect them from the heat. Allow the pie to cool completely before serving.</p>"}]}