{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110823-167478-maccheroni-alla-chitarra.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Domenica Marchetti", "meatballs", "pasta", "pasta sauces", "The Glorious Pasta of Italy", "tomato", "tomato sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Maccheroni alla Chitarra with Ragù Abruzzese and Palottine", "link": "https://www.seriouseats.com/recipes/2011/08/maccheroni-alla-chitarra-with-ragu-abruzzese-pasta-recipe.html", "description": "Before coming across this lovely plate of <strong>Maccheroni alla Chitarra with Ragù Abruzzese and Palottine</strong> that graces the cover of <a href=\"http://www.domenicacooks.com/about-2/\">Domenica Marchetti</a>'s <em><a href=\"http://www.amazon.com/Glorious-Pasta-Italy-Domenica-Marchetti/dp/0811872599/?tag=serieats-20\">The Glorious Pasta of Italy</a></em>, I'd always thought that spaghetti and meatballs was strictly checkered tablecloth territory, an Italian-American dish with very distant (if any) ties to Italian cookery.  As it turns out, this Italian cousin of our beloved spaghetti and meatballs is quite the popular dish in Abruzzo.", "totalTime": "4 hours", "recipeYield": "8", "recipeCategory": ["Cook the Book", "Pasta", "Tomato"], "recipeIngredient": ["<strong>For the palottine:</strong>", "12 oz ground veal", "1/2 tsp kosher or fine sea salt", "Pinch of freshly grated nutmeg ", "1 large egg, lightly beaten", "Vegetable oil for frying ", "&nbsp;", "1 batch Ragù all’Abruzzese (recipe follows), heated to a simmer", "2 batches Fresh Egg Pasta Dough (recipe follows), cut into maccheroni alla chitarra or cut using a pasta roller", "Freshly grated Parmigiano-Reggiano cheese for serving ", "Whole dried chiles or red pepper flakes for serving", "&nbsp;", "<strong>For the Ragù all’Abruzzese:</strong>", "3 tablespoons vegetable oil or olive oil (not extra-virgin)", "6 ounces boneless beef chuck roast, cut into 4 equal pieces", "6 ounces boneless pork shoulder, cut into 3 equal pieces", "6 ounces boneless lamb shoulder, cut into 3 equal pieces", "Kosher or fine sea salt", "Freshly ground black pepper", "3 pounds whole or diced canned tomatoes, with their juice (about 7 1/2 cups)", "2 tablespoons extra-virgin olive oil", "1 yellow onion, finely chopped", "&nbsp;", "<strong>For the Fresh Egg Pasta Dough:</strong>", "2 to 2 1/4 cups “00” flour or unbleached all-purpose", "1 tablespoon semolina flour, plus more for dusting the work surface and the dough", "1/2 teaspoon fine sea salt", "Pinch of freshly grated nutmeg ", "3 extra-large eggs", "1 to 2 tablespoon extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ragù all’Abruzzese:</strong> Warm the vegetable oil in a large Dutch oven or other heavy-bottomed pot placed over medium heat. Season the pieces of meat with a little salt and pepper and add them to the pot. Brown for 3 to 4 minutes, then turn the pieces to brown the other side, another 3 to 4 minutes. Continue to brown the meat until it is nicely seared all over. Remove the pieces to a deep plate or bowl. Set the pot aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass the tomatoes through a food mill fitted with the disk with the smallest holes. Discard the solids. Set the milled tomatoes aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pot to medium heat and add the extra-virgin olive oil. Stir in the onion, reduce the heat to medium-low, and sauté for about 5 minutes, or until the onion is shiny and beginning to soften. Pour in the tomatoes, raise the heat to medium-high, and bring to a simmer. Return the meat to the pot and reduce the heat to medium-low or low to maintain a gentle simmer. Cover partially and let the sauce simmer, stirring it from time to time, for about 3 hours, or until the meat is very tender and the sauce is thickened. Add a splash or two of water if the sauce thickens too much before the meat is done. Taste and adjust the seasoning with salt and pepper, if you like. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat. Remove the meat from the pot before using the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fresh Egg Pasta Dough:</strong> To mix the dough in the food processor: Put 2 cups “00” flour, the 1 tbsp semolina flour, salt, and nutmeg into the work bowl and pulse briefly to combine. Break the eggs into the work bowl and drizzle in 1 tbsp of the olive oil. Process the mixture until it forms crumbs that look like small curds. Pinch together a bit of the mixture and roll it around. It should form a soft ball. If the mixture seems dry, drizzle in the remaining 1 tbsp oil and pulse briefly. If it seems too wet and sticky, add additional flour, 1 tbsp at a time, and pulse briefly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the mixture out onto a clean work surface sprinkled lightly with semolina flour and press it together with your hands to form a rough ball. Knead the dough: Using the palm of your hand, push the dough gently but firmly away from you, and then fold it over toward you. Rotate the dough a quarter turn, and repeat the pushing and folding motion. Continue kneading for several minutes until the dough is smooth and silky. Form it into a ball and wrap it tightly in plastic wrap. Let the dough rest at room temperature for 30 minutes before stretching it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To mix the dough by hand: Combine 2 1/4 cups “00” flour, the 1 tbsp semolina flour, salt, and nutmeg on a clean work surface and pile into a mound. Make a well in the center of the mound, and break the eggs into it. Drizzle 1 tbsp of the olive oil into the well. With a fork, break the egg yolks and whisk together the eggs and oil. Using the fork, gradually draw the flour from the inside wall of the well into the egg mixture until it has a batterlike consistency. Work carefully so that you don’t break the wall of flour, causing the egg mixture to run out and things to get messy. (If this happens, don’t panic; just use your palms to scoop up the egg mixture and work it back into the flour.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, use your hands to draw the remaining wall of flour over the thickened egg mixture and begin to mix it and knead it. Using the palm of your hand, push the dough gently but firmly away from you, and then fold it over toward you. Rotate the dough a quarter turn, and repeat the pushing and folding motion. Use a dough scraper to dislodge any bits stuck to the work surface. The dough will begin as a shaggy mass but will eventually turn smooth as you knead it over several minutes. You may not use all of the flour on the work surface. When the dough is smooth and silky, form it into a ball and wrap it tightly in plastic wrap. Let it rest at room temperature for 30 minutes before stretching it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Stretching the dough:</strong> Set up your pasta machine with the rollers on the widest setting (#1 on my standard Marcato Atlas machine). Scatter a little semolina flour on the work surface around the machine and have more on hand for sprinkling on the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough into four equal pieces, and rewrap three pieces. Knead the remaining piece briefly on the work surface. Then, using a rolling pin or patting it with the heel of your hand, form the dough into an oval 3 to 4 in long and about 3 in wide. Feed the dough through the rollers of the pasta machine, and then lay the strip on the work surface. Fold the dough into thirds, like folding a business letter, sprinkle with a little semolina, and pass it through the rollers again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat the folding and rolling process a few more times, until the strip of dough is smooth. Move the roller setting to the next narrower notch and feed the strip of dough through the setting twice, sprinkling it with a little semolina each time to keep it from sticking and then moving the notch to the next setting. Continue to pass the dough through the rollers twice on each setting, until you have stretched it to the appropriate thickness. This will depend on which cut you are making, so be sure to read carefully the individual recipes and instructions for cutting the various shapes. Most recipes, including those for ravioli and lasagne, call for stretching the dough very thin—about 1/16 in—though some cuts require a thicker sheet. On my machine, passing the dough through the second-narrowest roller setting (#6) produces a very thin pasta sheet, so I usually don’t stretch past that setting. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once you have stretched your piece of dough (it will be a fairly long ribbon, depending on how thin you have stretched it), lay it out on a semolina-dusted surface and cover it lightly with plastic wrap while you stretch the remaining 3 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the palottine:</strong> Put the veal, salt, nutmeg, and egg in a bowl and mix together thoroughly (I use my hands). With your fingers, pinch off a very small piece of the mixture and roll it into a tiny ball—not much larger than a chickpea. Place the meatball on a clean tray or platter. Repeat until you have rolled all of the veal mixture into meatballs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the vegetable oil to a depth of 1/4 in in a frying pan, place over medium-high heat, and heat to 375°F on a deep-frying thermometer. If you don’t have a thermometer, carefully drop a meatball into the hot oil; if it sizzles on contact, the oil is ready. Place a platter lined with a double layer of paper towels or a large, plain brown-paper bag near the stove. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully add the meatballs to the hot oil, working in batches to avoid crowding the pan. Fry them, turning them from time to time with a spatula, slotted spoon, or even a fork, for about 4 minutes, or until they are lightly browned. Use a slotted spoon or a skimmer to remove the meatballs to the prepared platter. Repeat until all the meatballs are fried. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the meatballs to the pot with the ragù. Return the sauce to a simmer over medium-low heat, then reduce the heat to low, cover, and keep the sauce at a very low simmer while you cook the pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a very large pot or a stockpot of water to a rolling boil and salt generously.  Carefully drop each maccheroni “nest” into the boiling water and stir to separate the strands. Cover the pot until the water returns to a boil, then uncover and cook for just a couple of minutes, or until very al dente. Taste a strand to make sure it is slightly undercooked. Drain the pasta in a colander set in the sink, reserving about 1 cup of the cooking water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the drained pasta to the pot and spoon about two-thirds of the sauce over it. Gently toss the pasta and sauce to combine thoroughly, adding a splash or two of the cooking water if necessary to loosen the sauce. Transfer the dressed pasta to a warmed serving bowl or shallow individual bowls and spoon the remaining sauce over the top. Sprinkle with a little Parmigiano and serve immediately. Pass additional cheese at the table, along with a small bowl of chiles.</p>"}]}