{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111126-181087-driller-cupcake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chocolate", "cupcakes", "David Arrick", "maple", "The Butch Bakery Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Driller Cupcakes", "link": "https://www.seriouseats.com/recipes/2011/11/driller-cupcakes-bacon-cupcake-recipe.html", "description": "Maple cupcakes topped with creamy milk chocolate ganache get a perfect hit of smoky salt and pepper when topped with crumbled candied bacon.", "totalTime": "2 hours", "recipeYield": "makes 12 cupcakes", "recipeCategory": ["Bacon", "Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Maple Cupcakes:</strong>", "2 cups unbleached all-purpose flour", "1 1/2 teaspoons baking powder", "1/4 teaspoon salt", "10 tablespoons (1 1/4 sticks) unsalted butter, softened", "1 cup firmly packed light brown sugar", "3 large eggs, broken into a small bowl ", "2 teaspoons pure vanilla extract", "1/3 cup whole milk", "1/3 cup pure maple syrup", "&nbsp;", "<strong>For the Milk Chocolate Ganache:</strong>", "4 tablespoons (1/2 stick) unsalted butter", "1 cup heavy cream", "1 1/2 cups milk chocolate chips", "1/2 cup semisweet chocolate chips", "1/2 teaspoon pure vanilla extract ", "Pinch salt", "&nbsp;", "<strong>Topping:</strong>", "3/4 cup Butch’s Bacon Bits (recipe follows) or crumbled crisp bacon (recipe follows)", "&nbsp;", "<strong>Butch’s Bacon Bits:</strong>", "1/3 cup firmly packed light brown sugar", "1/8 teaspoon ground black pepper", "10 to 12 slices of regular-cut bacon (1/2 pound)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Butch's Bacon Bits:</strong> Preheat the oven to 400°F and adjust the rack in the upper half of the oven. Line a rimmed baking sheet with aluminum foil and place a similar-sized wire cooling rack inside the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-size mixing bowl, combine the brown sugar and pepper. Add the bacon strips and toss in the mixture. Lay the strips in one layer on the rack and top with any leftover sugar. Bake for 25 to 30 minutes until browned. Cool slightly before finely chopping. This will keep for 1 week stored in an airtight container in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Cupcakes:</strong> Place a baking rack in the center of the oven and preheat the oven to 350°F. Line two 6-cup jumbo-size muffin pans with liners and set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a strainer over a medium mixing bowl and sift together the flour, baking powder, and salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-size mixing bowl, with an electric mixer on medium-high speed, beat the butter and brown sugar until well combined. Add the eggs and vanilla and beat until creamy. Scrape down the sides of the bowl and add half of the flour mixture and the milk, beating to combine. Add the rest of the flour mixture and the maple syrup, and continue to mix just until the dry ingredients are incorporated, scraping down the sides of the bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each prepared muffin cup with a rounded 1/3 cup batter, about 3/4 full. Bake, rotating the pans halfway through, until the tops are just firm to the touch and a tester inserted in the center of a cupcake comes out clean, about 24 minutes. Leave the cupcakes in the pan on a rack to cool for 5 to 10 minutes. Transfer the cupcakes to the wire rack to cool completely before frosting, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Ganache:</strong> In heavy 2-quart saucepan over low heat, melt the butter. Stir in the cream and heat until very hot but not boiling. Remove from the stove and stir in both kinds of chocolate chips until smooth and glossy. Stir in the vanilla and the salt. Transfer to a medium-size mixing bowl, and cool to room temperature. Chilling the mixture in the refrigerator will take about 1 hour. Beat the ganache on medium-high speed until thick and creamy, about 2 to 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cupcake Construction:</strong> Get out that ice cream scoop (2 to 21/4 inches) and top each cupcake with a generous rounded scoop of frosting. Sprinkle 1 rounded teaspoon of the bacon bits on top of each cupcake. Cupcakes can be refrigerated for up to 3 days in an airtight container, or frozen for 1 month.</p>"}]}