{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111210-182930-sunday-supper-sausage-stuffed-squid-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["sausage", "Sausage stuffed squid", "squid", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sausage Stuffed Squid", "link": "https://www.seriouseats.com/recipes/2011/12/sausage-stuffed-squid.html", "description": "Sausage and cephalopods are two ingredients that, to me, always work together.  And if you use your imagination it's not a far leap to think of a cleaned squid body as the ocean's sausage casing.  Squid are creatures that need to be cooked hot and quick, or low and slow to get the best results, so once you add the squid to the tomato sauce, make sure to give it the time it needs.  The best test of when the squid is done cooking is taking it out of the pan and giving it a try.  To me, fork-poking a slow cooked squid doesn't give an accurate portrayal of its state.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Other Seafood", "Pork", "Sunday Supper"], "recipeIngredient": ["1/3 pound sausage (hot is ideal)", "1/4 cup plus 2 tablespoons breadcrumbs", "1/4 cup chopped parsley", "12 squid, cleaned with tentacles removed but reserved", "drizzle olive oil", "2 cloves garlic sliced", "1 onion, finely chopped", "1 X 28 ounce can whole peeled plum tomatoes", "2 tablespoons parsley", "1 pound pasta, or loaf of crusty bread to serve", "lemon slices, to garnish", "sliced scallions to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sausage, breadcrumbs and chopped parsley until well combined.  Stuff each squid with sausage mixture until cavity is half filled and seal with toothpick or skewer.  Repeat with remaining squid; there may be extra sausage mixture left over – reserve and add to sauce.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place skillet over medium heat and add a drizzle of olive oil.  Sauté onions and garlic until onions are translucent, add any leftover sausage filling and reserved tentacles and stir to combine.  Pour canned tomatoes over onion mixture, bring to a simmer, then add stuffed squid and chopped parsley.  Cover and simmer over low heat until squid are tender, adding water if stock begins to dry out, about 30 minutes.  Garnish with additional chopped parsley and lemon slices and serve tossed with pasta, or with a crusty loaf of bread and green salad.  And lots of light red wine.</p>"}]}