{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/08152011-166329-spun-sugar-500-375-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["spun sugar", "sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spun Sugar", "link": "https://www.seriouseats.com/recipes/2011/08/how-to-make-spun-sugar-recipe.html", "description": "Using spun sugar as a topper for desserts is a great way to turn something ordinary into extraordinary. For a cleaner look, create a simple template to catch the strands of pulled sugar, or simply gather the sugar strands together into a free-form ball. Use for topping cupcakes, cakes, individual custards, or even ice cream sundaes.", "totalTime": "1 hour", "recipeYield": null, "recipeCategory": ["Desserts"], "recipeIngredient": ["75 grams water", "50 grams light corn syrup", "8 ounces granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Set up: </strong>Prepare your workstation by taping 3-4 wooden dowels to the edge of a table. Cover the workstation and floor with foil so that nothing is exposed except for the dowels. Set up a large bowl with ice water and place near the stove. Line a dry sheet tray with parchment paper and set aside. Have an instant-read candy thermometer, small fine mesh strainer, pastry brush, and bowl of water at the ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cooking the syrup:</strong> In a medium-sized saucepan with a heavy bottom, add, in this order: water, corn syrup, and sugar, taking care to add the sugar so it doesn't touch the sides of the pot. Gently hydrate the sugar with the water using your fingers, taking care that none of it touch the sides of the pot. Set the mixture over medium-high heat. Do not jostle or stir. Allow the sugar to dissolve on its own. When it starts to bubble, periodically wash down the sides of the pot using the pastry brush dipped in water. Once all of the sugar has dissolved, use the strainer to skim any impurities off of the top of the bubbling mixture. Continue to cook until the mixture reaches 293 degrees Fahrenheit, at which point the bottom of the pot should be plunged into the waiting ice bath for five seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Making the spun sugar:</strong> Allow the syrup to cool in the pot until it has the viscosity of honey. Dip a fork into the syrup, raise it up over the pot and allow it to begin falling in a narrow stream. Allow the syrup to stream down onto the dowels as you move the fork back and forth rapidly. Repeat as desired, but work quickly. Gently loosen the strands from the dowels before the syrup is completely hardened and still warm, then carefully gather the strands into a ball using cool, dry hands. Place the ball on the prepared sheet tray. Repeat until the syrup in the pot has hardened, melt over medium heat, plunging into the water batch each time. The syrup will turn amber as it reheats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage and use:</strong> Use as soon as possible, as spun sugar will begin to melt from moisture in the air in as little as one hour. Storage may be prolonged a little bit by storing in airtight containers lined with parchment and silica packets.</p>"}]}