{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111120-179883-preserved-lemon-ginger-marmalade-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["lemons", "Marmalade", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon Ginger Marmalade", "link": "https://www.seriouseats.com/recipes/2011/11/lemon-ginger-marmalade-recipe.html", "description": "Swapping lemons for more traditional oranges in this marmalade results in a spread that is exceptionally tart, zippy, and bursting with citrus flavor. Fresh and crystallized ginger add extra spice and zing. Try it over warm gingerbread or stirred into vanilla ice cream.", "totalTime": "1 1/2 hours", "recipeYield": "5 half-pints", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Ginger", "Lemon"], "recipeIngredient": ["6 medium-sized, juicy lemons", "1/2 teaspoon baking soda", "1/2 cup coarsely grated fresh ginger", "One (1.75 ounce) package low sugar powdered pectin, such as Sure Jell", "1/4 teaspoon unsalted butter", "4 cups granulated sugar", "1/2 cup finely chopped crystallized ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the marmalade, prepare the jars and lids: place 8 half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off the heat and allow the jars to rest in the hot water. Meanwhile, put the bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from the heat and allow the bands and lids to rest in the hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a vegetable peeler, remove the zest from the lemons in strips. Cut the strips lengthwise into very thin slices. Transfer the strips to a large, heavy-bottomed pot and add 2 1/2 cups of water. Bring to a boil, then reduce the heat and simmer until the peels have softened, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, using a sharp knife, cut the remaining pith (white part) from the lemons. Working over a bowl to catch the juices, cut the lemon into segments. Put the segments in the bowl and squeeze the membrane to release as much juice as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure one cup of the lemon segments and juices (removing any seeds) and add it to the pot with the lemon zest along with the fresh ginger and the butter. Sprinkle the pectin over the mixture and bring it to a boil, stirring constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar all at once. Return to full boil, stirring constantly. Boil hard for one minute. Remove the pot from the heat and stir in the crystallized ginger. Skim any foam from the surface of the marmalade. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot marmalade into the hot sterilized jars, leaving 1/4-inch headspace. Wipe the rims of the jars, cover with the lids, and screw the bands on until just barely tight. Place the jars on a rack in a pot and cover completely with water. Cover the pot and bring to a boil over high heat. Boil for 10 minutes. Turn off the heat, uncover the pot, and allow the jars to rest in the water for five minutes. Remove the jars from the pot and allow them to rest undisturbed on a countertop for six hours or overnight. </p>"}]}