{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-179926-rolled-marshmallow-fondant-610x458-26.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["candy", "fondant", "marshmallow"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rolled Marshmallow Fondant", "link": "https://www.seriouseats.com/recipes/2011/11/marshmallow-rolled-fondant-recipe.html", "description": "This is a great, affordable way to experiment with rolled fondant for molding, modeling, and cake decorating. I think it tastes slightly better than regular, manufactured fondant, but it is more prone to cracking. Make a batch and let the creativity fly!", "totalTime": "2 hours", "recipeYield": "Makes about 2 pounds of fondant", "recipeCategory": ["Candy", "Desserts"], "recipeIngredient": ["16 ounces marshmallow (use a name brand, such as Kraft)", "2-5 tablespoons warm water", "2 pounds confectioner's sugar, sifted", "1/2 cup solid vegetable shortening", "Optional: gel coloring and rubber gloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make marshmallow fondant, place marshmallows and 2 tablespoons of water in a microwave-safe bowl. Microwave 30 seconds on high; stir until mixed well. Continue microwaving 30 seconds more; stir again. Continue until melted (about 2 1/2 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 3/4 of the confectioners' sugar on top of the melted marshmallow mixture. Fold sugar into marshmallow mixture. Flavoring can be added at this point if desired. Place solid vegetable shortening in easily accessed bowl so you can reach into it with fingers as you are working. Grease hands and counter <strong>generously</strong>; turn marshmallow mixture onto counter. Start kneading like you would dough. Continue kneading, adding additional confectioners' sugar and re-greasing hands and counter so the fondant doesn't stick. If the marshmallow fondant is tearing easily, it is too dry; add water (about 1/2 tablespoon at a time) kneading until fondant forms a firm, smooth elastic ball that will stretch without tearing, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>It's best to allow Marshmallow Fondant to sit at room temperature, double-wrapped, overnight. Prepare the fondant for storing by coating with a thin layer of solid vegetable shortening, wrap in plastic wrap and then place in resealable bag. Squeeze out as much air as possible. Marshmallow Fondant will keep well in refrigerator for several weeks.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When not working with fondant, make sure to keep it covered with plastic wrap or in a bag to prevent it from drying out. When ready to use, knead fondant until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To color fondant: </strong>If you need to tint the entire batch of fondant, add a little gel color to the melted marshmallow mixture before adding confectioners' sugar. For smaller amounts of tinted fondant, add icing color to portions of fondant as needed. Wearing gloves for coloring is highly recommended.</p>"}]}