{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111130-181728-tailgate-cupcakes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["caramel sauce", "cupcakes", "David Arrick", "pretzels", "salted caramel", "stout", "The Butch Bakery Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tailgate Cupcakes", "link": "https://www.seriouseats.com/recipes/2011/12/tailgate-cupcakes-salted-caramel-butch-bakery-recipe.html", "description": "These <strong>Tailgate Cupcakes</strong> are the holy trinity of salted caramel: salted caramel cake filled with yes, salted caramel, topped with salted caramel, and finished with a shower of crunchy coarse grained salt.", "totalTime": "2 hours", "recipeYield": "makes 12 cupcakes", "recipeCategory": ["Bake the Book", "Cakes"], "recipeIngredient": ["<strong>For the Caramel Sauce:</strong>", "12 tablespoons (1 1/2 sticks) unsalted butter", "1 1/2 cups firmly packed dark brown sugar", "3/4 cup firmly packed light brown sugar ", "3/4 cup whole milk", "1/4 teaspoon salt", " ", "<strong>For the Caramel Cupcakes:</strong>", "1 3/4 cups unbleached all-purpose flour", "1 1/2 teaspoons baking powder ", "3/4 teaspoon salt", "12 tablespoons (1 1/2 sticks) unsalted butter, softened ", "1 1/2 cups sugar", "3 large eggs, broken into a small bowl", "1 teaspoon pure vanilla extract", "3/4 cup whole milk", " ", "<strong>For the Salted Caramel Buttercream:</strong> ", "3/4 cup reserved caramel sauce", "2 cups confectioners’ sugar, sifted through a strainer", "2 tablespoons unsalted butter, softened", "2 tablespoons egg substitute, such as Egg Beaters", "1/4 teaspoon salt", " ", "<strong>Topping:</strong>", "Coarse-grain salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Caramel Sauce:</strong> In a large-size saucepan over low heat, melt the butter. Add the dark and light brown sugars, milk, and salt, and bring to a boil. Lower the heat to medium and continue to boil for 2 minutes, watching carefully so the mixture doesn’t bubble over the pot. Remove from the heat and let cool. Reserve 3/4 cup for the caramel buttercream. (You’ll have about 2/3 cup left over. Save the caramel in the refrigerator, reheat gently, and drizzle on top of your favorite ice cream.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Cupcakes:</strong> Place a baking rack in the center of the oven and preheat the oven to 350&deg;F. Line two 6-cup jumbo-size muffin pans with liners and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a strainer over a medium-size mixing bowl and sift together the flour, baking powder, and salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another medium-size mixing bowl, with an electric mixer on medium-high speed, beat the butter and sugar together until light and fluffy, 2 to 3 minutes. Scrape down the sides of the bowl and add the eggs and vanilla, beating until combined. Add the flour mixture and the milk, beating on low speed, just until all the dry ingredients are incorporated, and scraping down the sides of the bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each prepared muffin cup with a rounded 1/3 cup batter, about 3/4 full. Bake, rotating the pans halfway through, until the tops are just firm to the touch and a tester inserted in the center of a cupcake comes out clean, about 24 minutes. Leave the cupcakes in the pan on a rack to cool for 5 to 10 minutes. Transfer the cupcakes to a wire rack and let cool 5 to 10 minutes more.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Buttercream:</strong> In a large-size mixing bowl, with an electric mixer on medium-high speed, beat the reserved caramel, confectioners’ sugar, butter, egg substitute, and salt until thick and creamy, 2 to 3 minutes, scraping down the sides of the bowl as needed.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cupcake Construction:</strong> To catch drips, place the cupcakes on the wire cooling rack over a foil-lined rimmed baking sheet. While the cupcakes are still warm, poke each one about 15 times with a skewer and drizzle 1 1/2 tablespoons of the warm caramel over the top of each cupcake. Let them cool completely and then spread the tops of each cupcake with 2 rounded tablespoons of frosting. Lightly sprinkle the tops with the salt. Cupcakes can be refrigerated for up to 3 days in an airtight container, or frozen for 1 month.</p>"}]}