{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111003-173559-assembling-cake-610x458-26.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["birthday cake", "cakes", "yellow cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Yellow Birthday Cake", "link": "https://www.seriouseats.com/recipes/2011/10/yellow-birthday-cake-recipe.html", "description": "I've made a lot of fancy flavored birthday cakes for other people, but when my birthday rolls around, I prefer the same old-school, yellow cake that I remember my mom making for me. Hers was made from a boxed mix, but my version is homemade. This cake tastes how good yellow cake should; buttery, light, and moist. I use a soaker of simple syrup with real vanilla bean to ensure that the layers pack extra moisture and flavor.", "totalTime": "3 hours", "recipeYield": "10", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["325 grams all purpose flour", "1 tablespoon baking powder", "1/2 tablespoon salt", "1/2 pound (2 sticks) butter, soft and but into 1 inch pieces, plus more for greasing pans", "325 grams sugar", "4 eggs, room temperature", "2 yolks, room temperature", "1.5 tablespoons vanilla extract", "1 1/4 cups whole milk, room temperature", "Soaker: vanilla bean simple syrup (1 cup sugar, 1 cup water, scraping of 1 vanilla bean, brought to a boil and cooled)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Grease the bottom and sides of the cake pans with butter, line with parchment paper rounds, and set aside. Sift the dry ingredients together and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a paddle attachment, cream the butter and sugar together on high speed until it is light and fluffy (about 5 minutes). Reduce the mixer speed to medium and slowly add the eggs and yolks with the vanilla one at a time, mixing well between each addition until incorporated. Scrape down the sides and bottom of the bowl frequently. In four additions, alternate adding the dry ingredients and the milk on low speed, mixing until just incorporated. Remove the mixing bowl from the stand mixer and finish mixing the cake with a spatula; do not over mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly between the three pans (use a scale for easy measuring) and bake for approximately 25 minutes, rotating the pans halfway through. When fully baked, the cakes will be springy to the touch, look golden brown, and a tester inserted in the centers will come out clean. Allow the cakes to cool in the pans for 15 minutes, then carefully turn the cakes onto a cooling rack and remove the parchment. Allow the cakes to cool completely before assembling. When building the cake, brush each layer liberally with cooled soaker.</p>"}]}