{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111218-184291-chicken-liver-crostini.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Arthur Boehm", "chicken livers", "Cook the Book", "Geila Hocherman", "hanukkah sides", "Kosher Revolution"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kosher Revolution's Chicken Liver Crostini", "link": "https://www.seriouseats.com/recipes/2011/12/kosher-revolutions-chicken-liver-crostini.html", "description": "Chicken livers mashed with onions and schmaltz are a Jewish deli staple that has a tendency to beg the question, \"what am I, chopped liver?\" Because, well, chopped liver isn't usually all that thrilling.  But with chicken livers come a world of delicious possibilities, like these genius <strong>Chicken Liver Crostini</strong> from <em><strong><a href=\"http://www.amazon.com/Kosher-Revolution-Techniques-Recipes-Unlimited/dp/1906868530/?tag=serieats-20\">Kosher Revolution</a></strong></em>.", "totalTime": "45 minutes", "recipeYield": "makes 12 hors dâ\u0080\u0099oeuvres; serves 4 as a starter", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Offal"], "recipeIngredient": ["5 tablespoons duck or chicken fat", "1 small onion, sliced thin and roughly chopped", "1 sprig fresh rosemary", "1/4 teaspoon red pepper flakes", "2 garlic cloves, flattened with the side of a knife", "1/2 teaspoon fresh or dried oregano", "1/2 teaspoon fresh or dried sage", "2 tablespoons chopped small capers, rinsed and drained", "1/2 pound chicken livers (see below kashering)", "1/2 teaspoon kosher salt, plus more", "1/2 teaspoon freshly ground black pepper, plus more", "1/2 cup white wine", "2 slices white sandwich bread, crusts removed ", "1 baguette, diagonally sliced into 12 pieces", "2 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat 2 tablespoons of the fat over medium-high heat.<br />\r\nAdd the onion, rosemary, red pepper and garlic, and sauté, stirring, until<br />\r\nthe onion is translucent, about 5 minutes. Add the oregano, sage and<br />\r\ncapers, and sauté, stirring, until the onions are beginning to brown, about<br />\r\n5 minutes. Transfer the mixture to a plate and remove and dispose of the<br />\r\nrosemary sprigs.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining fat to the pan and heat over medium-high heat.<br />\r\nSprinkle the livers with the salt and pepper on both sides and sauté until<br />\r\ncooked through, turning once, about 2 minutes. Return the onion mixture<br />\r\nto the pan, add the wine, and cook for 2 minutes. Transfer the livers to a<br />\r\nplate, and cook the wine until it has reduced to 1/4 cup, 3 to 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pulse the sandwich bread in a food processor to make rough crumbs. Add the livers and onion mixture and pulse until a rough paste is formed. Season with salt and pepper, and transfer to a medium bowl. Cover and chill, if not serving immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325ºF. Brush the baguette slices on both sides with the oil, transfer to a baking sheet and bake until lightly toasted, about 10 minutes. Spread the liver mixture on the slices and serve.</p>\r\n\r\n<p><small><strong>Note on kashering:</strong> If your butcher doesn’t sell kashered chicken livers, which aren’t otherwise available commercially, you must kasher them yourself following kosher law. To do so, remove any fat from the livers. Rinse them three times under running water and salt lightly with kosher salt. Transfer the livers to a rack that, when fitted in a roasting pan, will allow juices to run away from it<br />\r\ninto the pan. Broil the livers until well done, about 5 minutes per side. Cut open a liver to ensure that no pink remains, and broil longer, if necessary. Rinse the livers three times and dry thoroughly.</p>"}]}