{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110131-127355-dinner-tonight-pork-chops-vidalia-onion-gravy.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "pears", "pork", "pork chops", "The Lee Bros. Southern Cookbook", "vidalia onions"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pork Chops with Pear and Vidalia Pan Gravy", "link": "https://www.seriouseats.com/recipes/2011/02/pork-chops-with-pear-and-vidalia-pan-gravy-recipe.html", "description": "This recipe from <em><a href=\"http://www.amazon.com/dp/039305781X/?tag=serieats-20\">The Lee Bros. Southern Cookbook</a></em> may sound fancy with that \"Vidalia pan gravy,\" but I was born close enough to the South&mdash;I know smothered pork chops when I see them. Of course, with the addition of <strong>pears and sherry,</strong> this is easily the most complex version of smothered pork chops I've ever encountered.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Pear", "Pork"], "recipeIngredient": ["1 teaspoon kosher salt", "1 teaspoon freshly ground black pepper", "1 ½ teaspoons all-purpose flour, divided ", "1 tablespoon peanut oil ", "4 thick pork chops, about 1 ¼-inch-thick ", "1 ¼ cups Vidalia onions, thinly sliced, from about 1 large onion", "1 cup Bartlett pears, peeled, cored, trimmed, and diced, from about 2 large pears", "2 tablespoons unsalted butter", "¾ cup chicken broth ", "1 tablespoon dry sherry, Madeira, or tawny port", "1 teaspoon sherry vinegar", "1 bunch scallions, sliced on the bias "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower middle position and preheat oven to 425&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine salt, pepper, and ½ teaspoon of flour in small bowl. Sprinkle mixture on both sides of pork chops. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour oil into 10-inch cast iron pan set over high heat. When it just starts to smoke, add chops. Cook until they are rich and golden brown on bottom, about three minutes. Flip each and cook until the other side is golden brown, about another three minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip chops again, and then carefully transfer iron skillet to oven.  Cook until internal temperature comes up to 140&deg;F, which should take about 3 minutes. Check with meat thermometer. When done, carefully remove pan. Transfer chops to a platter and cover with aluminum foil to keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cast iron pan over medium-low head and add onion, half the pears, and butter. Cook until the onions soften and turn translucent, about four minutes. Stir occasionally, scrapping any browned bits off pan with wooden spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour chicken stock into medium-sized bowl and whisk in remaining flour. Make sure there are no lumps. Pour this into cast iron pan along with the sherry, and vinegar. Turn heat to medium-high and bring to a simmer. Add any juices from plate holding pork chops. Simmer vigorously, stirring often, until reduced by half, about 4 minutes. Turn off heat, add remaining pears and stir well. Season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve pork chops with the gravy. Garnish with chopped scallions. </p>"}]}