{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110901-pork-belly-ctb.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Home Made", "horseradish", "pork", "pork belly", "yvette van boven"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Hangover Curing Pork Belly", "link": "https://www.seriouseats.com/recipes/2011/09/hangover-curing-pork-belly-recipe.html", "description": "Hearing about hangover cures from foreign lands never gets old, which is one of the reasons I decided to tackle this <strong>Hangover Curing Pork Belly</strong> from <em><strong><a href=\"http://www.amazon.com/Home-Made-Yvette-van-Boven/dp/1584799463/?tag=serieats-20\">Home Made</a></strong></em> by <a href=\"http://www.yvettevanboven.com/about\">Yvette van Boven</a>. The other reason? Pork belly never gets old&mdash;for me at least. Van Boven describes how she serves this pork belly in her restaurant, sliced and presented on crusty bread with a side of potato salad and sinus-clearing horseradish-lemon sauce. Sounds like the kind of carby, fatty, spicy plate that can cure what ails you, right?", "totalTime": "1 day, 2 hours", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Pork"], "recipeIngredient": ["1/4 piece pork belly, without skin (ask your butcher), approx. 2 lb", "1 generous handful of coarse sea salt ", "1 handful of fennel seeds", "At least 12 bay leaves, as fresh as possible ", "&nbsp;", "<strong>For the horseradish sauce:</strong>", "1 piece fresh horseradish the length of your thumb (or 2 tbsp from a jar) ", "1/2 cup sour cream", "Juice and zest of 1/2 lemon ", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Score the fat on the pork belly with a sharp knife to make an attractive plaid pattern. Rub the entire piece with salt and fennel. This is a rough job; do not skimp on the ingredients. Press bay leaves into the grooves and inside the meat. Wrap in a clean dish towel, place in a suitable dish in the refrigerator, and cover with a heavy object. Leave to stand for 24 hours, but 2 days is even better. By processing it in this way, the meat acquires flavor, but the salt also extracts moisture from the meat, which will make the pork crispier later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 340°F, place the pork belly in a baking pan, and bake for at least 1 hour in the oven, or until the top is crispy and golden brown and the meat is fully cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, make the horseradish sauce: Peel the horseradish with a vegetable peeler and grate it on a fine grater. Or better still, use a food processor, as fresh horseradish is very sharp and will make your eyes tear up! Stir in the sour cream and lemon juice. (Once blended with the other ingredients the fumes will disappear.) Season the sauce with salt and freshly ground pepper. Serve with the meat. </p>"}]}