{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110915-170895-butternut-squash-pie-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["butternut squash", "pie", "squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Butternut Squash Pie", "link": "https://www.seriouseats.com/recipes/2011/09/butternut-squash-pie-recipe.html", "description": "This is a great autumn pie with a mellow sweet squash flavor, and creamy dense texture. While other squash pie recipes often tend to lean heavily on the spices, this recipe is more subtle, taking the less-is-more approach with a nice hit of ginger and just a hint of cinnamon and fresh nutmeg. The oat crumble crust gives the creamy filling a crunchy, sweet and salty backdrop.", "totalTime": "5 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles", "Squash"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/08/oat-crumble-crust-recipe.html\">One recipe Oat Crumble Crust</a> shaped in a 9 inch pie plate and chilled", "4 cups roasted butternut squash, cooled", "4 ounces sweetened condensed milk", "1 egg", "3 egg yolks", "1/3 cup dark brown sugar", "1/4 teaspoon cinnamon", "1/4 teaspoon freshly grated nutmeg", "1 teaspoon ground ginger", "Pinch of salt", "Optional toppings: whipped cream or <a href=\"http://www.seriouseats.com/recipes/2010/12/classic-marshmallows-recipe.html\">marshmallows</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the squash: Fill a deep pan with 1/2 inch of water. Quarter the butternut squash and scoop out the seeds. Place the squash pieces inside up in the water. Cover the top tightly with foil and roast at 400&deg; Fahrenheit for 45 minutes to 1 hour, until the flesh is fork tender. Be careful when removing the foil, the steam can burn you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the filling: Preheat the oven to 350&deg;F. Allow the squash to cool, scrape if from the skins, and place 4 cups of the squash flesh in the bowl of the food processor with the sweetened condensed milk. Puree in the food processor for 3 minutes, stopping frequently to scrape down the sides. The mixture should be very smooth. Add the egg and extra yolks, the sugar, spices, and salt, and process for another minute, scraping down the sides. Pour the mixture into the prepared crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pie on the middle rack of the oven for 30 to 40 minutes, rotating every ten minutes to prevent burning. Bake until the filling puffs slightly and pulls away from the crust a bit. Allow the pie to cool completely before serving. Top with whipped cream or a marshmallow (brulee the marshmallow under the broiler or using a torch).</p>"}]}