{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110518-152328-cream-cheese-chive-pinwheels.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["appetizers", "chives", "cream cheese", "dairy", "herb", "holiday nibbles", "puff pastry", "snacks", "Spice Hunting", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cream Cheese and Chive Pastry Pinwheels", "link": "https://www.seriouseats.com/recipes/2011/05/cream-cheese-chive-puff-pastry-pinwheels-recipe.html", "description": "Photograph: Max Falkowitz These pinwheels have a retro aspect to them I really like. That and they need all of three ingredients&mdash;which are completely adaptable to what you have on hand. Plus they can be made ahead of time, and...", "totalTime": "3 hours", "recipeYield": "serves 8 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Snacks", "Vegetarian"], "recipeIngredient": ["1 sheet puff pastry, thawed but cold", "12 ounces cream cheese or chevre, softened", "3/4 cup minced herbs, packed (such as chives, dill, parsley, or tarragon)", "Optional additions: lemon zest, finely minced garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a floured work surface, roll puff pastry out to between 1/16 and 1/8 inch thickness, about a 16 by 16 inch square. With an icing or offset spatula, spread cream cheese in a thin layer across pastry, leaving 1 inch of one side bare. Evenly sprinkle on herbs (as well as any optional additions) and add salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting with the side opposite the bare 1 inch of pastry, roll pastry into a log. Wrap with plastic wrap and chill in freezer for about an hour, or until log is very firm but not rock hard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ten minutes before retrieving log from freezer, heat oven to 375&deg;F, with one rack in the upper third and another rack in the bottom third. Using a sharp knife, cut log into 1/4 inch slices and arrange on two parchment-lined aluminum baking sheets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 minutes, then rotate pans on racks and continue to bake until pastry is well-browned and crisp to the touch, about another 15 minutes. Transfer pinwheels to a cooling rack lined with paper towels to cool and drain before serving. Serve warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To store, transfer pinwheels to a large, airy container and leave loosely covered in a cool dry place. Pinwheels will keep several days at room temperature. Frozen as a log, pastry will keep for weeks.</p>"}]}