{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110821-127355-dinner-tonight-stir-fried-beef-onions-peppers.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beef", "flank steak", "steak", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Stir-Fried Beef with Onions and Peppers", "link": "https://www.seriouseats.com/recipes/2011/08/stir-fried-beef-with-onions-peppers-recipe.html", "description": "Picked out solely because I had some leftover flank steak in the fridge, this recipe from <strong>Grace Young's <em><a href=\"http://www.amazon.com/dp/0743238273/?tag=serieats-20\">The Breath of a Wok</a></em></strong> turned out to be one of those great finds I can't wait to make again. (Actually, I've already made it twice in the past three days.) Though there is no spice, the pepper-laden sauce is a gusty pairing for the finely sliced beef. Balanced by the slightly sweet onions and bell peppers, the dish is whipped up quickly and fairly simply.", "totalTime": "50 minutes", "recipeYield": "4 people", "recipeCategory": ["Beef", "Dinner Tonight", "Stir Frying"], "recipeIngredient": ["12 ounces flank steak, placed in the freezer for 30 minutes", "4 teaspoons plus 2 1/2 tablespoons soy sauce", "2 tablespoons dry sherry, divided  ", "1/2 teaspoon black pepper, freshly ground", "3 teaspoon cornstarch, divided", "3 tablespoons vegetable oil, divided", "1 teaspoon sugar", "2 medium onions, cut into 1/4-inch-thick slices", "1/2 medium green bell pepper, stemmed, seeded, and julienned", "1/2 medium red bell pepper, stemmed, seeded, and julienned"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the beef along the grain into 2-inch wide strips. Rotate the strips, and slice each against the grain into 1/4-inch-thick slices. Stack four or five of these pieces at a time, and cut into 2-inch long matchsticks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized bowl, whisk together four teaspoons of soy sauce, one tablespoon of dry sherry, the black pepper, two teaspoons of cornstarch, and one tablespoon of vegetable oil. Add the beef and toss well. Set aside for ten minutes or so. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small-sized bowl, whisk together the remaining 2 1/2 tablespoons soy sauce, one tablespoon sherry, one teaspoon cornstarch, and the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large wok over high heat. Add one tablespoon of vegetable oil and swirl around. When just starting to smoke, add the beef, spreading it out in to one even layer with a wooden spoon. Cook the beef for 20 seconds without touching it. Then stir-fry until the beef is completely cooked, about two minutes. Transfer beef to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining tablespoon of vegetable oil to the wok. With the heat still on high, wait until the oil just begins to smoke, and then add the onions. Stir-fry until they begin to soften, about two minutes. Add the red and green peppers, and cook until they are tender, one to two minutes. Add the beef back in, and then pour in the sauce. Stir well, and cook until sauce has thickened, about 30 seconds. Transfer to a clean plate and serve with white rice.</p>"}]}