{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110329-14479-benedict-rancheros.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Joe Yonan", "recipe newsletter", "Serve Yourself", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Benedict Rancheros", "link": "https://www.seriouseats.com/recipes/2011/03/benedict-rancheros-recipe.html", "description": "A mash up of two great breakfast dishes&mdash;eggs benedict and huevos rancheros, these <strong>Benedict Rancheros</strong> are ideal anytime eating. A corn muffin is topped with a layer of black beans (homemade or store bought, it's your call), poached eggs, and finished with a quick cooked salsa. This is the kind of plate that is ideal for eating alone, comforting and hearty but not all that heavy on the prep.", "totalTime": "30 minutes", "recipeYield": "1", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Eggs", "Vegetarian"], "recipeIngredient": ["1 jalapeño pepper", "1 teaspoon extra-virgin olive oil", "1 small shallot lobe, chopped", "1 clove garlic, chopped", "1 poblano chile, stemmed, seeded, and chopped  ", "1/2 teaspoon ground cumin", "1 cup canned crushed tomatoes in their juices", "1/2 cup water, plus more as needed", "2 eggs", "Kosher or sea salt", "Freshly cracked black pepper", "1 tablespoon finely chopped fresh cilantro leaves", "1/4 cup cooked black beans, preferably homemade, rinsed and drained", "1/4 cup black bean cooking liquid (or water if canned), plus more as needed", "1 corn muffin or square of cornbread "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the stem from the jalapeño and cut in half lengthwise. Scrape out and reserve the seeds, then finely chop the flesh.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a medium skillet over medium heat. When the oil starts to shimmer, add the shallot, garlic, poblano, jalapeño flesh, and cumin and cook, stirring occasionally, until the vegetables are tender, 4 to 6 minutes. Add the tomatoes and water and bring to a boil. Decrease the heat to low and let the mixture gently simmer until it has thickened to a sauce-like consistency, 5 to 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, poach the eggs, keeping them warm by transferring them once they’re poached properly to a bowl of 120˚F water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste the sauce and add more water, if desired. Season with salt and pepper. If it’s not spicy enough, add some of the reserved jalapeño seeds until you reach the desired level of heat. Refrigerate or freeze half of the sauce for another use. Stir the cilantro into the remaining sauce, cover, and remove from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the beans and their cooking liquid into another small, preferably nonstick skillet set over medium heat. Use a potato masher or a large fork to mash the beans, and let them cook until thickened, 3 to 4 minutes. Add a little liquid if necessary to keep them spreadable, and remove from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the domed top of the corn muffin, then cut the muffin in half horizontally. Toast the muffin halves under the broiler or in a toaster oven until golden brown on the cut side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the muffins to a plate, cut side up. Spread half the beans on top of each muffin; top with a poached egg and the ranchero sauce. Crumble the reserved muffin top over the sauce, and eat. </p>\n\n<p><small><strong>Note:</strong> This recipe makes twice as much sauce as you need. Before adding the cilantro, refrigerate half of it in an airtight container for up to 1 week or freeze for several months, and use the extra sauce for more Benedict Rancheros another time, on quesadillas or nachos, or whisked with oil and vinegar for a salad dressing.</small></p>"}]}