{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111119-180027-sunday-brunch-hangtown-fry-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "egg", "Hangtown Fry", "omelettes", "oysters", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Hangtown Fry", "link": "https://www.seriouseats.com/recipes/2011/11/hangtown-fry-oyster-eggs-recipe.html", "description": "Any oyster lover's search to eat more oysters in the morning will inevitably lead them to the Hangtown Fry.  Traditionally this dish is more of a scramble than an omelet, but when I'm cooking an oyster in the morning already, it seems silly to not toss it in some cornmeal and then gently fry it in bacon fat.", "totalTime": "30 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Breakfast and Brunch", "Clams, Mussels, and Oysters", "Omelettes"], "recipeIngredient": ["6 oysters, shucked", "2 tablespoons all-purpose flour", "1 egg, beaten", "2 tablespoons cornmeal", "4 strips bacon", "1/2 red onion, finely chopped", "1 tablespoon butter", "4 eggs, beaten", "kosher salt and cracked black pepper", "sliced scallions (optional garnish)", "sliced cherry tomatoes (optional garnish)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat each oyster in flour, then egg, then cornmeal, and reserve until ready to use.  Fry the bacon over medium heat in large skillet until bacon is fully cooked and brown. Remove and drain on paper towel and once cool enough to handle, coarsely chop.  Add breaded oysters to remaining bacon fat in pan and cook until oysters are just firm and cornmeal begins to brown, about 2 minutes per side.  Remove oysters from pan and reserve.  Add onions to what’s left of the oil in the pan (adding additional vegetable oil if necessary) and cook until soft, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove skillet from heat and carefully wipe with paper towel, or wash completely and place back on heat.  Melt butter over medium heat and season the beaten egg with a pinch of salt and pepper. Once bubbles have subsided, add beaten egg, swirling pan so that egg coats the entire bottom.  When egg has set, but is still a little wet on the top, gently slide onto a large dish or platter.  Scatter bacon, onions and oysters on one side of omelet and gently fold the other half of the omelet across the filling.  Scatter with scallions and serve with buttered toast and Bloody Marys.</p>"}]}