{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/breadsticks.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breadsticks", "parmesan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Browned Butter and Parmesan Grissini", "link": "https://www.seriouseats.com/recipes/2011/11/bread-baking-browned-butter-and-parmesan-gris.html", "description": "As much as I like a freshly baked loaf of bread, I have to admit that crisp breadsticks (grissini) are one of my favorite snacks. You can nibble on them before dinner, with dinner, and after dinner. There's something so satisfying about the crunch. Like pretzels, but without all the extra salt.", "totalTime": "2 hours, 25 minutes", "recipeYield": "Makes 6 dozen grissini", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["2 1/2 cups (11 1/4 ounces) bread flour (divided)", "1 cup water", "2 teaspoons instant yeast", "1 tablespoon sugar", "2 tablespoons unsalted butter", "1 teaspoon salt", "1/2 ounce finely grated parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of you stand mixer, combine approximately 2 cups of the bread flour, the water, yeast, and sugar. Stir to combine, cover, and set aside for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the butter in a small pan until it begins to brown and starts to smell nutty - be careful not to let it burn. Take the pan off the heat and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining flour, along with the cooled butter, salt, and parmesan to the dough in the stand mixer bowl. Knead with the dough hook until the dough is smooth and elastic. Cover and set aside for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300 degrees and flour your work surface. These are easier to roll out if you divide the dough into several pieces. Roll your first piece to 8 inches high 1/8  inch thick, and as wide as it needs to be to reach those other dimensions. With a pizza or pastry cutter - or a sharp knife - trim 1/2 inch off the top and bottom of the dough, and trim the left and right sides to square them off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough vertically in strips about 1/4 inch wide and place the on a baking sheet, leaving room between them. As you place them on the sheet, they're likely to stretch to about 9 inches long - that's fine. You can leave them flat, or if you prefer, twist them into a spiral. Continue rolling and cutting until you have used up all the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until they are lightly browned, crisp, and completely dry - about 25 minutes. Let them cool completely on a rack.</p>"}]}