{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111128eggnogrecipe.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "Christmas", "eggnog", "McDonald's", "milkshake", "shakes", "winter cocktails"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade McDonald's-Style Eggnog Shake", "link": "https://www.seriouseats.com/recipes/2011/12/bravetart-how-to-make-mcdonalds-eggnog-milkshake-at-home-recipe.html", "description": "Feel free to mix in a shot or two of your favorite holiday spirit along with the whipped cream at the end. Add it earlier and you'll prevent the shake from thickening in the ice cream maker.", "totalTime": "7 hours", "recipeYield": "4 shakes", "recipeCategory": ["Ice Cream and Frozen Treats", "Milkshake"], "recipeIngredient": ["12 ounces whole milk", "8 ounces heavy cream ", "1 Tahitian vanilla bean, split and scraped; seeds reserved", "1 cinnamon stick, about 3\" long", "3 whole nutmegs, roughly chopped", "3 ounces egg yolks (from about 5 eggs)", "7 ounces sugar", "3/4 teaspoon salt ", "2 ounces Frangelico", "1/2 Tbsp vanilla extract", "Whipped Cream Mix-In/Topping:", "12 ounces whipped cream", "2 ounces brown sugar", "Optional: 4 Maraschino cherries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the shake base: In a medium pot, bring the milk and cream to a simmer together with the vanilla bean, cinnamon and nutmeg. When the mixture begins to simmer, shut off heat and cover with a lid. Steep for one hour.</p>\r\n\r\n<p>Meanwhile put the egg yolks in a medium bowl and whisk sugar in gradually. It's a lot of sugar, so don't dump it in all at once or it will be difficult to incorporate. Whisk in salt.</p>\r\n\r\n<p>Return dairy to a simmer and fish out the vanilla bean and spices. Use a spatula to scrape out the heavily flavored cream from inside the vanilla pod.</p>\r\n\r\n<p>Now whisk some of the hot cream into the egg yolks, one ladle-full at a time, until egg mixture is quite warm. Then whisk egg mixture into the pot of cream. Turn heat to medium low. Stir constantly with a rubber spatula, making sure to scrape all along the bottom of the pot to avoid curdling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Normally, ice cream recipes entreat you to cook until the mixture is \"thick enough to coat the back of a wooden spoon,\" but with this recipe, that's harder to judge. Instead, cook until a thermometer registers 145&deg; F. When it does, immediately shut off the heat and strain the custard through a sieve and into a large bowl. Stir in Frangelico and vanilla extract. Cool in an ice bath and refrigerate, covered, until thoroughly chilled; about six hours.</p>\r\n\r\n<p>When ready, process chilled ice cream base in ice cream maker just until it begins to thicken. Remember, a proper milkshake is made by blending ice cream with milk; we're cutting straight to the chase by just churning until the base takes on a shake-like texture. Exactly how long this takes will vary from maker to maker, but in my machine that's about 15 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finishing the shake: </p>\r\n\r\n<p>While the shake base is churning, combine the brown sugar and whipped cream in a medium bowl. Whip with a hand or stand mixer on medium speed until the cream holds stiff peaks. Use a rubber spatula to transfer about four ounces to a pastry bag, fitted with a large star tip. Set aside.</p>\r\n\r\n<p>Now shut off the ice cream maker and pour or scoop the thickened base into the bowl of whipped cream. Fold gently with a rubber spatula to combine. If you'd like to add some extra booze, now would be the time.</p>\r\n\r\n<p>Pour the shake into four glasses and top each with a swirl of whipped cream and a Maraschino cherry. Add a straw and enjoy!</p>"}]}