{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111122-pizza-stuffing-diced-knots.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["garlic knots", "holiday recipes", "Italian sausage", "pizza", "stuffing", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pizza-Flavored Thanksgiving Stuffing (or Dressing)", "link": "https://www.seriouseats.com/recipes/2011/11/pizza-flavored-thanksgiving-stuffing-or-dress.html", "description": "From the earliest days of <a href=\"http://www.sliceny.com/\">Slice</a>, <a href=\"http://slice.seriouseats.com/archives/2003/11/leave_those_tur.html\">I've urged you pizza freaks to forgo the crusty, saucy, cheesy stuff on Thanksgiving</a> in favor of gobbling the gobbler. But I know some of you are diehards, so here's a way to sneak our erstwhile favorite dish into the Turkey Day festivities: <strong>Garlic Knot and Sausage Stuffing.</strong> Yes, it's <strong>pizza-flavored stuffing for Thanksgiving.</strong>", "totalTime": "2 1/2 hours", "recipeYield": "serves 5 to 7", "recipeCategory": ["Pizza"], "recipeIngredient": ["1 pound garlic knots (about 18) cut into 3/4-inch dice, about 2.5 quarts", "4 tablespoons butter (1/2 stick)", "3/4 pound hot or sweet Italian sausage", "1 small red onion, finely chopped (about 1 cup)", "1 large green bell pepper, finely chopped (about 1 cup)", "1 clove garlic, minced", "1 teaspoon dried oregano", "16 ounces (2 cups) low-sodium chicken or turkey broth, preferably homemade", "2 small eggs", "1/4 cup minced fresh basil leaves", "Kosher salt and freshly ground black pepper", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position. Preheat oven to 275°F. Spread diced garlic knots evenly over a rimmed baking sheet, and bake until completely dried out, about 50 minutes total, rotating sheet and stirring knots several times during baking. Remove from oven and let cool. Raise oven temperature to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large Dutch oven, melt butter over medium-high heat until foaming subsides (don't allow butter to brown), about 2 minutes. Add Italian sausage and mash with stiff whisk or portato masher to break up into fine pieces (largest pieces should be no greater than 1/4 inch). Cook, stirring frequently until only a few bits of pink remain, about 8 minutes. Add onions, green bell pepper, garlic, and oregano and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk remaining chicken stock, eggs, and basil in a medium bowl until homogeneous. Stirring constantly with wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes and fold gently until evenly mixed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use part of stuffing to stuff bird if desired. To cook remaining stuffing, transfer to buttered 9-inch square baking dish, cover tightly with aluminum foil, and bake until instant read thermometer reads 150°F when inserted into center of dish (about 35 minutes). Remove foil, sprinkle with a handful of Parmesan cheese, and bake until golden brown and crisp on top (about 15 minutes more).</p>"}]}