{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110511-127355-dinner-tonight-asparagus-mushroom-risotto.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Italian", "keywords": ["asparagus", "cheese", "Dinner Tonight", "Italian", "rice", "risotto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Asparagus and Shiitake Risotto", "link": "https://www.seriouseats.com/recipes/2011/05/dinner-tonight-asparagus-and-shiitake-risotto-recipe.html", "description": "I've gotten out of the habit of making risotto all the time for dinner (in fact, it's been well over a year since I've written about the rice dish for this site), but with fresh asparagus in hand from a trip to the farmers' market, I figured I'd reacquaint myself with the Italian classic. I wanted to keep things simple with a dish that showcased the spring bounty without covering it up with needless ingredients. This recipe from <em><a href=\"http://www.epicurious.com/recipes/food/views/Asparagus-and-Shiitake-Risotto-108102\">Gourmet</a>,</em> which pairs asparagus with shiitakes, certainly fit the bill.", "totalTime": "1 hour", "recipeYield": "makes 4 servings", "recipeCategory": ["Asparagus", "Cheese", "Dinner Tonight", "Italian", "Rice", "Vegetarian"], "recipeIngredient": ["5 cups chicken broth ", "1 cup water", "1 pound asparagus, ends trimmed, stalk cut into 1/4-inch thick slices, tips left 1 1/2-inches long", "1 tablespoon olive oil ", "1/2 stick (1/4 cup) unsalted butter", "3/4 pound fresh shiitake mushrooms, stems discarded, caps cut 1/4-inch thick", "1 small onion, chopped", "1 1/2 cup Arborio rice", "1/2 cup dry white wine", "2 ounces (about 1 cup) Parmigiano-Reggiano "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour chicken broth and water into a 4-quart pot. Turn heat to medium-high and bring to a simmer. Add the cut asparagus and cook until bright green and crisp-tender, about three minutes. When done, turn heat down to low and remove asparagus with a slotted spoon and transfer immediately to a bowl of ice water. Let cool completely, then drain and dry asparagus. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one tablespoon of butter to a large heavy-bottomed saucepan set over medium high heat. When melted, add the mushrooms and cook, stirring often, until browned, about four minutes. Season to taste with salt and pepper, then transfer to a bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium, then add two tablespoons of butter to the saucepan. When melted, add the onion and cook, stirring occasionally, until softened, about three minutes. Add the rice, and stir constantly until the rice is chalky, about one minute. Pour in the wine and stir occasionally until it has evaporated, about one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle in one cup of the broth into the saucepan. Stir until it has evaporated, about two minutes. Then add 1/2 cup of broth in at a time, and stir until it has been evaporated. Repeat process until risotto is tender but still al dente, about 18 minutes. You might not need to add all the broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat and add the asparagus, mushrooms, the remaining tablespoon of butter, half of the cheese, and salt and pepper to taste. Stir well, then cover the saucepan and let sit for one minute. Ladle risotto into four bowls and top with remaining cheese. Serve immediately. </p>"}]}