{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111103-127355-dinner-tonight-sichuan-beef-stew.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beef", "Dinner Tonight", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Dinner Tonight: Quick-Seared Sichuan Beef Stew", "link": "https://www.seriouseats.com/recipes/2011/11/quick-seared-sichuan-beef-stew-recipe.html", "description": "I have a strained relationship with beef stew. I understand how it should theoretically taste, but I've just been disappointed too many times. In my mind it should be comforting and warming, but instead I get something dull, grey, and sad. Fortunately, this recipe from Susanna Foo's <em><a href=\"http://www.amazon.com/dp/B001218YVS/?tag=serieats-20\">Fresh Inspiration</a></em> is the opposite. It is slightly spicy, acidic, fragrant, and remarkably quick to prepare.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Beef", "Dinner Tonight", "Pasta"], "recipeIngredient": ["3 pounds beef tenderloin tips (or another tender, quick cooking cut) ", "2 tablespoons vegetable oil, divided ", "4 to 6 star anise pods", "3 dried hot red chiles, stemmed and halved lengthwise ", "3 garlic cloves, sliced", "4 shallots, ends trimmed, skins removed, and halved ", "2 tablespoons fresh ginger, peeled and julienned ", "2 tablespoons grated orange zest", "1/4 cup soy sauce ", "2 tablespoons balsamic vinegar", "2 tablespoons brandy ", "1 tablespoon sugar", "3 scallions, ends trimmed, cut into 1-inch lengths ", "1 pound Chinese noodles, fresh or dried "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim any fat or sinew from the beef, and then cut into 1-inch chunks. Pour one tablespoon of the oil into a large, heavy pot set over high heat. When smoking, add as much of the meat as will fit in one layer. Cook, flipping occasionally, until lightly browned on all sides, three to four minutes. Remove the meat and set aside. Repeat process, adding more oil if needed, until all the beef has been browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return all of the meat to the pot, and add the star anise, red chiles, garlic, shallots, ginger, and orange zest. Cook, stirring occasionally, until shallots are lightly browned, two to three minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the the soy sauce, vinegar, brandy, and sugar. Stir the mixture until the sugar has dissolved. Pour this into the large pot, turn the heat to low, and cook for five minutes. Then pour in one cup of water, stir well, cover, and cook over low heat until the beef is tender, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fill a second pot with water and bring to a boil over high heat. Cook the noodles according to the directions on the packaging, waiting to start cooking them until there are only a few minutes left for the beef to cook. Drain the noodles in a colander.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat, and stir in the scallions. With a pair of tongs, remove the star anise and chiles. Serve with the noodles. </p>"}]}