{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002-nick-malgieri-MarbleCake00008.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["cakes", "Guest Star", "Nick Malgieri", "Nick Malgieri Week", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rum-Scented Marble Cake", "link": "https://www.seriouseats.com/recipes/2011/10/rum-scented-marble-cake-recipe-nick-malgieri.html", "description": "This marble cake is proportioned with more of the white element than the dark:  rather than dividing the base batter in half, I like to remove about a third of it and add the chocolate.", "totalTime": null, "recipeYield": "Makes one 10-inch tube or Bundt cake, about 24 slices", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>Base Batter:</strong>", "2 2/3 cups all purpose flour (spoon flour into dry-measure cup and level off)", "1 2/3 cups sugar", "2 teaspoons baking powder", "1/4 teaspoon salt", "12 ounces (3 sticks) unsalted butter, softened", "7 large eggs", "3 tablespoons dark rum", "&nbsp;", "<strong>Chocolate Batter:</strong>", "2 tablespoons dark rum", "2 tablespoons milk", "1/2 teaspoon baking soda", "6 ounces bittersweet (not unsweetened) chocolate, melted and cooled", "2 cups Base Batter, above"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a rack in the lower third of the oven and preheat to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, sugar, baking powder, and salt in the bowl of an electric mixer.  Stir well by hand to mix and add the butter.  Beat the mixture on low speed with the paddle until the mixture is a smooth, heavy paste, about a minute or two.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the eggs and rum together.  On medium speed, beat a third of the liquid into the flour and butter mixture.  Beat for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop and scrape the bowl and beater.  Beat in another third of the liquid and beat for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat step 4 with the last of the liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the mixer and use a large rubber spatula give the batter a final mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the rum, milk, and baking soda in a medium mixing bowl and whisk well to dissolve the soda.  Scrape in the chocolate and whisk it into the liquid.  Add the 2 cups of base batter and whisk well to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape half the remaining base batter into the prepared pan and smooth the top.  Cover with the chocolate batter, making as even a layer as possible.  Finally top with the remaining base batter and smooth the top.  Use a wide-bladed table knife or a thin metal spatula to marble the batter:  Insert the knife into the batter at the central tube with the wide side of the blade facing you.  Draw the blade through the batter to the bottom of the pan and up and out the side of the pan closest to you, repeating the motion every inch or so around the pan, describing a spiral into the batter, almost as though you were folding egg whites into it. Stop when you get back to the point where you started.  Don’t bother to smooth the top of the batter&mdash;it might disturb the marbling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cake until it is well risen and firm, and a toothpick or a small thin knife inserted midway between the side of the pan and the central tube emerges dry, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the cake in the pan for 5 minutes then invert a rack on it.  Invert and lift off the pan.  Cool the cake completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the cooled cake in plastic wrap and keep it at room temperature.  Freeze for longer storage.  Defrost cake and bring it to room temperature before serving.</p>"}]}