{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110725karenhandpie.jpg", "author": {"@type": "Person", "name": "Karen DeMasco"}, "recipeCuisine": "", "keywords": ["blueberries", "desserts", "hand pies", "Karen DeMasco", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Karen DeMasco's Blueberry Hand Pies", "link": "https://www.seriouseats.com/recipes/2011/07/karen-demascos-blueberry-hand-pies-recipe-picnic-dessert.html", "description": "These tasty hand pies are truly portable&mdash;no cutting, no plate, no silverware necessary, and easy to pack as well.", "totalTime": "3 hours or overnight", "recipeYield": "8 to 10", "recipeCategory": ["Blueberry", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the crust</strong>", "1 cup plus 2 tablespoons all-purpose flour", "2 sticks (8 ounces) cold unsalted butter, cut into small pieces", "1/4 cup plus 3 tablespoons whole wheat flour", "1 tablespoon sugar", "1 teaspoon kosher salt", "1 ounce whole milk", "1 large egg", " ", "<strong>For blueberry filling:</strong>", "1 pint blueberries", "1/4  cup sugar", "1 1/2  teaspoons flour", "Zest of 1 lemon, finely grated with a microplane", " ", "<strong>For egg wash:</strong>", "1 egg", "1 teaspoon water", " ", "<strong>For vanilla glaze:</strong>", "2 cups powdered sugar", "2/3 cup heavy cream", "1/4  teaspoon vanilla extract", "1/4  teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine flour, butter, whole wheat flour, sugar, and salt. Pulse this mixture several times, until the pieces of butter are broken up to pebble size. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together milk and egg. Pour over the flour mixture and pulse again several times until dough begins to come together. Scrape everything into a mixing bowl and push together until it forms one ball of dough. Wrap dough in plastic and roll to a thin square. Chill for several hours, or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dough is chilled, roll it into a large square about 1/8 inch thick. Feel free to dust the dough and the table with extra flour. Using a pizza cutter and a ruler, cut the dough into rectangles (roughly 3 1/2-inches by 2 1/2 inches). Collect scraps and roll out another square, and cut out rectangles. There should be about 20 rectangles of dough. Lay them closely on a baking sheet and chill for at least an hour or more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the filling:</strong> Combine blueberries, sugar, flour, and zest in a saucepan and cook over medium high heat for about 10 minutes, until the blueberries pop and the sauce thickens. Chill filling over ice or in the refrigerator. Do not assemble pies until blueberry mixture is completely chilled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the pies:</strong> Preheat the oven to 375&deg; F. Whisk together one egg with 1 teaspoon water to make egg wash. Cover baking sheet with parchment. Make sure you have a brush, a fork, and a teaspoon for filling on hand. Leave the dough rectangles in the refrigerator, removing only 2 at a time. Place a baking sheet in the refrigerator for the finished pies. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Score one piece of dough with 3 sets of fork pricks&mdash;this is the top. Brush the bottom piece of dough with the egg wash and, straining off any excess liquid, place a rounded tablespoon of blueberry compote lengthwise along the center of the dough. Cover this with the top piece of dough, sealing the top and the bottom with your fingers. Seal one long edge and lift the pie so that the sealed edge is touching the table, like a little pocket or envelope. Tap the blueberry mixture down so that the final edge can be sealed. Lay the pie down and score all edges with the tines of the fork. Place the finished pie on the pan in the refrigerator. Repeat until you have used all of the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point, the pies can be wrapped and frozen or chilled then baked. Bake for 20 to 30 minutes, rotating the pan 90 degrees after 10 minutes, until the pies are golden brown. Meanwhile, make glaze by whisking powdered sugar, cream, vanilla, and kosher salt. When pies are golden brown, immediately move the pies to a cooling rack and spoon glaze over the top.</p>"}]}