{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110824-167109-beer-caramel-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["alchohol", "beer", "caramel", "frozen desserts", "ice cream", "salted caramel", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beer Caramel Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/08/beer-salted-caramel-ice-cream-recipe.html", "description": "Really good caramel ice cream comes from playing chicken with your sugar. Don't let it intimidate you while melting it; the sugar should be the color of dark stained wood. I let it smoke, then slowly count to 3 before plunging in butter and cream. Those last three seconds are where those beautiful smoky flavors develop.", "totalTime": "1 hour (plus an overnight chill)", "recipeYield": "8 to 10 (makes about 1 quart)", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["1 1/2 cups sugar", "2 tablespoons water", "4 tablespoons unsalted butter, cut into small chunks", "2 cups heavy cream", "1 cup whole milk", "6 egg yolks", "8 ounces pale ale", "1 teaspoon kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed saucepan, heat sugar, moistened with two tablespoons of water, on high. Let sugar melt, bubble, and caramelize undisturbed until it reaches a rich, dark amber, rotating the pan to avoid hot spots. Let sugar smoke for 3 seconds, then quickly stir in butter and turn heat to low. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When butter is fully incorporated, slowly stir in cream and milk. Sugar will steam and bubble. If sugar seizes, stir on low heat and it will dissolve completely into dairy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk egg yolks until very well combined. Add about 2/3 cup dairy mixture to yolks one ladle at a time, whisking constantly, then whisk yolk mixture back into saucepan. Cook on low heat, stirring frequently, until custard thickens to coat the back of a spoon and a swiped finger leaves a clean line.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and stir in beer, then add salt in small increments to taste. Custard is well-salted when it has a distinctly sharp flavor, not just burnt sweetness. Strain into a container and chill overnight. The next day, churn according to manufacturer's instructions. Return ice cream to freezer for at least 2 hours so it can firm up.</p>"}]}