{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110210-127355-dinner-tonight-mushroom-torta.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["Dinner Tonight", "Mexican", "Rick Bayless", "sandwich", "tortas", "vegetarian", "Xoco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Dinner Tonight: Roasted Mushroom Torta with Goat Cheese and Black Beans", "link": "https://www.seriouseats.com/recipes/2011/02/roasted-mushroom-torta-with-goat-cheese-and-black-beans-recipe.html", "description": "As this site has already established, some of the <a href=\"http://www.seriouseats.com/2010/12/the-best-sandwiches-in-america-po-boys-roast-beef-pork-slideshow.html#show-128707\">best sandwiches in the country</a> are coming from <strong>Rick Bayless</strong>'s casual newish eatery, <a href=\"http://www.rickbayless.com/restaurants/xoco.html\">Xoco</a>. Occasionally Mexican tortas can feel unwieldy, and unnecessarily messy, but not these.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Mexican", "Sandwiches", "Vegetarian"], "recipeIngredient": ["<strong>For Roasted Mushrooms</strong>", "8 ounces crimini mushroom, stems removed, thinly sliced", "7 ounces shiitake mushrooms, stems removed, thinly sliced", "8 ounces oyster mushrooms, thick stems removed, thinly sliced", "3 tablespoons olive oil ", "6 garlic cloves, thinly sliced", "1 tablespoon fresh lime juice, from about 2 limes", "1 teaspoon salt ", "3 tablespoons cilantro, chopped", "&nbsp;", "<strong>For the Refried Beans</strong>", "2 tablespoons olive oil ", "2 garlic cloves, minced", "one 15-ounce can black beans ", "<strong>For the Torta</strong>", "4 bolillo rolls", "4 ounces goat cheese", "1 ½ cups arugula ", "1 cup salsa "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Roasted Mushrooms: Adjust oven rack to lower middle position and preheat oven to 375&deg;F. Toss mushrooms with olive oil, garlic, lime juice, and salt in medium-sized bowl. Dump into 13 x 9-inch baking dish. Cover with aluminum foil. Place in oven and cook for 10 minutes. Carefully remove foil, and continue roasting until mushrooms are browned, and most of the liquid has evaporated, about 40 minutes. Remove baking dish from oven. Add cilantro to dish and toss well. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Refried Beans: While mushrooms are roasting, pour two tablespoons of oil in 12-inch stainless steel skillet set over medium heat. Add garlic and cook until it just begins to brown, about one minute. Dump in beans and ½ teaspoon salt. Bring to a simmer, and then mash beans with potato masher or back of a large spoon. Keep mashing until they look like mashed potatoes, about 10 minutes. Turn off heat, and cover skillet.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Tortas: Slice rolls in half lengthwise, and remove some of the soft insides. Spread one ounce of goat cheese on cut side of each top half. Spread two tablespoons of refried beans on cut side of each bottom half. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide mushrooms between each bottom half. Place bottom halves on baking sheet and place in oven. Warm them for five minutes. Remove from oven, top each with a handful of arugula, a drizzle of salsa, and top half of roll. Return to baking sheet, and again transfer to oven. Warm for just two minutes. Serve immediately.  </p>"}]}