{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110124-134048-lasagna-with-roasted-cauliflower-ricotta.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Appetite for Reduction", "cauliflower", "Cook the Book", "Isa Chandra Moskowitz", "lasagna", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lasagna with Roasted Cauliflower Ricotta and Spinach", "link": "https://www.seriouseats.com/recipes/2011/01/vegan-lasagna-with-roasted-cauliflower-ricotta-and-spinach-recipe.html", "description": "I decided to see just how well cheese-less lasagna would go over by testing out this recipe for <strong>Lasagna with Roasted Cauliflower Ricotta and Spinach</strong> from <a href=\"http://www.theppk.com/about/\">Isa Chandra Moskowitz</a></strong>'s <em><strong><a href=\"http://www.amazon.com/Appetite-Reduction-Filling-Low-Fat-Recipes/dp/1600940498/serieats-20\">Appetite for Reduction</a></strong></em>.  Moskowitz uses a clever combination of whipped tofu and roasted cauliflower mixed with nutritional yeast and lemon juice to stand in for creamy ricotta.", "totalTime": "1 1/2 hours", "recipeYield": "6", "recipeCategory": ["Cauliflower", "Cook the Book", "Dairy-Free", "Lasagna", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Roasted Cauliflower Ricotta:</strong>", "1 medium-size head cauliflower (11/2 to 2 pounds), chopped into 1/2-inch pieces", "2 teaspoons olive oil", "1/2 teaspoon salt", "1 pound extra-firm tofu", "1/4 cup nutritional yeast flakes", "2 tablespoons freshly squeezed lemon juice", "Several pinches of freshly ground black pepper ", "<strong>For the Red Sauce:</strong>", "One (28-ounce) can crushed tomatoes with basil", "2 tablespoons chopped fresh thyme", "3 cloves garlic, minced ", "1/2 teaspoon salt ", "<strong>To Assemble:</strong>", "8 ounces lasagna noodles, broken in half, cooked in salted water", "1 1/2 cups chopped fresh spinach ", "1/4 cup chopped black olives  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, we’ll roast the cauliflower. Preheat the oven to 400°F. Line a large, rimmed baking sheet with parchment paper; that way the cauliflower won’t stick. Place the cauliflower on the sheet and drizzle the oil over it. Spray it with nonstick cooking spray and sprinkle with 1/4 teaspoon of salt. Toss it with your hands to make sure everything is salted. Spread the cauliflower in a single layer and bake for 10 minutes, then flip it with a spatula. You don’t have to flip each and every one, so don’t get OCD about it. Bake for another 15 to 20 minutes, until lightly browned, tender, and toasty. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, crumble the tofu into a mixing bowl. Use your hands to mash the tofu, squeezing it between your fingers, until it has the consistency of ricotta cheese. Add the nutritional yeast, lemon juice, pepper, and remaining salt. Use a fork to mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cauliflower is done, transfer it to the mixing bowl with the tofu mixture. Use a potato masher to mash it really well, for a minute or so. If it doesn’t seem to be mashing enough with the potato masher, a few pulses in the food processor should get it nice and crumbly. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the sauce, mix all its ingredients together and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Pour a thin layer of red sauce on the bottom of an 8-inch square casserole. Line with a layer of noodles. Spread with one-third of the cauliflower ricotta. Layer with 3/4 cup of spinach leaves. Pour on about a cup of sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat the process one more time, creating another identical layer, starting with the noodles. For the top layer it’s just a little different: Layer with noodles, pour the sauce on first, then layer with ricotta. This layer doesn’t get any spinach. Sprinkle with a layer of olives and press it into the the tofu. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 40 minutes, until the top is browned. You can serve it immediately or let it cool down for a bit first, whatever floats your boat! </p>"}]}