{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-177675-pumpkin-mousse-pie-610x458-32.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Pumpkin Mousse Pie", "link": "https://www.seriouseats.com/recipes/2011/11/pumpkin-mousse-pie-lighter-thanksgiving-dessert-recipe.html", "description": "This is a great alternative to traditional pumpkin pie for those who love the flavor but crave something lighter. The light, crumbly, spicy cookie crust complements the mellow pumpkin flavor and luscious, airy texture perfectly. It's a great finish to a heavy meal.", "totalTime": "12 hours, 24 preferred", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles", "Pumpkin", "Thanksgiving"], "recipeIngredient": ["250 grams butter, softened", "125 grams light brown sugar", "2 eggs", "500 grams all purpose flour", "2 tablespoons powdered ginger", "1/4 teaspoon salt", "1 pint heavy cream, whipped to soft peaks and chilled", "2.5 teaspoons powdered unflavored gelatin", "1/4 cup water", "15 ounces pumpkin puree", "100 grams light brown sugar", "1 tablespoon cinnamon", "1 tablespoon powdered ginger", "1/2 teaspoon freshly grated nutmeg", "1/4 teaspoon ground cloves", "pinch of salt", "3 egg yolks", "Optional: Additional heavy cream for whipping as a garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, cream butter and sugar together with the paddle attachment until they are light and fluffy. Add the eggs one at a time, beating well and scraping down the sides of the bowl after each addition. Add the flour, spices, and salt and mix slowly, until the dough comes together. Double wrap the dough into a tight, round disk in plastic wrap and chill for at least two hours, or ideally, overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Roll out the dough so it is less than 1/4 inch thick, and gently press the dough into the bottom of a pie plate. Allow the edges to come just slightly over the rim of the pie plate. Place the shell in the freezer to chill for 30 minutes or in the fridge if shaping in advance. Trim the edge with a knife or leave as is for a more rustic look. Line the chilled shell with parchment or foil and fill with weights (I re-use dried beans over and over for this purpose) Bake in the preheated oven for 20 minutes, turning halfway through. Remove the weights and liner and bake until the entire crust is golden brown (approximately 10 additional minutes). Allow the crust to chill completely in the pie plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the water in a small bowl and sprinkle the gelatin on top. Set aside and allow the gelatin to bloom. In a small saucepan, combine the pumpkin, sugar, spices, and salt. Stir constantly over medium heat until the mixture becomes thick and smooth and it sputters. Remove from the heat and whisk in the gelatin. Whisk for 1 minute, then move the mixture to the food processor and process for 1 minute. Allow the mixture to cool for 5 minutes, then add the egg yolks one at a time, processing for 5 seconds between each addition. Return the mixture to saucepan and stir constantly until the mixture reaches 160&deg;F. Remove from heat and allow the mixture to cool to just below room temperature over an ice bath, stirring occasionally (if this is too warm, the mixture will not set up properly). Fold in chilled heavy cream that has been whisked to soft peaks, taking care not to deflate the cream. Pour the mousse into the pie shell and place in the fridge to set for at least 6 hours (overnight is best). Serve chilled with whipped cream if desired.</p>"}]}