{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111101-177671-barbacoa-beef-cheek-tacos.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Amanda Hesser", "beef cheeks", "Cook the Book", "Merrill Stubbs", "pickled onions", "taco", "The Food52 Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Barbacoa Beef Cheek Tacos", "link": "https://www.seriouseats.com/recipes/2011/11/barbacoa-beef-cheek-tacos-recipe.html", "description": "For those who are unaccustomed to cheek meat, braising it for tacos does wonders to accessibility because, after all, there's really nothing all that scary about a taco (right?). But odd cuts aside, these beef cheek tacos are pretty incredible. They're marinated in a mole-esque blend of spices, chiles, coffee, and peanut butter with a deep yet mellow spiciness that permeates the cheeks beautifully.", "totalTime": "3.5 hrs", "recipeYield": "6 to 8 (depending on how many tacos each person can eat!)", "recipeCategory": ["Beef", "Cook the Book", "Pickling"], "recipeIngredient": ["<strong>Pickled Onion</strong>", "1 red onion, peeled", "1/4 beet, scrubbed well", "1 handful cilantro leaves", "1 tablespoon salt", "2 tablespoons sugar", "Cider vinegar", " ", "<strong>Barbacoa Beef Cheeks</strong>", "2 1/2 pounds beef cheeks or short ribs", "1 dried ancho chile", "4 garlic cloves, chopped", "1 tablespoon natural peanut butter", "1 teaspoon instant espresso powder", "4 tablespoons olive oil", "1 tablespoon honey", "2 teaspoons ground cumin", "1 teaspoon smoked sweet paprika", "1 handful fresh cilantro, plus more for serving", "1 teaspoon salt", "1 cup chicken or beef broth", "3 limes", "Corn tortillas", "1 avocado, sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the pickled onion:</strong> Slice the onion very thinly and put it in a microwaveable container. Add the beet, cilantro, salt, and sugar. Cover everything with 1 part water to 2 parts vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Microwave for 1 minute, stir, and microwave for another minute. Cool, then refrigerate overnight. The beet will turn the onion a really pretty hot pink color. Remove the beet before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the cheeks:</strong> Clean and trim the beef cheeks. Put them in a container in which you can marinate them.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the stem and seeds from the ancho chile, cut it into chunks, and rehydrate it in a little hot water (I stick it in a ramekin and microwave for 30 seconds).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the ancho chile and soaking water, garlic, peanut butter, espresso powder, 2 tablespoons of the olive oil, the honey, cumin, paprika, cilantro, and salt in a food processor and blend into a paste. Toss the paste with the cheeks, cover, and marinate in the refrigerator for several hours or, better yet, overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When it is time to cook, heat the oven to 275°F and heat the remaining 2 tablespoons olive oil in a Dutch oven over medium heat. Brown the cheeks on both sides. Use the broth to rinse the rest of the marinade into the Dutch oven, then squeeze the juice of the limes in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Braise for 3 1 /2 hours, turning the cheeks over once or twice while they cook. If the liquid dries up, add a bit more broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cheeks are fall-apart tender, use two forks to pull the meat apart in the pan so that it mixes in with all the fatty juicy goodness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Heat 2 tortillas (I like to double-wrap the tacos, as they are juicy). Fill with the barbacoa, a slice of avocado, some of the pickled onions, and some fresh cilantro. Serve and enjoy!</p>"}]}