{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110222-bread-baking-buns-filled.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "buns", "ham", "rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Indiana Cheese Buns", "link": "https://www.seriouseats.com/recipes/2011/02/bread-baking-indiana-cheese-buns-recipe.html", "description": "These buns are meant to be a hot sandwich, and are parbaked until the dough is fully baked but not browned. Then they're cooled and stored so you can heat-and-eat later. I've only tried reheating these in a regular oven, but they'd probably be just fine in a toaster oven, too. Bake until they're brown and the inside should be warm and gooey at the same time.", "totalTime": "3 hours", "recipeYield": "8", "recipeCategory": ["Bread", "Bread Baking", "Ham", "Sandwiches"], "recipeIngredient": ["<em>For the dough:</em>", "9 ounces (about 1 2/3 cups) bread flour", "1 teaspoon salt", "2 tablespoons unsalted butter", "2 1/2 teaspoons instant yeast", " 2 teaspoons sugar", "1/2 cup (1 7/8 ounces) medium rye flour", "1/2 cup instant potato flakes", "1 cup cold water", "Olive oil", "<em>For the filling:</em>", "1/4 pound ham, sliced", "2 ounces cheese, sliced", "8 pickle slices (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put all dough ingredients except water and olive oil into the bowl of your food processor. Pulse several times to distribute ingredients, then leave the processor running. Add the water slowly through the feed tube, as fast as the flour can absorb the water. Leave it running until it forms a ball. Turn off the processor and check the dough for elasticity. It will be sticky. If the dough is not elastic, keep processing in 30-second burst, checking the dough each time. If it begins to feel warm to the touch, let it rest for 5 minutes to cool off before continuing processing. When the dough is sufficiently elastic, remove the dough from the processor, form it into a ball, drizzle with a bit of olive oil, and put it into a bowl. Cover the bowl with plastic wrap and set aside to rise until doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some cornmeal on a baking sheet and preheat the oven to 300 degrees. Yes, 300. When the buns have risen, flour your work surface and turn the dough out. Knead it briefly, then divide it into 8 pieces. Form each into a ball, then flatten each ball into disk. Stretch each disk to about 4 inches in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the filling ingredients in the center of the dough with the meat at the top and bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Then pull up the sides to meet in the center, and press to seal the seams.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the buns seam-side down on the prepared baking sheet. Cover the buns with plastic wrap and set aside to rise, about 35 minutes. When the buns have risen, bake at 300 degrees until the buns are just barely browned, about 40 minutes. Remove the buns from the pan and cool on a rack, then refrigerate or freeze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish baking your par-baked buns, preheat the oven to 350 degrees, and bake the buns until they are nicely browned, about 15 minutes. For your frozen buns, thaw first, then bake.</p>"}]}