{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110524-bread-baking-flatbreads-cooking.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "flatbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Bread Baking: Sesame and Flax Flatbreads", "link": "https://www.seriouseats.com/recipes/2011/05/bread-baking-sesame-and-flax-flatbreads-recipe.html", "description": "Most of the time when I make flatbreads, they're made entirely from white flour. Sure, I add flavors and herbs, but I don't usually don't get too creative with the flour-like components. I don't know why that is. But this time I decided to add flavors via seeds&mdash;flax and sesame.", "totalTime": "90 minutes", "recipeYield": "Makes 8 flatbreads", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["9 ounces (about 1 2/3 cups) bread flour", "2 teaspoons instant yeast", "1 teaspoon salt", "1/4 cup (1 ounce) flax meal", "1/4 cup (1 1/4 ounce) sesame seeds", "1 tablespoon olive oil (plus more for drizzling)", "3/4 cup cool water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, yeast, salt, flax meal, sesame seeds, and olive oil in the bowl of your food processor fitted with the dough blade. Pulse several times until all the ingredients are evenly distributed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the food processor running, add the water in a slow stream, as fast as the flour can absorb it. Continue processing until the dough is smooth, or relatively so. It will be bumpy from the additions, but the dough itself should be smooth and tacky rather than sticky, and it should be elastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a ball, drizzle it with a bit of olive oil to coat the surface, and put the dough into a bowl. cover the bowl with plastic wrap and set aside until doubled, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface lightly. Remove the dough from the bowl and knead it briefly, then divide it into 8 pieces. Form each piece into a ball, then flatten the ball into a disk shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a heavy pan - case iron is ideal - on medium heat. Roll your first disk to about 6 inches in diameter. Place it in the pan and cook on the first side until it begins to brown on the bottom and it begins to bubble and puff, about 1-2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the flatbread over and cook on the second side for another 30-60 seconds until it browns a bit on the second side. It's fine it it's spotty from cooking on the \"bubbles.\" Sometimes you'll have a lot of smaller bubbles, and sometimes the bubbles will combine and the whole flatbread will puff like a balloon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As each flatbread is done, stack them and cover them with a clean kitchen towel to keep them warm as you cook the rest. Serve warm, or cool them and serve at room temperature.</p>"}]}