{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110802-164290-brown-bread-ice-cream.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "desserts", "Dinah Bucholz", "Harry Potter", "ice cream", "The Unofficial Harry Potter Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Brown Bread Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/08/brown-bread-ice-cream-recipe.html", "description": "J. K. Rowling's <em>Harry Potter</em> series is chock full of ice cream references, from Harry's study sessions at Florean Fortescue's Ice Cream Parlour, to the no-melt ice cream sold in Honeydukes sweet shop, to all the times ice cream is scooped up for feasts at Hogwarts. So it's natural <a href=\"http://unofficialharrypottercookbook.com/about-the-author/\">Dinah Buchholz</a> included a hefty section of ice cream recipes in <em><a href=\"http://www.amazon.com/Unofficial-Harry-Potter-Cookbook-Knickerbocker/dp/1440503257/?tag=serieats-20\">The Unofficial Harry Potter Cookbook</a></em>.  The inspiration for these frozen treats is purely British, with flavors including mincemeat, Christmas pudding, tea, and this <strong>Brown Bread Ice Cream</strong>.", "totalTime": "3 hours", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Ice Cream and Frozen Treats"], "recipeIngredient": ["About 4 slices cinnamon bread", "2 cups heavy cream ", "2 cups whole milk", "1 cup packed dark brown sugar", "5 large egg yolks", "3/4 teaspoon rum extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process the bread in a food processor until it turns into crumbs. Measure out 1/2 cup, spread it on a baking sheet, and toast until dark brown but not burned. Cool to room temperature.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cream, milk, and brown sugar in a medium saucepan and cook over medium heat, stirring constantly, until hot but not bubbling. Temper the egg yolks by slowly pouring 1 cup of the hot mixture into the egg yolks while whisking constantly. Pour the egg yolk mixture into the pot while stirring and cook until slightly thickened and steaming, but not bubbling. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture through a sieve and stir in the rum extract.<br />\nCover the surface with plastic wrap to prevent a skin from forming, and cool to room temperature. Chill until very cold, about 6 hours or overnight. Freeze in an ice cream maker according to the manufacturer’s instructions. Add the bread crumbs and churn another 2 minutes before transferring to an airtight container and placing in the freezer.</p>"}]}