{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/2011830-168536-brunch-chicken-black-bean-tamales.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["black bean", "brunch", "chicken", "cinco de mayo", "Sunday Brunch", "tamales"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Chicken and Black Bean Tamales", "link": "https://www.seriouseats.com/recipes/2011/09/chicken-and-black-bean-tamales.html", "description": "Tamales are a staple in many South American countries, and are great for both a filling brunch and a quick snack.  For the filling chicken thighs are simply seasoned and grilled, giving the meat a bit more flavor then the more common braised-to-boiled meat.  Half the black beans are mashed to give the filling some body as well as some whole beans for texture.", "totalTime": "2 hours", "recipeYield": "Makes 10 large tamales", "recipeCategory": ["Beans and Pulses", "Breakfast and Brunch", "Chicken"], "recipeIngredient": ["<strong>Filling:</strong>", "1 1/2 pounds (about 5) boneless skinless chicken thighs", "kosher salt and crack black pepper", "vegetables oil", "1 16-ounce can black beans", "1 teaspoon ground cumin", "&nbsp;", "<strong>Dough:</strong>", "3 1/2 cups masa harina", "1 tablespoon kosher salt", "2 1/4 teaspoons baking powder", "1/2 cup lard", "2-3 cups chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak corn husks in cold water for at least an hour, but no longer than overnight.  Season chicken thighs with salt and pepper, drizzle with oil, and grill until cook over medium high heat until fully cooked, about 15 minutes.  Allow to cool, then shred thighs with your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain black beans and rinse under cold water.  Mix half the beans with the shredded chicken, then using a fork or your hands, mash the remaining beans and combine with chicken mixture.  Add cumin and season to taste with salt and pepper and mix to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make dough:  Mix masa harina, salt, and baking powder until combined.  Incorporate lard into dry ingredients with hands until there are no visible lumps of lard. Add chicken stock 1 cup at a time until dough forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble tamales:</strong> Take two soaked corn husks and overlap them, cupped side up, so that the gathered end of each is facing out.  Place 1/2 cup dough in center of corn husk and using your fingers, press the dough down so that it’s flattened.  Spoon 1/4 cup of filling along the center of dough so that there’s exposed dough along each side of tamale.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the tamale so that the dough surrounds the filling. Fold each end over and then wrap another corn husk around tamale and tie with kitchen twine to secure it.  Repeat with remaining dough and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a pot with water and place tamales in steamer basket.  Bring to a simmer over high heat and steam tamales until dough is cooked and pulls easily away from the wrapper, about 45 minutes.</p>"}]}