{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110504-cinco-de-mayo-recipes-primary-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["cinco de mayo", "Mexican", "quesadilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quesadilla Fritas (Fried Quesadillas) With Pickled Jalapeños, Cilantro, and Chipotle Crema", "link": "https://www.seriouseats.com/recipes/2011/05/quesadilla-fritas.html", "description": "A vegetarian option filled with cheese and jalapeños.", "totalTime": "15 minutes", "recipeYield": "Makes 2 quesadillas, serving 2 to 4", "recipeCategory": ["Cheese", "Mexican"], "recipeIngredient": ["1 chipotle pepper canned in adobo, plus 1 tablespoon adobo sauce", "1/2 cup Mexican Crema, or 3 tablespoons sour cream mixed with 1 tablespoon milk", "Two 8-inch flour tortillas", "4 ounces (1/4 pound) grated Jack, Cheddar, or Oaxacan string cheese", "2 to 3 ickled Jalapeños, finely minced", "2 tablespoons chopped fresh cilantro leaves", "3 tablespoons vegetable oil", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread half of cheese over one half of one tortilla, leaving a small border around the edge. Fold tortilla firmly in half to enclose the cheese. Repeat with remaining tortilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 10-inch nonstick or cast iron skillet over medium heat until shimmering. Carefully add both folded tortillas to skillet and cook, shaking pan gently until first side is golden brown and puffed, 1 to 2 minutes. Carefully fip tortillas with a flexible slotted spatula, sprinkle with salt, and cook on second side until golden brown and puffed, 1 to 2 minutes longer. Transfer to a paper towel-lined plate and allow to rest 1 minutes. Cut each into four pieces, drizzle with chipotle crema, garnish with cilantro, and serve, passing extra crema tableside. </p>"}]}