{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111214-183823-rosemary-and-pine-nut-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cookies", "holiday cookies", "pine nuts", "rosemary", "shortbread cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fine Cooking's Rosemary and Pine Nut Cookies", "link": "https://www.seriouseats.com/recipes/2011/12/fine-cookings-rosemary-and-pine-nut-cookie-shortbread-recipe.html", "description": "Piney rosemary and toasted pine nuts give these shortbread cookies a uniquely Italian feel.", "totalTime": "1 hour 45 minutes", "recipeYield": "makes about 30 cookies", "recipeCategory": ["Cookies", "Desserts", "Nuts"], "recipeIngredient": ["6 3/4 ounces (1 1/2 cups) unbleached all-purpose flour", "1/2 teaspoon baking soda", "1/4  tsp. table salt", "3/4 cup granulated sugar ", "1 1/2 teaspoons chopped fresh rosemary", "1/2  cup pine nuts, toasted", "6 oz. (3/4 cup) unsalted butter, softened at room temperature", "1  large egg ", "1/2 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the flour, baking soda, and salt until well blended, and set aside. In a food processor, pulse the sugar and rosemary until the rosemary is finely chopped. Transfer to a stand mixer fitted with the paddle attachment. Put all but 2 tablespoons of the pine nuts in the food processor and process until finely chopped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the sugar mixture and beat on medium speed until fluffy, about 2 minutes. Reduce the speed to low and add the egg and vanilla; beat until thoroughly combined. Add the chopped pine nuts and then the flour mixture and mix until the dough absorbs the flour and starts to come together. Turn the dough out onto a large piece of plastic and shape it into a log about 2 inches thick and 11 inches long. Refrigerate until firm, 1 to 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and heat the oven to 350°F. Cut the dough into disks between 1/4 and 1/2 inch thick (about 30 cookies). Sprinkle the cookies with the whole pine nuts and gently press in place so they adhere. \u2028Arrange on three baking sheets, spaced about 1 1/2 inches apart. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies one sheet at a time until they’re set and the sides are lightly brown, 10 to 12 minutes. Let cool on the sheet for 10 minutes. Using a spatula, transfer the cookies to a rack and let cool to room temperature, about 1 hour.</p>"}]}