{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110414-127355-dinner-tonight-spiced-shrimp-soup.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["cilantro", "Dinner Tonight", "lemongrass", "shrimp", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Dinner Tonight: Spiced Shrimp Soup", "link": "https://www.seriouseats.com/recipes/2011/04/spiced-shrimp-soup-recipe.html", "description": "I'll be honest and admit that, at first glance, this soup from <a href=\"http://www.epicurious.com/recipes/food/views/Spiced-Shrimp-Soup-12061\">Epicurious</a> looks pretty dull. The dominant color is white, with only a few pink shrimp peeking through the surface&mdash;but this isn't just any old broth. The shells of the shrimp are removed, but not discarded. Instead they're simmered with lemongrass, cilantro, and water, making for a truly fragrant base. The addition of lime and fish sauce adds a bit of balance and a lot of complexity.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Shrimp", "Soups and Stews"], "recipeIngredient": ["4 stalks fresh lemongrass, tough outer leaves discarded, ends trimmed", "1 pound shrimp, shells removed and set aside ", "6 cups water", "¼ cup cilantro roots, well rinsed ", "½ teaspoon salt ", "½ teaspoon black pepper", "1-inch cube fresh ginger, cut into fine strips ", "¼ cup Asian fish sauce ", "¼ cup fresh lime juice ", "1 small red or green Thai chili or serrano, stemmed, seeded, and sliced thinly ", "2 tablespoons cilantro leaves, chopped ", "1 red chili, thinly sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut three of the lemongrass stalks into 1-inch sections. Smash each section with the flat side of a heavy knife. Add to a medium-sized saucepan along with the shrimp shells, water, cilantro roots, salt, and pepper. Turn heat to high and bring to a boil, then reduce heat to low and simmer, uncovered, for 20 minutes. Strain the broth through a fine sieve into a large bowl. Discard all the solids, and pour the broth back into the saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice the remaining stalk of lemongrass. Add it to the broth along with the sliced ginger. Turn heat to high. When starting to simmer, turn heat to low and cook for five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add shrimp, and cook until they are firm, 30 seconds to one minute. Pour in fish sauce and lime juice, and add the sliced chili. If needed, add more salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the soup with fresh cilantro and red chilies (optional). </p>"}]}