{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111005-173863-cookie-cake-pie-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "Cakespy", "CakeSpy Presents Sweet Treats for a Sugar-Filled Life", "cookie dough", "Jessie Oleson", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cookie Cake Pie", "link": "https://www.seriouseats.com/recipes/2011/10/cookie-cake-pie-cakespy-recipe.html", "description": "No need to choose between a slice of cake, piece of pie, or a cookie. You really can have them all with this pie shell full of goodness.", "totalTime": "1 hour", "recipeYield": "12", "recipeCategory": ["Bake the Book", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 batch (about 2 cups) of your favorite cookie dough, homemade or store-bought", "1 unbaked 9-inch piecrust", "1/2 batch of your favorite cake batter, homemade or from a mix", "2 to 3 cups frosting or other topping, such as whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, prepare the cookie dough. If you choose to use the kind that comes in a tube from the supermarket, I promise I will not judge you. Whichever you choose, be sure to bring the cookie dough to room temperature before assembling the pie, so that it will be easier to spread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pie dough in a 9-inch pie plate.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cookie dough on top of the piecrust and, using your fingers or the back of a spoon, spread the dough so that it evenly coats the bottom of the crust. It should be about 1/2 to 3/4 inch thick. You will probably have extra cookie dough; you can use this as you’d like (to stuff cupcakes; to stuff some cinnamon rolls; or to have a delicious cookie dough snack). Set your cookie dough-filled piecrust aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cake batter as specified in your recipe and then pour it directly on top of the cookie dough until the piecrust is about two-thirds filled (the cake will rise, so you want to leave room for it to do so). You will probably have leftover cake batter; you can use this along with your extra cookie dough to make cookie dough-filled cupcakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the filled pie plate on a baking sheet (to catch any drips). To ensure that the sides of the cake don’t bake too fast, gently place a piece of aluminum foil along the perimeter of the pie, leaving the center exposed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put your weighty pie-monster in the preheated oven and bake for 30 minutes. At this point, take the pie out of the oven and remove the aluminum foil; return to the oven and bake for another 15 to 25 minutes, or until the top is domed and golden, and a cake tester comes out mostly clean. Since the types of dough and batter will vary depending on the choices you’ve made, you might want to start checking for doneness after the initial 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool. If the pretty domed top of your pie collapses, don’t despair; it is just more of a void to fill with frosting. Frost generously with your choice of topping. Garnish as desired. I’d like to tell you how long this confection will keep, but mine has never lasted more than a day.</p>"}]}