{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110630-158456-strawberry-goat-cheese-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["chevre", "frozen desserts", "fruit", "goat cheese", "ice cream", "pie", "Scooped", "strawberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Strawberry Dream Pie Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/06/strawberry-dream-pie-goat-cheese-ice-cream-recipe.html", "description": "The goat cheese base for this ice cream is flexible enough for a range of fruits and other flavors. Want to use blueberries instead? This base is lemony enough for them. Prefer brownie chunks with a swirl of dulce de leche? Goat cheese is savory enough to counteract the sweetness. But it's pretty awesome with strawberries, as used here.", "totalTime": "1 1/2 hours, plus an overnight chill", "recipeYield": "Serves 8 to 10 (makes 1 quart)", "recipeCategory": ["Ice Cream and Frozen Treats", "Strawberry"], "recipeIngredient": ["<strong>For graham cracker crumble</strong>", "12 graham crackers, broken into large chunks", "9 tablespoons unsalted butter, melted", "1/4 cup raw (turbinado) or brown sugar", "1/2 to 1 teaspoon kosher salt (to taste)", " ", "<strong>For ice cream</strong>", "8 ounces chevre goat cheese", "1 1/2 cups half and half", "1/2 cup plus two tablespoons sugar, divided", "1/2 teaspoon kosher salt", "1 1/4 cup thinly sliced strawberries (about 3 cups whole)", "1 tablespoon maraschino liqueur (or other fruity liquor)", "1 teaspoon pomegranate molasses (or one teaspoon lemon juice)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For graham cracker crumble</strong>: Preheat oven to 350&deg;F, with a rack in the middle. In a food processor, combine graham crackers, butter, sugar, and salt. Pulse until graham crackers are ground fine but mixture has not formed a paste. Dump mixture onto an aluminum baking sheet and press into a disc 1/4 inch thick. Bake for 15 minutes, until the edges are dark and crisp. Cool completely before crumbling into large chunks. Store crumble in an airtight container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For ice cream</strong>: In a blender, combine goat cheese, half and half, 1/2 cup sugar, and salt. Blend until smooth, then transfer to an airtight container to chill overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, churn ice cream according to manufacturer's instructions. While ice cream is churning, combine strawberries, two tablespoons sugar, maraschino, and pomegranate molasses in a bowl. Let macerate for one hour at room temperature. When ice cream is finished churning, return to airtight container and place in freezer to chill for half an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After an hour in bowl, strain strawberries from remaining liquid, reserving for another use. With a very large spoon or spatula, quickly stir strawberries into ice cream. Berries can break into small chunks, but ice cream should not be uniformly pink. Return to freezer for 1/2 to 1 hour. Serve with graham cracker crumble sprinkled on top.</p>"}]}