{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110626-127355-dinner-tonight-bucatini-ritas-spicy-baby-octopus-sauce.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dave Pasternack", "Dinner Tonight", "octopus", "pasta", "seafood", "The Young Man and The Sea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Bucatini with Rita's Spicy Baby Octopus Sauce", "link": "https://www.seriouseats.com/recipes/2011/06/bucatini-with-ritas-spicy-baby-octopus-sauce-recipe.html", "description": "I've been plotting ways to get more baby octopus in my life. This mission was probably the result of a series of incredible versions of the cephalopod at restaurants recently. They've given me just enough motivation to try my hand at making it at home. Most recipes call for a quick cook over high heat, then toss the octopus with some simple vinaigrette. But I fell in love with this recipe from <strong>David Pasternack's <a href=\"http://www.amazon.com/dp/B002NPCWBA/?tag=serieats-20\"><em>The Young Man &amp; The Sea</em></a></strong> (which SE overlord <a href=\"http://www.seriouseats.com/user/profile/Ed%20Levine\">Ed Levine</a> co-wrote!), which goes the long route&mdash;simmering the octopus for nearly 30 minutes in a tomato sauce.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Other Seafood"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil, plus more for drizzling", "2 garlic cloves, thinly sliced", "4 whole dried arbol chiles", "one 16-ounce can whole peeled tomatoes", "1 pint cherry tomatoes ", "1 ½ pounds baby octopus, cleaned and cut into 2-inch pieces", "salt", "½ teaspoon freshly ground black pepper ", "1 pound dried bucatini ", "¼ cup flat-leaf parsley, roughly chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot with water a bring to a boil. Meanwhile, pour the three tablespoons of olive oil into a large saucepan set over medium heat. When shimmering, add the garlic and chiles. Stir often and cook until garlic turns golden brown, two to three minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the canned and fresh tomatoes, along with the octopus, 1/2 teaspoon salt, and the black pepper. Bring to a boil, and then reduce heat to a simmer, partially cover, and cook for 20 minutes. Stir occasionally and break up tomatoes with a fork. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the lid, turn heat to medium-high, and cook until the sauce thickens and the octopus is tender, about seven minutes. Turn off heat when done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As soon as you remove the cover from the saucepan, add the bucatini to the large pot of boiling water. Cook for one minute less than the packaging suggests. When done, drain pasta in a colander, and then add it to the saucepan with octopus sauce. Toss until the pasta is well coated in the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divided the pasta between four plates. Garnish with parsley, season with salt, and drizzle with a little extra-virgin olive oil. </p>"}]}