{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110310-smokedmozzarellapizza.jpg", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "jams", "mozzarella", "onions", "pizza", "radicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat For Eight Bucks: Smoked Mozzarella Pizza with Radicchio and Onion Jam", "link": "https://www.seriouseats.com/recipes/2011/03/eat-for-eight-bucks-smoked-mozzarella-pizza-with-radicchio-and-onion-jam-recipe.html", "description": "Making pizza at home becomes <strong>a great vehicle for leftovers.</strong> I've found some of my most creative and interesting topping combinations by simply dumping a few Tupperware containers on top, adding a lot of cheese, and hoping for the best.", "totalTime": null, "recipeYield": "2-4", "recipeCategory": ["Eat for Eight Bucks", "Pizza"], "recipeIngredient": ["1 medium Spanish onion, halved and thinly sliced", "2 tablespoons unsalted butter", "2 tablespoons sugar", "1/4 teaspoon salt", "1/4 cup white wine", "1 tablespoons white wine vinegar", "1 medium head radicchio, cut into ½ inch thick wedges", "3 tablespoons olive oil", "1 large ball pizza dough", "1/3 pound smoked mozzarella, shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the jam: Combine the onion, butter, sugar, and salt in a small saucepan with a lid. Saute over medium-low heat, covered, for 20 minutes, stirring occasionally. Uncover, add the wine and vinegar and continue to cook over medium heat, stirring slightly more frequently, until there is no liquid left and the onions are soft and caramelized, about 25 minutes. Let the jam come to room temperature, then transfer to an airtight container and keep in the fridge for up to 3 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the radicchio: Adjust oven rack to middle position and preheat oven to 450°F. Toss the radicchio with 2 tablespoons of olive oil and season with salt and pepper. Arrange on a parchment-lined baking sheet and roast in the oven until wilted and cooked through, about 15 minutes. Set aside. (This can be done 1 day ahead). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise the oven heat to 500°F. Divide the pizza dough in half and roll or stretch each into thin disks. Brush the dough with the remaining olive oil. Sprinkle the cheese over the pizzas, dot with onion jam, and arrange the radicchio on top. Bake in the oven for about 10 minutes, until the pizzas are crusty. Cut into slices, or serve each individually on plates.     </p>"}]}