{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111005-173870-tiffany-bonbon-cookies-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "bonbons", "Cakespy", "CakeSpy Presents Sweet Treats for a Sugar-Filled Life", "Cookies", "Jessie Oleson"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tiffany &amp; Co. Bonbon Cookies", "link": "https://www.seriouseats.com/recipes/2011/10/tiffany-co-bonbon-cookies-cakespy-recipe-engagement-party-cookies.html", "description": "Designed to mimic that iconic blue box, these little bonbons open up to their own surprises, a center filled with chocolate, coconut, or chopped nuts.", "totalTime": "30 minutes", "recipeYield": "12 to 14 cookies", "recipeCategory": ["Bake the Book", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the cookies:</strong>", "1/2 cup (1 stick) butter, softened", "3/4 cup confectioners’ sugar, sifted", "2 teaspoons vanilla extract", "1 1/2 cups all-purpose flour  ", "1/4 teaspoon salt", "1 to 2 tablespoons heavy cream or milk (optional)", "Food coloring in blue, yellow, and green", "&nbsp;", "<strong>For the filling:</strong>", "Choose your own adventure: I like chocolate chips, \u2028chopped nuts, or coconut", "&nbsp;", "<strong>For the icing:</strong>", "1 cup confectioners’ sugar", "2 tablespoons heavy cream or milk ", "Food coloring in blue, yellow, and green (do not use gel \u2028food coloring)", "Pearl sugar or white sprinkles, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 350&deg;F. Line a baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an electric mixer, beat together the butter, confectioners’ sugar, and vanilla until light and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, sift together the flour and salt. Slowly add the dry mixture to the sugar mixture, pausing to scrape down the sides of the bowl as needed. If your dough is too dry, add a teaspoon or two of milk or cream until it is easier to handle. Add the food coloring, mixing until no swirls of color are left. Note: to attain the perfect “blue box” color, I’ve found that 3 parts blue, 1 part green, and a dot of yellow coloring make a perfect faux-Tiffany hue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an ice cream scoop or large spoon, wrap spoonfuls of dough around the filling of your choice, making sure that it is completely contained by dough. Form into balls about 1 1/2 inches in diameter.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dough balls one inch apart on the baking sheet and bake for 12 to 15 minutes, or until the cookies have a dull finish on top. If you’re not sure about doneness, lift one cookie up; the bottom should be lightly golden, not brown. Remove cookies from the oven and cool completely before frosting.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the icing. Mix the confectioners’ sugar with just enough cream so that the icing is thick but still easily stirred. If desired, add food coloring to match or complement the cookies’ hue.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn each cookie upside down and carefully dip the top of it into the icing. Immediately after dipping, sprinkle with your desired garnish.</p>"}]}