{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110721-161900-chicken-tomatillo-chile-sauce-primary.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Mexican", "keywords": ["braise", "chicken", "chiles", "Mexican", "piloncillo", "Spice Hunting", "spices"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken with Tomatillo and Red Chile Sauce", "link": "https://www.seriouseats.com/recipes/2011/07/chicken-with-tomatillo-and-red-chile-sauce-for-tacos-enchiladas-chilaquiles-recipe.html", "description": "Piloncillo takes extremely well to spicy sauces flavored with dried chiles, as well as to the juicy tartness of tomatillos. This is my go-to chile sauce for recipes like tacos, enchiladas, and chilaquiles. Use it with or separately from the chicken that braises in it (the recipes makes extra sauce, which can be frozen and used later).", "totalTime": "3 hours", "recipeYield": "Serves 6", "recipeCategory": ["Braising and Stewing", "Chicken", "Mexican"], "recipeIngredient": ["1/4 cup oil", "2 large onions, sliced", "6 cloves garlic, miced", "2 teaspoons cumin ", "2 ancho chiles, stemmed and seeded", "1 guajillo chile, stemmed and seeded", "2 chipotle chiles in adobo sauce, seeded", "1/2 teaspoon cinnamon", "1 1/2 pounds tomatillos, husked and quartered", "3 pounds chicken legs and thighs, on the bone, skin-on", "1 cup water", "3 to 4 tablespoons grated piloncillo (or other raw sugar), to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy Dutch oven, heat oil on medium high heat. Add onions and stir to coat with oil. Fry until onions start to brown, stirring frequently, about ten minutes. Add garlic and fry one minute longer. Stir in cumin, chiles, and cinnamon, and fry for thirty seconds or until spices are fragrant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatilos, chicken, water, and several large pinches of salt (better to err on too much than too little here). Bring mixture to a boil then reduce to a low simmer. Cover with a tight-fitting lid and simmer for one hour, until chicken is very tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take pot off heat and remove chicken pieces and let cool for ten minutes. Remove skin and shred off the bone, leaving chicken in large chunks. Red fat will have risen to surface of pot; skim off most but leave some in for flavor. Using a stick or bar blender, pur&eacute;e sauce until very smooth, straining through a fine-mesh sieve. Add piloncillo and additional salt to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with chicken submerged in sauce alongside a stack of tortillas, or use for tacos, enchiladas, or chilaquiles. </p>"}]}