{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110919-127677-LTE-Orange-Kiss-Me-Primary.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cakes", "Let them eat cake", "orange"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange Kiss-Me Cake", "link": "https://www.seriouseats.com/recipes/2011/09/let-them-eat-orange-kiss-me-cake.html", "description": "Reserve the peeled oranges from the candied orange peel section of this recipe and use them for the juice for the glaze. Depending on how juicy the oranges are, you may need to supplement with additional fresh-squeezed or store-bought orange juice.", "totalTime": "2 hours, 30 minutes", "recipeYield": "12", "recipeCategory": ["Cakes", "Orange"], "recipeIngredient": ["<strong>For the Candied Orange Peel:</strong>    ", "3 navel oranges, scrubbed (See Notes)", "2 cups sugar", "1 1/2 cups water", "1/2 cup bittersweet chocolate chips", "2 teaspoons dark corn syrup", "   ", "<strong>For the Cake:</strong> ", "Baking spray", "1 cup walnuts, coarsely chopped", "1 cup golden raisins", "1 medium-sized navel orange, scrubbed and cut into 1-inch pieces", "2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 cup sugar", "4 ounces (1 stick) unsalted butter, at room temperature", "2 large eggs, at room temperature", " 3/4 cup buttermilk, at room temperature", "   ", "<strong>For the Glaze:</strong>   ", "1 cup orange juice (See Notes)", "1/2 cup sugar", "1/2 teaspoon pure vanilla extract", "1/8 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the candied orange peel:</strong> Line 2 baking sheets with parchment paper.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a sharp paring knife, trim off ends of oranges, then score lengthwise into quarters. Remove the peels and, with a back-and-forth motion, scrape off excess pith. Slice each piece lengthwise into 1/4-inch thick strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place orange strips in medium heavy-bottomed saucepan and cover with cold water. Bring to boil over medium-high heat and boil for 1 minute. Drain orange strips and repeat process 2 more times. On the third draining, set the orange strips aside in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1 1/2 cups sugar and water in now-empty saucepan and bring to a boil over medium-high heat, stirring until sugar is completely dissolved. Add the orange peels and reduce heat to medium-low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer orange strips until tender, about 15 minutes. Using a slotted spoon or spider, transfer orange strips to one of the prepared baking sheets and cool completely, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate and corn syrup in medium bowl and microwave until smooth and melted, 1 to 2 minutes, stopping microwave to stir chocolate every 20 seconds. One at a time, dip half of the cooled orange strips about halfway into the melted chocolate and arrange them in a single layer on the second prepared baking sheet. Place in freezer until set, 5 to 10 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss remaining orange strips in remaining 1/2 cup sugar; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cake:</strong> Adjust oven rack to middle position and preheat oven to 350°F. Spray 13- by 9-inch baking pan with baking spray. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In food processor, pulse walnuts and raisins until coarsely chopped; transfer to medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process orange pieces in now empty food processor until ground to a pulp. Stir into nut-raisin mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together flour, baking powder, baking soda, and salt in medium bowl; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, beat sugar and butter on medium speed until light and fluffy, 2 to 3 minutes. Add eggs, one at a time, beating well after each addition. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce speed to low and add flour mixture in three batches, alternating with buttermilk, scraping down sides and bottom of bowl with rubber spatula as needed. Add orange-nut-raisin mixture and beat just until combined, about 20 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan and bake until cake tester inserted in center of cake comes out clean, 30 to 35 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cake to cooling rack set over parchment paper. Cool cake in pan 10 minutes then invert onto cooling rack. Turn cake dome-side up and cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the glaze:</strong> While cake is cooling, combine orange juice, sugar, vanilla, and salt in medium heavy-bottomed saucepan and bring to boil over medium-high heat. Reduce heat to medium and simmer until thickened and reduced to 1/2 cup, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush sides and top of cake with warm glaze and continue to cool cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top cooled cake with chocolate-dipped and sugar-coated candied orange strips and serve.</p>"}]}