{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110705-159856-grilled-corn-and-quinoa-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "corn", "Latin Grilling", "Lourdes Castro", "quinoa", "salad", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Grilled Corn and Quinoa Salad", "link": "https://www.seriouseats.com/recipes/2011/07/grilled-corn-and-quinoa-salad-recipe.html", "description": "If you haven't already jumped on the quinoa bandwagon, this <strong>Grilled Corn and Quinoa Salad</strong> from <a href=\"http://www.lourdes-castro.com/Lourdes-Castro/Lourdes.html\">Lourdes Castro</a>'s <em><a href=\"http://www.amazon.com/Latin-Grilling-Patagonian-Yucatecan-Barbecue/dp/1607740044/?tag=serieats-20\">Latin Grilling</a></em> is a great place to start. Sweet, tart, fresh, and nutty, this one of those great salads that is equally delicious hot, cold, or room temperature, making it ideal picnic take-along material.", "totalTime": "30 minutes", "recipeYield": "serves 8", "recipeCategory": ["Cook the Book", "Corn", "Dairy-Free", "Grilling", "Quinoa", "Salads", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["5 ears corn, husks on but silks removed ", "4 green onions, roots and tops trimmed", "2 cups quinoa, well rinsed", "3 1/4 cups water", "Salt", "4 plum tomatoes, cored, seeded, and diced ", "1 cup lightly packed cilantro leaves and tender stems, chopped", "Juice of 3 limes (about 1/4 cup)", "2 tablespoons olive oil", "Black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Soak the corn:</strong> Place the corn in a large stockpot, or other container large enough to hold all the ears, and fill it with water. If you do not have a sufficiently large container, use your kitchen sink. Allow the corn to soak for 20 minutes. Remove from the water, shake, and tightly squeeze the husks against the kernels of corn to get rid of any excess water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Grill the corn:</strong> Heat your grill to high (550&deg;F) and close the lid. Wait at least 15 minutes before lowering the heat to medium-high (450&deg;F) and continuing. Place the corn on the grill rack, close the lid, and grill for 5 minutes. Turn the corn over and grill for another 5 minutes with the lid closed. Remove from the grill and let rest for 5 more minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Pull back the husks and char the corn:</strong> Take the grilled ears of corn and pull back the husks, exposing the kernels. Do not remove the husks. If possible, tie the husks back.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the grill temperature to high (550&deg;F). Place a sheet of aluminum foil on one side of the hot grill. Place the pulled-back husks over the foil, allowing the exposed kernels to sit on the grill grates. (This is done so the husks don’t burn before the corn can char.) Close the grill lid and allow the kernels to char for about 5 minutes per side, or until they become dark and golden brown on all sides. At this point, add the green onions to the grill and char on all sides, about 8 minutes total. Remove the corn and green onions from the grill and set aside. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the quinoa:</strong> Put the quinoa, water, and 1 teaspoon salt in a saucepan. Bring to a boil, cover, and lower to a simmer. Cook for 15 minutes. Uncover and check if the quinoa is ready by tilting the pan to the side to make sure all the water has been absorbed. If not, continue cooking for a few minutes more. Transfer the cooked quinoa to a large bowl and allow to cool at room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Toss and dress the salad and serve:</strong> Cut the corn kernels off the cobs, slice the grilled green onions, and add both to the quinoa. Toss in the tomatoes and cilantro and mix well. Drizzle the lime juice and olive oil over the salad and season with salt and pepper to taste. Toss well before serving. </p>"}]}