{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111221-be-all-end-all-chicken-soup.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Kosher", "keywords": ["Arthur Boehm", "chicken soups", "Cook the Book", "Geila Hocherman", "hanukkah", "Kosher Revolution"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kosher Revolution's Be-All, End-All Chicken Soup", "link": "https://www.seriouseats.com/recipes/2011/12/kosher-revolutions-be-all-end-all-chicken-sou.html", "description": "What makes <em><strong><a href=\"http://www.amazon.com/Kosher-Revolution-Techniques-Recipes-Unlimited/dp/1906868530/?tag=serieats-20\">Kosher Revolution</a></strong></em>'s chicken soup the <strong>Be-All, End-All</strong> of all chicken soup recipes? It might have something to do with the nine pounds of meat that goes into the slow simmered stock.", "totalTime": "3 hours", "recipeYield": "12", "recipeCategory": ["Chicken", "Cook the Book", "Kosher", "Soups and Stews"], "recipeIngredient": ["4 medium parsnips, peeled and cut into 1/2-inch dice", "4 medium celery stalks, cut into thirds", "3 leeks, white parts only, well cleaned", "1 medium onion, unpeeled, quartered", "2 bouquets garnis (2 crushed garlic cloves, 1 bay leaf, 1/2 bunch dill, 1/2 bunch flat-leaf parsley, and 4 peppercorns divided among two squares of cheesecloth, knotted to enclose) ", "Two 1/2-pound pieces flanken", "One 4- to 5-pound stewing chicken, cut into eight parts, rinsed, any excess fat removed ", "3 pounds chicken legs, wings, bones and backs, any combination, rinsed, any excess fat removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large stockpot, combine the parsnips, celery, leeks, onion and<br />\nbouquets garnis. Place the flanken on top and top with all the chicken.<br />\nAdd cold water to cover by 1 inch. Bring to a boil slowly over medium<br />\nheat, 45 to 60 minutes. Reduce the heat and simmer for 1 hour, skimming to remove any surface solids every 10 minutes. Simmer another hour, skimming every 20 minutes, and transfer the breast to a medium bowl. Simmer, skimming as needed, for 11/41/4 hours more. With tongs or a slotted spatula, carefully remove the remaining chicken and the flanken and transfer to the bowl. (Reserve the chicken, skinned and boned, for chicken salad, or return to the soup.)<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fill the sink with cold water and add ice. Place a large<br />\nclean pot in the sink. Line a colander or strainer that fits over the pot<br />\nwith a double layer of cheesecloth. Carefully ladle the soup through the<br />\ncheesecloth, trying not to disturb the ingredients at the bottom of the<br />\ncooking pot. When only a little soup remains, carefully tilt the pot to<br />\npour it off. (Discard the pot ingredients.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Allow the soup to cool to room temperature and transfer to the<br />\nrefrigerator to chill. Remove any solidified fat from the soup and serve,<br />\nor freeze in a tightly sealed plastic container.</p>"}]}