{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/Char-Kway-Teow.jpg", "author": {"@type": "Person", "name": "Malaysia Kitchen for the World"}, "recipeCuisine": "", "keywords": ["Asian", "Malaysian", "noodle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sponsored Recipe: Char Kway Teow", "link": "https://www.seriouseats.com/recipes/2011/09/sponsored-recipe-char-kway-teow.html", "description": "Malaysia Kitchen for the World is hosting the ultimate street food celebration: the first-ever Malaysia Noodle Festival, on 9/27 at Chelsea Triangle in NYC. The Malaysia Noodle Festival will showcase the astonishing variety of classic Malaysian noodle dishes, from Laksa...", "totalTime": "20 minutes", "recipeYield": null, "recipeCategory": ["Malaysian Kitchen"], "recipeIngredient": ["2 to 3 tablespoons cooking oil", "1 tablespoon crushed garlic cloves", "8 ounces (about 1 cup) shelled and deveined shrimp or thinly sliced chicken", "2 tablespoons double black, thick, or sweet soy sauce", "2 tablespoons regular soy sauce", "1 teaspoon finely pounded white peppercorns, or ½ teaspoon finely ground white pepper", "½ to ¾ teaspoon sugar (use less if using thick or sweet soy sauce)", "6 to 8 ounces Chinese flowering cabbage (choy sam) or Chinese mustard greens (gai choy) or Chinese cabbage (bok choy), stalks and leaves separated and rinsed to remove dirt and stones", "14 ounces fresh, flat rice noodles, already cut or cut into ½\" wide strips, rinsed in cold water to remove excess oil or dried hor fun noodles, cooked and drained", "2 eggs, beaten", "1 1/2 cups (4½ ounces) bean sprouts, rinsed or blanched (scald in boiling water for 1 minute, drain, and rinse with cold water)", "<strong>For the Spice Paste:</strong> ", "6 whole dried red chilies, steeped in hot water for 5 to 8 minutes and then deseeded; or 1 to 1½ tablespoons of cili boh; or ½ to ¾ tablespoon bottled sambal oelek ", "Optional: 1½ to 2 teaspoons dried shrimp paste (belacan), toasted at 400°F for 15 minutes (see page xx); or whole dried shrimps, soaked in hot water for 5 to 8 minutes till soft, then drained ", "1/4 cup water ", "<strong>Garnish:</strong> ", "⅓ cup sliced Chinese chives (kuchai) or spring onions ", "1 or 2 fresh red chilies (Fresno, jalapeno, Serrano, cayenne, Thai, or cherry), sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Process Spice Paste ingredients to a smooth paste. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in a wok or skillet and sauté garlic for about ½ to 1 minute, till light brown and fragrant. Add Spice Paste and remaining oil and sauté for about 4 to 5 minutes, till fragrant (adding more oil if necessary)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add shrimp or chicken and stir-fry for 3 minutes (or 6 minutes for chicken), till cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Stir in soy sauces, white pepper, sugar, and Chinese mustard green stalks, and stir for about 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add noodles and coat well with sauce for about 1 minute. Add Chinese mustard leaves, cover, and cook for about 1 minute, till greens start to wilt. Uncover, push noodles towards edge of skillet/wok, add a little oil in center, add beaten egg and let set 1 to 2 minutes, then lightly scramble the egg till cooked and blend with noodles so egg coats noodles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss in the bean sprouts, blend well and stir for another minute or two. (Don't overcook, as noodles will get mushy if cooked too long.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish with Chinese chives and chilies and serve hot.</p>"}]}