{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110323-one-big-table-cover-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chard", "Cook the Book", "Molly O'Neill", "One Big Table", "recipe newsletter", "taco", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tacos de Acelgas", "link": "https://www.seriouseats.com/recipes/2011/03/tacos-de-acelgas-recipe.html", "description": "Molly O'Neill's One Big Table is filled with all sorts of unexpected recipes, like these Tacos de Acelgas, Swiss chard tacos from a cattle ranch country in Texas. When thinking about dinner on a cattle ranch so close to the...", "totalTime": null, "recipeYield": "8", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["3 pounds fresh tomatoes, peeled and seeded", "1 or 2 garlic cloves", "4 tablespoons corn oil, plus additional for frying", "Kosher salt and freshly ground black pepper", "1 pound fresh red or white chard, washed and chopped", "1/2 cup chopped onion", "1 teaspoon minced garlic", "32 corn tortillas (6-inch size works best)", "3 ounces crumbled cotija cheese or shredded Monterey Jack (about 3/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 200°F. Line a baking sheet with paper towels. Place a wire rack over another baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pur&eacute;e the tomatoes and garlic in a blender or a food processor. If necessary, add up to 1/2 cup water to facilitate blending.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil in a large skillet over medium heat. Add the pur&eacute;e, season with salt and pepper to taste, and bring to a simmer. Cook until thick, about 25 minutes, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While tomato pur&eacute;e is reducing, fill a large pot with water and bring to a boil. Add the chard and cook for 10 minutes, until tender. Drain thoroughly.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil in a medium skillet over medium heat. Add the onion and cook, stirring occasionally, until translucent. Add the chard and minced garlic, and season with salt and pepper. Cook for 10 to 15 minutes, stirring occasionally, until the filling is very dry and well flavored. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap 8 tortillas at a time in a clean, damp kitchen towel. Heat them in the microwave for 1 1/2 to 2 minutes on high, until they are steamy and pliable. Remove 1 tortilla from the bundle and lay out flat. (Keep the rest well wrapped in the towel.) Fill the tortilla with 1 to 2 tablespoons of the chard and roll up tightly. Place the taco on a baking sheet, with the curved edge of the tortilla underneath. Dampen, warm, fill, and shape the remaining tortillas into tacos in this fashion.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/2 inch oil in a large skillet over medium-high heat until hot but not smoking. Place the tacos one by one in the hot oil, with the curved edge still underneath. Fry for 1 to 2 minutes, then gently turn over with tongs and fry the other side about 1 minute, until crisp. Remove from the oil and drain on the paper towel–lined sheet pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all the tacos on a serving platter, pour the warm tomato pur&eacute;e over the top, and sprinkle with the cheese.</p>"}]}