{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110524-152956-prawns-leaves-and-limes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Thai", "keywords": ["Asian", "Cook the Book", "fish sauce", "greens", "lemongrass", "Nigel Slater", "prawns", "seafood", "shrimp", "stir fry", "Tender", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Prawns, Leaves, and Limes", "link": "https://www.seriouseats.com/recipes/2011/05/prawns-leaves-and-limes-recipe.html", "description": "This five-minute stir-fry is full of the sort of punchy, sour flavors that you'd find in a bowl of <a href=\"http://en.wikipedia.org/wiki/Tom_yum\">tom yum</a> soup.  Matchsticks of ginger and rounds of lemongrass are browned with scallions and chiles. The shrimp are thrown in with a mix of fish sauce, lime juice and sugar. It's ideal for those evenings when you're craving something a bit out of the ordinary, flavor-wise but don't really feel like spending an hour-plus on it. On the table in just about 20 minutes and served with a bowl of steamed rice, these prawns will beat the pants off Thai takeout any day.", "totalTime": "20 minutes", "recipeYield": "2", "recipeCategory": ["Cook the Book", "Shrimp", "Stir Frying", "Thai"], "recipeIngredient": ["5 ounces Chinese greens", "A thumb-sized piece ginger ", "A large stalk lemongrass  ", "2 small hot red chiles", "2 green onions", "2 tablespoons peanut or vegetable oil", "1 pound large raw prawns", "3 1/2 tablespoons lime juice", "3 1/2 tablespoons nam pla (Thai fish sauce)", "2 teaspoons sugar", "A large handful of cilantro leaves", "A large handful of basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Do the prep first, because everything happens quite quickly once you start cooking. Wash the leaves and remove any tough stems. Peel the ginger, then grate it or cut it into small, matchstick-like shreds. Remove the tough outer leaves of the lemongrass and very finely shred the tender heart. Finely chop the chiles, removing the seeds if you prefer cooler spicing. Finely shred the green onions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the oil in a wok or shallow pan. Add the ginger, lemongrass, chiles, and green onions and stir-fry for a couple of minutes, until the ginger starts to color. Drop in the prawns. As they turn opaque and color lightly, add the lime juice, nam pla, and sugar. When all is sizzling and fragrant, add the greens, turning them over in the pan as they start to wilt and darken. As soon as they are tender, add the cilantro and basil leaves and serve immediately.</p>"}]}