{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110420-127677-Serious-Sweets-Strawberry%20Dream-Step%201.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cakes", "desserts", "Serious Sweets", "spring", "strawberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Strawberry Dream Cake", "link": "https://www.seriouseats.com/recipes/2011/04/strawberry-dream-cake-recipe.html", "description": "Notes: Please note that you will need 6 egg yolks for the cake component of this recipe, but only 4 egg whites for the meringue component. Discard the additional 2 egg whites or reserve them for another use. I used...", "totalTime": "3 hours, 45 minutes", "recipeYield": "8 to 10", "recipeCategory": ["Cakes", "Fruit Desserts", "Strawberry"], "recipeIngredient": ["4 large egg whites (see Notes)", "2 cups sugar", "4 cups freeze-dried strawberries (see Notes)", "2 pounds frozen strawberries", "2 teaspoons grated lemon zest plus 3 tablespoons lemon juice", "6 large egg yolks (see Notes)", "12 tablespoons unsalted butter, cut into 12 pieces and softened", "1 cup plus 2 tablespoons all-purpose flour", "3 tablespoons cornstarch", "1 1/2  teaspoons baking powder", "3/4 teaspoon baking soda", "3/4 teaspoon salt", "1 tablespoon milk", "1 1/2  teaspoons vanilla extract", "1 teaspoon unflavored gelatin", "2 tablespoons water", "4 tablespoons cream cheese, softened", "1/4 cup confectioners’ sugar", "1 cup heavy cream, chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper middle and lower middle positions. Preheat oven to 250°F. Use bottom of 9-inch round cake pan to trace 2 circles on 2 sheets of parchment paper. Turn parchment over and place one on each of 2 rimmed baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat egg whites with electric mixer fitted with whisk attachment until they loosen, about 1 minute. Increase speed to medium-high and beat until soft peaks form, about 3 minutes. Slowly add 1 cup sugar and continue beating until stiff, glossy peaks form, 2 to 3 minutes more. Fold in 2 cups freeze-dried strawberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread half of meringue over one traced circle. Repeat with remaining meringue over second traced circle. Bake until meringues are lightly colored and completely dried out, about 90 minutes, switching pans halfway through baking. Transfer to cooling racks and cool completely on sheets, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook frozen strawberries and additional 1/4 cup sugar in medium saucepan over medium-high heat, stirring and smashing berries until thickened, about 30 minutes--mixture should cook down to 2 cups. Stir in 1 tablespoon lemon juice. Transfer to bowl and cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower top oven rack to middle position and increase oven temperature to 350˚F. Spray 2 9-inch round cake pans with baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place yolks, remaining 3/4 cup sugar, butter, flour, cornstarch, baking powder, baking soda, 1/2 teaspoon salt, and lemon zest in food processor and pulse until combined. Add remaining 2 tablespoons lemon juice, milk, 1 teaspoon vanilla, and remaining freeze-dried strawberries and pulse just until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter equally between prepared pans, spreading evenly. Bake until cake tester comes out clean when inserted in center of cakes, 15 to 20 minutes. Transfer cakes to cooling racks and cool in pans 10 minutes, then invert onto racks and cool completely, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine gelatin and water in small bowl. Microwave until gelatin dissolves, about 20 seconds. Cool to room temperature, about 5 minutes. Place cream cheese, confectioners’ sugar, remaining 1/2 teaspoon vanilla, and dissolved gelatin in mixing bowl and, with electric mixer fitted with whisk attachment, beat on medium-high speed until whippy, about 2 minutes. Add the cream and beat just until thickened, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one meringue round, flat-side up, on cake plate. Spread with 1/4 cup strawberry jam and top with one cake round. Spread cake with additional 1 cup strawberry jam and whipped cream on top. Top with second cake. Spread cake with remaining 1/4 cup strawberry jam, then top with second meringue round, textured side-up. Chill 30 minutes, then serve. Cake keeps refrigerated for up to 3 days.</p>"}]}