{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110325-144229-lemon-and-goat-cheese-ravioli.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fresh pasta", "goat cheese", "lemon", "pasta", "Plenty", "ravioli", "turmeric", "vegetarian", "Yotam Ottolenghi"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lemon and Goat Cheese Ravioli", "link": "https://www.seriouseats.com/recipes/2011/04/lemon-and-goat-cheese-ravioli-recipe.html", "description": "This recipe for <strong>Lemon and Goat Cheese Ravioli</strong> is one of the most vibrant recipes in <em>Plenty</em>, both visually and taste-wise. The fresh pasta dough includes both <strong>turmeric and lemon zest, hence the bright, beautiful yellow.</strong>  Once rolled out (surprisingly simple thanks to Ottolenghi's food processor dough method) it's stuffed with soft, mild goat cheese given a little kick from red and black pepper.", "totalTime": "2 hours", "recipeYield": "serves 4, as a starter", "recipeCategory": ["Cook the Book", "Lemon", "Pasta", "Vegetarian"], "recipeIngredient": ["<strong>For the pasta dough:</strong>", "3 tablespoons olive oil", "3 medium eggs", "11 1/2 ounces (about 2 3/4 cups) “00” pasta flour, plus extra for rolling ", "1/4 teaspoon ground turmeric", "Grated zest of 3 lemons", "Semolina", "<strong>For the filling:</strong>", "11 ounces soft goat cheese ", "1/3 teaspoon Maldon sea salt", "Pinch of chile flakes", "Black pepper", "1 egg white, beaten ", "<strong>To finish:</strong>", "2 teaspoons pink peppercorns, finely crushed", "1 teaspoon chopped tarragon", "Grated zest of 1 lemon", "Grapeseed oil", "Lemon juice (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pasta dough. Whisk together the oil and eggs. Put the flour, turmeric and lemon zest in a food processor, add the oil and egg mixture and blend to a crumbly dough. It might require extra flour or oil. Once the dough has come together and is smooth (you may need to work it a little by hand), divide it into four thick, rectangular blocks. Wrap them in plastic wrap and chill for at least 30 minutes, or up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust a work surface with flour. Take one piece of dough and flatten it on the floured surface with a rolling pin. Set your pasta machine to the widest setting and pass the dough through. Repeat, narrowing the setting by a notch each time, until you get to the lowest setting. When each sheet is rolled, keep it under a moist towel so it doesn’t dry out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling. Combine the filling ingredients, apart from the egg white, in a bowl and crush together with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a pastry cutter or the rim of a glass to stamp out roughly 3-inch discs from the pasta sheets. To shape each raviolo, brush a disc with a little egg white and place a heaped teaspoon of filling in its center. Place another pasta disc on top. Dip your fingers in flour, then gently press out any air as you seal the edges of the two discs together. You should end up with a pillow-shaped center surrounded by an edge that is just under 3/8 inch wide. Seal the sides of the edges together firmly until you can’t see a seam where the two discs meet. As they are made, place the ravioli on a dish towel or tray sprinkled with semolina. Leave to dry for 10 to 15 minutes. (You can now cover the tray with plastic wrap and keep the ravioli in the fridge for a day.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, bring a large pan of salted water to the boil. Cook the pasta for 2 to 3 minutes, or until al dente. Drain and divide among four plates. Sprinkle with pink peppercorns, tarragon and lemon zest. Drizzle grapeseed oil over the ravioli and around them, sprinkle with extra salt and a squirt of lemon juice, if you like, and serve at once.<br />\n</p>"}]}