{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110601-154240-strawberry-balsamic-thyme-jam-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["balsamic vinegar", "Jam", "Preserved", "strawberries", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Strawberry Balsamic Thyme Jam", "link": "https://www.seriouseats.com/recipes/2011/06/strawberry-balsamic-thyme-jam.html", "description": "This jam is insanely delicious; equal parts sweet and sophisticated. The balsamic vinegar adds depth of flavor and brings out the juicy, sunny taste of the strawberries. And the thyme, oh the thyme! It provides an addictive, lemony, herby essence....", "totalTime": "", "recipeYield": "Makes eight (8-ounce) jars", "recipeCategory": ["Condiments and Sauces", "Edible DIY", "Strawberry"], "recipeIngredient": ["7 cups granulated sugar", "5 cups crushed strawberries (about 8 cups of stemmed, hulled, and sliced strawberries)", "1/4 cup best quality balsamic vinegar", "1 tablespoon minced fresh thyme leaves", "One (1.75-ounce) package regular powdered fruit pectin", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve jam, prepare jars and lids: place 8 half-pint jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure 7 cups of granulated sugar into large bowl. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine crushed strawberries, balsamic vinegar, and thyme in a large, heavy saucepan or stockpot. Whisk in pectin until dissolved. Bring mixture to a full rolling boil over high heat, stirring constantly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar all at once. Stir until dissolved. Stir in butter. Stirring constantly, return mixture to a full rolling boil. Boil hard for one minute. Remove pot from heat and skim off any foam from surface of jam. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}