{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111115-173081-gftues-greenbean-2.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "Gluten-Free Tuesday", "green beans", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gluten-Free Green Bean Casserole", "link": "https://www.seriouseats.com/recipes/2011/11/gluten-free-green-bean-casserole-recipe.html", "description": "Created by Campbell's in 1955, the original recipe uses canned green beans and canned cream of mushroom soup. While de-glutening the recipe, I replaced the canned soup with an easy-to-make white sauce and chopped mushrooms.", "totalTime": "about one hour", "recipeYield": "6", "recipeCategory": ["Christmas", "Gluten-Free", "Gluten-Free Tuesday", "Legumes", "Sides", "Thanksgiving"], "recipeIngredient": ["<strong>For the Fried Onions</strong>", "3 tablespoons cornstarch", "3 tablespoons white rice flour", "1 medium onion, sliced into thin strips", "<strong>For the Casserole</strong>", "Vegetable oil for frying", "Salt, to taste (optional)", "3 tablespoons olive oil, divided", "1 small onion, finely diced", "8 ounces white button mushrooms, finely chopped (approximately 3 cups)", "1 clove garlic, minced or put through a garlic press", "2 cups milk, divided", "2 tablespoons cornstarch", "1 (16-ounce) bag frozen French-cut green beans, thawed and drained or 16-ounces fresh green beans, cleaned, trimmed, and cooked until tender", "1/8 teaspoon ground thyme", "Salt and pepper, to taste", "1/4 cup grated Parmesan cheese, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Onions: In a large zip-close bag, combine cornstarch and white rice flour. Add onions and shake bag to combine. Remove onions from bag; shake off any excess flour.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large heavy-bottomed skillet (cast iron works best) with 1/2 inch of vegetable oil. Heat oil over medium-high heat until hot and shimmering. (To test your oil, drop one onion slice into it. The onion should sizzle when it hits the oil. If it doesn't, the oil is not hot enough.) Fry a handful of onions, about 4- 5 batches, until golden brown and crispy. (Don't crowd the pan while frying. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove onions from oil using a slotted spoon. Place on paper towel-lined plate to drain. If desired, season with salt to taste. Repeat with remaining onions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the casserole: Preheat oven to 350ºF.  In a medium saucepan, heat 2 tablespoons of olive oil over medium-high until shimmering. Add onion and garlic. Sauté until soft, stirring frequently. Add mushrooms and remaining tablespoon of olive oil. Cook until mushrooms are soft and tender, stirring  frequently, about three minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 3/4 cups of milk and thyme. Bring to a boil. Once the mixture boils, combine remaining 1/4 cup of milk and two tablespoons cornstarch. Stir vigorously with a fork to combine milk and cornstarch.  Quickly whisk in cornstarch. Allow to boil for 45 seconds. Remove from heat. Reduce heat to low. Allow to simmer for three minutes. Salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Add green beans, stir to combine. Pour into a 1 1/2-quart casserole dish. Top with half the grated Parmesan cheese. Cover with foil. Bake for 30 minutes. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove foil. Sprinkle fried onions and remaining cheese over the top of casserole. Return to oven until bubbling and lightly golden brown, about seven minutes.</p>"}]}