{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111006-dt-pasta-with-smothered-cauliflower-and-saffron.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["anchovies", "cauliflower", "Dinner Tonight", "Lidia Bastianich", "pasta", "quick", "saffron"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Pasta with Smothered Cauliflower and Saffron", "link": "https://www.seriouseats.com/recipes/2011/10/pasta-with-smothered-cauliflower-saffron-recipe.html", "description": "cauliflower is all potential: what is the whitest, blandest option on the crudite platter becomes deep and nutty when it's cooked with plenty of heat. In the best cauliflower pasta recipes, anchovies make an appearance, usually early on so they melt and disappear into the sauce, leaving only a nutty essence behind. This recipe from <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/1400040361/serieats-20\">Lidia's Italy</a></em> also brings in the classic Italian combination of pine nuts and raisins, along with the mellow, unmistakable flavor of saffron.", "totalTime": "30", "recipeYield": "4", "recipeCategory": ["Cauliflower", "Dinner Tonight", "Pasta"], "recipeIngredient": ["1 medium head cauliflower, 1 1/2 − 2 pounds, cored and cut into 1-inch pieces", "1/8 teaspoon saffron", "1/3 cup olive oil, plus more for drizzling", "1 medium onion, finely chopped", "3 small anchovy fillets, minced", "1/4 cup golden raisins", "1/4 cup pine nuts", "3/4 pound short dry pasta, such as gemelli", "8 large basil leaves", "1/2 cup grated pecorino cheese for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil and add the cauliflower pieces.  Cook until softening but not yet tender, 3-4 minutes, then remove with a slotted spoon or spider to a bowl.  Ladle 1/2 cup of the hot water into a small bowl and add the saffron threads to soak.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) skillet, heat the olive oil over medium heat until shimmering.  Add the onion and cook until soft and beginning to brown, then stir in the anchovy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking until the onions are golden and the anchovy has melted into the sauce, then add the saffron water, blanched cauliflower, raisins, and pine nuts.  Bring the liquid to a boil and cook until the cauliflower is tender and the liquid has evaporated enough to allow the vegetables to caramelize.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, drop the pasta into the boiling water and cook until al dente. Reserve 1 cup of pasta water before draining. Add the pasta to the skillet and toss to coat, then cook for a few minutes to bring the flavors together.  If the dish is dry, add a little pasta water to loosen the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide into bowls and top with the basil and pecorino cheese.  Drizzle with olive oil and serve immediately.</p>"}]}