{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110815-127677-LTE-Roll-Step.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["desserts", "icebox cakes", "Let them eat cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cake Roll with Honey Semifreddo", "link": "https://www.seriouseats.com/recipes/2011/08/let-them-eat-cake-roll-with-honey-semifreddo-cake-recipe.html", "description": "Peel away the layers of my delicate and complex soul and you'll discover cheap sequins and over-processed junk food near the core. Attempting a balancing act between my bipolar desires, I made a gussied-up Twinkie. Twinkie gets a makeover! Twinkie goes to prom! Here's what I did: for the springy sponge-like exterior of the cellophane-wrapped snack I substituted an orange-flavored, fluffy chiffon cake. The filling is a meringue-based semifreddo sweetened with honey and speckled with toasted sesame seeds", "totalTime": "3 hours 30 minutes", "recipeYield": "6 to 8", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Cake:</strong>    ", "Baking spray", "1 cup plus 2 tablespoons sifted cake flour (see Notes)", "3/4 cup sugar", "1 1/2 teaspoons baking powder", "3 large egg yolks, at room temperature ", "1 tablespoon finely grated zest and 6 tablespoons juice from 2 oranges", "1/4 cup vegetable oil", "2 teaspoons pure vanilla extract", "4 large egg whites, at room temperature", "1/2 teaspoon salt", "1/4 teaspoon cream of tartar", "1/3 cup confectioners’ sugar  ", "&nbsp;  ", "<strong>For the Honey Semifreddo:</strong>    ", "1 cup granulated sugar ", "1/4 cup water", "1/4 cup honey", "1/4 teaspoon ground cardamom", "4 large egg whites, at room temperature", "1/4 teaspoon salt", "1/4 teaspoon cream of tartar", "1/4 cup toasted sesame seeds", "&nbsp;  ", "<strong>For the Tahini Caramel Sauce:</strong>    ", "1 cup packed light brown sugar ", "1/4 cup water", "2 tablespoons light corn syrup", "1/2 cup whipping cream", "6 tablespoons sesame tahini ", "2 tablespoons unsalted butter, cut into 2 pieces", "1/4 teaspoon salt", "2 tablespoons toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cake,</strong> adjust oven rack to middle position and preheat oven to 325°F. Lightly coat jelly roll pan with baking spray. Line with parchment paper and lightly coat with baking spray.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift sifted cake flour, 1/2 cup sugar, and baking powder. Sift mixture once again and place in large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whisk egg yolks, orange zest, orange juice, oil, and vanilla until smooth. Add to flour mixture and whisk together until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In separate, clean, dry mixing bowl, whip egg whites, salt, and cream of tartar with whisk attachment on medium speed until soft peaks form, about 2 minutes. Increase speed to medium-high and gradually add remaining 1/4 cup sugar; continue whipping until stiff peaks form, 1 to 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir 1/3 of egg whites into cake batter until thoroughly combined. With rubber spatula, gently fold in remaining egg whites.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan and spread out evenly. Bake until top of cake is pale golden and lightly springs back when you press down on it, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While cake bakes, dust clean, dry kitchen towel with confectioners’ sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a knife around edges of just-baked cake. Turn cake over onto prepared towel. Starting at the short end, roll cake <strong>in towel</strong> and place seam-side down on cooling rack. Cool completely, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the semifreddo:</strong> While cake cools, stir sugar, water, honey, and cardamom in heavy-bottomed medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 240°F on candy thermometer, 7 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While syrup boils, place egg whites, salt, and cream of tartar in a clean, dry mixing bowl. Whip egg whites, salt, and cream of tartar with whisk attachment on medium speed soft peaks form, about 2 minutes. Slowly and carefully, start pouring the hot syrup in, with the machine still running. Beat the mixture until the outside of the bowl is cool to the touch and the whites are thick and glossy, about 7 minutes. Fold in sesame seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble:</strong> Unroll cake, leaving it on towel. Spread cake with semifreddo, leaving a 1/2-inch border on all sides. Slowly and gently roll the cake, this time without the towel, starting at the short end. Place the cake, seam-side down on a baking sheet and freeze until filling is firm, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sauce:</strong> Stir sugar, water, and corn syrup in heavy-bottomed medium saucepan over medium-low heat until sugar dissolves. Increase the heat to medium-high and let syrup boil until deep amber in color, about 8 minutes. Remove pan from heat and whisk in cream, tahini, butter, and salt. Return pan to heat and cook, stirring,  just until sauce is smooth, 1 to 2 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm caramel sauce before serving. Drizzle over cake and sprinkle with toasted sesame seeds. Slice and serve immediately.</p>"}]}