{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110509-151195-french-toast-with-shaved-apples-and-bacon-beer-brats.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Chef Shack", "Cook the Book", "food trucks", "French toast", "Heather Shouse", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: French Toast with Shaved Apples and Bacon Beer Brats", "link": "https://www.seriouseats.com/recipes/2011/05/french-toast-with-shaved-apples-bacon-beer-brats.html", "description": "<a href=\"http://chefshack.org/\">Chef Shack</a> sets up shop at various farmers' markets around Minneapolis each weekend and <strong>French Toast with Shaved Apples and Bacon Beer Brats</strong> is one of their biggest morning sellers. Slices of hearty multigrain bread are dipped into an eggy brown sugary batter, fried crisp, served with salty links of <a href=\"http://www.fischerfamilyfarmspork.com/index.html\">Fischer Farms</a> bacon beer brats and topped with slivers of crisp-tart apples.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Cook the Book", "French Toast"], "recipeIngredient": ["4 eggs ", "1 cup whole milk", "3 tablespoons brown sugar", "1 teaspoon freshly grated nutmeg", "1 teaspoon ground cinnamon", "1 teaspoon ground cardamom", "1/4 teaspoon vanilla extract", "Pinch of sea salt", "12 slices multigrain bread, sliced 1/2 inch thick", "4 bacon beer brats or pork sausage links", "2 tart-sweet apples (Pink Lady or similar variety), cored and cut into matchsticks or small slivers", "1/4 cup maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the eggs in a large mixing bowl.  Add the milk, brown sugar, nutmeg, cinnamon, cardamom, vanilla, and salt and stir well to combine.  (If you have one, use an immersion blender to emulsify all the ingredients.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the bread slices in the egg mixture until saturated.  Meanwhile, split each sausage link down the middle, almost cutting it in half but not severing it.  Brown the sausages on a griddle or in a frying pan over medium-high heat.  While the sausages are cooking, heat a deep fryer to high or heat a lightly oiled griddle or frying pan over medium-high heat.  Fry the bread until both sides are deep brown.  Plate 3 slices of French toast with 1 sausage link, top with a pile of apples, and drizzle the entire thing with 1 tablespoon of maple syrup.  Repeat the with remaining ingredients.</p>"}]}