{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110719-dt-pasta-with-shrimp-and-baby-zucchini.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Chicago", "Dinner Tonight", "pasta", "shrimp", "spaghetti", "Spiaggia", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Linguine with Shrimp and Baby Zucchini", "link": "https://www.seriouseats.com/recipes/2011/07/linguine-with-shrimp-and-baby.html", "description": "<strong>Spiaggia</strong> is one of Chicago's most famous restaurants, known for a wonderful Italian cuisine and surpassing attention to detail (like a tradition of making every risotto to order, rather than par-cooking it halfway like most restaurants).  So I was interested to flip through their cookbook and see what, if anything, would be possible to pull off in under an hour with a small number of ingredients. Cookbooks from four-star restaurants are often full of dishes with so many ingredients and steps it's hardly a weeknight project, but this one was fairly simple while feeling four-star.", "totalTime": "25", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pasta", "Shrimp", "Zucchini"], "recipeIngredient": ["3/4 pound spaghetti or linguine", "2 tablespoons olive oil", "2 cloves garlic, chopped", "1 pound shrimp, shelled and deveined", "1/2 cup thinly sliced baby zucchini (or subsitute half-moons of regular zucchini)", "2 cups fish stock", "Salt and pepper to taste", "1/4 cup unsalted butter, cut into small pieces", "4 fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil.  Cook pasta until 2 minutes shy of al dente.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat olive oil in a large (12-inch) skillet over medium heat until shimmering. Add garlic and cook until fragrant and beginning to color, about 30 seconds, then add shrimp and cook until lightly browned on one side, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the shrimp over and add the zucchini to the pan. Saute until shrimp is cooked and zucchini just loses its bite but is not mushy, 1-2 minutes more.  Transfer the shrimp and zucchini mixture to a plate to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the fish stock to the skillet, turn the heat to high, and reduce by at least half, until beginning to thicken. Season with salt and pepper.  Add the pasta to the skillet and continue cooking until the pasta is al dente and has married with the sauce, then toss with the butter.  Add the shrimp and zucchini back to the skillet and season again with salt, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide among bowls, top with basil leaves, and serve immediately.</p>"}]}