{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110413-chocolate-bread-baked-loaf-horiz.jpg", "author": {"@type": "Person", "name": "Liz Gutman"}, "recipeCuisine": "", "keywords": ["breads", "chocolate", "david lebovitz", "Serious Chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Bread", "link": "https://www.seriouseats.com/recipes/2011/04/chocolate-bread-david-lebovitz-recipe.html", "description": "This is my twist on a David Lebovitz's recipe. The resulting crumb is somewhat denser and crumblier than ordinary bread, but the taste is really fantastic, and goes well with a hot cup of tea or a cold glass of...", "totalTime": "5 hours (including rising times)", "recipeYield": "10 to 12", "recipeCategory": ["Chocolate", "Yeast Bread"], "recipeIngredient": ["3/4 cup soy milk, slightly warmed (not over 110ºF)", "1 envelope (1/4 oz) active dry yeast", "6 tablespoons sugar, divided", "4 tablespoons coconut oil or vegetable shortening", "3 ounces bittersweet or semisweet chocolate, chopped", "1 large egg", "1/2 teaspoon vanilla extract", "1 teaspoon salt", "2 cups bread flour", "1/4 cup unsweetened Dutch-process cocoa powder", "1/2 cup dark chocolate chips, or coarsely chopped bittersweet or semisweet chocolate", "1/4 cup milk chocolate chips, or coarsely chopped milk chocolate", "1/4 cup cocoa nibs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl or the bowl of a stand mixer, combine the soy milk and 1 tablespoon of the sugar and stir to dissolve.  Sprinkle the yeast over the liquid, give it a gentle stir, and set aside until it begins to foam, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt the butter and chocolate in the microwave, microwaving for 15 seconds, then stirring, and continuing in 5-10 second bursts alternated with stirring until melted.  You can also use a bowl set over a saucepan of simmering water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the yeast is frothy, mix in the remaining sugar, the egg, vanilla, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in half the flour and cocoa powder, then the melted chocolate and butter, then the rest of the flour mixture, and stir until well-incorporated.  Mix vigorously with a spatula or a wooden spoon for five minutes, until smooth.  If using a stand mixer, attach the dough hook and beat for five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl loosely with plastic wrap or with a damp paper towel and allow to rise in a warm place for 2 hours.  It will be about double its original size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9\" loaf pan.  Stir the chocolate and nibs (if using) into the dough; it may be a little stiff, in which case just knead it as you would regular bread dough: fold it in half over on itself, give it a quarter turn, and repeat.  Stir/knead for 2 minutes, then gather the dough into a ball and place it seam-side down in the prepared pan.  Pat down the dough until it's even, and allow to rise in a warm place for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350ºF.  Bake the loaf for 35-40 minutes, or until it appears done and sounds hollow when thumped; or its internal temperature reaches 180ºF.  Allow to cool completely in pan.</p>"}]}