{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111107-178497-braised-chicken-with-sweet-onions.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "chicken thighs", "Cook the Book", "Mario Batali", "Molto Batali"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Braised Chicken with Sweet Onions and Parmigiano", "link": "https://www.seriouseats.com/recipes/2011/11/braised-chicken-with-sweet-onions-parmigiano-recipe.html", "description": "When making this <strong>Braised Chicken with Sweet Onions and Parmigiano</strong> from <a href=\"http://www.mariobatali.com/about_mario.cfm\">Mario Batali</a>'s latest cookbook, <em><strong><a href=\"http://www.amazon.com/Molto-Batali-Simple-Family-Meals/dp/0062095560/?tag=serieats-20\">Molto Batali</a></strong></em>, the house filled up with a very familiar and very French aroma. Coq au vin. It's sort of Mario's Italian accented take on coq au vin.", "totalTime": "45 minutes", "recipeYield": "8 to 10", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["16 chicken thighs, bone in and skin on", "Salt and freshly ground black pepper", "8 ounces pancetta, cut into ¼-inch cubes", "4 leeks, white and pale green parts only, sliced into ¼-inch-thick rounds, rinsed thoroughly, and drained ", "10 medium red onions, halved and sliced into thin half-rounds ", "8 cups chicken stock", "¼ cup all-purpose flour", "1 cup dry red wine, such as Sangiovese di Romagna", " 1 cup whole milk", "8 slices Tuscan or other country bread", "¼ cup extra virgin olive oil", "1 cup freshly grated Parmigiano-Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Season the chicken thighs with salt and pepper. Place them, skin side down, on an oiled broiler pan so that they are not touching one another. Place the pan under the broiler and cook until golden, 10 to 12 minutes. Then flip and cook until dark golden brown on the skin side, 8 to 10 minutes. Remove, and cool, skin side up, on the broiler pan or on a platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large, heavy-bottomed pot, heat the pancetta over medium-low heat until the fat is rendered and the pancetta is crisp. Using a slotted spoon, transfer the pancetta to a plate lined with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the leeks and onions in the pancetta fat and cook over medium-low heat until wilted and soft. Then raise the heat to medium-high and cook, stirring occasionally, until a rich brown color, about 20 minutes. While the vegetables are cooking, bring the chicken stock to a high simmer in a saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour to the onion mixture and stir until smooth. Cook for 15 minutes over medium heat, stirring frequently. Add the wine, milk, and stock, and bring to a boil, stirring constantly. Lower the heat and cook at a brisk simmer for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken thighs into the onion mixture, along with the juices that have collected, and bring to a boil. Lower the heat and simmer until the chicken is just cooked through and the juices run clear, 12 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, preheat the broiler. Place the slices of bread on a cookie sheet and toast them under the broiler. Drizzle with the olive oil, and place 1 toast in each warmed soup bowl. Place 2 thighs atop each piece of toast, and ladle ¼ cup of the onion mixture over each thigh. Sprinkle with the pancetta and Parmigiano, and serve.</p>"}]}