{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111027-dt-steak-salad-with-wilted-arugula.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "salad", "steak", "steak salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Steak Salad with Balsamic and Wilted Arugula", "link": "https://www.seriouseats.com/recipes/2011/10/steak-salad-with-balsamic-and.html", "description": "Little\"rags\" of beef (to make this more economical) are quick-sauteed, their residual heat wilting the arugula just enough to take away some of its raw bite. <a href=\"http://www.seriouseats.com/user/profile/Maggie%20Hoffman\">Maggie</a> likes to add mushrooms and calls it an Italian version of stir-fry.", "totalTime": "20", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Salads"], "recipeIngredient": ["4 tablespoons olive oil, plus more as needed", "2 small shallots, cut into ribbons", "4 cloves of garlic, sliced", "1 sprig rosemary, leaves removed and chopped", "3 cups sliced mushrooms, preferably porcini, trumpet, or chantarelles", "salt and pepper", "1 pound steak, cut crosswise into thin slices", "2 tablespoons good balsamic vinegar, plus more for garnish", "6 ounces baby arugula, washed well", "Shaved parmesan, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (14-inch) skillet, heat 2 tablespoons of the olive oil over medium until shimmering.  Add the shallots, garlic, and rosemary and cook until translucent.  Add the mushrooms, season with salt and pepper, and cook until soft and beginning to caramelize.  Scrape the mushroom mixture into a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining two tablespoons of olive oil to the pan and heat over high until shimmering.  Add the beef slices, season with salt, and spread out onto a single layer (work in batches if there's not enough room). Cook until there's no visible red.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the mushroom mixture to the pan to heat through, then add the balsamic vinegar, tossing well to coat. Season to taste with salt and pepper. Off the heat, add the arugula, tossing until just starting to wilt, then transfer to plates.  Top with shards of shaved Parmesan and more balsamic vinegar, if desired.</p>"}]}