{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110506-149852-white-chocolate-mint-ice-cream.JPG", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["frozen desserts", "ice cream", "mint", "pomegranate molasses", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Scooped: White Chocolate Mint Ice Cream with Pomegranate Molasses", "link": "https://www.seriouseats.com/recipes/2011/05/white-chocolate-mint-ice-cream-pomegranate-molasses-recipe.html", "description": "<strong>White chocolate, of course, isn't chocolate.</strong> It's comparisons to the dark stuff that so frequently disappoint tasters. So let's step past the unfortunate comparisons and consider white chocolate on its own terms. Once you get by the whole chocolate malapropism, white chocolate's flavor is pretty awesome: a buttery vanilla with strong hints of mint and other leafy herbs.", "totalTime": "2 1/2 hours, plus an overnight chill", "recipeYield": "Serves 8 to 10 people", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["2 cups whole milk", "1 cup heavy cream", "1 large bunch mint leaves, removed from stems", "6 egg yolks", "1/2 cup sugar", "1/2 teaspoon kosher salt", "7 ounces white chocolate, chopped fine (recommended: Trader Joe’s or Godiva)", "1/4 cup pomegranate molasses, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a three-quart saucepan, heat milk and cream to just below a simmer. Remove from heat and add mint leaves. Steep leaves for 1 1/2 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk together egg yolks and sugar until thick, lemony in color. Yolks will fall in ribbons from whisk. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove mint leaves and return pan to medium-low heat. Whisk in yolk mixture, white chocolate, and salt, stirring constantly until mixture is smooth. Stir until custard coats the back of a spoon and a finger swipe leaves a clean line. Strain into an airtight container and efrigerate overnight, or at least 6 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, churn in ice cream machine according to manufacturer's instructions. Serve as soft serve with 1 to 2 teaspoons of pomegranate molasses, or refrigerate 2 to 3 hours until ice cream firms up. Defrost on counter 10 minutes before serving, to allow ice cream to soften.</p>"}]}