{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110619-127355-dinner-tonight-omelet-gramajo.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["brunch", "Dinner Tonight", "egg", "ham", "omelets", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Omelet Gramajo", "link": "https://www.seriouseats.com/recipes/2011/06/omelet-gramajo-recipe.html", "description": "Had I known, as <strong>Francis Mallmann claims in <a href=\"http://www.amazon.com/dp/1579653545/?tag=serieats-20\">Seven Fires</a>,</strong> that this omelet can be found at \"just about every Argentine bodega and cafe,\" I might have made the trip down south before now. What's not to love? It features <strong>crunchy fried potatoes</strong>&mdash;essentially, shoestring french fries&mdash;<strong>salty ham, and just enough eggs</strong> to hold them all together.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Breakfast and Brunch", "Dinner Tonight", "Ham", "Omelettes", "Potato"], "recipeIngredient": ["2 red potatoes, about 6 ounces each, scrubbed", "2 cups vegetable oil ", "2 tablespoons extra virgin olive oil ", "4 thin slices jamón ibérico (another serrano or proscuitto would also work)", "4 large eggs", "salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the potatoes into very thin matchsticks. Pour the vegetable oil into a large saucepan. Turn heat to medium high and bring oil up to 360&deg;. Add as many of the potato pieces as will comfortably fit, and cook until golden, two to three minutes. Remove with tongs and drain on paper towels. Repeat process until all the potato pieces are cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour one tablespoon of the extra virgin olive oil into a 12-inch non-stick skillet. Turn heat to medium, and when shimmering, add the slices of ham. Let them crisp up, about 15 seconds. Drain the slices on more paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining olive oil to the skillet and keep the heat on medium. Crack the eggs into a medium-sized bowl, add a pinch of salt and pepper, and beat lightly with a fork. Pour the eggs into the skillet. Using a spatula, fold in the edges to let some of the uncooked eggs reach the pan surface. When eggs are set on the bottom, but still slightly runny on top, add the fried potatoes to half of the omelet. Place the ham slices on top of the potatoes. Carefully, use a wide spatula to fold the other half of the omelet on top. Transfer omelet to a cutting board. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the omelet into four sections, and divide between four plates. Season with more salt and pepper, but only after you taste first. The cured ham is salty, so be careful. </p>"}]}