{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110922-171856-wedding-lamb-biriyani.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "lamb", "Lynne Rossetto Kasper", "rice", "Sally Swift", "The Splendid Table's How to Eat Weekends"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Wedding Lamb Biriyani", "link": "https://www.seriouseats.com/recipes/2011/09/wedding-lamb-biriyani-recipe.html", "description": "It doesn't get much more festive than this <strong>Wedding Lamb Biriyani</strong>, an aromatic dish of saffron scented rice studded with delicately spiced lamb, sweet raisins, caramelized onions, and creamy-salty cashews.", "totalTime": "1 1/4 hours prep time; 1 1/2 hours stove time; Â  1 hour oven time", "recipeYield": "6 to 8", "recipeCategory": ["Cook the Book", "Lamb", "Rice"], "recipeIngredient": ["<strong>Lamb</strong>", "Canola oil", "3 to 4 medium to large onions, thinly sliced ", "Salt and freshly ground black pepper", "3 to 3½ pounds boneless lamb shoulder, trimmed of excess fat and cut into 1-inch cubes", "Biriyani Spice Blend (recipe follows)", "1½ cups plain low-fat yogurt (not nonfat)", "2 cups whole canned tomatoes with their liquid, crushed ", "Ginger-Garlic-Nut Purée (recipe follows)", "<strong>Rice</strong>", "4 cups basmati or other long-grain rice", "4 tablespoons salt", "½ teaspoon saffron threads, or a generous", "¼ teaspoon ground turmeric", "¹⁄³ cup milk ", "Unsalted butter for the baking dish", "<strong>Garnishes</strong>", "¼ cup canola oil", "3 tablespoons unsalted butter", "1 medium to large onion, thinly sliced", "Salt", "½ cup raisins", "¾ cup roasted cashews or almonds", " ", "<strong>Biriyani Spice Blend</strong>", "8 whole cloves", "8 whole green cardamom pods, lightly crushed", "4-inch cinnamon stick, broken", "1 generous tablespoon ground coriander", "1 tablespoon ground cumin", "½ teaspoon freshly ground black pepper", "¼ teaspoon cayenne, or to taste", "½ teaspoon freshly grated nutmeg", "<strong>Ginger-Garlic-Nut Purée</strong>", "½ medium onion, cut into chunks ", "6 large garlic cloves", "2½-inch piece fresh ginger, cut into pieces ", "¹⁄³ cup salted broken cashews ", "1 fresh serrano chile, or to taste", "Canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Biriyani Spice Blend:</strong> Blend all of the ingredients in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ginger-Garlic-Nut Purée:</strong> Make the purée by combining the onion, garlic, ginger, cashews, and chile in a food processor and puréeing to a paste. Generously coat the bottom of a 12-inch, straight-sided sauté pan with oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the pan over medium heat, stir in the ginger-garlic-nut paste, and sauté, stirring and scraping up any brown bits that are sticking to the pan for about 18 minutes. Watch carefully that the paste doesn’t burn. You want it to become dark golden brown and have a rich, spicy aroma. Adjust the heat as needed, and stir often. Scrape the paste from the pan, adding a little water to collect all the glaze and browned bits from the bottom of the pan. Set the paste aside or refrigerate it for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the lamb:</strong> One or 2 days before serving, place a 12-inch straight-sided sauté pan over medium-high heat, coat it with a thin film of oil, and add the sliced onions with a generous sprinkling of salt and pepper. Sauté the onions over medium-high to high heat until they turn golden with lots of dark, crisp edges, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push the onions to the edges of the pan and spread out the lamb in the center. Reduce the heat to medium. Sear the lamb on all sides. It will throw off some liquid; let it cook away. Adjust the heat so the onions don’t burn. Once the meat is seared, stir in the spice blend and cook until it is aromatic, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the yogurt to the lamb, ½ cup at a time, simmering each addition for 2 minutes, or until it disappears into the sauté. Stir in the tomatoes, the ginger purée, and enough water to barely cover the meat. Adjust the heat so the sauce simmers very slowly and cook, uncovered, for 1 to 1½ hours, or until the meat is tender and the sauce is reduced and rich tasting. There will be a generous amount of it.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the rice:</strong> The day the biriyani is served, rinse the rice in several changes of water, until the water is clear. Then soak the rice in enough water to cover (with 1 tablespoon of the salt added) for 30 minutes to 6 hours. Drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly toast the saffron for 30 seconds to 1 minute in a small, dry saucepan over medium heat. Immediately add the milk. Pull the pan from the heat and set aside to steep for a minimum of 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a 6-quart pot two thirds full of water. Add the remaining 3 tablespoons salt and bring the water to a boil. Drop in the rice and cook it like pasta for about 5 minutes, or until it’s tender but with a slight firmness. Drain in a sieve immediately and spread the rice out on a towel or cookie sheet so it cools quickly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the biriyani:</strong> Take the lamb out of the refrigerator and preheat the oven to 325ºF. You are going to dome the lamb, covered with the rice, in a baking dish; tent it with foil; and bake until it’s heated through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter the inside of a shallow 3- to 3½-quart baking dish. Mound the lamb in the center and cover it with the rice, patting it with a spatula into a smooth dome. Drizzle the rice with the saffron milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tent foil over the dome so that it does not touch the rice. Seal it around the edges of the dish, then bake the biriyani for 45 minutes to 1 hour, or until it is hot at its center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the garnishes:</strong> While the biriyani bakes, prepare several layers of paper towels on a baking sheet next to the stove. In a 10-inch skillet over medium-high heat, warm the oil and butter and fry the onion until crisp. Lift the onion out with a slotted spoon, spread on the paper towels, and sprinkle with salt to taste. In the same oil, fry the raisins until they puff, and scoop them out onto the towels. Finally, briefly fry the nuts until golden, then cool them on the towels. You are done! </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve the biriyani, remove it from the oven, lift off the foil, and scatter the garnishes over the top. Serve it hot, making sure each helping has some of the garnishes. Pass a yogurt raita along with the biriyani. </p>"}]}