{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110823-dt-spaghetti-with-herb-meatballs.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["basil", "Dinner Tonight", "herb", "meatballs", "pasta", "spaghetti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Pasta with Green Meatballs and Herb Sauce", "link": "https://www.seriouseats.com/recipes/2011/08/pasta-with-green-meatballs-and-herb-sauce-recipe.html", "description": "<a href=\"http://www.nytimes.com/2011/08/14/magazine/recipe-pasta-with-green-meatballs-and-herb-sauce.html?_r=1&amp;ref=magazine\">This recipe</a> from the <em>New York Times</em> Sunday magazine argues for thinking of herbs not just as a garnish, but as the center of a great dish. We've all had pesto, but that's just one way to do it. An absolutely epic amount of chopped herbs (three cups by the end) are mixed into juicy meatballs and pureed with garlic and olive oil into a simple sauce. It's rich and meaty, fragrant from the herbs, and honestly one of the better recipes I've cooked in months.", "totalTime": "40", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pasta"], "recipeIngredient": ["2 cups finely chopped fresh basil (about 2 large bunches)", "1/2 cup finely chopped fresh parsley", "1/2 cup finely chopped fresh chives", "1 slice white bread", "1/4 cup milk", "1/2 pound ground sirloin (or substitute lamb or pork)", "salt and pepper", "1 pound spaghetti or other pasta", "6 tablespoons olive oil", "1 clove garlic", "Grated Parmesan to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the herbs into a bowl to mix well. Soak the bread with the milk for 5 minutes, then remove and lightly squeeze out the milk.  Break the bread up into a bowl, then combine with the ground meat, 1 cup of the herbs, and a pinch of salt and pepper.  Work the mixture with your hands until well-combined, adding a little of the milk, if necessary, to help bind the ingredients into a slightly sticky consistency. Shape into 1-inch meatballs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil and cook the pasta until al dente.  Drain, reserving 1 cup of the pasta cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat 2 tablespoons of the olive oil in a large (12-inch) skillet over medium heat until shimmering.  Add the meatballs (in batches to avoid crowding) and cook until brown on all sides, 5-10 minutes. Remove to a plate and reserve the pan drippings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small food processor, combine the remaining herbs, remaining olive oil, garlic, a pinch of salt and pepper, and 1/4 cup of water.  Process until pureed, and season to taste if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the drained pasta into the skillet where the meatballs were cooked, along with a splash of the pasta cooking water.  Add the herb sauce and toss well over low heat, adding more pasta water if necessary to create a smooth sauce that clings to the noodles.   Season to taste. Divide among bowls, top with the meatballs and Parmesan, and serve.</p>"}]}