{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110803-164481-perfect-passion-fruit-parfait.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["frozen desserts", "parfait", "passionfruit", "Sugar Baby"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Perfect Passion Fruit Parfait", "link": "https://www.seriouseats.com/recipes/2011/08/perfect-passion-fruit-parfaits.html", "description": "Not your typical American layered fruit and cream parfait, this is more of a French variation, a light and airy frozen mousse.  Passion fruit purée can be a little hard to come by, but you can easily substitute reduced passion fruit juice for that same sweet and tangy tropical taste.", "totalTime": "1 hour plus overnight chilling time", "recipeYield": "6 to 8", "recipeCategory": ["Desserts", "Fruit Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 cup sugar, divided", "1/2 cup water, divided", "10 eggs, separated", "1 cup passion fruit purée", "pinch of salt", "2 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small heavy saucepan over medium heat, combine 1/2 cup of the sugar with 1/4 cup of the water. With a damp pastry brush, wash down the sides of the pan to prevent stray sugar crystals from forming. Heat until the mixture reaches 235&deg;F on a candy thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in the bowl of a stand mixer with a whisk attachment, whisk the egg yolks until they are light and fluffy. When the sugar syrup has reached temperature, with the mixer on medium-high, carefully pour the hot sugar syrup down the side of the mixing bowl and continue beating until the mixture has cooled.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the purée and mix gently. Scrape the mixture into a metal bowl and set aside in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan over medium heat, combine the remaining 1/2 cup sugar and the remaining 1/4 cup water and heat until the mixture reaches 235&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, clean the bowl of your stand mixer and add the egg whites and salt. Whisk until foamy. Slowly add the hot sugar mixture to the egg whites and whip on high until the egg whites are very white and shiny and hold soft peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the bowl to the stand mixer fitted with the whisk attachment and beat on high until the mixture forms stiff, white peaks and has cooled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the egg whites to the purée mixture and gently fold together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the bowl of the stand mixer <em>again</em> and pour in the heavy cream. Whip the cream until soft peaks form. Gently fold the whipped cream into the egg mixture, making sure no white streaks remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently pour the parfait into single-serving glasses, a large serving bowl, or individual rectangular cake molds and freeze until firm, at least 5 hours or overnight. Serve frozen.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve the rectangular cakes, heat the metal mold with a blow-dryer on low heat, then gently remove the mold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation:</strong> If you’d like a gradation of colors to give the dessert a visual pop, before freezing, add a drop of orange food coloring to half the mixture. Spread the darker parfait in an even layer first, then gently spoon the lighter-colored parfait on top, making sure not to blend the two together and muddy the distinct colors. Freeze as above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation:</strong> If you want to give your parfait a cake base, use your cake mold to stamp out a layer of cake, then pour parfait into the mold and freeze as above.</p>"}]}