{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111116-greeneggsham-new-primary.jpg", "author": {"@type": "Person", "name": "Linda Miller Nicholson"}, "recipeCuisine": "", "keywords": ["green eggs and ham", "Modernist Eats", "peas", "spherification"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spherified Green Eggs and Ham", "link": "https://www.seriouseats.com/recipes/2011/11/spherification-green-eggs-and-ham-dr-seuss-modernist-cuisine.html", "description": "...", "totalTime": "30 minutes", "recipeYield": "8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Legumes"], "recipeIngredient": ["300 grams frozen peas", "12 mint leaves", "375 grams water", "2.4 grams sodium alginate", "6.5 grams calcium chloride", "1 liter purified water", "4 slices bread, each cut into two triangles", "1 egg", "3 tablespoons maple syrup", "3 tablespoons heavy cream", "2 large slices of prosciutto cut into 8 smaller pieces", "1 tablespoon butter", "1 shallot, thinly sliced", "1 teaspoon sherry vinegar", "1 teaspoon dark brown sugar", "1/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the spheres:</strong> put the peas and mint in a blender.  Boil 375 grams of water and pour over peas. Blend until smooth. Pass through a mesh strainer, discard the solids, and measure out 500 grams of the remaining juice. Put one third of it in an immersion blender container and add the sodium alginate. Blend well, add remaining juice, and blend again. Let sit in fridge while you make the calcium chloride water bath. Add calcium chloride to liter of water in a shallow glass container. Stir with a fork until dissolved. In a separate shallow container, add an equivalent amount of cold water (for rinsing). Using measuring spoons of whatever size you want your spheres to be, spoon pea juice into calcium chloride bath in little spherical blobs. Using a slotted spoon, gently nudge the spheres around in the water. After two minutes, remove the pea spheres to the cold water. (You will have enough pea juice to make way more than eight spheres- roll with it. It’s fun.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the toast:</strong> Mix the syrup, egg and cream until fully incorporated. Dredge the bread triangles in the mixture and pan fry in a nonstick skillet over medium heat on both sides until browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the shallots:</strong> while the toast is browning, caramelize the shallot in a small saucepan over low heat in the butter. After five minutes, add the remaining shallot ingredients and stir occasionally until browned and very soft, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble the green eggs and ham by arranging the toast triangles on a platter, placing a prosciutto square on them, a small dollop of caramelized shallot, and finally, very carefully, using a slotted spoon, top with the spherified peas. The peas are delicate, and don't last long, so make them just before you plan to serve them. </p>"}]}