{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110920-171546-slow-roasted-pork-with-glazed-orange-slices.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fall", "Lynne Rossetto Kasper", "orange", "pork", "pork shoulder", "roasted meats", "roasting", "rosemary", "Sally Swift", "The Splendid Table's How to Eat Weekends"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Slow-Roasted Pork with Glazed Orange Slices", "link": "https://www.seriouseats.com/recipes/2011/09/slow-roasted-pork-with-glazed-orange-slices-recipe.html", "description": "This <strong>Slow-Roasted Pork with Glazed Orange Slices</strong> is ideal for those weekends when errands need running but a warmly fall flavored meal is still in the cards. The preparation begins three days prior to cooking with a sweet spice rub of cloves, allspice, cinnamon, and coriander massaged into the pork with red wine, garlic, and orange juice.  Resting in the fridge for 72 hours allows the sweet spices to work their way into this hulking shoulder.", "totalTime": "3 days seasoning time; 2 1/2 hours oven time; 10 to 15 minutes rest time", "recipeYield": "8 to 12", "recipeCategory": ["Cook the Book", "Orange", "Pork"], "recipeIngredient": ["<strong>Seasoning</strong>", "6- to 7-pound boneless pork shoulder or Boston butt, well marbled ", "1 generous teaspoon whole cloves, or 1 level teaspoon ground", "1 generous teaspoon whole allspice, or 1 level teaspoon ground ", "1 generous teaspoon coriander seed, or 1 level teaspoon ground", "1 generous teaspoon black peppercorns, or 1 level teaspoon ground black pepper", "2½-inch cinnamon stick, broken, or 2 teaspoons ground ", "1 tablespoon kosher salt", "6 large garlic cloves, thinly sliced", "¹⁄³ cup good-tasting extra-virgin olive oil", "1¹⁄³ cups orange juice", "1½ cups dry red wine", "&nbsp;", "<strong>Roasting and Finishing</strong>", "2 tightly packed tablespoons fresh rosemary leaves ", "½ medium onion, chopped", "½ teaspoon salt", "1 tablespoon extra-virgin olive oil ", "1 thin-skinned orange, such as Valencia, Temple, or Hamlin, unpeeled, sliced into thin rounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Marinate the meat:</strong> Three days before cooking, make deep wide cuts into the meat. Then grind the whole cloves, allspice, coriander, peppercorns, and cinnamon stick in a coffee grinder or mortar and pestle, or blend the ground spices. In a medium bowl, mix the spices with the salt, garlic, oil, ²⁄³ cup of the orange juice, and ½ cup of the wine. Stuff the mixture into the slits and the meat’s crevices and rub into the pork on all sides. Tuck the roast into a shallow dish, cover, and refrigerate for 3 days, turning three or four times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Roast the meat:</strong> Take the meat out of the refrigerator and preheat the oven to 400ºF. Purée the rosemary, onion, salt, and oil, and stuff the mixture into the roast’s crevices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll up the roast into a loose cylinder. Put it in a large shallow pan, fat side up (we like a half-sheet pan), scrape any remaining marinade over it, and scatter the orange slices around the pan. Roast for 30 minutes, then pour in the remaining 1 cup wine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat down to 325ºF., pour in the remaining ²⁄³ cup orange juice, and roast for another 90 minutes, basting the pan juices and the orange slices over the meat several times. If the pan juices threaten to burn, blend in a little water. You want them to end up being syrupy, but not burned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Test the internal temperature of the meat with an instant-read thermometer. Once it reaches 145ºF. to 150ºF., reduce the heat to 200ºF. for another 30 minutes, or until the meat’s internal temperature is 155ºF. Remove the pork from the oven and let it rest in a warm place for 10 to 15 minutes before slicing.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pan juices should be syrupy. If needed, set the pan over two burners, skim off a little excess fat, and cook down the juices, stirring with a wooden spatula.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, thinly slice the pork across the grain, moistening the slices with the pan sauce and bits of roasted orange. Don’t be put off if the meat is a pinkish beige; it is safe and so succulent. Serve the pork hot.  </p>"}]}