{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110302-139879-bacon-chocolate-chip-biscotti-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["biscotti", "chocolate chips", "Edible DIY"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Bacon Chocolate Chip Biscotti", "link": "https://www.seriouseats.com/recipes/2011/03/bacon-chocolate-chip-biscotti.html", "description": "These biscotti are infused with smoky, meaty bacon and dotted with rich pockets of chocolate. Each bite yields layer upon layer of mostly-sweet-but-also-savory flavors. Try dunking them in your morning coffee! They will keep for up to two weeks, stored...", "totalTime": "About 2 hours", "recipeYield": "Makes about 3 dozen", "recipeCategory": ["Bacon", "Cookies", "Desserts", "Edible DIY"], "recipeIngredient": ["5 strips bacon", "2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/4 teaspoon salt", "3/4 cup granulated sugar", "1/2 cup (1 stick) unsalted butter, softened", "2 large eggs", "1 cup semisweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry bacon in skillet until browned and crisp, about 5 minutes. Transfer to paper towel-lined plate to drain. Allow bacon to cool completely. Transfer bacon to food processor and pulse until coarsely chopped. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, baking powder, and salt in medium bowl. In large bowl, beat butter and sugar with electric mixer until light and fluffy, two or three minutes. Add eggs one at a time and beat to combine. Add flour mixture and beat until blended. Stir in bacon and chocolate chips. Gather dough in ball and divide in half. Wrap each half in plastic and refrigerate until firm, 20 to 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line baking sheet with parchment paper. Preheat oven to 350ºF. On floured surface, roll each piece of dough out into a 12 to 14-inch log. Trasfer logs to baking sheet spacing them 3 to 4 inches apart. Bake until light golden and dry to the touch, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove baking sheet from oven. Reduce oven temperature to 300ºF. Allow logs to cool for 15 minutes. Transfer logs to cutting board. Using serrated knife, slice logs on diagonal into 1/2-inch thick slices. Return slices to baking sheet, standing upright, and bake until dry and golden, 20 to 30 minutes.</p>"}]}