{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110815-olson-blueberry-yogurt.jpg", "author": {"@type": "Person", "name": "Nancy Olson"}, "recipeCuisine": "", "keywords": ["berries", "blueberries", "frozen yogurt", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry Vanilla Bean Frozen Yogurt", "link": "https://www.seriouseats.com/recipes/2011/08/blueberry-vanilla-bean-frozen-yogurt.html", "description": "We got so excited creating this recipe just for Serious Eats. The blueberries have that perfect balance of sweet and tart. We've combined blueberries and yogurt for a refreshing treat that you don't need to heat up your kitchen to enjoy.  I think a scoop of this is amazing solo, but a little granola gives it a great textural contrast (and possibly an excuse to eat it for breakfast!).", "totalTime": "4 hours (or overnight)", "recipeYield": "makes about 1 quart", "recipeCategory": ["Blueberry", "Ice Cream and Frozen Treats"], "recipeIngredient": ["3/4 cup plus 2 tablespoons sugar", "3/4 cup plus 2 tablespoons  water", "2 Tahitian vanilla beans", "1 pound blueberries (about 3 1/2 cups)", "1 tablespoon vanilla extract", "¼ teaspoon kosher salt ", "3/4 cup plus 2 tablespoons light corn syrup", "2 pounds Greek yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the sugar, water, vanilla beans (split and scraped) and blueberries to a boil in a saucepan. Turn the heat off as soon as this mixture boils so it doesn’t reduce. Stir in the corn syrup,  kosher salt, and vanilla extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool completely; refrigerate overnight if possible. Refrigerating overnight will allow the blueberries to fully absorb the full flavor of the vanilla beans.  (But  if you are really craving frozen yogurt <em>right now</em>, it is not a step that is crucial.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the vanilla beans and add the yogurt. Use a hand blender to blend the mixture until the yogurt is completely emulsified and the blueberries are completely pureed. (Alternately, you can put this into a blender and puree it, but I like the convenience of the hand blender.) The mixture could be passed through a chinois if you’d like something more refined, but we like the rustic chunkiness of the blueberry skins and seeds throughout the frozen yogurt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze this in your ice cream maker according to manufacturer's directions, keeping this tip in mind:  the colder the frozen yogurt base is to begin with, the less time it will take for the ice cream freezer to freeze it.  This results in smaller crystals of ice which will lead to a creamier frozen yogurt. </p>"}]}