{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110720-food-lab-ceviche-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["appetizers", "ceviche", "fish", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Peruvian-Style Fish Ceviche", "link": "https://www.seriouseats.com/recipes/2011/07/classic-peruvian-style-fish-ceviche-recipe.html", "description": "Sashimi and crudo may be the John and Paul of the raw seafood band, but <strong>ceviche is the George.</strong> A little less popular, a little less flashy, but altogether more complex, sharper, and complex, with a bit of acid. It differs from George in one key way though: <strong>It's really easy to get into</strong>. It comes in on the upper half of the Top 100 Easiest Dishes to Make Of All Time, and I'd bet good money that it's #1 for Most Impressive Return For Your Time Investment. It's a dish that looks and tastes elegant, yet is quite literally thrown together in a matter of moments.", "totalTime": "10 minutes", "recipeYield": "4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish", "The Food Lab"], "recipeIngredient": ["1 pound fresh ocean fish such as sea bass, grouper, or striped bass, cut into 1/4-inch slices (see note)", "1/2 cup lemon, lime, or sour orange juice, or a combination", "1 small red onion, finely sliced", "1/4 cup chopped fresh cilantro leaves", "1 to 2 jalapeño peppers, ribs and seeds removed, rinsed, and finely minced", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine fish, juice, onion, cilantro, and jalapeño in a large bowl and gently fold with your hands to combine. Season to taste with salt and pepper. Allow to marinate for at least 5 minutes, folding occasionally. Transfer to a serving platter and serve immediately with boiled corn and sweet potatoes, if desired.</p>"}]}