{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111019-175879-sunday-brunch-focaccia-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["breads", "brunch", "focaccia", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Focaccia", "link": "https://www.seriouseats.com/recipes/2011/10/focaccia-italian-bread-recipe.html", "description": "On its own focaccia makes a great morning nibble, but put wedge of gooey cheese and a few bits of fresh fruit next to it, and you've got a serious brunch. If you're a late riser, put the dough together the night before and pull it out of the fridge early the next morning to come up to room temperature and go through its rise.  Fresh strong coffee and a bit of wine work well with hot focaccia.", "totalTime": "1 hour 30 minutes", "recipeYield": "4-6", "recipeCategory": ["Bread", "Breakfast and Brunch"], "recipeIngredient": ["1 package active dry yeast", "1/8 teaspoon sugar", "1/3 cup warm water", "4 cups all-purpose flour", "1 teaspoon salt", "1 cup water", "2 tablespoons olive oil ( plus extra for the baking sheet)", "Coarse sea salt", "Cracked black pepper", "Chopped herbs (oregano, thyme) optional", "Sun dried tomatoes, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the yeast and sugar in warm water and let stand until foamy, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all-purpose flour and salt in a large bowl and mix to combine.  Once yeast has foamed, combine with remaining water and olive oil and slowly combine with flour and salt, mixing with a wooden spoon; then turn out onto a floured work surface and continue to knead with your hands until a dough comes together.  Knead for an additional 5 minutes until gluten begins to form and dough becomes resistant to kneading.  Sprinkle with flour and cover with a kitchen towel and allow to rise in a warm place until doubled in size, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450°F.  Once dough has risen, grease a baking sheet with olive oil, then punch down dough and roll out until dough covers almost all of baking sheet.  Drizzle with additional olive oil and sprinkle with sea salt and pepper (and additional herbs and/or sun dried tomato) and bake until light brown and crisp, about 22 minutes.</p>"}]}