{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110614-156646-Nick-Malgieri-Strawberry-Tart-610.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["tart", "tart dough"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cookie Dough Tart Crust", "link": "https://www.seriouseats.com/recipes/2011/06/cookie-dough-tart-crust-recipe.html", "description": "Use this tart crust for Nick Malgieri's Strawberry Cream Cheese Crumble Tart.", "totalTime": "about 2 hours", "recipeYield": "Makes about 1 1/2 pounds of dough, enough for two 10-inch (25-cm) tart crusts", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1/4 cup (1 ounce) slivered or whole blanched almonds (optional)", "3/4 cup (3 ounces) confectioners’ sugar, sifted after measuring", "2 1/2 cups (10.5 ounces) all-purpose flour (spoon flour into dry-measure cup and level off)", "1/4 teaspoon salt", "8 ounces (2 sticks) unsalted butter, cold, cut into 16 pieces", "2 large egg yolks", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the almonds and confectioners’ sugar in the bowl of a food processor and pulse repeatedly until finely ground, about 1 minute. No visible pieces of almond should remain. Use a thin metal spatula to scrape away any of the mixture caked up in the corner where the bottom meets the side of the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour and salt and pulse a couple of times to mix. (If not using the nuts, start here and add the sugar.) Add the butter and pulse again repeatedly until no visible pieces of butter remain. Add the yolks and vanilla and pulse again until the dough forms a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert the dough to a floured surface and carefully remove the blade. Divide the dough into 2 equal pieces. Shape each piece of dough into a thick disk and wrap individually in plastic wrap. Refrigerate until firm, at least 1 hour. You may prepare the dough several days in advance and keep it refrigerated, or double wrap and freeze the second piece of dough, defrosting it in the refrigerator overnight before use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form a tart crust, remove one of the pieces of dough from the refrigerator and allow it to soften at a cool room temperature for about 20 minutes, just until it is soft enough to roll without cracking, but still firm. Unwrap it and place it on a floured surface. Use the palm of your hand to press it to a thickness of about 1/4 inch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour the work surface and the dough and gently roll the dough into a 13-inch disk, adding pinches of flour under and on top of the dough as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the dough in half and slide both hands under it, palms upward, and transfer it to the pan, lining up the fold with the diameter of the pan. Unfold the dough into the pan. Don’t be concerned if the dough cracks or tears&mdash;you can press it back together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Evenly fit the dough into the pan, making sure it’s flat against both the bottom and side of the pan. Trim away any excess dough at the rim of the pan by rolling over with a rolling pin or scraping it away with the back of a paring knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finish off the top edges of the crust by pressing outward against the side of the pan with your thumb and down at the same time at the top of the crust with your index finger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the tart pan onto a cookie sheet, cover it with plastic wrap and refrigerate it for several hours or overnight before baking.</p>"}]}