{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111009-174359-meatballs-al-forno-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Italian", "keywords": ["Cook the Book", "meatballs", "Nancy Silverton", "The Mozza Cookbook", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Meatballs al Forno", "link": "https://www.seriouseats.com/recipes/2011/10/meatballs-al-forno-mozza-recipe.html", "description": "Nancy Silverton had traditional Italian cuisine on the mind when writing menus for <a href=\"http://www.osteriamozza.com/\">Osteria Mozza</a> but when it came to <a href=\"http://www.pizzeriamozza.com/\">Pizzeria Mozza</a> she made one Italian-American exception on the menu for meatballs.  And it was a happy exception: these <strong>Meatballs al Forno</strong> adapted from <em><strong><a href=\"http://www.amazon.com/Mozza-Cookbook-Angeless-Favorite-Restaurant/dp/0307272842/?tag=serieats-20\">The Mozza Cookbook</a></strong></em> ended up being the most popular antipasto on the menu.", "totalTime": "3 hours", "recipeYield": "8, 24 meatballs", "recipeCategory": ["Beef", "Cook the Book", "Italian", "Pork"], "recipeIngredient": ["3/4 cup diced day- old, crustless bread", "1/4 cup whole milk", "1 1/2 cups freshly grated Parmigiano- Reggiano (about 6 ounces), plus a wedge of Parmigiano-Reggiano for grating ", "1/2 large yellow Spanish onion, minced (about 1 cup) ", "2/3 cup finely chopped fresh Italian parsley leaves", "2 extra- large eggs", "4 large garlic cloves, minced", "2 to 3 teaspoons pure ground red pepper flakes, plus more to taste", "2 teaspoons kosher salt", "1 teaspoon freshly ground black pepper", "1 pound ground pork (preferably pork butt)", "1 pound ground veal ", "6 1/2 ounces pancetta, finely chopped or minced in a miniature food processor", "All-purpose flour, for dredging (about 2 cups)", "1/4 cup extra- virgin olive oil, plus more as needed", "1 quart <em>Passata de Pomodoro</em> (recipe follows) or tomato sauce", "1 quart chicken stock", "3 dried bay leaves", "3 dried arbol chiles", "Buttered semolina toast, for serving (optional)", " ", "<strong><em>Passata di Pomodoro</em></strong>", "2 28-ounce cans whole peeled plum tomatoes, including their juices (such as San Marzano) ", "1/4 cup extra virgin olive oil", "1 tablespoon sugar, plus more as desired", "1 scant tablespoon kosher salt", "1 heaping teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the <em>Passata di Pomodoro</em>:</strong> Pass the tomatoes, including their juices, through a food mill into a large bowl.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large sauté pan over medium-high heat until the oil is almost smoking and slides easily in the pan, 2 to 3 minutes.  Add the tomato purée slowly as it will splatter when it hits the oil.  Stir in the sugar, salt, and pepper, and cook until the sauce thickens slightly, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the <em>passata</em> or set it aside to cool to room temperature, then transfer it to an airtight container and refrigerate for up to several days or freeze for up to several months.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meatballs:</strong> Put the day-old bread in a small bowl, pour in the milk, and set aside to soak the bread for about 5 minutes. Combine the 11⁄2 cups Parmigiano-Reggiano, onion, parsley, eggs, garlic, ground red pepper flakes, salt, and pepper in a large bowl and stir to thoroughly combine. Add the pork, veal, and pancetta. Squeeze the bread in your fist to press out the milk, discarding the excess milk. Add the bread to the bowl with the other ingredients and use the tips of your fingers as if you were playing the piano to combine the ingredients without overworking them, which makes for heavy meatballs. Divide the meat into 2- ounce portions and roll each portion into a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the flour into a large bowl or another dish convenient for dredging. Dredge the meatballs in the flour, shake off any excess, and place them on a baking sheet. Cover the pan with plastic wrap and refrigerate the meatballs for at least an hour or overnight. (Refrigerating allows the fat in the meats to solidify so the meatballs maintain their shape when cooked.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to the middle position and preheat the oven to 350ºF. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the olive oil into a large Dutch oven or ovenproof skillet and add more if needed to cover the bottom of the pan to 1⁄4 inch deep. Heat the oil over medium- high heat until it is almost smoking and slides easily in the pan, 2 to 3 minutes. Working in two batches, place the meatballs in a single layer in the pan and sear them until they are lightly browned all over, being gentle when turning them so they don’t fall apart, about 6 minutes. Remove the meatballs to a plate. Add more oil to the pan and heat it until it’s almost smoking before cooking the second batch in the same way. Turn off the heat and wipe the oil and browned bits from the pan. Return the meatballs to the pan. Combine the passata and chicken stock and pour the liquid over the meatballs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The amount of sauce you need will vary depending on the size of the vessel you are pouring it into, so add more or less as needed; you want them to be submerged but not drowning in the liquid. Add the bay leaves and chile pods and place the meatballs in the oven to braise for 1 hour. Remove the meatballs from the oven and allow them to rest in the sauce for at least 10 minutes. The meatballs can be prepared to this point up to two days in advance. Set them aside to cool to room temperature, then transfer the meatballs and the sauce to an airtight container, or several containers, and refrigerate until you’re ready to serve them. Warm the meatballs and the sauce together in a saucepan over medium heat before proceeding with the recipe. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, remove the meatballs to a plate and skim off and discard the fat from the sauce. Spoon a thin layer of sauce on a serving platter or individual plates, lay the meatballs on top of the sauce, serving 3 meatballs if you are using individual plates. Use a microplane or another fine grater to grate a thin dusting of Parmigiano- Reggiano over the meatballs. Serve with the semolina toast on the side, if desired.</p>"}]}