{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205derbypieuse.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["derby pie", "pecan pie", "pie", "Southern desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "(Something Not Exactly Like) Derby Pie", "link": "https://www.seriouseats.com/recipes/2011/12/almost-derby-pie-recipe.html", "description": "This is as rich as pie gets. The creamy, sweet caramel custard is festively spiked with bourbon, and cut with toasted pecans and just enough dark chocolate to cut its sweetness. The addition of bourbon and chocolate transform a garden variety pecan pie into something more complex and special. Don't forget to add the salt&mdash;it's an important touch that helps highlight and balance the sweet flavors.", "totalTime": "6 hours", "recipeYield": "8 servings", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "1 cup sugar", "4 tablespoons butter, melted", "1/2 cup dark corn syrup (light will also work)", "3 large eggs, beaten", "2 1/2 cups pecan halves", "3 tablespoons bourbon", "1/2 teaspoon salt", "6 ounces good-quality, 63% dark chocolate, roughly chopped in to 1/4 inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. blind bake the crust by lining the bottom and sides of the chilled, shaped pie shell with parchment or foil and fill with pie weights or dried beans and bake for 15 minutes. Remove the weights and bake until the bottom is light golden brown. Remove the shell from the oven and allow it to cool. Lower the oven temperature to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir together the sugar and melted butter. Add the corn syrup, eggs, bourbon, chocolate, salt and pecans and stir until all ingredients are combined. Pour mixture into the pie shell and place in the preheated oven on the center rack. Bake for approximately 30 minutes, rotating halfway through, until the pie is set and puffed just slightly. If parts of the crust or the top of the pie is getting too dark, place patches of foil over the dark parts to protect them from the heat. Allow the finished pie to cool completely before serving.<br />\r\n</p>"}]}