{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110614-156685-pineapple-upside-down-cake.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cakes", "pineapple", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Pineapple Upside-Down Cake", "link": "https://www.seriouseats.com/recipes/2011/06/pineapple-upside-down-cake-recipe.html", "description": "This classic cake can easily be served for brunch, alongside a nice plate of scones and a big pot of coffee.  Our version of Pineapple Upside Down Cake uses fresh fruit instead of canned, and a Pyrex dish instead of a cast iron skillet (although a cast iron skillet will work brilliantly if you happen to have one in your cupboard).  Make sure to remove the cake from the pan while it's still a bit warm, and make sure your platter is larger then you think you need.  I find it much easier to un-mold a slightly hot cake onto a slightly larger platter.", "totalTime": "65 minutes", "recipeYield": "4-6", "recipeCategory": ["Breakfast and Brunch", "Cakes", "Pineapple"], "recipeIngredient": ["<strong>Pineapple Topping:</strong>", "3/4 stick butter", "3/4 cup brown sugar", "1/2 ripe pineapple, peeled and cut into 1 inch thick pieces", "&nbsp;", "<strong>Cake:</strong>", "1 1/2 cup all purpose flour", "2 teaspoon baking powder", "pinch of salt", "3/4 stick room temperature butter", "1 cup sugar", "1 teaspoon vanilla extract", "1 tablespoon crown royal (or whiskey or rum of preference)", "1/2 cup pineapple juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Pineapple Topping: </strong> Butter 8x8 Pyrex dish and arrange pineapple slices in an overlapping circle (or as close as you can manage it).  In small sauce pan melt butter, then add brown sugar and cook until sugar has dissolved, about 4 minutes.  Pour sugar mixture over pineapple and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Cake:</strong>  Whisk flour, baking powder and salt together in a bowl and reserve.  In a standing mixer combine butter and sugar and beat until light and soft.  Add vanilla, crown royal, and pineapple juice to butter mixture and beat until combined.  With mixer running on low, add flour mixture a spoonful at a time until everything is added and a batter forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon batter over pineapple and smooth with spatula. Bake until golden brown and a toothpick inserted in center comes out clean, about 45 minutes.  Serve with more sliced pineapple and strong black coffee.</p>"}]}