{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111004-127355-dinner-tonight-trout-aioli-charred-fennel-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["aioli", "Dinner Tonight", "fennel", "fish", "fish sandwiches", "quick", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Trout and Charred Fennel with Aïoli on Whole Grain Bread", "link": "https://www.seriouseats.com/recipes/2011/10/trout-and-charred-fennel-with.html", "description": "This sandwich is really about that fennel, which gets cut into small matchsticks and cooks over high heat until charred. Talk about easy. All you have to do is slightly blacken the vegetable. The fish requires a little more work but you only need to cook it for a few minutes.", "totalTime": "30 min", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Fish", "Sandwiches"], "recipeIngredient": ["<strong>For the Aioli:</strong>", "1 egg yolk ", "1 tablespoon fresh lemon juice ", "1/2 tablespoon cold water ", "2 garlic cloves, minced ", "1 cup olive oil or canola oil ", "Salt", "&nbsp ", "<strong>For the Sandwich:</strong> ", "1 pound lake trout or salmon fillet, skin removed, cut into four pieces", "1/4 cup extra-virgin olive oil ", "2 fennel bulbs ", "Salt and black pepper ", "8 slices whole-grain bread, lightly toasted", "1 bunch arugula, trimmed, washed, and dried "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Aioli: In a immersion blender cup, combine the egg yolk, lemon juice, cold water, and garlic. Pour in the oil, and then let this settle for 15 minutes. Place the head of the immersion blender at the bottom of the cup, and then turn it on. Process the aioli, tilting and lifting the immersion blender occasionally, until it emulsifies. <a href=\"http://www.seriouseats.com/recipes/2011/10/two-minute-mayonnaise.html\">Click here for more detailed instructions</a>. Season to taste with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the sandwich: Cut fennel bulb in half from root to stem, then remove the cores. Cut the pieces into thin slices, and then cut these into very thin matchsticks. Toss the fennel pieces with 2 tablespoons of the olive oil, and season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large iron skillet over high heat. When very hot, add about half of the fennel, or as much as will fit comfortably in one layer. Cook until fennel becomes charred, stirring occasionally, two to three minutes. Remove fennel when cooked, and repeat process with remaining fennel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When fennel is done, turn off the heat, and carefully wipe out the iron skillet. Turn heat to medium-high, and pour in the remaining two tablespoons of oil. Add the salmon pieces and cook until browned and cooked through, one to two minutes each side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear about a tablespoon of the aioli on one side of four slices of the bread. Top each with layer of arugula, a quarter of the charred fennel, and one piece of salmon. Drizzle on some more aioli if you'd like, and then top each with a slice of bread. Serve.  </p>"}]}