{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111103-127355-dinner-tonight-spli-pea-soup-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "peas", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Greek Yellow Split-Pea Soup with Red Onion and Lemon", "link": "https://www.seriouseats.com/recipes/2011/11/greek-yellow-split-pea-soup-with-red-onion-lemon-recipe.html", "description": "If the flavors of this soup remind you slightly of hummus, know that you're not far off. Joyce Goldstein explains in <em><a href=\"http://www.amazon.com/dp/B0048ELD50/?tag=serieats-20\">Cooking with Les Dames D'Escoffier</a></em> that this recipe was inspired by a spread she encountered in Greece. Realizing that customers at her restaurant would more likely order soup than a spread, she thinned it out, managing to still keep the flavors much the same. Though there are only a few ingredients, this soup has a surprising amount of depth and character.", "totalTime": "1 hour and 20 minutes", "recipeYield": "4 to 6 people", "recipeCategory": ["Dinner Tonight", "Legumes", "Soups and Stews"], "recipeIngredient": ["2 teaspoons cumin seeds ", "6 tablespoons extra-virgin olive oil, divided", "2 cups diced yellow onion (from about one large onion)", "16 ounces yellow split peas, rinsed", "6 cups chicken or vegetable broth ", "2 lemons  ", "3/4 teaspoon salt, plus more to taste", "2 teaspoons freshly ground black pepper", "3 tablespoons finely chopped red onion "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cumin seeds to a small skillet set over medium heat. Toast until very fragrant, about one minute. Turn off the heat, and grind the cumin in a spice grinder or mortar and pestle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour three tablespoons of the oil into a large saucepan set over medium heat. When oil is shimmering, add the two cups of diced yellow onion. Cook, stirring occasionally, until onion is translucent and soft, about eight minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the ground cumin, stir well, and cook for about a minute. Then add the yellow split peas and the broth. Turn heat to high and bring to a boil, and then reduce heat to maintain a simmer. Cook until the split peas are falling apart, about one hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the soup is cooking, zest one of the lemons. You need about one teaspoon of zest. Then juice both lemons until you have two tablespoons. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree the soup either in a blender or with an immersion blender. If you used the blender, pour the mixture back in the saucepan. Add the salt, pepper, lemon juice, and lemon zest. Stir well. If needed, thin the soup with water or more broth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the soup into bowls. Garnish with the diced red onion and drizzle with the remaining olive oil. </p>"}]}