{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20110928-172772-apple-pear-quince-galette-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apple", "fall desserts", "fall sweets", "Farmers' Market Desserts", "fruit desserts", "galettes", "pears", "pies", "quince"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple, Pear, and Quince Galette", "link": "https://www.seriouseats.com/recipes/2011/10/apple-pear-quince-galette-recipe-farmers-market-desserts.html", "description": "The aromatic quince has a fleeting season, just a few months in the early fall. This <strong>Apple, Pear &amp; Quince Galette</strong> combines the perfumed fruit with apples and pears into a rustic, free form tart.", "totalTime": "2 hours 20 minutes", "recipeYield": "8", "recipeCategory": ["Apple", "Bake the Book", "Fruit Desserts", "Pear", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Crust</strong>", "1 1/3 cups unbleached all-purpose flour ", "1/2 teaspoon kosher salt", "1/2 cup (1 stick) unsalted butter, cold, cut into 8 pieces \u2028", "2 ounces cream cheese, cold ", "About 1 1/2 tablespoons ice water", " ", "<strong>Filling</strong>", "1 large tart apple, peeled and cored", "1 large pear, peeled and cored", "1 large or 2 small quinces, peeled and cored", "2 tablespoons firmly packed light brown sugar ", "1 tablespoon unbleached all-purpose flour", "2 teaspoons fresh lemon juice ", "1/2 teaspoon pure vanilla extract", "Pinch of kosher salt", "2 tablespoons unsalted butter, cold, cut into small pieces", " ", "<strong>Finishes</strong>", "About 1 tablespoon half-and-half \u2028", "2 tablespoons turbinado, Demerara, or other coarse sugar ", "1/3 cup apricot preserves ", "1 tablespoon Calvados, pear brandy, or brandy (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the crust, put the flour and salt in a food processor and pulse a few times to mix. Scatter the butter over the top and pulse until the butter is in pea-size pieces. Break the cream cheese into 3 or 4 pieces and add to the food processor. Pulse until the butter and cream cheese are in pieces that vary in size from oat flakes to peas. With the motor running, slowly drizzle in the ice water, a little at a time, adding just enough for the dough to hold together when you pinch a clump between your fingers. Listen for the sound of the motor to deepen, a clue the dough is ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a lightly floured work surface and knead briefly just to bring it together into a ball. Flatten it into a disk, wrap in plastic film, and refrigerate for at least 45 minutes or up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the apple and pear into roughly 1/2-inch cubes. Coarsely grate the quince on the large holes of a box grater. Put all the fruits into a bowl, sprinkle with the brown sugar, flour, lemon juice, vanilla, and salt, and toss to coat evenly. Mix the butter evenly into the fruit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F, with a rack in the lower third. Turn a 17-by-12-inch rimmed baking sheet upside down, and cover the bottom with a sheet of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough disk between 2 sheets of lightly floured plastic film and roll out into a 14-inch circle. Peel off the top sheet of plastic film. If the circle is uneven, trim the edge of the dough with a pizza wheel or kitchen shears. Then, using the bottom sheet, flip the dough circle onto the parchment. (It will drape over the edges of the pan.) Carefully peel off the second sheet of plastic film.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the filling evenly over the dough, leaving a 2-inch border around the edges. Using the parchment as an aid, fold the border up and over the fruit, tucking and pleating the pastry to snugly fit over the fruit as you go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish, brush the pastry rim with half-and-half and sprinkle the turbinado sugar evenly over the pastry and the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the fruit is tender when pierced with a knife and the dough is golden, about 50 minutes. Let the galette cool on the pan for 15 minutes, then slide the parchment with the galette onto a wire rack to finish cooling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the apricot preserves in a small saucepan over medium-low heat. Stir in the liquor, then pass through a fine-mesh strainer into a small bowl. Brush the glaze over the warm fruit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the galette warm or at room temperature, cut into wedges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate leftover galette, tightly covered, for up to 3 days. Heat on a baking sheet in a preheated 375&deg;F oven for about 10 minutes to crisp the crust before serving.</p>"}]}