{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111027-177037-sunday-supper-salt-roast-fish-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["fish", "holiday entrees", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salt Roasted Fish", "link": "https://www.seriouseats.com/recipes/2011/10/salt-roasted-fish-how-to-make.html", "description": "This method of preparing fish produces a moist, flavorful final product, has a fantastic presentation built in, and is simple to prepare.  This recipe is written for two one-pound fish, but can be easily scaled to serve four, or even six by multiplying the amounts of salt, herbs and egg whites used to create the crust.", "totalTime": "40 minutes", "recipeYield": "2 (one fish per person)", "recipeCategory": ["Fish", "Mains", "Sunday Supper"], "recipeIngredient": ["1/4 teaspoon black peppercorns", "1 small bunch thyme", "12 sprigs parsley", "4 cups Kosher salt", "4 egg whites", "thinly sliced lemon, optional", "thinly sliced garlic, optional", "parsley, optional", "2 X 1 pound fish (snapper, striped bass and branzino all work well) gutted, but with head, tail and scales left in tact"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F.  Pulse peppercorns, thyme, parsley and Kosher salt in a food processor until salt is green, about 20 seconds.  Beat egg whites until foamy and mix with salt mixture.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a piece of tinfoil twice as large as the fish on the counter and place one cup of salt mixture on foil.  Stuff fish with lemon, garlic or parsley (if using).  Place fish on salt mixture then cover with another cup of salt mixture, leaving head and end of tail exposed; press the salt to adhere to the fish.  Repeat with remaining fish and salt mixture.  Bunch foil around each fish so that salt and fish are still exposed.  Transfer to baking sheet and bake until internal temperature of fish reads 140°, about 18 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, crack salt crust with back of fork, then gently peel off both salt crust and skin.  Serve with boiled potatoes and leafy vegetables with white wine alongside.</p>"}]}