{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110518-152269-chocolate-covered-bacon-turtles-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["candy", "chocolate", "desserts", "Edible DIY", "pecans", "turtles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate-Covered Bacon Turtles", "link": "https://www.seriouseats.com/recipes/2011/05/chocolate-covered-bacon-turtles.html", "description": "This recipe yields 30 turtles, which sounds like a lot, but trust me, they go fast. The combination of flavors is incredible. First you get the crispy pecans, then the chewy caramel, then the rich dark chocolate, and finally the...", "totalTime": "About 2 1/2 hours", "recipeYield": "30 turtles", "recipeCategory": ["Bacon", "Candy", "Chocolate", "Desserts", "Edible DIY", "Nuts"], "recipeIngredient": ["3/4 pound whole pecan halves (about 3 1/2 cups)", "5 strips bacon", "1 cup heavy cream", "5 tablespoons unsalted butter, diced", "1 teaspoon vanilla extract", "1 1/2 cups granulated sugar", "3 tablespoons light corn syrup", "One (12-ounce) package bittersweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325ºF. Spread pecans in even layer on baking sheet. Bake until the pecans are fragrant and toasted, stirring occasionally, about 6 or 7 minutes. Remove pecans from oven and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry bacon in large skillet until very crisp, about 8 minutes. Transfer bacon to paper towel-lined plate and let cool. When bacon is cool enough to handle, cut each strip into six pieces with kitchen shears. Set bacon pieces aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line 2 baking sheets with parchment paper. Arrange pecans in star-shaped clusters of five. You should have enough whole pecan halves to make 30 clusters. (If you don't, you can arrange broken pieces into little piles. They won't look like turtles, but they will still be delicious.)  Set baking sheets aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In small saucepan, combine heavy cream, butter, and vanilla extract. Bring to a boil over medium heat, then immediately remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium saucepan, combine sugar, corn syrup, and 1/4 cup of water. Bring to a boil over medium-high heat, stirring until sugar is dissolved. Reduce heat to a simmer and cook sugar mixture, without stirring but swirling pan occasionally, until it is beginning to turn golden-amber in color, about 6 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium-low. Very carefully, pour hot cream mixture into sugar mixture. It will bubble ferociously. Stir until combined. Clip candy thermometer to side of pan and cook, stirring occasionally, until mixture reaches 248ºF (firm ball stage), 10 to 15 minutes. Remove pan from heat and allow caramel to cool slightly, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using soup spoon, drop mounds of caramel into center of each pecan cluster. Top each with one piece of bacon, pressing gently to adhere. (If caramel becomes too stiff to work with, reheat gently over low heat.)  Set turtles aside to cool, 45 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat two-thirds of chocolate chips in heat-proof bowl set over pan of simmering water until melted and candy thermometer registers 110ºF - 115ºF. Remove bowl from pan and allow chocolate to cool until thermometer registers 95ºF - 100ºF. Stir in remaining third of chocolate chips until melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using soup spoon, top each turtle with spoonful of melted chocolate, smoothing to cover bacon completely. Set turtles aside until chocolate hardens. Turtles will keep for up to two weeks, stored between sheets of wax paper in an airtight container at room temperature.  </p>"}]}