{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110801-127355-dinner-tonight-whitefish-tomatoes-capers.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["capers", "Dinner Tonight", "fish", "salad", "tarragon", "whitefish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Grilled Whitefish Salad with Tomatoes and Tarragon Vinaigrette", "link": "https://www.seriouseats.com/recipes/2011/08/grilled-whitefish-salad-with-tomatoes-tarragon-recipe.html", "description": "The fish fillets are grilled quickly then immediately placed atop a handful of lettuce, which wilts the leaves just slightly. Cherry tomatoes, tarragon, and capers are all tossed with a simple vinaigrette then added on top. With those little tomatoes just starting to pop up at farmers' markets, this is the perfect time to check out what whitefish is all about.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Fish", "Salads"], "recipeIngredient": ["4 six-ounce whitefish fillets, skin on, any bones removed", "6 teaspoons canola oil", "salt and black pepper", "2 cups salad mix", "2 cups quartered cherry tomatoes, use different colors if possible", "1/4 cup extra-virgin olive oil", "1 tablespoon balsamic vinegar", "2 tablespoons tarragon, chopped", "1 tablespoon capers, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush each fish fillet with a teaspoon of canola oil, and then season both sides with salt and pepper. Place a large non-stick grill pan over medium heat, and then brush the pan with the remaining two teaspoons of canola oil. When pan is warm, add the fillets flesh-side down. Cook until flesh is firm, and grill lines start to appear, two to four minutes depending on the thickness of the fillets. Flip the fillets, and cook until skin starts to crisp up, two to four minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk together the olive oil and vinegar in a medium bowl. Then toss in the tomatoes, tarragon, and capers. Season this mixture with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the salad mix between four plates. When fish is done, place a fillet on top of each salad. Top each fish with a quarter of the tomato mixture and vinaigrette. Serve immediately.  </p>"}]}