{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110606-155344-black-sesame-otsu.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Heidi Swanson", "soba", "soba noodles", "Super Natural Every Day", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Black Sesame Otsu", "link": "https://www.seriouseats.com/recipes/2011/06/black-sesame-otsu-noodles-recipe.html", "description": "A bowl of cold soba noodles are perfect hot weather eating, as <a href=\"http://www.seriouseats.com/recipes/2011/06/cold-soba-salad-with-peppers-and-ponzu-dressing-recipe.html\">we established</a> yesterday. Mild and nutty, hearty and cooling all at once, we could really eat the noodles all summer long with no complaints.  <a href=\"http://www.101cookbooks.com/about/#heidi\">Heidi Swanson</a>'s version of soba from <em><strong><a href=\"http://www.amazon.com/Super-Natural-Every-Day-Well-loved/dp/1580082777/?tag=serieats-20\">Super Natural Every Day</a></strong></em> dresses quick-cooked and quick-chilled buckwheat noodles with a nutty dressing of black sesame, sunflower seeds, and pine nuts sweetened with sugar and spiced with cayenne.", "totalTime": "30 minutes", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Pasta", "Tofu", "Vegetarian"], "recipeIngredient": ["1 teaspoon pine nuts", "1 teaspoon sunflower seeds", "1/2 cup / 2 oz / 60 g black sesame seeds", "1 1/2 tablespoons natural cane sugar", "1 1/2 tablespoons shoyu, tamari, or soy sauce", "1 1/2 teaspoons mirin", "Scant 1 tablespoon toasted sesame oil", "2 tablespoons brown rice vinegar", "1/8 teaspoon cayenne pepper", "Fine-grain sea salt", "12 ounces / 340 g soba noodles", "12 ounces / 340 g extra-firm tofu", "Extra-virgin olive oil", "1 bunch green onions, white and light green parts, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the pine nuts and sunflower seeds in a large skillet over medium heat until golden, shaking the pan regularly. Add the sesame seeds to the pan and toast for a minute or so. It’s hard to tell when they are toasted; look closely and use your nose. Remove from the heat as soon as you smell a hint of toasted sesame; if you let them go much beyond that, you’ll start smelling burned sesame—not good. Transfer to a mortar and pestle and crush the mixture; the texture should be like black sand. Alternatively, you can use a food processor. Stir in the sugar, shoyu, mirin, sesame oil, brown rice vinegar, and cayenne pepper. Taste and adjust if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Salt generously, add the soba, and cook according to the package instructions until tender. Drain, reserving some of the noodle cooking water, and rinse under cold running water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the noodles are cooking, drain the tofu, pat it dry, and cut into matchstick shapes. Season the tofu with a pinch of salt, toss with a small amount of oil, and cook in a large skillet over medium-high heat for a few minutes, tossing every couple minutes, until the pieces are browned on all sides.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserve a heaping tablespoon of the sesame paste, then thin the rest with 1/3 cup / 80 ml of the hot noodle water. In a large mixing bowl, combine the soba, half of the green onions, and the black sesame paste. Toss until well combined. Add the tofu and toss again gently. Serve topped with a tiny dollop of the reserved sesame paste and the remaining green onions.</p>"}]}