{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110405-dt-chile-tomato-soup-with-cumin-and-cinnamon.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["curry", "Dinner Tonight", "soup", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Chile-Tomato Soup with Cumin and Cinnamon", "link": "https://www.seriouseats.com/recipes/2011/04/chile-tomato-soup-with-cumin-and-cinnamon-recipe.html", "description": "Maybe it's the end of winter and I'm craving tomatoes like mad, but I can't stay away from tomato soup recipes (usually made from canned tomatoes) lately. This one is full of bold flavor and completely unlike run-of-the-mill tomato soup. The garnish is made with fresh grape or cherry tomatoes, which seem to taste fine year-round. I topped it with a dollop of yogurt, but the recipe is otherwise dairy-free, which isn't always easy to find in a tomato soup.", "totalTime": "30", "recipeYield": "4 people", "recipeCategory": ["Dairy-Free", "Dinner Tonight", "Soups and Stews", "Tomato"], "recipeIngredient": ["4 tablespoons olive oil, divided", "1 onion,  chopped", "4 cloves garlic, chopped", "1-inch piece ginger, peeled and minced", "1 teaspoon ground cumin", "1/2 teaspoon ground cinnamon", "1 28-ounce can tomatoes", "2 cups vegetable or chicken stock, or water", "2 tablespoons honey", "2 tablespoons lemon juice, or to taste", "2 tablespoons sweet Thai chile sauce", "Salt to taste", "2 cups cherry tomatoes", "Thick yogurt for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy soup pot, heat half the olive oil over medium heat until shimmering.  Add onion and ginger and cook until soft, 4-5 minutes.  Add half of the garlic and cook an additional minute, then add cumin and cinnamon and cook, stirring often, until spices are fragrant, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatoes and stock and bring to a boil.  Simmer until tomatoes are very soft, 15-20 minutes, then transfer soup to a blender.  Puree until smooth, then return to pot and stir in honey, lemon juice, chile sauce, and salt to taste.  Adjust for sweetness, acidity and spiciness as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat remaining oil in a skillet over medium heat until shimmering, then add tomatoes and cook until soft and skins have begun to split. Add remaining garlic and cook for an additional few minutes. Serve soup with cherry tomato garnish and yogurt, if using.</p>"}]}