{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110606-entertaining-germandinner-pretzelrolls-primary.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["bread", "German", "pretzels", "Serious Entertaining"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pretzel Rolls", "link": "https://www.seriouseats.com/recipes/2011/06/pretzel-rolls-recipe.html", "description": "These yeasted rolls are boiled and then baked, so they have the wonderfully chewy texture of pretzels and a dense, faintly sweet crumb. Their dinner roll size makes them perfect to have alongside your schnitzel, or even as a snack with your first beer.", "totalTime": "2 hours", "recipeYield": "makes 8 rolls", "recipeCategory": ["Bread"], "recipeIngredient": ["2 3/4 cups bread flour", "1/4 ounce active dry yeast", "1 teaspoon salt", "2 tablespoons plus one teaspoon sugar, divided", "1/2 teaspoon celery seeds", "1 cup plus 2 tablespoons hot water", "Olive oil", "8 cups water", "1/4 cup baking soda", "1 egg", "Coarse salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine yeast, flour, salt, celery seeds, and one teaspoon sugar. Pulse to blend. With machine running, add hot water. Continue to processor for one minute to knead. Lightly oil a large bowl. Turn dough into bowl and coat to oil. Cover bowl with a kitchen towel and let dough rise until doubled in volume, about one hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch down dough and knead for one minute. Turn dough onto a floured surface and cut into 8 equal pieces. Shape each piece into a ball. Use a sharp knife to score an X into the top of each ball. Cover balls with kitchen towel and let rise until almost doubled in volume, about 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Line a baking sheet with parchment paper. Bring 8 cups of water to a boil. Add two tablespoons of sugar and baking soda. Put rolls in boiling water, letting them boil for about 30 seconds per side. Take out rolls with a slotted spoon and transfer to baking sheet, scored side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly beat egg with one tablespoon of water. Brush rolls with egg wash. Sprinkle each roll generously with coarse salt. Bake rolls until brown and a light crust has formed, about 25 minutes.</p>"}]}