{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110301-140257-chinese-roast-chicken-buns.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Bird in the Oven and Then Some", "buns", "chicken", "Cook the Book", "Mindy Fox", "smoking", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Chinese Roast Chicken Buns with Scallions and Spicy Hoisin Sauce", "link": "https://www.seriouseats.com/recipes/2011/03/chinese-roast-chicken-buns-with-scallions-spicy-hoisin-sauce.html", "description": "<strong>David Chang</strong> of New York's Momofuku has proved that pretty much anything is delicious when served inside a steamed bun with sliced cucumbers, hoisin, and Sriracha.  At Momofuku, the buns are stuffed with pork belly (the classic), shrimp, or shiitake mushrooms. These <strong>Chinese Roast Chicken Buns with Scallions and Spicy Hoisin Sauce</strong> from <a href=\"http://www.ediblemanhattan.com/20101103/how-a-cookbook-author-gleaned-inspiration-from-new-york's-flavors/\">Mindy Fox</a>'s <strong><em><a href=\"http://www.amazon.com/Bird-Oven-Then-Some-Delectable/dp/1906868336/serieats-20\">A Bird in the Oven and Then Some</a></em></strong> are obviously inspired by the Momofuku buns, but are filled with slices of smokey <strong>Tea-Brined Roast Chicken</strong>.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["1 cup unbleached plain flour", "1/2 cup self-rising (cake) flour", "1 1/2 teaspoons active dry yeast", "1 1/2 teaspoons sugar", "1/8 teaspoon fine sea salt", "1/2 cup warm water (around 150&deg;F)", "1 teaspoon vegetable oil, plus more for brushing the dough ", "1 pound sliced roast chicken, preferably Tea-Brined Roast Chicken (recipe follows), white and/or dark meat, preferably with skin", "2 tablespoons hoisin sauce", "1 tablespoon Sriracha sauce", "1 medium cucumber, thinly sliced crosswise", "5 to 6 scallions, julienned or thinly sliced on a long diagonal (you might have some leftover)", "<strong>For the Tea-Brined Roast Chicken:</strong>", "8 cups water", "1 orange", "1/3 cup loose Lapsang Souchong or Russian Caravan tea, or 12 teabags", "5 whole cloves", "2 cinnamon sticks", "2 whole star anise pods", "1 teaspoon whole black peppercorns ", "1 teaspoon fennel seeds", "3 slices fresh ginger (each about 1 1/2 inches long and 1/8 inch thick)", "1/2 cup kosher or sea salt", "1/4 cup packed dark brown sugar", "1 (4-pound) whole chicken"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the buns:</strong> In a large bowl, whisk together the flour, cake flour, yeast, sugar and salt; add the water and oil. Using your hands, mix and then knead in the bowl until a dough forms (add up to 1/4 cup more water by the tablespoonful, if necessary). Turn out the dough onto a lightly floured work surface and knead until smooth and elastic, about 5 minutes. Put the dough into an oiled bowl, turning the dough to coat it with oil, then cover with a clean tea towel and let rise at a draught-free warm room temperature, until doubled in size, 45 minutes to 1 hour. Meanwhile, cut out 12 (2 1/2 x 2 1/2-inch) squares of baking parchment.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch down the dough and form it into a 4-cm-thick rope. Cut into 12 equal pieces. Roll each piece into a ball. Place the balls on a baking tray, cover loosely with plastic wrap, and let rise at warm room temperature for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat each piece into a long oval, about 5 x 2-inches in length, 1/8 inch thick. Brush 1 oval with oil, then fold in half lengthways, place on a parchment square and brush with oil. Place on a baking tray and repeat with the remaining dough pieces. Loosely cover the buns with clingfilm and let rise at a draught-free warm room temperature until nearly doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a few centimetres of water to a simmer in a saucepan so that the bottom of a steamer insert sits above the water. Arrange the buns, in batches, if necessary, about 1/2 inch apart, on the insert and steam over a medium heat, covered, until the dough is slightly puffed and cooked through, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer each bun with chicken, hoisin, Sriracha, cucumber and scallions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tea-Brined Roast Chicken:</strong> In a large saucepan, bring the water to the boil. Meanwhile, using a sharp peeler or knife, cut the zest from the orange, avoiding the white pith. If using loose tea, spoon into filters, or wrap in muslin and tie with kitchen string to secure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water comes to the boil, remove the pan from the heat. Add the zest, tea, spices and ginger and leave the mixture to steep, uncovered and off the heat, for 20 minutes, then squeeze the liquid from the tea parcels or teabags and discard. Add the salt and sugar and stir to dissolve, then squeeze the juice from the orange into the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull off the excess fat around the cavity of the chicken and discard. Rinse the chicken and put it into a one gallon resealable bag. Put the bag into a bowl, then pour the brine into the bag and seal the bag, pressing out any air. Put the bowl in the refrigerator and leave the chicken to stand in the brine, turning it a few times, for 12–24 hours (the more time you have to let it sit, the deeper the flavor).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the brine and pat dry very well, inside and out. Arrange a wire rack to fit over a pan, place the bird in the pan and refrigerate, uncovered, for 12–24 hours (you can skip this step, but it’s well worth the advance planning – given the fact that the bird is quite wet from the brine, this step gives you the crispiest skin).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 450°F with the shelf in the middle. Put an 8- to 10-inch cast-iron frying pan or heavy roasting tin into the heated oven for 10 minutes. Meanwhile, remove the bird from the refrigerator and pat dry any dampness, inside and out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the hot pan from the oven and immediately place the bird, breast-side up, into it and into the oven. Roast for 20 minutes, then turn the bird breast-side down. Roast for a further 20 minutes,</p>"}]}