{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110712-dt-quinoa-stew-with-spinach-and-feta.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "quinoa", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Quinoa Chowder with Cumin, Feta, and Spinach", "link": "https://www.seriouseats.com/recipes/2011/07/dinner-tonight-quinoa-chowder-with-cumin-feta-and-spinach-recipe.html", "description": "The broth is flavored by the cooked quinoa, jalapeño, scallions, and pungent ground cumin, then studded with salty bits of feta and earthy spinach. The result is hearty and filling, yet delicate and light. Besides being one of the healthiest things I've cooked in weeks, it was also surprisingly delicious.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Quinoa", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["3/4 cup quinoa", "2 tablespoons olive oil", "1 clove garlic, finely chopped", "1 jalapeno chile, seeded and finely diced", "1 teaspoon ground cumin", "Salt and pepper", "1/2 pound waxy potatoes, such as red skin, peeled and cut into 1/4-inch cubes", "1 bunch scallions, thinly sliced into rounds (use an inch of the green section in addition to the white)", "3 cups finely sliced spinach leaves", "1/4 pound feta cheese, cut into small (1/4-inch) cubes", "1/3 cup chopped cilantro", "1 hard-boiled egg, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a fine strainer, rinse the quinoa well to remove any bitterness.  Transfer to a large saucepan and cover with 2 quarts of water.  Bring to a boil, then lower the heat to simmer until the quinoa is tender, 15 to 20 minutes. Drain, reserving the cooking liquid.  Add water to the liquid to make 6 cups, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium soup pot, heat the olive oil over medium heat until shimmering.  Add the garlic and jalapeno and cook until fragrant, about 30 seconds, then add the cumin and potatoes. Stir well to combine and continue cooking as the cumin toasts, 2-3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the quinoa cooking water to the pot, along with half the scallions.  Taste and season with salt and pepper. Bring to a boil and simmer until the potatoes are tender, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the quinoa to the pot along with the spinach, remaining scallions, and cilantro. Cook for 3 minutes, then remove from the heat and add the feta. Ladle into bowls and serve with the chopped egg as garnish.</p>"}]}