{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110706-steamed-cheese-burger-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "cheese", "sandwich", "The Burger Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seared Burgers With Easy-Melting Comté Cheese Slices", "link": "https://www.seriouseats.com/recipes/2011/07/seared-burgers-with-easy-melting-comte-cheese-slices-recipe.html", "description": "This recipe will work with any aged, semi-hard cheese like Comté, Cheddar, or Tomme.", "totalTime": "15 minutes", "recipeYield": "makes 2 burgers", "recipeCategory": ["Beef", "Burger", "Cheese", "Sandwiches", "The Burger Lab"], "recipeIngredient": ["2 ounces coarsely grated aged Comté cheese (see note)", "1 teaspoon instant flour (like Wondra)", "2 teaspoons heavy cream or milk", "1/4 teaspoon vegetable oil", "8 ounces of freshly ground beef, formed into two 4-ounce balls", "Kosher salt and freshly ground black pepper", "2 toasted hamburger buns", "Toppings and condiments as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cheese, flour, and milk in a small bowl and toss with a spoon to combine. Divide mixture evenly between two small ramekins and set aside. Set a steamer insert into a large saucepot with 1 inch of water. Bring water to a simmer over medium-high heat and cover pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a 10-inch cast iron or stainless steel skillet over high heat until smoking. Add beef balls to skillet and smash firmly with a stiff spatula into 4- to 4 1/2-inch patties. Season generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While patties cook on first side, transfer cheese cups to steamer and close lid. After the first side is well browned (about 1 1/2 minutes), carefully scrape patties up from bottom us skillet using a stiff spatula and flip. Season top side with salt and pepper. Continue to cook until second side is browned, about 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer patties to toasted bun bottoms. Carefully pick up a ramekin full of cheese with a pot holder and stir with a spoon until homogenous and completely smooth. Scrape cheese out of ramekin over burger. Repeat with second burger. Serve immediately with condiments and toppings as desired.</p>"}]}