{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111211-spherificationtools.jpg", "author": {"@type": "Person", "name": "Linda Miller Nicholson"}, "recipeCuisine": "", "keywords": ["caviar", "holiday nibbles", "modernist cuisine", "Modernist Eats", "pomegranates", "shishito peppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shishito Peppers with Pomegranate Caviar", "link": "https://www.seriouseats.com/recipes/2011/12/modernist-christmas-shisito-peppers-with-pomegranate-caviar.html", "description": "Have yourself a a modernist merry Christmas.", "totalTime": "30 minutes", "recipeYield": "6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Pomegranate"], "recipeIngredient": ["48 Shishito peppers", "1 teaspoon Finishing salt (such as Maldon)", "1 Pomegranate", "8 ounces POM Wonderful pomegranate-cherry juice (or another pomegranate juice, but be aware spherification is very sensitive to pH so you may need to adjust the amount of sodium alginate if you change the juice)", "1 tablespoon Simple syrup", "1/8 teaspoon Sodium citrate", "1/2 teaspoon Sodium alginate", "4 cups Purified water", "1-1/4 teaspoons Calcium chloride"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 500°F and place a baking stone or sheetpan on the upper middle rack. Gather all of the necessary tools (pictured).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make six skewers of shishito peppers, eight per skewer. Piece the peppers near the top closest to the stem.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break apart the pomegranate and separate the arils from the skin. Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the cup of an immersion blender, combine the POM, simple syrup, sodium citrate, and sodium alginate. Blend until completely smooth, taking care to ensure that the powders have fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow (preferable glass) dish, combine the water with the calcium chloride and stir to mix completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the oven is very hot, roast the peppers on the baking stone or sheet pan for two minutes on each side or until blistered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the pomegranate caviar either by using a caviar box (multi-pipette), a syringe, or a very small spoon. If you have the multi-pipette tool, just place the juice in the rectangular trough and use the attached syringe to pull it up into the pipettes, then drop the juice in the calcium chloride bath. If you don’t have the pipette tool you can make individual caviar either by spooning juice into the calcium chloride bath or by dropping the juice in with a syringe. Regardless, allow the juice to set in the calcium chloride bath for 30 seconds, then remove with a skimmer or slotted spoon (spoodle) and place in a bowl of purified cold water until ready to plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once your caviar is made and the shishito peppers are blistered, place each skewer of peppers on a plate and dust with salt. Then sprinkle the reserved pomegranate arils over the peppers, and finally, just before serving since they are very delicate, spoon some pomegranate caviar on the plate. Serve immediately. </p>"}]}