{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110607-bread-baking-cinnamon-pizza.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "cinnamon", "dessert"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Sweet Cinnamon Pizza?", "link": "https://www.seriouseats.com/recipes/2011/06/bread-baking-sweet-cinnamon-pizza-recipe-dessert.html", "description": "I was at a meeting, munching on the freebie cinnamon breadstick-pizza-thing that came with the pizza we ordered, and it dawned on me (the meeting wasn't particularly compelling) that this was basically pizza dough topped with cinnamon and sugar. So I decided that I could do a whole lot better than this rather plain pizza dough.", "totalTime": "3 hours, 15 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch"], "recipeIngredient": ["2 tablespoons honey", "2 1/4 teaspoons yeast", "1 lukewarm cup water", "2 1/2 cups (11 1/4 ounces) bread flour", "1/4 cup almond meal", "1 teaspoon salt", "1 teaspoon almond extract", "6 tablespoons (3/4 stick) unsalted butter, divided", "1/2 cup granulated sugar", "1 tablespoon cinnamon", "1/2 cup powdered sugar (optional)", "Milk, heavy cream, or water, as needed (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the honey, water, and yeast. Set aside until foamy, about 10 minutes. Add the bread flour and knead with the dough hook until the dough is smooth and elastic. Add the almond meal, salt, almond extract, and two tablespoons of the butter. Continue kneading until well incorporated. Form the dough into a ball, put it back in the bowl, and cover the bowl with plastic wrap. Set aside until doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the granulated sugar, cinnamon, and remaining butter in a small bowl. Mix until well combined. Flour your work surface lightly. Preheat your oven to 350 degrees. If you have a baking stone, have that in the oven as you preheat. Otherwise you can bake the bread on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough, knead briefly, and form it into a ball. Flatten the ball into a disk, then stretch or roll the disk to about 9 inches in diameter. Place the disk on a piece of parchment paper. Transfer it to a baking sheet if you'll be using one.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the butter/sugar/cinnamon mixture on the dough, not quite all the way to the edge or it will drip over the edge and make a mess - that's why you need the parchment paper. Some will probably drip anyway. Cover the dough with plastic wrap and set aside for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap and bake at 350 degrees until well browned, about 35 minutes. Let the bread cool on a rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want a sugar glaze as well, put the powdered sugar in a small bowl. Add water, milk, or cream, a little at a time, mixing well, until the mixture is smooth, thick, and pourable. Depending on which liquid you use, you'll might need as little as a tablespoon or two, so add just a little at a time until you have the right consistency. Drizzle the glaze over the bread, slice as desired, and serve.</p>"}]}