{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110613-roast-chicken-with-leeks-and-asparagus1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "chicken", "holiday entrees", "leeks", "roast chicken", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Roast Chicken with Asparagus and Leeks", "link": "https://www.seriouseats.com/recipes/2011/06/easy-roast-chicken-with-asparagus-and-leeks-recipe.html", "description": "One of the great things about spring is that it provides you with a plethora of vegetables that need only brief cooking stints to become delicious. This makes them the perfect companion for a roast chicken dinner. Simply roast your chicken, have your vegetable prepped, then cook them while the chicken rests. All of your food comes out piping hot at the exact same time.", "totalTime": "1 hour", "recipeYield": "4", "recipeCategory": ["Asparagus", "Chicken"], "recipeIngredient": ["1 whole butterflied chicken (about 4 pounds, see note), neck and backbone reserved", "Kosher salt and freshly ground black pepper", "4 large leeks, whites and greens reserved separately, whites trimmed, washed, and split in half lengthwise", "2 bay leaves", "1 1/2 pounds asparagus stalks, trimmed and peeled if necessary", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 500°F. Pat chicken dry with paper towels and season on all sides generously with salt and pepper. Line heavy-duty rimmed backing sheet with foil. Place chicken on foil, skin-side up. Transfer to oven and roast until thickest part of breast registers 140 to 150°F on an instant-read thermometer, about 45 minutes. Remove from oven, transfer chicken to a cutting board, and allow to rest for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken roasts, make jus. Chop neck and back bone into 1-inch chunks with a cleaver, heavy chef's knife, or poultry shears. Place in a medium saucepan and cook over high heat, stirring occasionally with a wooden spoon until browned on all sides, about five minutes. Add leek greens and bay leaves and cover with water. Simmer for 30 minutes, then strain, discarding solids. You should have about 2 cups of jus.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place leek whites in a large saucepan and pour chicken jus on top. After chicken comes out of oven, bring leeks to simmer, reduce heat to low, cover, and allow to cook until leeks are tender and chicken is ready to serve, about 15 minutes. Season leeks and jus to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken rests, place asparagus in the now-empty pan that the chicken was roasted in. Drizzle with olive oil and season with salt and pepper. Transfer to oven and roast until tender and browned, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve chicken into serving pieces. Transfer leeks to serving platter with a slotted spoon, leaving jus in pan. Stir butter into jus until emulsified. Transfer asparagus and chicken to serving platter and pour just all around. Serve immediately.</p>"}]}