{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110412-147014-chicken-and-leek-pasties.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "hugh fearnley-whittingstall", "leeks", "pasties", "pies", "River Cottage Every Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Chicken and Leek Pasties", "link": "https://www.seriouseats.com/recipes/2011/04/chicken-and-leek-pasties-recipe.html", "description": "Taking a cue from Cornish pasties (know in West Cornish dialect as tiddy oggy (!), these are little moon-shaped handheld pastries filled with savory ingredients. Hugh Fearnley-Whittingstall offers up three filling variations in <em>River Cottage Every Day</em>&mdash;leftover stew, lentil and squash, and chicken and leek.", "totalTime": "1 hour 30 minutes", "recipeYield": "4", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["<strong>For the rough puff pastry:</strong>", "2 cups all-purpose flour", "A pinch of sea salt", "2/3 cup chilled unsalted butter, cut into small cubes", "<strong>For the filling:</strong>", "2 tablespoons unsalted butter", "2 to 3 leeks (about 1 pound), trimmed and finely sliced", "1 teaspoon coarsely chopped fresh thyme leaves", "2/3 cup heavy cream", "1 teaspoon English mustard", "Sea salt and freshly ground black pepper", "About 12 ounces boned chicken thigh and breast meat (or leftover cooked chicken), cut into thick slices", "1 tablespoon canola or olive oil (if using fresh chicken)", "<strong>To finish:</strong>", "1 egg, lightly beaten with 1 teaspoon milk, for glazing "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pastry</strong>, mix the flour with the salt, then add the cubed butter and toss until the pieces are coated with flour. Stir in just enough ice water (8 to 10 tablespoons) to bring the mixture together into a fairly firm dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the dough into a rectangle with your hands and, on a well-floured surface, roll it out in one direction, away from you, so you end up with a rectangle about 3/8 inch thick. Fold the far third towards you, then fold the nearest third over that (rather like folding a business letter), so that you now have a rectangle made up of 3 equal layers. Give the pastry a quarter-turn, then repeat the rolling, folding, and turning process 5 more times. Wrap the pastry in plastic wrap and rest it in the fridge for about 30 minutes, or up to an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the filling</strong>, melt the butter in a frying pan, add the leeks and thyme, and cook gently for 5 to 10 minutes, until the leeks are very tender. Stir in the cream and cook gently for 4 to 5 minutes to reduce and thicken. Stir in the mustard, season well, and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fresh chicken, season well and fry in the oil in a frying pan over medium-high heat until evenly browned. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the pastry on a lightly floured work surface to about 1/8 inch thick. Using a plate or a cake pan as a template, cut out four 8-inch circles; you may have to gather up the trimmings and reroll them to get your fourth circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the leek mixture on to one half of each circle and pile the chicken on top. Brush the pastry edges with a little water, fold the other half of the pastry over the filling to form a half-moon shape, and crimp well to seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place on a lightly oiled baking sheet and brush the tops of the pasties with the egg wash. Bake for about 25 minutes, until golden brown. Eat hot or cold.<br />\n</p>"}]}