{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110927-172288-honey-vanilla-broiled-figs.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["broiled figs", "figs", "fruit desserts", "The Crisper Whisperer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: The World's Second-Easiest Fig Dessert", "link": "https://www.seriouseats.com/recipes/2011/09/the-worlds-second-easiest-fig-dessert-recipe.html", "description": "Perfectly ripe figs are so jewel-like on their own that they hardly need any embellishment to make a perfect dessert. But run them under the broiler with a touch of vanilla and honey, and you'll take fig perfection to a whole new level in ten minutes or less.", "totalTime": "10 minutes", "recipeYield": "4", "recipeCategory": ["Crisper Whisperer", "Fruit Desserts"], "recipeIngredient": ["8 perfectly ripe fresh figs", "1/2 vanilla pod", "1/4 cup honey, for drizzling (you won't use it all)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler (on low, if you have a choice), with the top rack about six inches below the heat source. Cut each fig in half from stem end to base. You'll be broiling the figs cut-side up, so if your figs aren't symmetrical, try to make the cut such that you'll have as stable a base as possible on the uncut side. Arrange the fig halves cut side up on a baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice open the vanilla bean with a paring knife and scrape out the seeds with the tip of the knife. Spread a bit of seeds on the cut side of each fig half. You don't need a lot to get a great vanilla flavor. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the cut side of each fig half lightly with honey. Again, you don't need too much. Place the pan on the top rack of the oven and broil for a few minutes, until the tops of the figs are bubbly and very lightly browned.  (It takes about five minutes in my oven, but broilers vary substantially.) Serve warm by themselves or perched atop a small bowl of vanilla ice cream or Greek yogurt.</p>"}]}