{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110901MoulesDijonnaise.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["mussel", "mussels", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Secret Ingredient (Dijon Mustard): Moules Dijonnaise", "link": "https://www.seriouseats.com/recipes/2011/09/the-secret-ingredient-dijon-mustard-moules-di.html", "description": "A big steamy pot of creamy mussels soaked in two different kinds of mustard, shallots, leeks, garlic, thyme, and wine.  Make sure to buy lots of baguettes to soak up this broth.", "totalTime": "15 minutes", "recipeYield": "2 to 4", "recipeCategory": ["Clams, Mussels, and Oysters", "The Secret Ingredient"], "recipeIngredient": ["4 pounds mussels", "1 spoonful all purpose flour", "2 tablespoons olive oil", "2 shallots, diced", "1 skinny leek, finely sliced in halfmoons", "Kosher salt", "Freshly cracked black pepper", "4 cloves garlic, grated", "1 cup dry white wine, such as Sauvingnon Blanc ", "A small bunch of fresh thyme (about .2 ounces)", "1/4 cup Dijon mustard", "1/4 cup whole grain mustard", "1 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the mussels and flour in a huge bowl, and cover with cold water.  Leave the mussels to soak while you prepare the rest of the ingredients, and they will disgorge any sand they might be saving up in their bellies.  Finally, drain and rinse the mussels.  Throw out any that are open.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, wide braising pan, heat the olive oil over medium heat.  When the oil ripples, add the shallots and leek, and season with salt and pepper.  Sauté, stirring often, until the vegetables are soft and fragrant, but not golden: about 3 minutes.  Lower the heat, and add the garlic, stirring it around with the other vegetables for about 45 seconds.  Then add the wine, and the thyme, and season the mixture with salt and pepper.  Cover the pot, keep it over low heat, and simmer for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the mussels, and raise the heat to medium-high.  Keep the pot covered.  The mussels are cooked when they’ve all opened.  It takes about 5 minutes.  Discard any that remain stubbornly closed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat, and stir in the mustards and the cream, until well combined into the broth.  Taste the broth for seasoning, and adjust as needed.  Serve right away, with a big baguette to tear apart and dip into the broth.</p>"}]}