{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110901-168561-moon-pies-process.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate", "chocolate desserts", "graham crackers", "marshmallow"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Moon Pies", "link": "https://www.seriouseats.com/recipes/2011/09/homemade-moon-pies-recipe.html", "description": "The marshmallow cream/graham cracker/chocolate shell trifecta is more than worthy of a makeover.", "totalTime": "2 hours", "recipeYield": "24", "recipeCategory": ["Chocolate", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the Graham Crackers</strong>", "2 cups all-purpose flour", "1 cup graham flour", "3/4 cup tightly packed dark brown sugar", "1/2 teaspoon baking soda", "1/2 teaspoon Kosher salt", "5 tablespoons unsalted butter, cold, cubed", "1/4 cup honey", "1/4 cup whole milk", "1 tablespoon vanilla extract", "&nbsp;", "<strong>For the Marshmallow Filling</strong>", "1 packet of unflavored gelatin (2 1/2 teaspoons)", "1/3 cup cold water, for gelatin, plus 1/4 cup for syrup", "1 cup sugar", "1 teaspoon vanilla extract", "&nbsp;", "<strong>For the Chocolate Coating</strong>", "16 ounces dark chocolate (I used 72% cacao)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Combine flours, sugar, baking soda, and salt in the bowl of a food processor and pulse until thoroughly combined. Add butter and pulse, scraping down sides as necessary until pea-sized chunks remain, 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl whisk together honey, milk, and vanilla until thoroughly combined. Stream mixture into the food processor while running; dough should come together in a ball after a minute or two. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface roll dough out to 1/8” thick. Using your biscuit or cookie cutter, cut out 48 rounds and transfer to parchment lined baking sheets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prick cookies with a fork and bake for 8-10 minutes or until dry to the touch and golden brown. Remove from baking sheet and transfer to wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer, sprinkle gelatin evenly over 1/3 cup of cold water. Allow gelatin to soften, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine 1/4 cup of water, sugar, and vanilla and stir over medium-high heat until sugar is dissolved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop stirring, and place a candy thermometer into sugar water, wiping any sugar crystals from the side with a wet brush. Boil sugar until temperature reaches the \"soft-ball stage\" (238&deg;F), and don’t take your eyes off it. Timing is everything in confection and you don’t want the syrup to crystallize. Once 238&deg;F is reached, remove from heat. Working quickly, add syrup to softened gelatin, using the whisk attachment of an electric mixer, hand-stir the mixture for a few minutes as it cools. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat on medium high with the whisk attachment until soft peaks form and the white fluffy mixture holds shape, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly, spoon marshmallow mixture on 24 of the cooled graham crackers then top with the remaining grahams. You'll want to use enough marshmallow to fill the middle without oozing out the sides (about one tablespoon of marshmallow mixture per sandwich). Return graham sandwiches to wire racks and chill in the refrigerator for about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While graham sandwiches chill, bring water to a simmer in a double boiler. Break up chocolate into pieces and add to top of double boiler. Once chocolate has melted, let cool 5 minutes, then spoon over graham sandwiches. Use the back of the spoon to smooth the chocolate in a circular motion to get it to spill over the sides evenly. Return racks to the refrigerator for at least 20 to 30 minutes for chocolate to harden. Store in the refrigerator until ready to serve.</p>"}]}