{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101220ProvencalSeafoodPasta610.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["clam", "clams", "French in a Flash", "mussel", "mussels", "pasta", "seafood", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Provençal Mussels and Clams Over Shells", "link": "https://www.seriouseats.com/recipes/2011/01/french-in-a-flash-provencal-mussels-and-clams-over-shells-recipe.html", "description": "The food of Provence, in the south, is our own personal French diet cookbook. Seafood tossed with fresh tomatoes, bright herbs, garlic, and chili makes for the perfect dinner. The French don't get fat for a reason.", "totalTime": "50 minutes, plus 1 hour for soaking the seafood", "recipeYield": "4", "recipeCategory": ["Clams, Mussels, and Oysters", "French", "Pasta"], "recipeIngredient": ["1 pound mussels", "1 pound littleneck clams", "Fine sea salt", "2 pints grape tomatoes", "2 cloves garlic, shaved", "2 tablespoons olive oil, plus extra for drizzling", "15 leaves fresh basil, divided", "1/4 teaspoon granulated sugar", "1/2 teaspoon dried red pepper flakes", "1 pound pasta shells", "Freshly cracked black pepper."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the mussels and clams in a large bowl of water and ice with 1 to 2 tablespoons all-purpose flour. Leave for 1 hour. The mussels and clams will spit out any sand. Lift the seafood out of the water, and rinse. Discard any open shells.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to boil, and salt it well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse together the tomatoes in a food processor until almost complete pureed. In a braising pot, add the oil and heat over low heat.  Add the garlic, and cook 1 minute. Add the tomatoes, and 12 basil leaves, torn.  Add the sugar and red pepper flakes, and season with salt and pepper.  Bring to a boil, cover, and simmer on low for 27 minutes. Remove the lid, and increase the heat to medium-high for 2 to 3 minutes, until some of the liquid has evaporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta to the boiling water. Add the clams to the tomato sauce, and cover. Cook on medium heat for 5 minutes. Add the mussels to the clams, and cover, continuing to cook over medium heat for another 5 to 8 minutes, or until all the seafood has opened. Drain the pasta when it is al dente.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the pasta with the seafood and sauce, and cook an addition 1 to 2 minutes on low so the pasta can soak up the sauce. Drizzle with extra olive oil, season with salt and pepper, and serve immediately.</p>"}]}