{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/02242011-139454-roast-pork-loin-cabbage-semmelknodel.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cabbage", "pork", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brined Pork Roast with Red Cabbage and Semmelknödel", "link": "https://www.seriouseats.com/recipes/2011/03/brined-pork-roast-with-red-cabbage-and-dumplings-recipe.html", "description": "A simple pork roast combined with wilted cabbage and a soft semmelknödel is a favorite family meal for many of us who grew up with Eastern European family. <strong>Semmelknödel are a simple bread dumpling</strong>, boiled in salted water and served alongside pork and cabbage.  These dumplings may seem like a lot of work, but rest assured: when they are sliced and fried in butter then topped with a fried egg the following morning, you'll be happy you invested the time.", "totalTime": "4 hours 30 minutes", "recipeYield": "4-6 (depending on size of roast)", "recipeCategory": ["Cabbage", "Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["3 1/2 – 4 1/2 pound bone-in center pork loin roast", "4-6 medium onions, halved", "Brine:", "2 small lemons, halved", "5 ounces salt", "1 small onion, halved", "1 small bunch of sage", "10 peppercorns", "36 ounces water", "20 ounces ice water", "Cabbage:", "1/2 medium red cabbage, sliced", "6 medium shallots, sliced", "olive oil", "2 tablespoons cider vinegar", "Kosher salt and cracked black pepper", "Semmelknödel:", "1 1-pound loaf Italian Bread", "1 medium onion, diced", "4 ounces (about 4 strips) bacon", "3/4 cup all-purpose flour", "3 eggs", "1/4 cup milk", "Kosher salt and cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring lemons, salt, onion, salt, peppercorns and water to a boil.  Cover and let sit for 10 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour brine into container large enough to hold brine, roast and ice water.  Pour in the ice water and stir until mixture cools.  Add pork roast and let sit at room temperature 2-3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450&deg;.  Once pork has finished brining, place halved onions in bottom of pyrex dish, pat pork loin dry, and place pork on top of onions, bone side down.  Roast until internal temperature of pork roast reaches 140&deg;, or about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut bread into 1/2 inch cubes.  Fry bacon until fat is rendered and bacon is beginning to crisp; remove from pan and drain.  Add diced onion to bacon fat and cook until onions begin to brown.  Dice cooked bacon and add to bread cubes; add onions and fat to bread and toss until onions, fat and bacon are evenly distributed.  Sprinkle flour over onion/bread mixture and toss to evenly coat all bread cubes.  Beat eggs and milk together; sprinkle with salt and pepper.  Pour milk/eggs over bread mixture and combine.  Using your hands, bring the mixture together, pressing until mixture becomes pasty but not mushy.  Make 10 evenly sized dumplings, pressing together firmly while forming dumplings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle large skillet with olive oil and heat over medium high heat until shimmering.  Add sliced shallots; cook until soft, about 4 minutes.  Add cabbage and toss with shallots. Cook until soft but not mushy, about 8 minutes.  Drizzle with cider vinegar and season to taste with salt and cracked black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil and boil dumplings for 20 minutes, turning gently every few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once pork has rested at least 15 minutes, slice and serve with semmelknödel and roasted cabbage, a dab of mustard, and large steins of beer.</p>"}]}