{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110522-127355-dinner-tonight-scallops-asparagus-snap-peas.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["asparagus", "Dinner Tonight", "peas", "scallops", "seafood", "spring", "sugar snap peas", "The Young Man and The Sea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Scallops with Asparagus and Sugar Snap Peas", "link": "https://www.seriouseats.com/recipes/2011/05/scallops-with-asparagus-and-sugar-snap-peas.html", "description": "I was sold on this recipe from <strong>David Pasternack's <em><a href=\"http://www.amazon.com/dp/B002NPCWBA/?tag=serieats-20\">The Young Man &amp; the Sea</a></em></strong> (which, it should be noted, SE overlord Ed Levine co-wrote) from the moment I saw the combination of fresh asparagus and sugar snap peas. <strong>Could any recipe scream spring more?</strong> Both of them only need a few minutes in a hot pan, and they come out bright green and perfectly tender. Scallops, of course, are always a great addition, and their inherent sweetness really plays well with the vegetables.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Asparagus", "Dinner Tonight", "Legumes", "Other Seafood"], "recipeIngredient": ["<strong>For the Herb Garden Vinaigrette</strong>", "¼ cup extra-virgin olive oil ", "¼ cup canola oil ", "3 tablespoons sherry vinegar ", "2 tablespoons fresh dill, chopped", "1 tablespoon fresh tarragon, chopped", "salt and pepper ", "<strong>For the Scallops, Asparagus, and Sugar Snap Peas</strong>", "4 tablespoons olive oil, divided ", "½ pound sugar snap peas ", "½ pound thin asparagus, tough ends removed, cut into 2-inch pieces", "1 pound sea scallops (about 12)", "3 tablespoons unsalted butter, cut into 12 pieces ", "salt and black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Herb Garden Vinaigrette: Pour vinegar into a medium-sized bowl. Slowly whisk in the olive and canola oils. Stir in the chopped herbs and season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Scallops, Asparagus, and Sugar Snap Peas: Add two tablespoons of the olive oil to a large saute pan and turn heat to medium-high. When shimmering, add the sugar snap peas and asparagus. Cook, stirring often, until tender and bright green, three to four minutes. Transfer to a second medium-sized bowl. Toss with about half of the vinaigrette and taste. Add more of the vinaigrette if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the scallops with paper towels, and then season each with salt and pepper on both sides. Pour the remaining two tablespoons of olive oil into a large nonstick skillet. Turn heat to medium-high. When shimmering, add the scallops to the pan. Top each scallop with a piece of butter. Let them cook undisturbed until golden brown on the bottom, about three minutes. Flip them and cook until golden brown on the other side, about two minutes. Transfer scallops to a plate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the asparagus and sugar snap peas among four plates. Top each with three scallops. Season with salt and pepper to taste.  </p>"}]}