{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-179926-quince-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pie", "quince", "streusel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quince and Cardamom Streusel Pie", "link": "https://www.seriouseats.com/recipes/2011/12/quince-and-cardamom-streusel-pie-recipe.html", "description": "The aromas from the simmering and baking quince make this pie more than worth the effort&mdash;and it's delicious, too.", "totalTime": "8 hours", "recipeYield": "Serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "140 grams unsalted butter", "110 grams all purpose flour", "85 grams light brown sugar", "1/4 teaspoon salt", "7 quince, peeled, cored, and chopped into half-inch pieces", "100 grams granulated sugar, plus more (to taste)", "1 teaspoon ground cardamom", "1 vanilla bean, split with the seeds scraped", "Zest of 1 lemon", "1 quart water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the filling: In a medium sized pot, combine the quince, sugar, water, vanilla bean seeds and pod, and the zest. Cover the pot and bring to a simmer over low heat. Simmer on low for 45 minutes to 1 hour, gently stirring, until the fruit begins to take on a pink hue. Turn off the heat and allow the fruit to cool to room temperature in its juices. Taste the filling for sweetness (quince will vary so the sugar must be adjusted accordingly) and add sugar to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the topping: Mix butter and brown sugar together by hand. Add the flour, cardamom, and salt. Stir until combined, then chill for at least 1 hour before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blind bake the crust: Preheat the oven to 425&deg;F. Line the chilled, shaped crust with foil or parchment paper and fill with pie weights (I re-use dried beans for this purpose) and place directly into the preheated oven. Bake for 15 minutes, then remove the weights and liners and return the pie to the bottom rack of the oven and bake until the bottom is a light golden brown.  Remove the pie from the oven and reduce the heat to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the pie: Fill the crust with the filling and place it in the 350&deg;F oven in the center of the bottom rack. Bake for 15 minutes, then top with crumbled, chilled topping. Place the pie back in the oven and bake for an additional 30 minutes, until the filling begins to bubble and the topping is golden brown. If you are worried about the crust looking too dark, place a piece of foil loosely over the dark areas to protect from the heat of the oven. Allow the pie to cool completely before serving.</p>"}]}