{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110118SwordfishPaillard.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French in a Flash", "fruit", "salad", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Swordfish Paillard with Citrus Salad", "link": "https://www.seriouseats.com/recipes/2011/01/french-in-a-flash-swordfish-paillard-with-citrus-salad-recipe.html", "description": "Flash-seared paper-thin fish is topped with a fresh, bright salad of grapefruit, blood orange, fennel, and cured black olives. Nothing like winter citrus to beat the winter blues.", "totalTime": "15", "recipeYield": "4", "recipeCategory": ["Fish", "French", "Salads"], "recipeIngredient": ["Four 6-ounce fillets swordfish", "1/2 cup olive oil, divided", "Kosher salt", "Freshly cracked black pepper", "4 ounces mixed baby spinach and baby arugula salad", "1 blood orange", "1 grapefruit", "1/4 cup fresh lemon juice", "40 oil-cured black olives", "1 fennel bulb, thinly sliced", "1 clove garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the skin off the fish fillets, and butterfly them. Place each fillet between 2 large sheets of plastic wrap, and pound fish to between 1/4- and 1/2-inch thin with rolling pin. Place fish in baking dish with 1/4 cup olive oil, and season with salt and pepper. Preheat panini press or two-sided grill press to its highest heat setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Zest orange and reserve. Segment orange and grapefruit. Wring out juice from what is left of orange and reserve. Toss orange and grapefruit segments with spinach and arugula salad, black olives, and fennel.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together orange juice and zest, lemon juice, remaining 1/4 cup olive oil, and salt and pepper until emulsified. Toss salad with dressing and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once grill press is hot, grill fish, one fillet at a time, until fish is opaque, and just beginning to color, about 1 minute. Set aside, and repeat with remaining fish fillets. Cut clove of garlic in half, and while fish is hot, rub each fillet very gently with cut edge of garlic clove. Place fish on large platter and top with salad. Serve immediately.</p>"}]}