{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110228-139184-samoascoconut.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "caramel", "coconut", "Cookies", "Girl Scout Cookies", "Girl Scouts", "Samoas", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Cakespy: Homemade Samoas Girl Scout Cookies", "link": "https://www.seriouseats.com/recipes/2011/02/how-to-make-girl-scout-cookies-samoas-from-scratch-recipe.html", "description": "When you've reached the end of your box from your local Scouts, there's a surefire solution for sweet gratification: make your own batch of Samoas! Or Caramel de-Lites, whatever you want to call them.", "totalTime": "2 hours", "recipeYield": "36", "recipeCategory": ["Cakespy", "Coconut", "Cookies"], "recipeIngredient": ["For the cookies", "1 cup (2 sticks) butter, softened", "1/4 cup granulated sugar", "1/4 cup light brown sugar, packed", "2 cups all purpose flour", "1/4 teaspoon baking powder", "1/2 teaspoon salt", "1/2 teaspoon vanilla", "2 tablespoons milk or cream ", "For the topping", "14 ounces caramel candies, unwrapped (I used one bag of Kraft Caramels)", "1/2 teaspoon salt", "3 cups shredded, sweetened coconut, toasted", "To finish (for the top stripes and bottom chocolate coating)", "16 ounces semisweet or dark chocolate (I used semisweet chocolate chips)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Line two baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the cookie base. Using the paddle attachment in a stand mixer, cream the butter and sugars until light and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, sift together the flour, salt, and baking powder. In 2-3 increments, stir into the butter mixture, scraping down the sides of the bowl occasionally. Stir in the vanilla and mix again until incorporated; stir in one tablespoon of milk or cream, adding the rest if the dough seems too stiff to be easily handled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in 2-3 batches, roll out the dough between two sheets of parchment or waxed paper until it is about 1/4 inches thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you have one, use a small doughnut cutter to cut out approximately 1 1/2 inch circles (the doughnut cutter will take the middle out for you!). If you don't have a doughnut cutter, cut out circles of approximately 1 1/2 inches using a cookie cutter and cut out holes in the center using a knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently transfer the cutouts to the prepared baking sheets, leaving about an inch of room between rounds (they will spread, but not too much). Bake for 10-12 minutes, or until lightly golden on the sides and bottom with a dull finish on top. Remove from the oven and let them cool for about 5 minutes on the sheet before transferring to a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the caramel-coconut topping. In a medium saucepan over low heat, melt the (unwrapped!) caramels, stirring frequently to prevent scorching the pan. When it is smooth and no caramel lumps remain, add the salt and toasted coconut and stir with a wooden spoon (it will be a bit of a workout) until the coconut is fully coated. Remove from heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a small offset spatula or even a spoon, gently spread 2-3 teaspoons of the caramel-coconut mixture on top of each cookie. If you've covered the holes in the cookies, you can press a small indent in the center to get the classic look of the traditional cookies, or you can rejoice in more topping and just chill out about it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the topping is setting on the cookies, prepare your chocolate for coating the bottom of the cookies and finishing the tops. In a large microwave-safe bowl, heat the chocolate in 30-second intervals, stirring after each interval, until smooth and melted (you can also do this over the stovetop, if you feel like washing out that coconut-coated medium saucepan you used for the topping).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the bottom of each cookie in the melted chocolate and then place on a piece of waxed paper or parchment paper. Once all of the cookie-bottoms have been dunked, transfer the remaining chocolate to a small piping bag, and pipe stripes across the top of the cookies. Or if that seems too hard, simply spoon a dollop of chocolate on top of each cookie. (Tip: a dollop of peanut butter on top, while not traditional, tastes great too!)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cookies set for at least an hour before serving.</p>"}]}