{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110515-152073-fresh-peas-with-lettuce.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Andrea Reusing", "Cook the Book", "Cooking in the Moment", "green garlic", "lettuce", "peas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fresh Peas with Lettuce and Green Garlic", "link": "https://www.seriouseats.com/recipes/2011/05/fresh-peas-with-lettuce-and-green-garlic-recipe.html", "description": "On paper, this recipe for <strong>Fresh Peas with Lettuce and Green Garlic</strong> couldn't be simpler. Virtually all of the dish's ingredients are listed in the title save for salt, pepper, and butter. It's all about tender young peas, earthy leaves of wilted lettuce, mild green garlic, and enough sweet butter to bring the dish together. It's a recipe that's indicative of Reusing's approach to home cooking&mdash;simple techniques and superb use of in season ingredients.", "totalTime": "10 minutes", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Garlic", "Legumes", "Sides", "Vegetarian"], "recipeIngredient": ["4 tablespoons (½ stick) unsalted butter, at room temperature", "5 small stalks green garlic, any tough parts trimmed, sliced into very thin rounds", "Kosher salt", "1½ cups fresh or frozen shelled green peas", "2 small heads of butter lettuce, washed and torn into pieces", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons of the butter in a medium sauté pan over low heat. Add the green garlic and a pinch of salt. Cook over low heat, stirring occasionally, for 2 to 3 minutes, until the garlic is tender and fragrant but with no color. Add the peas and cook for 3 to 5 minutes, until they are tender and sweet. Stir in the lettuce and the remaining 2 tablespoons butter; add 1 tablespoon water if the mixture seems dry. Remove the pan from the heat and toss gently until the lettuce wilts and the butter melts. Season with fresh pepper and additional salt if needed.</p>"}]}