{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110630-158892-yaki-onigiri.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bonito", "Cook the Book", "grill", "grilling", "Harris Salat", "rice", "sesame", "Tadashi Ono", "The Japanese Grill"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bonito Flakes-Black Sesame Yaki Onigiri", "link": "https://www.seriouseats.com/recipes/2011/06/bonito-flakes-black-sesame-yaki-onigiri-recipe.html", "description": "These <strong>Bonito Flakes-Black Sesame Yaki Onigiri</strong> from <em><strong><a href=\"http://www.amazon.com/Japanese-Grill-Classic-Yakitori-Vegetables/dp/158008737X/?tag=serieats-20\">The Japanese Grill</a></strong></em> by <a href=\"http://www.japanesefoodreport.com/about.html\">Harris Salat</a> and <a href=\"http://www.matsurinyc.com/tadashiono.php\">Tadashi Ono</a> were my first encounter with yaki onigiri, and I have to say, they were a smash hit. The onigiri begins with warm rice gently mixed with finely chopped bonito flakes and toasted black sesame seeds.  The bonito melts into the rice, flavoring it with a very appealing fishy saltiness.", "totalTime": "15 minutes", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Grilling", "Rice"], "recipeIngredient": ["4 cups cooked rice", "1 packed cup katsuobushi, dried shaved bonito flakes (a type of tuna), chopped fine", "5 teaspoons roasted black sesame seed", "1/4 cup soy sauce "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently mix together the rice, bonito, and sesame seed in a bowl. Form into onigiri (see <strong>How to Make Yaki Onigiri</strong>, below).<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>How to Make Yaki Onigiri:</strong> Use 1 cup of hot (or warm) cooked Japanese short grain rice per serving.  Add the rice to a small bowl (like a cereal bowl) just big enough to hold it. Jiggle the bowl, moving it in a flat, circular motion, like the motion of a hula hoop, until the rice forms into a ball on its own—a neat kitchen trick Tadashi’s mom taught him. This motion packs the rice so it holds together when it grills.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wet your hands and place the ball of rice between your cupped palms. Now squeeze, flip, and turn the rice ball several times to form it into a triangular shape. This motion takes a little practice, but after a few yaki onigiri, you’ll get the hang of it. Make sure not to compact the rice too tight; you want it to just stick together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a grill to medium. Grill the onigiri for about 6 minutes, flipping once. Brush the onigiri with the soy sauce. Grill for about 2 minutes more, flipping every 30 seconds, and brushing on more soy sauce after each turn. Grill the edges of the onigiri triangle, too, about 20 seconds per edge. The onigiri will have a crispy, caramelized crust when they’re done. Serve immediately.<br />\n</p>"}]}