{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110908-dt-grilled-portobello-and-peach-sandwich-with-avocado.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "grill", "grilling", "mushrooms", "peaches", "sandwich", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Grilled Portobello and Peach Sandwich", "link": "https://www.seriouseats.com/recipes/2011/09/dinner-tonight-grilled-portobello-and-peach-sandwich-recipe.html", "description": "On its own terms, a grilled portobello is a wonderful sandwich mainstay, especially when paired with an incredibly ripe grilled peach. In addition to the mushroom&mdash;which is marinated in garlicky, herb-flecked olive oil&mdash;a mashed avocado spread adds the crucial creamy element, and peppery arugula provides a fresh counterpoint.", "totalTime": "35 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dairy-Free", "Dinner Tonight", "Mushrooms", "Peach", "Sandwiches", "Vegan", "Vegetarian"], "recipeIngredient": ["4 portobello mushrooms", "3 tablespoons olive oil", "1 large sprig rosemary sprig", "1 tablespoon fresh chopped thyme", "3 small cloves garlic, minced", "Juice of 1/2 lemon", "Salt and pepper to taste", "2 large avocados, halved and pitted", "2 roma tomatoes, seeded and chopped", "4 peaches, halved, pitted, and cut into thick slices", "4 ciabatta rolls or other burger buns of your choice, preferably toasted or grilled", "2 cups baby arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a wet cloth or paper towel, clean the portobello mushrooms to remove any dirt. Pull half the leaves off the rosemary sprig and roughly chop, leaving the rest of the leaves near the end to use as a grilling brush. In a large bowl, combine the chopped rosemary with the olive oil, thyme, 3/4 of the garlic, and half the lemon juice with a pinch of salt and pepper. Add the mushrooms and toss to coat well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the mushroom marinates, mash the avocados in a second bowl and add the remaining garlic, lemon juice, and chopped tomato. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a charcoal or gas grill, or heat a ridged grill pan over high heat for a full minute. Lay the mushrooms on the grill and cook until nicely caramelized and starting to release their liquid, but not completely dry, 3-5 minutes per side. On another part of the grill or grill pan, cook the peach slices until caramelized and soft, 4-5 minutes per side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, briefly toast the rolls or buns on the grill. While the mushrooms and peaches continue to cook, spread the avocado mixture on both sides of the buns or rolls and divide the arugula amongst the four sandwiches.  Top with the mushrooms, followed by the peaches. For a neater package, secure the sandwich with large toothpicks. Serve right away while the mushrooms are still hot and juicy.</p>"}]}