{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110202-135800-eat-for-eight-bucks-maple-mustard-chicken-potatoes.jpg", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["chicken", "Eat for Eight Bucks", "mustard", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Eat for Eight Bucks: Maple-Mustard Baked Chicken Thighs with Potato Wedges", "link": "https://www.seriouseats.com/recipes/2011/02/eat-for-eight-maple-mustard-baked-chicken-thigh-recipe.html", "description": "One of my favorite meals these days is a whole chicken roasted on top of potatoes. The chicken is flavorful with garlic, olive oil, and herbs. The potatoes are perhaps even better: they get seasoned with the chicken's juices, plus more olive oil and more herbs. But easy as it may be, roasting a whole chicken isn't that cheap, and it takes a while. So I've been experimenting with roasting chicken thighs and legs, and adding flavor even during a shorter cooking time.", "totalTime": "3 hours", "recipeYield": "2", "recipeCategory": ["Chicken", "Eat for Eight Bucks", "Mains", "Potato"], "recipeIngredient": ["1 tablespoon cider vinegar", "2 tablespoons maple syrup", "3 tablespoons olive oil", "1 tablespoon whole grain mustard", "1 teaspoon kosher salt", "freshly ground pepper", "4 chicken thighs, bone-in and skin on (1-1.25lb)", "1 1/2 lb large Yukon Gold potatoes", "2 tablespoons white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl large enough to hold the chicken, combine the vinegar, maple syrup, 1 tablespoon olive oil, mustard, ½ teaspoon salt, and a few grinds of freshly ground pepper. Put the chicken thighs in the bowl and toss to coat with the marinade. Place in the fridge and let marinate for 2-3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to eat, preheat the oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the potatoes into 8 wedges each—6 if they’re small. Place them in a 9 x 13-inch ceramic baking dish and toss with 1 tablespoon olive oil and ½ teaspoon salt. Bake for 15 minutes, until they are starting to cook but definitely not done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the remaining tablespoon of oil over high heat in a heavy frying pan or saucepan large enough to fit all the chicken. Let any excess marinade drip off the chicken, then place each piece skin side down. Cook for 3 minutes, until the skin is brown and comes off the pan easily, then flip and cook another 2-3 minutes on the second side. Remove the chicken from the pan and place on top of the potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the marinade and the wine into the frying pan and let come to a simmer, scraping the bottom of the pan to get up all the sucs. Pour the marinade mixture over the chicken and the potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the oven temperature to 400°F. Roast the chicken and potatoes for 20-30 minutes, until the potatoes are fully cooked and the juices from the chicken run clear. (If you're not sure, cut into the chicken to check that it's no longer pink.) Remove from the oven and serve immediately.</p>"}]}