{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110526-127355-dinner-tonight-cornbread-and-beef-skillet-pie.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beef", "cornbread", "Dinner Tonight", "Martha Stewart", "pies", "savory pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Dinner Tonight: Cornbread and Beef Skillet Pie", "link": "https://www.seriouseats.com/recipes/2011/06/cornbread-and-beef-skillet-pie-recipe.html", "description": "It's not often that I have pounds of ground beef in my fridge and burgers aren't planned for dinner that evening. But I really wanted to try something new. I initially considered meatloaf, but I couldn't find the right recipe (do you have one for me?). Then I came across this recipe from <a href=\"http://www.marthastewart.com/317305/cornbread-and-beef-skillet-pie\">Martha Stewart</a> for a cornbread and beef skillet pie with red peppers and mushrooms. While the meat portion of the dish sounded good, I was ultimately sold on the biscuits that cooked on top.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Beef", "Dinner Tonight"], "recipeIngredient": ["½ cup yellow cornmeal ", "½ cup plus 2 tablespoons all-purpose flour ", "1 teaspoon baking soda", "salt and pepper ", "1 tablespoon olive oil ", "2 red bell peppers, stemmed, seeded, and thinly sliced", "1 medium red onion, chopped", "10 ounces white mushrooms, stems removed, thinly sliced", "1 ½ pounds ground sirloin ", "¼ cup tomato paste ", "¾ cup reduce-fat sour cream ", "1 large egg, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. Meanwhile, whisk together cornmeal, ½ cup flour, baking soda, and ½ teaspoon salt in a medium-sized bowl. In a second bowl, whisk together the remaining two tablespoons of flour and ⅔ cup of water. Set both bowls aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour oil into a large ovenproof skillet set over medium-high heat. When oil is shimmering, add peppers, onion, and mushrooms. Season with salt and pepper. Cook, stirring occasionally, until vegetables are tender, six to eight minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn heat to high and add beef and the tomato paste. Stir constantly, breaking up the meat with a wooden spoon, until the meat is no longer pink, about 3 minutes. Slowly pour in the flour and water mixture. Season with more salt and pepper, and let cook until thick, stirring occasionally, about two more minutes. Turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sour cream and the whisked egg to the bowl of cornmeal and flour. Stir until just combined. Scoop up one tablespoon of the batter and place on the beef. Repeat process, placing the batter about 1-inch apart from each other. Transfer skillet to the oven and cook until biscuits are golden brown, 15 to 20 minutes.  </p>"}]}