{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110919-127355-dinner-tonight-steamed-salmon-ginger-garlic.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Vietnamese", "keywords": ["Andrea Nguyen", "Dinner Tonight", "fish", "Into the Vietnamese Kitchen", "oyster sauce", "salmon", "steaming", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Steamed Salmon with Garlic and Ginger", "link": "https://www.seriouseats.com/recipes/2011/09/steamed-salmon-with-garlic-and-ginger-recipe.html", "description": "Of all the cooking methods I use, steaming is probably close to the bottom of the list. Part of that is my fault; I don't usually get excited when I see \"steaming\" mentioned in recipes, correlating it unfairly with bland and boring. But bland and boring is about the last thing you'd say about this recipe from Andrea Nguyen's <em><a href=\"http://www.amazon.com/dp/1580086659/?tag=serieats-20\">Into the Vietnamese Kitchen</a></em>. The salmon fillets come out of the steamer juicy and coated in a flavorful sauce.", "totalTime": "45 minutes", "recipeYield": "3 to 4 people", "recipeCategory": ["Dinner Tonight", "Salmon", "Vietnamese"], "recipeIngredient": ["<strong>For the sauce:</strong>", "1 1/4 teaspoons sugar ", "1/4 teaspoon black pepper", "2 tablespoons oyster sauce ", "2 tablespoons light soy sauce ", "2 1/2 tablespoons canola oil ", "3 garlic cloves, minced", "2-inch piece fresh ginger, peeled and finely shredded", "3 scallions, green part only, chopped", " ", "<strong>For the steamed salmon</strong>", "1 scallion, white part only, cut lengthwise into strips", "1 1/4 pounds salmon fillet, cut crosswise into two pieces", "4 sprigs cilantro "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the sauce: In a small bowl, combine the sugar, pepper, oyster sauce, and soy sauce. Stir until the sugar is dissolved. Pour the oil into a small saucepan, and turn the heat to medium. Add the garlic and cook until fragrant, about 15 seconds. Add the ginger and cook until it is also fragrant, about one minute. Pour in the sauce, stir well, and wait for it to come to a boil. Then add the scallions, turn off the heat, and stir to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the steamed salmon: Fill a large pot with a steamer tray halfway up with water, and bring to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, Find a heatproof plate or nonreactive cake or pie pan that will hold the salmon fillets and will also fit in the steamer tray with about one-inch left around the edges. Toss half of the white scallion strips into the pan, and then place the salmon fillets on top. Pour the sauce on top of the salmon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pan to the steamer tray. Cover the pot, and cook until fish is cooked, eight to ten minutes. A knife should be able to be inserted into the thicket part of the flesh easily. When done, turn off the heat, and carefully remove the pan with the fish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the fish to a platter and pour the sauce and juices on top. Garnish with the remaining scallion strips and the cilantro. </p>"}]}