{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20100518-cuttys-roast-beef-primary.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["Cutty's", "Cutty's Week", "roast beef", "roast beef sandwiches", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Roast Beef 1,000 from Cutty's", "link": "https://www.seriouseats.com/recipes/2011/10/the-roast-beef-1000-sandwich-from-cuttys.html", "description": "Note: You will have far more roast beef than is necessary for the sandwiches. Roast beef can be stored in a sealed container in the fridge for up to 5 days. Feel free to use thinly sliced store-bought roast beef...", "totalTime": null, "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Sandwiches"], "recipeIngredient": ["6 medium shallots, sliced 1/8th-inch thick on a mandoline, dried with paper towels", "2 cups vegetable oil", "Kosher salt", "1 (five pound) whole beef chuck roll roast", "1/2 cup prepared Thousand Island dressing", "1 tablespoon prepared horseradish (or more to taste)", "Brioche sandwich buns", "1/4 pound thinly sliced sharp cheddar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shallots and oil in small saucepot and cook over high heat until oil starts to bubble. Reduce heat to medium and continue to cook, stirring frequently and adjusting heat to maintain steady stream of bubbles. Cook until shallots are rust colored, about 15 minutes. Carefully pour through a strainer into a second pot, then transfer shallots to a paper towel-lined plate. (Save oil for stir-fries or for second batch of shallots). Separate shallots with fork and season with salt. Allow to cool completely before storing in a sealed container (will keep for several weeks at room temperature).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season beef with 3 tablespoons kosher salt. Set on a rack in a baking dish, wrap in plastic, and refrigerate overnight. The next day, preheat oven to 475°F and adjust rack to lower-middle positions. Roast until beef is lightly browned, 35 to 45 minutes. Flip roast, reduce heat to 300°F ,and continue roasting until center registers 135°F on an instant-read thermometer, 45 minutes to 1 hour longer. Remove from oven and allow to rest at least 45 minutes. Slice as thinly as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine Thousand island and horseradish in a small bowl. Split rolls in half and toast. Spread dressing generously on cut sides. Sprinkle shallots generously on top side of roll. Top with cheese. Place about 4 ounces beef on bottom half of sandwich. Close sandwiches, cut, and serve.</p>"}]}