{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111229-fiaf-mushroom-pate-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["condiments", "French in a Flash", "mushrooms", "spreads", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Awesome Mushroom Pâté", "link": "https://www.seriouseats.com/recipes/2011/12/awesome-mushroom-pate-recipe.html", "description": "The perfect ritzy New Year's nibble: roasted wild mushroom pâté with thyme, garlic, and truffle oil. Smeared onto waiting baguette rounds, it goes great with Champagne.", "totalTime": "25 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Condiments and Sauces", "French", "Mushrooms", "Vegetarian"], "recipeIngredient": ["1 1/2 tablespoons finely ground dried mushrooms (a mini food processor should be able to grind a big handful of dried mushrooms)", "13 ounces mixed mushrooms, caps quartered, stems roughly chopped (unless they're inedible)", "3 tablespoons olive oil", "4 cloves garlic, left whole and in their paper jackets", "About 8 whole stems of thyme", "Kosher salt", "Freshly cracked black pepper", "3 ounces Neufchatel cheese", "1 tablespoon flat leaf parsley, packed", "2 teaspoons lemon juice", "Truffle oil, for drizzling", "Baguette, thinly sliced, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Put a wide ovensafe braising pot on the stove over medium-high heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the olive oil to the hot pot, followed immediately by the mushrooms, dried mushrooms, garlic, thyme, salt, and pepper. Toss everything together with tongs so the mushrooms are well coated with the hot olive oil. Put the mushrooms about 5 to 6 inches from the broiler and cook for 15 minutes, tossing once. The residual heat from preheating the pot will help brown the mushrooms.  Scrape everything out of the mushroom pot into a bowl to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the mushrooms are room temperature, set aside 1/4 cup for garnish. Squeeze the garlic from their jackets and put them and rest of the mushrooms in the food processor with the Neufchatel, parsley, and lemon juice. Whiz until smooth. Taste, and adjust the seasoning. Decant to a pretty bowl, then drizzle with truffle oil, top with the reserved mushrooms, and serve with thinly sliced baguette.  </p>"}]}