{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110614-156599-Nick-Malgieri-Coconut%20cakes-610.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["cakes", "coconut", "Nick Malgieri"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Individual Coconut Cakes", "link": "https://www.seriouseats.com/recipes/2011/06/individual-coconut-cakes-nick-malgieri-recipe.html", "description": "These snow-white little cakes are as delicious as any coconut sweet I've ever tasted.", "totalTime": "35 minutes", "recipeYield": "Makes 24 individual cakes or one 8-inch round cake", "recipeCategory": ["Cakes", "Coconut"], "recipeIngredient": ["3/4 cup sugar", "1/2 cup (2.25 ounces) all-purpose flour (spoon flour into dry-measure cup and level off)", "1 1/2 cups (about 4 ounces) unsweetened dried coconut", "4 large egg whites", "Pinch of salt", "2 teaspoons finely grated lemon zest", "8 tablespoons (1 stick) unsalted butter, melted and slightly cooled", "2 tablespoons sweetened shredded coconut or unsweetened ground or shredded coconut for topping the cakes before baking"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a rack in the middle level of the oven and preheat to 375 F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, combine the sugar, flour and coconut; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl, whisk the egg whites with the salt until smooth, then whisk in the lemon zest and butter. Whisk in about half the dry ingredients, then use a rubber spatula to fold in the remainder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the batter into the prepared pans, filling them about two thirds full. Sprinkle the top of each cake with a pinch of shredded coconut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cakes until they are well risen and deep golden and they are firm when pressed with a fingertip, about 15 minutes. Invert them to a rack, then immediately turn them right side up and let them cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> Serve these after dessert with coffee, or as part of an assortment of desserts.<br />\r\n<strong>Storage:</strong> Keep the cakes loosely covered with plastic wrap on the day they are made. Arrange them in a tin or plastic container with a tight-fitting cover in one layer and refrigerate them for longer storage. Bring to room temperature before serving.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variations:</strong> Substitute ground blanched almonds or a combination of ground hazelnuts and ground almonds for the coconut.<br />\r\nBefore baking, sprinkle the top of each little cake with a pinch of shredded sweetened coconut (substitute chopped almonds or hazelnuts for the variation above).</p>"}]}