{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110627-158509-pastry-cream-and-fesh-fruit-tart.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "fruit", "fruit desserts", "Meg Ray", "Miette", "pastry", "pastry cream", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pastry Cream and Fresh Fruit Tart from Miette", "link": "https://www.seriouseats.com/recipes/2011/06/pastry-cream-and-fresh-fruit-tart-from-miette-recipe.html", "description": "Piled high with blueberries, layered with sliced nectarines or dotted with fresh figs, this <strong>Pastry Cream and Fresh Fruit Tart</strong> is delicious with any summer fruit.", "totalTime": "2 hours", "recipeYield": "4 to 6, makes one 7-inch tart", "recipeCategory": ["Bake the Book", "Fruit Desserts"], "recipeIngredient": ["About 1 1/2 cups Pastry Cream, chilled (recipe follows)", "One 7-inch tart shell made with Pâte Sucrée (recipe follows)", "1 to 2 pints mixed fresh fruits alone or in any combination including strawberries, blueberries, blackberries, and red and golden raspberries; or 2 to 3 peeled and thinly sliced nectarines and peaches; or 10 to 12 halved apricots or figs", " ", "<strong>Pastry Cream:</strong>", "2 cups whole milk  ", "1/2 vanilla bean, split and scraped", "7 large egg yolks", "1/2 cup sugar ", "2 tablespoons cornstarch ", "2 tablespoons unsalted butter, at room temperature", " ", "<strong>Pâte Sucrée:</strong>", "3 1/3 cups all-purpose flour", "1/4 cup sugar", "1/2 teaspoon salt", "1 cup cold unsalted butter, cubed ", "2 large egg yolks", "4 to 8 tablespoons heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pastry Cream:</strong> Pour the milk into a medium pot. Use a sharp knife to slit the vanilla bean lengthwise and scrape the seeds into the milk. Put the bean in the milk as well. Heat the milk until almost boiling (bubbles will begin to form at the edges). Cover and let steep for 1 hour if time permits, otherwise proceed as directed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the yolks, sugar, and cornstarch until smooth. Set the bowl on a kitchen towel or nonskid surface and whisk the eggs while pouring about 1/2 cup of the hot milk into them to temper. Gradually pour in the rest of the milk, whisking constantly. Pour the contents of the bowl into the pan and set over medium-low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, whisking constantly, until the mixture thickens and comes to a slow boil, about 2 minutes. Immediately strain the pastry cream through a fine-mesh sieve into a clean container. Discard the vanilla bean or wash and reuse it. Let the pastry cream cool to room temperature, 10 minutes, and then whisk in the butter. You want the butter to be incorporated without being melted. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pastry cream with plastic wrap, pressing it directly on the surface of the cream to prevent a skin from forming. Refrigerate until well chilled, at least 1 hour and up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pâte Sucrée:</strong> In the bowl of a stand mixer fitted with the paddle attachment, combine the flour, sugar, and salt. Mix on low speed for 30 seconds. Add the butter and beat until mixture is the consistency of cornmeal, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the egg yolk and 2 tablespoons of the cream. Add to the flour mixture and stir with a fork until just combined. If the dough does not come together into large chunks, slowly add the remaining cream, a little bit at a time, until it does. Gather the dough into a ball, pat it into a disk, and wrap it tightly in plastic. Refrigerate for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and unwrap. Divide the dough to make the portions you need and again pat gently into disks. On a lightly floured work surface, roll out each dough disk into a round about 1/4 inch thick and about 1 inch greater in diameter than the pan you are using (8 inches for a 7-inch pan; 4 inches for 3 1/2-inch tartlet pans). Drape the rolled-out dough into the tart pan(s), gently pushing it into the bottom edges and against the pan sides to make a strong and straight shell. Trim the edges flush with the rim of the pan(s) using a sharp knife, or roll the rolling pin over the edges to cut off the excess dough. Prick all over the bottom with the tines of a fork and place in the freezer to firm up for 30 minutes. (To store unbaked, wrap the dough ball tightly in plastic wrap and freeze for up to 2 months, or line the tart shell(s) with the dough as desired, cover with plastic wrapp, and freeze for up to 3 days. Thaw the frozen dough ball in the refrigerator for 3 to 4 hours before rolling and shaping. Bake lined and frozen shells straight out of the freezer.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To partially blind-bake the tart shell(s), place in the oven directly from the freezer and bake just until no longer translucent, 5 to 8 minutes. </p>\r\n\r\n<p>To fully blind-bake the tart shell(s), bake until golden brown, about 10 minutes. </p>\r\n\r\n<p>Transfer to a wire rack and let cool completely before filling and proceeding the recipe. Store fully baked shells, wrapped tightly in plastic, at room temperature for up to 3 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the Pastry Cream and Fresh Fruit Tart:</strong>  If making the pastry cream now, let cool to room temperature and then refrigerate until well chilled, about 2 to 3 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the Pâte Sucrée and line a 7-inch tart pan as directed. Fully prebake the shell, transfer to a wire rack, and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the cold pastry cream evenly into the cooled tart shell. Chill for at least 1 hour and up to 8 hours. Just before serving, top attractively with the fruit. </p>"}]}