{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201104026-dt-lamb-meatballs.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "greek", "lamb", "meatballs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Dinner Tonight: Lamb Meatballs", "link": "https://www.seriouseats.com/recipes/2011/04/dinner-tonight-lamb-meatballs-recipe.html", "description": "As much as I might crave a gyro sandwich&mdash;the spiced lamb, cool tzaziki, warm pita&mdash;it's tough to properly reproduce it at home.  Without a turning spit and the associated hassle it would be to use one, it's just not practical. Luckily, it's simple enough to put together all those flavors into a meatball, serve it with pita and greek yogurt or tzaziki, and pretty much cover your ground. It's also possible to pull it off in less than an hour.", "totalTime": "50", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Lamb", "Mains"], "recipeIngredient": ["2 tablespoons olive oil", "1 clove garlic, minced", "1 jalapeño, seeded and minced", "1 large shallot, minced", "1 pound ground lamb", "4 ounces salt pork or bacon, ground or finely minced", "Zest of 1 orange", "2 tablespoons chopped mint", "Freshly ground black pepper", "sea salt", "Greek yogurt for dipping (or combine with minced cucumber, garlic, and dried dill for tzaziki sauce)", "Pita bread cut into triangles and warmed or toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small pan, heat half the olive oil over medium heat until shimmering.  Add shallot, jalapeno, and garlic.  Cook, stirring constantly, for just one minute to soften.  Allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, combine lamb, pork, orange zest, mint, 4-5 turns of ground black pepper, and a 1/2 teaspoon of salt. Mix well with hands to thoroughly combine. (The saltiness of the salt pork can vary, so begin with this amount of salt and form a small patty to cook for testing purposes.  Adjust salt as needed.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form mixture into small meatballs and transfer to a sheet pan.  Heat remaining oil over medium heat in a large (12-inch), heavy skillet, such as cast iron, and brown meatballs in batches until cooked through and golden, 8-10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with Greek yogurt or tzaziki and warm pita.</p>"}]}