{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110324CoconutRicePudding.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["coconut", "desserts", "pudding", "rice pudding", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "The Secret Ingredient (Coconut): Double Coconut Rice Pudding", "link": "https://www.seriouseats.com/recipes/2011/03/the-secret-ingredient-coconut-double-cococut-rice-pudding.html", "description": "This rice pudding uses coconut milk, and dried coconut, plus a few extras like rice and sugar and cream to make this creamy coconut concoction, inspired by Thai coconut rice and coconut ice cream.  It's luscious, not too sweet, decadent, exotic, and comforting.  How's that for a dessert!", "totalTime": "3 hours", "recipeYield": "serves 6", "recipeCategory": ["Coconut", "Desserts", "Puddings and Custards", "The Secret Ingredient"], "recipeIngredient": ["1 cup Valencia rice", "1 13.5-ounce can coconut milk", "6 tablespoons granulated sugar", "Pinch salt", "1/4 cup unsweetened dried flaked coconut, plus 6 tablespoons", "1 vanilla bean", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the rice and 3 cups of water in a medium saucepot.  Bring to a boil, lower the heat, cover, and simmer the rice until tender, about 18 minutes.  Drain in a fine mesh colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the rice back in the pot with the coconut milk, sugar, salt, and dried coconut.  Split the vanilla bean lengthwise, and scrape out the seeds.  Add the seeds and the pod to the rice.  Cook on the lowest heat, uncovered, until thick: 40 minutes.  Turn off the heat, and stir in the cream.  Remove the vanilla pod, and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the pudding into 6 serving dish, and refrigerate for at least 2 hours.  Place a wide sauté pan over medium heat, and add the remaining 6 tablespoons dried coconut.  Toast the coconut, stirring often, until just golden, but not brown—less than 90 seconds.  Take out of the pan immediately so it doesn’t burn, and sprinkle over the cups of rice pudding.</p>"}]}