{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110612-127355-dinner-tonight-warm-squid-salad.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["aiolis", "Dinner Tonight", "salad", "squid", "warm salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Warm Squid Salad", "link": "https://www.seriouseats.com/recipes/2011/06/warm-squid-salad-recipe.html", "description": "Cooking squid requires some special patience, as it needs to be cooked until white, but if you wait too long it'll turn into a rubbery little monster. But in this recipe from <strong>Jonathon Waxman's <a href=\"http://www.amazon.com/dp/B004TE7W2M/?tag=serieats-20\">A Great American Cook</a></strong>, the squid just needs a few seconds in the scorching skillet, so it's easy to whip up. The sauce is made from rice wine vinegar, oil, and a whole bunch of aïoli, which gives each bite a garlic kick. Everything is then tossed with crisp greens. I found some amazing mizuna at the market, which worked perfectly.", "totalTime": "30 minutes", "recipeYield": "3 to 4 people", "recipeCategory": ["Dinner Tonight", "Other Seafood", "Salads"], "recipeIngredient": ["<strong>For the aïoli:</strong> ", "2 large egg yolks ", "2 to 3 garlic cloves, chopped", "1 teaspoon salt ", "1 cup olive oil ", "&nbsp;", "<strong>For the Warm Squid Salad:</strong>", "1 cup bread crumbs", "12 ounces cleaned squid, cut into 1-inch pieces", "1 garlic clove, minced", "4 tablespoons olive oil, divided  ", "salt and pepper ", "½ cup dry white wine ", "2 tablespoons rice wine vinegar", "½ pound mixed crisp greens (mizuna, frisée, endive, and escarole), torn into 2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the aïoli: Combine the egg yolks, garlic, and salt in a blender. Process until pureed. On medium speed, slowly drizzle a few drops of olive oil until it starts to emulsify. Continue drizzling in the olive oil until has all been added, being careful not to add it too fast or it will break. Season with more salt if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the warm squid salad: Adjust oven rack to middle position and preheat oven to 300&deg;. Spread the bread crumbs on a baking sheet. Transfer to the oven, and wait until lightly toasted, about eight minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the squid pieces on paper towels, and season with salt and pepper. Heat one tablespoon of the olive oil in a large skillet over high heat until almost smoking. Add as much of the squid as will fit in one layer. At first, the squid pieces will stick to the pan. Once they release or curl up, which takes five to ten seconds, flip the pieces. Cook until the pieces appear white, another five to ten seconds. Transfer the pieces to a bowl. Repeat this process, adding more oil if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn heat to low, and add the garlic. Cook until lightly browned, about 30 seconds. Transfer to the bowl with the squid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Deglaze skillet with the white wine, scraping the bottom of the skillet with a wooden spoon to dislodge any browned bits. Turn heat to medium and simmer for a few minutes. Whisk in the vinegar, and then two tablespoons of olive oil. Once mixture is emulsified, turn off the heat, and whisk in the aïoli. Pour at least half of this sauce over the squid. Add all of it if you're feeling like it (see note).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle in about half of the breadcrumbs into the bowl with the squid. Toss this mixture just twice, then add the greens and toss well. Divide this mixture between four plates, and top with a sprinkling of the remaining bread crumbs. </p>"}]}