{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110903reesesprocess1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["candy", "chocolate", "gluten free", "peanut brittle", "peanut butter", "peanut butter cup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade \"Reese's Cups\"", "link": "https://www.seriouseats.com/recipes/2011/09/homemade-reeses-peanut-butter-cups-recipe.html", "description": "Complete chocolate tempering instructions are beyond the scope of this recipe, however, you can find a great tempering tutorial from Liddabit chocolatier Liz Gutman <a href=\"http://sweets.seriouseats.com/2010/03/how-to-temper-chocolate.html\" target=\"_blank\">here.</a>. Also, take heart: you don't have to actually temper the chocolate. <strong>If you skip tempering, you'll have to store the peanut butter cups in the refrigerator</strong>, but who ever turned their nose up at a cool Reese's Cup?", "totalTime": "90 minutes", "recipeYield": "about 20 peanut butter cups", "recipeCategory": ["Candy", "Chocolate", "Desserts", "Gluten-Free", "Halloween", "Nuts"], "recipeIngredient": ["1.75 ounces water", "3.75 ounces sugar", "1.5 ounces corn syrup or honey", "3/4 ounce butter (omit for vegan/lactose free)", "2.5 ounces roasted peanuts", "5.25 ounces creamy peanut butter", "1/2 ounce vanilla extract", "1 ounce peanut oil or more as needed", "20 ounces milk or dark chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the filling:</strong> Lightly grease a sheet pan with butter and set aside. Combine water, sugar, corn syrup or honey, and butter (if using) in a medium pot. Turn the heat to medium and use a heat resistant spatula to stir gently until the sugar has dissolved. Once mixture starts to bubble, stop stirring and let simmer undisturbed. </p>\n\n<p>Cook until mixture has a pale golden color, about 300&deg;F on a candy thermometer (a thermometer useful but not necessary, you can judge the mixture purely by color).</p>\n\n<p>Shut off heat and stir in peanuts with a spatula. Pour mixture onto sheet pan and use spatula to spread it as thin as you can manage. </p>\n\n<p>When the brittle has cooled completely, transfer it to a cutting board and chop roughly with a knife. </p>\n\n<p>Put chopped brittle into a food processor and pulse until brittle has been ground into small chunky pieces. Then let the food processor run continuously until the mixture begins to turn into a paste.</p>\n\n<p>Shut off processor, add peanut butter, then replace the lid; process until the mixture is homogeneous. Then, with mixer still running, slowly drizzle in vanilla and oil. </p>\n\n<p>The mixture should be a thick paste, but fluid enough to squeeze through a piping bag. If the mixture seems too thick, drizzle in more oil, a tablespoon at a time, until it has thinned sufficiently.</p>\n\n<p>Transfer mixture to a pastry bag fitted with a large, plain tip. Set aside until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the cups:</strong> Arrange 20 cupcake liners on a baking sheet, set aside. Temper the chocolate, or proceed with melted chocolate instead. In either case, pour 1/2 ounce chocolate into each cupcake liner. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the pastry bag to pipe about three quarters of an ounce of peanut filling directly into the center of each cup. This will force the chocolate away from the center and up the sides.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a damp finger to gently pat down the \"peak\" of each peanut butter center. Top each with another half ounce of chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take sheet pan in both hands a gently rap it against the counter to level the chocolate and dislodge any air bubbles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you're using untempered chocolate, refrigerate peanut butter cups until hardened, about thirty minutes. Tempered chocolate will harden on its own in a few minutes</p>\n\n<p>After the chocolate has set, peel each peanut butter cup free from the cupcake liners. Store in an airtight container with a piece of parchment or waxed paper between each layer. They will keep for about a month at room temperature or indefinitely in the fridge or freezer. <i>Please remember, if you use untempered chocolate you must store the candies in the refrigerator at all times.</i></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Side note: these are phenomenal chopped up and stirred into a a homemade <a href=\"http://www.seriouseats.com/recipes/2011/08/how-to-make-your-own-oreo-blizzards-like-dairy-queen-homemade-recipe.html\">Blizzard</a>.</p>"}]}