{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002-127355-dinner-tonight-quinoa-risotto-hazelnuts.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "hazelnuts", "quinoa", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Quinoa 'Risotto' with Toasted Hazelnuts and Dried Currants", "link": "https://www.seriouseats.com/recipes/2011/10/quinoa-risotto-with-toasted-hazelnuts-dried-currants.html", "description": "I've made a few quinoa dishes over the past year, but none were cooked quite like this recipe from <strong>Michael Lomonaco and Andrew Friedman's <em><a href=\"http://www.amazon.com/dp/B000PMGKD4/?tag=serieats-20\">Nightly Specials</a></em></strong>. The result is slightly nutty, a little sweet, and surprisingly filling. Basically, it's good ol' comfort food, perfect for the fall. Part of the success is due to the hazelnuts, which are toasted first, then chopped.", "totalTime": "45 minutes", "recipeYield": "2 to 3 people", "recipeCategory": ["Dinner Tonight", "Nuts", "Quinoa", "Rice", "Vegetarian"], "recipeIngredient": ["1/2 cup hazelnuts", "1 tablespoon olive oil ", "1 small onion, diced", "1 cup quinoa, washed in cold water and drained", "2 cups chicken stock, divided ", "1 bay leaf ", "1 tablespoon ground cinnamon ", "1/2 cup dried currants (dried cranberries or raisins also work)", "salt and black pepper", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a heavy-bottomed iron skillet over medium heat. When hot, add the hazelnuts and toast, shaking the pan often, until they become warm and fragrant, about four minutes. Set the hazelnuts aside to cool. Then remove their skins and coarsely chop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a small saucepan set over medium-high heat. When shimmering, add the onion and cook until softened, about four minutes. Add the quinoa and toast for a minute, stirring often.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in half of the broth, and bring to a boil over high heat. Reduce heat to a simmer, and add the bay leaf, cinnamon, dried currants, 1/2 teaspoon salt, and 1/2 teaspoon ground black pepper. Cook until the quinoa has absorbed the liquid, about eight minutes. Pour in remaining stock, bring to a boil again over high heat, and then reduce heat to a simmer and cook for another eight minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat, and stir in the chopped hazelnuts and the butter. Cover the saucepan, and let sit for five minutes. Add more salt and pepper, if needed, and serve immediately. </p>"}]}