{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205-182360-serious-eats-bacon-banh-mi.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bánh mì", "Cook the Book", "sandwich", "Serious Eats book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Eats' Bacon Banh Mi", "link": "https://www.seriouseats.com/recipes/2011/12/serious-eats-bacon-banh-mi.html", "description": "Our recipe for <strong>Bacon Banh Mi</strong> brings our favorite Vietnamese sandwich home, swapping out the usual array of cold cuts and charcuterie for bacon but staying true to the other elements that make this sandwich so balanced and irresistible.", "totalTime": "1 hour 30 minutes", "recipeYield": "makes 4 sandwiches", "recipeCategory": ["Bacon", "Cook the Book", "Sandwiches"], "recipeIngredient": ["1 large carrot, cut into 2-inch matchsticks 1/8 inch thick (about 2 cups)", "1 small daikon radish, cut into 2-inch matchsticks 1/8 inch thick (about 2 cups)", "3/4 cup plus 2 teaspoons sugar ", "Kosher salt", "1/2 cup white vinegar", "16 slices thick-cut bacon", "4 Vietnamese baguettes or high-quality hero rolls", "1 teaspoon Vietnamese or Thai fish sauce", "1 teaspoon Maggi seasoning sauce", "1 teaspoon soy sauce", "4 tablespoons mayonnaise", "1 cucumber, peeled, seeded, and cut lengthwise into 8 strips", "1 jalapeño pepper, stemmed, seeded, and cut lengthwise into matchsticks", "1 bunch fresh cilantro (about 16 sprigs)", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the carrot, daikon, 1/4 cup of sugar, and 1 tablespoon of salt in a medium mixing bowl. Using your hands, massage the salt and sugar into the vegetables until they begin to soften and exude liquid. Set the bowl aside at room temperature for 30 minutes, then drain the vegetables. Meanwhile, combine the vinegar, 1/2 cup of sugar, and 1/2 cup of water in a small bowl or Tupperware container and mix until the sugar is dissolved. Pour the vinegar mixture over the drained vegetables, and refrigerate until ready to use, at least 1 hour. (The vegetables should last at least 10 days, and will get better with time.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to the middle position, and preheat the oven to 400°F. Line a rimmed baking sheet with aluminum foil and spread the bacon over it. Bake the bacon until crispy, about 15 minutes, then drain on a plate lined with two layers of paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the foil from the baking sheet and discard it, then place the four baguettes on the now-empty baking sheet. Toast for 3 minutes until the exterior is crispy. Meanwhile, in a small bowl, combine the fish sauce, Maggi seasoning sauce, soy sauce, and the remaining 2 teaspoons of sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a bread knife, slit the baguettes lengthwise, leaving a hinge to keep the two halves connected. Spread 1 tablespoon of mayonnaise evenly inside each baguette. Stuff the baguettes with four slices of bacon, a quarter cup of the pickled vegetables, two cucumber strips, a few slices of jalapeño, and four sprigs of cilantro. Drizzle with the fish sauce mixture and season with salt and pepper. Close the sandwiches and serve.</p>"}]}