{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110629emilyluchetti-sodas.jpg", "author": {"@type": "Person", "name": "Emily Luchetti"}, "recipeCuisine": "", "keywords": ["berries", "ice cream sodas", "raspberries", "soda"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Very Berry Sodas", "link": "https://www.seriouseats.com/recipes/2011/07/ice-cream-sodas-raspberry-summer-dessert-recipes.html", "description": "These ice cream sodas are refreshing and light enough to be appreciated on a hot humid day; but they're so beautiful and sophisticated, you can serve them at a dinner party. Fresh berries, homemade raspberry soda, and strawberry ice cream come together beautifully in each glass.", "totalTime": "6 hours", "recipeYield": "6", "recipeCategory": ["Ice Cream and Frozen Treats", "Raspberry"], "recipeIngredient": ["<strong>For the strawberry ice cream: </strong>", "1 pint fresh strawberries, hulled and quartered ", "6 tablespoons plus 1/4 cup sugar", "1/2 teaspoon freshly squeezed lemon juice", "Large pinch of kosher salt plus 1/8 teaspoon ", "2 cups heavy (whipping) cream", "1 cup milk", " ", "<strong>Raspberry Soda</strong>", "2 pints (4 cups) fresh or 24 ounces thawed no sugar added frozen raspberries", "1 cup minus 2 tablespoons sugar", "1/2 teaspoon freshly squeezed lemon juice", "1/4 teaspoon kosher salt", "4 cups cold seltzer water", "1/4 cup fresh blueberries", "1/4 cup fresh boysenberries, olallieberries, or blackberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the ice cream: </strong>Put the strawberries, the 6 tablespoons sugar, the lemon juice, and the pinch of salt in a medium, heavy saucepan. Cook over medium heat, stirring frequently, until the strawberries reach a jam like consistency, 20 to 25 minutes. Let cool to room temperature and refrigerate for 1 hour until cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the cream, milk, the remaining 1/4 cup sugar, and the 1/8 teaspoon salt in a medium, heavy saucepan. Cook over medium heat, stirring occasionally, until the liquid is almost simmering. Cool over an ice bath to room temperature. Refrigerate for 4 hours or up to overnight. Stir in the cooked strawberries. Churn in an ice cream machine according to the manufacturer’s instructions. Freeze until scoopable, about 4 hours, depending on your freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the soda:</strong> Purée the raspberries in a food processor. Strain through a fine-mesh sieve, discarding the seeds. There should be about 2 cups purée. In a large pitcher, mix together the raspberry purée, sugar, lemon juice, and salt. Add the seltzer and stir until combined. Place several small scoops of strawberry ice cream and some blueberries and olallieberries in each of 6 glasses. Fill with the raspberry soda. Serve immediately, with long spoons and straws.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>In Advance:</strong> The raspberry purée can be prepared and sweetened up to 12 hours before serving. Keep refrigerated. Add the seltzer and ice cream just before serving.</p>"}]}