{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111114-178145-crancake.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "cranberries", "thanksgiving", "Thanksgiving desserts", "upside-down cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Upside-Down Cake", "link": "https://www.seriouseats.com/recipes/2011/11/cranberry-upside-down-cake-recipe.html", "description": "This cake may not redefine every thought you've ever had about cranberries, <strong>but it will turn them upside down--literally.</strong>", "totalTime": "1 hour, 20 minutes", "recipeYield": "10", "recipeCategory": ["Cakes", "Cakespy", "Cranberry"], "recipeIngredient": ["2/3 cup dark brown sugar, packed", "1 1/2-2 cups fresh cranberries", "1/4 cup butter", "1 1/3 cups flour", "1 1/2 teaspoons baking powder", "1 cup sugar", "1/3 cup butter", "1 egg, beaten", "3/4 cup milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the brown sugar and cranberries together in a bowl and mix with your hands until the brown sugar is evenly distributed (it won't really stick to the cranberries; that's okay). Set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. In your 9-inch square pan, melt 1/4 cup butter while the oven heats (it should only take a minute or two). Remove the pan from the oven and tilt the pan so that the butter is evenly distributed across the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cranberry-and-brown-sugar mixture on top of the melted butter, using a spoon to spread it into an even layer. You want enough cranberries to cover most of the pan; you may not use all of them depending on how big the berries are. Set to the side while the oven continues to preheat; prepare your cake batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour and baking powder in a medium bowl. Keep to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a stand mixer fitted with the paddle attachment, cream together the butter and sugar until light and fluffy. Add in the egg and mix until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add in the flour mixture and the milk alternatively, beginning and ending with milk. Pause to scrape down the sides of the bowl with each addition. Mix until smooth, about 3 minutes on medium speed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the batter over the cranberries in your pan, making sure that it is evenly spread. Bake for 50-55 minutes, or until a toothpick inserted in the center comes out clean. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once out of the oven, immediately place a heatproof serving plate under the pan; turn plate and pan over quickly. Leave the pan over the cake for several minutes so that the brown sugar and cranberry mixture can drizzle over the cake. Remove the pan, and serve warm, a la mode if desired.</p>"}]}