{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110324-144034-bittersweet-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Plenty", "pomegranate seeds", "pomegranates", "radicchio", "ricotta", "salad", "Yotam Ottolenghi"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bittersweet Salad", "link": "https://www.seriouseats.com/recipes/2011/03/bittersweet-salad-recipe.html", "description": "The bittersweet-ness of this salad comes from the radicchio, sour blood orange segments, and tart pomegranate seeds dressed with a reduced orange-maple vinaigrette, which is really more of a syrup with a touch of aromatic orange flower water. The toasty pine nuts and little spoonfuls of creamy ricotta dolloped on top also complements the bitterness.", "totalTime": "45 minutes", "recipeYield": "2", "recipeCategory": ["Cook the Book", "Pomegranate", "Salads"], "recipeIngredient": ["2 blood oranges (or plain oranges)", "Blood orange juice as needed", "1 1/4 tablespoon lemon juice", "1/4 cup maple syrup", "Coarse sea salt", "1/2 teaspoon orange-flower water", "1/2 small radicchio", "1 small Treviso, leaves separated", "1 tablespoon olive oil", "Black pepper", "Handful of small red leaves (microgreens)", "3/4 cup good-quality ricotta", "2 tbsp pine nuts, toasted", "Seeds from 1 small pomegranate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take each of the blood oranges in turn and use a small sharp knife to slice off the top and base. Now cut down the side of the orange, following its natural curve, to remove the skin and white pith. Over a small bowl, cut in between the membranes to remove the individual segments into a bowl. Squeeze all the juice from the membrane and skin into a small saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make up the juice in the pan to 7 tbsp with extra blood orange juice. Add the lemon juice, maple syrup and a pinch of salt and bring to a light simmer. Leave to reduce for 20 to 25 minutes, or until you are left with about 3 tablespoons of thick syrup. Strain it through a fine sieve and allow to cool down, then stir in the orange-flower water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull apart the radicchio leaves and tear them roughly into large pieces. Put into a mixing bowl. Add the Treviso leaves, oil and some salt and pepper, and toss gently. Divide the salad leaves between two serving plates. Dot with the orange segments, small red leaves and spoonfuls of ricotta, building the salad up. Drizzle with the orange syrup and finish with pine nuts and pomegranate seeds.</p>"}]}