{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111112-127355-dinner-tonight-pork-apple-ragu.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["apple", "Dinner Tonight", "pasta", "pork", "ragu", "stephanie izard"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple-Pork Ragu with Orecchiette", "link": "https://www.seriouseats.com/recipes/2011/11/apple-pork-ragu-with-pappardele-recipe.html", "description": "Whenever I think about pork and apples, my mind usually imagines inch-thick chops with cooked apples along the side. (Hey, it's not a bad thought.) But this pair can also combine in other interesting ways. That's the lesson I learned form this recipe in Stephanie Izard's <em><a href=\"http://www.amazon.com/dp/0811874478/?tag=serieats-20\">Girl in the Kitchen</a></em>, which spruces up a quick ragu with browned bits of pork and loads of sliced Honeycrisp apples. The result is surprisingly light and relatively easy to put together.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Apple", "Dinner Tonight", "Pasta", "Pork"], "recipeIngredient": ["1 teaspoon olive oil ", "12 ounces ground pork ", "2 slices thick-cut bacon, chopped", "1/2 cup diced onion (from about 1/2 an onion) ", "3 garlic cloves, minced", "2 Honeycrisp apples, peeled, cored, and cut into 1/4-inch thick slices", "1/2 cup dry white wine", "one 15-ounce can whole peeled tomatoes, chopped ", "1 cup chicken broth ", "1 pound orechiette ", "2 tablespoons brined capers", "2 tablespoons fresh basil, thinly sliced", "salt and black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Meanwhile, pour the oil into a large sauté pan set over medium-high heat. When oil is shimmering, add the ground pork. Cook, breaking the mass up into small pieces with a wooden spoon, until well browned, five to seven minutes. Using a slotted spoon, transfer the pork to a bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan or Dutch oven, add the chopped bacon and turn the heat to medium. Cook until the bacon is browned and has rendered some of its fat. Add the onion and garlic. Cook until the onion is soft, stirring occasionally, about two minutes. Add the apples and wine, stir well, and cook until the wine has reduced by three-quarters. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes, broth, and the browned pork. Stir well, and then bring to a boil over high heat. Reduce heat to maintain a simmer and cook, partially covered, until the sauce has thickened, 15 to 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sauce just starts to thicken, cook the pasta according to the directions on the packaging. When al dente, drain the pasta in a colander. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the capers and most of the sliced basil. Season the sauce with salt and pepper to taste. Don't be shy, as it hasn't been seasoned yet. Divide the pasta between four large bowls, and top with each with a few scoops of the ragu. Garnish with the remaining sliced basil. </p>"}]}