{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110831nutter610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Cookies", "gluten free", "holiday cookies", "peanut", "peanut butter", "sandwich cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade 'Nutter Butters'", "link": "https://www.seriouseats.com/recipes/2011/09/homemade-nutter-butters-peanut-butter-sandwich-cookies-recipe.html", "description": "Using rice flour makes the Nutter Butters incredibly crisp and light and I actually prefer it to all purpose flour in these cookies. Of course, you needn't make a special trip to the store, all purpose flour works well too; the cookies will have just a slightly heavier texture.", "totalTime": "45 minutes", "recipeYield": "20 sandwich cookies", "recipeCategory": ["Cookies", "Desserts", "Gluten-Free", "Nuts"], "recipeIngredient": ["2 ounces unsalted butter", "1 ounce creamy peanut butter", "5 ounces sugar ", "1/8 teaspoon baking soda", "1/4 teaspoon salt", "2 teaspoons vanilla extract", "2 egg yolks", "5 ounces rice flour or all purpose flour", "1 ounce roasted, unsalted peanuts", "&nbsp;", "<strong>For the filling:</strong>", " 1 1/2 ounces unsalted butter", "1 1/2 ounces creamy peanut butter ", "1/2 ounce cream cheese", "5 ounces powdered sugar", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cookies: Using a hand or stand mixer set to medium speed, cream together butter, peanut butter, sugar, baking soda, salt and vanilla extract just until combined. Take care not to over-mix; the less air that is incorporated into the dough, the better.<br />\n <br />\nWith mixer still running, add in egg yolks one at a time. Once incorporated, shut off mixer and scrape bowl down with a rubber spatula. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine flour and peanuts; process for one minute then sift the mixture in a fine meshed sieve; regrind any chunks that do not pass through and sift again. Discard any bits that do not pass through the sieve. If any chunks are included, it will be difficult to roll the dough sufficiently thin and those same chunks will clog your piping bag when you attempt to pipe a design on top.</p>\n\n<p>Turn mixer to its lowest setting and add rice flour and ground peanuts all at once. The mixture will be stiff. Continue mixing until uniform. Shut off mixer. Use a spatula to scrape the dough from the bowl and knead lightly to form a smooth ball. Use your hands to flatten into a disc.</p>\n\n<p>Refrigerate the dough for thirty minutes, or until stiff enough to roll easily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350° and have two, parchment lined baking sheets at the ready. </p>\n\n<p>Sift some flour onto the counter and use a rolling pin to roll the dough as thinly as you can manage, about 1/8\". (The cookies will puff and reach just shy of 1/4\" after baking; thus dough rolled only to 1/4\" will puff to 1/2\" inch, making the finished, filled sandwich over an inch thick. Not good.)</p>\n\n<p>When finished rolling, slide a metal spatula between the dough and counter to loosen. This will prevent the cookies from sticking.</p>\n\n<p>A <a href=\"http://shop.sweetwise.com/tools/cutters/cookie-cutters/diva/cookie-cutter-bikini-top.html\">bikini/sunglass cutter</a>, slightly stretched and widened, makes perfect \"Nutter Butters\" but use any cutter you like. Cut out the cookies and use a metal spatula to lift and transfer to cookie sheet.</p>\n\n<p>Arrange cookies on parchment lined cookie sheet. Set the sheets aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather up, knead, and re-roll the remaining dough scraps, likewise cutting and arranging on a cookie sheet. The scraps can be rerolled two more times.</p>\n\n<p>To make a Nutter Butter pattern on the cookies, place any remaining dough scraps in a mixing bowl. Mix with a hand or stand mixer while adding hot water, one teaspoon at a time. Continue adding hot water until the dough has thinned into a paste. You can always add more liquid, but you can't take it away. Add slowly and let each addition mix in fully before adding more. When the mixture reaches a frosting-like consistency, use a spatula to scrape it out. Transfer to a piping bag fitted with a very small tip, or a heavy duty Ziploc bag with a tiny hole poked in the corner.</p>\n\n<p>Pipe some sort of design atop each cookie. Four vertical lines and several horizontal hashes will give the impression of a Nutter Butter, but any design will do. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cookies have been decorated, bake for about 12 minutes, or until firm to the touch. If your oven has an uneven heating element, rotate the cookie sheets after six minutes. Once the cookies have baked, cool thoroughly, directly on the sheet pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling: With a hand or stand mixer, cream together butter, peanut butter, cream cheese, powdered sugar and vanilla. Cream on medium speed for five minutes; use a rubber spatula to scrape the bowl down periodically. The long mixing time makes the filling less gritty.</p>\n\n<p>Using a spatula, transfer the filling to a pastry bag fitted with a plain tip. Alternately, use a Ziploc bag with the corner snipped off as a makeshift pastry bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cookies: Flip half the wafers over. Onto each, pipe a barbell shaped line of frosting down the center. Top with remaining wafers.</p>\n\n<p>Transfer cookies to an airtight container and refrigerate for several hours to set the filling. The cookies will keep for about one week.</p>"}]}