{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111023-175930-preserved-maple-cranberry-applesauce-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["apple", "applesauce", "cranberries", "maple syrup", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Maple Cranberry Applesauce", "link": "https://www.seriouseats.com/recipes/2011/10/maple-cranberry-applesauce-recipe-how-to-make-applesauce.html", "description": "This applesauce, made with maple syrup, brown sugar, and fresh cranberries, is downright dessert-worthy. Each bite tastes like it was swiped from the middle of a pie. Try it with a scoop of vanilla ice cream and some crushed amaretti cookies or graham crackers.", "totalTime": "1 1/2 hours", "recipeYield": "Makes 3 to 4 pints", "recipeCategory": ["Apple", "Condiments and Sauces", "Cranberry", "Desserts", "Fruit Desserts"], "recipeIngredient": ["6 pounds apples, peeled and sliced", "1/2 cup apple cider, apple juice, or water", "3 tablespoons freshly squeezed lemon juice", "1 cinnamon stick", "1 1/2 cups fresh cranberries", "1/4 cup packed dark brown sugar", "1/4 to 1/2 cup maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the butter, prepare the jars and lids: place 3 or 4 pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Combine the apples, apple cider, juice, or water, lemon juice, and cinnamon stick in a large, heavy-bottomed pot. Bring to a boil over medium-high heat. Lower the heat to a simmer, cover the pot, and cook until the apples are tender and easy to mash with a fork, 20 to 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cinnamon stick. Using an immersion blender, puree the apple mixture until it is mostly smooth with a few small chunks. (Alternatively, puree half of the mixture in a food processor or blender.) Stir in the cranberries, brown sugar, and maple syrup. Return the mixture to a simmer and cook until the cranberries begin to pop, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot applesauce into the hot sterilized jars, leaving 1/4-inch headspace. Wipe the rims of the jars, cover with the lids, and screw the bands on until just barely tight. Place the jars on the rack in the pot and cover completely with water. Cover the pot and bring to a boil over high heat. Boil for 20 minutes. Turn off the heat, uncover the pot, and allow the jars to rest in water for five minutes. Remove the jars from the pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}