{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/201110810cartoncookies500.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate", "Cookies", "gluten free", "ice cream", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cookies 'n Cream Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/08/cookies-n-cream-ice-cream-recipe.html", "description": "Don't hesitate to use real Oreos in this recipe, but if you'd like to go all the way, follow my <a href=\"http://www.seriouseats.com/recipes/2011/08/fauxreos-homemade-oreos-recipe.html\">Fauxreo</a> recipe for a 100% homemade version. There is a gluten free variation with the Fauxreo recipe, so it may be used to make this ice cream gluten free as well.", "totalTime": "24 hours", "recipeYield": "Makes 1 quart", "recipeCategory": ["Gluten-Free", "Ice Cream and Frozen Treats"], "recipeIngredient": ["8 ounces whole milk", "12 ounces heavy cream", "3 ounces egg yolks (from 4 or 5 eggs, depending on size)", "7 ounces sugar", "1/2 teaspoon salt ", "2 teaspoons vanilla extract", "1 ounce vodka or other neutral spirit", "8 ounces Oreos or <a href=\"http://www.seriouseats.com/recipes/2011/08/fauxreos-homemade-oreos-recipe.html\">Fauxreos</a>, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the ice cream base:</strong> In a medium pot, bring the milk and cream to a simmer. Meanwhile put the yolks in a medium bowl and whisk the sugar in gradually. It's a lot of sugar, so don't dump it in all at once or it will be difficult to incorporate. Whisk in salt. Once the dairy begins to simmer, whisk some of the dairy mixture into the egg yolks, one ladle-full at a time, until the egg mixture is quite warm. Then whisk egg mixture into the pot of cream. Turn heat to medium low. Stir constantly with a rubber spatula, making sure to scrape all along the bottom of the pot to avoid curdling.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Normally, ice cream recipes entreat you to cook until the mixture is \"thick enough to coat the back of a wooden spoon,\" but with this recipe, that will never happen. Instead, cook until a thermometer registers 145&deg; F. When it does, immediately shut off the heat and strain the custard through a sieve and into a large bowl. Stir in vanilla extract and vodka. Cool in an ice bath and refrigerate, covered, overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Oreo mix-ins:</strong> Use a knife or a food processor to pulverize three ounces of Oreos or Fauxreos into very fine crumbs.<br />\r\n <br />\r\nWith a knife, dice three ounces of Oreos into small, 1/4\" bits. </p>\r\n\r\n<p>Chop the remaining Oreos in half or thirds.</p>\r\n\r\n<p>Place all of these Oreo bits in a large bowl and stash in the freezer until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finishing the ice cream:</strong> Process chilled ice cream base in ice cream maker according to manufacturer's directions. When the ice cream has finished churning, transfer it to the bowl of all of the Oreo bits and stir to combine.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover ice cream tightly with plastic wrap, or transfer to an airtight container and store in freezer. Ice cream will keep for two weeks.</p>"}]}