{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111103coconutcreampieauburn.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "coconut desserts", "pie", "Sonya Jones", "Sweet Auburn Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coconut Cream Pie", "link": "https://www.seriouseats.com/recipes/2011/11/coconut-cream-pie-sweet-auburn-desserts-recipe.html", "description": "Sonya Jones does Coconut Cream Pie right&mdash;a mile high with equal parts gooey coconut custard and mounds of fluffy whipped cream all topped off with a shower of toasted coconut flakes.", "totalTime": "1 hour 30 minutes", "recipeYield": "8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 pie shell, prebaked (recipe follows) ", "&nbsp;", "<strong>Filling</strong>", "1 cup white sugar", "1/4 cup cornstarch", "1/4 teaspoon salt", "3 cups milk", "4 egg yolks", "1 1/2 teaspoons vanilla extract", "2 tablespoons (1/4 stick) butter", "1 cup coconut flakes, plus 1/4 cup for garnish ", "&nbsp;", "<strong>Whipped Cream Topping</strong>", "1 cup whipping cream", "1/2 cup powdered sugar", "&nbsp;", "<strong>Pie Shell</strong>", "1 1/2 cups flour", "1/2 teaspoon salt ", "2 tablespoons shortening", "4 tablespoonss (1/2 stick) butter", "1/2 cup cold water "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pie shell:</strong> To make the pastry dough, mix the flour and salt together in a mixing bowl. Cut in the shortening and butter with a pastry blender or fork until the mixture has the texture of coarse cornmeal. Add the cold water and mix until the dough is consistently moistened. Shape the dough into a ball and press flat. Wrap the dough in plastic and refrigerate for at least 30 minutes. Once the dough has chilled, roll it out on a lightly floured surface to a 1/2-inch thickness. Transfer the dough to a 9-inch pie pan and trim the edges. Use a pastry crimper to make decorative edges, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prebake a pie shell, preheat the oven to 425&deg;F. Using a fork, prick holes in the bottom and sides of the pie shell. Bake for 10 to 12 minutes, or until the crust is golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the coconut cream pie:</strong> In a medium saucepan over medium heat, combine the sugar, cornstarch, and salt and gradually add in the milk. Mix until the cornstarch dissolves completely and cook until the mixture comes to a boil, stirring continuously.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, beat the egg yolks slightly, and gradually stir 1 cup of the hot milk into the yolks. Return the egg mixture to the saucepan and bring to a gentle boil. Reduce the heat to low and cook 2 minutes more. Remove the pan from the heat and stir in the vanilla and butter, then add the coconut. Pour the hot filling mixture into the baked, cooled pie crust and allow the filling to cool. Cover the pie and chill until the filling has set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the whipped cream, beat the whipping cream until it becomes foamy. Gradually add the powdered sugar, beating until soft peaks form. Spread the whipped cream over the chilled pie.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To toast the cococnut, preheat the oven to 350&deg;F. Spread 1/4 cup coconut flakes on a rimmed baking sheet and bake 5 to 10 minutes, stirring occasionally, or until the coconut turns golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish the top with toasted coconut before serving.<br />\n</p>"}]}