{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110911-169643-peach-melba-jam-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Jam", "peach Melba", "peaches", "Preserved", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peach Melba Jam", "link": "https://www.seriouseats.com/recipes/2011/09/peach-melba-jam-how-to-make-peach-raspberry-jam-recipe.html", "description": "The finished jam is gorgeous&mdash;it looks like sunset in a jar. Of course it's delicious on toast or stirred into yogurt, but this is also a good jam to get creative with. It would be a welcome addition to many desserts. Spoon some over wedges of simple butter cake, stir it into cold rice pudding, or sandwich it between your favorite ginger cookies.", "totalTime": "About 1 1/2 hours", "recipeYield": "Makes 7 half-pints", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Fruit Desserts", "Peach", "Raspberry"], "recipeIngredient": ["5 or 6 large, ripe peaches", "One (5-ounce) container fresh raspberries", "Juice of half a lemon", "1/2 vanilla bean, split", "3 1/2 cups sugar", "One package low- or no-sugar needed powdered fruit pectin", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve jam, prepare jars and lids: place 7 half-pint jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel, pit, and slice the peaches. Transfer them to a blender or food processor and pulse just until they are coarsely chopped. Measure 4 cups of chopped peaches into a large, heavy-bottomed pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the raspberries in the food processor or blender and pulse until coarsely chopped. Measure 1 cup of crushed raspberries and add it to the pot with the peaches. Stir in lemon juice and vanilla bean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1/4 cup of sugar with the pectin in a small bowl. Measure remaining 3 1/4 cups of sugar into a medium bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the sugar-pectin mixture into the peaches, add the butter, and bring the mixture to a full rolling boil over medium-high heat, stirring frequently. Stir in the remaining sugar and return to a full rolling boil. Boil hard for one minute. Remove the pot from the stove and skim any foam from the surface of the jam with a metal spoon. Remove and discard the vanilla bean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}