{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111204-porchetta-06-560px.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["holiday entrees", "low carb", "porchetta", "pork", "pork belly", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9", "ratingCount": "20"}, "name": "All-Belly <em>Porchetta</em>", "link": "https://www.seriouseats.com/recipes/2011/12/all-belly-porchetta-recipe-italian-roast-pork.html", "description": "Note: Herbs and aromatics can be substituted or altered according to taste. I find it easiest to work with a whole belly at a time and if a smaller roast is desired, to split it in half and freeze half...", "totalTime": "1 day", "recipeYield": "12 to 15", "recipeCategory": ["Christmas", "Italian", "Mains", "New Year", "Other Meats", "Pork", "Roasting", "Thanksgiving", "The Food Lab", "Winter"], "recipeIngredient": ["1 whole boneless, rind-on pork belly, about 12 to 15 pounds", "2 tablespoons whole black peppercorns", "3 tablespoons whole fennel seed", "1 tablespoon crushed red pepper", "3 tablespoons finely chopped rosemary, sage, or thyme leaves", "12 cloves garlic, grated on a microplane grater", "Kosher salt", "2 teaspoons baking powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork belly skin-side down on a large cutting board. Using a sharp chef's knife, score flesh at an angle using strokes about 1-inch apart. Rotate knife 90 degrees and repeat to create a diamond pattern in the flesh.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast peppercorns and fennel seed in a small skillet over medium-high heat until lightly browned and aromatic, about 2 minutes. Transfer to a mortar and pestle or spice grinder and grind until roughly crushed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork liberally with salt then sprinkle with crushed pepper and fennel, red pepper, chopped herbs, and microplaned garlic. Use your hands to rub the mixture deeply into the cracks and crevices in the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll belly into a tight log and push to top of cutting board, seam-side down. Cut 12 to 18 lengths of kitchen twine long enough to tie around the pork and lay them down in regular intervals along your cutting board, about 1-inch apart each. Lay rolled pork seam-side down on top of strings. Working from the outermost strings towards the center, tie up roast tightly. Combine 2 tablespoons kosher salt with 1 teaspoon baking powder. Rub mixture over entire surface of porchetta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If roast is too large and unwieldy, carefully slice in half with a sharp chef's knife. Wrap tightly in plastic and refrigerate at least overnight and up to three days. If desired, porchetta can also be frozen at this point for future use (see note)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to the lower-middle position and preheat oven to 300°F. Place pork in a v-rack set in a large roasting pan, or if cooking both halves at the same time, on a wire rack set in a rimmed baking sheet. Place roasting pan in oven and roast until internal temperature of pork reaches 160°F, about two hours, basting with pan drippings every half hour. If you'd like to cook potatoes along with the porchetta, see note. Continue roasting until a knife or skewer inserted into the pork shows very little resistance asides from the outer layer of skin, about two hours longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase oven temperature to 500°F and continue roasting until completely crisp and blistered, about 20 to 30 minutes longer. Alternatively, you can remove the roast from the oven and tent with foil for up to two hours before finishing it in a preheated 500°F oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tent with foil and allow to rest for 15 minutes. Slice with a serrated knife into 1-inch thick disks and serve.</p>"}]}