{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/158215-20110623-spinach-baked-eggs.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["Baked Eggs", "breakfast", "brunch", "egg", "spinach", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spinach Baked Eggs", "link": "https://www.seriouseats.com/recipes/2011/07/spinach-baked-eggs-breakfast-brunch-recipe.html", "description": "These baked eggs have everything that's comforting about a big plate of creamed spinach, and adds an egg on top.  When it's a little dreary outside, and there's a nice Sunday paper to spend hours poring over, I've found myself making more then one round of these gooey eggs.  Make sure there's extra toast.", "totalTime": "35 minutes", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mother's Day", "Spinach"], "recipeIngredient": ["2 tablespoons butter", "1 onion, finely chopped", "2 cloves garlic, minced", "3 cups frozen chopped spinach, thawed and gently squeezed", "1/2 – 2/3 cups milk", "2 tablespoon all-purpose flour", "4 eggs", "Kosher salt and cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a skillet, add chopped onion, and cook until transparent, about 4 minutes.  Add minced garlic and cook until fragrant, about 3 minutes.  Add chopped spinach and cook until most of the water that remained in the spinach has evaporated, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle flour over spinach mixture and stir until well combined.  Add 1/2 cup milk and stir to combine.  Bring to a simmer and allow milk to thicken.  If you’re looking for a looser baked egg, add more milk.  Season to taste with salt and pepper.  Bring a kettle to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide spinach mixture between 4 ramekins, and crack 1 egg on top of each.  Place ramekins in high-rimed baking sheet and pour boiling water in baking dish until it reaches halfway up the sides of the ramekins.  Bake at 350°F until white is set but yolk remains runny, about 23 minutes.  Serve with lots of toast for dipping.</p>"}]}