{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110808-165131-chinese-ginger-lime-candy.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["candy", "caramel", "lime", "Sugar Baby"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese Ginger-and-Lime Milk Candy ", "link": "https://www.seriouseats.com/recipes/2011/08/chinese-ginger-and-lime-milk-candy-sugar-baby-recipe.html", "description": "Ginger and lime are just the beginning for these chewy little candies. Once you've got the candy making technique down feel free to experiment to your hearts content with all sorts of exotic flavor combos&mdash;we're thinking that lavender milk candies might be up next.", "totalTime": "45 minutes", "recipeYield": "100 candies", "recipeCategory": ["Bake the Book", "Candy", "Desserts", "Ginger", "Lime"], "recipeIngredient": ["2 cups sugar", "1 cup corn syrup", "1 cup evaporated milk", "2 tablspoons unsalted butter ", "1 teaspoon cornstarch", "1/2 teaspoon glycerin", "1/2 teaspoon salt", "1 teaspoon lime oil", "Zest of 1 lime", "1 small nub of peeled, fresh ginger, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray the back of a sheet pan with nonstick spray and set aside&mdash;unless you have a marble slab, in which case, spray that instead!<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy saucepan over low heat, combine the sugar, corn syrup, evaporated milk, butter, cornstarch, glycerin, and salt. Stir until the sugar is completely dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise the heat to medium-high, clip on a candy thermometer, and stop stirring! I always mean it when I say stop stirring, but I really mean it this time. The milk tends to brown on the bottom and the sides of the pan, and if you stir it up, you’ll have bits of burnt milk in your candy. Heat until the temperature reaches 250&deg;F. The mixture will have a light caramel color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately pour the candy mixture onto the prepared sheet pan, remembering not to scrape the bottom of the saucepan as you pour. With a spatula sprayed with nonstick spray, catch the molten candy as it’s about to run off the sheet pan and fold it toward the middle. Keep doing this on all sides until the candy starts to keep its shape but is still very warm (too warm to handle). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the candy becomes cool enough to handle, pour on the lime oil and place the lime zest and ginger at the center of the candy and continue to fold the ends toward the center so that the oil, lime zest, and ginger become incorporated.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray your hands with nonstick spray. Start pulling the candy and then bring the ends together to fold the candy. Grab both ends again, pull, and bring the ends together, folding the candy rope in half again. Continue pulling and folding, pulling and folding, until the candy is too hard to pull anymore and becomes light and opaque.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a work surface, stretch the candy into a long rope, about 1/2 inch  in diameter. Spray a pair of scissors with nonstick spray and cut 1/2-inch pieces from the rope, working quickly before the candy cools completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately wrap the candy in pieces of wax paper. Store in an airtight container in a cool, dry place for up to a week.</p>"}]}