{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110221-138414-tagalongs3.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "Cookies", "Girl Scout Cookies", "Girl Scouts", "peanut butter", "shortbread", "Tagalongs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Homemade Tagalong Girl Scout Cookies", "link": "https://www.seriouseats.com/recipes/2011/02/homemade-tagalong-girl-scout-cookies-recipe-cakespy.html", "description": "This is not to say you <em>shouldn't</em> buy cookies from those earnest young Scouts. But also make a batch of your own for a delicious homemade snack. These Tagalongs are slightly fatter and more substantial than the Scout version&mdash;you'll enjoy each chocolatey, peanut buttery, shortbready bite.", "totalTime": "3 hours", "recipeYield": "36", "recipeCategory": ["Cakespy", "Cookies", "Nuts"], "recipeIngredient": ["<strong>For the cookies</strong>", "1 cup (2 sticks) butter, softened", "1/2 cup sugar", "2 cups flour, sifted", "1/2 teaspoon salt", "1/2 teaspoon vanilla extract", "2 tablespoons heavy cream", "<strong>For the topping and coating</strong>", "1 1/2 cups creamy peanut butter (no-stir type)", "1/2 cup confectioners' sugar, sifted", "1/2 teaspoon vanilla extract", "12 ounces good-quality milk or semisweet chocolate, either morsels or coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the cookie base. Using the paddle attachment in a stand mixer, cream the butter and sugar until light and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, sift together the flour and salt. In 2-3 increments, stir into the butter mixture, scraping down the sides of the bowl occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cream and vanilla; stir only until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the dough in plastic wrap (separate it into two balls of dough if it is easier to handle that way) and refrigerate for 2-3 hours, until it is very firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Line two baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pinch off pieces of dough, and roll into approximately 1-inch circles. Lightly flatten each ball with your hand, trying to ensure that the edges don't crack too much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the rounds of dough on the prepared cookie sheets, leaving about an inch between (they will spread a little, but not too much).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10-12 minutes, or until they have a dull finish on top and are just golden on the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and let cool for about 5 minutes on the sheet. As soon as they are not too hot, using a thumb or the back of a small spoon, make an indent in each cookie (they should still be fairly soft, so it should be easy to indent them without breaking them). Leave them right where they are for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, melt the peanut butter on low heat until it is a thick, easily stirred liquid. Add the confectioners' sugar and stir until incorporated. Add the vanilla last, stirring in until incorporated. Remove from heat. Let it sit for about 10 minutes; the mixture will start to thicken a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a teaspoon (a little more or less, upon your taste) of the peanut butter mixture in the indent on each cookie. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>It would be best to use a double boiler to melt your chocolate at this point. Personally, I do not have one, so I melted it directly in a medium saucepan on low heat, stirring very frequently to keep the mixture from scorching the bottom of the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To coat the cookies, hold each cookie on a fork (so that it is sitting on the tines) with one hand, and with your other hand, using a spoon, let the chocolate mixture drip on top of the cookie until coated. Use your spoon to gently \"scrape\" the coating so that it covers the entire cookie; let some of the excess chocolate drip off, and then place the chocolate coated cookies on a sheet of waxed paper, nonstick silicone, or even aluminum foil, and let set for 2-3 hours before enjoying.</p>"}]}