{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110317-142809-Crunchy-Chicken-Salad-Sandwiches-with-Bacon.JPG", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["chicken", "chicken salad", "Eat for Eight Bucks", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Eat For Eight Bucks: Crunchy Chicken Salad Sandwiches with Bacon", "link": "https://www.seriouseats.com/recipes/2011/03/eat-for-eight-bucks-crunchy-chicken-salad-sandwiches-recipe.html", "description": "As spring approaches, I feel less hesitant about presenting a sandwich as dinner food. Me, I'm happy when two slices of bread protect just about any filling, but I'm also the type who's plenty satisfied with a $1.50 slice of pizza stuffed in my face on the street. In spring and summer, a sandwich is totally justifiable, easy to prepare, cool, and transportable for when the time comes to eat outdoors.", "totalTime": "1 hour", "recipeYield": "2", "recipeCategory": ["Bacon", "Chicken Salad", "Eat for Eight Bucks", "Sandwiches"], "recipeIngredient": ["1 pound boneless, skinless chicken thighs", "2 small carrots, 1 cut into rough chunks, the other diced", "1 small onion, halved", "2 medium celery stalks, 1 cut into rough chunks, the other diced", "2 scallions, halved lengthwise and thinly sliced", "2 teaspoons apple cider vinegar", "Salt", "3 slices bacon", "4 tablespoons mayonnaise", "Freshly ground pepper", "4 slices bakery whole grain bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Poach the chicken: add the chicken thighs, the rough chop carrot, onion, and rough chop celery to a medium pot with a lid. Cover with water. Bring to a boil over medium-high heat. Skim any foam from the top, and reduce  heat to low. Cover the pot and simmer until the chicken is cooked, about 20 minutes. Remove chicken to a plate, let cool, then shred. Chicken can be cooked and shredded up to 3 days in advance and stored in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, toss the scallions with apple cider vinegar and salt.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon in single layer to large skillet. Cook over medium to medium-low heat, turning occasionally, until crisp and well rendered (about 10 minutes total). Drain on paper towels, then break each slice in half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shredded chicken, mayonnaise, diced carrots, and diced celery to the mixing bow with the scallions and vinegar. Mix to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast bread. Divide chicken salad evenly on top of two slices of bread. Top with bacon and close sandwiches. Serve.</p>"}]}