{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111201-dt-linguine-with-celeriac-apples-and-pancetta-primary-new.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Linguine with Celery Root Cream, Apples, and Pancetta", "link": "https://www.seriouseats.com/recipes/2011/12/dinner-tonight-linguine-with-celery-root-cream-apples-and-pancetta-recipe.html", "description": "Hidden inside this pasta dish's creamy celeriac pur&eacute;e made with cream and vegetable stock are caramelized apples, cubes of crisp pancetta, and wilted red onion. Slivers of celery add a crunchy echo of the celeriac. It's a satisfying combination.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Pasta", "Pork"], "recipeIngredient": ["2 tablespoons olive oil", "2 clove garlic, minced", "3 cups diced celeriac (celery root)", "1/4 cup diced waxy potato (such as Yukon Gold)", "1 1/2 cups vegetable broth", "1/2 cup heavy cream", "1 pound dried linguine", "1 cup diced pancetta", "2 Granny Smith apples, peeled, quartered, and sliced into wedges", "1/2 red onion, thinly sliced", "1/4 cup white wine", "2 ribs celery, thinly sliced, plus celery leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan or stock pot, heat 1 tablespoon of the olive oil over medium-low heat until shimmering.  Add the garlic and cook until soft but not brown, then add the celery root and potato. Stir well to coat the vegetables and cook until the potato begins to soften, about 5 minutes.  Add the broth and cream, bring to a boil, cover, and simmer until the celeriac is tender, about 30 minutes. Use an immersion blender (or transfer to a standard blender) and pur&eacute;e.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, bring a large pot of salted water to boil and cook the pasta until al dente. Before draining, reserve one cup of pasta cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pasta cooks, heat the remaining olive oil in a large (12-inch) skillet over medium heat and add the pancetta. Cook until beginning to crisp at the edges, about 5 minutes, then add the apples and onions.  Continue cooking until the apples are caramelized and almost soft and the onion is wilted, 5-7 minutes more. Add the wine and cook until it's completely evaporated and the apples are tender all the way through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta to the pancetta-apple mixture, then pour in the celeriac pur&eacute;e to create a sauce (you may not need all the pur&eacute;e; it should just coat the pasta and not smother it). If necessary, thin with a little reserved pasta water. Serve immediately with the reserved celery leaves.</p>"}]}