{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110129-135216-sriracha-and-spam-fried-rice.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fried rice", "Randy Clemens", "recipe newsletter", "spam", "Sriracha", "The Sriracha Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "Sriracha and SPAM Fried Rice", "link": "https://www.seriouseats.com/recipes/2011/02/sriracha-and-spam-fried-rice-recipe.html", "description": "Having never purchased a can of SPAM before this <strong>Sriracha and SPAM Fried Rice</strong> from <em><strong><a href=\"http://www.amazon.com/Sriracha-Cookbook-Rooster-Sauce-Recipes/dp/1607740036/serieats-20\">The Sriracha Cookbook</a></strong></em> was an eye opener.  The first order of business was to find the stuff (no, they don't carry it at Whole Foods, don't bother asking).  Once I got my hands on a can, it was time to pull the tab and extract the meat rectangle from it's navy blue metallic home.  It slid out in a solid, albeit a little wobbly shape and smelled eerily similar to cat food.  But I was undeterred, after all, my limited experience with SPAM in the past has been nothing but delicious and I had high hopes for this spicy fried rice", "totalTime": "", "recipeYield": "6 to 8", "recipeCategory": ["Cook the Book", "Fried Rice"], "recipeIngredient": ["1/4 cup Sriracha, plus more for garnish ", "3 tablespoons soy sauce", "3 tablespoons toasted sesame oil or peanut oil", "1 (12-ounce) container SPAM, diced", "1/2 cup frozen corn kernels", "4 cups cooked white rice, cooled (preferably day-old)", "2 eggs", "1 clove garlic, minced", "Sliced green onions, green part only, for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl whisk together the Sriracha and soy sauce. Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large nonstick or cast-iron skillet or wok over very high heat until it is rocket hot. Add 1 tablespoon of the oil to the skillet and let it heat up until it begins to shimmer and wrinkle, 10 to 15 seconds. Toss in the SPAM and corn and cook until the meat begins to brown, 3 to 5 minutes. Add an additional tablespoon of oil to the pan, and heat for 10 seconds. Add the rice, stirring to coat each grain with oil. Stir-fry for 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move the rice mixture toward the outer edges of the pan, creating a “well” in the center. Add the remaining tablespoon of oil to the center of the pan, and heat until it shimmers, 10 to 15 seconds. Add the eggs and garlic, stirring feverishly. Cook until the eggs are cooked through, then drizzle the Sriracha/ soy mixture over the rice. Toss everything together to combine, cooking for an additional 30 seconds or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mound the rice into bowls, garnish with Sriracha and green onions, and serve immediately.</p>"}]}