{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110915-170895-puff-pastry-24.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pastry", "puff pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Puff Pastry", "link": "https://www.seriouseats.com/recipes/2011/09/puff-pastry-recipe.html", "description": "Puff pastry, while challenging to make, is a wonderful dough that yields light, buttery, flaky layers of shattering pastry. The layers are created by folding layers of butter between sheets of dough. When it bakes, the butter melts, releasing steam and making the dough puff up as the layers separate. This dough is great for making bar tarts, breakfast pastries, palmiers, and dozens of classic French confections.", "totalTime": "5 hours", "recipeYield": null, "recipeCategory": ["Desserts", "Pastry"], "recipeIngredient": ["454 grams bread flour", "114 grams pastry flour (all-purpose is fine to substitute)", "14 grams salt", "114 grams soft butter", "270 grams water, ice cold", "250 grams cold, pliable butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the detrempe: </strong>In the bowl of a stand mixer, mix the dry ingredients with the soft butter on medium speed until the butter is well-integrated and the mixture looks sandy, approximately 3-4 minutes. Reduce the speed to low and drizzle in the ice water. The dough will come together and be slightly dry. Shape the dough in a rough square and wrap it tightly in plastic wrap. Chill in the fridge for 30 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the butter: </strong>Once the dough is done chilling, prepare the cold pliable butter by cutting cold butter into chunks, placing it between pieces of plastic wrap, and pounding it flat with a rolling pin. Gather the butter back together in a mound between the plastic wrap sheets, and pound it out again. Form it into a 4x4 inch square.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bring the two together:</strong> Flour your workbench and place the chilled dough square on top. Using a rolling pin, roll the four corners of the square out into 1/4 inch thick flaps, with a 4x4 inch square of inch-thick dough in the center. Place the square of butter on top of the dough square. Stretch the dough flaps over the top of the butter, tucking in the corners as you go. You want the dough to completely seal in the butter, so it doesn't squirt out when rolling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a floured bench, roll out the dough out into a 18x6 inch rectangle, stopping frequently to even out the edges into straight lines. Fold the dough into thirds, like a letter, then turn the dough 90 degrees and roll it out again, fold it again. Wrap it tightly and allow it to chill for 30 minutes. Repeat this cycle 2 more times, for a total of six folds, 5 turns, and three chilling sessions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough has chilled a final time, it is ready to be rolled out and used according to your chosen recipe. Puff pastry generally bakes at 450 degrees Fahrenheit.</p>"}]}