{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111130-127355-dinner-tonight-fried-squid-po-boy-black-chile-oil.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["'wichcraft", "Dinner Tonight", "fried", "fried squid", "po boys", "sandwich", "squid", "Tom Colicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fried Squid Po' Boy with Avocado and Black Chile Oil", "link": "https://www.seriouseats.com/recipes/2011/12/fried-squid-po-boy-with-avocado-and-black-chile-oil-recipe.html", "description": "Usually when I find myself frying up pieces of squid it's for some kind of Mediterranean dish. (Not that there's anything wrong with that.) But this stunning sandwich from Tom Colicchio's <em><a href=\"http://www.amazon.com/dp/0609610511/?tag=serieats-20\">'wichcraft</a></em> instead looks to New Orleans and Mexico for inspiration. The po' boy is drizzled with black chile oil and layered with avocado slices before being topped with handfuls of crispy squid.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Deep Frying", "Dinner Tonight", "Other Seafood", "Sandwiches"], "recipeIngredient": ["<strong>For the Black Chile Oil</strong>", "8 dried chipotle chiles", "2 dried ancho chiles ", "3/4 cup grapeseed oil ", "2 tablespoons white wine vinegar", "2 tablespoons sugar ", "1 tablespoon minced garlic", "1 tablespoon kosher salt ", "juice of 1/2 lime", " ", "<strong>For the Fried Squid Po' Boy</strong>", "1 pound small squid (both bodies and tentacles), cleaned ", "3 lemons", "kosher salt ", "vegetable oil for frying ", "all-purpose flour ", "1 ripe avocado, halved, pitted, peeled, and sliced", "4 soft rolls, split in half "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the black chile oil: If using a gas stove, make sure a fan is on and set an oven or cooling rack on top of the burner. Turn the burner to high, and set the chiles on the rack. Char the chiles over the flame, flipping them from time to time with a pair of tongs. They are done when they puff up and turn black. Set aside to cool. If using an electric stove, place a large cast-iron skillet over high heat, add the chiles, and cook until they have puffed up and blackened. Set aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chiles are cool, remove the stems and seeds. Add the chiles to a blender or food processor along with the grapeseed oil, white wine vinegar, sugar, garlic, salt, and lime juice. Process until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the fried squid po' boy: Cut the squid bodies into 1/4-inch rounds, and chop the tentacles into 1-inch pieces. Add the squid to a bowl along with the juice of one lemon, and a pinch of salt. Toss about one cup of flour into a second bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed saucepan or Dutch oven, pour enough oil to come up about two inches up the sides. Turn the heat to medium-high. Using an oil thermometer to measure, bring the oil to about 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil is ready, add the squid into the large bowl with flour, and toss until each piece is evenly coated. Shake off any excess. Add as much of the squid to the oil as will fit in one layer. Cook until golden brown, two to three minutes. Remove cooked pieces with a slotted spoon and drain on paper towels. Sprinkle with some salt. Repeat process until all of the squid has been cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On the bottom half of each roll, place a layer of sliced avocado. Divide the fried squid between the four rolls. Top each with about a teaspoon of lemon juice and a teaspoon of the black chile oil. And the top halves of the rolls to each and serve. </p>"}]}