{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110415-147533-mango-upside-down-cake-with-basil-ice-cream.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["basil", "cakes", "Cook the Book", "ice cream", "mangoes", "Michael Schwartz", "Michael's Genuine Food", "upside-down cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mango Upside-Down Cake with Basil Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/04/mango-upside-down-cake-with-basil-ice-cream.html", "description": "Upside-down cakes aren't exactly the height of fashion these days but after making <a href=\"http://www.michaelsgenuine.com/\">Michael Schwartz</a>'s <strong>Mango Upside-Down Cake with Basil Ice Cream</strong>, I think it's high time they made a comeback. This lovely one from <strong><em><a href=\"http://www.amazon.com/Michaels-Genuine-Food-Down-Earth/dp/0307591379/serieats-20\">Michael's Genuine Food</a></em></strong> replaces pineapple with caramelized mango slices.", "totalTime": "1 hour 30 minutes", "recipeYield": "8 to 10", "recipeCategory": ["Bake the Book", "Cakes", "Cook the Book", "Desserts"], "recipeIngredient": ["<strong>For the Mango Upside-Down Cake:</strong>", "4 tablespoons (1/2 stick) unsalted butter ", "3/4 cup packed light brown sugar", "Two 1-pound firm-ripe mangoes, peeled, pitted, and cut into 1/2 inch slices ", "1 1/2 cups all-purpose flour", "3 tablespoons cornmeal", "1 teaspoon baking powder", "1/4 teaspoon fine salt", "8 tablespoons (1 stick) unsalted butter, softened", "1 cup plus 1 tablespoon granulated sugar", "1 teaspoon pure vanilla extract", "4 large eggs, separated", "2/3 cup buttermilk", "<strong>For the Basil Ice Cream:</strong>", "2 cups packed fresh basil leaves", "1/2 cup sugar", "2 cups heavy cream", "1 cup whole milk", "1 vanilla bean, halved lengthwise", "8 large egg yolks", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Mango Upside-Down Cake:</strong> Put a 10-inch cast-iron skillet over medium heat and add the 4 tablespoons butter. When the butter is melted, stir in the brown sugar. Simmer, stirring occasionally, until the mixture looks like caramel, about 5 minutes. Swirl the pan around so the caramel covers the bottom completely. Remove from the heat. Tightly fan the mango slices over the caramel in concentric circles to cover the entire bottom, overlapping the slices.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, whisk together the flour, cornmeal, baking powder, and salt. In another bowl, beat the softened butter with a handheld electric mixer on medium-high speed. Gradually sprinkle in 1 cup sugar and continue beating until light and fluffy, about 5 minutes. Beat in the vanilla and egg yolks, one at a time, scraping the sides of the bowl with a rubber spatula if necessary. Reduce the mixer speed to low and add half of the dry ingredients, mixing until just combined. Stir in the buttermilk, then add the remaining dry ingredients, stirring to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg whites in another bowl with cleaned beaters until frothy.<br />\nSprinkle in the remaining 1 tablespoon sugar and continue to beat until the whites hold stiff peaks. Gently fold half of the beaten whites into the batter with a rubber spatula to lighten it. Then fold in the remaining whites; it’s okay if some white streaks remain.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter over the mangoes and spread evenly to the edges of the<br />\nskillet. Bake until the cake is golden brown and a toothpick comes out clean when inserted into the center, 45 to 50 minutes. Cool the cake in the pan for 5 minutes. Run a knife around the inside rim of the pan to loosen it from the sides and make sure the cake will come out easily. Set a serving plate firmly on top of the pan and carefully flip it over to invert the cake onto the plate. Cool before serving with basil ice cream, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Basil Ice Cream:</strong> In a food processor, combine the basil and sugar.  Pulse until very finely ground.  The sugar should be bright green and look almost like pesto.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cream, milk, and basil-sugar in a large pot over medium heat.  Scrape out the seeds of the vanilla bean and add them to the cream mixture; put the pod in there too for extra flavor.  Simmer gently, stirring, until the sugar is dissolved, about 5 minutes.  Ideally, the temperature should reach 175&deg;F (just scalding); this should take 5 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, whisk the egg yolks until slightly thick and yellow.  Gradually whisk in half of the hot cream into the yolk mixture (do not add too quickly or the eggs will scramble).  Return the entire mixture to the pot and whisk constantly over medium-high heat until the custard is thick enough to coat the back of a spoon and leaves a path when you run your finger across it, about 5 minutes; do not allow to boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass the custard through a fine-mesh sieve into a large container.  Chill the ice cream base completely in a large bowl full of ice water, stirring here and there.  Mix in the salt once completely cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Churn it in an ice cream maker according to the manufacturer's directions.  When done, the ice cream will be the consistency of soft serve.  To hard the ice cream completely, freeze in an covered plastic container.</p>"}]}