{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110608-155395-blueberry-orange-ginger-jam-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["berries", "blueberries", "jams", "Preserved", "preserving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry Orange Ginger Jam", "link": "https://www.seriouseats.com/recipes/2011/06/blueberry-orange-ginger-jam.html", "description": "This jam pairs peak-of-the-season blueberries with fresh orange juice and a double dose of ginger (fresh and ground). Because it's less sugary, it's great for pairing with sweeter breakfast treats like fruity muffins, banana bread, and zucchini bread. Save a jar for the dead of winter, when you need a reminder of the warm months ahead.", "totalTime": "", "recipeYield": "Makes eight (8-ounce) jars", "recipeCategory": ["Blueberry", "Edible DIY", "Fruit", "Ginger"], "recipeIngredient": ["8 cups fresh blueberries", "4 1/2 cups granulated sugar ", "One (1.75-ounce) package low sugar powdered pectin, such as Sure Jell", "Grated zest and juice of one large orange", "1 tablespoon freshly grated ginger", "1/4 teaspoon ground ginger", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve jam, prepare jars and lids: place 8 half-pint jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches if necessary, pulse blueberries in blender until coarsely crushed. You should have about 6 cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure 4 1/4 cups of sugar in one bowl. In another bowl, combine remaining 1/4 cup sugar and pectin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Zest and juice orange. You should have 1/2 cup juice. If you don't, make up the difference with water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine blueberries, orange zest and juice, granted ginger, and ground ginger in large, heavy saucepan or stockpot. Stir in sugar-pectin mixture. Bring to a boil over high heat, stirring constantly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining sugar all at once. Stir in butter and return to a full rolling boil. Boil for one minute. Remove jam from heat and skim off any foam from surface. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}