{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111025-dt-thyme-rubbed-pork-chops-with-pesto.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["basil", "Jamie Oliver", "pine nuts", "pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Thyme-Rubbed Pork Chops with Pesto", "link": "https://www.seriouseats.com/recipes/2011/10/thyme-rubbed-pork-chops-with-pesto-recipe.html", "description": "A thick-cut pork chop (especially one with plenty of marbling) is a wonder by itself, but it's even better after a quick bath in Jamie Oliver's garlic, thyme, and lemon zest marinade, which gives it an herby-citrus quality and complements the caramelized exterior of the pork.", "totalTime": "30", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Nuts", "Pork"], "recipeIngredient": ["Leaves from 1 small bunch thyme", "1 1/2 cloves garlic", "zest and juice of 1 lemon", "4 tablespoons olive oil", "4 pork chops", "3 handfuls fresh basil", "1/4 cup toasted pine nuts", "1/4 cup grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mortar and pestle, mash together the thyme leaves, 1 teaspoon salt, 1 clove of garlic, and a several grinds of black pepper (alternatively, chop everything finely on a cutting board).  Once pulped into a paste, add the lemon zest and 1 tablespoon of the olive oil and stir well.  Rub the mixture onto the pork chops and let them rest for 10-15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, wipe out the mortar and mash the remaining 1/2 clove of garlic with a pinch of salt.  Add the basil leaves and continue pounding to make a paste (or pulse everything in a small food processor).  Pound or pulse in the pine nuts and olive oil, adding more oil if necessary to create a loose paste. ,Transfer the pesto to a small bowl and fold in the Parmesan.  Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a ridged grill pan over medium heat, then add the pork chops.  Cook until golden and caramelized on the outside and still juicy within. Remove from the heat and allow to rest, then spoon the pesto over them and serve.</p>"}]}