{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110216-138127-eat-for-eight-bucks-rice-bowl-miso-marinated-flank-steak.JPG", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "miso", "rice", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Rice Bowl with Miso-Marinated Flank Steak", "link": "https://www.seriouseats.com/recipes/2011/02/rice-bowl-with-miso-marinated-flank-steak-recipe.html", "description": "<strong>There are two tricks to incorporating red meat into a budget meal.</strong> One, buy cheaper meat. The very cheapest meats tend to need a long, slow braise, but skirt and flank steak are good options for grilling or searing. Two, stretch that meat further. This idea is enabled by bowls full of carbs&mdash;best of all, a big bowl of pantry-staple white rice.", "totalTime": "3 hours", "recipeYield": "2", "recipeCategory": ["Beef", "Eat for Eight Bucks", "Mains", "Rice"], "recipeIngredient": ["1 tablespoon white miso", "1 tablespoon plus 1 teaspoon mirin", "1 teaspoon rice wine vinegar", "3 teaspoons soy sauce, plus more for serving", "1 clove garlic, minced", "1 teaspoon sesame oil", "Salt", "2/3 lb flank steak", "3 medium carrots (about 1/2 pound), peeled and trimmed", "4 teaspoons grapeseed or other neutral oil", "1/2 teaspoon honey", "Cooked short grain or jasmine rice", "Sesame seeds (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the miso, 1 tablespoon mirin, rice wine vinegar, 2 teaspoons soy sauce, garlic, sesame oil, and a pinch of salt in a small nonreactive bowl. Coat the steak in this marinade, flipping to get both sides. Cover tightly with plastic wrap and refrigerate for at least 2 hours and up to 6. Remove from the refrigerator 30 minutes before cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Cut the carrots into planks about 3 inches long and ¼-inch thick. Place them in a bowl with 2 teaspoons grapeseed oil, 1 teaspoon mirin, 1 teaspoon soy sauce, and honey, plus a pinch of salt. Toss to combine, then spread on a parchment-lined baking sheet and bake on the top of your oven for 20 minutes, until the carrots are soft and browned on the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a cast iron pan over medium-high heat for 5 minutes. Pour in the remaining 2 teaspoons grapeseed oil and tilt the pan to spread evenly. Place the steak in the pan and cook for 5-6 minutes, then flip and continue to cook until instant read thermometer registers 130°F when inserted into center for medium rare, about 5 minutes longer. Remove the steak to a plate and tent loosely with foil. Let rest for 5 minutes. Transfer the steak to a cutting board and cut it into ½-ich thick slices against the grain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fil two bowls with rice and arrange the carrot planks on top of each bowl. Stack half the steak slices on top of the carrots, and spoon any juice that's gathered on the plate on top. Sprinkle with sesame seeds, if using.</p>"}]}