{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/392011-141508-rabbit-ragu-potato-gnocchi.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["gnocchi", "potato gnocchi", "rabbit", "rabbit ragu", "ragu", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Rabbit Ragu with Potato Gnocchi", "link": "https://www.seriouseats.com/recipes/2011/03/sunday-supper-rabbit-ragu-with-potato-gnocchi-recipe.html", "description": "There's something about rabbit&mdash;richer than chicken and more subtle than pork, it has a flavor that's unique.  This simple ragu has uncomplicated ingredients that let the rabbit's flavor come through.", "totalTime": "2 hours", "recipeYield": "4", "recipeCategory": ["Mains", "Other Meats", "Sunday Supper"], "recipeIngredient": ["1 2 - 2 1/2 pound rabbit, cut into 6 pieces", "olive oil", "1 medium onion, finely chopped", "1 carrot, grated on the large side of a box grater", "1 rib of celery, finely chopped", "1 large clove of garlic, minced", "1 1/2 cup chicken stock", "1 28 ounce can whole stewed tomatoes", "1/2 cup red wine", "salt and pepper", "Gnocchi", "2 large baking potatoes (about 2 pounds)", "2 eggs, beaten", "1/4 cup grated parmesan cheese", "1/4 teaspoon salt", "1/4 teaspoon cracked black pepper", "1/2 - 1 cup flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;.  Wash potatoes and pierce all over with a fork.  Bake in oven until soft, about 30 minutes.  Remove from oven and allow to cool.  Reduce oven temperature to 325&deg;.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season rabbit pieces with salt and pepper.  Heat a large braising dish with a lid over medium high heat with a drizzle of olive oil.  Sear rabbit pieces until brown on all sides, about 6 minutes.  Remove from pan and reserve.  Add another drizzle of olive oil and add onion, stirring to loosen bits from bottom on pan. Cook until soft and beginning to brown, about 5 minutes.  Add carrot, celery and garlic and cook until fragrant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour chicken stock, then can of tomatoes over vegetables.  Add rabbit pieces and half cup of red wine.  Cover with lid and place in oven until rabbit is fully cooked, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once potato is cool enough to handle, split in half and remove flesh.  Run potato flesh through the large holes of a box grater; there should be about 2 cups.  Make a mound with grated potato with a well in the center.  Add the eggs, grated Parmesan cheese, salt, and pepper.  Using a fork, begin to mix egg with potato until a wet dough is formed.  Add flour, sprinkling 1/4 cup at a time, to make a soft dough.  Depending on how moist your potatoes were, the amount of flour you need will vary (here's a <a href=\"http://www.seriouseats.com/2011/03/how-to-make-potato-gnocchi-recipe.html\">gnocchi tutorial</a>).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dough is formed, divide into 8 even pieces and roll into a log about 1/2 inch thick.  Cut log into 1/2 inch pieces and, using the back of a fork, form gnocchi.  When ragu is ready, boil gnocchi in salted water until they float, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When rabbit is cooked, remove from sauce, and reserve until cool enough to handle.  Place sauce back on stove over medium high heat and reduce until thickened, about 18 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once rabbit is cool enough to handle, carefully remove meat from bones.  Either shred by hand, or finely chop, depending on preference.  Add shredded/chopped meat back to sauce and continue to simmer until meat is warm and incorporated back into sauce.  Serve over gnocchi.</p>"}]}