{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110313-cinnamon-buns-liquid.jpg", "author": {"@type": "Person", "name": "Robyn Lee"}, "recipeCuisine": "", "keywords": ["buns", "Cinnamon Buns", "Norwegian", "pastries", "Scandinavian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Skillingsboller, Norwegian Cinnamon Buns", "link": "https://www.seriouseats.com/recipes/2011/04/skillingsboller-norwegian-cinnamon-buns-recipe.html", "description": "[Photograph: Robyn Lee] Note: It's best to make the rolls the night before and allow them to rise in the refrigerator overnight. You can bake them anywhere between 10 and 24 hours after shaping and refrigerating them. Pearl sugar isn't...", "totalTime": null, "recipeYield": "makes 25 to 30 buns", "recipeCategory": ["Breakfast and Brunch", "Desserts"], "recipeIngredient": ["2 stick (16 tablespoons) unsalted butter, room softened", "1 1/2 cups milk", "1 cup sugar", "1 teaspoon ground cardamom (either pre-ground or <a href=\"http://penandfork.com/tips-tutorials/fresh-ground-cardamom/\">freshly ground</a>)", "4 1/4 cups (about 22.5 ounces) all-purpose flour", "1 teaspoon table salt", "2 1/4 teaspoons (1 packet) instant yeast", "1 tablespoon cinnamon", "Raisins (optional)", "Pearl sugar or granulated sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 stick butter in a saucepan over low heat. Add the milk and heat until lukewarm. Remove from heat. Stir in 1/2 cup sugar and cardamom and stir until dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl or the bowl of a stand mixer fitted with a dough hook attachment, combine flour, salt, and instant yeast until homogeneous. Add liquid from step 1 and knead until a tacky dough forms. To knead by hand, turn dough out on lightly floured counter and knead until smooth and not too sticky, about 10 minutes, dusting with flour as necessary to prevent sticking. To knead in a stand mixer, knead on medium low speed until dough is smooth and elastic. It should pull away from the sides of the mixer, but just barely stick to the bottom. If not, add small amounts of flour and allow them to be fully incorporated until the right texture is achieved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dough ball in large bowl and cover with a clean towel. Leave bowl in a warm spot until risen to double size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine remaining stick of butter, cinnamon, and remaining 1/2 cup of sugar in a small saucepan over low heat. Stir until butter is just melted, then allow to cool while dough finishes rising.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into two equal balls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With rolling pin, roll out one ball into a square approximately 14-inches to a side and 1/2-inch thick. Spread half of butter/sugar mixture over dough leaving a 1/4-inch gap on the top and bottom, but spreading all the way to the sides. (Optional: Sprinkle on raisins.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll dough away from you into a tight log and place seam-side down on a cutting board. Use a sharp chef's knife to cut it into 1-inch rolls, using a gently sawing motion. Transfer rolls to a rimmed baking sheet lined with parchment paper, spacing them about 1/2 inch apart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat steps 6 and 7 with remaining ball of dough, using an additional rimmed baking sheet (or, if you don't mind your rolls sticking together, you can fit them all into a single baking sheet). Cover rolls with plastic wrap and allow to rise in refrigerator for 10 to 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, remove pans from the refrigerator and place on the counter while the oven preheats to 450°F. Adjust oven racks to upper middle and lower middle position. Bake until puffed and lightly browned, 8 to 12 minutes, rotating sheets top to bottom and front to back halfway through baking. (Optional: Sprinkle pearl sugar or granulated sugar over the buns just as you take them out of the oven. The heat from the buns will make the sugar stick, but not melt.) Allow to cool 5 minutes, and serve.</p>"}]}