{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110602-154761-sweettech-pate-a-choux-slide1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cream puffs", "pastry", "pate a choux"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pâte à Choux Puffs (Cream Puffs)", "link": "https://www.seriouseats.com/recipes/2011/06/filled-pate-a-choux-puffs-aka-cream-puffs.html", "description": "Pâte à choux (pronounced pat-ah-choo) is the paste-like dough used for making the crispy shells of cream puffs, éclairs, gougères, and profiteroles. Once you understand the technique, making choux at home is easy. The hard part is choosing a filling. Some favorites include: pastry cream, pudding, chocolate ganache, whipped lox and cream cheese, or jam.", "totalTime": "1 hour", "recipeYield": "24 (puffs)", "recipeCategory": ["Desserts", "Pastry"], "recipeIngredient": ["½ cup water", "¾ cup milk", "1½ teaspoons salt (1/2 for dough, 1 for egg wash)", "½ cup butter, cut into pieces", "1 ½ cups bread flour", "7 eggs (6 for the dough, 1 for egg wash)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400 degrees Fahrenheit. Combine water, milk, butter (cut into small pieces), and salt in a medium sized saucepan over medium heat. Stir occasionally, ensuring that the butter melts completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the liquid starts to bubble around the edges, add the flour and stir vigorously to even out the dry spots. Continue to stir as the dough begins to form, about one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to vigorously stir the dough for another 2-3 minutes. You will start to notice a skin forming on the bottom of the pan, and the dough will pull away from the sides as you stir. Once this happens, transfer the dough to the bowl of your mixer (or a regular bowl, for those without).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the paddle attachment or a big wooden spoon, slowly mix the dough and allow it to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough has cooled, begin adding the eggs, one at a time, mixing well on medium speed after each addition and scraping down the sides as you go. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once you’ve added your last egg, beat the dough vigorously for 15 seconds. Scrape the bowl down a final time, then beat again for at least 15 seconds on high speed, until the dough is consistently smooth, thick, and slightly shiny.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pipe 4 small dots of the dough in each of the corners of the baking sheets and line two baking sheets with parchment, using the dots as glue to hold the parchment steady. Transfer the dough to a piping bag or a ziploc bag with the corner clipped off and pipe the dough into 2 inch balls, leaving one inch of space on all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine 1 egg with 1 big pinch of salt of salt and whisk for one minute, until light and homogenous. Apply egg wash to the tops of the dough with a brush and bake in preheated oven at 400 degrees Fahrenheit, for 20-25 minutes or until golden brown, rotating halfway through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the shells to cool on the baking sheets for at least 10 minutes. Use the tip of a pairing knife to bore a small hole in the bottom of each piece, and use a piping bag or Ziploc bag (fitted with a small, round pastry tip) to pipe in filling of choice. Sift powdered sugar over the top (optional) and serve immediately. </p>"}]}