{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110504-cinco-de-mayo-recipes-primary-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["cheese", "chorizo", "cinco de mayo", "dips", "Mexican"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Queso Fundido con Chorizo Verde y Rajas (Melted Cheese With Green Chorizo and Roasted Pepper Strips)", "link": "https://www.seriouseats.com/recipes/2011/05/queso-fundido-with-green-chorizo-and-rajas-recipe.html", "description": "This stringy cheese and peppery melt is a great way to use up leftover tortillas.", "totalTime": "30 minutss", "recipeYield": "Serves 4 to 6 as an appetizer", "recipeCategory": ["Cheese", "Mexican"], "recipeIngredient": ["1 poblano pepper", "2 teaspoons kosher salt", "1/4 cup finely minced cilantro", "1 serrano or jalapeño pepper", "1 clove garlic, grated on a microplane grater", "1/2 pound ground pork", "12 ounces grated queso quesadilla, Jack, or Oaxacan string cheese.", "Warm tortillas or chips for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees F. Cook poblano pepper directly over an open gas flame until charred on all sides, about 10 minutes. Alternatively, cook under a broiler preheated to high, turning occasionally until charred on all sides. Transfer to a bowl and cover with plastic wrap. Allow to rest 10 minutes, then peel and discard skin. Slit in half with a sharp chefs knife and discard seeds and stem. Cut flesh into 1/4-inch-wide strips and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine half of pepper with salt, cilantro, jalapeño, and garlic and transfer to the bowl of a food processor. Process until smooth paste is formed, then transfer to a medium bowl. Add pork and massage with hands until fully combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pork mixture in a nonstick or cast iron skillet over medium high heat, stirring anid breaking up meat occasionally until fully cooked and browned in spots. Transfer to a clean bowl. Add cheese and reserved pepper strips and toss to combine. Transfer mixture to a gratin dish, a small cast iron skillet, or a casuals, and bake until cheese is melted and bubbly and just beginning to brown in spots. Serve immediately with warm tortillas or chips.</p>"}]}