{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111107applerolypoly.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apple desserts", "cranberries", "Sonya Jones", "Sweet Auburn Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple Roly Poly", "link": "https://www.seriouseats.com/recipes/2011/11/apple-roly-poly-edna-lewis-dessert-recipe.html", "description": "Never heard of a Roly Poly? This Southern dessert is a roll of sweet pastry dough filled with cinnamon sugared apples and finished with a cranberry sauce.", "totalTime": "1 hour", "recipeYield": "8 to 10", "recipeCategory": ["Cranberry", "Fruit Desserts"], "recipeIngredient": ["<strong>Roly Poly</strong>", "2 quarts water, or enough to cover the roly poly", "1 egg, well beaten", "1/2 cup milk", "1/2 stick butter, plus 2 ounces, melted, for brushing roly poly", "1/4 teaspoon salt", "1 teaspoon baking powder", "4 tablespoons flour, or enough to make a stiff dough", "1 pound apples, thinly sliced", " ", "<strong>Cinnamon Sugar</strong>", "1/4 cup sugar", "1 teaspoon cinnamon", " ", "<strong>Cranberry Sauce</strong>", "1 cup cream", "1 cup sugar", "2/3 cup vinegar", "1 tablespoon cornstarch", "1 cup cranberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a pot of water on the stove and fill with 2 quarts water. Bring to a boil.  While the water is heating, combine the beaten egg, milk, and 1/2 stick butter in a mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, combine the salt and baking powder. Add the dry ingredients to the egg mixture and mix well. Stir in the flour, 1 tablespoon at a time, using just enough to make the dough stiff.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough is stiff, roll it out on a lightly floured surface to a 1/2-inch thickness. Form the dough into a rectangle and brush liberally with the melted butter. Sprinkle the cinnamon sugar onto the dough and lay the apple slices over the sugar in rows. Transfer the dough to a cheese cloth and roll the dough tightly into a log. Wrap the cheese cloth tightly around the log, securing both ends and tying with kitchen twine so the log retains its shape as it boils.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Submerge the roly poly in the boiling water and continue to boil for 45 minutes, or until the dough is firm to the touch. Remove the pot of water from the heat and use a spatula to transfer the roly poly to a platter to cool before serving.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cranberry sauce, mix the cream, sugar, vinegar, and cornstarch in a saucepan. Cook over medium-high heat until the sauce thickens. Add the cranberries and cook for 2 minutes more. To serve, pour the sauce over the roly poly, and pass any extra sauce around the table to pour over individual slices.</p>"}]}