{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111010-174507-orcchiette-with-sausage-and-chard-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fennel", "Nancy Silverton", "orecchiette", "pasta", "sausag", "swiss chard", "The Mozza Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Orecchiette with Fennel Sausage and Swiss Chard", "link": "https://www.seriouseats.com/recipes/2011/10/orecchiette-with-fennel-sausage-swiss-chard-recipe.html", "description": "Sausage and greens are a glorious pair, whether piled into a sandwich or in this <strong>Orecchiette with Fennel Sausage and Swiss Chard</strong> is a hearty and fall-perfect Puglian classic brought stateside by <strong>Nancy Silverton</strong> and <strong>Matt Molina</strong>, executive chef at <strong>Osteria Mozza</strong>.", "totalTime": "45 minutes", "recipeYield": "4 as a main, 8 as a first course", "recipeCategory": ["Cook the Book", "Pasta", "Pork"], "recipeIngredient": ["<strong>For the chard:</strong>", "1 bunch Swiss chard", "1/4 cup extra- virgin olive oil", "Kosher salt", "1/2 large yellow Spanish onion, thinly sliced ", "12 garlic cloves, thinly sliced lengthwise ", "2 dried arbol chiles", "&nbsp;", "<strong>For finishing and serving the pasta:</strong>", "3/4 pound Fennel Sausage (recipe follows)", "1/2 teaspoon Aleppo pepper", "1 cup chicken stock, or 1/4 cup salted pasta water mixed with 1/4 cup plain water", "3 tablespoons unsalted butter", "Kosher salt", "12 ounces Orecchiette", "3 tablespoons finishing-quality extra-virgin olive oil", "1/4 cup plus 2 tablespoons freshly grated Parmigiano-Reggiano", "2 teaspoons fennel pollen", "2 tablespoons toasted bread crumbs", "&nbsp;", "<strong>Fennel Sausage:</strong>", "3 tablespoons fennel seeds", "4 pounds boneless pork shoulder", "1 pound pork fatback", "3 tablespoons finely chopped garlic (about 10 large cloves)", "2 tablespoons kosher salt", "2 tablespoons sugar", "2 tablespoons freshly ground black pepper ", "2 tablespoons hot paprika", "1 tablespoon fennel pollen", "1/4 cup red wine vinegar", "3/4 cup ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fennel Sausage:</strong> Toast the fennel seeds in a small skillet over high heat, shaking the skillet to keep the seeds from burning, until they are fragrant, about 1 minute. Pour the seeds onto a plate and set aside to cool to room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the pork shoulder and fatback into 1- inch cubes and put the cubes in a large bowl. In a small bowl, combine the garlic, salt, sugar, pepper, paprika, fennel pollen, and toasted fennel seeds. Stir the seasonings together and sprinkle them over the pork and fatback. Toss to coat the meat with the seasonings, cover the bowl tightly with plastic wrap, and refrigerate for at least 24 hours and up to two days. (If you are in a hurry, you can put the meat in the freezer until it is ice cold, but not frozen.) <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit a meat grinder with the largest die and have the bowl of a standing mixer handy. Remove the meat from the refrigerator (or freezer) and pass it through the grinder, catching the gound meat into the mixer bowl. Fit the standing mixer with the paddle attachment. Combine the vinegar and ice water. Put the bowl with the ground meat in it on the standing mixer and mix them on low speed, gradually adding the vinegar and water until the meat is slightly sticky; you may not use all of the liquid. Use the sausage according to your recipe, or transfer it to an airtight container or several containers. Refrigerate the sausage for up to five days or in the freezer for up to three months. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pasta:</strong> To prepare the chard, pull the leaves from the ribs. Roughly chop the leaves and set aside. Cut off and discard the very ends of the ribs and slice the ribs 1/4 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large sauté  pan over medium- high heat until it is almost smoking and slides easily in the pan, 2 to 3 minutes. Add the chard ribs, season with salt, and sauté for 2 to 3 minutes, until barely translucent. Add the onion, garlic, and chiles, and season with salt. Sauté the vegetables for about 10 minutes, adding water to the pan (as much as 1 cup total), stirring often to prevent the vegetables browning. (You add water to the pan so you can sauté and sweat the onion without browning it, but you never want the onion swimming in water—just enough so the pan isn’t dry.) Add the chard leaves, season with salt, and fold the leaves in with the onion for 1 or 2 minutes to wilt them slightly. Reduce the heat to low, cover, and cook for 15 to 20 minutes, stirring from time to time, until the chard leaves are very dark green and the onion, leaves, and stems are one soft, homogenous mixture. Turn the vegetables out onto a cutting board and chop, cutting first in one direction and then perpendicular to the first direction, until the vegetables are finely chopped to the point of being almost pureed. Measure out a heaping 1/4 cup of the vegetables for the pasta dish. Use the rest as an excuse to prepare this dish again in the very near future, or spoon a heaping spoonful under a piece of grilled fish, topped with a spoonful of Salsa Verde. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, heat a sauté  pan over high heat for about 2 minutes until it’s very hot. Add the sausage to the pan and cook it undisturbed for about 2 minutes, until the meat is seared. Stir the meat and cook for another 4 minutes, breaking it into pea- size pieces, until it is cooked through. Add the chopped chard and cook for 2 to 3 minutes to warm it through, stirring the chard into the sausage as it cooks. Sprinkle the pepper over the chard and sausage, add the chicken stock, and cook the sauce for 2 minutes, stirring constantly, to bring the ingredients together. Add the butter, stir until it melts, and turn off the heat while you cook the pasta. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a pasta pot or large stockpot with 6 quarts of water, add 6 tablespoons of salt, and bring the water to a boil over high heat. If you are not using a pasta pot, place a colander in the sink or have a large wire strainer handy to lift the pasta out of the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the orecchiette from the refrigerator or the freezer and drop them into the boiling water. Stir to prevent the pasta from sticking together, partially cover the pot so the water returns to a boil quickly and continues boiling, and cook the pasta until it’s al dente, about 2 minutes. About 1 minute before the pasta is done, place the sauce over high heat. Lift the pasta out of the cooking water or drain it and immediately add it to the pan with the sauce. Cook the pasta with the sauce together for 1 to 2 minutes, stirring with a rubber spatula, until the sauce is thick, adding fresh water to the pan if the pasta looks dry or sticky instead of slippery and glistening. Turn off the heat and add the finishing-quality olive oil, Parmigiano-Reggiano, and fennel pollen, stirring vigorously and shaking the pan to emulsify the sauce. Pile the orecchiette in the center of each of eight plates, dividing it evenly, and spoon any sauce left in the pan over the pasta. Sprinkle a generous tablespoon of bread crumbs over each serving, and serve with the remaining bread crumbs on the side.</p>"}]}