{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110305-145753-carrot-cake-conserve-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["carrot", "carrot cake", "Edible DIY", "jams"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Carrot Cake Conserve", "link": "https://www.seriouseats.com/recipes/2011/04/carrot-cake-conserve-recipe.html", "description": "This carrot cake conserve is just the thing to make on the cusp of spring, when you're itching to bust out your canning supplies but strawberries and rhubarb aren't quite yet in season. It's filled with juicy raisins and crunchy...", "totalTime": "2 hours, plus cooling time", "recipeYield": "Makes seven (8-ounce) jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Edible DIY"], "recipeIngredient": ["1 1/2 cups finely grated peeled carrots", "1 1/2 cups finely diced peeled and cored tart apples, such as granny smith", "1 3/4 cups canned crushed pineapple, including juice", "3 tablespoons freshly squeezed lemon juice", "3/4 teaspoon cinnamon", "1/2 teaspoon ground nutmeg", "1/4 teaspoon ground cloves", "1/2 cup raisins", "One (1.75-ounce) package powdered fruit pectin", "6 1/2 cups granulated sugar", "1/2 teaspoon butter", "1/2 cup finely chopped walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve conserve, prepare jars and lids: place 7 half-pint jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine carrots, apples, pineapple, lemon juice, cinnamon, nutmeg, and cloves in large, heavy saucepan. Bring to a boil over high heat, stirring constantly. Reduce heat to simmer, cover, and cook 20 minutes, stirring occasionally. Meanwhile, pulse raisins in food processor until finely chopped. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 20 minutes, remove pot from heat and stir in pectin until dissolved. Stir in raisins, breaking up clumps with back of spoon. Return pot to heat and bring to boil. Add sugar all at once and return to boil, stirring constantly. Add butter and boil hard for one minute. Remove pot from heat, skim off any foam, and stir in walnuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot conserve into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. <br />\n</p>"}]}