{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110704-127677-LTE-Apricot-Procedure.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["apricots", "cakes", "fruit desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apricot Turnover Cake", "link": "https://www.seriouseats.com/recipes/2011/07/apricot-turnover-cake-recipe.html", "description": "This cake is one of many from my great-grandmother's recipe collection; it's an upside-down cake, but she called it a \"turnover.\" Cute, no? The cake is made with the usual suspects: butter, sugar, eggs, flour, etc., which is why every time I make it I am stunned at how delicious it is. Alchemy, no doubt.", "totalTime": "2 hours, 35 minutes", "recipeYield": "12", "recipeCategory": ["Apricot", "Cakes", "Desserts"], "recipeIngredient": ["Baking spray", "2 cups all-purpose flour", "2 teaspoons baking powder", "3/4 teaspoon salt", "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature", "1 cup packed dark brown sugar", "1 1/2  teaspoons pure vanilla extract", "1 1/2 cups sugar", "2 large eggs, separated and at room temperature", "1 cup milk, at room temperature", "8 apricots, pitted and sliced into 8 wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Lightly spray 13- by 9-inch cake pan with baking spray. Line bottom of pan with parchment paper and lightly spray once again with baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together flour, baking powder, and 1/2 teaspoon salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium stainless steel skillet, melt 4 tablespoons butter over medium heat until beginning to foam, 3 to 4 minutes. Swirl the pan gently from time to time and continue cooking until the foam subsides and you see solids beginning to brown at the bottom of the skillet, 2 to 3 minutes longer. Remove from heat and stir in dark brown sugar, 1/2 teaspoon vanilla, and remaining 1/4 teaspoon salt; mixture will resemble damp sand. Sprinkle mixture evenly in prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, beat sugar and remaining 8 tablespoons butter on medium speed until light and fluffy, about 3 minutes. Add egg yolks, one at a time, beating well after each addition. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce mixer speed to medium-low and add flour mixture in three batches, alternating with milk. Stop mixer and scrape sides and bottom of bowl with rubber spatula as needed. Add remaining 1 teaspoon vanilla and beat just until combined. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit mixer with whisk attachment. In separate, clean, dry bowl, whip egg whites on medium-high until they hold stiff—but not dry—peaks, about 2 minutes. Fold egg whites into cake batter with rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange apricot wedges in rows over brown sugar. Spoon batter evenly over apricots, spreading with rubber spatula to cover evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until a toothpick inserted into the middle of cake comes out clean, 45 minutes to 1 hour. Transfer pan to cooling rack and cool in pan for 30 minutes. Carefully turn pan over onto rimmed baking sheet or serving platter and peel away parchment. Cool additional 15 to 30 minutes and serve.</p>"}]}