{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110707-159532-fennel-orange-pepper-salad.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["fennel", "red peppers", "salad", "Spice Hunting", "spices", "Tasmanian pepper", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fennel, Orange, and Roasted Pepper Salad", "link": "https://www.seriouseats.com/recipes/2011/07/fennel-orange-and-roasted-pepper-arugula-salad-recipe.html", "description": "This is a simple salad, but it's all about playing off the different flavors of Tasmanian pepper, soaked in the dressing before serving. Raw fennel's complex sweetness and astringency highlights the spice's fruitiness and pepper-like bite. Oranges magnify its hints of bright fruits and flowers, while smoky roasted red pepper lets the spice's earthiness shine. The bed of arugula gives the salad body, and its bitterness does well with Tasmanian pepper's juniper-like alpine qualities.", "totalTime": "30 minutes", "recipeYield": "serves 6", "recipeCategory": ["Dairy-Free", "Salads", "Vegan", "Vegetarian"], "recipeIngredient": ["2 large red bell peppers, halved with tops and seeds removed", "10 Tasmanian pepper berries, crushed well", "2 tablespoons lemon juice", "6 tablespoons mild olive oil", "4 ounces arugula", "1 large fennel bulb, thinly sliced", "2 large oranges, segmented"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set broiler to high. Line a sheet pan with a large amount of aluminum foil, and add peppers. Broil at least six inches away from broiler for 20 minutes, or until peppers yield without resistance to a knife and their skins are completely black. Wrap up in foil and let rest for five minutes, before peeling off skin and slicing peppers into thin strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine Tasmanian pepper and lemon juice. Let pepper infuse for 15 minutes, then whisk in olive oil until emulsified.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, either toss arugula, fennel, oranges, and peppers with dressing and salt in a bowl, or create six beds of arugula on salad plates and evenly divide additional ingredients, spooning dressing and salt to taste over each plate.</p>"}]}