{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110112-131807-herbaltinis.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cocktail recipes", "Cook the Book", "gin", "mint", "recipe newsletter", "rosemary", "The Sunset Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Herbaltinis", "link": "https://www.seriouseats.com/recipes/2011/01/herbaltinis-cocktail-recipe.html", "description": "These gin-based <strong>Herbaltinis</strong> are like a California-fied Tom Collins, all gin and citrus with bright green herbal notes that carry through the cool, refreshing drink.  Adapted from <em><strong><a href=\"http://www.amazon.com/Sunset-Cookbook-Fresh-Flavorful-Recipes/dp/0376027940/serieats-20\">The Sunset Cookbook</a></strong>,</em> this is the kind of cocktail I imagine mixing up if I had a gorgeous Southern California backyard filled with citrus trees and bushy patches of fresh herbs. But even when mixed up in the dead of winter from supermarket produce and herbs, this cocktail was fresh and light, a sort of winter pick-me-up thanks in equal parts to the citrusy summery flavors and the gin.", "totalTime": "20 minutes", "recipeYield": "8 to 12", "recipeCategory": ["Cook the Book", "Gin"], "recipeIngredient": ["24 mint sprigs (4 inches each)", "12 rosemary sprigs (3 inches each)", "3/4 cup superfine sugar", "2 oranges (6 ounces each), chilled and quartered", "2 1/4 cups gin, chilled in freezer", "1 cup plus 2 tablespoons fresh lime juice (from about 7 limes), chilled", "1 1/2 cups club soda, chilled", "Mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 2 1/2- to 3-quart pitcher, combine mint and rosemary sprigs and sugar. With a long-handled wooden spoon, muddle (or crush) herbs and sugar together. Squeeze juice from oranges into the pitcher, then drop quarters in. Press a few times with a spoon to release oil from orange peels. Stir in gin, lime juice, and 1/2 cup ice water. Mix until sugar is dissolved. If using martini glasses, chill in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, slowly pour chilled club soda into pitcher, pouring down the side. Stir gently to blend. Pour through a strainer into chilled martini glasses or ice-filled glasses. Float a mint leaf on top of each.  </p>\r\n\r\n<p><small><strong>Make ahead:</strong> Up to 4 hours, chilled in a pitcher; however, since crushed mint turns dark after about 20 minutes, strain the mixture just before guests arrive, return it to the pitcher, and add a handful of fresh mint leaves.</small></p>"}]}