{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011-bread-baking-70-percent-hydration-bread%20sliced.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Bread Baking: 70-Percent Hydration Bread", "link": "https://www.seriouseats.com/recipes/2011/03/bread-baking-70-percent-hydration-bread-recipe.html", "description": "Stretch and fold is about the easiest ways to handle a dough with very high hydration. But stretch and fold can be used with doughs of lesser hydration as well, as long as it's wet enough to stretch easily. If you've never tried this technique and you've always kneaded with a machine or by hand for up to 10 minutes, it will seem impossible that a few simple folds will give enough structure to the dough. But it works.", "totalTime": "3 hours 10 minute plus overnight rest", "recipeYield": "1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["20 ounces (about 3 2/3 cups) bread flour", "14 ounces water", "1 teaspoon instant yeast", "1 1/2 teaspoons salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, water, yeast and salt in the bowl of your stand mixer. Mix with the paddle attachment or dough hook (this dough is wet enough that either will work) until all the ingredients are combined and the mixture begins to get smooth. You can also do this by hand with a wooden spoon or dough whisk. Drizzle the oil into a clean bowl, and move the dough to the oiled bowl, turning to coat on all sides. Cover the bowl with plastic wrap and put it in the refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and let it rest, still in the covered bowl, for an hour at room temperature. Dust your work surface lightly with flour and turn the dough out. Grasp the two sides of the dough and pull gently outward until the dough is three times its original width. Fold the two sides inward, like you are folding a letter. Turn the dough 90 degrees and repeat this procedure. Turn the dough 90 degrees again and repeat. For this final fold, the dough should be stiffer and more elastic. Seal any seams and turn the dough over so the smooth side is on top. If you prefer, coax the dough into a more round shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some cornmeal on a baking sheet (or on a peel, if you prefer to bake on a stone) or place the bread on a piece of parchment paper, if you prefer using that to transfer it to your stone. Sprinkle some flour on top of the loaf - or use white rice flour, if you have it - and cover the loaf with plastic wrap. Since this dough is so wet, it's a good chance it will stick to the plastic wrap if you don't flour it. Set the dough aside to rise until doubled, about and hour. Meanwhile, preheat the oven to 425 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, spray the surface with water and place it in your preheated oven. Bake until golden brown, about 35 minutes. Move the dough to a rack to cool before slicing.</p>"}]}