{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110105-127355-dinner-tonight-welsh-rarebit-brussels-sprouts.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beer", "british", "cheese", "cheese sauces", "english", "toast", "welsh rarebit", "Worcestershire sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Welsh Rarebit with Brussels Sprouts", "link": "https://www.seriouseats.com/recipes/2011/01/welsh-rarebit-with-brussels-sprouts-recipe.html", "description": "Welsh rarebit just seemed right. It was devastatingly cold outside, and I needed something to warm my insides and soothe my head. For those of you scratching your heads, <strong>Welsh rarebit is English dish of a cheese sauce on toast. But it's so much more than that,</strong> as the cheese sauce combines beer with a good aged Cheddar. It also contains a good dose of Worcestershire sauce and mustard, so it has an edge. It's wonderfully complex, and a far cry from most cheddar sauces.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Cheese", "Dinner Tonight"], "recipeIngredient": ["<strong>For the Brussels Sprout</strong>", "2 pound brussels sprouts, discolored outer leaves peeled off, ends trimmed, sliced in half", "2 tablespoons canola oil", "salt and pepper", "<strong>For the Welsh Rarebit</strong>", "3 cups aged Cheddar, grated", "1 tablespoon butter", "1 cup beer", "1 large egg, lightly beaten", "1 teaspoon Worcestershire sauce", "1 teaspoon salt", "½ teaspoon paprika", "¼ teaspoon dry mustard", "⅛ teaspoon cayenne pepper", "8 slices wheat or rye bread, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Brussels sprouts: Adjust oven racks to lower middle and upper middle positions and preheat oven to 400&deg;F. Pour canola oil into large iron skillet set over medium heat. When oil starts to shimmer add sprouts cut side down. Cook until sprouts begin to brown on the bottom, about 10 minutes. Toss sprouts with a wooden spoon and transfer skillet to oven. Cook until tender and bright green, about eight minutes, stirring after four minutes. Turn off oven and set sprouts aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Welsh rarebit: Fill a medium-sized saucepan with water. Bring to boil over high heat. Place large metal bowl on top for a double boiler. Add butter. When it melts, pour in beer. When beer is warm, whisk in cheese, adding about a quarter cup at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the cheese has melted, slowly add beaten egg, whisking constantly. Add Worcestershire sauce, salt, paprika, mustard, and red pepper flakes. Continue to whisk, and cook until the sauce starts to thicken, about one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place two slices of bread on each plate, and spoon over enough cheese sauce to cover. Serve with Brussels’ sprouts on the side.</p>"}]}