{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110218-138134-roasted-beet-chocolate-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["beets", "chocolate", "cocoa", "frozen desserts", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Scooped: Roasted Beet and Dark Chocolate Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/02/roasted-beet-and-dark-chocolate-ice-cream-recipe.html", "description": "Beets may sound like an unlikely candidate for an ice cream, but <strong>they share chocolate's earthy, fruity sweetness,</strong> enhanced all the more so by roasting them first. Mixing beets with chocolate and churning them into ice cream dampens their funky qualities; <strong>this ice cream tastes more of marshmallow than vegetable,</strong> with only the subtle aftertaste of chocolate.", "totalTime": "1 3/4 hours (plus an overnight chill)", "recipeYield": "10 to 12 (makes about 5 1/2 cups)", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["2/3 pound roasted, peeled beets, diced into 1/2 inch cubes (about 3 medium)", "3 cups half and half (or 1 1/2 cups each cream and whole milk)", "6 egg yolks", "3/4 cup sugar", "3 tablespoons (or to taste: see note) high-quality Dutch-process cocoa powder", "1/2 teaspoon Kosher salt", "1/2 teaspoon orange zest", "2 ounces dark chocolate, shaved on a vegetable peeler"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a three quart saucepan, combine beets and half and half. Simmer on low heat until a paring knife twisted into a beet easily cuts it apart, about half an hour. While pot is simmering, whisk together egg yolks and sugar in a large bowl until light in color and thickened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer beet mixture to a blender and pur&eacute;e until very smooth. If your blender lid comes with a stopper for a hole in the lid, remove the stopper and cover with a few sheets of paper towel while blending&mdash;this will keep the hot liquid from bursting out while blending.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return beet mixture to saucepan over low heat and thoroughly whisk in cocoa and a pinch of salt. Slowly pour 1/3 of beet mixture into egg mixture, whisking constantly, then transfer everything back to saucepan. Heat below a simmer, stirring frequently, until mixture thickens enough such that a finger swiped across the back of a coated spoon leaves a clean line. Pour through a strainer into an airtight container, add orange zest, stir to combine, and let chill over night.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, churn in an ice cream maker according to manufacturer's instructions. In the last minute of churning, slowly add shaved chocolate. Ice cream is best eaten as soft-serve. If storing for later, let thaw on a counter for 10 to 15 minutes before serving.</p>"}]}