{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110413-127355-dinner-tonight-tortilla-bocadilla.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Spanish", "keywords": ["bocadillas de tortilla", "Dinner Tonight", "potatoes", "sandwich", "spanish", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Dinner Tonight: Bocadillo de Tortilla", "link": "https://www.seriouseats.com/recipes/2011/04/bocadillo-de-tortilla-recipe.html", "description": "This is one of those dishes that initially didn't make much sense to me. When friends returned from a week in Spain, they mentioned buying <strong>bocadillas de tortilla</strong> all the time. Essentially, it's just a Spanish tortilla stuck between two slices of bread. I thought they were crazy. How could this starch-fest possibly work?", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Potato", "Sandwiches", "Spanish"], "recipeIngredient": ["¾ cup extra virgin olive oil ", "6 medium russet potatoes, peeled, quartered and thinly sliced ", "1 medium onion, halved, and thinly sliced ", "6 eggs ", "Salt and pepper ", "1 large Italian roll "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large skillet set over medium-high heat. Carefully add potatoes and onion. Cook, stirring and folding the mixture over every other minutes, until the potatoes and onions are soft but not brown. This should take about 20 minutes, and reduce heat if you notice any color. When done, transfer the mixture to a colander set over a bowl. Drain for minute. Clean out the skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a large bowl. Add a big pinch of salt and a few cracks of pepper. Whisk until combined. Add the potato and onion mixture to the eggs. Stir until combined. Season again with a little more salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer one tablespoon of the reserved oil to the large skillet set over medium heat. Pour in the egg and potato mixture, and even out the mixture with a spatula. Cook until the tortilla is browned on the bottom, about three minutes. Shake the pan occasionally to keep it from sticking. Set an inverted plate on top.  Hold onto the plate with your left hand, and flip the skillet over.  Take off the skillet and set it back on the burner over medium heat. The tortilla on the plate should have the cooked side on top. Add another teaspoon of the reserved oil to the skillet and slide in the tortilla so the uncooked side is on the bottom. Cook until browned on the bottom, another three minutes.      </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tortilla and place on a cutting board.  Let cool for 10 minutes or so. Meanwhile, slice the bread in half lengthwise. Then slice into four equal portions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tortilla into sections that will easily fit on the slices of bread. There will probably be some leftover tortilla. Place a piece of tortilla between two slices of bread. Serve.  </p>"}]}