{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111102-stuffed-turkey-stuffing.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["comfort", "fall", "giiblet", "roast", "stuffing .Thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Easy Stuffed Roast Turkey With Giblet Gravy", "link": "https://www.seriouseats.com/recipes/2011/11/herb-rubbed-roast-turkey-with-stuffing.html", "description": "An easy stuffed turkey with juicy breast meat and crisp skin. The trick is to use a baking stone.", "totalTime": "6 hours", "recipeYield": "10 to 12", "recipeCategory": ["Christmas", "Mains", "Roasting", "Thanksgiving", "The Food Lab", "Turkey"], "recipeIngredient": ["1 whole turkey, neck and giblets reserved, about 10 to 12 pounds ", "1 recipe classic <a href=\"http://www.seriouseats.com/recipes/2010/11/classic-sage-and-sausage-stuffing-or-dressing-recipe.html\">sage and sauges stuffing</a> or your favorite stuffing recipe, unbaked", "12 tablespoons (1 1/2 sticks) butter, divided ", "1 tablespoon finely minced fresh thyme leaves (or 2 teaspoons dried thyme) ", "1 tablespoon finely minced fresh sage leaves ", "1 tablespoon finely minced fresh rosemary leaves ", "2 medium garlic, minced or grated on microplane (about 2 teaspoons) ", "Kosher salt and freshly ground black pepper ", "1 tablespoon vegetable oil ", "1 large onion, roughly chopped ", "1 large carrot, peeled and roughly chopped ", "3 stalks celery, roughly chopped ", "1 1/2 quarts <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 bay leaves ", "1 teaspoon soy sauce ", "1/4 teaspoon marmite ", "1/4 cup flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to lowest position and place a baking stone or <a href=\"http://bakingsteel.com/\">Baking Steel</a> on it. Preheat oven to 500°F. Allow to preheat for at least 45 minutes before adding turkey. Meanwhile, rinse turkey and carefully pat dry with paper towels. Set a <a href=\"http://www.amazon.com/dp/B00005AL40/?tag=serieats-20\">V-rack</a> into a <a href=\"http://www.amazon.com/dp/B000G0KJG4/?tag=serieats-20\">rimmed baking sheet</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a double layered piece of cheesecloth into a rectangle about 4 feet long and 2 feet wide. Line the interior cavity of the turkey with cheesecloth, leaving the ends hanging out the sides. Fill the cheesecloth-lined cavity until it is tightly packed and slightly overflowing with stuffing.Gather up ends of the cheesecloth and tie tightly with butcher's twine to seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove pouch of stuffing. Place on a microwave-safe plate and microwave on high power until the center reaches at least 180°F, about 10 minutes, checking every two to three minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 8 tablespoons butter in small skillet or microwave until just melted (it should bubble). Transfer to a medium bowl. Whisk in parsley, thyme, sage, rosemary, garlic, and a generous amount of salt and pepper. Rub mixture evenly all over skin of bird (it should harden and clump a bit as it hits the cold bird).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using rubber gloves, clean kitchen towels or tongs, carefully return the hot bag of stuffing to the interior of the turkey. Cross the turkey's legs and tie tightly to seal. Stuff the cavity on the large side of the breasts underneath the flap of skin with more stuffing. Transfer any remaining stuffing to an appropriately sized baking dish (you should have a couple quarts left). Refrigerate extra dish of stuffing until ready to roast after turkey is cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place turkey on a V-rack set in a rimmed baking sheet and transfer to baking stone. Reduce oven temperature to 300°F. Roast until golden brown and deepest part of breast registers 150°F on an instant read thermometer, stuffing registers at least 140°F, and legs register at least 165°F, 3 to 4 hours total, basting occasionally with browned butter from bottom of roasting pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey is roasting, chop neck into 1-inch chunks with cleaver. Heat oil in medium saucepan over high heat until smoking. Add turkey neck, onions, carrots, and celery and cook, stirring occasionally, until well browned, about 10 minutes total. Add stock, bay leaves, soy sauce, and marmite. Bring to a boil then reduce to a simmer. Simmer for 1 hour then strain through fine mesh strainer. You should have a little over a quart of strained stock. If not, add water to equal 1 quart. Discard solids and set stock aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After turkey is cooked, transfer V-rack back to clean rimmed baking sheet. Pour hot melted butter from bottom of pan over turkey. Tent with foil and allow to rest for at least 30 minutes before carving. Increase oven heat to 350°F and set a rack in the middle. Roast extra tray of stuffing while turkey rests. Meanwhile, set roasting pan over burner and add reserved stock. Scrape up browned bits with wooden spoon. Pour stock through fine mesh strainer set in 1 quart glass measure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop turkey gizzard and liver (if desired). Melt remaining 4 tablespoons butter in medium saucepan. Add chopped giblest and cook, stirring frequently, until just cooked through, about 1 minute. Add flour and cook, stirring constantly until golden brown, about 3 minutes. Whisking constantly, add broth in thin steady stream. Bring to a boil, reduce to a simmer, and cook until thickened and reduced to about 3 cups. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove stuffing bag from turkey and untie. Carve turkey and serve with all of the stuffing and gravy.</p>"}]}