{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111014-127677-Dulces-Rice-Pudding-Flan-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Latin American", "keywords": ["custards", "Dulces", "flan", "Latin American", "rice desserts", "sweetened condensed milk"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flan de Arroz con Leche (Rice Pudding Flan)", "link": "https://www.seriouseats.com/recipes/2011/10/dulces-flan-de-arroz-con-leche-rice-pudding-flan-recipe.html", "description": "This hybrid dessert combines two of our favorite sweet and creamy treats: rice pudding and flan.", "totalTime": "4 to 5 hours", "recipeYield": "8 to 10", "recipeCategory": ["Latin American", "Puddings and Custards"], "recipeIngredient": ["2 cups sugar", "1 3/4 cups water", "1/2 cup long-grain white rice", "3/4 teaspoon salt", "3 1/2 cups milk", "1 (14-ounce) can sweetened condensed milk", "2 cinnamon sticks", "Finely grated zest of 1 orange", "1/4 cup golden raisins", "4 large eggs, separated and at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 325&deg;F. Place clean kitchen towel in roasting pan. Wrap exterior of 9-inch springform pan with foil and set on top of towel. Set tea kettle or pot of water to boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1 cup sugar and ¼ cup water in medium heavy-bottomed saucepan. Cook over medium-high heat, swirling pan occasionally, until sugar is completely dissolved. Dampen a clean pastry brush and brush down any sugar crystals from sides of pan. Boil, swirling pan occasionally, until sugar turns deep amber, 6 to 10 minutes. Immediately pour caramel into springform pan and swirl to evenly coat bottom; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place rice, remaining 1 1/2 cups water, and salt in medium microwave-safe bowl. Cover tightly with plastic wrap and microwave until most of the water is absorbed, 6 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring remaining 1 cup sugar, milk, sweetened condensed milk, cinnamon sticks, and orange zest to boil over medium-high heat in large heavy-bottomed saucepan. Add rice, reduce heat to medium-low and simmer, stirring frequently, until mixture is thickened and rice is completely tender 15 to 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and stir in raisins. Cool to room temperature (See notes).<br />\r\nWhen cooled, stir in egg yolks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In clean, dry bowl beat egg whites with whisk attachment on medium-low speed until whites begin to froth, about 1 minute. Increase speed to medium-high and beat whites until stiff peaks form, 3 to 4 minutes. Fold egg whites into rice pudding mixture with rubber spatula. Scrape rice mixture over caramel in springform.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open oven door and set roasting pan and flan on oven rack. Carefully pour hot water into roasting pan&mdash;water should reach halfway up sides of flan pan. Bake until flan is set, but still a bit wobbly, about 1 hour, 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove springform pan from roasting pan and cool on rack, about 15 minutes. Chill completely in refrigerator, 2 to 3 hours. Run a knife along flan edges and invert onto serving plate. Remove and discard foil and open springform mold. Remove bottom. Serve.</p>"}]}