{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151110-linzer-cookies-vicky-wasik-006.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["hazelnuts", "holiday cookies", "Jam", "linzer cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hazelnut-Raspberry Linzer Cookies", "link": "https://www.seriouseats.com/recipes/2011/12/linzer-cookies-hazelnut-jam-recipe.html", "description": "In this classic Austrian treat, hazelnut cookies are sandwiched around raspberry jam and dusted with confectioner's sugar.", "totalTime": "1 hour 45 minutes", "recipeYield": "Makes about 3 dozen sandwich cookies, depending on size of cutters", "recipeCategory": ["Cookies", "Desserts", "Nuts"], "recipeIngredient": ["8 ounces unsalted butter, at room temperature (2 sticks; 225g) ", "1 cup confectioner's sugar, plus 1/2 cup more for coating (4 1/2 ounces plus 2 1/4 ounces for coating; 125g plus 65g for coating)", "1/2 cup granulated sugar (3.5 ounces; 100g)", "2 teaspoons (10mL) vanilla extract ", "1 teaspoon (3g) baking powder ", "1 teaspoon (3g) ground cinnamon ", "1/2 teaspoon (1.5g) salt ", "1 cup hazelnut flour (5 ounces; 140g) (see note) ", "2 1/4 cups all-purpose flour (11.25 ounces; 320g), plus more for rolling out dough ", "1 large egg (50g)", "1 1/4 cups raspberry jam (10 ounces; 280g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle, beat butter, 1 cup confectioner's sugar, and granulated sugar at medium speed until creamy, about 2 minutes. Add vanilla extract, baking powder, cinnamon, and salt and beat until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce mixer speed to low and add hazelnut flour, all-purpose flour, and egg to bowl and beat until dough comes together. Cover dough in plastic wrap and refrigerate for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F and adjust racks to upper-middle and lower-middle positions. Line 2 baking sheets with parchment paper or silicone baking mats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a clean work surface. Divide the dough into two equal portions. Roll out one of the dough portions to 1/8 inch thickness; wrap the remaining portion in plastic and keep refrigerated. Use Linzer cookie cutters to cut out the solid shapes (these will be the bottoms of each cookie) and carefully transfer them to one of the prepared baking sheets. Gather the scraps, roll out the dough, and repeat to make more solid cookies, and transfer to second prepared baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cookies until golden, about 10 minutes, rotating sheets front to back and top to bottom halfway through. Transfer baking sheets to wire racks and allow to cool for 3 minutes. Using a metal spatula, transfer cookies directly to wire racks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When baking sheets have cooled, repeat Step 4 with the remaining portion of dough, this time using the cookie cutter with a punched-out center to cut the top cookies. Bake and cool top cookies according to Step 5.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cookies have fully cooled, sift remaining 1/2 cup confectioner's sugar all over top cookies (the ones with the punched-out centers).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the solid bottom cookies with jam. Place the top cookies on each to complete the sandwich cookies. Serve.</p>"}]}