{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110607-dt-pork-tenderloin-with-cherry-chile-salsa.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["cherries", "Dinner Tonight", "grill", "grilling", "pork", "pork tenderloin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Tenderloin With Fresh Cherry and Chile Salsa", "link": "https://www.seriouseats.com/recipes/2011/06/dinner-tonight-pork-tenderloin-with-fresh-che.html", "description": "Pork tenderloin is a versatile cut that pairs well with pretty much anything, and it doesn't get much better or easier than this <a href=\"http://www.bonappetit.com/recipes/quick-recipes/2011/06/grilled-pork-tenderloin-with-cherry-salsa\">salsa recipe</a> from the recent issue of <em>Bon Appetit</em>.  Plump red cherries marinated in olive oil, lime juice, cilantro, and fresh red chiles make for a sweet, spicy, just-barely-acidic salsa which I was literally licking off the plate. If you come across some fresh cherries this summer, you know what to do.", "totalTime": "30", "recipeYield": "4", "recipeCategory": ["Cherry", "Dinner Tonight", "Grilling", "Mains", "Pork"], "recipeIngredient": ["1 cup coarsely chopped fresh cilantro", "1/2 cup minced shallots", "6 tablespoons fresh lime juice", "1/4 cup vegetable oil", "2 small pork tenderloins, aiming for about 2 pounds", "1/2 pound fresh cherries, stemmed, pitted, halved", "1 fresh Fresno chile, red jalapeño, or Holland chile, thinly sliced crosswise", "1 tablespoon extra-virgin olive oil", "Kosher salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a grill to medium-high heat. Combine half of the cilantro and shallots, 4 tablespoons of the lime juice, and the vegetable oil in a resealable plastic bag with the pork. Marinate at room temperature for 15 minutes, turning occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, in a medium bowl combine remaining cilantro, shallots, and lime juice with the remaining ingredients. Season to taste with salt and pepper and allow to sit while pork marinates to develop the flavors.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork from marinade, season well with salt and pepper, and grill, turning often, until the outside has developed a nice crust an interior is 145 degrees (or to desired doneness).  Let rest 10 minutes, slice, and serve with salsa.</p>"}]}