{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111227-185082GFTues-PastawithClams.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["anchovies", "clam", "clams", "gluten free", "Gluten-Free Tuesday", "pasta", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pasta with Clams and Anchovies", "link": "https://www.seriouseats.com/recipes/2011/12/pasta-with-clams-and-anchovies.html", "description": "While my grandmother was busy frying fish on Christmas Eve, she'd put together this easy pasta dish. It uses canned clams, which I've come to expect from this dish. If you don't care for canned clams, omit them or steam...", "totalTime": "about 30 minutes", "recipeYield": "4 to 6", "recipeCategory": ["Clams, Mussels, and Oysters", "Gluten-Free", "Pasta"], "recipeIngredient": ["Salt", "1 pound gluten-free spaghetti ", "1/2 cup olive oil", "4 cloves garlic, minced or put through a garlic press", "1 small onion, finely diced", "1 teaspoon dried parsley", "1 teaspoon dried oregano", "2 cans (6.25 ounces each) chopped clams, or 1 can (10 ounces) whole baby clams", "2 jars (2.5 ounces each) anchovy fillets, minced with oil reserved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot three-quarters full with water. Cover and bring to a boil over high heat. Set a colander in the sink for draining the pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water reaches a boil, add 1 tablespoon salt and the pasta. Stir with a wooden spoon for about 30 seconds, then stir occasionally while the pasta cooks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pasta is cooking, begin the sauce. In a small pot, combine the oil and garlic. Turn on the heat to medium-low (Yes, start the garlic in cold oil. You want to cook it very gently.) When the garlic begins to sizzle, add the onion, parsley, and oregano. Cook, stirring occasionally with a wooden spoon, until the onions are translucent. Lower the heat to low. (This is a good time to check the pasta if you haven't already.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the clams and their juices and the minced anchovies and their oil to the olive oil mixture and heat through. Don't let the sauce boil, or the clams will get tough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After about 10 minutes of boiling, check the pasta for doneness. When the pasta is tender, ladle out about 1 cup of the pasta cooking water into a small heatproof bowl and set aside. Drain the pasta in the colander and return it to its pot over very low heat. Add the sauce to the pasta and toss with a wooden spoon. If the pasta seems dry, add a little of the pasta cooking water; stir in 1/4 cup to start, adding more if needed. Serve immediately.</p>"}]}