{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110531-127355-dinner-tonight-salmon-lentil-salad.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "lentils", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Salmon with Smoked Bacon and Lentil Salad", "link": "https://www.seriouseats.com/recipes/2011/06/dinner-tonight-salmon-with-smoked-bacon-and-lentil-salad-recipe.html", "description": "One of the many reasons I love trying out Michael Symon's recipes is his constant use of warm vinaigrettes. Instead of simply tossing the lentils with a regular dressing, this recipe from the <a href=\"http://www.cookingchanneltv.com/recipes/michael-symon/salmon-with-smoked-bacon-and-lentil-salad-recipe/index.html\">Food Network</a> calls for mustard and lemon juice to be whisked into warm bacon fat, making for a sauce that is hearty and yet still acidic and balanced. It makes the lentils part side dish, part sauce for the salmon.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Mains", "Salmon"], "recipeIngredient": ["1 pound green lentils ", "5 ounces bacon, chopped ", "2 1/2 tablespoons scallions, green parts only, chopped", "2 teaspoons chopped garlic", "3 tablespoons whole grain mustard", "5 tablespoons lemon juice", "6 tablespoons olive oil, divided ", "2 1/2 tablespoons fresh parsley, chopped", "Salt and pepper ", "Four 6-ounce pieces of salmon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 400&deg;F. Fill a large pot halfway up with water and turn heat to high. When boiling, add the lentils. Cook until tender, about 25 minutes. Drain in a colander and then set aside in a large bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add chopped bacon to a large skillet set over medium heat. Cook, stirring occasionally, until bacon is crisp. Then remove pieces with a slotted spoon, leaving the fat behind. Add scallions and garlic, and cook until aromatic, about one minute. Turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the skillet cool for a few seconds, and then whisk in the mustard, lemon juice, and 4 tablespoons of the olive oil. When smooth, season with salt and pepper. Pour the dressing on to the lentils and add the cooked chopped bacon. Stir well, add the parsley, and season with more salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour remaining two tablespoons olive oil into a large skillet and turn heat to medium-high. When oil is shimmering, season the salmon fillets with salt and pepper, and then transfer to the skillet and cook until golden brown, one to two minutes. Flip, and brown the other side, another one to two minutes. Then carefully transfer salmon to oven and cook until salmon is completely cooked, five to eight minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the lentil mixture between four plates. Top each with a salmon fillet. </p>"}]}