{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110504-cinc-de-mayo-recipes-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["beans", "chicken", "cinco de mayo", "Mexican", "sopes", "tomatillos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sopes de Pollo con Frijoles (Chicken Sopes With Beans)", "link": "https://www.seriouseats.com/recipes/2011/05/sopes-de-pollo-con-frijoles-chicken-sopes-with-beans-recipe.html", "description": "Sope shells start with a dough made from masa harina (that's dehydrated nixtamalized corn flour) that gets flattened into a thick disk. The edges of the disk then get pinched to form a shallow saucer. The raw sope shell is fried just long enough to get it to hold its shape, but not so long that it gets crisp. The idea is that you want it to form an impenetrable barrier for the treats that go on top of it, but you still want it to be soft and warm in the center.", "totalTime": "1 1/2 hours", "recipeYield": "Makes about 16 sopes, serving 6 to 12", "recipeCategory": ["Chicken", "Mexican"], "recipeIngredient": ["1 1/2 pounds bone-on, skin-on chicken breast", "1 quart chicken stock", "2 cups masa harina", "1 1/4 cups water", "1/2 pound tomatillos", "1 poblano pepper, stem and seeds removed, split in half lengthwise", "1 jalapeño or serrano pepper, stem and seeds removed, split in half lengthwise", "2 cloves garlic", "1 small onion, peeled and roughly chopped", "1 cup packed fresh cilantro leaves and tender stems", "Kosher salt", "2 quarts peanut, canola, or vegetable oil", "1 (14.5 ounce) can refried beans, or 2 cups homemade refried beans, warmed", "1 cup Mexican Crema, or 3/4 tablespoons sour cream mixed with 1/4 cup milk", "1/2 cup crumbled cotija cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken in a medium saucepan and add chicken stock. Bring to a boil over high heat, reduce to a bare simmer, and cook, turning chicken occasionally, until center of chicken registers 150°F on an instant read thermometer, about 20 minutes. Remove chicken from broth and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken cooks, preheat broiler to high. Combine masa harina and water in a medium bowl and knead to combine. Add additional water 1 tablespoon at a time until mixture comes together in a cohesive, non-crumbly dough. Cover with plastic and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tomatillos, poblano, jalapeño, and garlic, and onion  on a foil-lined rimmed baking sheet and place under broil. Broil, turning occasionally, until lightly charred on all sides and vegetables are completely tender, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once vegetables are broiled and chicken is cooked, transfer broiled vegetables to a blender along with the cilantro and 1 cup of reserved chicken stock (discard or use the rest for another purpose). Blend on high speed until smooth. Season to taste with salt. Set salsa aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cool enough to handle, shred into 1-inch pieces and transfer to a medium skillet or saucepan. Add 1 cup salsa verde and stir to combine. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide masa into approximately 16 balls. Press each ball in a tortilla-press lined with plastic into a disk approximately 1/4-inch thick and 4-inches wide. Use your fingertips to form a slight lip around the edge. Transfer raw sope shells to a baking sheet lined with parchment paper as you work.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large wok or Dutch oven to 350°F. Fry sope shells 4 at a time until just set but not crispy, about 2 minutes. Transfer fried shells to a paper-towel lined baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, spread refried beans around the bottom of each shell then top with the chicken/salsa verde mixture. Drizzle with crema, additional salsa verde, and a sprinkling of cotija and extra cilantro leaves if desired. Serve immediately.</p>"}]}