{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110308Beeramisu.jpg_2.jpg", "author": {"@type": "Person", "name": "Caroline Ford"}, "recipeCuisine": "", "keywords": ["beer", "Guinness Week", "tiramisu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Guinness Week: Beeramisu", "link": "https://www.seriouseats.com/recipes/2011/03/beeramisu-guinness-tiramisu-st-patricks-day.html", "description": "This take on Tiramisu strays pretty far from the traditional. It calls for Guinness and Irish Cream instead of coffee and Marsala, but the requisite creamy, soft layers will surely please anyone crazy for this Italian dessert.", "totalTime": "12 hours", "recipeYield": "12", "recipeCategory": ["Puddings and Custards"], "recipeIngredient": ["1 pound mascarpone, softened", "3/4 cup granulated sugar", "3/4 cup heavy whipping cream", "1/2 cup plus 2 tablespoons plus 1/2 cup Irish Cream such as Bailey's or Carolan's, divided", "8 ounces Guinness", "36 savoiardi (Italian ladyfingers)", "Small bar good-quality chocolate, for shaving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the mascarpone and sugar in a medium bowl, stir vigorously to dissolve sugar. Place whipping cream and 2 tablespoons Irish Cream in a stand mixer fitted with a whisk attachment. Whip on high until stiff peaks form, 2-3 minutes. Gently fold whipped cream into mascarpone. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour Guinness into a shallow bowl. One at a time, dip ladyfingers into Guinness on each side. Don't soak them: counting to one on each side will provide all the stout flavor and moisture you'll need. Place in a tight single layer in dish, breaking them into pieces as necessary. Drizzle 1/4 cup Irish Cream over entire layer. Pour about 1-2 cups of the mascarpone mixture over ladyfingers until covered, spreading smooth with a spatula. Grate a layer of chocolate shavings over the top with a microplane or a vegetable peeler. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat process with another layer. Refrigerate for at least 12 hours or overnight before serving. </p>"}]}