{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111018-127355-dinner-tonight-sausage-salad-mustard-watercress.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["apple", "Dinner Tonight", "mustard", "salad", "sausage", "thanksgiving", "watercress"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Grilled Sausage Salad with Quick Apple Compote and Watercress", "link": "https://www.seriouseats.com/recipes/2011/10/grilled-sausage-salad-with-quick-apple-compote.html", "description": "The sausages are broiled quickly then covered with mustard, which helps cut through much of the fat. The apple compote obviously adds some sweetness but some cinnamon and ginger also give it depth. The crunchy, bitter watercress fights valiantly against all of it, making for a stunning and quick dinner.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Apple", "Dinner Tonight", "Salads"], "recipeIngredient": ["4 cooking apples, cored and cut into eighths (do not peel)", "1/2 cup water", "1 teaspoon ground cinnamon ", "1 teaspoon ground ginger", "3 tablespoons lavender honey (or regular honey)", "1 pound sausage links (preferably blood sausage, kielbasa also works) cut in half lengthwise", "2 tablespoons coarse-grain mustard", "Several handfuls fresh watercress, stemmed ", "1 to 2 tablespoons sesame oil", "Salt and black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the apples, water, cinnamon, ginger, and honey to a medium-sized saucepan. Cover and cook over low heat until the apples fall apart, about 15 minutes. Turn off the heat and cover to keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the broiler to high. Set the sausages on a baking sheet cut-side up. Transfer the baking sheet to underneath the broiler, and cook until the sausages look browned but not burnt, one to two minutes. Carefully remove the baking sheet. Flip the sausages, and then smear the mustard on top of them. Place the baking sheet underneath the broiler again, and cook until the sausages start to brown, another one to two minutes. Turn off the heat, and set the baking sheet aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the watercress to a large bowl. Pour in about one tablespoon of the sesame oil and toss. Add more sesame oil if the leaves aren't evenly coated. Season the watercress with salt and pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the watercress between four plates, and top each with some of the sausage, mustard-side up. Spoon some of the apple compote along the side of each. Serve with more mustard, if desired. </p>"}]}