{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110705-159858-stuffed-flank-steak%20.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["arugula", "Cook the Book", "flank steak", "grill", "grilling", "Latin Grilling", "Lourdes Castro", "onion", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Arugula, Garlic and Green Onion Stuffed Flank Steak", "link": "https://www.seriouseats.com/recipes/2011/07/arugula-garlic-green-onion-stuffed-flank-steak.html", "description": "While serving up this <strong>Arugula, Garlic &amp; Green Onion Stuffed Flank Steak</strong> last weekend, a friend of mine dubbed it an Argentine <em>braciole</em>.  It was an astute observation considering the sizable Italian contingent in Argentina and after some research, the Argentine-Italian connection was even more apparent.  Just like an Italian-American braciole, stuffed flank steak or <em>matambre</em> (that's hunger killer <em>en español</em>) can be filled with everything from rice to eggs, beans or veggies.", "totalTime": "30 minutes", "recipeYield": "8", "recipeCategory": ["Beef", "Cook the Book", "Grilling", "Leafy Greens", "Onion"], "recipeIngredient": ["8 cloves garlic", "Salt", "3 pounds flank steak, trimmed of excess fat ", "Black pepper", "3 cups arugula leaves, washed and dried", "1 bunch green onions, tops and roots trimmed, halved lengthwise then halved crosswise", "3 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare a garlic paste:</strong> Prepare a garlic paste by mashing the garlic cloves with a teaspoon of salt in a mortar and pestle. If you do not have one, you can create one by smashing the garlic and salt inside a cup with the back of a wooden spoon. Otherwise, simply sprinkle the garlic with the salt and use your knife to chop it very finely by hand. In either case, you should end up with a wet garlic paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the beef, add the toppings, and roll Season the beef on both sides with salt and pepper and place lengthwise in front of you (the short sides of the rectangle should be parallel to you).<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slather the garlic paste all over one side of the beef and top with the arugula and the green onions placed evenly across the surface of the meat. Drizzle the olive oil over the vegetables and season with more pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting with the short side closest to you, begin rolling the beef tightly, being careful to keep the arugula and green onions inside the roll. You should end up with a tightly wound cylinder of flank steak. Place the beef roll seam side down on your work surface and cut three 18-inch pieces of cotton kitchen twine. Place them a few inches apart under the meat and wrap each tightly around the rolled beef and tie into a knot.  <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> <strong>Grill and serve:</strong> Heat your grill to the highest setting and close the lid. Wait at least 15 minutes before continuing. Oil the grill grates with a vegetable oil–soaked paper towel held with a long pair of tongs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the rolled meat on the grill seam side down and lower the lid. Cook for 8 minutes per side, rotating the roll twice (for a total cooking time of 24 minutes), until the internal temperature registers 125° to 130°F for medium-rare, or until it reaches the desired doneness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the meat to rest for 5 minutes on a work surface. Then cut off the twine and carve the roll into 1-inch-thick slices and arrange on a serving platter. If the steak was not long enough or if you did not tie the roll tight enough, it may fall apart when you slice it. The steak and vegetables will still be delicious and can be attractively presented alongside each other on a platter.  </p>"}]}