{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110711lemonraspberrypriu.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["buttercream", "cakes", "fruit desserts", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon Cake with Fresh Raspberry Buttercream", "link": "https://www.seriouseats.com/recipes/2011/07/lemon-cake-with-fresh-raspberry-buttercream-recipe.html", "description": "This recipe is all about the frosting: princess-pink, red-red raspberry flecked, melt-in-your mouth clouds of buttercream generously spread on lemon cake (the cake is adapted from Cook's Illustrated, flavored with bright lemon juice and zest).", "totalTime": "2 hours", "recipeYield": "8 to 10", "recipeCategory": ["Cakes", "Raspberry"], "recipeIngredient": ["<strong>For the Cake:</strong> ", "Baking spray", "1 3/4 cups sugar", "1 tablespoon finely grated zest and 1/4 cup juice from 2 lemons", "2 1/2 cups cake flour", "1 1/4 teaspoons baking powder", "1/4 teaspoon baking soda", "3/4 teaspoon salt", "10 tablespoons unsalted butter, melted and slightly cooled", "3/4 cup milk, at room temperature", "3 tablespoons vegetable oil", "6 large egg yolks", "2 teaspoons pure vanilla extract", "3 large egg whites", "   ", "<strong>For the Fresh Raspberry Buttercream:</strong>", "18 ounces fresh raspberries", "1 cup plus 6 tablespoons sugar", "1 teaspoon cornstarch", "1/2 cup water", "4 large egg whites, at room temperature (See Notes)", "1/4 teaspoon salt", "3 sticks unsalted butter, cut into 24 pieces, at room temperature", "1/2 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat two 9-inch round cake pans with baking spray. Line bottoms with parchment paper and coat once again with baking spray. Adjust oven rack to middle position and preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In food processor, pulse lemon zest and 1 1/2 cups sugar until no zest strands remain. (See Notes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, baking powder, baking soda, salt, and lemon sugar together in large bowl. In separate medium bowl, whisk together melted butter, milk, lemon juice, oil, egg yolks, and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of standing mixer or large bowl, whip egg whites with whisk attachment on medium speed until soft peaks form, about 2 minutes. Gradually add remaining 1/4 cup sugar and continue whipping until stiff peaks form, 1 to 2 minutes longer. If you used the stand mixer bowl, transfer whites to separate bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place flour mixture in now empty stand mixer bowl. With whisk attachment and mixer at low speed, gradually pour in liquid mixture and mix until ingredients are almost fully combined, 15 to 30 seconds. Scrape sides and bottom of bowl with rubber spatula. Increase speed to medium and mix until smooth, about 20 seconds. Fold in egg whites and divide batter equally between prepared pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until tester inserted in center of cakes comes out clean, 20 to 25 minutes. Transfer cakes to cooling racks and cool 10 minutes in pans. Turn cakes out directly onto racks, then turn so the tops are facing up. Cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare buttercream when cake is cooled. Place 6 ounces raspberries and 2 tablespoons sugar in food processor and pulse until smooth. Strain into small saucepan and whisk in cornstarch. Bring to boil over medium-high heat, then simmer over medium-low until thickened and reduced to about 3 tablespoons, 4 to 5 minutes. Transfer to bowl and cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir remaining 1 1/4 cups sugar and water in heavy-bottomed medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 238-240°F on candy thermometer, 5 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While syrup boils, whip egg whites with whisk attachment on medium speed until soft peaks form, 2 to 3 minutes. When syrup reaches temperature, with mixer running on medium-high speed, slowly and carefully add it to egg whites. Beat until outside of bowl is cool to the touch and whites are thick and glossy, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With mixer on medium speed, add butter, one piece at a time. Beat until light and fluffy, 1 to 2 minutes. Add raspberry syrup and vanilla and mix until combined, about 30 seconds. Pick out 20 raspberries for garnish and fold in the remaining ones with a rubber spatula&mdash;it’s fine for them to be crushed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, place one cake round on serving dish or cake stand and spread with about 2 cups buttercream. Top with second cake round and frost sides and top of cake with remaining buttercream. Garnish with reserved raspberries.</p>"}]}