{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110513-fojol-bros.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Indian", "keywords": ["chicken", "Cook the Book", "food trucks", "Heather Shouse", "Indian", "poultry", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Fojol Bros. Butter Chicken", "link": "https://www.seriouseats.com/recipes/2011/05/fojol-bros-butter-chicken-recipe.html", "description": "The Fojol Bros' everyday roster includes two vegetarian and two meat-based dishes, such as this <strong>Butter Chicken</strong> adapted for <a href=\"http://www.heatherjshouse.com/HeatherJShouse/About_Me.html\">Heather Shouse</a>'s <strong><em><a href=\"http://www.amazon.com/Food-Trucks-Dispatches-Kitchens-ebook/dp/B004FYZK8E/serieats-20\"></a>Food Trucks</a></em></strong>. As wild as the Fojol Bros' concept is, their take on butter chicken is pretty traditional, with chunks of chicken rubbed with a chile-lemon butter, marinated in a spiced yogurt mix, and grilled, kabob-style. The skewers are finished by simmering in a creamy tomato based gravy laced with all sorts of warming spices, including cardamom, ginger, and cloves.", "totalTime": "4 hours", "recipeYield": "makes 4 servings", "recipeCategory": ["Chicken", "Condiments and Sauces", "Cook the Book", "Indian"], "recipeIngredient": ["1 pound boneless chicken breast", "1 pound chicken thighs", "1 tablespoon lemon juice", "1 teaspoon red chile powder (Kashmiri preferred)", "1 teaspoon salt", "2 tablespoons unsalted butter, melted, plus extra for basting", "&nbsp;", "<strong>For the Marinade:</strong>", "1 cup yogurt ", "1 teaspoon salt", "1/2 teaspoon minced garlic, smashed into a paste with the back of a spoon", "1/2 teaspoon garam masala", "1 teaspoon red chile powder (Kashmiri preferred)", "2 tablespoons minced ginger, smashed into a paste with the back of a spoon", "2 tablespoons lemon juice", "2 tablespoons mustard oil", "&nbsp;", "<strong>For the Makhni “Gravy\":</strong>", "3 1/2 tablespoons unsalted butter", "1 teaspoon whole green cardamom pods", "1/2 teaspoon whole cloves", "1 teaspoon whole black peppercorns", "1 (2- to 3-inch) cinnamon stick", "1 tablespoon minced ginger, smashed into a paste with the back of a spoon", "1 tablespoon minced garlic, smashed into a paste with the back of a spoon", "4 or 5 green chiles, chopped", "14 ounces tomato purée", "1 tablespoon red chile powder (Kashmiri preferred)", "1 teaspoon garam masala", "2 teaspoons salt", "1 cup water ", "1/2 teaspoon ground fenugreek", "2 tablespoons honey", "1 cup cream", "Rice and naan or paratha, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the chicken breast and thigh meat into equal-size hunks suitable to skewering and grilling. In a small bowl, combine the lemon juice, red chile powder, salt, and 2 tablespoons butter to make a paste. Rub the paste into the chicken pieces. Place the chicken pieces in a bowl, cover, and refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the marinade. Line a colander with muslin cheesecloth and drain the yogurt for 15 to 20 minutes to remove the excess water. Transfer the drained yogurt to a bowl and add the remaining marinade ingredients. Apply this marinade to the chicken pieces and refrigerate for 3 to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a moderately hot fire in a grill (Fojol uses a tandoor) or preheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thread the chicken pieces onto skewers and grill them just until the juices run clear, about 4 to 5 minutes, being careful not to overcook. Baste the chicken with butter during the last couple of minutes of cooking. Remove from the heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the gravy, melt the butter over medium heat in a medium to large sauté pan. Add the cardamom pods, cloves, peppercorns, and cinnamon. Sauté for 2 minutes, then add the ginger paste, garlic paste, and chopped green chiles and stir to combine. Cook for 2 minutes. Add the tomato purée, red chile powder, garam masala, salt, and water. Bring the mixture to a boil, then reduce the heat and simmer for 10 minutes. Add the fenugreek and honey, then add the cooked chicken to the gravy. Simmer for 5 minutes, then add the cream. Stir and let simmer for just a couple of minutes, then serve hot with the rice and naan or paratha.</p>"}]}