{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110926-172410-farmers-secret-chocolate-bundt-cake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "beets", "cake", "cakes", "chocolate", "Farmers' Market Desserts", "zucchinis"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Farmer's Secret Chocolate Bundt Cake", "link": "https://www.seriouseats.com/recipes/2011/09/farmers-secret-chocolate-bundt-cake-zucchini-beet-cake-recipe.html", "description": "What's the big secret in this <strong>Farmer's Secret Chocolate Bundt Cake</strong>? An extra serving of veggies by way of grated beet and zucchini. But have no fear, this moist  bundt tastes way more like chocolate than like a vegetable patch.", "totalTime": "1 hour 15 minutes", "recipeYield": "12", "recipeCategory": ["Bake the Book", "Cakes", "Chocolate", "Desserts"], "recipeIngredient": ["<strong>Cake</strong>", "2 cups unbleached all-purpose flour ", "2/3 cup unsweetened natural cocoa powder (not Dutch processed)", "2 teaspoons baking powder", "1 teaspoon baking soda ", "1 teaspoon kosher salt", "1/2 teaspoon ground cinnamon ", "1/2 cup (1 stick) unsalted butter, softened ", "1 cup granulated sugar", "1/2 cup gently packed light brown sugar ", "3 large eggs, at room temperature ", "1/2 cup sour cream or Greek-style plain whole-milk or low-fat yogurt ", "1 teaspoon pure vanilla extract ", "1 cup gently packed, peeled and grated zucchini", "1 cup gently packed, peeled and finely grated red beets", "1 cup (6 ounces) semisweet chocolate chips ", "&nbsp;", "<strong>Chocolate Glaze</strong>", "1/3 cup heavy cream", "3 ounces bittersweet chocolate (60 to 70 percent cacao), chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F, with a rack in the lower third. Generously butter a 10-cup Bundt pan. Dust the pan with flour, tapping out the excess. (Alternatively, use a 9-by-2-inch square baking pan.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cake, sift together the flour, cocoa powder, baking powder, soda, salt, and cinnamon into a bowl. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing mixer fitted with the paddle attachment (or with a handheld mixer), beat together the butter, granulated sugar, and brown sugar on medium speed until light and creamy, about 5 minutes. Mix in the eggs, one at a time, beating well and scraping down the bowl after each addition. Mix in the sour cream and vanilla. On low speed, add the flour mixture and beat until nearly combined but still streaky. (The batter will be thick.) Use a wooden spoon or a spatula to stir in the zucchini, beets, and chocolate chips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the batter to the prepared pan and spread evenly. Bake until a long toothpick or thin wooden skewer inserted midway between the inner and outer edges of the pan tests clean, about 50 minutes. Let cool in the pan on a wire rack for 30 minutes. Using oven mitts if needed, invert a flat serving plate over the pan and invert the pan plate together to release the cake. Lift off the pan and let cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the glaze, heat the cream in a small saucepan over medium heat until steam begins to rise and bubbles form along the edge of the pan. Remove from the heat, add the chocolate, and let stand for 1 minute, then stir until smooth. Let stand until thick but still pourable, 10 to 12 minutes. (Rewarm if it gets too thick.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the glaze in a circular motion over the top of the completely cooled cake, allowing some to drip down the center and sides. Allow the glaze to set for about 1 hour before serving.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store leftover cake, tightly covered, at room temperature for up to 1 day. Or, refrigerate for up to 5 days, then let stand at room temperature for 15 to 30 minutes before serving.</p>"}]}