{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110620-158015-sweettech-blueberry-cobbler-recipe1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["berries", "blueberries", "cobblers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry Cream Cobbler", "link": "https://www.seriouseats.com/recipes/2011/07/blueberry-cream-cobbler-recipe.html", "description": "This blueberry cobbler is just the ticket for channeling a Downeast summer meal. The crust on top is made of flaky, tender cream biscuits that deliver a hint of salty sweetness and just a bit of crunch. The berries bubble up around the biscuits, spilling over the sides with tart, purple juices.  You can either bake one large cobbler to spoon out onto plates, or make individual mini-cobblers in heatproof ramekins.  Pull from the oven, spoon with freshly whipped cream, and serve warm, just as the sun begins to set.", "totalTime": "1 hour", "recipeYield": "6", "recipeCategory": ["Blueberry", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["3 cups all-purpose flour", "1 tablespoon plus 2 teaspoons baking powder", "2 tablespoons granulated sugar, plus more for sprinkling", "2 teaspoons salt", "2 cups heavy cream, divided", "1 to 1/2 cups half and half", "3 tablespoons melted butter, cooled slightly", "2 pints washed blueberries", "1/2 cup granulated sugar", "2 tablespoons cornstarch, or tapioca starch", "zest of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425 degrees Fahrenheit. Whisk to combine flour, 2 tablespoons sugar, salt, and baking powder in a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one cup heavy cream and one cup half and half. Gently fold the liquid into the dry ingredients, taking care not to work the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add additional half and half in small drizzles as needed, until the dough is slightly sticky. Some dry spots are OK; it is important not to over-work the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured work surface. Dust the top with flour, and gently press the dough into a flat circle with your fingers, about 1 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a floured cutter to cut the dough into shapes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the shapes as close together as you can to get the most out of the dough piece.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push what is left after you've cut your first round of shapes back together. Do not fold or mix. Finish cutting the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the lemon zest and 1/2 cup of granulated sugar together between your fingers, then whisk the cornstarch into the sugar mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the blueberries in the sugar mixture, then put them in your baking dish  or evenly distribute them between six ramekins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the blueberries with the cream biscuits. The biscuits may be placed so they are almost touching one another.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the tops of the biscuits with melted butter, then sprinkle with granulated sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the baking dish or ramekins on a baking sheet (very important! the blueberries will bubble over and create a mess) and bake until the tops of the biscuits are golden brown and the blueberries are bubbling all over, rotating halfway through. For ramekins the total time is approximately 20 minutes, and for baking dishes the total time is approximately 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip one cup cold heavy cream to soft peaks. If using baking dish, portion cobbler onto plates. Top each cobbler with whipped cream and serve warm.</p>"}]}