{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111122-179062-GFTues_CoconutPumpkinPie.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "Gluten-Free Tuesday", "pie crusts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free/Allergen-Free Pie Crust", "link": "https://www.seriouseats.com/recipes/2011/11/gluten-freeallergen-free-pie-crust.html", "description": "Made without any common allergens, this pie crust is extremely delicate. When placing the dough into the pan, it might break (mine usually does). If the dough breaks apart, simple press it back together with your fingers. Be sure to...", "totalTime": "about five hours", "recipeYield": "makes one 9-inch pie crust", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["2 ounces (1/2 cup) white rice flour", "1/2 cup sorghum flour", "1/4 cup sweet rice flour", "1 tablespoon granulated sugar", "1/2 teaspoon salt", "1/2 cup soy-free solid shortening", "2-4 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor or large bowl, combine white rice flour, sorghum flour, sweet rice flour, granulated sugar, and salt. If using a food processor, pulse to combine. Whisk to combine if preparing the pie crust by hand. Add shortening. Pulse to combine or use a pastry cutter to incorporate the shortening into the flour mixture. No large pieces of shortening should remain. Add water. Pulse until a dough comes together or, using a wooden spoon, stir the water into the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously flour a piece of parchment paper with white rice flour. Center the dough on the paper. Lightly flour the top of the dough. Roll out dough into a large circle, about 11-inches. Invert the pie plate over the dough. Slide your hand between the counter and the parchment paper. In one quick motion, flip the dough and pan over. Carefully pull the paper off the dough. If any of the dough rips apart, press it back together.  Trim edges, using a fork, crimp edges. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pan with plastic wrap. Chill four hours or overnight. Use crust as directed in your favorite pie recipe or bake in a 425 degree F oven. Prick bottom of crust lightly with a fork before baking.</p>"}]}