{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110830-168502-seasoned-labne-balls-in-olive-oil.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["appetizers", "Cook the Book", "Home Made", "labne", "recipe newsletter", "vegetarian", "yogurt", "yvette van boven"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seasoned Labne Balls in Olive Oil", "link": "https://www.seriouseats.com/recipes/2011/08/seasoned-labne-balls-in-olive-oil-recipe.html", "description": "<a href=\"http://www.yvettevanboven.com/about\">Yvette van Boven</a>, author of <em><strong><a href=\"http://www.amazon.com/Home-Made-Yvette-van-Boven/dp/1584799463/?tag=serieats-20\">Home Made</a>,</strong></em> likes to use her labne for these cocktail hour ready <strong>Seasoned Labne Balls in Olive Oil</strong> by rolling them in an aromatic blend of herbs and chiles and letting them soak in good olive oil. Herby on the outside and mildly tangy within, these little yogurt balls make for genius snacks either on their on or spread onto toasted triangles of pita.", "totalTime": "30 minutes plus 3 days for hanging the labne", "recipeYield": "makes 25 balls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Vegetarian"], "recipeIngredient": ["2 teaspoons salt", "1 teaspoon black pepper", "1 clove garlic, crushed (optional)", "8 cups preferably Greek or Turkish yogurt, but any regular whole (full-fat) yogurt will do", "2 cups olive oil (or more, if necessary)", "A few bay leaves, some red chile flakes, or something else you like, perhaps cardamom pods", "1 jar dried oregano (approx. 1/4 cup)", "1 jar dried thyme (approx. 1/4 cup)  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the salt, pepper, and garlic through the yogurt. Place a clean dish towel on a colander or strainer and pour in the seasoned yogurt. Cover with plastic wrap and put in a cool place, or pull the corners together and tie the dish towel with a thick elastic band or string as tightly as possible around the yogurt, thus increasing the pressure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a loop in the string and hang the filled towel over a bucket or over the sink. It is handy to turn a stool upside down, hang the towel on the cross, and place a bucket under it. Or you can hang the towel from a tree outside, if the weather isn’t too hot. You’ll come up with something. Hang the towel for at least 3 days in a cool place. Every day try to tighten the towel a little more (as much moisture as possible has to be extracted).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half of the olive oil, the bay leaves, and other spices in an attractive, tall glass container, preserving jar, or clean vase.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the dried oregano and thyme on a plate. With clean hands, create small balls, the size of a walnut, with the drained yogurt, and carefully roll through the herbs. Slide them into the oil one by one and top up the container with olive oil in order for the balls to “float.” </p>"}]}