{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/bread%20(5).JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads", "parmesan", "rye"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Overnight Parmesan Rye", "link": "https://www.seriouseats.com/recipes/2011/10/bread-baking-ovenight-parmesan-rye-recipe.html", "description": "Letting a loaf of bread take an overnight rest in the refrigerator has a lot of advantages. For one thing, the flavor improves. For another, the gluten becomes active, so you don't need to knead as much. I think it's particularly useful with rye breads. Rye is tasty enough on its own but since it doesn't have as much gluten as wheat bread, letting it rest overnight is a much easier way to let the gluten develop.", "totalTime": "2 hours 30 minutes (plus overnight rest)", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 teaspoon instant yeast", "1 cup (4 1/2 ounces) medium rye flour", "2 cups (9 ounces) bread flour", "1 1/4 cups water", "1 teaspoon salt", "1 tablespoon cane sugar", "1 teaspoon anise seeds", "1 tablespoon caraway seeds", "1/2 cup (1 ounce) shredded parmesan cheese", "1 tablespoon unsalted butter", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all the ingredients in the bowl of your stand mixer and knead until it had come together and is beginning to become elastic. Drizzle some olive oil into a zip-top bag and transfer the dough to the bag.Remove the air from the bag and seal it. Refrigerate overnight - or up to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bag from the refrigerator and open it to release the excess air. Seal it again and massage the bag a bit to mash out the bubbles in the dough. Let it rest on the counter for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some cornmeal on a baking sheet and flour your work surface. Turn out the dough, knead it briefly, and form it into your desired shape. Place it on the prepared baking sheet, seam side down, and cover the dough with plastic wrap. Set it aside to rise until doubled - about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 30 minutes before the dough has fully risen, preheat the oven to 350 degrees. When the dough has doubled, remove the plastic wrap, slash the dough as desired, and bake at 350 degrees until nicely browned, about 40 minutes. Let the dough rest on a rack until cool before slicing.</p>"}]}