{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110930applesaucepie.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["apple", "apple pie", "desserts", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Applesauce Pie", "link": "https://www.seriouseats.com/recipes/2011/09/applesauce-pie-easy-apple-pie-recipe.html", "description": "This pie is an excuse to bake apple pies, even when its still a bit too early in the season to get the solid baking apples that hold their shape. It's called applesauce pie because the apples loose a lot a their volume during baking, creating a flavorful, chunky \"applesauce\" at the bottom, and a pocket of air between the filling and the crispy, sugar-coated, top crust. It's not the prettiest pie when you cut it open, but it's delicious, especially served warm with vanilla ice cream.", "totalTime": "4 hours", "recipeYield": "8", "recipeCategory": ["Apple", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "12 apples (any mix of: McIntosh, Golden Delicious, Gala, Cortland, Empire, or Liberty, or any other apple that is good for applesauce), peeled, cored, and cut into 1/4 inch wedges", "1/2 cup sugar (or adjust to taste, if the apples are tart, add more, if they're sweeter, dial it back)", "1 teaspoon cinnamon", "Egg wash (1 egg and a large pinch of salt, beaten)", "Turbinado sugar for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg; F. In a large bowl, toss the apples with the sugar and cinnamon to coat them evenly. Fill the prepared, chilled bottom pie crust with the apple mixture. Heap the apples in the center so they create a tall dome.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the apples tightly with the prepared, chilled top crust. Crimp the edges, and cut slits in the top to vent steam. Allow the shaped pie to chill and rest for 30 minutes in the fridge. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the pie has chilled for 30 minutes, brush it with egg wash, sprinkle with turbinado sugar put it in a 425 degree oven for 20 minutes, rotating halfway through. After 20 minutes, turn the oven down to 375&deg; and allow it to bake for an additional 45 minutes, rotating again halfway through, or until the crust is a deep golden brown and the filling is bubbling and has pulled away from the top crust and fallen to the bottom of the pie. If the top crust starts to burn in spots, cover them with foil to deflect the heat. Allow the pie to cool for 30 minutes, then serve.</p>"}]}