{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110728-dt-cheddar-scallion-polenta-croquettes.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "polenta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Cheddar Scallion Polenta Croquettes", "link": "https://www.seriouseats.com/recipes/2011/07/dinner-tonight-cheddar-scallion-polenta-croquettes-recipe.html", "description": "When I think of polenta, I think soft and creamy cornmeal served warm from the pot, a delicious northern Italian staple. But polenta also comes in another form, where it's allowed to cool and firm up to be cut into shapes and re-cooked. Polenta in its soft form has always been my go-to&mdash;mostly because a grilled piece of cornmeal never much enticed me&mdash;until I came across this recipe in Deborah Madison's <a href=\"http://www.amazon.com/exec/obidos/ASIN/0767900146/?tag=serieats-20\">Vegetarian Cooking for Everyone</a>, where it's breaded and shallow-fried.", "totalTime": "50 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Vegetarian"], "recipeIngredient": ["6-8 cups water", "2 cups cornmeal", "1 1/2 teaspoons salt", "1/2 cups grated cheddar", "6 scallions, including a little of the green part, thinly sliced", "3 tablespoons chopped parsley", "2 eggs", "1/4 cup milk", "1 cup fresh bread crumbs", "Olive oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, bring the water to boil, then whisk in the cornmeal in a slow stream to prevent any lumps. Add the salt, turn the heat to medium-low, and simmer, stirring occasionally, until the cornmeal is soft and the polenta is quite firm and pulling away from the sides of the pot (if the cornmeal is not yet soft, add water as necessary). Add the cheddar, scallions, and parsley, stir well to combine, then pour the polenta onto a baking sheet to cool and set up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the polenta is cooled and firm, cut it into 3-inch squares or circles (it should be about 1/2 inch thick). Whisk the eggs and milk together in a small bowl and spread the breadcrumbs on a plate. Dip each polenta croquette in the egg mixture, then the breadcrumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil over high heat until almost smoking. Carefully add the croquettes, cooking in batches to avoid crowding the pan. Cook until golden and crisp, about 3 minutes, then flip carefully to cook the other side. Drain on paper towels and keep warm in a low oven while cooking the remaining croquettes. Serve with sprinkled parsley.</p>"}]}