{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110523-152962-a-tart-ofasparagus-and-tarragon.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["asparagus", "brunch", "Cook the Book", "egg", "Nigel Slater", "spring", "tarts", "Tender", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: A Tart of Asparagus and Tarragon", "link": "https://www.seriouseats.com/recipes/2011/05/tart-of-asparagus-and-tarragon-recipe.html", "description": "Since my CSA started a few weeks ago I've been inundated with asparagus with at least a bunch or two of green-purple stalks popping up in my crate every Tuesday.  I've been steaming them and topping them with hollandaise and <a href=\"http://www.seriouseats.com/recipes/2011/05/asparagus-with-butter-and-soy-recipe.html\">charring them with soy</a>, but what I've really been searching for is a recipe that takes asparagus from a side to a complete meal. This <strong>Tart of Asparagus and Tarragon</strong> from <a href=\"http://www.nigelslater.com/\">Nigel Slater</a>'s <em><strong><a href=\"http://www.amazon.com/Tender-Cook-His-Vegetable-Patch/dp/1607740370/serieats-20\">Tender: A Cook and His Vegetable Patch</a></strong></em> does exactly that, by baking tender blanched stalks into a cheesy, custardy pie.", "totalTime": "1 hour 20 minutes", "recipeYield": "6", "recipeCategory": ["Asparagus", "Breakfast and Brunch", "Cook the Book", "Eggs", "Vegetarian"], "recipeIngredient": ["<strong>For the pastry:</strong>", "7 tablespoons (90g) butter  ", "1 1/4 cups (150g) all-purpose flour ", "An egg yolk ", "<strong>For the filling:</strong>", "12 medium-thick asparagus spears", "1 1/4 cups (284ml) heavy cream  ", "2 eggs ", "The leaves of 4 or 5 bushy sprigs of tarragon", "3 tablespoons grated pecorino or Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the butter into small chunks and rub it into the flour with your fingertips until it resembles coarse breadcrumbs. Mix in the egg yolk and enough water to make a firm dough. You will find you need about a tablespoon of water or even less. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough out to fit a 9-inch (22cm) tart pan (life will be easier when you come to cut the tart if you have a pan with a removable bottom), pressing the pastry right into the corners. Prick the pastry base with a fork, then refrigerate it for a good twenty minutes. Don’t be tempted to miss out this step; the chilling will stop the pastry shrinking in the oven. Meanwhile, preheat the oven to 400°F (200°C). Bake blind for twelve to fifteen minutes, until the pastry is pale golden and dry to the touch. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decrease the oven temperature to 350°F (180°C). Bring a large pan of water to a boil, drop in the asparagus, and let it simmer for seven or eight minutes or so, until it is quite tender. It will receive more cooking later but you want it to be thoroughly soft after its time in the oven, as its texture will barely change later under the custard. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the cream in a pitcher or bowl and beat in the eggs gently with a fork. Coarsely chop the tarragon and add that to the cream with a seasoning of salt and black pepper. Slice the asparagus into short lengths, removing any tough ends. Scatter it over the partly baked pastry shell, then pour in the cream and egg mixture and scatter the cheese over the surface. Bake for about forty minutes, until the filling is golden and set. Serve warm.</p>"}]}