{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111220-sfincione-sicilian-pizza-making-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["homemade pizza", "pizza", "sfincione", "sicilian pizza", "The Food Lab", "the pizza lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Sfincione (Sicilian New Years Pizza with Bread Crumbs, Onions, and Caciocavallo)", "link": "https://www.seriouseats.com/recipes/2011/12/sfincione-sicilian-new-years-pizza-with-bread.html", "description": "Note: Caciocavallo is a sheep's milk cheese from Sicily. When purchasing, ask for aged caciocavallo meant for grating. If unavailable, replace with Pecorino-Romano or Parmigiano-Reggiano. Store-bought bread crumbs will work, but for best results, use homemade. The 12.25 ounces of...", "totalTime": "At least 1 day (including rise time)", "recipeYield": "Makes 1 large pizza, serving 6 to 8", "recipeCategory": ["Pizza", "The Food Lab", "The Pizza Lab"], "recipeIngredient": ["<strong>For the Dough</strong>", "17.5 ounces (500 grams, about 3 1/2 cups) all-purpose flour", ".35 ounces (10 grams, about 2 teaspoons) kosher salt", ".18 ounces (5 grams, about 1 teaspoon) instant or RapidRise yeast", "2 tablespoons extra-virgin olive oil", "12.25 ounces (347 grams) water (see note)", "&nbsp;", "<strong>For the Breadcrumbs</strong>", "1 loaf Italian-style bread, cut into 1/2-inch slices", "1/4 cup extra-virgin olive oil", "2 ounces caciocavallo cheese (see note), grated on the large holes of a box grater", "&nbsp;", "<strong>For the Sauce</strong>", "1/4 cup extra-virgin olive oil", "2 large onions, finely diced (about 2 1/2 cups total)", "1 teaspoon dried oregano", "1/2 teaspoon red pepper flakes", "8 anchovy filets, finely chopped", "1 (28-ounce) can whole tomatoes, crushed by hand or in a food mill", "Kosher salt", "&nbsp;", "<strong>To Assemble</strong>:", "1/4 cup extra-virgin olive oil, plus more for drizzling", "4 ounces caciocavallo cheese, grated on the large holes of a box grater"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Dough:</strong> Add flour, salt, and yeast to a large bowl and whisk to combine. Add olive oil and water and stir with a wooden spoon until no dry flour remains. Dough will be quite wet. Do not add more flour. Cover bowl tightly with plastic wrap and place in refrigerator at least 12 hours and up to 3 days. While dough ferments, make the breadcrumbs and sauce (both can be made ahead).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Breadcrumbs</strong>: Adjust an oven rack to the middle position and preheat the oven to 300°F. Spread bread slices on a rimmed baking sheet and bake until completely dry, about 30 minutes. Break up bread into rough pieces with your hands then transfer to a food processor. Add olive oil and cheese and process into a fine powder. Set aside until ready to use. Breadcrumbs can be stored in a sealed container at room temperature for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Sauce</strong>: Heat olive oil and onions in a large straight-sided sautée pan over medium high heat until sizzling. Continue to cook, stirring frequently, until onions are deep golden brown, about 20 minutes total.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add oregano, red pepper flakes, and anchovies and cook, stirring constantly, until fragrant, about 30 seconds. Add tomatoes and stir to combine. Bring to a simmer then reduce to lowest possible heat and cook, stirring occasionally, until deep red, rich, and thick, about 30 minutes. Season to taste with salt and set aside. Sauce can be stored in a sealed container in the fridge for up to one week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to assemble, place a baking stone directly on the bottom of your oven and preheat the oven to 450°F. Pour half of oil in the bottom of a rimmed aluminum baking sheet. Carefully remove the dough from the bowl and form it into a ball. Pour remaining oil over the top and coat with your hands. Let rise at room temperature for 2 hours. The dough should spread to mostly fill the pan. Gently stretch and shape it to fill out to the edges. Let rise another 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully spread a generous layer of sauce to within 1/4-inch of the edges of the dough, taking care not to deflate the dough excessively (You may not need all the sauce). The sauce will spread better if it's allowed to come to room temperature first. Add a layer of grated cheese. Top the entire top surface with the cheesy bread crumbs (you may not need all the crumbs). Drizzle with more olive oil. Bake directly on the stone until top is golden brown and bottom is crisp and bubbly when you peek with a metal spatula, about 25 minutes total, rotating once half way through cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the pan using a thin metal spatula and transfer to a cutting board. Serve immediately.</p>"}]}