{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110821-127355-dinner-tonight-tortilla-soup.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["cinco de mayo", "Diana Kennedy", "Dinner Tonight", "Mexican", "soup", "tortilla chips", "tortilla soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tortilla Soup with Fried Pasilla Chiles", "link": "https://www.seriouseats.com/recipes/2011/08/tortilla-soup-with-fried-pasilla-chiles-recipe.html", "description": "Using less than 10 ingredients, this soup is a lighter and mellow version to the standard soups found in restaurants.", "totalTime": "1 hour", "recipeYield": "4 to 6 people", "recipeCategory": ["Dinner Tonight", "Mexican", "Soups and Stews"], "recipeIngredient": ["12 ounces tomatoes (about two medium-sized tomatoes)", "1/4 cup white onion, chopped", "1 garlic clove", "1 cup vegetable oil", "3 pasilla chiles, stems and seeds removed", "12 small corn tortillas, cut into strips", "6 cups chicken stock", "2 large sprigs epazote", "6 tablespoons grated Chihuahua cheese (or other melting cheese)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a sheet of aluminum foil on a cast-iron skillet set over medium heat. Add the tomatoes, and flip with a pair of tongs every other minute or so until they are lightly blackened on all sides. Remove and set aside to cool for a few minutes. Then remove the core from each tomato, and then add to a blender along with the onion and garlic. Process until very smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While tomatoes are cooking, heat the oil in a large Dutch oven set over medium-high heat. When hot, add the chiles. Cook until crisp, which should just take a few seconds on each side. Remove with a pair of tongs, and transfer to some paper towels to drain. Then add as many of the tortilla strips as will comfortably fit in one layer in the oil. Cook until lightly browned, but not too crisp. Remove the strips with a pair of tongs, shaking off any additional oil. Drain the strips on paper towels. Repeat process with remaining tortilla strips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all but one tablespoon of the oil from the Dutch oven. With the heat still on medium-high, add the tomato mixture. Cook, stirring often with a wooden spoon, until slightly reduced, about five minutes. Pour in the chicken stock. Bring the mixture to a boil over high heat. While it is warming up, check the seasoning, and add a pinch or two of salt if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When soup comes to a boil, add the tortilla strips. Reduce heat to medium, and cook for three minutes. Add the sprig of epazote, and cook for one more minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble the fried pasilla chiles. Divide the soup between four to six bowls. Top each with a sprinkle of the crumbled chiles and one-sixth of the grated cheese. Serve immediately.  </p>"}]}