{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20111003-127677-LTE-Flourless-Chocolate-Primary.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["chocolate desserts", "flourless", "fruit desserts", "Let them eat cake", "pears"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flourless Chocolate Cake With Spiced Pears", "link": "https://www.seriouseats.com/recipes/2011/10/flourless-chocolate-cake-with-spiced-pears-wine-poached-pears-recipe.html", "description": "The recipe is dense with vibrant egg yolks, lightened with meringue, and saturated with bittersweet chocolate. The <strong>ginger-and-pepper spiced wine-poached pears </strong>that top this cake are fiery orange, tinted with beet, as an ode to the opening night regalia of the turning foliage.", "totalTime": "3 hours, 30 minutes", "recipeYield": "serves 8 to 10", "recipeCategory": ["Cakes", "Chocolate", "Pear"], "recipeIngredient": ["<strong>For the Pears</strong>", "3 cups sweet white wine", "2 cups sugar", "1 medium beet, peeled and sliced (see notes)", "10 slices fresh ginger (about one 4-inch peeled piece)", "1 teaspoon black peppercorns", "1 teaspoon whole cloves", "2 cinnamon sticks", "4 firm Bosc pears, peeled, cored, and cut into 8 pieces lengthwise", "  ", "<strong>For the Cake</strong>", "4 ounces  (1 stick) plus 1 tablespoon unsalted butter, cut into 1 tablespoon pieces ", "1 1/2  teaspoons Maldon salt, divided", "16 ounces bittersweet chocolate, finely chopped", "9 large eggs, separated and at room temperature", "1 1/4 cups sugar", "1/4 cup unsweetened cocoa powder, sifted", "2 teaspoons espresso powder", "2 teaspoons pure vanilla extract", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pears:</strong> Bring wine, sugar, beet, ginger, peppercorns, cloves, and cinnamon sticks to boil over medium-high in medium heavy-bottomed saucepan. Reduce heat to low and add pears. Cover with parchment paper lid. Simmer until pears are tender, about 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pan from heat. Using a slotted spoon, transfer pears to a large bowl, picking off any cloves or peppercorns. Strain the syrup into a separate bowl and discard beets and spices. Return strained syrup to saucepan and boil over medium-high heat until reduced to 1 1/2 cups, about 20 minutes. Pour syrup over pears and cool completely, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to middle position and preheat oven to 350&deg;F. Grease a 9-inch springform pan with 1 tablespoon butter and line exterior of pan with foil. Sprinkle 3/4 teaspoon Maldon salt over pan bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate and remaining 8 tablespoons butter in bowl set over double-boiler (bottom of bowl should not be touching simmering water) and stir continuously until chocolate is completely melted and mixture is smooth and shiny. Remove bowl from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl (see notes) whisk egg yolks and 3/4 cup sugar vigorously until mixture is a thick, pale paste. Add cocoa, espresso powder, and vanilla, and whisk until completely incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 1/4 cup of warm chocolate to the egg yolk mixture and stir until completely incorporated. Whisk in remaining chocolate. (Mixture will be very dense).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large, clean, dry bowl beat egg whites and salt with whisk attachment on medium-low speed until whites begin to froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes. Slowly add remaining 1/2 cup sugar and continue beating until stiff, glossy peaks form. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk about 1/3 of the meringue into the chocolate batter until completely incorporated.  With a rubber spatula, fold in the remaining meringue. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared baking pan and sprinkle with remaining 3/4 teaspoon Maldon salt. Bake until top begins to crack and cake tester has moist crumbs attached to it when inserted, 45 to 60 minutes. Transfer cake to cooling rack. Cool in pan 10 minutes, then remove springform mold and cool completely, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, top cake with pears and 1/4 cup syrup. Pass remaining syrup at table if desired.</p>"}]}