{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110717-161104-preserved-raspberry-cocoa-jam-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cocoa", "Jam", "Preserved", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Raspberry Cocoa Jam", "link": "https://www.seriouseats.com/recipes/2011/07/raspberry-cocoa-jam-recipe.html", "description": "Like adding a splash of balsamic vinegar, incorporating cocoa powder into this jam intensifies the flavor of the raspberries and provides depth and richness. It's practically begging to be slathered on fresh croissants, and it tastes pretty swell on a peanut butter sandwich, too.", "totalTime": "1 hour", "recipeYield": "Makes seven (8-ounce) jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Raspberry"], "recipeIngredient": ["6 3/4 cups granulated sugar", "1/2 cup cocoa powder", "One (1.75-ounce) package regular powdered fruit pectin", "4 1/2 cups crushed raspberries (about four 6-ounce)", "1/4 cup lemon juice", "1/4 cup amaretto (optional)", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve jam, prepare jars and lids: place 7 half-pint jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure 6 3/4 cups sugar into large bowl. Whisk cocoa powder and pectin together in small bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine crushed raspberries, lemon juice, and amaretto (if using) in large, heavy bottomed pot. Whisk in pectin mixture. Add butter and bring to a boil over high heat, stirring constantly. Add sugar all at once and bring to full rolling boil that cannot be stirring down, stirring constantly. Boil hard for one minute. Remove pot from heat and skim any foam from surface of jam with metal spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preserved jam will keep for up to one year in a cool, dark place. Unpreserved jam will keep in the refrigerator for about six months. </p>"}]}