{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111115-127355-dinner-tonight-mayi-shang-shiu.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "mung beans", "pork", "sambal", "sichuan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Mayi Shang Shu (Pork with Mung Bean Threads)", "link": "https://www.seriouseats.com/recipes/2011/11/mayi-shang-shiu-pork-with-mung-bean-threads.html", "description": "Mayi shang shu apparently translates into English as \"ants climbing in trees.\" Don't worry, no actual ants are involved: the pork clings to the noodles like ants on a tree.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Pork"], "recipeIngredient": ["5 ounces mung bean threads", "2 ounces soy sauce ", "1 tablespoon mirin", "1 tablespoon sambal chile paste, plus more for serving ", "1 teaspoon cornstarch ", "10 ounces ground pork ", "1 tablespoon canola oil ", "4 scallions, ends trimmed, sliced on the bias ", "1/2 cup chicken broth "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the mung bean threads into a large bowl and cover with hot water (Brown recommends 120&deg;F to 150&deg;F) by one inch. Set aside to soak for 20 minutes. With a pair of kitchen shears, cut the threads into 4- to 6-inch pieces. Drain in a colander for at least 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the bean threads are soaking, in a medium-sized bowl whisk together the soy sauce, mirin, and sambal. Add the corn starch and whisk until smooth. Then add the pork and stir until well combined. Set the bowl aside for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pork has finished marinating, place a large work or 12-inch sauté pan over high heat. When very hot, add the oil, and when it starts to shimmer, add the pork mixture. Cook, stirring with a large wooden spoon to break the pork into very small pieces, until lightly browned, about two minutes. Add two-thirds of the scallions, and continue to stir often until the pork is well browned, another two minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium-high and pour in the broth. Cook until the broth has evaporated, one to two minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a handful of the drained mung bean threads. Stir well until the threads are completely coated in the pork and sauce. Repeat process until all of the mung bean threads have been added. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide mixture between four plates, and garnish with the remaining scallions. Serve with more sambal if you need some more spice. </p>"}]}