{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111031-127355-dinner-tonight-mussels-with-paprika-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "Ferran Adrià", "mussel", "mussels", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mussels with Paprika", "link": "https://www.seriouseats.com/recipes/2011/11/mussels-with-paprika-recipe.html", "description": "There are essentially two ways to approach this dish. The first is as a straightforward, satisfying mussel dish with a pretty good broth. Though certainly not my absolute favorite way to cook bivalves, it's tasty and ultimately worthy as a quick weeknight dinner. Not to mention, it's also a Ferran Adrià-approved recipe from his latest cookbook, <em><a href=\"http://www.amazon.com/dp/0714862533/?tag=serieats-20\">The Family Meal</a></em>, which means there are some high expectations.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner Tonight"], "recipeIngredient": ["3 tablespoons olive oil ", "2 garlic cloves, minced", "1 teaspoon sweet paprika (smoked sweet paprika works, too)", "2 teaspoons all-purpose flour ", "2 cups water ", "salt and pepper ", "3 pounds mussels, beards removed and rinsed ", "5 sprigs parsley, stems discards, leaves chopped", "1 lemon, cut in half "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large saucepan set over medium heat. Add the garlic and cook until fragrant, about 30 seconds. Add the paprika, stir well, and let cook for a couple seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle in the flour. Stir with a whisk to ensure there are no lumps. While stirring, pour in the water. Turn the heat to high and bring to a boil. Then reduce heat to medium to maintain a strong simmer. Cook until the sauce is thickened and flavorful, about ten minutes. (If the sauce doesn't quite thicken, return heat to high and bring to a boil. Continue cooking until it thickens.) At the end, season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of the chopped parsley and all of the mussels. Stir with a wooden spoon, and then cover the saucepan and cook over medium heat. Stir the mussels every other minute or so. Cook until the mussels have opened up, about five minutes. Discard any mussels that haven't opened. Squeeze half of the lemon juice in the pot and stir. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish the mussels with the remaining chopped parsley. If needed, squeeze in more lemon juice. </p>"}]}