{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20111015-175186-Aviary-Bitter2.jpg", "author": {"@type": "Person", "name": "Roger Kamholz"}, "recipeCuisine": "", "keywords": ["amari", "amaro", "aviary", "brandy", "cognac", "smoke"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Aviary's Bitter", "link": "https://www.seriouseats.com/recipes/2011/10/aviary-recipe-bitter-smoked-cocktail-cognac-recipe.html", "description": "The Bitter cocktail, from the Aviary in Chicago, is served in a glass that's been smoked over a piece of smoldering bourbon barrel stave, which is custom-cut by the cocktail lounge's industrial designer. Fear not&mdash;<strong>we love this cocktail with or without the touch of smokiness!</strong> But if you're feeling adventurous and want to truly re-create this drink at home, used small-format, seasoned barrels <a href=\"http://stores.intuitwebsites.com/TuthilltownSpirits/-strse-Barrels/Categories.bok\">are available for purchase online</a> from New York's Tuthilltown Spirits, makers of Hudson whiskey.", "totalTime": "", "recipeYield": "1", "recipeCategory": ["Brandy and Cognac"], "recipeIngredient": ["1/2 ounce Pierre Ferrand Cognac", "1/2 ounce Laird's Bonded Apple Brandy", "2/5 ounce Bonal", "1/3 ounce Amaro Nonino", "1 barspoon Lorenzo Inga My Amaro", "Dash Peychaud's bitters", "Ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the barrel stave coaster, cut a roughly 6-inch-long section from the widest part of the barrel stave using a saw. Using a hole saw bit the same diameter as an Old Fashioned glass, drill a 1/2-inch-deep circular channel into the charred side of the barrel stave. The Old Fashioned glass should rest securely upturned in the circular channel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the cocktail, combine cognac, apple brandy, Bonal, Amaro Nonino, My Amaro, and bitters in a mixing glass. Add fresh ice and stir for 20 seconds. Strain into a chilled, single-serving carafe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To smoke the Old Fashioned glass, light blowtorch and apply heat for about 10 seconds to the center of the coaster circle made with the drill. The barrel stave should begin to lightly smoke. Cap the smoke with the Old Fashioned glass and allow smoke to collect in the glass, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve the cocktail, flip over the smoked Old Fashioned glass and pour in the contents of the carafe. </p>"}]}