{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110620-ice-cream-bars-knife-in-water.jpg", "author": {"@type": "Person", "name": "Liz Gutman"}, "recipeCuisine": "", "keywords": ["chocolate desserts", "ice cream bars"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Chocolate Covered Ice Cream Bars", "link": "https://www.seriouseats.com/recipes/2011/06/homemade-chocolate-covered-ice-cream-bars-recipe.html", "description": "This recipe can be varied endlessly, but the basic rendition outlined below is always a winner. If you don't have wooden sticks handy, no worries&mdash;they just end up closer to an Eskimo Pie. I like to sprinkle a little sea salt on the chocolate as it sets up.", "totalTime": "1 hour", "recipeYield": "4", "recipeCategory": ["Chocolate"], "recipeIngredient": ["1 pint good quality ice cream, flavor of your choice", "1 (12oz) package semisweet chocolate chips", "1/2 cup vegetable or mild olive oil", "Wooden ice pop sticks (optional)", "Sea salt or sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the baking sheet with parchment or wax paper and set aside. Fill a tall glass (an inexpensive vase will also do) with hot water.  Note: Make sure the water is not boiling and the glass is at room temperature to make sure nothing explodes. Leave the knife in the hot water for 3-5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the ice cream out of the freezer and remove the lid. It also helps to mark, or even cut off, the bottom \"lip\" of the carton before the next step, so your slices are sized evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mark the container with the knife approximately halfway up the height of the container. Very carefully, and keeping your fingers well out of the way, slice the carton in half crosswise. Cut each half in half again, place on the prepared sheet tray, and return to the freezer for 5 to 10 minutes to firm up again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt the chocolate and oil together in the microwave or over a pan of simmering water on the stove, stirring well with a whisk or spatula to mix. Allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove ice cream slices from the freezer. With the tip of the knife, cut through one side of each of the carton-covered slices and peel off the carton. Insert a wooden stick halfway into each slice, replace on the sheet pan, and return to the freezer for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the chocolate mixture is cool, take the bars out of the freezer.  Working quickly, dip the bars in the chocolate mixture and return to the sheet pan (you may want to have a clean sheet of parchment or wax paper ready). Add sea salt, sprinkles, or other decorations before the chocolate sets up completely. Once all the bars are dipped, return to the freezer to set for 10 minutes before serving. </p>"}]}