{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110811-165717-aleppo-ribs.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["Aleppo", "pork", "Pork Ribs", "rib", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sunday Supper: Aleppo-Rubbed Pork Ribs", "link": "https://www.seriouseats.com/recipes/2011/08/aleppo-rubbed-pork-ribs.html", "description": "Many rubs have long ingredient lists that combine many different flavors.  But using a minimal approach can allow you to get to know a particular spice a bit better, and also allows the flavor of the meat to come to the forefront.  Although this rub uses Aleppo pepper (a dried Turkish spice), ground Ancho can often be easier to find, and the two have very similar taste profiles.  If substituting Ancho for Aleppo, you may want to add more salt to your rub (Aleppo peppers are often salted during their drying process).", "totalTime": "1 hour 10 minutes (plus overnight in the fridge)", "recipeYield": "4", "recipeCategory": ["Grilling", "Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["1 1/2 teaspoons Aleppo pepper", "1 teaspoon kosher salt", "1 teaspoon brown sugar", "2 racks (about 5 pounds) St. Louis style ribs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix Aleppo pepper, salt and sugar in a small bowl until well combined.  Rub all over ribs and allow to sit overnight.</p>\n\n<p><br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cooking ribs is a lot about personal preference, but the indirect heat method always seems to produce great results with rubbed ribs especially.  Preheat one side of the grill and sear ribs until a good crust forms, about 6 minutes per side.  Place ribs on cool side of grill, bone side down; close the lid and cook until desired temperature is reached, about 40 minutes.  Serve these ribs with sweet corn and creamy coleslaw.</p>"}]}