{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110407MatzoToffeeSE.jpg", "author": {"@type": "Person", "name": "Olga Massov"}, "recipeCuisine": "", "keywords": ["chocolate", "desserts", "hanukkah desserts", "Jewish holidays", "matzo", "toffee"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Matzo Toffee With Almonds", "link": "https://www.seriouseats.com/recipes/2011/04/matzo-toffee-with-almonds-recipe.html", "description": "The trick to making matzo toffee impossible to put down is simple: <strong>generous sprinkling of fleur de sel.</strong> The salt combined with the bittersweet chocolate and butter pretty much spells doom for everyone who comes in contact with it. If you make this for your guests on Passover, I guarantee glee and gratitude all around.", "totalTime": "40 minutes", "recipeYield": "16 to 20", "recipeCategory": ["Desserts", "Passover"], "recipeIngredient": ["5 sheets whole wheat matzo (broken into large and small pieces to fit the pan)", "3/4 cup (1 1/2 sticks) unsalted butter, cut into small pieces", "1 cup packed dark-brown sugar", "1 (12-ounce) package semisweet chocolate chips (2 cups)", "1/3 cup toasted, slivered almonds", "1 teaspoon flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 275&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper. Place matzos in an even layer on a 13 x17-inch jelly roll pan. You may need to break some matzos to fit the pan, and you should have extra matzo left over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a saucepan over medium-low heat. Add brown sugar and immediately reduce the temperature to low. Cook, stirring, until sugar has completely dissolved and beings to bubble. Drizzle toffee over matzo and spread evenly to cover using a spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer toffee-covered matzo to oven and bake until the toffee gets shiny for 15 minutes. Remove from oven and sprinkle with chocolate chips. Let stand for 5 minutes, and spread melted chocolate over matzo to cover. Sprinkle with the toasted almonds and sea salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer matzo to the refrigerator and chill for at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break chilled matzo toffee into pieces. Matzo toffee will keep in an airtight container for up to 4 days at room temperature, but it tastes much better, and keep longer (though it’s not likely to last long) in the refrigerator.\t</p>"}]}