{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110818-166731-blt-bucatini.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["arugula", "blt", "Cook the Book", "Domenica Marchetti", "pancetta", "pasta", "The Glorious Pasta of Italy", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: BLT Bucatini", "link": "https://www.seriouseats.com/recipes/2011/08/blt-bucatini-pasta-recipe.html", "description": "This <strong>BLT Bucatini</strong> from <a href=\"http://www.domenicacooks.com/about-2/\">Domenica Marchetti</a>'s <em><a href=\"http://www.amazon.com/Glorious-Pasta-Italy-Domenica-Marchetti/dp/0811872599/?tag=serieats-20\">The Glorious Pasta of Italy</a></em> is another fantastically quick pasta to add to your weeknight dinner artillery.  The \"B\" here is really more like a \"P,\" crisp slices pancetta, the \"L\" is peppery arugula, and the \"T,\" tomatoes of course, and in this case, sweetly roasted cherry tomatoes tossed with olive oil.", "totalTime": "15 minutes plus 2 hours for roasting the tomatoes", "recipeYield": "4", "recipeCategory": ["Bacon", "Cook the Book", "Leafy Greens", "Pasta", "Tomato"], "recipeIngredient": ["1 tablespoon extra-virgin olive oil", "8 ounces thickly sliced pancetta, cut into 1/2-inch pieces", "1 1/2 pounds cherry tomatoes, slow roasted (see Note) and then coarsely chopped, with some of their juices", "1 pound dried bucatini or spaghetti", "8 ounces arugula, tough stems removed and coarsely chopped", "1/2 cup freshly shredded pecorino romano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a rolling boil and salt generously. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the water is heating, warm the olive oil in a large frying pan placed over medium heat. Add the pancetta and sauté, stirring frequently, for 8 to 10 minutes, or until the pancetta begins to render its fat and turn somewhat crispy. Stir in the cherry tomatoes and cook, stirring occasionally, for about 5 minutes, or until the tomatoes are heated through. Turn off the heat and cover the sauce to keep it warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta to the boiling water, stir to separate the noodles, and cook according to the manufacturer’s instructions until al dente. Drain the cooked pasta in a colander set in the sink, reserving about 1 cup of the cooking water. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pasta to the frying pan and gently toss the pasta and sauce to combine thoroughly, adding a splash or two of the cooking water if necessary to loosen the sauce. Add the arugula by the handful and continue to toss for a minute or so, or until the arugula is just wilted. Transfer the dressed pasta to shallow individual bowls and sprinkle the cheese over the top. Serve immediately.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> To make slow-roasted cherry tomatoes, heat the oven to 275°F. Cut the cherry tomatoes in half and arrange them in a single layer on a large rimmed baking sheet/tray. Drizzle 1/4 cup extra-virgin olive oil over the tomatoes, then scatter 2 cloves garlic, thinly sliced, over the tomatoes. Season with kosher or fine sea salt and freshly ground black pepper. Roast for 2 to 3 hours, or until the tomatoes have collapsed and shriveled a little but are still moist. Let cool and use immediately, or store in a tightly lidded container in the refrigerator for up to 1 week. Bring to room temperature before using.</p>"}]}