{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110315-142449-middle-eastern-lamb-pizza.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["At Elizabeth David's Table", "bread", "Cook the Book", "Elizabeth David", "flatbread", "lamb", "pizza", "sumac"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Middle Eastern Lamb Pizza", "link": "https://www.seriouseats.com/recipes/2011/03/middle-eastern-lamb-pizza-recipe.html", "description": "The cuisine of the Mediterranean was <a href=\"http://en.wikipedia.org/wiki/Elizabeth_David\">Elizabeth David</a>'s great passion, but her exploration was not limited only to the sea's European coastlines. During a period spent in Egypt, David embraced Middle Eastern flavors and incorporated them into her cooking. This sweetly spiced lamb and tomato-topped <strong>Middle Eastern Lamb Pizza</strong> has roots in Lebanon and Armenia.", "totalTime": "", "recipeYield": "8 to 10, as a first course", "recipeCategory": ["Bread Baking", "Cook the Book", "Lamb", "Pizza"], "recipeIngredient": ["<strong>For the dough:</strong>", "2 1/2 packed teaspoons fresh yeast or 1 1/2 teaspoons active dry yeast", "Approximately 2/3 cup warm milk", "2 1/4 cups bread flour", "1 teaspoon salt", "1 whole large egg,", "2 tablespoons olive oil, plus more for the dish", "<strong>For the filling:</strong>", "1 small onion, chopped", "Olive oil", "8 ounces ground lamb", "2 or 3 cloves of garlic", "Salt", "1 teaspoon cinnamon ", "1 teaspoon cumin", "1/2 teaspoon ground cloves ", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon sumac", "1 cup canned tomatoes ", "1 teaspoon sugar", "1 teaspoon dried mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To cook the filling,</strong> melt the chopped onion in olive oil. add the meat and let it brown gently; put in the peeled and crushed garlic cloves, salt, a level teaspoon each of cinnamon and ground cumin, a half teaspoon of ground cloves, and the same of freshly ground black pepper and sumac. Add the tomatoes, cover the pan and simmer gently until the juice has evaporated and the whole mixture is fairly thick. Taste it for seasoning. It should be really well spiced, so it may need more pepper and perhaps extra cumin. A teaspoon or two of sugar may be needed, and a little dried mint can also be added.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Having mixed the dough ingredients together and left it to rise until very light and puffy, oil a large 12-inch platter and spread the dough on it, taking it right up to the edges. Leave it, covered, for 15 minutes, until it has returned to life. Spread the warm filling over it. There should not be too thick a layer. Again, leave the prepared pizza for 10 to 15 minutes before putting it into the oven at 450°F for 15 minutes. in either case it is a good idea to cover the pizza with a piece of oiled parchment paper at half time, as the filling should not dry out.</p>"}]}