{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110802-173571-potato-doughnuts-cut-out.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato Doughnuts", "link": "https://www.seriouseats.com/recipes/2011/10/how-to-make-fluffy-potato-doughnuts-maine-recipe.html", "description": "Soft and tender, with a hint of spice, these doughnuts lack the heaviness that often accompanies cake doughnuts&mdash;<strong>you'd never guess that they're spud powered.</strong>", "totalTime": "3 1/2 hours", "recipeYield": "20", "recipeCategory": ["Breakfast Sweets", "Doughnuts"], "recipeIngredient": ["4 cups all-purpose flour", "4 tablespoons buttermilk powder", "2 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1 teaspoon salt", "1 teaspoon cinnamon, divided", "1/4 teaspoon freshly ground nutmeg", "2 large eggs", "2 cups sugar, divided", "2 tablespoons melted butter", "1 tablespoon vanilla extract", "1 cup well mashed potatoes (with minimal lumps)", "Corn oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl whisk together flour, buttermilk powder, baking powder, baking soda, salt, 1/2 a teaspoon cinnamon, and nutmeg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl or the bowl of a stand mixer, combine eggs and 1 cup sugar beating until combined and slightly foamy. Add 1 cup water, melted butter, vanilla and mashed potatoes. Stir until smooth. Slowly add flour mixture and stir until just incorporated. Lay out two large sheets of plastic wrap. Divide dough and form dough into two balls. Wrap in plastic wrap then flatten into discs. Refrigerate for at least two hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously flour a large work surface. Take one of the discs and turn out the dough to coat with flour, sprinkling the surface of the dough with flour to lessen stickiness, if needed. Gently pat the dough to about 1/2 an inch thick. Use a floured 3 inch doughnut cutter to cut out doughnuts and place cut doughnuts and doughnut holes on a well floured sheet of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a Dutch oven or large cast iron skillet with 2 inches of oil. Heat oil over medium high heat until 360&deg;F. Drop doughnuts in the oil and fry until a deep golden brown on both sides (about 2 minutes per side). Use chopsticks to turn the doughnuts. Be careful not to crowd the doughnuts in the pan (no more than 2 to 3 doughnuts at a time). Remove doughnuts immediately from the pan using a heat resistant slotted spoon or spatula. Set on paper towel lined baking racks to cool. Once cooled slightly toss in a bag with remaining cinnamon sugar. Serve immediately.</p>"}]}