{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111206-egg-nog-07-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["eggnog", "holiday", "rum", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Toffee Eggnog", "link": "https://www.seriouseats.com/recipes/2011/12/toffee-eggnog-recipe.html", "description": "A toffee-laden variation on eggnog.", "totalTime": "10 minutes", "recipeYield": "makes about 2 quarts, serving 12 to 16", "recipeCategory": ["Christmas", "Rum"], "recipeIngredient": ["2/3 cup brown sugar", "1 tablespoon water", "2 cups heavy cream", "8 eggs, separated", "3 cups milk", "1 teaspoon vanilla extract", "2 cups dark rum", "Garnish: toffee candy such as Skor or Heath Bar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine brown sugar and water in a small saucepan and cook over medium-high heat until sugar is completely melted, stirring gently. Carefully add heavy cream and whisk to combine. Remove from heat and allow to cool to room temperature. Set aside 1/2 cup for garnishing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place egg whites in the bowl of a stand mixer and whisk on low speed until frothy, about 30 seconds. Increase speed to medium-high and, watching carefully, beat until they are about the consistency of shaving cream, about 90 seconds. Reduce speed to medium. With mixer running, add half cup of toffee mixture and beat until incorporated, about 30 seconds. Transfer whites to a large bowl. Do not wash bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add egg yolks and remaining toffee mixture to now-empty stand mixer bowl and beat at medium-high speed until pale yellow and ribbony, shutting off machine and scraping down sides with a rubber spatula as necessary, about 2 minutes total. Add milk, vanilla, and alcohol and mix on low speed to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula or handheld whisk, fold the whipped whites into the egg yolk/milk mixture until completely incorporated. Serve by ladling into goblets and drizzling with reserved toffee. Garnish with crushed chocolate-coated toffee candies, such as Skor or Heath bar.</p>"}]}