{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110104-131321-eat-for-eight-bucks-crepes-leeks-eggs.jpg", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "French", "keywords": ["cheese", "crepes", "Eat for Eight Bucks", "egg", "French", "leeks", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Eat for Eight Bucks: Olive Oil Crepes with Leeks and Eggs", "link": "https://www.seriouseats.com/recipes/2011/01/eat-for-eight-bucks-olive-oil-crepes-with-leeks-and-eggs.html", "description": "When I lived in France, my host mother used to heat up purchased buckwheat crepes with ham and eggs as a dinner last resort, when she was short on time and ingredients. Though she was a good cook, I liked that simple meal as much as anything else she made.  You can in fact buy pre-made crepes over here, too, but frying the crepes yourself adds only a little in the way of time and really nothing in the way of ingredients. If your appetite is hardy, you can also crack two eggs over each crepe without straying from the eight-buck budget.", "totalTime": "35 minutes", "recipeYield": "2", "recipeCategory": ["Cheese", "Crepe", "Eat for Eight Bucks", "Eggs", "French", "Vegetarian"], "recipeIngredient": ["1/2 cup milk", "3 eggs", "2 teaspoons olive oil", "Salt", "1/3 cup all-purpose flour", "1 tablespoon butter", "1 medium leek, washed well and sliced into thin half moons", "1 clove garlic, minced", "Freshly ground pepper", "2 ounces gruyere, emmenthal, or fontina, shredded (about 1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blend milk, 1 egg, olive oil, pinch of salt, and flour in a mini prep or a blender. Set aside for 10-15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, heat 2 teaspoons butter over medium heat. Add the leeks and cook, stirring often, about 10 minutes, until the leeks wilt. Do not let them brown. Add the garlic and cook for 2 more minutes, until the garlic is transparent. Sprinkle with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler and set a rack at the highest level. Heat a 9 to 12-inch castiron pan over medium-high heat. Brush it with some of the remaining butter. Pour 1/3 cup of crepe batter into pan and tilt to spread it in an even, thin layer. Cook for about 3 minutes, until the top of the crepe looks dry and slightly bubbly. Using a small offset spatula, release the edges of the crepe from the pan and flip the crepe with your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle half the leeks and half the cheese over the surface of the crepe, leaving a space in the middle for the egg. Crack 1 egg into this space, and sprinkle it with salt and pepper.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pan to the oven and broil for 3-4 minutes, until the whites have cooked but the yolk is still runny. Slide the crepe onto a plate, folding it in half if you wish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the second crepe the same way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You will have enough batter for one more crepe; I recommend spreading it with butter and sprinkling with sugar and lemon juice for dessert.<br />\r\n</p>"}]}