{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110825-167808-roast-beef-yorkshire-pudding.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["beef", "roast beef", "Sunday Supper", "Yorkshire pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Roast Beef and Yorkshire Pudding", "link": "https://www.seriouseats.com/recipes/2011/09/roast-beef-and-yorkshire-pudding-recipe.html", "description": "A lovely bone-in prime rib roast makes for an exceptional dinner, but there are many other roasts that make for a perfect Sunday supper without the hefty price tag.  When picking out the roast, take a look at the amount of fat present.  If you're using a leaner roast (like the petite sirloin) you will end up with little fat in the bottom of your roasting pan with which to make Yorkshire pudding.", "totalTime": "1 hour 15 minutes", "recipeYield": "4-6", "recipeCategory": ["Beef", "Mains", "Sunday Supper"], "recipeIngredient": ["3 pound beef roast (such as petite sirloin)", "Kosher salt and cracked black pepper", "Vegetable oil", "1 onion, coarsely chopped", "&nbsp;", "<strong>Yorkshire Pudding:</strong>", "4 eggs", "2 cups milk", "2 cups all purpose flour", "1 teaspoon salt", "Beef drippings or bacon fat"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Season roast with salt and pepper, and scatter chopped onion in bottom of roasting dish.  Heat a large skillet over high heat with vegetable oil until just smoking.  Sear roast on all sides until a brown crust forms, about 4 minutes per side.  Place roast on chopped onions and place in oven and cook until desire temperature is reached (125°F for medium rare).  Raise oven temperature to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once roast is out of the oven and resting, beat eggs and milk together.  Mix flour and salt and beat into egg mixture until a loose batter forms.  Pour 1 tablespoon fat (beef dripping or bacon fat) into each muffin section of muffin tin.  Place muffin tin in oven and heat for 10 minutes; remove from oven and divide batter equally between each muffin section, return pan to oven and bake until Yorkshires are puffed and brown, about 8 minutes.  Serve sliced roast immediately with Yorkshire pudding, gravy and red wine.</p>"}]}