{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110728-162940-crab-salad-with-avocado-and-lime.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["avocado", "Cook the Book", "crab", "Patricia Wells", "salad", "Salad as a Meal", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Crab Salad with Lime and Avocado ", "link": "https://www.seriouseats.com/recipes/2011/07/crab-salad-with-lime-and-avocado-recipe.html", "description": "Creamy salads like chicken and tuna are pretty common summer lunchtime fare, but there's something about crab salad that feels like a special occasion.  A little pricier than chicken and the chicken of the sea, crab is sweetly delicate, the sort of nuanced flavor that begs not to be overpowered.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Avocado", "Cook the Book", "Lobster and Crab", "Salads"], "recipeIngredient": ["1 pound (2 cups) fresh cooked lump crabmeat", "Grated zest of 2 limes or lemons, preferably organic ", "1/4 cup Creamy Lemon-Chive Dressing (recipe follows)", "Fine sea salt", "Coarse, freshly ground black pepper", "1 orange or red bell pepper, trimmed, seeds removed, and minced (1 scant cup)", "2 celery ribs, finely minced (about 2 cups)", "1/4 cup minced fresh cilantro, chervil, or parsley leaves", "1/4 teaspoon Red Hot Salt (recipe follows) or fine sea salt", "1 large ripe avocado, halved, pitted, peeled, and cut into very thin half- rounds", "4 thin slices sourdough bread, toasted, for serving", " ", "<strong> Creamy Lemon-Chive Dressing</strong>", "2 tablespoons freshly squeezed lemon juice", "1/2 teaspoon fine sea salt", "1 cup light cream", "1/3 cup finely minced fresh chives", "Lemon zest", " ", "<strong>Red Hot Salt</strong>", "2 teaspoons ground Piment d'Espelette or other ground mild chile pepper", "1/2 teaspoon hot-smoked Pimentón de la Vera or other hot smoked paprika", "1/2 teaspoon mild paprika", "1 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Creamy Lemon-Chive Dressing:</strong> In a jar, combine the lemon juice and salt. Cover with the lid and shake to dissolve the salt. Add the cream, chives, and lemon zest. Shake to blend. Taste for seasoning. The dressing can be used immediately. (Store the dressing in the refrigerator for up to 1 week. Shake to blend again before using.) But will it curdle? Given the right circumstances, such as the addition of acids or heat, any milk or cream product will curdle (meaning the curd protein coagulates and forms clumps). The greater the fat content of the milk or cream, the more it will resist curdling. I use a light cream with a 12% fat content, much like what is also called half- and- half, and have never had a problem with curdling when adding lemon juice to the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Red Hot Salt:</strong> Combine all the ingredients in a jar.  Cover, shake to blend.  (Store the salt mixture, sealed in a jar, at room temperature for up to 1 month.  After that the flavors will begin to fade.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salad:</strong> In a large bowl, combine the crabmeat and citrus zest and toss with just enough dressing to lightly coat the crabmeat. Taste for seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In another bowl, combine the bell pepper, celery, cilantro, and Red Hot Salt and toss with just enough dressing to lightly coat the vegetables. Taste for seasoning. Combine the contents of the two bowls, mixing gently to blend.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mound the salad in the center of the dinner plates. Arrange the avocado slices around the salads. Serve with the toast. </p>"}]}