{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110904-127355-dinner-tonight-whitefish-breadcrumbs.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["bread crumbs", "Dinner Tonight", "fish", "Lidia Bastianich", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Dinner Tonight: Baked Fish with Savory Bread Crumbs", "link": "https://www.seriouseats.com/recipes/2011/09/baked-fish-with-savory-bread-crumbs-recipe.html", "description": "Though easy to prepare, this dish from Lidia Bastianich is anything but basic. The breadcrumbs are heavily seasoned with lemon zest, oregano, parsley, and red pepper flakes. This gives each bite a great citrus note, along with a little spicy kick. If that weren't enough, a dressing of sorts is added to the baking dish so the fillets are also perfumed by white wine and lemon juice.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Fish"], "recipeIngredient": ["2 pounds whitefish fillets, or other mild fish (about four fillets)", "3/4 teaspoon kosher salt, divided ", "6 tablespoons extra-virgin olive oil, divided ", "Zest and juice of one lemon (about 3 tablespoons)", "1/2 cup white wine ", "6 garlic cloves, crushed and peeled ", "1/2 cup dry bread crumbs ", "1 tablespoon fresh parsley, chopped ", "1/2 teaspoon dried oregano ", "1/4 teaspoon red pepper flakes, finely chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, season both sides of the fish fillets with 1/4 teaspoon of the salt. In a baking dish big enough to hold all the fillets in one layer, pour in 3 tablespoons of the olive oil, the lemon juice, white wine, and another 1/4 teaspoon of salt. Whisk this mixture together with a fork, and then add the smashed garlic. Add the fillets to the baking dish, turning to coat in the dressing. Arrange them skin-side down. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized bowl, combine the lemon zest, parsley, oregano, red pepper flakes, and the remaining 1/4 teaspoon of salt. Add the remaining 3 tablespoons of olive oil. Toss well, until the bread crumbs are moist. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the bread crumb mixture on top of the fish fillets in a light, even layer. Transfer baking dish to the oven and cook until fish fillets are cooked and the bread crumbs are browned. Baking time will depend on the thickness of the fillets. Mine took less than 10 minutes, though it could take 15 to 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the fillets with the juices left in the baking dish. </p>"}]}