{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110906NicoiseTunaMeltZoom.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French in a Flash", "sandwich", "seafood", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Niçoise Tuna Melt", "link": "https://www.seriouseats.com/recipes/2011/09/french-in-a-flash-nicoise-tuna-melt-recipe.html", "description": "Reinvent the classic salad with this rare-seared tuna steak melt sandwich on baguette, with melted Gruyère, black olive Niçoise tartare sauce, handfuls of arugula, and sweet-tart oven-roasted tomatoes.", "totalTime": "15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Fish", "French", "Sandwiches"], "recipeIngredient": ["1 1-pound tuna steak", "1 tablespoon olive oil", "1/2 teaspoon herbes de Provence", "Salt", "Pepper", "1/2 baguette, halved horizontally", "1 clove garlic, peeled", "5 tablespoons mayonnaise", "2 teaspoons black olive tapenade", "1 teaspoon Dijon mustard", "1 teaspoon white wine vinegar or lemon juice", "1/2 teaspoon anchovy paste", "3 cornchions, finely diced", "16 Niçoise olives, chopped", "1/2 shallot, finely diced", "1 heaping tablespoon chopped flat-leaf parsley", "3 1/2 ounces Gruyère, sliced thinly on a mandoline into about 12 slices", "1 cup baby arugula", "1/2 cup oven-dried tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Preheat the indoor or outdoor grill to its highest setting.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the tuna all over with the olive oil and season it liberally with dried herbes de Provence, salt, and pepper. Sear the tuna on the grill until it’s cooked to your desired doneness. I sear 3 minutes on each side for medium-rare. Set the tuna aside to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tuna is grilling, place the baguette halves cut side down on the grill, just until they're lightly toasted. Slice the edge off the garlic clove and rub the hot bread with the cut side of the garlic. Then, cut each piece of baguette in half so you have 4 pieces for 4 open-faced sandwiches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the mayonnaise, tapenade, mustard, vinegar or lemon juice, anchovy paste, cornichons, olives, shallot, parsley, salt, and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tuna across the grain into 1/2-inch slices. You should get about 12 slices. Fan out the slices of tuna on a baking sheet in stacks of three, and cover each stack with a quarter of the Gruyère. Sit the tuna right under the broiler just until the cheese is melted, about 2 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the black olive tartare sauce between the 4 pieces of baguette.  Then, divide out the arugula and roasted tomatoes among the 4 sandwiches. Use a spatula to lift each tuna and cheese stack on top of a sandwich. Once all 4 sandwiches are assembled, serve right away. Citron pressé is the perfect way to wash it all down!</p>"}]}