{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110925-172070-ruhlmans-pan-sauce-for-roasted-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "gravies", "Michael Ruhlman", "pan sauce", "roast chicken", "Ruhlman's Twenty", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Pan Sauce for Roasted Chicken", "link": "https://www.seriouseats.com/recipes/2011/09/pan-sauce-for-roasted-chicken-recipe.html", "description": "Yesterday we shared a recipe for <a href=\"http://ruhlman.com/about/\">Michael Ruhlman</a>'s dead simple and totally fantastic <a href=\"http://www.seriouseats.com/recipes/2011/09/perfect-roasted-chicken-recipe.html\">Perfect Roast Chicken</a>  from his latest technique-based cookbook, <em><strong><a href=\"http://www.amazon.com/Ruhlmans-Twenty-Techniques-Recipes-Manifesto/dp/0811876438/?tag=serieats-20\">Ruhlman's Twenty</a></strong></em>. We alluded to a particularly wonderful <strong>Pan Sauce for Roasted Chicken</strong> and today we're sharing that recipe with you.", "totalTime": "15 minutes", "recipeYield": "about 3/4 cup", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["<strong>Rustic Sauce</strong>", "1/2 Spanish onion, thinly sliced ", "1 carrot, thinly sliced", "1/2 cup white wine ", "&nbsp;", "<strong>Refined Sauce</strong>", "2 tablespoons butter", "1 shallot, minced", "2 teaspoons minced fresh tarragon", "1 teaspoon minced fresh parsley", "1 teaspoon minced fresh chives ", "Squeeze of lemon (optional)", "2 teaspoons Dijon mustard (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Rustic Sauce:</strong> Put the pan in which you have just roasted a chicken over high heat and cook any remaining skin for 1 minute or so. The juices will cook down and stick to the bottom of the pan. Pour off all but 1 or 2 tablespoons of the rendered fat if you wish. Add the onion and carrot and stir with a flat-edged spoon to coat the vegetables with the fat. Cook until the onion is translucent, 3 to 4 minutes. Add the wine and deglaze the pan, scraping up the caramelized bits. Cook all the wine off (the fat will begin to crackle). Continue to cook until the onion and carrot are caramelized, 1 to 2 minutes. Add 1 cup hot water, deglaze the pan again, and let the water cook down completely. When the crackling begins, stir the onion and carrot until they become nicely caramelized. Add another 1 cup hot water and cook until reduced by about two-thirds.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Refined Sauce:</strong> While the wine and water are cooking down, melt the butter in a small saucepan over medium heat, adding the shallot as the butter melts. Cook the shallot gently until translucent. Remove the pan from the heat. Strain the sauce into the saucepan with the shallots and bring to a gentle simmer. Add the remaining butter and swirl it in the pan until completely incorporated into the sauce. Stir in the herbs. (While the sauce is reducing, separate the legs from the chicken. You can add any juices accumulated on the carving board to the pan sauce.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lemon juice or mustard, if you wish. Arrange the chicken on plates. Holding back the solids in the pan, pour the sauce over the chicken, or spoon the sauce over the chicken.</p>"}]}