{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110412-bread-baking-irish-wholemeal-bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Irish Wholemeal White Bread", "link": "https://www.seriouseats.com/recipes/2011/04/bread-baking-irish-wholemeal-white-bread-recipe.html", "description": "I must be a food marketer's dream, particularly when it comes to baking supplies. I'd heard of <strong>Irish wholemeal flour</strong>, but never saw it for sale until recently when it appeared in the King Arthur Flour catalog. Of course I had to buy it. I know it's traditionally used for hearty loaves, but I decided to use it in a much lighter, much fluffier loaf. I used just enough to give the loaf character.", "totalTime": "3 hours", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch"], "recipeIngredient": ["1 cup lukewarm water", "2 1/2 teaspoons instant yeast", "1 tablespoon sugar", "1/2 cup (2 ounces) Irish wholemeal flour", "1/2 cup (1 ounce) potato flakes", "9 ounces (about 1 3/4 cups) bread flour", "1 large egg", "1 teaspoon salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast, and sugar in the bowl of your stand mixer. Let stand until it begins to get foamy, about 5 minutes, then add the wholemeal flour and potato flakes. Stir to combine and set aside for another 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bread flour and egg, and knead with the dough hook until the dough is smooth (except for the bits of whole wheat) and elastic. Add the olive oil and salt and continue kneading until both are fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the bowl and form into a ball. Drizzle a bit of olive oil into a bowl and place the dough in the bowl. Turn the dough to coat it evenly in the oil, then cover the bowl with plastic wrap and set aside to rise until doubled, about 75 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and sprinkle some cornmeal on a baking sheet. Remove the dough from the bowl, form into a loaf, and place it seam-side down on the prepared pan. Cover with plastic wrap and set aside until doubled in size, about 35 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, slash the loaf as desired, and bake at 350 degrees until nicely browned, about 35 minutes. Let the loaf cool completely on a rack before slicing.</p>"}]}