{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110726-162946-asparagus-peas-beans-and-fennel-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["asparagus", "Cook the Book", "fennel", "Patricia Wells", "peas", "recipe newsletter", "salad", "Salad as a Meal", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Asparagus, Peas, Beans, and Fennel Salad", "link": "https://www.seriouseats.com/recipes/2011/07/asparagus-peas-beans-and-fennel-salad-recipe.html", "description": "This <strong>Asparagus, Peas, Beans, and Fennel Salad</strong> is a lovely and simple take on <a href=\"http://www.patriciawells.com/\">Patricia Wells</a>'s salad savvy. Each vegetable component of the recipe is blanched for optimal flavor and greenness, and assembled right before serving with her genius <strong>Lemon-Chive Dressing</strong>. The dressing is a creamy, bright mix of lemon juice and zest, snipped chives, and heavy cream shaken together to make for a rich, tangy sauce than can work equally well as a dip, spread, or salad dressing.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Cook the Book", "Legumes", "Salads", "Vegetarian"], "recipeIngredient": ["16 spears (about 1 pound) fresh green asparagus, trimmed", "1 tablespoon coarse sea salt", "1 pound slim haricots verts (green beans), trimmed at both ends and cut into 3- inch pieces", "8 ounces peas, fresh or frozen (no need to thaw)", "1 small bulb fennel (about 4 ounces)", "Creamy Lemon-Chive Dressing (recipe follows)", "Fine sea salt ", "Coarse, freshly ground black pepper", "&nbsp;", "<strong>Creamy Lemon-Chive Dressing</strong>", "2 tablespoons freshly squeezed lemon juice", "1/2 teaspoon fine sea salt", "1 cup light cream", "1/3 cup finely minced fresh chives", "Lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Creamy Lemon-Chive Dressing:</strong> In the jar, combine the lemon juice and salt. Cover with the lid and shake to dissolve the salt. Add the cream, chives, and lemon zest. Shake to blend. Taste for seasoning. The dressing can be used immediately. (Store the dressing in the refrigerator for up to 1 week. Shake to blend again before using.) But will it curdle? Given the right circumstances, such as the addition of acids or heat, any milk or cream product will curdle (meaning the curd protein coagulates and forms clumps). The greater the fat content of the milk or cream, the more it will resist curdling. I use a light cream with a 12% fat content, much like what is also called half-and-half, and have never had a problem with curdling when adding lemon juice to the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the salad:</strong> Prepare 4 large bowls of ice water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the asparagus, discarding the woody ends. Trim the tender tips on the diagonal to about 4 inches. Cut the remaining stalks on the diagonal into 3-inch pieces.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the pasta pot with 3 quarts of water and bring it to a rolling boil over high heat. Add the coarse salt and the asparagus stalk pieces. Blanch, uncovered, for 1 minute. Then add the tips (which will cook more quickly) and cook until crisp-tender, about 3 minutes. (Cooking time will vary according to the size and tenderness of the asparagus.) Immediately remove the colander from the water, letting the water drain from the asparagus and reserving the cooking water. Plunge the asparagus into a bowl of ice water so they cool down as quickly as possible and retain their crispness and bright green color. (The asparagus will cool in 1 to 2 minutes. If you leave them longer, they will become soggy and lose crispness and flavor.) Drain the asparagus and wrap them in a thick kitchen towel to dry. (Do not cook them in advance or they will lose their crispness.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water back to a boil, add the green beans, and blanch, uncovered, until very tender, about 4 minutes. (Cooking time will vary according to the size of the beans.) Immediately drain the beans (again reserving the cooking water) and plunge them into the second bowl of ice water so they cool down as quickly as possible and retain their crispness and bright green color. (The beans will cool in 1 to 2 minutes. After that, they will soften and begin to lose crispness and flavor.) Transfer the beans to a colander, drain, and wrap in a thick towel to dry. (The beans can be cooked up to 2 hours in advance. Keep them wrapped in the towel and hold at room temperature.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 1 quart of water to a simmer in the bottom of a steamer. Place the peas on the steaming rack. Place the rack over the simmering water, cover, and steam just until the peas are cooked al dente, 1 to 2 minutes. Immediately drain the peas and plunge them into another bowl of ice water so they cool down as quickly as possible and retain their crispness and bright green color. (The peas will cool in 1 to 2 minutes. If you leave them longer, they will become soggy and begin to lose crispness and flavor.) Drain the peas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mandoline or chef’s knife, cut the fennel into very thin slices, dropping them into the last bowl of ice water to crisp them for about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At serving time, drain the fennel, combine all the vegetables in a large bowl and toss with just enough dressing to coat them lightly and evenly. Taste for seasoning. Arrange on 4 large dinner plates. Season with pepper, and serve. <br />\n</p>"}]}