{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110801-164088-treacle-tart.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["british", "Cook the Book", "Dinah Bucholz", "Harry Potter", "tart dough", "tarts", "The Unofficial Harry Potter Cookbook", "treacle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Cook the Book: Treacle Tart", "link": "https://www.seriouseats.com/recipes/2011/08/treacle-tart-recipe-harry-potter.html", "description": "If you've been reading about the <strong>Treacle Tart</strong> throughout the <em>Harry Potter</em> series, this is your chance to finally taste the real thing.  Adapted from <em><a href=\"http://www.amazon.com/Unofficial-Harry-Potter-Cookbook-Knickerbocker/dp/1440503257/?tag=serieats-20\">The Unofficial Harry Potter Cookbook</a></em> by <a href=\"http://unofficialharrypottercookbook.com/about-the-author/\">Dinah Buchholz</a>, imagine it as a pecan pie minus the pecans.  A sweet, double crusted pie filled with a dark, sticky sweet filling of golden syrup, breadcrumbs, and lemon juice and zest.", "totalTime": "2 hours 45 minutes", "recipeYield": "8", "recipeCategory": ["Cook the Book", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Tart Crust</strong>", "2 1/2 cups all-purpose flour", "1 cup confectioners' sugar", "1/2 teaspoon salt", "2 sticks cold butter, cut into chunks", "2 cold large egg yolks", "1/3 cup cold heavy cream", "1 teaspoon vanilla extract", "&nbsp;", "<strong>Filling</strong>", "1 cup golden syrup or light molasses or corn syrup", "2 1/4 cups fresh bread crumbs", "Grated zest and juice of 1 lemon", "1 egg beaten with 1 tablespoon of water, for brushing the crust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the crust, place the flour, confectioners' sugar, and salt in the bowl of a food processor and pulse to combine.  Scatter the pieces of butter over the mixture.  Pulse until the mixture resembles a coarse yellow meal without any white powdery bits remaining, about 20 pulses.  Transfer the mixture to a large mixing bowl.  Beat the egg yolks with cream and vanilla and pour them into the flour-butter mixture.  Toss with a spatula until the dough clumps together.  If the dough is too dry, add 1 more tablespoon of heavy cream (better too wet than too dry).  Divide the dough in half, form into disks, wrap in plastic wrap, and chill for at least 2 hours or up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before you are ready to roll out the dough, prepare the filling.  Warm the golden syrup in a saucepan until it is runny, or microwave it for 1 minute.  Combine the golden syrup, breadcrumbs, lemon zest, and lemon juice in a mixing bowl and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.  Remove the dough from the refrigerator.  On a floured surface, roll out the larger disk into an 11-inch circle.  Fold it into quarters, brush off excess flour with a pastry brush after each fold, then unfold it into a 9-inch tart pan, easing the sides gently into the pan and pressing the dough down into the fluted edges.  Trim the dough even with the rim.  Roll out the second disk 1/8-inch thick.  Cut the dough into long strips for the lattice topping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the filling into the prepared crust and smooth the top with a rubber spatula.  Lay half the strips of dough over the filling in one direction and the other half in the opposite direction to form a lattice.  Trim the overhang.  Gently brush the beaten egg over the lattice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10 minutes, then reduce the temperature to 375&deg;F and bake for another 25 minutes until the crust is browned and the filling puffs up in the center.  Serve warm with custard or whipped cream.</p>"}]}