{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110824-167221-chocolate-cookie-crust-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "pie crust"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Cookie Crumb Crust", "link": "https://www.seriouseats.com/recipes/2011/09/chocolate-cookie-crumb-crust-pie-recipe.html", "description": "This homemade version of a chocolate cookie crumb crust blows the kind made with packaged cookies away! It's a perfect crust for cheesecakes, crumb crust pies, and tarts. It's a little extra work, but I promise, the pure chocolaty flavor and sweet/salty balance is worth it!", "totalTime": "1 hour", "recipeYield": "1 9 inch pie plate", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["7 tablespoons butter, softened ", "3/4 cup granulated sugar", "1 cup all purpose flour, sifted", "1/2 cup dutch process cocoa powder, sifted", "1/2 teaspoon kosher salt", "3 tablespoon butter, melted and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg; Fahrenheit. Line a baking sheet with parchment paper and set aside. In the bowl of a mixer fitted with a paddle attachment, cream butter and sugar for 4 to 5 minutes on medium to high speed, scraping down the sides of the bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the mixer and add flour, cocoa powder, and salt. Turn the mixer on low and mix until homogeneous, taking care to scrape down the sides and bottom of the mixer. The mixture will feel very dry and crumbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture onto the prepared pan and spread it out so it's approximately 1/2 inch thick. Bake for 10 minutes, rotating halfway. Remove the pan from the oven and stir the crumble around, moving the outer edges into the center to prevent burning. Bake for an additional 10 minutes. Cool completely in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, pulse to pulverize the cookie chunks until they are a small uniform crumbs, about 20 seconds. Transfer the crumbs to a bowl and stir in the melted butter. The crumbs will feel slightly wet. Using your fingers, press the crumbs into the bottom and sides of the pie plate, forming a uniform crust. Refrigerate for 20 minutes before filling.</p>"}]}