{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110630-159343-recipe-chocolate-chip-meringue-%20(2%20of%204).jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate cookies", "chocolate desserts", "meringues"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Chocolate Chip Meringue Cookies", "link": "https://www.seriouseats.com/recipes/2011/07/chocolate-chip-meringue-cookies-recipe.html", "description": "I once thought that I didn't like meringue cookies. The ones from the store always reminded me of styrofoam and never had enough flavor to be worth my time. Then, in culinary school, I started messing around with chocolate left over from a molding lesson and some unused egg whites and I wound up with a meringue cookie to die for. They have a great texture and deep chocolate flavor&mdash;plus, they're gluten-free!", "totalTime": "2 hours, 30 minutes", "recipeYield": "12", "recipeCategory": ["Cookies", "Passover"], "recipeIngredient": ["3 egg whites (see note)", "1/4 teaspoon cream of tartar", "1/2 teaspoon salt", "1 cup sugar", "7 ounces high-quality dark chocolate, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300°F. Begin whipping the egg whites in a stand mixer fitted with a whisk attachment on low speed. As the whites start to look wet and frothy, after about 45 seconds, add cream of tartar and salt and allow it to dissolve with the mixer still on low speed, about 10 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the whites are still frothy, slowly begin to add the sugar in a steady stream with the mixer on low. Once you've added about 1/4 cup of the sugar, increase the speed to medium and continue to gradually add the sugar as the mixer runs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all the sugar has been added, increase the speed to high and whisk until the meringue is thick and glossy and holds firm peaks when you lift the whisk out of it, about 4 minutes. If it's not there yet, continue to whip the meringue on high speed at 30 second intervals and test again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the meringue is at firm peak stage, spoon a tiny dot of it onto each of the four corners of a baking sheet and press the parchment paper liner down over it. This will anchor the parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully fold the chocolate into the meringue with a rubber spatula, taking care not to deflate it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon 1 1/2 inch to 2 inch dollops of the meringue mixture onto the baking sheet, spaced one inch apart. Try to shape the meringues with a spoon so they have crags and ridges all over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the meringues harden on the outside, develop cracks and are only slightly moist on the inside, about 2 hours (this can vary widely depending on your oven). To test for doneness, remove one meringue, allow to cool at room temperature for 5 minutes, then break open to check texture. The center should only be slightly moist at this point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the meringues to cool on a wire rack. Allow them to cool for at least 1 hour (see note) in a dry place before storing them in a container with the lid left only partially on. Moisture and humidity will cause them to melt, so try to use them soon after baking.</p>"}]}