{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110825-167813-fried-sweetbreads-carrot-salad.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["carrots", "Sunday Supper", "sweetbreads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Fried Sweetbreads with Carrot Salad", "link": "https://www.seriouseats.com/recipes/2011/09/fried-sweetbreads-with-carrot-salad.html", "description": "Sweetbreads are the thymus or pancreas (neck and stomatch sweetbread, respectively) of a calf.  They are subtly flavored and have a delicate texture, and are an excellent introduction to those who are a little wary of offal. Sweetbreads are a treat.", "totalTime": "1 hour 30 minutes", "recipeYield": "4", "recipeCategory": ["Mains", "Offal", "Sunday Supper"], "recipeIngredient": ["2 pounds veal sweetbreads", "2 lemons, divided", "kosher salt and cracked black pepper", "4 carrots, grated on the largest wholes of a box grater", "2 scallions, finely sliced", "olive oil", "1 cup breadcrumbs", "1/2 cup all-purpose flour", "3 eggs, beaten", "vegetable oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot with water. Slice a lemon in half, squeeze each half into the pot, then drop in the lemon.  Fill a bowl big enough to accommodate all the sweetbreads with ice and cold water.  Bring pot to a gentle boil and blanch the sweetbreads until just firm.  Keep in mind sweetbreads will cook at different rates depending on their size, so check them often.  The cooking time will vary from 4-10 minutes.  Once each is firm, remove from water with a slotted spoon and place in ice water bath.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once sweetbreads are cool, remove skin and fat, and gently divide sweetbreads into equally sized knobs (about the size of 1/2 a small lemon is my preference).  Season the sweetbreads with salt and pepper and place sweetbreads between two sheet pans, place two large cans on top, and place in the fridge for an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine grated carrots and scallions with juice from remaining lemon, drizzle with olive oil and season to taste with salt and pepper. Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F. Once sweetbreads are pressed, coat each piece with flour, then eggs, them breadcrumbs.  Heat vegetable oil in a large skillet and fry sweetbreads in small batches, keeping the finished sweetbreads warm in the oven.  Serve sweetbreads immediately with carrot salad and lemon wedges, and if available, a large glass of Saison.</p>"}]}