{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011131-135447-red-wine-oxtails.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["oxtails", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sunday Supper: Red Wine and Tomato Braised Oxtails", "link": "https://www.seriouseats.com/recipes/2011/02/red-wine-and-tomato-braised-oxtails.html", "description": "The smell of meat braising on a Sunday afternoon gives the entire house a warm comforting feeling. And oxtails are a cut of meat that are especially well suited for long low braises.  Oxtails have a lot of collagen, which after hours in a flavorful braising liquid, breaks down and becomes tender and succulent.  Red wine adds rich flavor to the meat, and whole tomatoes break down in the sauce adding texture to the final product.", "totalTime": "3 hours 25 minutes", "recipeYield": "4", "recipeCategory": ["Beef", "Sunday Supper"], "recipeIngredient": ["3 pounds oxtails", "olive oil", "3 large shallots, thinly sliced", "1 cup red wine", "1 28 ounce can whole stewed tomatoes", "1 large sprig fresh oregano", "Kosher salt and cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325 &deg;.  Heat large braising dish over medium high heat, drizzle with olive oil, and season oxtails with salt and pepper.  When oil is shimmering add oxtails to braising dish.  Sear oxtails on all sides until deep golden brown.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once oxtails are brown remove from pan and reserve.  Add sliced shallots stirring to scarp up brown bits from bottom of pan until shallots begin to take on some color, about 8 minutes.  Add oxtails back to pan, pour over red wine and can of whole stewed tomatoes and bring to a simmer on stove top.  Cover with lid and place in the oven until oxtails are fork tender, about 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once oxtails are tender remove tails and sprig of oregano from braising liquid and reduce liquid over medium high heat until thick enough to coat the back of a spoon, about 20 minutes.  Warm oxtails in reduced sauce before serving. Serve with fluffy mashed potatoes and more red wine.</p>"}]}