{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110808-164482-smorepie1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bananas", "food holidays", "graham crackers", "s'mores", "sandwich cookies", "whoopie pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Banana Split S'more Whoopie Pies", "link": "https://www.seriouseats.com/recipes/2011/08/banana-split-smore-whoopie-pies-recipe.html", "description": "It combines all of the key flavor points of both the banana split and s'mores, but the delivery is a bit of a curveball: cakey banana-marshmallow cookies are lined with chocolate before sandwiching ice cream flecked with graham cracker bits.", "totalTime": "3 hours", "recipeYield": "12 sandwiches", "recipeCategory": ["Banana", "Cakespy", "Cookies", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 cup (2 sticks) butter, softened", "1 cup sugar", "2 eggs", "1 cup mashed very ripe bananas (2 large or 3 small)", "1/2 cup heavy cream", "1 teaspoon vanilla", "3 cups all purpose flour", "1 1/2 teaspoons baking soda", "1/2 teaspoon salt", "1/2 cup chopped walnuts", "1/2 cup small marshmallows (or large ones, cut into small pieces)", " ", "<strong>For the filling:</strong>", "2 Hershey's Milk Chocolate bars (12 squares of chocolate each)", "12 scoops Neapolitan ice cream (about half of a Half Gallon carton)", "1/2 cup finely crushed graham crackers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two baking sheets with parchment paper; set to the side. Preheat your oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle attachment, mix the butter, sugar, and eggs thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the bananas, cream, and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, baking soda, and salt; stir into the wet mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold in the nuts and marshmallows.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop by rounded tablespoonfuls onto your prepared baking sheets; bake for 10 minutes, or until lightly browned on the edges. The marshmallows may have formed little pock-marks in the cookies; do not panic. They still taste great.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cookies have cooled for about 15 minutes, overturn them on a sheet of waxed or parchment paper so that the bottom sides are up. Place one square of the chocolate bar on top of each cookie-bottom. After about 2-3 minutes, the residual heat should allow the chocolate to melt; spread with a spoon to cover the entire exposed surface of the cookie. Leave them to set for about half an hour, or until the chocolate is firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon a scoop of Neapolitan ice cream (make sure to get a little of each flavor) on one of the cookie halves; place a second on top, chocolate side down, to form a sandwich. Sprinkle crushed graham crackers on the exposed ice cream on the sides. Wrap in waxed paper and place in the freezer for at least an hour to set. Repeat with the remaining cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation: </strong>If you prefer not to use ice cream, substitute two toasted marshmallows for the ice cream in step 8. Sprinkle crushed graham crackers on the sides. Serve warm.</p>"}]}