{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111114-179565-angel-hair-pasta-pie.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Dolci", "Francine Segan", "pasta", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Angel Hair Pasta Pie", "link": "https://www.seriouseats.com/recipes/2011/11/angel-hair-pasta-pie-dolci-recipe.html", "description": "This pie is a wonderful make-ahead dessert. Letting it sit overnight or even for a full day allows the flavors to come together beautifully.", "totalTime": "2 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1½ cups blanched whole almonds ", "¾ cup sugar ", "Grated zest of 1 lemon", "A small handful of finely chopped candied citron or candied orange peel", "1 tablespoon unsweetened cocoa powder ", "½ recipe Pie Crust Dough (recipe follows)", "8 ounces thin fresh egg pasta, such as tagliatelline or angel hair, store-bought or homemade (recipe follows)", "6 tablespoons butter", "6 tablespoons rum ", "Confectioners’  sugar ", "&nbsp;", "<strong>For the Pie Crust Dough:</strong>", "7/8 cup all-purpose flour ", "3/4 cup sugar ", "8 tablespoons butter, softened, cut into pieces", "2 large eggs", "2 large egg yolks ", "Grated zest of 1 lemon", "¼ teaspoon salt ", "2 tablespoons liqueur, such as Maraschino or Sassolino, optional ", "&nbsp;", "<strong>For the Egg Pasta:</strong>", "1 3/4 cups semolina or all-purpose flour", "3 large eggs", "1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Pie Crust:</strong> In a large bowl or on a work surface, mix together the flour, sugar, and butter pieces with a wooden spoon until the mixture resembles coarse sand. Form a well in the center and add the eggs, egg yolks, lemon zest, salt, and liqueur (if using). Gradually stir in the flour mixture, until thoroughly combined. Shape the dough into a ball, wrap in a sheet of plastic wrap, and refrigerate for at least 1 hour before rolling out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Egg Pasta:</strong> Mound the flour in a large bowl. Make a deep well in the center of the mound and add the eggs and egg yolk. Beat the eggs with a fork, then gradually incorporate a little flour at a time. Knead the dough for about 10 minutes, until it feels silky. Working in sections, roll it out with a rolling pin or pass it through a pasta machine, following the manufacturer’s instructions. Cut the pasta into thin strips and toss lightly with semolina flour to keep it from sticking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pie:</strong> Grind the almonds and granulated sugar in a food processor until the mixture resembles coarse sand. Pulse in the lemon zest, candied citron, and cocoa powder until well combined. Divide into 3 portions.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the pie crust dough out into a circle large enough to line a 9- to 10-inch  pie pan and fit it into the pan. With a fork, pierce the bottom and sides of the crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta into 3 portions, with one portion slightly larger than the other two. Line the pie crust with the larger portion of pasta and sprinkle with one portion of the almond mixture. Lift the pasta with the tip of a knife so it is loose and free-form. Do not press the pasta down. Dot the pasta with one third of the butter. Top with another layer of pasta sprinkled with a portion of the almond mixture and more butter. Repeat to make a third layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Loosely cover with aluminum foil, bake for 25 minutes, then remove the foil and continue baking uncovered for another 20 to 25 minutes, until the top is golden and the center set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and immediately sprinkle the top of the pie with the rum. It will hiss and absorb quickly, with most of the alcohol evaporating, leaving just a lovely aroma and flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool to room temperature on a wire rack. Sprinkle with confectioners’ sugar and serve, or, preferably, let stand overnight or for 24 hours before serving.</p>"}]}