{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110403-145523macedoniancrepes.jpg", "author": {"@type": "Person", "name": "Jenny Lee-Adrian"}, "recipeCuisine": "", "keywords": ["crepes", "garlic", "Macedonia", "Macedonian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Macedonian Crepes With Garlic", "link": "https://www.seriouseats.com/recipes/2011/04/macedonian-crepes-with-garlic-pitulici-so-luk-recipe.html", "description": "When my friend Dejan said he was from Macedonia, I realized I knew nothing about the cuisine. <a href=\"http://www.state.gov/r/pa/ei/bgn/26759.htm\">Macedonia</a> gained its independence from Yugoslavia in 1991, but the Balkan cuisine has heavy Turkish influences. A visit to his home for a Macedonian meal meant getting a slice of <strong><em>Pitulici So Luk</em></strong>, sort of a pie made with layered crepes soaked in garlic and olive oil. I polished off my slice in a snap.", "totalTime": "1 hour 15 minutes", "recipeYield": "Makes 16 seven-inch crepes", "recipeCategory": ["Crepe", "Dairy-Free", "Garlic", "Vegan", "Vegetarian"], "recipeIngredient": ["4 cups flour, sifted", "5 cups water", "2 teaspoons salt", "Vegetable or canola oil, as needed", "3 cloves garlic, mashed or minced", "3 tablespoons extra-virgin olive oil", "1/2 cup water", "1/2 teaspoon salt, more to taste", "Freshly ground black pepper to taste", "Parsley, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure and then sift flour to break up lumps. Mix flour, salt and water in a large bowl. Cover and let rest 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mash or mince garlic. Mix garlic, three tablespoons olive oil and 1/2 cup of water in a small saucepan. Bring garlic sauce to a boil and then shut off the heat. Season with salt and freshly ground pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently stir the batter. Heat a 10-inch non-stick saute pan over medium high. Add two tablespoons of oil to the pan. Take a brush or paper towel and spread the oil evenly over the bottom of the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle 1/3 cup of batter into the pan and tilt it so the batter coats the surface. Cook until the batter becomes opaque and the edges lift a little. Take a heat-resistant, flexible spatula and run it along the edges to loosen the crepe. If the crepe still sticks, tap the bottom of the pan on the stove or counter and the crepe will slide around. Flip the crepe using a flat spatula or flip it in the pan in one smooth motion. The crepe is done when bubbles begin to form. Set the crepe on a plate to cool. Make more crepes until you have 8-10 crepes for one pie. You have enough batter to make two crepe pies, or to replace crepes that were mangled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 2 tablespoons of garlic sauce on a plate or pie dish. Lay a crepe over the sauce. Smear 2 tablespoons of garlic sauce on the crepe. Lay another crepe on top. Repeat until you have 8-10 layers. Let the crepe pie soak in the refrigerator for at least 30 minutes. Cut pie into 8 slices. Drizzle more garlic sauce on each slice and garnish with minced parsley. </p>"}]}