{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110114-square-pie-pizza-09.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["pizza", "Pizza Lab", "sicilian pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4285714285714", "ratingCount": "7"}, "name": "Easy No-Roll, No-Stretch Sicilian-Style Square Pizza at Home", "link": "https://www.seriouseats.com/recipes/2011/01/easy-no-roll-no-stretch-sicilian-style-square.html", "description": "I've recently discovered what is easily the best way to make pizza at home for a crowd. It's easy enough that you don't need any kind of stretching or rolling skills to shape the pies, and you don't even need a pizza stone or fancy oven hack to get it to work. <strong>Here's the recipe.</strong>", "totalTime": "3 hours with stand mixer, at least 9 hours without", "recipeYield": "4 to 6", "recipeCategory": ["Pizza", "The Pizza Lab"], "recipeIngredient": ["<strong>For the Dough</strong>", "1 medium russet potato, about 7 ounces ", "15 ounces (3 cups) all-purpose flour", "1/2 ounce (about 2 teaspoons) kosher salt", "1/4 ounce (about 1 1/2 teaspoons) rapid-rise yeast", "1/2 ounce (about 3 teaspoons) sugar", "1/2 cup extra-virgin olive oil", "&nbsp;", "<strong>For the Sauce</strong>", "1/4 cup extra-virgin olive oil", "4 medium garlic cloves, smashed", "1 (28-ounce) can whole peeled tomatoes packed in tomato juice, drained (such as Muir Glen)", "2 teaspoons dried oregano", "1/2 teaspoon red pepper flakes", "2 teaspoons sugar", "4 sprigs basil, leaves and stems reserved separately", "Kosher salt", "1/2 pound (about 2 cups) shredded mozzarella cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough</strong>: Place the potato in a medium saucepan and cover with cold water. Bring to a boil over high heat and cook until cake tester inserted into center meets no resistance, about 15 minutes. Pass through potato ricer into small bowl and allow to cool at room temperature for ten minutes. You should have 6 ounces of riced potato.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine flour, salt, yeast, sugar, and 2 tablespoons olive oil in bowl of stand mixer (see note for mixer-free version). Add 11.25 ounces (about 1 1/3 cup) water to mixer and mix on medium speed until it comes together and no dry flour remains. Add cooled riced potato, increase speed to medium-high and mix until the dough is stretchy and smooth, about 6 minutes. The dough should stick to the bottom of the bowl but pull away from the sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour remaining olive oil into rimmed baking sheet and spread over entire inner surface with hands. Transfer dough to baking sheet and rub top surface with oil until thoroughly coated. Cover with baking sheet with plastic wrap and allow to rise at room temperature until dough has spread out to touch nearly each rim of baking sheet, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce</strong>: While dough is rising, heat olive oil and garlic cloves in 8-inch skillet over medium heat until lightly bubbling. Reduce heat to low and cook until garlic is light brown and tender, about 10 minutes, flipping garlic cloves once during cooking. Transfer garlic cloves to bowl of food processor or blender (without the oil). Add drained tomatoes. Process or blend until roughly pureed, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer garlic-scented olive oil to large saucepan and heat over medium-high heat until shimmering. Add oregano and red pepper flakes and cook, stirring constantly until fragrant, about 1 minute. Add tomato mixture, sugar, and basil stems. Bring to a simmer, reduce heat to low, and cook, stirring occasionally, until slightly reduced, about 30 minutes. Season to taste with salt.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish the Pizza</strong>: 30 minutes before baking, adjust oven rack to middle position and preheat oven to 550°F. Carefully remove plastic wrap from pizza dough. Using oiled hands and being as gentle as possible to maintain air bubbles, push and stretch the dough into the corners of the pan by pressing out from the center and lifting each corner and stretching it beyond the edge of the pan. It should pull back until the pan is just filled with dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread approximately 2/3 cup of sauce over top surface of pizza with back of spoon, leaving 1-inch border all the way around the edge. Sprinkle with half of Parmesan, focusing on edges of crust. Bake for 5 minutes, remove from oven, and spread mozzarella evenly over surface. Dot more tomato sauce in irregular spots on surface (you may have extra sauce). Top with basil leaves and remaining Parmesan.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return to oven and bake until crust is well browned and cheese is melted and lightly browned in spots, 10 to 15 minutes longer. Allow to cool at room temperature for 5 minutes. Transfer to a large cutting board (pizza may stick to pan at some point&mdash;use a spatula to carefully pry it off), cut into 8 or 12 rectangular slices, and serve.</p>"}]}