{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/158208-brick-chicken-smashed-potatoes.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["Brick Chicken", "chicken", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Brick Chicken with Smashed Potatoes", "link": "https://www.seriouseats.com/recipes/2011/07/brick-chicken-with-smashed-potatoes-recipe.html", "description": "Cooking a <a href=\"http://www.seriouseats.com/2010/05/how-to-roast-a-chicken-butterflied-tips.html\">butterflied chicken</a> in a screaming hot pan with a weight on top produces a crunchy skin completely worth the effort of wrapping a brick in a bit of foil.  This recipe seasons the bird simply with salt and pepper and relies on the chicken's own fat and juice to produce a succulent final product.  The smashed potatoes are just as simple, with Greek yogurt and fresh chives.  Lots of beer and a green salad made with summer fresh produce are all you need to round out this meal.", "totalTime": "1 hour 15 minutes", "recipeYield": "4", "recipeCategory": ["Chicken", "Mains", "Sunday Supper"], "recipeIngredient": ["1 3.5-pound chicken", "Vegetable oil", "Kosher salt and cracked black pepper", "6-8 red skinned potatoes", "1/3 cup Greek yogurt", "small bunch chives, finely minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove back from chicken with sharp kitchen shears and flatten by pressing down on the breast.  Season with salt and pepper.  Place the foil-wrapped brick in oven and preheat to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a pot and cover with cold water, bring to a simmer, and cook until soft, about 15 minutes.  Drain and mash with skins on and combine with yogurt and chives, then season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When oven is preheated, heat a decent amount of oil, in a skillet large enough to accommodate the flattened bird, until shimmering.  Add the seasoned bird skin side down and place the hot brick on top.  Cook until the skin is deep golden brown and incredibly crisp, about 10 minutes.  Remove brick and flip chicken over using tongs.  Place in oven and cook until chicken reaches 160°F, about 1 hour.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the chicken to rest for 10 minutes, carve, and serve with smashed potatoes and tall cold beers.</p>"}]}