{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205-182351-serious-eats-corned-beef-hash.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["breakfast", "Cook the Book", "corned beef", "egg", "potatoes", "Serious Eats book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Corned Beef Hash", "link": "https://www.seriouseats.com/recipes/2011/12/serious-eats-corned-beef-hash-recipe.html", "description": "Today we've got a Corned Beef Hash recipe for you courtesy of the <em><strong><a href=\"http://www.amazon.com/Serious-Eats-Comprehensive-Delicious-Wherever/dp/030772087X/?tag=serieats-20\">Serious Eats book</a></strong></em> that we want to eat pretty much anytime&mdash;yes, even on a desert island.  For this recipe <a href=\"http://www.seriouseats.com/user/profile/GoodEaterKenji\">Kenji</a> has taken the hash staples (cubed corned beef and diced potatoes) and added poblano chile, a sizable squirt of ketchup or chile sauce, and runny yolked eggs that nestle right into the pan.  It's a one-dish morning wonder that covers all of your breakfast bases.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Eggs", "Mother's Day", "Potato"], "recipeIngredient": ["4 tablespoons (1/2 stick) unsalted butter ", "2 pounds Yukon Gold potatoes, peeled and cut into a 1/2-inch dice (about 4 cups)", "1/2 pound fully cooked corned beef (about 1 pound raw, simmered for 3 hours until fork-tender), shredded into 1/2-inch pieces", "1 large onion, cut into medium dice (about 1 1/2 cups)", "1 poblano chile, cut into medium dice (about 1/2 cup) ", "2 tablespoons ketchup or chili sauce (for spicier hash)", "1 teaspoon hot sauce (such as Frank’s) ", "Kosher salt ", "Freshly ground black pepper", "4 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a 12-inch heavy-bottomed nonstick or cast-iron skillet over medium-high heat until the foaming -subsides. Add the potatoes and cook, stirring frequently with a rubber spatula or wooden spoon, until they are tender and light golden brown, about 12 minutes total. Add the cooked corned beef, onion, and poblano, and cook, stirring frequently, until the vegetables are beginning to soften, about 4 minutes. Add the ketchup or chili sauce and hot sauce, stir to combine, and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula or a wooden spoon, gently pack the potatoes and hash into the pan, creating a smooth top. Raise the heat to high and cook undisturbed until the bottom layer is deep brown, about 3 minutes. Using the spatula, lift the browned bits from the bottom of the pan and stir into the upper layers. Repack the skillet and repeat three or four times, until the entire skillet is full of well-browned potatoes, about 10 minutes total. Reduce the heat to low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make four indentations in the surface of the hash and break an egg into each one. Season with salt and pepper, cover the pan, and cook until  the eggs are barely set, about  5 minutes. Bring the skillet to a trivet on the table, and serve immediately.</p>"}]}