{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110128-Patatas-Bravas-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["patatas bravas", "potatoes", "spanish", "tapas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Patatas Bravas", "link": "https://www.seriouseats.com/recipes/2011/01/patatas-bravas-tapas-recipe.html", "description": "Patatas Bravas are to tapas bars what chicken wings are to sports bars. Every single one has got them, but other than a few basic similarities, they can vary wildly from spot to spot. Though many feature a spicy, dark red sauce, my favorite version consists of crisply fried cubes of potatoes served with a garlic-laden <em>allioli</em> with a dusting of hot smoked paprika taking the bravas sauce's place.", "totalTime": "30 minutes", "recipeYield": "4", "recipeCategory": ["Potato", "Sides", "Spanish", "Vegetarian"], "recipeIngredient": ["2 pounds russet potatoes, cut into 1- to 3/4-inch cubes", "2 tablespoons distilled white vinegar", "Kosher salt", "2 egg yolks", "2 teaspoons dijon mustard", "2 teaspoons lemon juice, plus more to taste", "3 medium cloves garlic, grated on a microplane (about 2 teaspoons)", "1/2 cup canola oil", "1/2 cup extra-virgin olive oil", "Freshly ground black pepper", "3 cups peanut or canola oil for frying", "2 teaspoons hot smoked paprika"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a medium saucepan and cover with 2 quarts water. Add vinegar and 2 tablespoons salt and bring to a boil over high heat. Cook until potatoes are tender, about 7 minutes. Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine egg yolks, mustard, lemon juice, garlic, and 2 teaspoons water in bowl of food processor. Run processor until homogenous, about 5 seconds. Scrape down sides of bowl. With processor running, slowly add canola oil in thin, steady stream, stopping to scrape down sides as necessary. Sauce should thicken and come together. Transfer sauce to a large bowl set in a heavy pot lined with a towel. Whisking constantly, slowly drizzle in olive oil. Season to taste with salt, lemon juice, and black pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 12-inch non-stick or cast iron straight-sided sauté pan over medium-high heat to 350°F. Add potatoes in single layer and cook, shaking the pan and flipping the potatoes with a spatula or tongs occasionally until golden brown and crisp, about 5 minutes. Remove from heat. Using slotted spoon or wire-mesh spider, transfer potatoes to bowl lined with paper towels. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pile potatoes in a large bowl, drizzle with allioli, sprinkle with paprika and scallions, and serve, passing extra alli-oli tableside. Extra alli-oli will keep in the refrigerator for at least 1 week.</p>"}]}