{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110215-137446-grapefruit-vanilla-curd.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["Crisper Whisperer", "curd", "grapefruit", "Sherry Yard", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Crisper Whisperer: Grapefruit-Vanilla Curd", "link": "https://www.seriouseats.com/recipes/2011/02/the-crisper-whisperer-grapefruit-vanilla-curd-recipe.html", "description": "Life is complicated. I like it that way. Breakfast&mdash;or, if you prefer, dessert&mdash;is no exception. And that's why I don't mind telling you that fruit curd is one of my very favorite foods, even though I hardly have any interest in eating it.", "totalTime": "30 minutes", "recipeYield": "Makes about 2 cups", "recipeCategory": ["Breakfast and Brunch", "Crisper Whisperer", "Desserts", "Grapefruit"], "recipeIngredient": ["2/3 cup sugar", "2 tablespoons grapefruit zest (grated on a rasp)", "Seeds scraped from 1/4 vanilla bean", "3 large eggs", "4 large egg yolks", "1/2 cup freshly squeezed grapefruit juice, from about half a large grapefruit", "1/4 cup freshly squeezed lemon juice, from about 1 large lemon (use Meyer lemon if you can)", "4 tablespoons unsalted butter, chilled and cut into small cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour one inch of water into a medium pot that accommodates your heat-proof glass bowl without letting it touch the water's surface. Bring water to a simmer over medium heat.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor or mortar and pestle, combine the sugar, grapefruit zest, and vanilla seeds, and pulse or mash until well combined and very fragrant.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the grapefruit sugar, eggs and egg yolks in the heatproof bowl. Whisk together for one minute to distribute the sugar. Place the bowl over the pot with simmering water and whisk constantly for about 30 seconds, or until the sugar is dissolved.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the grapefruit juice and lemon juice and cook, whisking frequently, until the curd reads 170° F and has the consistency of sour cream, about 10 minutes. Remove the bowl from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk in the pieces of cold butter one by one until they are completely incorporated. Strain the curd through a fine-mesh sieve into a clean bowl. Serve as a condiment with scones or toast for breakfast, or spooned into tart shells for dessert. Will keep, tightly covered, in the fridge for up to two weeks, or frozen for several months.</p>"}]}