{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110330-127677-Serious-Sweets-RumCake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cakes", "Coca-Cola", "cola", "rum", "Serious Sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Rum and Coke Cake", "link": "https://www.seriouseats.com/recipes/2011/03/rum-and-coke-cake-recipe.html", "description": "Be sure to make the glaze in a high-sided saucepan to avoid a mess in the kitchen, and burning yourself! For the rum, I prefer Nicaraguan Flor de Caña, but you can use your favorite brand....", "totalTime": "3 hours, 30 minutes", "recipeYield": "8 to 10", "recipeCategory": ["Cakes"], "recipeIngredient": ["3 cups all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "1/4 teaspoon ground allspice", "3/4 teaspoon salt", "1 cup heavy cream", "1 1/4 cups dark rum", "1 1/2 (3 sticks) cups plus 2 tablespoons unsalted butter, softened", "2 1/2 cups sugar", "2 teaspoons grated lime zest plus 2 tablespoons juice from 2 limes", "1 large egg yolk plus 3 large eggs", "2 teaspoons vanilla extract", "3/4 cup Coca-Cola", "1/4 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position rack in middle of oven and preheat oven to 350˚F. Spray Bundt pan with nonstick baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together flour, baking powder, baking soda, cinnamon, ginger, allspice, and 1/2 teaspoon salt; set aside. Combine cream and 3/4 cup rum in liquid measuring cup; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With electric mixer fitted with paddle attachment beat 1 1/2 cups butter, 1 1/2 cups sugar, and lime zest on medium-high speed until light and fluffy, about 3 minutes. Add egg yolk and beat until fully incorporated. Add whole eggs, one at a time, beating well after each addition. Add vanilla and reduce speed to low. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add flour mixture in three additions, alternating with the cream-rum mixture, stopping once or twice to scrape the sides and bottom of bowl with a rubber spatula. Mix until smooth, about 20 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan and bake until a toothpick inserted into center of cake comes out clean, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine Coca-Cola, remaining 1/2 cup rum, and lime juice in liquid measuring cup; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place remaining 1 cup sugar and water in a heavy-bottomed, stainless steel, medium saucepan. Bring mixture to a boil over medium-high heat and cook, gently swirling saucepan from time to time, until the sugar turns deep amber and begins to smoke, 10 to 14 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately remove the saucepan from heat, and slowly and carefully pour in rum-and-Coke mixture. The mixture will sputter quite violently—don’t move the saucepan or stir. Once the sputtering has subsided, return saucepan to medium heat, and, with a wooden spoon, stir until smooth, about 5 minutes. Stir in remaining 2 tablespoons butter and remaining 1/4 teaspoon salt. Reserve 1/2 cup glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cake is done, transfer to cooling rack. Poke it all over with a metal or wooden skewer. Pour glaze over the cake and allow it to sit in the pan for 20 minutes before turning out onto a cooling rack.  Brush cake with reserved glaze and cool completely, about 1 hour. Serve.</p>"}]}