{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110705-159665-garlic-scape-tart.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["brunch", "Crisper Whisperer", "egg", "garlic scapes", "ricotta", "tarts", "teff", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Crisper Whisperer: Garlic Scape Tart", "link": "https://www.seriouseats.com/recipes/2011/07/the-crisper-whisperer-garlic-scape-tart.html", "description": "I have an affinity for garlic scape pesto that borders on the unnatural. Although I've previously suggested to you that there are at least <a href=\"http://www.seriouseats.com/recipes/2010/06/the-crisper-whisperer-what-to-do-with-garlic-scapes-recipe.html\">seven worthwhile things to do with garlic scapes</a>, the truth is that I rarely care to do anything with them myself besides whiz them with nuts, cheese, lemon, and olive oil in a food processor and eat them with a spoon. This inclination may be due to the fact that, in my heart of hearts, I seem to believe that I invented garlic scape pesto.", "totalTime": "90 minutes", "recipeYield": "6", "recipeCategory": ["Crisper Whisperer", "Eggs", "Garlic", "Mains", "Vegetarian"], "recipeIngredient": ["<strong>For the Crust </strong>", "1 cup teff flour ", "1 cup unbleached all-purpose flour ", "3/4 teaspoon salt ", "12 tablespoons cold unsalted butter, cut into 1/2-inch dice ", "4 to 5 tablespoons ice water ", "<br>", "<strong>For the Filling</strong>", "1 cup thinly sliced garlic scapes (from 15 to 20 scapes with bud ends removed) ", "2 large eggs, lightly beaten ", "1 cup good quality fresh ricotta cheese (bought or <a href=\"http://www.seriouseats.com/recipes/2010/02/how-to-make-fresh-ricotta-fast-easy-homemade-cheese-the-food-lab-recipe.html\">homemade</a>) ", "1 teaspoon fresh lemon thyme leaves (or 1 teaspoon thyme plus 1/2 teaspoon grated lemon zest)", "1/2 teaspoon sea salt, plus more for sprinkling ", "1/4 teaspoon freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flours and the salt in the bowl of a food processor fitted with the blade attachment and pulse to combine. Add the butter and pulse until the largest pieces are the size of small peas. Sprinkle four tablespoons of the ice water onto the dough. Pulse until the dough begins to hold together. Add the additional tablespoon of water and continue to pulse if the dough is otherwise too dry to hold together. Turn the dough out onto a piece of waxed paper and shape into a disc by pressing quickly and firmly with your hands, repairing any cracks as you go. Wrap the dough in the waxed paper and refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. Roll out the dough into a 12-inch-diameter circle about 1/4-inch thick. Press into the bottom and sides of a fluted 10-inch tart pan with a removable bottom. Roll your rolling pin over the top of the pan to remove any excess dough. Prick the bottom of the dough all over with a fork, then line the dough with parchment paper and fill with dried beans. Place the tart pan on a baking sheet. Bake for 10 minutes, then remove the parchment and beans and bake for 7 minutes more.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the dough bakes, make the filling. Place the scapes, eggs, ricotta, lemon thyme, salt and pepper in a medium bowl. Beat with a fork until well combined. Pour the filling into the partially baked tart shell and return the whole thing to the oven for 30 minutes, until the filling is set. Cool to warm or room temperature before slicing and serving.<br />\r\n</p>"}]}