{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110803-164452-peppermint-humbugs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["candy", "Cook the Book", "Dinah Bucholz", "hard candy", "Harry Potter", "mints", "peppermint", "The Unofficial Harry Potter Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Peppermint Humbugs", "link": "https://www.seriouseats.com/recipes/2011/08/peppermint-humbugs-recipe.html", "description": "With all of the fantastic food happenings in the world of <em>Harry Potter</em> one might assume that meals aren't capped off with a run of the mill after-dinner mint.  Instead, the breath freshener of choice with the Hogwarts set are these <strong>Peppermint Humbugs</strong>.  And making these Potter-centric candies at home might just be the most fun-filled project in <a href=\"http://unofficialharrypottercookbook.com/about-the-author/\">Dinah Buchholz</a>'s <em><a href=\"http://www.amazon.com/Unofficial-Harry-Potter-Cookbook-Knickerbocker/dp/1440503257/?tag=serieats-20\">The Unofficial Harry Potter Cookbook</a></em>.  These vibrantly green, minty sweets are equal parts hard candy and taffy.", "totalTime": "30 minutes", "recipeYield": "20 3/4-inch peices", "recipeCategory": ["Candy", "Cook the Book"], "recipeIngredient": ["1/3 cup water", "1 cup granulated sugar", "1/4 teaspoon cream of tartar", "1/4 teaspoon peppermint extract", "Few drops of green food coloring or other desired color"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray an 8-inch pan with cooking spray and set aside.  In a medium saucepan combine the water, sugar, and cream of tartar and cook over medium-high heat, stirring constantly, until the sugar is dissolved and the mixture begins to boil.  If sugar crystals form on the side of the pan, wash down the sides with a pastry brush dipped in hot water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clip a candy thermometer to the side of the pot.  Reduce the heat to medium and continue cooking, stirring occasionally, until the temperature reaches 260&deg;F.  Remove the pan from the heat.  Add the peppermint extract and food coloring and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the syrup into the prepared pan.  Let the syrup cool for a few minutes.  Put on a pair of clean heavy rubber gloves and spray the gloves with cooking spray.  Rub your hands together to evenly distribute the oil.  If you can tolerate the heat, you can skip the gloves and just oil your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick up the hot candy and begin pulling it, twisting along the rope as you pull.  This will be difficult at first, as the candy will be a mushy gob and will just seem to gloop and droop.  Gradually it will stiffen and be easier to pull.  Fold the rope in half and then half again and twist and pull again.  Repeat and repeat and repeat.  As you pull and twist, the candy will begin to look more opaque  and will take on a pearlescent sheen, very pretty to behold.  When the candy is too stiff to pull, snip the rope at 3/4-inch intervals onto a sheet of parchment paper.  The candies will look like teeny-weeny pillows.  Do not let the humbugs touch each other; instead wrap each piece individually in parchment paper or plastic wrap to prevent sticking.  Store in an airtight container.  The humbugs will begin to recrystalize after two or three days.</p>"}]}