{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111023-175534-macarons610x458-30.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "French", "keywords": ["Cookies", "French", "French Macarons", "macarons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French Macarons", "link": "https://www.seriouseats.com/recipes/2011/10/french-macaron-recipe-how-to-make-macarons.html", "description": "Macarons are so hot right now, it's easy to see why they've captured the attention of sweet fiends and bakers alike. They have a reputation for being fussy, but while they are not the easiest cookie to make, a few with cracked shells still taste just as good as those that emerge from the oven unscarred. This recipe is for plain, basic shells, which have a sweet almond flavor on their own, but largely take on the flavor of your chosen filling.", "totalTime": "3 hours", "recipeYield": "25", "recipeCategory": ["Cookies", "Desserts", "French"], "recipeIngredient": ["125 grams almond flour or whole, blanched and skinned almonds", "225 grams confectioner's sugar (Domino or similar)", "100 grams egg whites", "25 grams superfine sugar", "pinch cream of tartar (optional)", "water soluble color (optional)", "Filling of your choice: <a href=\"http://www.seriouseats.com/recipes/2011/10/swiss-buttercream-recipe-cake-decorating.html\"> buttercream</a> (add extracts to flavor, if desired), ganache, or jam"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the almond mixture: </strong>Using a food processor, grind the almonds or the almond flour with the powdered sugar. If using whole almonds, grind for 30 seconds, then pulse until the mixture looks fine and sandy. If using almond flour, pulse for 45 seconds. Sift the mixture, re-grind any pieces that do not fall through, then sift them through and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the French meringue: </strong>Whip the egg whites with the whisk attachment on medium speed, until they begin to look frothy. If using, add a pinch of cream of tartar. Lower the mixer speed and sheer in the sugar in a thin, even stream, then turn the mixer up to high speed. Whip the meringue to firm, glossy peaks. A big clump of meringue should be caught in the center of the whisk attachment. Add the color, if using, and whisk just to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Combine the two:</strong> Fold the almond mixture into the meringue using a large flexible spatula. Be sure to scrape all of the meringue off the sides of the bowl and mix thoroughly to avoid streaks of meringue in the batter. Continue to fold until a tablespoon-sized dollop of batter dropped into the mixture in the bowl dissipates back into the rest of the mixture in less than a minute. The batter should be supple and not runny.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble and bake:</strong> Preheat the oven to 300&deg;F and turn off the convection fan. Using a pastry bag fitted with a small, round tip, pipe 1 inch circles of the batter onto sheet trays lined with parchment or silicone baking mats. Double the sheet trays for each, and rap the trays hard on the counter repeatedly to smooth out the tops and eliminate crack-inducing air bubbles. Place the doubled sheet trays in the oven leaving some space between the racks, and bake for approximately 18-20 minutes. At the 18 minute mark, test to see if you can pull one away from the parchment/silicone mat cleanly. If you cannot, continue baking and checking the cookies each minute until they release cleanly. Cool the cookies completely on the trays before removing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fill and age:</strong> Match the cookies together by size and fill one side with your chosen filling, and sandwich it with the other half. Place the macarons in a container and double wrap the top with plastic wrap. Allow the macarons to sit in the fridge for at least 2 days and up to one week. Remove them from the fridge and allow them to come to room temp before serving.</p>"}]}