{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111011-174659-ribollita-da-delfina-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Nancy Silverton", "rutabaga", "squash", "The Mozza Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Ribollita \"Da Delfina\"", "link": "https://www.seriouseats.com/recipes/2011/10/ribollita-da-delfina-recipe.html", "description": "While the big, beefy steaks and cellared Brunellos are some of Tuscany's flashier offerings, the region is also home to a homier dish, Ribollita, a filling bowl of minestrone thickened with day-old bread. When Nancy Silverton decided to adapt this wintry soup for <em><strong><a href=\"http://www.amazon.com/Mozza-Cookbook-Angeless-Favorite-Restaurant/dp/0307272842/?tag=serieats-20\">The Mozza Cookbook</a></strong></em> she looked to the restaurant <a href=\"http://www.dadelfina.it/\">Da Delfina</a>, where they do ribollita a little different, transforming it from soup to a crunchy soup-based fritter.", "totalTime": "3 hours", "recipeYield": "8", "recipeCategory": ["Cook the Book", "Squash"], "recipeIngredient": ["1 cup plus 2 tablespoons extra-virgin olive oil, plus more as needed", "2 cups large-diced yellow Spanish onion (about 1 large onion)", "1 cup large-diced peeled rutabaga (about 5 ounces)", "1 cup large-diced peeled carrot (about 1 large carrot)", "1 cup large-diced peeled butternut squash (about 6 ounces)", "1 cup large-diced fennel (about 1/2 large bulb)", "4 teaspoons kosher salt", "3 packed cups coarsely chopped savoy cabbage (about 1/4 medium head) or napa cabbage ", "3 packed cups cavolo nero, stems cut off and discarded, leaves coarsely chopped (about 1 bunch) ", "3 cups canned whole peeled tomatoes (preferably San Marzano) ", "1 or 2 rinds Parmigiano-Reggiano", "1/2 pound stale, crustless bread, broken up into small chunks", "Finishing-quality extra-virgin olive oil ", "Wedge of Parmigiano-Reggiano, for grating "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1/2 cup of the olive oil, onion, rutabaga, carrot, squash, and fennel in a large sauté pan over medium- low heat. Season with 2 teaspoons of the salt, and cook to sweat the vegetables for about 10 to 15 minutes, stirring occasionally to prevent them from browning, until they are tender. Reduce the heat to medium low and let the vegetables sweat in their own juices another 8 to 10 minutes, until they’re very soft. Add the cabbage and cavolo nero, season with another 2 teaspoons of the salt, and cook to wilt the cabbages slightly, about 2 minutes. Reduce the heat to low, add 1/2 cup of the remaining olive oil, and cook without stirring until the juices released from the vegetables have boiled down and the pan is almost dry, about 15 minutes. Break the tomatoes up into the pan. Add the Parmigiano- Reggiano rind(s), and 1 cup of water, and cook the soup at a low simmer for 21/2 to 3 hours, adding another cup of water from time to time so the vegetables are always barely covered with water, until the root vegetables are very tender but not disintegrated. When the vegetables are done, continue to cook until there is no water left in the pan and the soup is stiff enough that you can stand a wooden spoon straight up in it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the soup to a large mixing bowl and remove and discard the Parmigiano-Reggiano rind(s). Add the bread and beat it vigorously into the soup with a wooden spoon so it breaks up and is suspended in the soup. If you have large chunks of bread in the soup, it will cause the patties to fall apart when you fry them. Set the soup aside to cool to room temperature, then cover the bowl tightly with plastic or transfer the soup to an airtight container and refrigerate it overnight or for at least 1 hour. The soup can be made to this point up to five days in advance. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to the middle position and preheat the oven to 400ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop out 1 cup of soup and mold the soup between your palms as you would a hamburger patty, forming a square patty about 1 inch thick, and place it on a baking sheet. Repeat, forming the remaining soup patties in the same way. Cover the baking sheet tightly with plastic wrap and place it in the refrigerator to chill the patties for at least 30 minutes before frying them. The patties can be formed up to one day in advance. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 2 tablespoons olive oil in a large nonstick skillet over medium- high heat until the oil is almost smoking and slides easily in the pan, 2 to 3 minutes. Add two or three of the soup patties, making sure to leave enough room so you can slide a spatula under and flip the patties. Fry the patties on the first side until they’re crisp and almost black in places, 5 to 6 minutes. Carefully turn the patties and cook them on the second side for 2 minutes. Transfer the patties without turning them (the crisp side will be facing up) to a baking sheet and place them in the oven while you fry the remaining patties in the same way, adding more olive oil to the pan as needed, and adding the fried patties to the baking sheet in the oven as they’re done. After the last patties have been fried, leave them all in the oven for 5 minutes to make sure the last batch is warmed through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the patties from the oven and place each one on a plate with the crisp side facing up. Drizzle each serving with 1 tablespoon of the finishing-quality olive oil. Use a microplane or another fine grater to grate a generous layer of Parmigiano-Reggiano over each patty, and serve.<br />\n</p>"}]}