{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002-nick-malgieri-OrangeHazelnut06.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["chocolate", "Guest Star", "hazelnuts", "Nick Malgieri", "Nick Malgieri Week", "orange", "tarts", "Thanksgiving pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Hazelnut Tart Scented with Orange", "link": "https://www.seriouseats.com/recipes/2011/10/chocolate-hazelnut-tart-scented-with-orange-recipe.html", "description": "The tart is a baked ganache (a simple mixture of chocolate and cream), scented with orange zest and rum, topped with chopped hazelnuts, in a sweet hazelnut pastry crust.  A final drizzle of chocolate makes a simple decoration.", "totalTime": "", "recipeYield": "10", "recipeCategory": ["Chocolate", "Nuts", "Orange", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Sweet Hazelnut Pastry:</strong>", "1/3 cup (about 1 1/4 ounces) hazelnut pieces", "3 tablespoons sugar", "1 cup all-purpose flour (spoon flour into dry-measure cup and level off)", "1/2 teaspoon baking powder", "1/4 teaspoon salt", "4 tablespoons (1/2 stick) unsalted butter, cold, cut into 6 pieces", "1 large egg", " ", "<strong>Chocolate Cream Filling:</strong>", "3/4 cup heavy whipping cream", "1/4 cup sugar", "6 tablespoons (3/4 stick) unsalted butter, cut into 6 pieces", "6 ounces bittersweet (not unsweetened) chocolate cut into 1/4-inch pieces", "2 large eggs", "1 tablespoon finely grated orange zest", "1 tablespoon dark rum", "1/2 cup (about 2 ounces) hazelnut pieces, coarsely chopped", " ", "<strong>Finishing:</strong>", "2 ounces bittersweet chocolate melted with 1 tablespoon butter", "One 10-inch fluted tart pan with removable bottom"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the dough, combine the hazelnuts and sugar in the work bowl of a food processor fitted with the steel blade.  Pulse repeatedly to grind the hazelnuts to a powder.  If the hazelnuts are not sufficiently ground, they’ll make the dough break apart when you roll it later.  Scrape down the inside bottom corner of the work bowl with a metal spatula.  Add the flour, salt, and baking powder to the work bowl and pulse several times to mix.  Add the butter and pulse about 10 times to mix the butter in finely.  Add the egg and pulse repeatedly until the dough forms a ball.  Invert the dough to a floured work surface and carefully remove the blade.  Form the dough into a disk and wrap it in plastic.  Refrigerate the dough for an hour or two or up to 2 days before baking the tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to bake the tart, set a rack in the lower third of the oven and preheat to 350&deg;F.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and place it on a floured surface.  Gently knead the dough until it is smooth and malleable.  Shape the dough into a disk and place it on a floured surface.  Flour the dough and roll it to a 12-inch disk.  Fold the dough in half and transfer it to the pan, lining up the fold with the diameter of the pan. Unfold the dough into the pan and press it well into the bottom and sides of the pan. Use a bench scraper or the back of a knife to sever any excess dough at the rim of the pan. Chill the crust while preparing the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the filling, combine the cream and sugar in a large saucepan and bring to a boil over medium heat, whisking occasionally to make sure the sugar dissolves. Decrease the heat to low, add the butter and let it melt.  Remove the pan from the heat and add the chocolate. Gently shake the pan to submerge all the chocolate and wait 1 minute. Whisk smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the eggs with the orange zest and rum in a medium bowl. Whisk in the chocolate mixture in a stream, scraping out the pan with a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the chocolate filling into the prepared crust and scatter the chopped hazelnuts on the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the tart for about 35 to 40 minutes, or until the crust is baked through and the filling is set and slightly puffed.  Cool the tart completely on a rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the chocolate and butter mixture into a paper cone or a non-pleated plastic bag.  Snip the end and streak the top of the tart in a series of random parallel lines with the chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Remove the side of the pan and slide the tart from the metal pan base to a platter. Cut the tart in wedges. Serve some sweetened whipped cream flavored with grated orange zest or some peeled, slices sugared oranges along with the tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To store:</strong> Keep the tart at room temperature on the day it is baked.  Wrap and refrigerate leftovers. Bring to room temperature before serving again.</p>"}]}