{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111028-soufflestep1.jpg", "author": {"@type": "Person", "name": "Linda Miller Nicholson"}, "recipeCuisine": "", "keywords": ["egg", "Modernist Eats", "souffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sous Vide Egg Souffle", "link": "https://www.seriouseats.com/recipes/2011/11/sous-vide-egg-souffle.html", "description": "...", "totalTime": "1 hour", "recipeYield": "4", "recipeCategory": ["Eggs", "Sous Vide"], "recipeIngredient": ["4 eggs, separated (I use duck eggs, but hen will do)", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your sous vide supreme or immersion circulator to 156°F. Establish the mise en plus for the eggs, as you want to work quickly. You will need four double-layered sheets of clingfilm slightly larger than a standard piece of paper, a 3” round cutter (approx), a stand mixer or hand beaters, kitchen twine, and either a half pan (if you have a sous vide supreme) or something small and heavily weighted that you can tie your souffles to (if you are using an immersion circulator). For the sous vide supreme method, be sure your water level is high enough that when you place a half pan inside the supreme (should fit perfectly), it just touches the water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat egg whites and salt to stiff peaks. Place the cutter on a flat surface and lay one sheet of clingfilm over it, making a depression in the film where the cutter is. Spoon beaten egg white into the depression until the cutter is nearly full.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently place the egg yolk on top of the white.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon just enough white over the yolk to cover it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather the clingfilm as though it is a satchel, and tie it tightly just at the top of the egg white so you have a little beggar’s purse.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly repeat for remaining eggs. (For immersion circulator method, tie your beggar’s purses around the heavy objects so they will remain immersed in the water bath.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the soufflés in the water bath (for sous vide supreme, cover with half pan so that pan keeps soufflés immersed, then fill half pan with water for stability). SET A TIMER for 24 minutes.  Turn the oven on broil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once 24 minutes has elapsed, remove the purses from the water bath, quickly and carefully untie them, and place them tie side up on a parchment-lined baking sheet, taking care not to rip the soufflé (a small rubber spatula works well here).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place them on medium rack in oven under broiler and WATCH CAREFULLY. When the soufflé just begins to brown at the top, remove from oven. This could be anywhere from 2-4 minutes. You do not want to overcook or your yolk will lose its runny-ness. Serve immediately over vegetables, with truffles, solo, or any other way you see fit.</p>"}]}