{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/yogurt%20and%20honey%20bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "greek yogurt", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Bread Baking: Yogurt and Honey Bread", "link": "https://www.seriouseats.com/recipes/2011/09/bread-baking-yogurt-and-honey-bread.html", "description": "I use yogurt in bread quite often but usually it's a small addition. This time, the liquid in the recipe is entirely yogurt. To counteract its tartness, I added a generous amount of honey. The resulting bread has a dark brown crust, a soft, moist interior and a small crumb. There's still a hint of tartness, followed by a mild sweetness.", "totalTime": "3 hours, 45 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup Greek-style yogurt", "1/4 cup honey", "2 1/4 cups (10 1/8 ounces) bread flour (divided)", "2 1/4 teaspoons yeast", "1 teaspoon salt", " 2 tablespoons butter at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the yogurt and honey in a microwave container or small pan and heat gently to warm it to room temperature and melt the honey. Stir to incorporate the honey into the yogurt. If it gets too warm, allow it to  cool to room temperature. Put half of the bread flour into the bowl of your stand mixer and add the yogurt mixture and the yeast. Stir to combine. Cover the bowl with plastic wrap and set aside for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the flour and knead with the dough hook and knead until the dough is smooth and elastic. Add the salt and butter and continue kneading until it is completely incorporated. Cover the dough with plastic wrap and set aside until doubled in size, about 90 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325 degrees and sprinkle some cornmeal on a baking sheet. When the dough had doubled, remove it from the bowl and form it into your preferred shape. Place it on the baking sheet seam-side down. Cover with plastic wrap and set aside until doubled in size, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap, slash the loaf as desired, and bake at 325 degrees until the loaf is browned and the internal temperature of the loaf is about 200 degrees - about 40 minutes. Remove the loaf from the oven and let it cool completely on a rack before cutting.</p>"}]}