{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110722-162492-homebew-pilsner.jpg", "author": {"@type": "Person", "name": "Joe Postma"}, "recipeCuisine": "", "keywords": ["homebrewing", "lager", "pilsner"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pilsner (For Intermediate Homebrewers)", "link": "https://www.seriouseats.com/recipes/2011/07/homebrewing-pilsner-for-intermediate-homebrewers-pilsner-beer-recipe.html", "description": "This is an all-grain homebrewing recipe which is written for the intermediate level, brew-in-a-bag homebrewer. Since this beer is a lager style, it's highly recommended that you have a temperature controlled refrigerator you can use for cold fermentation and lagering. If this is your first lager, read this <a href=\"http://drinks.seriouseats.com/2011/07/homebrewing-how-to-brew-lager.html\">lager overview</a> before you begin to make sure you know the process.", "totalTime": "7 to 9 weeks", "recipeYield": null, "recipeCategory": ["Beer and Wine", "Homebrewing"], "recipeIngredient": ["7 pounds pilsner malt, crushed", "8 gallons of water split - blend 4 gallons tap water and 4 gallons distilled water", "1.5 pounds extra light dry malt extract", "1.5 ounces Saaz hops - 90 minutes", "1 ounce Saaz hops - 20 minutes", "1.5 ounces Saaz hops - 5 minutes", "1 ounce Saaz hops - 0 minutes (flame out)", "Two 11.5 gram packages of dry lager yeast (Saflager S-23)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the 7.5 gallon kettle with the mesh bag, fill with 2.5 gallons of tap water and bring to 157&deg;F. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mash-in by slowly adding 7 pounds of pilsner malt into the water and inside the bag. Stir for 2 minutes to prevent balls of grain from clumping together, creating a consistent mash. The temperature should equalize to about 148&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the mash, only uncovering to briefly stir every 20 minutes. Heat 3 more gallons of water to 190&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 60 minutes, mash-out by carefully pouring the 190&deg;F water into the mash, stirring to equalize temperature to about 170&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly raise the grain bag out of the liquid, allowing the wort to drain from the grain. Hold the grain bag above the kettle for 5 to 10 minutes as the wort drains. Top the wort off with water to 6.5 gallons and add 1.5 pounds extra light dry malt extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring wort to a vigorous boil. When the boil begins, add 1.5 ounce Saaz hops in a mesh bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After boiling for 70 minutes, add 1 ounce Saaz hops in a mesh bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After boiling for 85 minutes, add 1.5 ounce Saaz hops in a mesh bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After total of 90 minutes of boil, remove from heat and add 1 ounce Saaz hops in a mesh bag. <strong>Warning:</strong> After wort cools below 180&deg;F everything that touches it should be sanitary, and exposure to open air should be limited as much as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool wort by placing pot in ice bath or by using a wort chiller until it is below 70&deg;F. Transfer to sanitized fermentor (either a carboy or a fermentation bucket) and place in a temperature controlled refrigerator set to 48&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a sanitized auto-siphon racking cane to remove enough wort to take a gravity reading with your hydrometer. Make a note of this number, since you will be using it to calculate the actual alcohol content when it's done fermenting. The reading should be around 1.054. Cover fermentor with a sanitized stopper and airlock. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After wort cools to 50&deg;F, agitate vigorously for at least 5 minutes. Add two 11.5 gram packages of Saflager S-23 yeast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ferment for at least 3 weeks at 48&deg;F</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After fermentation is complete, rack to a sanitized secondary carboy and allow the beer to raise to room temperature for 12 hours for a diacetyl rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lager for 4 to 6 weeks by placing carboy in a temperature controlled refrigerator set to 35&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bottle after lagering is complete, <a href=\"http://drinks.seriouseats.com/2011/02/homebrewing-how-to-carbonate-and-bottle-your-beer.html\">using enough priming sugar for a medium level of carbonation.</a></p>"}]}