{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110517-dt-chicken-catanzaro-style.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["anchovies", "capers", "chicken", "Dinner Tonight", "Lidia Bastianich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken Catanzaro Style", "link": "https://www.seriouseats.com/recipes/2011/05/chicken-catanzaro-style-recipe.html", "description": "This fantastic recipe from <strong>Lidia Bastianich</strong> stuffs the chicken with a mouthwatering mixture of breadcrumbs, parsley, anchovies, capers, lemon zest, nutmeg, and cinnamon.  It's a bit of work to get it prepared, but definitely worth it: cooked covered over the course of 40 minutes or so (it's a cross between saute and braise), the chicken releases its juices into the skillet to make a marvelous sauce.", "totalTime": "60", "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["1 3 1/2 pound chicken", "1/4 cup dry bread crumbs", "1 tablespoon chopped fresh Italian parsley", "3 anchovy fillets, finely chopped", "Zest and juice of 1 lemon", "1/2 teaspoon freshly grated nutmeg", "1/8 teaspoon ground cinnamon", "1/2 cup small capers, drained and chopped", "5 tablespoons olive oil", "1 teaspoon kosher salt", "6 small onions, peeled and halved", "3 tablespoons red wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the chicken breast side up on a cutting board and remove the wishbone (also known as the collarbone, near the neck).  Turn the chicken over and, using kitchen shears or a heavy knife, cut along both sides of the backbone to remove it.  Flatten the chicken and remove the ribcage and breastbone.  In the end, you should have a boneless chicken except for the legs and wings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine bread crumbs, parsley, anchovies, lemon zest, nutmeg, cinnamon, and half the capers.  Drizzle with three tablespoons olive oil.  Spoon two-thirds of the stuffing into the center of the chicken, then fold it closed, pinning with toothpicks where the backbone used to be.  Slide the remaining stuffing under the the breast skin. Pin the chicken closed anywhere else stuffing may spill out using toothpicks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining oil in a large enough skillet to hold the chicken comfortably over medium heat until shimming.  Add chicken, seam side down, and cook, covered, for five minutes, then carefully turn and repeat on the other side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip the chicken once again and scatter the onions around it.  Lower the heat to medium-low, cover, and cook the chicken until onions are tender and plenty of juices have accumulated in the pan, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the chicken, scatter in the remaining capers, lemon juice, and vinegar.  Cover and continue cooking until the chicken is tender and the pan juices have caramelized and concentrated.  Remove chicken to rest, continuing to cook the pan juices and onions, if necessary, to concentrate into a sauce.  Serve chicken with onions and pan juices.</p>"}]}