{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110719-162017-general-tsos-tofu-sub.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Jean Tang", "No. 7", "Sara Reistad-Long", "The Big New York Sandwich Book", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: General Tso's Fried Tofu Sub", "link": "https://www.seriouseats.com/recipes/2011/07/general-tsos-fried-tofu-sub-sandwich-recipe.html", "description": "We've been enamored with Tyler Kord's <a href=\"http://newyork.seriouseats.com/2010/04/no-7-sub-sandwich-shop-ace-hotel-mad-scientist-flatiron-midtown-manhattan.html\">mad scientist sandwiches at No.7 in the Ace Hotel</a> from the get-go.  Daring and totally innovative with plenty of Eastern influence, his subs are just crazy enough to work.  Taking a cue from that stalwart of American-Chinese food, his <strong>General Tso's Fried Tofu Sub</strong> is a best-seller, and coming from a tofu-based sandwich that's really saying something.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Sandwiches", "Tofu", "Vegetarian"], "recipeIngredient": ["<strong>Fried Tofu:</strong>", "1 (1-pound) block firm tofu", "Salt", "1 tablespoon sugar", "1 tablespoon Spanish paprika", "1½ teaspoons garlic powder", "1½ teaspoons onion powder", "3 tablespoons cornstarch", "2 eggs, separated", "2 cups panko breadcrumbs", "4 cups canola, peanut, or other neutral oil ", "&nbsp;", "<strong>Sandwiches</strong>", "4 (6-inch) soft submarine rolls, sliced all the way through lengthwise", "2½ cups Unicorn Sauce (recipe follows)", "2 cups snow pea shoots, frisée, arugula, or other lightweight salad green", "1½ carrots, julienned", "Roasted Onions (recipe follows) ", "1 lime, cut into wedges", "<strong>Roasted Onions</strong>", "1 medium yellow onion, sliced into thick rings ", "1 tablespoon olive oil ", "Salt ", "<strong>Unicorn Sauce</storng>", "1 egg, separated ", "1 teaspoon salt, divided", "1½ teaspoons apple cider", "1½ teaspoons malt vinegar ", "½ jalapeño pepper, roughly chopped", "½ cup sour pickles", "10 to 12 fresh tarragon leaves", "¼ teaspoon liquid smoke", "¾ cup canola oil", "½ 14-ounce can plum tomatoes", "1 tablespoon plus 1½ teaspoons prepared horseradish", "¼ teaspoon sesame oil", "1 tablespoon white vinegar", "1 tablespoon Sriracha", "½ cup extra virgin olive oil", "Kosher salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Roasted Onions:</strong> Preheat the oven to 400°F. Toss the onion rings with the olive oil. Salt to taste. Place the rings on a baking sheet and roast until brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the unicorn sauce:<strong> Place the egg yolk, ½ teaspoon of the salt, apple cider, malt vinegar, jalapeño, pickles, tarragon, and liquid smoke into the bowl of a food processor (if you don’t have a food processor, use a blender on low speed, so that the sauce remains chunky). Pulse until relatively smooth, but not puréed. Slowly drizzle in the canola oil until emulsified.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the canned tomatoes, horseradish, garlic, sesame oil, the other ½ teaspoon of salt, white vinegar, and Sriracha in a blender. Purée at medium speed. Slowly drizzle in the olive oil until emulsified. Combine the two sauces. Season with salt to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the fried tofu:</strong> Slice the tofu into planks about ½ inch thick. You should get a total of 8 planks. Salt both sides of each tofu piece to taste. Combine the dry spices, and sprinkle the mixture liberally over both sides of the tofu. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the cornstarch and egg whites together to create a thick, smooth paste. Place the panko breadcrumbs in a bowl. Place the seasoned tofu planks on your left, the cornstarch slurry in front of you, and the bowl of panko to the right of it, and a clean plate next to that. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One piece at a time, dip a tofu plank into the cornstarch slurry. Let it hang over the bowl for a few seconds, allowing excess slurry to run off. Dip it in the panko, rolling it around with your other hand. Be gentle. Place the breaded tofu plank on the empty plate. Repeat for the 7 remaining tofu planks. Heat the oil. Fry the tofu in small batches until brown, about 1½ to 2 minutes. Drain on paper towels. Salt to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sandwich:</strong> Give the inside of each roll half a generous squirt of the Unicorn Sauce. Divide the greens evenly among the rolls. Add the carrots, roasted onions, fried tofu, and a little more of the sauce. Squirt some lime juice into each sub, or place a dish of lime wedges out for your guests. Cut the subs in half, and serve. </p>"}]}