{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110516-152198-asparagus-with-butter-and-soy.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Andrea Reusing", "asparagus", "Cook the Book", "Cooking in the Moment", "egg", "soy", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Asparagus with Butter and Soy", "link": "https://www.seriouseats.com/recipes/2011/05/asparagus-with-butter-and-soy-recipe.html", "description": "Add the creamy yolk of a gently poached egg to blanched and lightly charred young asparagus dressed in butter and soy&mdash;that's it. Hearty and salty in the best way, the kind of plate that makes it easy to think about becoming a seasonal vegetarian because, really, who needs steak when you have perfect asparagus and runny poached eggs?", "totalTime": "10 minutes", "recipeYield": "2", "recipeCategory": ["Asparagus", "Cook the Book", "Eggs", "Vegetarian"], "recipeIngredient": ["Kosher salt", "White vinegar", "2 large eggs, at room temperature", "1 bunch asparagus (about ½ pound), tough ends snapped off", "2 teaspoons expeller-pressed vegetable oil", "2 tablespoons soy sauce", "5 tablespoons unsalted butter, at room temperature", "Flaky sea salt, such as Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium pot halfway with water and bring it to a boil over high heat. Add enough kosher salt so that the water is as salty as seawater. Meanwhile, fill a medium saucepan halfway with water, add a small splash of vinegar, and bring to a boil over high heat. Reduce the heat so the water simmers gently. One at a time, crack each egg into a small teacup with a handle and then slowly and gently slide the egg into the simmering water—the rim of the cup should actually dip into the water so that the egg doesn’t have very far to fall. Adjust the heat so the water stays at a slow simmer. Cook for 2 to 3 minutes, until the white is just set and the yolk is still runny. Use a slotted spoon to transfer the eggs to a plate.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a 9-inch sauté pan over high heat. When the pan is very hot, drop the asparagus into the boiling water and cook for 25 to 30 seconds, less if the asparagus is very skinny.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the asparagus and gently shake them dry. Add the oil to the hot pan and swirl. Immediately add the asparagus and toss constantly for about 30 seconds, until they become slightly blistered in spots. Do not lower the heat. Add the soy sauce and shake the pan to coat the asparagus; as soon as it evaporates, remove the pan from the heat, add 1 tablespoon water, and immediately follow with the butter. Continue to toss the asparagus until the butter is melted, creating a dark golden brown emulsified sauce.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the sauce has broken, add up to a tablespoon of water and continue to toss until it comes back together. Divide the asparagus and the sauce between two plates, and top each with a warm poached egg. Sprinkle the eggs with a little sea salt.<br />\n</p>"}]}