{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110317-dt-parmesan-chicken-tenders.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["breadcrumbs", "chicken", "chicken tenders", "Dinner Tonight", "healthy", "panko", "panko breadcrumbs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Parmesan Chicken Tenders", "link": "https://www.seriouseats.com/recipes/2011/03/parmesan-chicken-tenders-recipe.html", "description": "This <a href=\"http://www.marthastewart.com/recipe/parmesan-chicken-with-mushrooms-and-brussels-sprouts\">recipe from Everyday Food magazine</a> makes chicken tenders healthier by baking them at high heat instead of frying them in oil.  Using Japanese panko breadcrumbs mixed with Parmesan (airy and flakier) ensures that despite the baking method, they still have a decent crunch. Sure, baking isn't as delicious as frying, but the process is much easier for a quick dinner, and beats the frozen option by a mile.", "totalTime": "35", "recipeYield": "4", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["1/3 cup panko or plain dried breadcrumbs", "1/3 cup grated Parmesan (2/3 ounce)", "1 1/2 pounds fresh chicken tenders, or boneless, skinless breast cut into strips", "3 tablespoons extra-virgin olive oil", "1 teaspoon dried thyme", "Coarse salt and ground pepper", "3/4 pound cremini or button mushrooms, trimmed and halved (quartered if large)", "3/4 pound brussels sprouts, trimmed and halved lengthwise (quartered if large)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450 degrees Fahrenheit.  In small bowl, combine bread crumbs and Parmesan with a pinch of salt.  Season chicken with salt and pepper, then toss in a second bowl with one tablespoon of the oil and thyme.  Allow to sit while preparing other ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, toss mushrooms and Brussels sprouts with remaining tablespoon of oil.  Season with salt and pepper and spread on a baking sheet. Transfer to the oven's lower rack and roast until sprouts are tender, tossing occasionally, 20-25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ten minutes into the cooking time, arrange chicken in 9 x 13 baking sheet in a single layer, and top with breadcrumbs.  Drizzle with a tablespoon of oil, then transfer to top rack of oven.  Roast until cooked through, 15-20 minutes.  Serve with vegetables.</p>"}]}