{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110824-167221-brioche-bread-500x375-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["breads", "brioche"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Basic Brioche", "link": "https://www.seriouseats.com/recipes/2011/08/brioche-bread-recipe.html", "description": "There's nothing else like buttery, impossibly light brioche. This recipe, which has been only slightly adapted from Joanna Chang's book <em>Flour</em>, is a particularly awesome version of the fluffy dough that's the main ingredient in so many delectable treats.", "totalTime": "24-36 hours", "recipeYield": "2 standard loaves", "recipeCategory": ["Breakfast Sweets", "Yeast Bread"], "recipeIngredient": ["120 grams water at 110 - 115 degrees", "3 1/4 teaspoons active dry yeast", "2 1/4 cups (315 grams) all-purpose flour", "2 1/4 cups (340 grams) bread flour", "1/3 cup plus 1 tablespoon (82 grams) sugar", "1 tablespoon kosher salt", "5 eggs, plus one for egg wash", "1 cup plus 6 tablespoons (310 grams) unsalted butter, at room temperature, cut into 1 tablespoon pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the warm water and yeast together and allow it to sit for 2 minutes. The yeast will start to foam as it activates. In a stand mixer fitted with a dough hook, combine all of the ingredients except for the butter. Mix the ingredients by hand for one minute, then beat on low speed for 3 to 4 minutes, until the dough has come together. Stop the mixer and scrape down the sides as needed, pushing the dry ingredients into wet patches. Once the dough has come together, beat on low speed for 3-4 additional minutes. The dough will be stretchy, stiff, and dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On low speed, add the butter one piece at a time, mixing after each addition until it disappears into the dough. Then, continue mixing on low speed for about 10 minutes, stopping the mixer occasionally to scrape down the bottom and sides of the bowl. It is important for all of the butter to be mixed thoroughly into the dough. If necessary, stop the mixer to break up the dough with your hands to help mix in the butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One the butter is completely incorporated, turn up the mixer to medium speed and beat for another 15 minutes, or until the dough becomes sticky, soft, and somewhat shiny. Continue beating until the dough turns smooth and silky. Then, turn the mixer up to medium-high and beat for 1-2 minutes. You should hear the dough making slapping sounds against the sides of the mixer bowl. Test the dough by pulling it and stretching it thin. You want the dough to stretch, but also give a bit. If it feels too loose, easily breaks off into pieces, or looks shaggy, continue to mix on medium speed for 2-3 additional minutes. It's ready when it's smooth and stretchy and can be gathered together and picked up in one piece.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough in a large bowl greased with a little neutral oil and cover it with plastic wrap. Allow the dough to rise for 60 minutes in a warm place before placing it in the fridge overnight to allow the dough to proof and to develop flavor. At this point, the dough may also be frozen or stored in an airtight container in the fridge for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make two brioche loaves, grease two standard loaf pans liberally with butter. Divide the dough into two halves, and shape the dough into loaf shapes by stretching the edges under creating a rounded surface. Place the shaped dough into the loaf pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the loaves lightly with plastic wrap and place them in a warm spot (75-85 degrees Fahrenheit is ideal) for 4-5 hours, or until the loaves have nearly doubled in size. They should have risen to the edge of the pan and have rounded tops. The dough should feel soft, pillowy, and delicate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat to 350 degrees Fahrenheit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk one egg and a pinch of salt together for one minute, then liberally brush the tops of the brioche, taking care not to puncture or deflate the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 35 - 45 minutes, until the tops and sides of the loaves are completely golden brown and the internal temperature reads 210 degrees Fahrenheit. Cool the loaves in the pans for 30 minutes, then turn out onto a cooling rack and let them finish cooling completely. The bread may be stored for up to three days wrapped tightly in plastic, and makes great French toast when stale.</p>"}]}