{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/Chili%20Mac%20-%204.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beans", "cheese", "chili", "comfort", "macaroni and cheese", "Super Bowl chilis"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "5"}, "name": "Cheesy Chili Mac", "link": "https://www.seriouseats.com/recipes/2011/01/cheesy-chili-mac-recipe.html", "description": "Here's a really important question: <strong>why doesn't chili-mac always come with extra cheesy-goo?</strong> It's easy to do. Just make a simple ground beef chili (you can take or leave the canned beans as you see fit), add it to a simple stovetop mac and cheese (evaporated milk makes that really easy), then bake the whole thing off with extra cheese.", "totalTime": "1 1/2 hours", "recipeYield": "10 to 12", "recipeCategory": ["Beef", "Cheese", "Chili", "Mac and Cheese"], "recipeIngredient": ["2 tablespoon vegetable oil", "1 large onion, finely chopped (about 1 1/2 cups)", "1 red bell pepper, diced (about 3/4 cup)", "3 medium cloves garlic, microplaned (about 3 teaspoons)", "3 tablespoons chili powder", "1 tablespoon ground cumin", "2 teaspoons dried oregano", "1 1/2 pounds fresh ground chuck", "1 (28-ounce) can whole peeled tomatoes packed in juice, roughly chopped, juice reserved", "2 (15-ounce) cans kidney beans, rinsed and drained", "1/4 cup hot sauce (like Frank's)", "Kosher salt and freshly ground black pepper", "1 pound elbow macaroni", "4 tablespoons butter", "1 (12-ounce) can evaporated milk", "1 pound grated Cheddar or Jack cheese", "4 ounces finely grated Parmigiano-Reggiano (about 2 cups)", "2 tablespoons chopped cilantro leaves or scallion greens for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the vegetable in a large saucepan over high heat until shimmering. Add the onion and red pepper and cook, stirring frequently, until lightly softened, about 2 minutes. Add the garlic, chili powder, cumin, and oregano. Cook, stirring constantly until fragrant, about 1 minute. Add the beef and cook, stirring occasionally and using a wooden spoon to break up the meat until it is no longer pink, about 7 minutes. Add the tomatoes and their juice, the beans, and the hot sauce. Season to taste with salt and pepper. Simmer until thickened, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust the oven rack to the middle position and preheat the oven to 400°F. Place the pasta in a large saucepan and cover with water by 2 inches. Add 1 tablespoon salt. Heat over high heat until boiling, stirring occasionally to prevent pasta from sticking. Once it comes to a boil, cover pot and remove from heat. Let sit until pasta is fully cooked (see package for cooking time). Drain pasta and return it to the pot. Add the butter and evaporated milk and return the pot to low heat. Add half of the cheese and stir to combine until the cheese is fully melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chili to the pot and stir until well combined. Season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to a large casserole dish (or two smaller ones). Top with remaining cheddar and parmesan cheese. Bake until lightly browned and bubbly, about 20 minutes. Remove from oven, allow to rest 10 minutes, sprinkle with scallions and/or cilantro, and serve.</p>"}]}