{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111118bravetartcasserole.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "brown butter", "casseroles", "maple syrup", "marshmallow", "sage", "sweet potatoes", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Brown Butter and Sage Sweet Potato Casserole", "link": "https://www.seriouseats.com/recipes/2011/11/brown-butter-sage-sweet-potato-casserole-recipe.html", "description": "I can not possibly put down enough words of praise of this dish. I won't even try. Instead, I will say this: it is the best thing I have ever made. (And I have made <a href=\"http://sweets.seriouseats.com/bravetart/\">a whole lot</a> of <a href=\"http://bravetart.com/recipes/\">stuff</a>!)", "totalTime": "24 hours", "recipeYield": "serves 8", "recipeCategory": ["Christmas", "Sides", "Sweet Potatoes and Yams", "Thanksgiving"], "recipeIngredient": ["<strong>Brown Butter Sage Marshmallows </strong>", "3/4 ounce gelatin ", "4 ounces water", "1/4 ounce fresh sage", "4 ounces water", "5 ounces corn syrup", "14 ounces sugar", "3/4 teaspoon salt", "4 ounces unsalted butter (or 3 ounces brown butter)", "powdered sugar for dusting", "&nbsp;", "<strong>Sweet Potato Casserole:</strong>", "8 large sweet potatoes", "2 ounces unsalted butter", "1 ounce maple syrup", "1/4 ounces fresh sage, roughly chopped", "salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>At least one day in advance, make the marshmallows:</strong> </p>\n\n<p>Prepare an 8\" square pan (or a similarly sized pan) by greasing it lightly with pan spray. In the bottom of a stand-mixer bowl, combine the gelatin and water. Whisk with a fork to break up any lumps of gelatin. Set aside. </p>\n\n<p>With a chef's knife, chop the sage as finely as possible. If the sage pieces are very large at all, they will wrap themselves around the whisk attachment during mixing, clump together, and not incorporating into the marshmallow. (Alternately, combine the sage and sugar in a food processor and pulse until the sage has completely ground into the sugar. This also gives the marshmallows a pale green hue.) </p>\n\n<p>In a medium pot, combine the sage, water, corn syrup and sugar. Set over medium heat. Using a heat resistant spatula, stir until the sugar has dissolved and the mixture begins to bubble. Stop stirring. Cook the sugar syrup until a candy thermometer registers 240&deg;. Remove the pot from the heat and cool to 210&deg;. Stir occasionally as the mixture cools to ensure an accurate temperature reading. If the mixture does not cool to 210&deg; before proceeding, the gelatin will not set properly.</p>\n\n<p>While the marshmallow base is cooling, prepare the brown butter. Melt the butter in a small skillet or sauce pan over low heat. Turn the heat to medium and cook until the butter begins to bubble. Continue cooking until it turns a toasty brown. Remove from heat and set aside until needed.</p>\n\n<p>Once the marshmallow mixture has cooled to 210&deg;, pour the syrup into the bowl containing the prepared gelatin. Fit the stand mixer with a whisk attachment and whip on medium speed. Add in the salt. Continue whipping until the mixture has doubled in volume. </p>\n\n<p>Turn the mixer speed to medium low and drizzle in the brown butter, one tablespoonful at a time. If you add the butter too fast, it won't incorporate and the marshmallow mixture may be sufficiently greased to fly right out of the bowl. Please go slowly. Use a spatula to scrape the browned bits from the bottom of the pan to add those too.</p>\n\n<p>Once the butter has incorporated, shut off the mixer. Use a rubber spatula to transfer the marshmallows to the prepared pan. Rap the pan against the counter once or twice to dislodge any air bubbles and to level the mixture.</p>\n\n<p>Wrap in plastic and refrigerate at least 8 hours, preferably overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cut the marshmallows:</strong></p>\n\n<p>Prepare a cutting board by dusting it with powdered sugar.</p>\n\n<p>After removing the marshmallows from the fridge, unwrap and dust the surface with powdered sugar. Use your fingers to pull out the giant marshmallow; transfer to the cutting board. Dust the marshmallow all over in powdered sugar so no sticky surfaces remain.</p>\n\n<p>With a chef's knife, cut the marshmallows into 64 1\" cubes, or whatever size and shape you prefer.</p>\n\n<p>Place the cut marshmallows in a large bowl and dust generously with powdered sugar. Use your hands to toss the marshmallows, ensuring all surfaces have been coated with powdered sugar and none are sticking together.</p>\n\n<p>Transfer the dusted marshmallows to an airtight container. Store at room temperature for about two weeks, or indefinitely in the fridge or freezer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the casserole:</strong></p>\n\n<p>With a vegetable peeler, peel the sweet potatoes. Use a chef's knife to cut the potatoes into uniformly sized chunks. </p>\n\n<p>Put the sweet potatoes in a steam basket, or improvise one by setting a metal colander into a large pot and adding about 1” of water. Sprinkle the potatoes with salt, and cover. Bring the water to a boil (leaving the lid on the entire time), then reduce heat to maintain a steady simmer.</p>\n\n<p>Check the water level periodically, adding more as necessary. After 10 minutes, test the sweet potatoes with a toothpick or skewer to see if they’re tender. If so, shut off the heat; otherwise, continue steaming (adding more water as needed) until they’re very tender.</p>\n\n<p>Meanwhile, melt the butter in a small skillet along with the sage. Brown as before. Shut off the heat and stir in the maple syrup. </p>\n\n<p>Transfer the sweet potatoes to an oven safe dish. Pour the maple butter over and toss gently to coat. Sprinkle generously with salt and pepper to taste. Cover with foil and set aside until ready to finish.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To finish the casserole:</strong> </p>\n\n<p>Set the oven to broil.</p>\n\n<p>Uncover the sweet potatoes. Top generously with sage marshmallows. Place in the casserole on the top or middle oven rack (about 4\" from the heating element) and broil until the marshmallows have turned a deep, foxy brown. Keep a close eye on them; they can go from toasty to burned very quickly. </p>\n\n<p>Serve immediately.</p>"}]}