{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/12312011-184444-sunday-supper-cassoulet-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["beans", "cassoulet", "pork", "sausage", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cassoulet", "link": "https://www.seriouseats.com/recipes/2011/12/cassoulet-pork-beans-sausage-stew-recipe.html", "description": "This recipe uses pork shoulder, sausage, bacon and wine but forgoes the more expensive and/or time-consuming elements of any sort of confit. That does not mean that if you have a surplus of duck confit sitting around it wouldn't be a delicious and welcome addition&mdash;just that it isn't necessary to come out with a fantastic final product.", "totalTime": "4 hours", "recipeYield": "Serves 4 with leftovers", "recipeCategory": ["Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["1/2 pound thick-cut bacon, chopped", "1 1/2 pounds pork shoulder, cubed", "1/2 pound pork sausage", "1 onion, chopped", "2 carrots, chopped", "6 cloves garlic, chopped", "1/2 bunch parsley, chopped", "small bunch thyme", "2 bay leaves", "1 cup white wine", "1 pound great northern beans, soaked overnight then drained", "3 cups stock (or water)", "kosher salt and cracked black pepper", "4 tablespoons butter", "3 cloves garlic, finely chopped", "2 cups breadcrumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325°F.  Heat braising dish over medium high heat, and add chopped bacon.  When bacon is crisp and fat has rendered, remove with slotted spoon, and reserve.  Season cubed pork shoulder with salt and sear in batches. Remove and reserve.  Add sausage to braising dish and sear until brown; remove and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions, carrots and garlic and cook until onions are translucent, about 6 minutes.  Add parsley, thyme and bay leaves, then deglaze with white wine, scraping bottom of pan to remove brown bits.  Add pork shoulder, bacon, and sausage back to the pot, then add soaked beans.  Add stock or water and bring to a simmer, cover with lid, and place in oven for 90 minutes.  Remove cassoulet from oven and remove lid, then place back in oven without lid for another hour, checking occasionally to ensure cassoulet doesn’t dry out.  If it looks like it might begin to dry out, put lid back on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small sauté pan over medium heat, melt 4 tablespoons butter. Add garlic once butter is melted and cook until garlic is soft, about 4 minutes.  Remove from heat and add breadcrumbs. Toss to fully combine and season to taste with salt and cracked black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once it has cooked for an hour with out a lid, remove cassoulet from oven and taste for seasoning.  Heat oven to 400°F.  Scatter seasoned breadcrumbs over top of cassoulet, place in hot oven, and cook until brown and bubbling, about 25 minutes.  Serve with green salad and lots of wine.</p>"}]}