{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110924shuna-buckwheat.jpg", "author": {"@type": "Person", "name": "Shuna Lydon"}, "recipeCuisine": "", "keywords": ["cakes", "chocolate", "Guest Star", "Shuna Lydon", "Shuna Lydon Week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate-Buckwheat-Almond Cake", "link": "https://www.seriouseats.com/recipes/2011/09/chocolate-buckwheat-almond-cake-recipe.html", "description": "Pairing buckwheat with chocolate may seem odd until you try it. Both are smoky, earthy, velvety and strong, making them perfectly suited for the others' company. I like to have a gluten-free chocolate option in my repertoire that's not the clichéd torte, which can be too heavy for a lot of occasions. This cake is also great for laid-back Passover Seders. (But don't make the mistake I did of trying it out on the more Orthodox side of my family.)", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakes", "Chocolate"], "recipeIngredient": ["120 grams natural, skin on almonds", "150 grams dark or unsweetened chocolate", "140 grams sugar, divided in half ", "1/2 teaspoon Kosher or sea salt", "3 tablespoons cocoa nibs", "4 tablespoons Crunchy Buckwheat (<a href=\"http://www.seriouseats.com/recipes/2011/09/crunchy-buckwheat-recipe.html\">recipe here</a>)", "3 tablespoons buckwheat flour", "230 grams egg white, room temperature", "1/4 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Butter desired baking vessels and line with parchment. If you have silicone baking molds they work splendidly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure all ingredients except egg whites, cream of tartar and last 70 grams sugar into one bowl. Grind until very fine in food processor fitted with a blade attachment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with a whisk attachment, whisk egg whites and cream of tartar in very clean bowl on low speed, increasing speed every few minutes until whites are frothy and opaque with small bubbles. Sprinkle in sugar lightly and whisk until meringue is voluminous and shiny and holds relaxed peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula, scrape meringue into a large bowl. Sprinkle ground dry ingredients over meringue in 3 additions and fold until mixture is uniform. Dollop batter into baking vessel and smooth down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake on low to middle shelf of oven with first timer at 10 minutes. If you are baking one cake it will take a bit longer than a lot of small cakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At 10 minutes turn pan around to face opposite direction, and set timer for 10 to 15 minutes. Cakes will soufflé slightly in oven but fall when they come out. Cakes are done when middle bounces back to the touch, cake pulls away from sides of pan or skewer inserted in center comes out dry.</p>"}]}