{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111221-182838-torrone-nougat-candy-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["candy", "pistachios", "torrone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Pistachio Torrone", "link": "https://www.seriouseats.com/recipes/2011/12/pistachio-torrone-candy-how-to-make-recipe.html", "description": "I love torrone, the pillowy soft nougat candy filled with nuts. Traditional torrone, as the Italians intended it, has almonds, but I prefer the flavor and color of pistachio. Torrone is made with a mild honey, which imparts great flavor on its own, but I like to add additional flavor, either the seeds from a vanilla bean, some vanilla extract, or citrus zest.", "totalTime": "12 hours", "recipeYield": "Makes approximately 24 2-inch pieces", "recipeCategory": ["Candy", "Desserts", "Nuts"], "recipeIngredient": ["<a href=\"http://www.amazon.com/Wafer-Paper-x11-Set-100/dp/B00024WNVI\">Edible wafer paper</a> cut to 8x11 inches, enough for 2 layers in pan", "3 large egg whites", "1/2 cup confectioners' sugar", "3 cups granulated sugar", "1/2 teaspoon salt", "3/4 cup honey", "1/4 cup light corn syrup", "1/4 cup water", "2 cups shelled raw pistachios ", "Optional: seeds scraped from 1 vanilla bean, citrus zest, or flavor extracts", "1/3 cup cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Piece together wafer paper, without overlapping, to fit bottom of a jelly roll pan, and set aside. Pour egg whites into bowl of electric mixer fitted with the paddle attachment; set aside. Measure out confectioner's sugar, salt, and optional flavoring, and set each aside. Preheat oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, stir to combine honey, corn syrup, water, and granulated sugar. Wash any excess off the sides of the pan using a pastry brush dipped in water. Place over medium heat; cook until mixture just begins to simmer, about 4 minutes. Clip a candy thermometer onto the side of saucepan; continue to heat, stirring occasionally.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When thermometer registers 310&deg;F, remove the honey mixture from heat. Temperature will rise to 320&deg;F degrees. Stir until temperature drops to 300&deg;F degrees, and quickly make the meringue. Begin to beat the egg whites on medium speed. Once they are frothy, lower the speed, add the salt and confectioner's sugar, then return to medium speed to whisk the meringue to soft peaks. Turn up the mixer speed to high, and, with mixer running, slowly pour honey mixture into egg-white mixture (at this point, whites will double in volume; let stand a few seconds; volume will return to normal).  Beat until mixture thickens (approximately 5 minutes) and begins to stick to beaters. Place the nuts in the preheated oven to warm for a few minutes, then turn off the oven to hold them. Once the nougat has thickened and is getting trapped inside the whisk, remove the mixer bowl from the stand and fold in the nuts with a spatula or big wooden spoon.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust the work surface liberally with cornstarch. Pour mixture onto cornstarch-covered surface; knead about 7 turns. Dust off excess starch. Stretch and roll to fit pan; place mixture in pan. Cover with another layer of wafer paper; let cool on wire rack for a few hours. Cut into slices with an oiled knife or a pair of kitchen shears, store in airtight container, with parchment between layers, for up to 2 weeks.</p>"}]}