{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/392011-141509-sausage-spianach-lasagna.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["lasagna", "sausage", "spinach", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sunday Supper: Spinach and Sausage Lasagna", "link": "https://www.seriouseats.com/recipes/2011/03/spinach-and-sausage-lasagna-recipe.html", "description": "The combination of hot sausage and simply seasoned spinach is something a little different in lasagna form, but also uncomplicated and soothing for a Sunday supper. Be sure to taste the drained spinach for seasoning before you assemble the lasagna; the seasoning is important so that the spinach layers can stand up to the sausage.  Serve this lasagna with a green salad, a bottle of red wine, and some piping hot garlic bread.", "totalTime": "1 hour 3 minutes", "recipeYield": "8 (or 4 with leftovers)", "recipeCategory": ["Lasagna", "Mains", "Pork", "Spinach", "Sunday Supper"], "recipeIngredient": ["1 pound hot Italian sausage", "1 onions, finely chopped", "1 carrot, peeled and grated", "1 rib celery, finely chopped", "2 cloves garlic, minced", "1 28 ounce can crushed tomatoes", "1 pound chopped frozen spinach, thawed", "1 16 ounce container ricotta", "1 pound fresh mozzarella, grated", "16 ounces lasagna noodles (either boiled to package instructions, or oven-ready version)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;.  Remove casing from sausage and crumble into small chunks.  Place in large saucepan and heat over medium high heat; cook sausage until no longer pink, about 12 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove sausage from pan and discard all but one tablespoon leftover sausage fat.  Place pan back over heat and add onions, stirring until onions have begun to brown, about 5 minutes.  Add carrot, celery, and garlic and cook until beginning to soften, about 6 minutes.  Add can of crushed tomatoes and stir to combine.  Bring to a simmer (adding water to loosen if necessary) and cook until flavors have come together, about 30 minutes.  Season with salt and pepper to taste.  Remove from heat and reserve until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In small batches, squeeze spinach until most of the liquid has come out.  Season to taste with salt and pepper, mixing well to ensure even seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bottom of the pyrex dish add 1 cup of sauce.  Place one layer of noodles on top of sauce.  On layer of noodles add a handful of drained spinach and a handful of grated mozzarella, then add ricotta in small spoonfuls.  Repeat with remaining ingredients in alternating layers of sausage sauce, pasta, cheese and spinach, and pasta. The top layer should be sausage sauce topped with grated mozzarella.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using regular lasagna noodles, cover with foil and place in oven until cheese is melted, then remove foil and continue to heat until top of lasagna is bubbling and beginning to brown, about 20 minutes.  If using oven-ready lasagna, cover with foil and bake for 30 minutes, then uncover and cook for an additional 15 minutes, or until cheese has melted and sauce is bubbling.  Allow to cool for 10 minutes before serving.</p>"}]}