{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110512-big-mac-burger-lab-17.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "McDonald's", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "A Better Big Mac", "link": "https://www.seriouseats.com/recipes/2011/05/a-better-big-mac-mcdonalds-burger-recipe.html", "description": "You can build a better Big Mac by taking the great original concept and fixing up everything that's wrong with the execution. The final result is a sandwich that's truly worthy of the title of American Icon. Two all-beef patties...", "totalTime": "45 minutes", "recipeYield": "makes 1 serving", "recipeCategory": ["Beef", "Burger", "Sandwiches", "The Burger Lab"], "recipeIngredient": ["3.2 ounces boneless beef short rib, well-chilled", "1/4 cup finely minced onion", "1 teaspoon onion grated on a microplane grater", "1 1/2 tablespoons mayonnaise", "1 1/2 teaspoons sweet pickle relish", "1 teaspoon yellow mustard", "1 teaspoon sugar", "1/4 teaspoon marmite, vegemite, or Maggi seasoning", "1/4 teaspoon ground turmeric", "1 egg white", "1 whole Wonderbread brand hamburger bun, plus 1 bottom bun", "2 tablespoons sesame seeds (about 600)", "1/4 cup shredded iceberg lettuce", "4 dill pickle slices", "Kosher salt and freshly ground black pepper", "1 slice American cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass beef through meat grinder fitted with 1/4-inch plate twice. Form into two even balls and flatten into 4-inch patties using wet hands against a cutting board. Scrape patties up with thin spatula and place on a sheet of parchment paper. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place minced onion on a double layer of paper towels on a microwave-safe plate and microwave for 10 minutes on low power until mostly dehydrated but not browned. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While onion is dehydrating, combine grated onion, mayonnaise, relish, mustard, sugar, Marmite, and turmeric. Stir to combine and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat toaster oven or broiler to high. Use one finger to spread a very thin layer of egg white over the top of the top bun. Sprinkle with sesame seeds and place under broiler for 30 seconds until set. Set aside. Use a sharp, thin knife to cut off the very bottom of the bottom bun half, creating a single circular piece of bread with cut surfaces on both sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast cut side of top bun and bottom bun, and one side of center bun piece under broiler until light golden brown. Place bottom bun and center bun on cutting board toasted-side up. Spread half of sauce on each. Divide dehydrated onions evenly between bottom and center buns and top with lettuce. Place 2 pickle slices on each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season burger patties with salt and pepper. Heat a heavy-bottomed 10-inch stainless steel or cast iron skillet over high heat until lightly smoking. Add patties and cook without moving until first side is crusty and browned, about 1 minute. Scrape up patties with a stiff spatula and flip. Top one patty with 1 slice cheese. Continue cooking until cooked through, about 1 minute longer. Transfer cheese-topped patty to bottom bun and cheeseless patty to middle bun. Place top bun on top of center, then stack center bun on top of bottom. Serve immediately.</p>"}]}