{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110303-140560-eat-for-eight-bucks-coconut-rice-pilaf-with-almonds.JPG", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["Eat for Eight Bucks", "rice", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Coconut-Vegetable Rice Pilaf with Peppercorns", "link": "https://www.seriouseats.com/recipes/2011/03/coconut-vegetable-rice-pilaf-with-peppercorns-side-dish-recipe.html", "description": "This rice pilaf gets much of its flavor from plain old pantry peppercorns, to the dismay of the rest of my stocked spice rack.  By frying the whole peppercorns in oil at the beginning  you extract much of their flavor; cooking them slowly with the rice mellows them enough to make them palatable. Vegetables, almonds, and fatty coconut milk add to the savoriness of the pilaf, but in large part the deliciousness of this hearty rice is owed to these peppercorns&mdash;which is good news for your wallet, no matter how stocked your spice rack is.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["Eat for Eight Bucks", "Rice", "Sides", "Vegetarian"], "recipeIngredient": ["2 cups white basmati rice", "1 tablespoon canola or other neutral oil", "1 teaspoon whole black peppercorns", "1/2 large onion, sliced (about 1 1/2 cups)", "1 zucchini, trimmed and sliced into thin half moons", "1 carrot, peeled, trimmed, and sliced into thin half moons", "1/2 serrano pepper, seeded, trimmed, and minced", "1/4 cup sliced almonds", "1 1/2 teaspoons salt", "1/2 teaspoon sugar", "1 14-ounce can coconut milk", "1 1/4 cups water", "fresh cilantro for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the rice in several changes of water, until the water that runs off is clear. Let drain while you prepare the rest of the pilaf.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over high heat, warm the oil in an oven-safe Dutch oven with a lid. After about 1 minute, put in the peppercorns and cover with the lid. Let cook for about 1 minute—you’ll hear a few of them popping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the heat to medium and add the onions. Cook for 2 minutes, then add the carrots, the zucchini, and the Serrano. Cook for another 4-5 minutes, until all the vegetables are tender. Add 3 tablespoons of the almonds and cook for about 1 more minute, to toast them lightly. Sprinkle with ½ teaspoon salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice and stir to distribute it with the vegetables. Pour in the coconut milk, the water, and the remaining teaspoon of salt. Return the heat to high, bring to a boil, give it one more stir, then cover and place in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 25 minutes, until the water is fully absorbed. Remove from the oven and leave to steam, lid on, for another 5 minutes. Sprinkle with the remaining tablespoon of almonds and some cilantro. </p>"}]}