{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110415-147554-gwyneth-paltrow-grilled-tuna-rolls.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Gwyneth Paltrow", "My Father's Daughter", "sandwiches", "tuna", "Weekend Giveaway"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "'My Father's Daughter': Gwyneth Paltrow's Grilled Tuna Rolls", "link": "https://www.seriouseats.com/recipes/2011/04/my-fathers-daughter-gwyneth-paltrows-grilled.html", "description": "Have you ever found yourself with an unexpected group of hungry guests and nothing planned for lunch?  Well, you're not alone.  Actress, country singer, blogger and new cookbook author <strong>Gwyneth Paltrow</strong> has found herself in the very same situation, proving that even celebrities find themselves in awkward spots.  These <strong>Grilled Tuna Rolls</strong> from <strong><em><a href=\"http://www.amazon.com/Fathers-Daughter-Delicious-Celebrating-Togetherness/dp/0446557315/serieats-20\">My Father's Daughter</a></em></strong> came into being as an impromptu summer lunch, when Paltrow found herself having to feed a crowd with just a few tuna steaks and a bag of hot dog buns on hand.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Fish", "Sandwiches"], "recipeIngredient": ["<strong>For the Grilled Tuna Rolls:</strong>", "2 tablespoons sweet white miso paste", "1 tablespoon vegetable, sunflower, or rice bran oil", "1 tablespoon light agave nectar ", "1 teaspoon water", "1 tablespoon rice wine vinegar", "Pinch fine salt", "2 1/2-inch-thick tuna steaks or 1 large tuna steak, cut in half horizontally", "2 tablespoons sesame seeds, divided ", "4 hot dog buns", "1 head butter lettuce, leaves separated", "1/4 cup Shallot & Cilantro Vinaigrette, for serving (recipe follows)", "2 tablespoons fresh cilantro leaves, for serving", "<strong>For the Shallot & Cilantro Vinaigrette:</strong>", "2 1/2 tablespoons rice wine vinegar", "1 tablespoon light agave nectar", "1 tablespoon soy sauce", "1/4 cup vegetable or sunflower oil", "A few dashes of hot pepper sesame oil or your favorite hot sauce", "2 shallots, peeled and very thinly sliced", "1 tablespoon roughly chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the grill or grill pan over high heat. Whisk together the miso, oil, agave, water, and rice wine vinegar. Season to taste with salt. Rub the tuna steaks all over with the mixture and place on the grill. Evenly sprinkle 1 tablespoon of the sesame seeds on the fish. Grill on the first side for 3 minutes, flip, and sprinkle the cooked sides with the remaining sesame seeds. Grill for an additional 3 minutes and then remove to a plate. I like the tuna to be just cooked through, but feel free to grill for less time if you prefer it medium or even rare.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, grill or toast the buns. Lay a few lettuce leaves on the bottom half of each bun. Cut the tuna into 1/2-inch slices across the grain and evenly distribute on the lettuce. Drizzle each sandwich with a tablespoon of the vinaigrette, being sure to get plenty of sliced shallots in each spoonful, and sprinkle with the cilantro leaves. Close each sandwich with the top halves of the buns and serve with lots of napkins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Shallot & Cilantro Vinaigrette:</strong> Whisk the vinegar, agave, and soy sauce together.  While whisking, drizzle in the vegetable oil. Add the hot pepper sesame oil to taste and stir in the shallots and cilantro. If you make this in advance, be sure to stir it well before serving.</p>"}]}