{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002-nick-malgieri-FigBars00014.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["bars", "Cookies", "figs", "Guest Star", "Nick Malgieri", "Nick Malgieri Week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sicilian Fig Bars", "link": "https://www.seriouseats.com/recipes/2011/10/sicilian-fig-bars-cookies-cucidati-recipe.html", "description": "Although fig bars are standard American fare, fig-filled cookies are also very traditional in Sicily, where they are called <em>cucidati</em>.  I've decided to merge the two and make a fig bar that is shaped like the industrially-made one, but has some typical Sicilian seasonings in it for extra flavor.", "totalTime": "", "recipeYield": "2 cookie sheets or jelly roll pans lined with parchment or foil", "recipeCategory": ["Cookies"], "recipeIngredient": ["<strong>Dough:</strong>", "3 1/4 cups all-purpose flour (spoon flour into dry-measure cup and level off)", "1/2 cup sugar", "1 1/2 teaspoons baking powder", "1/2 teaspoon salt", "12 tablespoons (1 1/2 sticks) unsalted butter, cold, cut into 12 pieces", "3 large eggs", "2 teaspoons vanilla extract", " ", "<strong>Filling:</strong>", "1 1/2 pounds dried Calimyrna figs", "1 cup water", "1/2 cup apricot preserves", "1/4 cup dark rum, optional", "1 teaspoon ground cinnamon", "1/2 teaspoon ground cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, snip the stems from the figs, and snip each into 5 or 6 pieces into a large saucepan. Add the remaining ingredients and stir well to mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil over medium heat, stirring often, then decrease the heat to low and allow the filling to simmer for about 10 minutes, or until it is thickened, but not extremely thick. Cool the filling and puree it in the food processor with the metal blade. You may refrigerate both the dough and filling for a couple of days before continuing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, sugar, baking powder and salt in the bowl of a food processor fitted with the metal blade. Pulse several times to mix. Add the butter and pulse repeatedly until the butter is finely mixed in, but the mixture is still cool and powdery. Add the eggs and vanilla and pulse repeatedly until the dough forms a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert the bowl to a floured work surface and carefully remove the blade.  Briefly knead the dough 2 or 3 times to make it smooth.  Shape the dough into a rough cylinder.  You may wrap and refrigerate it for several days before preparing the cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to bake the cookies, set racks in the upper and lower thirds of the oven and preheat to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 6 pieces and roll each to a rope about 12 inches long.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one rope on a floured surface and press and roll it to make a rectangle of dough about 4 inches wide and 12 inches long.  Pipe or spoon a sixth of the filling down the middle of the dough, spreading it with a small offset spatula to be about 2 inches wide. Use a pastry brush to paint the exposed dough with water and bring it up all around to enclose the filling.  Pinch the seam closed where the 2 pieces of dough meet.  Turn the filled piece of dough over so that the seam is on the bottom and transfer it to one of the prepared pans.  Repeat with the remaining dough, placing three filled doughs on each pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies until the dough is set and golden, about 15 to 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the cookies on the pans and when they are cool, trim the edges and use a sharp knife to cut them into 2 1/2-inch lengths.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Storage:</strong>  Keep the cookies between sheets of wax paper in a tin or plastic container with a tight fitting cover.</p>"}]}