{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111027-127677-Caramel-Apple-Galette-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["apple desserts", "galette", "pie crust"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ginger Caramel Apple Galette", "link": "https://www.seriouseats.com/recipes/2011/10/ginger-caramel-apple-galette-recipe.html", "description": "Melted caramels lurk in a mound of tart Granny Smith apples bubbling in butter, brown sugar, and vibrant lemon.", "totalTime": "3 hours", "recipeYield": "8", "recipeCategory": ["Fruit Desserts", "Halloween", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Crust</strong>    ", "300 grams (10.5 ounces) all-purpose flour (about 2 heaping cups), plus additional for dusting work surface and rolling pin", "2 tablespoons sugar", "1 teaspoon salt", "150 grams (5.3 ounces) unsalted butter (about 11 1/2 tablespoons), chilled and cut into 1/4-inch pieces", "1 large egg, lightly beaten", "Ice water, as needed (See notes)", "1 large egg yolk", "2 teaspoons heavy cream", "   ", "<strong>For the Filling</strong>    ", "5 medium Granny Smith apples, peeled, cored, and cut into 1/2-inch slices (See Notes)", "4 tablespoons unsalted butter, melted and slightly cooled", "3 tablespoons packed dark brown sugar", "2 teaspoons finely grated zest and 1 tablespoon juice from 1 lemon", "12 caramels, each cut in half", "1/3 cup crystallized ginger, finely chopped", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Combine flour, 1 tablespoon sugar, and salt on a clean, dry, and cool work surface. With a bench scraper, cut in butter until it’s the size of small peas.<br />\r\nAlternatively, combine flour, sugar, and salt in bowl of food processor and pulse to combine. Add butter and pulse until it’s the size of small peas. Transfer mixture to work surface.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form a well in the center of flour mixture and pour in beaten egg and 1 tablespoon ice water. Working quickly, use the bench scraper to combine the ingredients.  If the mixture appears very dry and crumbly, add ice water, 1 teaspoon at a time, until mixture is cohesive but not overly wet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring dough together with lightly floured hands. Pinch off lemon-sized pieces of dough and, working quickly, with the heel of your hand extend on work surface to ensure even distribution of butter. Gather dough together into a disc. Wrap with plastic wrap and refrigerate 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean and dry off counter. Cut two sheets of parchment paper, about 20- by 15 inches each. Place dough between parchment sheets and roll out into a circle about 16 inches in diameter. Transfer dough to a large baking sheet&mdash;if the edges hang off, gently fold them over. Refrigerate 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling and Assembly:</strong> Adjust oven rack to middle position and preheat oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dough has chilled, toss apples with 3 tablespoons butter, brown sugar, lemon zest, lemon juice, caramels, ginger, and salt. Arrange apple mixture on dough, leaving a 3-inch border. Fold dough over filling (if dough is still too firm, allow to rest 5 to 10 minutes until pliable).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush exposed apple filling with remaining 1 tablespoon melted butter. Beat egg yolk and cream together in small bowl. Brush mixture over edges of dough and sprinkle remaining tablespoon sugar all over crust and filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until crust is golden brown and apples are tender, 45 to 60 minutes.  Using parchment, slide galette onto cooling rack and cool until it is warm or room temperature, 30 to 60 minutes.</p>"}]}