{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110617-no-knead-bread-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["baking", "bread", "Jim Lahey", "no-knead bread", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "12"}, "name": "Better No-Knead Bread", "link": "https://www.seriouseats.com/recipes/2011/06/better-no-knead-bread-recipe.html", "description": "I've never seen what I consider to be a really satisfactory explanation of <strong>the science behind the No-Knead Bread recipe,</strong> so I'm gonna try and fill that hole here. And what cool science it is. In 2006, Mark Bittman introduced the world to a recipe from <a href=\"http://www.sullivanstreetbakery.com/history\">Jim Lahey</a> of <a href=\"http://www.sullivanstreetbakery.com/history\">Sullivan Street Bakery</a>, which had a whole bunch of home cooks opening up their Dutch ovens and exclaiming <em>oh my goodness&mdash;I can't believe I just did that!</em> It certainly had me thinking that. Even more interesting to me than <em>that</em> it works is <em>how</em> it works, because by understanding the how, we can then modify the recipe to fit many different baking situations, even improving its flavor.", "totalTime": "3 days", "recipeYield": "Makes 1 loaf, serving 4 to 6", "recipeCategory": ["Bread", "Dairy-Free", "The Food Lab", "Vegetarian"], "recipeIngredient": ["300 grams (10.5 ounces, about 2 cups) bread flour or all-purpose flour", "4.5 grams (about 3/4 teaspoon) salt", "3 grams (about .5 taspoons) yeast", "210 grams (7.5 ounces, about 1 cup minus 1.5 tablespoons) water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, salt, and yeast in a large bowl and whisk to combine. Add water and stir with a wooden spoon until no dry flour remains. Cover bowl tightly with plastic wrap and let sit at room temperature for at least 12 and up to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer container to refrigerator and let sit for at least 3 and up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from refrigerator and turn out onto well-floured surface. Turn once or twice and form into loaf shape. Cover with a well-floured kitchen towel and allow to rise at room temperature for at least two hours, and up to 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust oven rack to lower middle position and preheat oven to 450°F, with a heavy cast-iron or stainless steel Dutch oven placed inside it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When dough has risen, slash top with a floured knife into two or three slashes, 1/2 inch deep. Remove Dutch oven from oven and working quickly, drop dough inside. Place lid back on Dutch oven and return to oven. Bake for 15 minutes, then remove lid and continue to bake until center of bread registers 209°F on an instant read thermometer, about 30 to 45 minutes longer (time will vary depending on shape of loaf).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove Dutch oven from oven and remove loaf of bread with a spatula or tongs. Allow to rest on a wire rack for at least 15 minutes before slicing and serving. Unused bread can be stored at room temperature wrapped in foil for up to three days, though it may need to be refreshed in a hot oven or toaster before serving.</p>"}]}