{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110704-127355-dinner-tonight-shrimp-egg-salad.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "egg", "egg salad", "sandwich", "shrimp", "shrimp salad", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Dinner Tonight: Shrimp and Deviled-Egg Salad Rolls", "link": "https://www.seriouseats.com/recipes/2011/07/dinner-tonight-shrimp-and-deviled-egg-salad-recipe.html", "description": "I like lobster rolls as much as the next guy, but I also live in the Midwest, where they are rare and usually stupendously expensive. I'm just not in the business of throwing down $20 for what amounts to a sandwich more than once a year. While not as ethereal as a perfect lobster roll, these shrimp and deviled-egg salad rolls from <em><a href=\"http://www.amazon.com/Lee-Bros-Simple-Fresh-Southern/dp/0307453596/ref=sr_1_1?ie=UTF8&amp;qid=1309983357&amp;sr=8-1\">The Lee Bros. Simple Fresh Southern</a></em> might be the perfect low-brow alternative for someone like me.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Egg Salad", "Sandwiches", "Shrimp"], "recipeIngredient": ["2 ½ teaspoons kosher salt", "1 pound headless large shell-on shrimp", "6 large eggs", "2 ounces thick-cut bacon, finely sliced", "6 tablespoons mayonnaise ", "1 tablespoon hot sauce (such as Tabasco)", "2 teaspoons Dijon mustard", "freshly ground black pepper", "2 red tomatoes, thickly sliced ", "4 leaves butter lettuce", "4 hot dog buns ", "2 scallions, finely sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring two quarts of water and two teaspoons of salt to a boil in a large pot set over high heat. Turn off the heat and immediately add the shrimp. Cook until shrimp are pink-orange and slightly firm, one to two minutes. Remove with a slotted spoon, and rinse under cold water in a colander until cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the pot of water back to a boil over high heat. Then reduce heat to low and carefully lower the eggs into the pot with the slotted spoon. Simmer the eggs for exactly 14 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, peel and chop the shrimp, and then add them to a large bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bacon to a large skillet set over medium heat. Cook, stirring occasionally, until bacon is crisp, four to five minutes. Remove bacon with a slotted spoon and drain on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When eggs are done cooking, remove with the slotted spoon and place in a colander. Rinse under cold water until cool enough to handle. Then peel the eggs, discard the shells, and then cut each on in half. Scoop out the cooked yolks with a small spoon and set aside. Coarsely chop the egg whites, and then add them to the bowl with the shrimp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the yolks through a mesh strainer into a medium-sized bowl. Add the mayonnaise, hot sauce, mustard, and remaining ½ teaspoon salt. Whisk mixture aggressively, until it has the texture of cake batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the yolk mixture into the bowl with the shrimp and egg whites. When evenly coated, season mixture with more salt and pepper, if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one leaf of lettuce and two slices of tomato in each hot dog bun, and then add about one cup of the shrimp deviled-egg salad. Garnish each roll with the cooked bacon and sliced scallions.  </p>"}]}