{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110818-pizza-lab-greek-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["greek pizza", "pizza", "Pizza Lab", "The Food Lab", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "New England Greek Style Pizza", "link": "https://www.seriouseats.com/recipes/2011/08/new-england-greek-style-pizza.html", "description": "Note: You don't have to use a cast iron pan for this - dedicated pizza pans, cake pans that you don't mind ruining, or a nonstick skillet will work just fine. You'll end up with more sauce than you need,...", "totalTime": "Overnight", "recipeYield": "4 to 6 (two 10-inch pizzas)", "recipeCategory": ["Bread", "Pizza", "The Pizza Lab", "Vegetarian"], "recipeIngredient": ["<strong>For the Dough</strong>", "400 grams (14 ounces, about 2 1/2 cups) bread flour", "4 grams (about 1/2 teaspoon) instant yeast", "8 grams (about 1 tablespoon) kosher salt (or 1 1/2 teaspoons table salt)", "2 tablespoons extra virgin olive oil", "260 grams (about 1 cup plus 2 tablespoons) water", "&nbsp", "<strong>For the Sauce</strong>", "2 tablespoons extra virgin olive oil", "2 medium cloves garlic, grated on a microplane grater (about 2 teaspoons)", "1 teaspoon dried oregano", "1/4 teaspoon red pepper flakes", "3 ounces tomato paste", "1 (28-ounce) can crushed tomatoes", "Kosher salt", "&nbsp;", "<strong>To assemble</strong>", "2 tablespoons vegetable shortening, melted", "2 tablespoons extra-virgin olive oil", "8 ounces freshly grated whole milk mozzarella", "8 ounces freshly grated white cheddar", "2 ounces Parmigiano-Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, yeast, and salt in a large bowl and whisk until homogenous. Add oil and water and stir with wooden spoon until combined. Cover with plastic wrap and let rise at room temperature at least 8 hours and up to 24.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, turn dough out onto lightly floured surface and dived in half. Form balls with each half, then place into lightly oiled bowls, coating all surfaces of the balls with oil. Cover with plastic wrap and set aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the sauce. Heat olive oil in a medium saucepan over medium-high heat until shimmering. Add garlic, oregano, and pepper flakes and cook for thirty seconds until fragrant. Add tomato paste and cook, stirring constantly for 1 minute. Add two thirds of crushed tomatoes and stir to combine. Reduce heat to lowest setting and cook, stirring occasionally for 1 hour. Stir in remaining tomato sauce and season to taste with salt. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stretch the dough: Coat two 10-inch cast iron skillet (or cake pans/oven-safe nonstick pans) with 1 tablespoon each of shortening and olive oil. Transfer dough balls one at a time to a large cookie sheet and stretch out into a 10-inch circle. Transfer the circle to the greased skillet. Cover and allow to rise for 1 hour at room temperature. Meanwhile, adjust the oven rack to the bottom position and preheat oven to 500°F. Combine the cheeses in a large bowl and cover until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When dough has risen, top each circle with 1 cup of sauce (you will have leftover sauce), spreading it to within half an inch of the edge. Divide grated cheese evenly between the two pies, spreading it all the way to the edge of each pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake pies until top is bubbly and golden brown in spots and cheese has charred around edges, 15 to 20 minutes. Remove pizzas from oven and using a thin metal spatula, release the edges from the pans. Carefully lift pies to check for doneness underneath. If you'd like a darker bottom crust, set each pie directly over a medium-low flame and cook, turning occasionally until desired level of doneness is reached.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide pizza onto cutting board, allow to rest two minutes, slice, and serve.</p>"}]}