{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110809PennePimentEspelette.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French in a Flash", "pasta", "pasta sauce", "sauces", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Penne with Piment d'Espelette", "link": "https://www.seriouseats.com/recipes/2011/08/french-in-a-flash-penne-with-piment-despelette-recipe.html", "description": "Piment d'Espelette is a kind of delayed reaction chili&mdash;it gently hits you a beat after you expect it. It goes perfectly with tomatoes, like in this fresh tomato sauce with penne, mint, and basil.", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "French", "Pasta", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1 1/2 tablespoons olive oil", "1 shallot, diced", "1 big clove garlic, thinly sliced", "1/2 teaspoon piment d'Espelette", "6 vine ripe tomatoes, peeled and seeded and puréed", "Kosher salt", "10 leaves of fresh mint", "10 leaves of fresh basil", "1 pound penne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To peel tomatoes, core them, and draw an X in the skin at the bottom of the tomato with the tip of a sharp paring knife. Drop the tomatoes in boiling water for 30 seconds, then shock in very cold water.  Peel the skin away from the flesh. Cut the tomatoes in half, and squeeze the seeds out of the flesh. Put the tomato flesh in a food processor, and blitz till smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepot, heat the olive oil over medium heat. Add the shallots and garlic, and sauté, stirring often, until soft and fragrant: about 3 minutes. Add the Piment d’Espelette and stir into the hot oil. Add the tomato flesh purée, season well with salt, and cook on medium heat, uncovered, for 15 minutes. Add the mint and basil leaves, and simmer on low heat for a final 15 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sauce is cooking, bring a large pot of salted water to boil.  When the sauce has about 10 minutes left, drop the penne into the water, and cook until al dente. Drain the pasta, and add the penne and the sauce to the larger of the two pots. Cook together on medium-low heat, stirring continuously, for another minute or two, until the pasta absorbs some of the sauce. Serve right away.</p>"}]}