{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101214-dry-fry-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "green beans", "pork", "sichuan", "wok", "Wok Skills 102"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sichuan Dry-Fried Long Beans", "link": "https://www.seriouseats.com/recipes/2011/01/sichuan-dry-fried-green-beans-recipe.html", "description": "[Photograph: Robyn Lee] Note: Yard-long beans are slightly starchier and more robust than standard American green beans. You can find them year-round in Asian supermarkets. If unavailable, the second choice is dark green French beans (sometimes labeled haricôts verts). Regular...", "totalTime": "45 minutes", "recipeYield": "4 as a side dish", "recipeCategory": ["Chinese", "Legumes", "Pork"], "recipeIngredient": ["1 cup peanut oil", "1 pound yard-long beans or French green beans, rinsed, carefully dried, and cut into 2-inch pieces (see note)", "1/4 pound minced pork", "2 tablespoons finely minced Sichuan preserved mustard root (see note)", "1 medium clove garlic, minced (about 2 teaspoons)", "1 tablespoon fermented chili bean sauce", "1/2 teaspoon sesame oil", "1 teaspoon sugar", "1 teaspoon soy sauce", "1 teaspoon chinkiang vinegar", "2 teaspoons toasted and ground Sichuan peppercorn (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in wok over high heat to 400°F, about 3 minutes. Carefully add green beans and cook, stirring occasionally until beans are tender and thoroughly blistered. Transfer beans to paper towel-lined plate with slotted spoon. Discard all but 2 tablespoons oil from wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat over high heat until smoking. Add pork and cook, breaking up with spoon and stirring constantly until no longer pink, about 30 seconds. Add preserved vegetable and garlic and stir-fry until fragrant, about 15 seconds. Return beans to wok, add chili bean sauce, sesame oil, sugar, soy sauce, vinegar, and half of peppercorns, and stir fry until ingredients are well-coated in sauce, about 30 seconds. Transfer to plate, sprinkle with remaining peppercorns, and serve immediately.</p>"}]}