{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110615-156476-rhubarb-orange-vanilla-jam-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Jam", "oranges", "Preserved", "rhubarb", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Rhubarb Orange Vanilla Jam", "link": "https://www.seriouseats.com/recipes/2011/06/preserved-rhubarb-orange-vanilla-jam-recipe.html", "description": "This recipe combines rhubarb with chopped orange peels, fresh orange juice, and the seeds of a vanilla bean. The results taste a bit like rhubarb pie shot through with orange marmalade. The sweet-tart flavor of this jam would complement any dark baked goods like gingerbread or spice cake.", "totalTime": null, "recipeYield": "makes six (8-ounce) jars", "recipeCategory": ["Breakfast Sweets", "Desserts", "Edible DIY", "Orange", "Rhubarb"], "recipeIngredient": ["6 cups granulated sugar", "2 large navel oranges", "5 cups finely chopped rhubarb", "1 vanilla bean", "One (1.75-ounce) package regular powdered pectin", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place 6 half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off the heat and allow the jars to rest in the hot water. Meanwhile, put the bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from the heat and allow the bands and lids to rest in the hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the sugar into a large bowl and set aside. Wash one of the oranges and remove the rind in quarters. Thinly slice the rinds lengthwise, cutting away any excess pith. Chop the strips of rind crosswise into small pieces. Squeeze juice from both oranges. You should have about 1 cup. If you don't, make up the difference with water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the orange rinds, orange juice, and rhubarb in a large, heavy-bottomed pot. Split the vanilla bean lengthwise and scrape the seeds into the pot. Add the vanilla bean to the pot. Sprinkle the pectin evenly over the fruit and bring to a full boil over medium-high heat, stirring frequently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar to the pot all at once, stirring until dissolved. Add the butter and continue to cook, stirring constantly, until the mixture comes to a full rolling boil. Boil hard for one minute. Remove the pot from the stove and skim any foam from the surface of the jam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into the hot sterilized jars, leaving 1/4-inch headspace. Wipe the rims of the jars, cover with the lids, and screw the bands on until just barely tight. Place the jars on a rack in pot and cover completely with water. Cover the pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover the pot, and allow the jars to rest for five minutes. Remove the jars and allow them to rest undisturbed on the countertop for six hours or overnight. </p>"}]}