{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110325-143740-miso-butter-pecan-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["butter", "butter pecan", "frozen desserts", "ice cream", "miso", "pecans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scooped: Really Buttery Pecan Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/03/miso-butter-pecan-ice-cream-recipe.html", "description": "For most of my life, I never got the point of butter pecan ice cream. It always seemed like less than the sum of its parts: wan pecans poking out of bland vanilla ice cream? No thanks. When I started making ice cream, recipes for butter pecan didn't give me much hope. Three tablespoons of butter per quart? <em>One?</em> I had my doubts that the results would be all that satisfying.", "totalTime": "45 minutes, plus an overnight chill", "recipeYield": "8 to 10 (makes a generous quart)", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats", "Nuts"], "recipeIngredient": ["9 tablespoons unsalted butter, divided", "1 cup plus one tablespoon packed dark brown sugar, divided", "3 cups half and half (or 1 1/2 cups cream and milk)", "5 tablespoons shiro miso paste", "6 egg yolks", "1 tablespoon vanilla extract", "1/4 teaspoon cinnamon", "1 1/2 cups pecans", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, melt 8 tablespoons butter over medium-low heat, then stir in brown sugar. Increase heat to medium-high and cook sugar until it just begins to smell toasted and smokey, 2 to 3 minutes. Add half and half and miso paste, whisking to combine. Bring to a bare simmer, whisking frequently. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While dairy mixture is heating, whisk egg yolks well in a medium bowl. When dairy just begins to bubble, add one third of mixture to yolks, one ladleful at a time, whisking constantly. Then transfer yolk mixture to saucepan and whisk to combine. Reduce heat to low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook custard, stirring frequently, until it coats the back of a spoon and a swiped finger leaves a clean line. Remove from heat and whisk in vanilla and cinnamon. Pour through a strainer into an airtight container and chill overnight before churning according to manufacturer's instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While ice cream is churning, toast pecans in a large saucepan over medium-high heat with remaining tablespoon of butter and brown sugar. Stir frequently and cook until pecans smell toasted and darken slightly in color. Add salt to taste and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ice cream is finished, transfer to a large airtight container or a bowl. Stir in pecans, then transfer to airtight container to chill for 4-5 hours; ice cream will be very soft out of the churn and needs time to set. Stir ice cream well before serving, as pecans may have sunk to the bottom.</p>"}]}