{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111110-dt-ground-pork-chile-verde.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chile verde", "Dinner Tonight", "ground pork", "pork", "tomatillos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quick Chile Verde", "link": "https://www.seriouseats.com/recipes/2011/11/quick-chile-verde-recipe.html", "description": "The secret to this quick, easy weeknight chile verde recipe is using ground pork instead of pork shoulder. It comes together in under an hour. Use the broiler to char the tomatillos and roast the garlic to create the sweet, smokey base.", "totalTime": "55", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Pork"], "recipeIngredient": ["1 pound tomatillos, husked, rinsed, and halved", "5 garlic cloves, not peeled", "2 jalapenos, seeds and ribs removed, chopped", "1 Anaheim or Poblano chile", "1/2 bunch cilantro leaves, cleaned and chopped", "Salt and pepper", "2 tablepoons olive oil", "1 1/4 pound ground pork", "2 yellow onions, chopped", "1/2 tablespoon dried oregano", "2 cups chicken stock", "Pinch of ground cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Under a pre-heated broiler on a small baking sheet, roast the tomatillos skin-side up, 3 of the unpeeled garlic cloves, and the poblano chile, 5-7 minutes total.  Turn the poblano chile a few times to blacken all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slip the skins off the poblano chile and remove the stem, and slip the garlic skins off the roasted cloves. In a blender, combine poblano, roasted garlic, the tomatillos with their skins, any roasting juices in the pan, as well as the jalapenos, cilantro, and a pinch of salt.  Blend on high until pureed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat the olive oil in a heavy soup pot (such as a cast iron Dutch oven) over medium heat until shimmering.  Add the pork and cook until no longer pink, in batches if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork from the pot with a slotted spoon, leaving behind at least a tablespoon of fat.  Add the onions and cook until soft and golden, about 5 minutes.  While the onions are cooking, mince the remaining garlic cloves and add them to the pot along with the oregano.  Cook for a minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pork to the pot and add the tomatillo mixture and chicken stock (the stock should just cover the pork).  Add the cloves and bring to a boil. Simmer 30 minutes or longer if time allows.  Season with salt and pepper and serve with a garnish of cilantro.</p>"}]}