{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201102014-137803-chicken-kara-age.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Japanese", "keywords": ["chicken", "Cook the Book", "fried chicken", "Japanese", "Makiko Itoh", "The Just Bento Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken Kara-age, AKA Japanese Fried Chicken", "link": "https://www.seriouseats.com/recipes/2011/02/chicken-kara-age-japanese-fried-chicken-recipe.html", "description": "<strong>Chicken Kara-age</strong> AKA Japanese fried chicken (or JFC for short) is a total crowdpleaser.  These little chunks of soy-sake-ginger marinated chicken coated in cornstarch and deep-fried until golden have a tendency to disappear almost as quickly as they come out of the fryer.", "totalTime": "", "recipeYield": "1", "recipeCategory": ["Cook the Book", "Deep Frying", "Fried Chicken", "Japanese"], "recipeIngredient": ["4 ounces boneless chicken thigh, with or without skin, cut into 3–4 pieces ", "1 teaspoon soy sauce (if you are not making the green onion sauce, increase to 2 tsp)", "1 tablespoon sake", "1 teaspoon peeled and grated fresh ginger", "Vegetable oil, for deep-frying", "4 tablespoons cornstarch", "Handful arugula or other green salad leaves", "<strong>For the green onion sauce:</strong>", "1 tablespoon rice vinegar", "1 tablespoon soy sauce", "1 tablespoon finely chopped green onion", "Pinch sugar ", "A few drops sesame oil ", "1 teaspoon peeled and grated fresh ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chicken, soy sauce, saké, and ginger. Let marinate for at least 10 minutes or overnight. (If you need to leave it marinating for more than 12 hours, omit the soy sauce and add it 10 minutes before cooking, or the salt will draw out too much moisture from the chicken and make it dry.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken pieces from the marinade, drain, and coat in the cornstarch.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 inch (2.5cm) of vegetable oil in a saucepan over medium-high heat. Test the oil temperature by putting a little of the cornstarch-and-marinade coating on the end of a wooden chopstick and dipping it into the oil. If the coating sizzles and turns brown immediately, the oil is hot enough. If the oil starts getting smoky, turn down the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the chicken pieces in the oil, turning once, until a deep golden brown. Drain well on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the green onion sauce, combine all the ingredients in a small frying pan over medium heat and stir until the sugar is dissolved. Put the chicken pieces in the pan and toss to coat each piece with the sauce.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool completely before packing into a bento box. Putting a layer of arugula or other salad leaves under the chicken enhances the color of the chicken and provides another texture in the bento.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong> You can cook chicken karaage the night before. If I’m making this for dinner, I usually set aside a few pieces for the next day’s bento. Chicken kara-age can be frozen uncooked and marinated, or cooked. To freeze it uncooked and marinated, put the chicken and marinade (excluding the soy sauce) into a freezer bag. Defrost in the refrigerator in a bowl, adding the soy sauce before frying. Cooked frozen pieces can be defrosted in the refrigerator, then crisped up for a few minutes in a toaster oven. I don’t recommend defrosting cooked pieces in a microwave, since this will make the chicken tough. </p>"}]}