{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2011/11/TEXASCHILICONCARNE.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "chile con carne", "chili", "low carb", "texas", "Texas chili", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5833333333333", "ratingCount": "12"}, "name": "Real Texas Chili Con Carne", "link": "https://www.seriouseats.com/recipes/2011/11/real-texas-chili-con-carne.html", "description": "Real Texas chile con carne is made with beef, chilies, and not a whole lot else. This is the real deal: a bowl of hot Texas red with fall-apart tender beef chuck and fresh dried chilies.", "totalTime": "3 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Beef", "Chili", "Mains", "The Food Lab"], "recipeIngredient": ["3 whole sweet fresh dried chilies like Costeño, New Mexico, or Choricero, stems and seeds removed", "2 small hot dried chilies like Arbol or Cascabel, stems and seeds removed", "3 whole rich fruity dried chilies like Ancho, Mulatto, Negro, or Pasilla, stems and seeds removed", "2 whole Chipotle chilies canned in adobo sauce, plus 2 tablespoons sauce, stems and seeds removed", "2 quarts low sodium canned or homemade chicken broth", "4 pounds beef chuck, trimmed of excess gristle and fat, cut into thick steaks", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable oil", "1 large onion, finely diced", "4 medium cloves garlic, grated on a microplane grater", "1/2 teaspoon powdered cinnamon", "1 tablespoon ground cumin", "1/4 teaspoon ground allspice", "2 teaspoons dried oregano", "2 tablespoons Asian fish sauce", "2 to 3 tablespoons <em>masa</em>", "2 tablespoons apple cider vinegar", "Hot sauce, to taste", "Cilantro, chopped onions, scallions, grated cheese, avocado, and warm tortillas for serving as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside. Alternatively, place dried chilies on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl. Add half of chicken broth and chipotle chilies, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside for 5 minutes. Transfer chilies and liquid to blender and blend, starting on the lowest possible setting and gradually increasing speed to high (make sure to hold the lid down with a clean kitchen towel or a potholder to prevent it from blowing out). Blend until smooth, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chuck steaks generously with salt and pepper. Heat oil in the base of a Dutch oven over high heat until just starting to smoke. Add half of beef chuck in a single layer and cook without moving until deeply browned, about 6 minutes. Flip steaks and brown second side, 3 to 4 minutes longer. Transfer steaks to a cutting board. When cool enough to handle, cut seared steaks and raw steaks into 1 1/2- to 2-inch chunks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return Dutch oven to heat. Add onions and cook, stirring frequently until translucent and softened, about 2 minutes. Add garlic, cinnamon, cumin, allspice, and oregano, and cook, stirring constantly until fragrant, about 1 minute. Add all meat back to pan along with chili puree and remaining quart chicken broth. Stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil over high heat, reduce to a simmer, cover, leaving lid just barely ajar and cook, stirring occasionally until meat is completely tender, 2 1/2 to 3 hours. Alternatively, stew can be cooked in a 200° to 250°F oven with the lid of the Dutch oven slightly ajar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in fish sauce, masa harina (if using), and vinegar. Add hot sauce to taste. Season to taste with salt. For best results, allow chili to cool and store in the refrigerator at least overnight and up to five days. Reheat the next day to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve, garnished with cilantro, chopped onions, scallions, grated cheese, avocado, and warm tortillas as desired.</p>"}]}