{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110416-crab-rangoon-pupu-tiki11.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["appetizers", "Chinese", "crab", "cream cheese", "seafood", "Tiki Week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Crab Rangoons (Crab Puffs) With Sweet and Sour Sauce", "link": "https://www.seriouseats.com/recipes/2011/04/crab-rangoon-crab-puffs-recipe.html", "description": "Note: Crab Rangoons can be frozen after step 2. Space them out on a rimmed baking sheet and place in the freezer until completely frozen, then transfer to a zipper-lock bag. They'll keep for up to three months. The 2...", "totalTime": "1 hour", "recipeYield": "6 to 10 as an appetizer (makes 40 to 50 pieces)", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Lobster and Crab"], "recipeIngredient": ["<strong>For the Sweet & Sour Dipping Sauce</strong>", "1/2 cup rice vinegar", "3/4 cup brown sugar", "2 tablespoons ketchup", "2 teaspoons red chile flakes (more or less to taste)", "1/2 cup plus 1 tablespoon water", "1 tablespoon corn starch", "1/2 cup fresh pineapple chunks or canned chunks, drained", " ", "<strong>For the Crab Rangoon</strong>", "8 ounces softened cream cheese", "6 ounces picked crab meat (or surimi, cut into 1/2-inch pieces)", "6 scallions, whites only, finely sliced (about 1/2 cup)", "1 pack square wonton wrappers (preferably yellow), about 40-50 pieces", "2 quarts peanut oil", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine vinegar, brown sugar, ketchup, chili flakes, and water in a small saucepan and bring to a simmer over medium-high heat, whisking to combine until sugar is dissolved. Combine remaining tablespoon water and corn starch in a small bowl and whisk with a fork to form a slurry. Whisk into sauce and bring to a boil. Allow to cool while you form the crab rangoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cream cheese, crab, and scallions in a medium bowl and fold with a spatula or your hands until combined. Lay one wonton wrapper out on a cutting board (keep the rest under plastic wrap or a damp towel) and place a small amount of filling in the center (about 1 1/2 teaspoons). Moisten the edges with a wet fingertip, the seal by either folding it in have in a triangular shape, or by pushing the four edges in towards the center to create a four-pointed star. Be careful not to allow any air to remain inside as you seal them. Transfer to a large plate, cover loosely with plastic wrap, and repeat until all of the filling is used.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish the sauce, add pineapple chunks and puree with an immersion blender or by transferring to a standing blender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a wok or Dutch oven to 375°F as registered on an instant read thermometer. Carefully add 10 to 12 crab rangoons to the oil. Cook, adjust flame to maintain temperature and agitating and flipping them constantly with a wire mesh spider until crisp and golden brown, about 3 minutes. Transfer to a paper towel-lined bowl to drain, season with salt, and serve immediately with sweet and sour sauce.</p>"}]}