{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110201-pizza-rolls-filling-on%20dough.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "pizza", "pizza rolls", "snacks", "Super Bowl snacks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Homemade Pizza Rolls", "link": "https://www.seriouseats.com/recipes/2011/02/homemade-pizza-rolls-totinos-recipe.html", "description": "I love a challenge. When I was urged to create a recipe for homemade pizza rolls for a Super Bowl snack, I knew it'd be an interesting project. They come with the same warning: <strong>this filling is molten hot.</strong>", "totalTime": "2 hours 30 minutes", "recipeYield": "makes about 4 dozen", "recipeCategory": ["Bread Baking", "Pizza", "Snacks"], "recipeIngredient": ["<em>For the dough:</em>", "9 ounces (about 1 2/3 cups) bread flour", "1 egg", "1 teaspoon salt", "1/2 cup water", "&nbsp;", "<strong>For the filling:</strong>", "1/2 pound Italian sausage, cooked, cooled, and finely diced", " 1/4 pound low-moisture mozzarella, finely diced", "1/2 cup prepared pizza sauce", "<strong>For frying:</strong>", "1 quart peanut or canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put bread flour and salt in bowl of food processor fitted with dough blade. Turn processor on and add egg. Then add water slowly,watching for dough to form ball (you might not need all the water). Continue processing until the dough is smooth and supple, about 15 seconds. Remove dough from food processor, form into flat disk. Wrap in plastic wrap and set aside to rest for one hour</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While dough is resting, prepare filling. Combine sausage and cheese, and add enough tomato sauce to bind it well, but not so much that meat and cheese are swimming in sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready to work the dough, set your pasta roller to thickest setting. Divide dough into 4 pieces. Send first piece through pasta roller at the thickest setting, fold in half, and send it through again. Continue folding and rolling until the dough is smooth and elastic. Then, set the pasta roller one notch smaller and roll the dough again. Roll again at setting 3 and finish at setting 4. Repeat with remaining three pieces of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay pasta sheet on lightly floured surface and place 1 teaspoon of filling at 1 1/2 to 2 inch intervals along enter of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very lightly brush uncovered dough with water. Fold dough over filling, then press around the filling to seal rolls, taking care to press out as much air as possible from around the filling. With pastry cutter, pizza cutter, or knife, trim dough around rolls, staying close to filling, but leaving sufficient dough so there's a good seal all around. Individual rolls should be about 1 1/4 inches square. Save dough scraps. When you're done with all the sheets of pasta, you can re-roll all the scraps and continue making pizza rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before you fry, check the rolls to make sure all the edges are sealed tightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour oil into Dutch oven or wok and heat to 375°F. Place the rolls in oil in batches, being careful not to crowd pan, and fry until golden brown, flipping over to cook second side when bottom is browned, 2 to 3 minutes total. Remove from oil and place on paper towels to absorb extra oil. Serve immediately or chill and reheat in oven when you're ready to serve (8 minutes at 350°).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>And here's a comparison. Original on the left, mine on the right. In a non-blind completely biased taste test, mine won.</p>"}]}