{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120412-ctb-zuke.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["avocado", "Cook the Book", "Patricia Wells", "pistachios", "salad", "Salad as a Meal", "summer", "zucchinis"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Patricia Wells's Zucchini Carpaccio with Avocado, Pistachios, and Pistachio Oil ", "link": "https://www.seriouseats.com/recipes/2011/07/zucchini-carpaccio-with-avocado-pistachios-recipe.html", "description": "Too-hot-to-cook season has an unfortunate tendency to coincide with \"what am I going to do with all of this zucchini? season.\"  Instead of overheating your kitchen by baking loaves upon loaves of zucchini bread, we have a cool and elegant solution courtesy of <em><a href=\"http://www.amazon.com/Salad-Meal-Healthy-Main-Dish-Salads/dp/006123883X/?tag=serieats-20\">Salad as a Meal</a></em> by <a href=\"http://www.patriciawells.com/\">Patricia Wells</a> that's topped with slices of avocado, a shower of pistachios, thyme, and fleur de sel.", "totalTime": "1 hour", "recipeYield": "4", "recipeCategory": ["Avocado", "Cook the Book", "No-Cook", "Nuts", "Salads"], "recipeIngredient": ["1 tablespoon freshly squeezed lemon juice ", "1/4 teaspoon Lemon Zest Salt (recipe follows)", "3 tablespoons best- quality pistachio oil (such as Leblanc) or extra- virgin olive oil ", "4 small, fresh zucchini (about 4 ounces each), rinsed and trimmed at both ends", "1 large ripe avocado ", "1/2 cup salted pistachios", "4 fresh lemon thyme sprigs, with flowers if possible", "Fleur de sel ", " ", "<strong>Lemon Zest Salt</strong>", "1 tablespoon lemon zest, preferably organic", "1 tablespoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lemon Zest Salt:</strong>  Combine the lemon zest and salt in the spice grinder, and grind into a fine powder.  Transfer to a small jar and close with the lid.  (Store, sealed in the jar, in the refrigerator for up to 1 week.  After that the lemon flavor will begin to fade.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the salad:</strong> In the jar, combine the lemon juice and flavored salt. Cover with the lid and shake to blend. Add the oil and shake to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mandoline or chef’s knife, slice the zucchini lengthwise as thin as possible. Arrange the slices on a platter and pour the dressing over them. Tilt the platter back and forth to coat the slices evenly. Cover with plastic wrap and let marinate at room temperature for 30 minutes, so the zucchini absorbs the dressing and does not dry out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve, pit, and peel the avocado, and cut it lengthwise into very thin slices. Carefully arrange the slices of marinated zucchini on individual salad plates, alternating with the avocado slices, slightly overlapping them. Sprinkle with the pistachio nuts. Garnish with the thyme sprigs and flowers and fleur de sel. Serve. </p>"}]}