{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110228-140078-olive-oil-mashed-potatoes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Bird in the Oven and Then Some", "Cook the Book", "mashed potatoes", "Mindy Fox", "olive oil", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Olive Oil Mashed Potatoes with Coarse Pepper and Wispy Scallions", "link": "https://www.seriouseats.com/recipes/2011/03/olive-oil-mashed-potatoes-with-pepper-scallions-recipe.html", "description": "<strong>It's a simplified mash made with only a few ingredients</strong>&mdash;creamy yellow Yukon Golds, sea salt, cracked pepper, a few tablespoons of good olive oil, and scallion slivers. Unlike mashed potatoes that are loaded up with cream and butter, these let the sweetness of the potatoes and olive oil shine through.  But even without the dairy, they're creamy with little bites of spicy peppercorns and oniony scallions scattered throughout.  And when the juices from the chicken run into the potatoes?  Well, it doesn't really any better.", "totalTime": "", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Mashed Potatoes", "Sides"], "recipeIngredient": ["2 1/2 pounds Yukon Gold or Mayan Gold potatoes, peeled and cut into 2.5-cm chunks ", "Flakey coarse sea salt", "1 teaspoon whole black peppercorns", "6–7 tablespoons good-quality extra-virgin olive oil, plus extra for drizzling ", "2 scallions, very thinly sliced on a long diagonal  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes and a pinch of salt in a large saucepan and fill with water. Bring the water to the boil and cook the potatoes for 12–15 minutes until tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the peppercorns on a chopping board. Place the flat side of the blade of a chef’s knife on top and, using the base of your palm, press down firmly and a little to the side, to crush the peppercorns.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the potatoes, then transfer them to a large bowl and immediately mash with a fork, or put them through a ricer. Stir in 1 tablespoon of salt, then, stirring until combined, drizzle in the oil. Serve warm with the spring onions, extra salt, pepper and an extra drizzle of oil on top. <br />\r\n</p>"}]}