{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111003-173559-pear-frangipane-610x458-2.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "mousse", "peanut butter", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Black Bottom Peanut Butter Mousse Pie", "link": "https://www.seriouseats.com/recipes/2011/10/black-bottom-peanut-butter-mousse-chocolate-pie-recipe.html", "description": "This is my new favorite expression of the chocolate and peanut butter combination. The chocolate layer, which is not quite a ganache but not quite a pudding, complements the light, airy peanut butter mousse perfectly. The graham cracker crust provides a crunchy contrast, and the whole thing feels very adult. Or maybe, more accurately: adult, with a nod to childhood.", "totalTime": "4 hours", "recipeYield": "8", "recipeCategory": ["Chocolate", "Desserts", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["8 full sized graham crackers, pulverized to crumbs", "4 tablespoons unsalted butter, melted", "250 grams 65% chocolate, chopped into 1/4 pieces or smaller", "300 grams whole milk", "3 tablespoons corn syrup", "pinch of salt", "1 cup smooth peanut butter (not the natural, separated kind)", "1/2 cup plus 3 tablespoons confectioner's sugar", "1 cup cold heavy cream, whipped to soft peaks", "Optional: additional whipped cream for top, chocolate sauce for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the crust:</strong> Preheat the oven to 350°F. Combine the graham cracker crumbs and melted butter in a bowl and stir to combine. Press the mixture evenly into the bottom and sides of the pie plate. Bake for 15 minutes, until the crust gets slightly browned. Allow the crust to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the chocolate layer:</strong> Place chopped chocolate, pinch of salt, and corn syrup in a bowl. Bring the milk to a boil, immediately remove from the heat, and pour over the chocolate. Allow this to sit for 1 minute, then whisk until all of the chocolate has melted and the mixture is homogenous. Pour the mixture into a saucepan and whisk constantly over low heat for about 8 minutes. The mixture will steam, thicken, and begin to sputter and bubble. Continue to whisk and scrape the bottom to prevent burning. When the mixture is of pudding consistency, remove from the heat. Pour into a bowl, press plastic wrap directly on the surface, and chill for 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the mousse layer: </strong>Just before assembly, whisk peanut butter and confectioner's sugar together until the mixture is thick and glossy. Whisk about 1/3 of the chilled whipped cream into the mixture to lighten it, then fold in the remaining 2/3, taking care not to deflate it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the pie: </strong>Spread the chilled chocolate layer evenly over the bottom of the pie shell, then pour the mousse evenly over that. If desired, top with additional whipped cream, chocolate syrup, nuts, or chocolate chips. Serve immediately.</p>"}]}