{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20110928-172459-Coconut-cream-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["coconut", "coconut desserts", "cream pies", "creamy desserts", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coconut Custard Pie", "link": "https://www.seriouseats.com/recipes/2011/10/coconut-custard-pie-how-to-make-coconut-cream-pie-recipe.html", "description": "This is the coconut pie of my dreams. The all-butter crust is blind baked to golden brown perfection, and filled with the creamy, smooth coconut custard just before serving, so the bottom stays perfectly crisp. I like the contrast of the toasted coconut folded into the custard, but if you prefer a smoother filling, toast only what you'll need for sprinkling on the top.", "totalTime": "4 hours", "recipeYield": "8", "recipeCategory": ["Coconut", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "2 cups milk", "12 ounces coconut milk", "1/2 cup sugar, divided", "1/4 cup cornstarch", "Pinch of salt", "4 egg yolks", "1/2 cup sweetened flake coconut, toasted until golden brown and crispy", "1 cup heavy cream, cold", "1 tablespoon confectioners sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a sheet tray with plastic wrap and set aside. Have additional plastic wrap ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the milk, coconut milk, and 1/4 cup sugar in a medium saucepan and bring them just to a simmer over medium-high heat. As the liquid heats up, whisk the remaining 1/4 cup sugar, cornstarch, and salt together in a separate bowl. Add the egg yolks to the dry ingredients all at once and whisk immediately for 1 minute, until they are lightened in color. Once the liquid starts to simmer, remove it from the heat. Add it to the egg mixture a little at a time, whisking as you go, to temper eggs. Once all the liquid has been whisked into the egg mixture, return it to the saucepan over low heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk continuously as the custard begins to thicken. Continue whisking and allow the thickened custard to sputter and bubble for two minutes before pouring it out through a mesh strainer onto the prepared tray. Press plastic wrap over the top of the custard and chill for at least 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg; Fahrenheit. Line the chilled pie shell with foil and fill with pie weights or dried beans and bake for 15 minutes, rotating halfway through. Lower the oven temperature to 375&deg;, remove the weights and the foil, and allow the shell to bake for an additional 15 minutes, until the crust is golden brown and comes easily out of the pie plate. Remove the pie shell from the oven and allow it to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve, whip the heavy cream and confectioners sugar together until the cream holds soft peaks. Put the custard in a bowl and stir it until it is smooth, then add all but a few tablespoons of the toasted coconut flakes and stir to combine. Pour the custard into the baked pie shell. Top with whipped cream and sprinkle with the remaining toasted coconut flakes. Serve immediately.</p>"}]}