{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110705-nasty-bits-focaccia-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Italian", "keywords": ["bread", "focaccia", "Italian", "lard", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lard Focaccia", "link": "https://www.seriouseats.com/recipes/2011/07/lard-focaccia-italian-bread-recipe.html", "description": "Why would you want to make lard focaccia? If you want your focaccia to taste like lard, of course. As an added bonus, as the focaccia bakes your entire house will smell like lard, though you can also use duck fat or mix in a little bacon fat if you'd prefer something with a smoky flavor.", "totalTime": "10 hours", "recipeYield": "makes one sheet pan (10 by 15 inches) of focaccia", "recipeCategory": ["Bread", "Italian", "Pork", "The Nasty Bits"], "recipeIngredient": ["1 1/2 cups lukewarm water", "1 tablespoon active dry yeast", "3 cups all-purpose flour, plus extra for dusting", "2 teaspoons sea salt", "1/2 cup melted lard, plus extra for drizzling", "1/2 cup roughly chopped scallions", "1 tablespoon chopped rosemary, or 2 teaspoons crushed fennel seed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 1/2 cup of the warm water in a mixing bowl.  Add the yeast and 3 tablespoons of the flour and stir briefly to mix. Let the mixture sit until it begins to bubble, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 1 cup lukewarm water, the rest of the flour, the salt, and the lard. Stir until the mixture gathers into a wet, sticky dough. Sprinkle it with a few tablespoons more flour and knead it in the bowl for a minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a bowl large enough to contain the dough, which will rise a little  Cover the bowl tightly with plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove the dough fro the refrigerator. Generously oil a baking sheet with more lard. Pat and press it into the baking sheet, allowing the dough to soften for a few minutes if it's too tight to be stretched. Cover the baking sheet with plastic wrap and let it rise in a warm place until it's fluffy and evened out on the top, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. Brush the dough with lard and scatter the scallions and rosemary on top. Poke dimples over the top of the focaccia and sprinkle with coarse sea salt. Bake for 25 to 30 minutes until it's browned on both the top and the bottom. </p>"}]}