{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110421-127355-dinner-tonight-grouper-pea-saffron.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fish", "grouper", "peas", "saffron"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Grouper with Peas and Saffron (Mero en Amarillo)", "link": "https://www.seriouseats.com/recipes/2011/04/grouper-with-peas-and-saffron-recipe.html", "description": "It's rare that sauce also does double duty as the vegetable, but that's the case with this incredible recipe from <em><a href=\"http://www.amazon.com/dp/009188084X/?tag=serieats-20\">Moro</a></em>. The grouper fillets are sauteed in a pan on both sides over medium heat, before adding wine, saffron-infused water, a garlic and bread paste, and a whole heap of peas. The liquid reduces to the point where the peas actually <em>are</em> the sauce. Somehow it works.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Fish", "Legumes"], "recipeIngredient": ["60 saffron strands", "5 tablespoons boiling water", "4 tablespoons olive oil, divided ", "6 garlic cloves, peeled", "2 thick slices white bread, crusts removed, cut into ½-inch cubes", "Four 8-ounce grouper fillets, skin on", "5 ounces white wine ", "8 ounces peas, fresh or frozen ", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the saffron strands to a medium-sized bowl. Pour in the boiling water and let steep while you cook the rest of the dish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large heavy-bottom skillet over medium heat and add three tablespoons of olive oil. When shimmering, add the garlic. Cook, turning often, until golden on all sides. Turn down the heat if necessary. Remove the cooked garlic and set aside. Add the bread to the skillet. Toss well, and cook until browned on all sides. Transfer bread and cooked garlic to mortar and pestle and pound until it is a thick paste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the remaining oil into the skillet. Turn the heat to medium. Season the fish fillets with salt and pepper. When oil starts to shimmer add the fish fillets skin-side up. Cook until browned, about two minutes. Flip the fillets and cook until the skin is crisp, about five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine and the bread and garlic to the skillet. Let the wine simmer for about 30 seconds, and then add the saffron infused water and the peas. Immediately reduce the heat to low, cover the skillet, and cook until the fish is completely cooked, about ten minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the fish fillets with the pea and bread thickened sauce. Season to taste with salt and pepper.   </p>"}]}