{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110829-168336-celery-ice-cream-with-candied-ginger.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["celery", "ice cream", "Jeni's Splendid Ice Creams at Home", "raisins"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Celery Ice Cream with Candied Ginger and Rum-Plumped Golden Raisins", "link": "https://www.seriouseats.com/recipes/2011/08/celery-ice-cream-with-candied-ginger-and-rum-jenis-ice-cream-recipe.html", "description": "Don't knock this mad scientist combo until you've tried it&mdash;bitter celery, spicy ginger, and boozy raisins come together beautifully in Jeni Britton Bauer's rich ice cream base.", "totalTime": "1 hour", "recipeYield": "1 quart", "recipeCategory": ["Bake the Book", "Ginger", "Ice Cream and Frozen Treats"], "recipeIngredient": ["2 cups whole milk ", "1 tablespoon plus 1 teaspoon cornstarch ", "1 1/2 ounces (3 tablespoons) \u2028cream cheese, softened", "1/8 teaspoon fine sea salt", "1 1/4 cups heavy cream ", "2/3 cup sugar", "2 tablespoons light corn syrup ", "A large bunch of dark green celery leaves, finely chopped (and/or  \u20281 teaspoon celery seeds, pounded lightly in a mortar with the pestle)", "Rum-Plumped Golden Raisins (recipe follows)", "2 tablespoons finely diced candied ginger ", " ", "<strong>Rum-Plumped Golden Raisins:</strong>", "1 cup golden raisins", "1/2 cup water", "2 tablespoons rum", "1/2 cup sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Rum-Plumped Golden Raisins:</strong> Put raisins in a heatproof bowl. Combine the water, rum, and sugar in a small saucepan and bring to a boil, stirring to dissolve the sugar. Pour the syrup over the fruit and let cool to room temperature. Refrigerate until chilled (the fruit will keep for up to a month in the refrigerator). <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Celery Ice Cream:</strong> Mix about 2 tablespoons of the milk with the cornstarch in a small bowl to make a smooth slurry. Whisk the cream cheese and salt in a medium bowl until smooth. Fill a large bowl with ice and water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the remaining milk, the cream, sugar, and corn syrup in a 4-quart saucepan, bring to a rolling boil over medium-high heat, and boil for 4 minutes. Remove from the heat, and gradually whisk in the cornstarch slurry. Bring the mixture back to a boil over medium-high heat and cook, stirring with a heatproof spatula, until slightly thickened, about 1 minute. Remove from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually whisk the hot milk mixture into the cream cheese until smooth. Stir in the celery leaves (and/or seeds). Pour the mixture into a 1-gallon Ziploc freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes. If using celery leaves, allow the ice cream base to steep for 4 to 12 hours in the refrigerator. \u2028<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using celery leaves, strain them out. Pour the ice cream base into the frozen canister and spin until thick and creamy. Drain the raisins and mix with the candied ginger. Pack the ice cream into a storage container, folding in the raisins and ginger as you go. Press a sheet of parchment directly against the surface, and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours. </p>"}]}