{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/12172011-183971-sunday-supper-maple-baked-beans.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["baked beans", "beans", "maple", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Maple Baked Beans", "link": "https://www.seriouseats.com/recipes/2011/12/maple-baked-bean-stew-pork-recipe.html", "description": "As with many recipes, the secret ingredient to world-changing baked beans is pork.  Good quality, salty, cured, fatty pork will make you look down on the ketchupy, mushy baked beans of your past and look forward to years of tinkering with this recipe until you finally reach your own bean nirvanna.", "totalTime": "4 hours", "recipeYield": "Serves 4 (with leftovers)", "recipeCategory": ["Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["2 cup dried navy beans", "6 strips bacon", "1 onion chopped", "1 teaspoon dried mustard", "1 teaspoon salt", "1/2 cup maple syrup", "I pork hock, fresh or smoked", "2 tablespoons butter", "2 tablespoons brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325°.  Simmer navy beans in water until tender, about 20 minutes.  Drain beans and reserve cooking liquid.  Line bean pot with strips of bacon.  In a large bowl toss together onion and beans.  In another bowl combine 2 cups bean cooking liquid, mustard, salt and maple syrup.  Place half the bean mixture on bacon strips in pot.  Place pork hock on beans, top with rest of bean onion mixture, then pour over reserved cooking liquid/syrup mixture.  Cover with lid and place in oven for 3 hours, or until pork hock is fully cooked and pulling away from the bone.  If beans begin to look dry, add more cooking liquid.  <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once pork hock is cooked, remove beans from oven and remove lid.  Mash together butter and brown sugar into a paste, scatter sugar paste over beans and place back in the oven, uncovered, for an additional 30 minutes.  Remove from oven and serve with cold beer and dark bread.</p>"}]}