{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/201104190bread-baking-bubbly.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread baking", "breads", "sesame seeds"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Bread Baking: Fast and Slow Sesame White Bread", "link": "https://www.seriouseats.com/recipes/2011/04/bread-baking-fast-and-slow-sesame-white-bread-recipe.html", "description": "For a faster loaf of bread, the short version works. On the other hand, if you want a dough that can sit around for a long time, the long one adds more flavor. Can't argue with that.", "totalTime": "2 hours (short version) to 3 hours (long version)", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup warm water", "2 1/4 teaspoons instant yeast", "1 tablespoon honey", "11 1/4 ounces (about 2 cups) bread flour, divided", "1 teaspoon salt", "2 tablespoons butter at room temperature", "Egg wash (1 egg, beaten with 1 tablespoon water)", "Sesame Seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast, honey, and 1 1/2 cups of flour in the bowl of your stand mixer (or a mixing bowl, if you will be hand kneading. Cover the bowl with plastic wrap and set aside to rest for 30 minutes (for the short version) or 90 minutes (for the long version). Or, really, any time in between. At 30 minutes, the mixture will be very lively and bubbly. At 90 minutes it will have rising in the bowl and will be bubbling somewhat violently; it may have started to collapse, but that's fine, too.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle some corn meal on a baking sheet and preheat the oven to 350 degrees. Add the salt, butter, and remaining flour, and knead with the dough hook, or by hand, until you have a smooth, elastic dough. Flour your work surface lightly and turn the dough out. Knead briefly, then form the dough into a log about 12 inches long. (Yes, this is correct - there is no rise after adding the last of the flour) Seal the seam at the bottom and place the dough, seam-side down, on the prepared pan. Cover the dough with plastic wrap and set aside to rise until doubled in size, 20-30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has risen, brush it with egg wash and sprinkle with sesame seeds. Slash the dough down the center and bake until golden, about 30 minutes. Let the loaf cool completely on a rack before slicing.</p>"}]}