{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110519-127355-dinner-tonight-crunchy-chicken-salad.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["barbara kafka", "chicken", "chicken sandwiches", "Dinner Tonight", "roasted chicken", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Roasted Chicken Salad with Crunch", "link": "https://www.seriouseats.com/recipes/2011/05/roasted-chicken-salad-with-crunch-recipe.html", "description": "I return again and again to <strong>Barbara Kafka</strong> because her recipes are both straightforward and always flavorful. This recipe for chicken salad with crunch comes from <em><a href=\"http://www.amazon.com/dp/0688131352/?tag=serieats-20\">Roasting: A Simple Art</a></em>, and it's dynamic and also really easy to prepare. As you've probably guessed from the name of the cookbook, this recipe calls for chicken that has been roasted instead of simmered.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Chicken", "Dinner Tonight", "Sandwiches"], "recipeIngredient": ["2 bone-in, skin-on chicken breasts", "1 cucumber, peeled", "1 large red pepper, stemmed, seeded, deribbed, cut into thin strips", "4 tablespoons fresh mint, chopped", "4 tablespoons fresh lime juice ", "2 teaspoons ground cumin", "½ cup mayonnaise", "1 teaspoon kosher salt", "freshly ground black pepper, to taste", "4 leaves romaine lettuce, thick stems discarded", "8 slices of bread (ciabatta or sourdough are good)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 500&deg;F”. Using a very sharp knife, cut the chicken breasts in half crosswise. Season with salt and pepper. Arrange pieces bone side down on a roasting pan that just fits them. Place in oven and cook for 10 minutes. Flip pieces carefully with a pair of 12-inch tongs. Cook for 10 more minutes. Meat should be cooked, and juices should run clear. If not, return to oven to finish cooking. When done, set aside and let cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cool, remove skin with your hands and remove any bones. Cut lengthwise into thin strips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut cucumber crosswise into thirds. Halve each third lengthwise, remove seeds with a spoon, and then slice into thin strips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently toss sliced chicken, cucumber, red pepper, and mint in a medium-sized bowl. In a small bowl, whisk together lime juice, cumin, mayonnaise, salt, and pepper to taste. Pour ¾ of the dressing into the medium-sized bowl and gently mix. Taste, and then add more of the dressing if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top one slice of bread with a leaf of romaine, one cup of chicken salad, and another slice of bread. Repeat process three times. Serve with potato chips. </p>"}]}