{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110801-fanygerson-ap-pistachio.jpg", "author": {"@type": "Person", "name": "Fany Gerson"}, "recipeCuisine": "", "keywords": ["apricots", "Fany Gerson", "Fany Gerson Week", "fruit", "paletas", "popsicles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Apricot-Vanilla Paletas", "link": "https://www.seriouseats.com/recipes/2011/08/roasted-apricot-vanilla-paletas-popsicle-fruit-recipe.html", "description": "I love stone fruit so much&mdash;especially apricots because they have a bit of tartness to them. I also love a little textural contrast in my sweets, and as I was making these I started thinking of those delicious Arab candies that are made with dried apricots and pistachios, so I thought&mdash;hey, maybe I should use that awesome combination. And it worked!", "totalTime": "", "recipeYield": "Makes 10-12 paletas", "recipeCategory": ["Apricot", "Fruit Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 pound apricots pitted and cut in half  (about 10-12)", "1 vanilla bean, split lengthwise", "½ cup sugar", "1 tablespoon freshly squeezed lemon juice", "pinch salt", "1 - 1 1/2 cup pistachios, lightly toasted and finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the apricots and vanilla bean (scraped and with the pod) into a pan with the sugar and mix well. Cover loosely with aluminum foil, place in the oven, and cook until the apricots are softened and they have a nice lightly roasted aroma. Make sure to stir from time to time so the mixture doesn’t stick; add a bit of water if you find it sticking (about ½ cup). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the mixture to cool and discard vanilla bean (or rinse and save for another use). Puree the mixture in a blender and add enough water so that it has a pourable consistency. Stir in lemon juice and salt and pour into molds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze, and insert a stick once the mixture is semi-frozen so the stick will stand on its own; freeze until completely set, at least several hours. Unmold them by dipping the molds into a pan with tall sides, filled with warm water. Leave for a few seconds and pull up gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the paletas in the chopped pistachios as soon as they are unmolded (the slightly melted exterior will help them adhere better). You can also dip the paletas very quickly into tepid water and then roll around in the nuts.</p>"}]}