{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110401-144993-cardamom-brown-sugar-snickerdoodles.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["baking", "cardamom", "Cook the Book", "Cookies", "Joe Yonan", "Serve Yourself"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Cardamom-Brown Sugar Snickerdoodles", "link": "https://www.seriouseats.com/recipes/2011/04/cardamom-brown-sugar-snickerdoodles-recipe.html", "description": "These <strong>Cardamom-Brown Sugar Snickerdoodles</strong> bring together two simple and elegant flavors: aromatic cardamom and dark, almost caramelly brown sugar. The dough is blended in a stand mixer, chilled, portioned, and rolled in cardamom-scented sugar.  At this point you bake as many snickerdoodles as you'd like (they keep for about three days) and freeze the rest of the dough.", "totalTime": "1 hour, 15 minutes", "recipeYield": "makes about 70 cookies", "recipeCategory": ["Bake the Book", "Cook the Book", "Cookies"], "recipeIngredient": ["2 3/4 cups all-purpose flour", "2 teaspoons cream of tartar", "1 teaspoon baking soda", "1 1/2 teaspoons ground cardamom", "1/4 teaspoon salt", "1 cup unsalted butter, at room temperature", "1 1/2 cups packed light brown sugar", "2 eggs", "1 teaspoon vanilla extract", "1/4 cup granulated sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, sift together the flour, cream of tartar, baking soda, 1 teaspoon of the cardamom, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the butter and brown sugar in the bowl of a stand mixer fitted with the paddle attachment. Beat on medium speed for 1 minute. Turn the speed to high and beat until very light and fluffy, 2 or 3 minutes, stopping a couple of times to scrape down the sides of the bowl as needed. Decrease the speed to medium and beat in the eggs, one at a time, and the vanilla. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the mixer. Add about one-third of the dry ingredients to the mixer bowl, and beat on low speed until fully incorporated. Repeat two more times, stopping to scrape down the sides of the bowl as needed, until the dry ingredients are incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to the refrigerator and chill for about an hour, until firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir together the granulated sugar and remaining 1/2 teaspoon of cardamom. Use a #100 disher (a 3/4-tablespoon scoop) or a tablespoon to scoop small balls of dough a few at a time into the sugar-cardamom mixture, then roll the pieces to coat them and lightly roll them into balls between your palms, pressing the sugar mixture into the dough.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F with the oven rack in the middle of the oven. Line a baking sheet with parchment paper.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set as many of the cookies as you intend to bake about 2 inches apart on the prepared baking sheet. Bake for 5 minutes, then rotate the baking sheet front to back. Continue baking for another 4 to 6 minutes, until the tops of the cookies are crackled and the edges are just barely browned. Transfer to a wire rack to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the remaining dough close together but without touching on a baking sheet and freeze until firm, at least 1 hour. Remove the baking sheet from the freezer and put the cookies in a freezer-safe heavy-duty resealable plastic bag, rolling out the excess air before you seal it. Return to the freezer and store for up to 3 months. Bake the frozen cookies for 14 to 16 minutes, until the tops of the cookies are crackled and the edges are just barely browned.</p>"}]}