{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20110802-173872-Apple-Brown-Betty.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "apple", "fall sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple Brown Betty", "link": "https://www.seriouseats.com/recipes/2011/10/apple-brown-betty-recipe-easy-fall-desserts.html", "description": "The saying may go \"as American as apple pie\"  but I would venture that the simplicity and thrift embodied in Apple Brown Betty is much more in keeping with the pioneer spirit. It takes just a few pantry basics&mdash;if you have stale bread, apples, butter and cinnamon, you're already halfway there. There's no crust to chill and roll, no crumble to mix, no biscuits to prep and possibly best of all, you can get an Apple Brown Betty on the table in an hour.", "totalTime": "1 hour", "recipeYield": "8", "recipeCategory": ["Apple", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["4 tablespoons unsalted butter", "1/2 cup light brown sugar", "1/2 teaspoon cinnamon", "1/4 teaspoon freshly grated nutmeg", "Juice from one lemon", "2 teaspoons vanilla", "3 large tart apples, peeled, cored, quartered, thinly sliced", "2 cups coarse bread crumbs", "1/2 cup hard cider"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F. Using 1/2 tablespoon of butter, generously butter an 8 x 8 glass baking dish. Divide remaining butter into eight slices and set aside. In a small bowl, mix sugar, cinnamon and nutmeg and set aside. In a large bowl toss apples in lemon juice and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle crumbs to just cover the bottom of buttered dish. Then layer with one-half of the apples, sprinkle with one-half of the sugar mixture. Add remaining apples and drizzle with hard cider and any remaining lemon juice and vanilla left in the bowl, then top with remaining crumbs sprinkle with remaining sugar mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter pats to the top spacing them out evenly. Cover dish with a lid or aluminum foil and bake for 20 minutes. Remove foil and bake for 15-20 minutes or until crumbs are golden brown. Serve warm with whipped cream or ice cream.</p>"}]}