{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110818-dt-croque-monsieur.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["cheese", "Dinner Tonight", "ham", "pork", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Dinner Tonight: Croque Monsieur", "link": "https://www.seriouseats.com/recipes/2011/08/dinner-tonight-croque-monsieur-recipe.html", "description": "It really doesn't need to be complicated. The ham and cheese sandwich just works, and perhaps the most famous rendition of those two ingredients made melty between two slices of bread is the Croque Monsieur. While it's sometimes smothered with a cheesy roux-based Mornay sauce, for my taste it's plenty luxurious as is, perfect in its simplicity.", "totalTime": "10 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cheese", "Dinner Tonight", "Ham", "Pork", "Sandwiches"], "recipeIngredient": ["8 slices white bread, preferably from a rustic or country-style loaf", "6 tablespoons unsalted butter", "3/4 pound thinly sliced aged Gruyere cheese", "8 ounces thinly slices prosciutto"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small microwave-safe dish, microwave the butter on a low setting until melted. Using a pastry brush, brush half the bread slices on one side with butter, then set them out on a baking sheet, buttered side down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/8 of the cheese on each piece of bread, then top with the prosciutto, evenly divided amongst the four sandwiches. Top with the remaining cheese and the remaining slices of bread. Brush the remaining butter on top of the sandwiches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sandwiches into a nonstick griddle or skillet, and set over medium heat. When the bread starts to sizzle, cook for one minute, until golden, then flip and cook the other side until also golden, an additional minute or two. Serve immediately while the cheese is still melty.</p>"}]}