{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110825MustardButterSteak.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["butter", "mustard", "steak", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Dijon Mustard): Filet Mignon with Mustard Butter", "link": "https://www.seriouseats.com/recipes/2011/08/the-secret-ingredient-dijon-mustard-filet-mig.html", "description": "Tender medallions of filet mignon are seared, and topped with sweet cream butter, spiked with Dijon and whole grain mustards.  The butter melts, and seeps into the meat, with all that spicy, tangy, bright mustard accent.", "totalTime": "15 minutes, plus 1 hour refrigeration", "recipeYield": "4", "recipeCategory": ["Beef", "The Secret Ingredient"], "recipeIngredient": ["4 tablespoons unsalted butter, at room temperature", "2 teaspoons Dijon mustard", "2 teaspoons grain mustard", "8 1/4-pound tenderloin medallions, room temperature", "Vegetable oil", "Kosher salt", "Freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, mix together the soft butter and both mustards.  Form a log about two inches in length, and roll it in plastic wrap.  Refrigerate until set—about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the butter out of the fridge.  Preheat a cast iron skillet over high heat.  Drizzle the meat very lightly with vegetable oil, and rub the meat so it is completely, but lightly, coated in the oil.  Season the meat very well with salt and pepper on all sides.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the meat medallions in the hot cast iron pan (depending on the size of your pan, this may be done in two batches).  Sear until a dark brown crust is formed on the first side—about 8 minutes.  Turn the medallions over, and cook until the internal temperature just reaches 130 degrees F, about another 4 to 5 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the medallions on a serving platter, and slice the log of mustard butter into 8 coins.  Place one coin of butter on top of each piping hot steak, and let it melt while the steak rests.  Serve immediately, with some baguette or plain steamed potatoes to dredge up the extra butter and meat juices.</p>"}]}