{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205-127355-dinner-tonight-red-enchiladas-cheese.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["Dinner Tonight", "enchiladas", "mains", "Mexican"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Red Enchiladas With Queso Añejo", "link": "https://www.seriouseats.com/recipes/2011/12/red-enchiladas-with-queso-anejo.html", "description": "I love enchiladas, but I just don't always have the best luck cooking them at home. I usually steer clear of any recipes that advise me to turn on the oven, as I'm often left with nothing but a soggy mess by the end. But from the moment I saw this recipe in <a href=\"http://www.saveur.com/article/Recipes/Enchiladas\">Saveur</a>, I knew all would be well.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Mains", "Mexican"], "recipeIngredient": ["8 dried New Mexico chiles, stemmed and seeded", "1 ounce Mexican chocolate, roughly chopped", "1/2 teaspoon dried oregano", "1/4 teaspoon ground cinnamon ", "4 saltine crackers ", "1 garlic clove", "1 whole clove", "1 tablespoon canola oil, plus more for frying", "kosher salt ", "2 cups queso añejo, grated", "1/2 small yellow onion, minced", "12 corn tortillas "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a large 12-inch cast-iron skillet over high heat. Add the chiles and cook, flipping often, until they are toasted, three to five minutes. When done transfer to a blender along with the chocolate, oregano, cinnamon, crackers, garlic, clove, and 1 1/2 cups boiling water. Make sure the chiles are submerged, and let sit for five minutes. Blend until smooth. Pour the mixture through a fine strainer into a medium-sized bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour one tablespoon of the oil into a two-quart saucepan and turn heat to medium-high. When oil starts to shimmer, pour in the chile sauce. Cook, stirring often, until it has reduced to a thick sauce, three to six minutes. Season to taste with salt. Turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized bowl, combine the queso añejo and the minced yellow onion. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour enough oil into a large Dutch Oven to come about two inches up the sides. Turn the heat to medium-high and bring to a temperature of 350&mdash;F. Using a pair of tongs, take one tortilla and dip into the oil, moving it around constantly, until it has puffed up but is not yet crisp, about 15 seconds. Remove, and set aside to cool. Repeat process with remaining tortillas. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip each tortilla into the sauce, so that each is completely coated. Then fill each with about three tablespoons of the cheese and onion mixture. Roll them like cigars, and serve with more cheese and minced onion sprinkled on top. </p>"}]}