{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101221-129824-coffee-caramel-ice-cream.JPG", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["caramel", "coffee", "frozen desserts", "ice cream", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Irish Coffee Caramel Ice Cream with Shaved Dark Chocolate and Candied Pecans", "link": "https://www.seriouseats.com/recipes/2011/01/irish-coffee-ice-cream-caramel-chocolate-jameson-whisky-recipe.html", "description": "It has buttery, smoky caramel, a dash of coffee grinds, and a generous helping of whisky for good measure. It's a bracing combination, but oh does it work. <strong>First you taste the coffee, roasted and rich, with the pleasant bitterness of an actual cup of joe.</strong> Then comes the caramel to sweeten things up just a tad, melting to sweet buttery goodness. Then the whisky: the more ice cream you eat, the more you taste it.", "totalTime": "5 to 6 hours, or overnight", "recipeYield": "makes 1 quart", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 1/2 cups sugar", "2 tablespoons butter, cut into small pats", "3 cups half-and-half (or 1 1/2 cup each cream and whole milk)", "1 teaspoon medium grind coffee", "1/2 to 1 teaspoon kosher salt, to taste", "4 tablespoons Scotch or Irish whiskey (recommended: Jameson)", "6 egg yolks", "2 ounces dark chocolate, about 70% cacao, shaved fine with a vegetable peeler and chilled in freezer", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2014/12/mexican-spiced-chocolate-pecans-nuts-recipe.html\">candied pecans</a>, chilled in freezer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sugar to a three quart saucepan with enough water to just moisten sugar, about 1/4 cup. Place on high heat and bring to a boil. Let caramel form and darken, rotating pot if hot spots form. When caramel has turned dark amber and starts to smoke, turn off heat and stir in butter with a wooden spoon. Caramel will bubble, so watch for steam. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When butter is fully integrated, add half-and-half in a steady stream and stir to combine. Caramel will bubble high and steam. When dairy is fully incorporated, add coffee. If caramel seizes up, stir it on low heat until it dissolves. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk egg yolks well until lemony in color and thickened. Add a ladle of caramel mixture to yolks, whisking constantly. Repeat until bottom of bowl is warm to touch. Transfer yolk mixture to pot and whisk to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pot over medium-low heat and cook, whisking frequently, until a custard forms on a spoon and a finger swiped across the back leaves a clean line, or until custard temperature reaches 170°F. Stir in whiskey and salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain custard through a fine mesh strainer and chill in either ice bath or refrigerator until it is very cold, about 40°F. Churn in ice cream maker according to manufacturer's instructions, adding chocolate shavings and pecans in last minute of churning, then transfer to an airtight container and to harden in freezer for at least 4 hours before serving.</p>"}]}