{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110516-127355-dinner-tonight-indian-chicken-spinach.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "Madhur Jaffrey", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chicken with Spinach", "link": "https://www.seriouseats.com/recipes/2011/05/chicken-with-spinach-recipe.html", "description": "Don't let the recipe's name fool you. While <strong>Madhur Jaffrey</strong> isn't exactly lying about the contents of this dish from <em><a href=\"http://www.amazon.com/dp/0307268241/?tag=serieats-20\">At Home with Madhur Jaffrey</a></em>&mdash;there's both chicken and spinach&mdash;it's just that it doesn't tell the whole story. I thought briefly about changing the name, but where would I even begin? The spinach is flavored with <strong>garlic, onion, ginger, paprika, cayenne, cinnamon, and cardamom.</strong> It comes out piquant and lively, yet still strangely soothing. It's so good, you might want to double the amount.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Chicken", "Dinner Tonight", "Spinach"], "recipeIngredient": ["2 medium onions, chopped", "One 2-inch piece fresh ginger, peeled and chopped", "6 garlic cloves, chopped", "1 tablespoon paprika", "½ teaspoon cayenne pepper ", "4 chicken legs, separated into drumsticks and thighs", "5 tablespoons olive oil ", "Salt and black pepper ", "Two 2-inch cinnamon sticks ", "8 whole cardamom pods", "10 ounces fresh spinach leaves, chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions, ginger, garlic, paprika, and cayenne pepper to a food processor. Pulse all the ingredients until finely chopped, stopping before mixture turns into a puree. If you don’t have a food processor, then you’ll need to finely chop the onions, ginger, and garlic, and then combine them in a bowl with the paprika and cayenne. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken pieces with salt and pepper on both sides. Heat olive oil in a large heavy-bottomed saute pan or a large Dutch oven over medium-high heat until shimmering. Add cinnamon and cardamom and let them sizzle for a few seconds. Add as many chicken pieces as will comfortably fit in one layer. Cook pieces until browned, three to four minutes, and then flip and brown on the other side, another three to four minutes. Remove pieces, leaving the whole spices behind, and set aside on a large plate. Repeat process, if necessary, with remaining pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium and add mixture from the food processor. Cook, stirring often, until most of the liquid has evaporated, four to five minutes. Add spinach and ½ teaspoon salt. Cook, stirring occasionally, until spinach is wilted, four to five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return all of the chicken pieces to the saucepan or dutch oven. Add ½ teaspoon salt and ½ cup water, and turn the heat to high. Once it starts to boil, reduce heat to low, cover, and simmer very gently until chicken is cooked, about 25 minutes. Stir contents occasionally during the process. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve chicken pieces with the spinach and some white rice. </p>"}]}