{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111128-181382-world-best-biscuits.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["American Flavor", "Andrew Carmellini", "biscuits", "bread", "Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Andrew Carmellini's World's Best Biscuits. End of Story.", "link": "https://www.seriouseats.com/recipes/2011/11/the-worlds-best-biscuits-recipe.html", "description": "I've never been able to make a successful batch of biscuits. My botched attempts have reached the double digits. I finally just assumed me and biscuits weren't meant to be.  But I reconsidered this notion after coming across a recipe in <a href=\"http://andrewcarmellini.com/about/#content\">Andrew Carmellini</a>'s <em><strong><a href=\"http://www.amazon.com/American-Flavor-Andrew-Carmellini/dp/0061963291/?tag=serieats-20\">American Flavor</a></strong></em> entitled <strong>The World's Best Biscuits&mdash;End of Story</strong>.  Any biscuits with a name like that were certainly worth their weight in flour, buttermilk, and shortening.", "totalTime": "45 minutes", "recipeYield": "makes 8 to 10 biscuits", "recipeCategory": ["Biscuit", "Breakfast and Brunch", "Cook the Book"], "recipeIngredient": ["<strong>For the Honey-Butter Topping:</strong>", "3 tablespoons unsalted butter, cut into small pieces", "3 tablespoons honey ", "1/4 teaspoon salt ", " ", "<strong>For the Biscuits:</strong>", "4 1/2 cups all-purpose flour, plus extra for flouring your work surface and rolling pin", "1 teaspoon baking soda", "1 tablespoon plus 2 teaspoons baking powder", "1 teaspoon salt", "2 teaspoons sugar ", "1 cup solid vegetable shortening", "2 1/2 cups buttermilk "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Honey-Butter:</strong> Bring 2 tablespoons of water to a boil in a small pot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly whisk in the butter, piece by piece, letting each piece melt completely into the water before adding the next one. Add the honey and salt, and whisk everything together until you have a shiny, well-combined liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the honey butter sit in a warm area of the kitchen, or over the lowest possible fl ame on the stove, until you’re ready to use it. It’s important to keep it warm so it will spread easily—and the longer you let it sit, the better the honey butter will be. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Biscuits:</strong> Preheat the oven to 425°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, sift together the fl our, baking soda, baking powder, salt, and sugar. (If you don’t have a sifter, you can use a whisk.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the vegetable shortening. Using a pastry cutter, or holding a butter knife in each hand, cut through the shortening and flour in an X-shaped motion until the shortening is mixed in. Be careful to break up any large pieces. You should end up with lots of little pebbles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the buttermilk and use your hands to mix everything together, turning the mixture until it forms a dough. Then keep turning and kneading until you’ve got a roughly shaped ball of dough. If things get sticky, add a little bit of flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour a board or countertop well, and turn the dough out on it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your rolling pin, and then roll the dough out until it forms a round about 1/2 inch thick. Fold the dough round into thirds, like you’re folding a business letter. Slap the dough down hard with the palms of your hands to really bring it together, and then roll it out and fold it in again. Do this 7 times in all, skipping the folding step the seventh time. Reflour the work surface, the dough, and the rolling pin as you go. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour a 31/2-inch round pastry cutter, and cut out as many rounds of dough as possible (you should have 8 to 10 or so). Reflour the cutter as you go. (When we make these at the restaurant, we usually bake off the leftover pieces and eat them ourselves.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover a baking sheet with parchment paper, lay the biscuits on it, and put it on the middle oven rack. At about the 10-minute mark, turn the baking sheet so that all the biscuits bake evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the biscuits are baked through and the tops are golden-brown (about 20 minutes), pull them out of the oven. Using a big pastry brush, coat the tops of the biscuits with the honey butter. The biscuits will be very soft and flaky inside, with just a little bit of crispness on the outside. Serve them while they’re hot.</p>"}]}