{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111209-182576-scotch-vanilla-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["frozen desserts", "holiday desserts", "ice cream", "Scooped", "scotch", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Scotch Vanilla Bean Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/12/single-malt-scotch-vanilla-bean-ice-cream-recipe.html", "description": "This is everything vanilla ice cream should be: impossibly rich and smooth with deep notes of honey, caramel, and flowers. A good Highland Scotch (I'm partial to Glenlivet 12) brings out the best flavors of vanilla while also adding depth. There's a good amount of salt to keep you coming back for another bite. Add salt slowly and adjust it to your tastes.", "totalTime": "2 hours, plus an overnight chill", "recipeYield": "makes 1 quart", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["2 cups cream", "1 cup whole milk", "1 vanilla bean (Mexican or Bourbon), split and scraped", "8 egg yolks", "3/4 cup sugar", "1 teaspoon vanilla extract (see note)", "3 tablespoons Highlands Scotch whisky (recommended: Glenlivet 12)", "1 teaspoon kosher salt, or to taste (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy saucepan, bring cream and milk to a bare simmer. Stir in vanilla bean and seeds, cover, and let steep for one hour. Remove bean, wash away dairy, and set aside to dry. Spent bean can be added to a jar of sugar to make vanilla sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together egg yolks and sugar in a bowl until well-combined and light in color. Slowly pour yolk mixture into dairy mixture, whisking well to combine. Cook custard on low heat, whisking frequently, until it thickens, coating the back of a spoon but leaving a clean line when swiped with a finger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain into an airtight container, then stir in vanilla extract and Scotch. Add salt to taste. Chill overnight, then churn the next day according to manufacturer's instructions. Eat immediately as soft-serve or let firm up in freezer for two to three hours.</p>"}]}