{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110606-155347-arnie-palmer-jelly-shots.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Drink the Book", "Jelly Shot Test Kitchen", "jelly shots", "lemonade", "Michelle Palm", "sweet tea", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Drink the Book: Arnie Palmer Jelly Shots", "link": "https://www.seriouseats.com/recipes/2011/06/drink-the-book-arnold-palmer-jello-shots-recipe.html", "description": "Sweet tea vodka is quick becoming one of this summer's guilty pleasures. Mixed with club soda and garnished with a wedge of lemon, the stuff goes down just about as easy as its zero proof inspiration, making it prime jelly shot material. Once set and sliced, these shots end up being just as refreshing as their sippable inspiration but a whole lot more fun.", "totalTime": "3 hours", "recipeYield": "18 to 24 jelly shots", "recipeCategory": ["Cocktails", "Drink the Book"], "recipeIngredient": ["<strong>Lemon Syrup</strong>", "1 ½ cups water", "1 cup granulated sugar ", "4 medium lemons, each cut into 8 wedges", "&nbsp;", "<strong>Simple Syrup</strong>", "1 cup granulated sugar ", "1 cup water", "&nbsp;", "<strong>Tea Layer</strong>", "1/2 cup brewed unsweetened black tea ", "1 envelope Knox gelatin", "1/2 cup sweet tea vodka", "1 to 2 teaspoons Simple Syrup or agave nectar, if desired", "&nbsp;", "<strong>Lemonade Layer</strong>", "2/3 cup Lemon Syrup", "1 envelope Knox gelatin", "1/3 cup vodka"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Lemon Syrup:</strong>Combine all ingredients in a medium saucepan. Muddle the lemon wedges. Bring to a rolling boil over medium heat. Reduce heat to low and simmer for 5 minutes. Remove from the heat and strain immediately. Allow the syrup to cool to room temperature.</p>\n\n<p><br />\n<small><strong>Short cut:</strong> A 50-50 mix of frozen lemonade concentrate and water may be substituted for Lemon Syrup. Make sure to strain to remove any lemon pulp!</small><br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Simple Syrup:</strong>Combine sugar and water in a medium saucepan. Heat over medium heat until the sugar is dissolved, about 5 minutes. Remove from the heat and allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Tea Layer:</strong> Pour the brewed tea into a small saucepan and sprinkle with the gelatin. Allow the gelatin to soak for a minute or two. Heat the mixture over very low heat, stirring constantly, until gelatin is dissolved, about 5 minutes. Remove from the heat and stir in the sweet tea vodka. Taste and add the simple syrup, if desired. Pour mixture into loaf pan and refrigerate until set, 1 to 2 hours. (When set, the mixture will be cloudy.) Prepare the Lemon Layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Lemon Layer:</strong> Pour the lemon syrup into a small saucepan and sprinkle with the gelatin. Allow the gelatin to soak for a minute or two. Heat the mixture over very low heat, stirring constantly, until gelatin is dissolved, about 5 minutes. Remove from the heat, and stir in the vodka. Allow the mixture to cool slightly.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the set Tea Layer from the refrigerator. Using a fork, rake the set mixture until small, uniform globules form. Ladle the Lemonade mixture into the pan over the Tea Layer. Return the pan to the refrigerator until fully set, several hours or overnight.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cut into desired shapes. Makes 18 to 24 jelly shots.</p>"}]}