{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110311-bagel-recipe-dough-fp-ball.jpg", "author": {"@type": "Person", "name": "Adam Kuban"}, "recipeCuisine": "", "keywords": ["bagels", "baking", "breads", "brunch", "Jo Goldenberg's bagels"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7", "ratingCount": "20"}, "name": "Homemade Bagels, à la Jo Goldenberg", "link": "https://www.seriouseats.com/recipes/2011/03/how-to-make-homemade-bagels-a-la-jo-goldenberg-recipe.html", "description": "[Photographs: Adam Kuban] This is my go-to recipe for homemade bagels. It's adapted from Bernard Clayton's Complete Book of Breads. Clayton, in turn, got the recipe from the folks at the now-defunct Jo Goldenberg's, the famous Jewish restaurant and delicatessen...", "totalTime": "3 hours", "recipeYield": "makes 10 bagels", "recipeCategory": ["Bread"], "recipeIngredient": ["19.25 ounces bread flour (3 1/2 cups) [<em>530g</em>]", "1/4 ounce instant dry yeast (2 1/2 teaspoons; or 1 envelope active dry) [<em>7g</em>]", "2 tablespoons sugar", "1 tablespoon salt", "12 ounces hot water (1 1/2 cups, 120°&ndash;130°F) [<em>340g</em>]", "1 1/2 tablespoons malt syrup (for the boiling water; alternatively, you can use 1 1/2 tablespoons sugar)", "1 egg beaten with 1 teaspoon water (optional, for toppings)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add all the dry ingredients to the bowl of a food processor and pulse until mixed, about 5 seconds. With processor running, slowly add the water; process until dough comes together and rides up over the blade, about 30 seconds. Continue processing until dough becomes satiny and elastic, about 30 seconds more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough to a large, lightly oiled bowl and cover tightly with plastic wrap. Let rise until doubled in bulk, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After dough has risen but before you divide and shape it, prepare your water bath: Add the malt syrup to 6 quarts of water over high heat and let it come to a boil as you continue with the following steps.</p>\n\n<p>Also: Preheat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After dough has doubled in bulk, turn it out onto a lightly floured work surface and press down with your fingers to expel the gases. Divide dough into 10 equal portions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ball a portion of dough, then roll it into a \"rope\" about 7 inches long and about 1 inch thick. (Tip: I like to taper the ends slightly in preparation for the next step.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the dough around the back of your hand, overlapping the ends in your palm. Place your hand, along with the dough, palm-down on the work surface and roll dough back and forth until ends crimp and seal together. Place dough ring under a span of plastic wrap while you repeat rope-and-loop process with remaining dough portions.</p>\n\n<p><small>Tip: You can brush a little water on the ends to help them stick, but this dough is wet enough that it usually comes together without help.</p>\n\n<p>A note on hand size: The recipe calls for wrapping the rope around your palm, but I like a smaller, tighter bagel, so I wrap it around my first three fingers, as shown. If you have a smaller hand, you could probably wrap it around all your fingers.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow bagels to rise again for 10 minutes. At this point, your malt syrup&ndash;water should be boiling. Use a skimmer or slotted spoon to carefully add bagels, one at a time, to the water. (Note: no more in the pot than 3 at a time.) Bagels should sink but then rise again after a few seconds. Simmer for 1 minute, flipping bagels at the 30-second mark.</p>\n\n<p><small>Tip: The original recipe calls for this second rising, but I often skip it. I've found it makes very little, if any, noticeable difference.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bagels from water with skimmer or slotted spoon to a clean kitchen towel. Pat dry.</p>\n\n<p>If making plain bagels, proceed to Step 10.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For bagel toppings: </strong>Place bagels on wire cooling rack set over a rimmed baking sheet. Brush bagel tops with egg-water mixture. Shake on desired toppings. Sesame seed, poppy seed, kosher salt, minced onion, and minced garlic are classic (at least in NYC).</p>\n\n<p>The baking sheet will collect excess dry toppings (such as sesame or poppy seeds). Simply pour them back into their containers for reuse.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bagels on prepared baking sheet. Bake until light brown and shiny, 15 to 20 minutes. Flip, and bake until reverse side is golden-brown and shiny, about 10 minutes more.</p>"}]}