{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/bread-baking-three-dough-braided.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "oatmeal", "rye"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Three Doughs Braided into One Loaf", "link": "https://www.seriouseats.com/recipes/2011/08/bread-baking-three-dough-night.html", "description": "This recipe is a three-fer. Yup. Three different bread recipes in one. I was already baking two loaves for other people, then decided to make a third for myself (why not, right?). But instead of making a triple batch of one dough, I made three different doughs&mdash;rye, white wheat, and oatmeal&mdash;then combined them in a braided loaf.", "totalTime": "3 hours (plus overnight rise)", "recipeYield": "Makes 3 loaves", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["<strong>For the Rye Dough:</strong>", "1 1/4 cups cool water", "2 teaspoons yeast", "1 tablespoon raw cane sugar", "9 ounces (about 2 cups) bread flour", "4 ounces (about 1 cup) rye flour", "1 teaspoon salt", "1 tablespoon olive oil (for plastic bag)", "<strong>For the White Wheat Dough:</strong>", "1 1/4 cups cool water", "2 teaspoons yeast", "1 tablespoon raw cane sugar", "9 ounces (about 2 cups) bread flour", "1 cup (4 1/2 ounces) white wheat flour", "1/4 cup flax seeds", "1 teaspoon salt", "1 tablespoon olive oil (for plastic bag)", "<strong>For the Oatmeal Dough</strong>", "1 1/4 cups cool water", "2 teaspoons yeast", "1 tablespoon raw cane sugar", "9 ounces (about 2 cups) bread flour", "1 cup quick-cooking oats", "1 teaspoon salt", "1 tablespoon olive oil (for plastic bag)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the tablespoon of oil into three separate zip-top plastic bags.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each type of dough, put all of the remaining ingredients in a bowl. Mix until well combined. The dough doesn't need to be kneaded or smooth - just until everything is mixed in. You can do this in a stand mixer, if you prefer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place each type of dough into its own bag. Make sure the dough is coated with oil, squeeze the air out of the bag, zip the top, and place in the refrigerator for an overnight rest.</p>\n\n<p><em>Here's a tip.</em> Keep in mind that these doughs will rise, so arrange them so they're less likely to leap out at you when you open the refrigerator in the morning. For example, stacking them on top of each other is precarious. Putting them next to each other works much better.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the morning, take the doughs out of the refrigerator, open the bags to release the air, gently knead the dough while still in the bag and flatten it, seal the bags and let them rest on the counter for an hour. For more even warming, don't stack them on top of each other.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After an hour, flour your work surface, preheat the oven to 350 degrees, and line three baking sheets with parchment paper. Turn out the first dough, knead it briefly to incorporate the oil and divide the dough into thirds. Form each third into a log. Do the same with the second and third doughs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, take each log and roll it out into a rope about 14-16 inches long. Try to make them all the same length. Take one log of each type of dough and braid it. It's easiest to do this if you pinch the doughs together on one end first, before you begin the braid. Don't braid tightly - the dough needs room to rise. Also, look at the ropes and have the prettiest side facing up when you braid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you finish the braid, pinch the end to seal, then fold both ends under the dough. Place the dough on one of the prepared baking sheets, arrange it so that it's even, cover with plastic wrap, and set aside to rise until double, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, remove the plastic wrap and bake until nicely browned, about 35 minutes. Let the bread cool on a rack before slicing.</p>"}]}