{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110203-aguadito-se-pollo.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "chicken", "soup", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Aguadito de Pollo", "link": "https://www.seriouseats.com/recipes/2011/03/aguadito-de-pollo-sunday-brunch-chicken-soup-recipe.html", "description": "Sometimes there is nothing like a big bowl of soup, and just because it's the morning is no reason to let the urge for a comforting soup pass.  <strong>Aguadito de pollo</strong> is a hearty soup that is filling but not heavy.  Soups like this are served throughout South America, but this version is based on a Peruvian version.", "totalTime": "1 hour", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Chicken", "Eggs", "Mains", "Soups and Stews"], "recipeIngredient": ["4 eggs", "2 bone in chicken breasts (about 2 pounds)", "2 quarts low sodium store-bought or homemade chicken stock", "2 cloves or garlic, thinly sliced", "1 chili pepper, cut in half and seeded.", "2 yukon gold potatoes", "6 ounces egg noodles", "salt and pepper", "1 lime, quartered", "1 bunch cilantro, roughly chopped", "4-6 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place eggs in small sauce-pan and cover with cold water; bring to a boil, cover, and let sit 8 minutes.  Remove skin from chicken and simmer with sliced garlic and half a chili pepper in stock until meat is fully cooked, about 30 minutes.  Take chicken breasts out of the stock, remove bones and shred meat into large pieces, reserving meat, and discarding bones. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut potatoes into quarters and cook in stock until tender, about 15 minutes.  Add egg noodles to stock and cook until tender, for 4-5 minutes.  Place chicken meat back in the pot to reheat, and season with salt and pepper to taste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide soup between bowls, making sure each one gets meat, potatoes, noodles and lots of stock.  Slice each hard-boiled eggs in half and place on top of soup.  Serve with plate of sliced limes, chopped cilantro, leftover half-chili thinly sliced, and chopped scallions for each person to garnish their own soup.  </p>"}]}