{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110120-French-Onion-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["dips", "French onion dip", "onions", "Super Bowl dips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.3333333333333", "ratingCount": "9"}, "name": "Real French Onion Dip", "link": "https://www.seriouseats.com/recipes/2011/01/real-french-onion-dip-recipe.html", "description": "A creamy dip with an intensely onion flavored base. A splash of lemon juice adds some brightness while a bit of Worcestershire sauce gives it a meaty, umami-ful backbone. Looking to up the umami factor even more, I decided to...", "totalTime": "1 1/2 hours", "recipeYield": "8 to 10 as a snack (makes about 2 cups)", "recipeCategory": ["Christmas", "Condiments and Sauces", "The Food Lab"], "recipeIngredient": ["2 teaspoons sugar", "3 large yellow onions, finely diced (about 1 quart)", "1 tablespoon butter", "1/4 teaspoon baking soda", "Kosher salt and freshly ground black pepper", "1/2 cup water", "3/4 cup sour cream", "1/2 cup mayonnaise", "1 teaspoon lemon juice", "1/2 teaspoon Worcestershire sauce", "1/2 ounce finely grated Parmesan cheese", "1 tablespoon finely sliced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat sugar in a 12-inch stainless-steel skillet over medium-high heat until completely melted and light brown, about 3 minutes. Immediately add onions and stir with wooden spoon to coat onions in sugar. Add butter, baking soda, 1 teaspoon salt, and a few grinds black pepper. Toss to combine. Cook, shaking pan occasionally until onions release all their liquid and brown coating builds up on bottom of pan, 6 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons water shake pan while scraping with wooden spoon to deglaze brown bits from bottom of pan. Continue cooking, shaking occasionally until coating begins to build up again, 3 to 5 minutes. Repeat deglazing and cooking steps three more times until all water is used up and onions are deep brown. Transfer to medium mixing bowl and allow to rest at room temperature for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sour cream, mayonnaise, lemon juice, parmesan, and Worcestershire and whisk to combine. For smoother texture, run through blender or food processor. Chill in a sealed container for at least 1 hour and up to 5 days (flavor will improve with time). Spoon into a bowl, sprinkle with chives, and serve with chips.</p>"}]}