{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110901-dt-steak-sandwich-with-corn-and-avocado.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beef", "Dinner Tonight", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Steak Sandwich with Corn, Tomato, and Avocado", "link": "https://www.seriouseats.com/recipes/2011/09/dinner-tonight-steak-sandwich-with-corn-tomato-and-avocado-recipe.html", "description": "It may be September, but that doesn't mean summer is over&mdash;certainly not with all the late-summer corn available for eating. I can't resist buying corn when it's both cheap and good. One thing I discovered this year is that it doesn't really need to be cooked: You just cut if off the cob, toss with some lime juice, olive oil, salt and pepper, and it makes a phenomenal addition to a salad or as a relish. That's the idea for the topping in this <a href=\"http://articles.sfgate.com/2011-08-07/food/29857604_1_fresh-corn-corn-relish-red-peppers/2\">steak sandwich recipe from the <em>San Francisco Chronicle</em></a>, in which fresh corn gets mixed with sweet tomatoes and fragrant basil. You can't go wrong with those three together.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Dinner Tonight", "Sandwiches"], "recipeIngredient": ["1 cup tomato chunks, from large heirlooms or cherry tomatoes", "1 1/2 cups fresh corn kernels, about 2 ears", "1 clove garlic, minced", "2 to 3 tablespoons lime juice", "3 tablespoon olive oil", "Kosher salt and ground black pepper, to taste", "2 tablespoons thinly sliced basil", "1 pound beef, sliced paper thin", "1 baguette, cut into 6-inch split segments", "3-4 tablespoons mayonnaise", "1 large avocado, pitted and sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine the tomato, corn, garlic, lime juice, and 1 tablespoon of olive oil.  Season to taste with salt and pepper, stir in the basil, and taste again for acidity and salt.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large grill pan over high heat until smoking. Toss the sliced beef with 1 tablespoon of olive oil and season generously with salt and pepper. Add the beef to the pan and cook untouched until almost cooked through and charred in places. Toss the meat with tongs to redistribute and cook until completely cooked through, about 30 seconds longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the beef to a plate to rest, drizzle remaining tablespoon of oil over it, and grill the baguette pieces for a minute to soften and warm them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread mayonnaise on one side of each baguette and top with the steak.  Spoon relish over the other half, top with avocado, repeat with remaining sandwiches, and serve.</p>"}]}