{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111025-nasty-bits.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["marrow bones", "Nasty Bits", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Marrow and Rice", "link": "https://www.seriouseats.com/recipes/2011/10/marrow-and-rice-recipe.html", "description": "Bone marrow and rice is one of my favorite combinations. You really only hear about Risotto Milanese, that famed dish of Arborio rice cooked in marrow with stock and saffron, but the idea of using bone marrow with rice is a fungible one.  Any kind of starchy rice will do, and any kind of bone marrow, too.", "totalTime": "1 hour", "recipeYield": "four to six", "recipeCategory": ["Rice", "The Nasty Bits"], "recipeIngredient": ["1/4 cup brown or wild rice", "3/4 cup water", "1/2 teaspoon salt", "2 sections bone with marrow, approximately 4 tablespoons marrow", "4 to 6 additional sections of bone marrow for roasting", "1/2 cup finely diced onion", "3 cloves garlic, smashed and chopped ", "1 tablespoon diced ginger", "2 cups short grain rice", "4 to 5 cups stock and water from dried mushrooms", "kosher salt to taste, about 1/2 to 1 teaspoon", "1/4 cup dried shitake or porcini mushrooms rehydrated in 1 cup (save the water)warm water", "chopped scallions or cilantro to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place brown rice and water in a 2 quart saucepan.  Bring to a simmer over low heat and stir in salt to taste, about 1/2 teaspoon.  Simmer until the rice is cooked al dente, 45 to 50 minutes, stirring occasionally.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop the mushrooms and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Render the bone marrow in the 3-quart sauce pan over medium heat.  Add the onions, garlic, and ginger. Cook until onions are tender and translucent, about 5 minutes.  Add the rice and stir until the grains are coated in fat and lightly toasted.  Add 3 cups of the stock and mushroom-soaked water.  Add the mushrooms. Lower the heat and simmer the rice, stirring occasionally, until most of the stock is absorbed.  Add another cup of stock and repeat.  The rice should taste slightly raw at this point.  Add more salt as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, preheat the oven to 400 F.  In a shallow pan, roast the marrow bones until browned, about 15 minutes.  Sprinkle with salt to taste and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the brown rice into the white rice.  Then add another cup or so of stock and stir over low heat until just absorbed.  Taste the rice for doneness and adjust for salt.  Have freshly ground black pepper on hand, if desired.  Serve immediately, garnishing with cilantro or scallions and with the roasted marrow bones on the side. </p>"}]}