{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110614-156646-Nick-Malgieri-Strawberry-Tart-610.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["berries", "cream cheese", "desserts", "Nick Malgieri", "strawberries", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Strawberry Cream Cheese Crumble Tart", "link": "https://www.seriouseats.com/recipes/2011/06/nick-malgieri-strawberry-cream-cheese-crumble-tart-recipe.html", "description": "I've often confessed to being addicted to crumb topping. Recently, I found a new way to enjoy it&mdash;atop a tart that has a prebaked crust and a creamy filling. Right now it's sweet local berry season, so take advantage of them in this tart.", "totalTime": "50 minutes", "recipeYield": "Makes one 10-inch tart, about 8 servings", "recipeCategory": ["Pies, Tarts, and Crumbles", "Strawberry"], "recipeIngredient": ["One unbaked <a href=\"http://www.seriouseats.com/recipes/2011/06/cookie-dough-tart-crust-recipe.html\">Cookie dough tart crust</a>, chilled ", " ", "<strong>Almond Crumb Topping</strong>", "1 1/2 cups (7 ounces) all-purpose flour (spoon flour into dry-measure cup and level off)", "1/3 cup (2.5 ounces) sugar", "1/4 teaspoon baking powder", "1/4 cup (1 ounce) slivered or whole blanched almonds, coarsely chopped into 1/4-inch pieces", "1/4 teaspoon ground cinnamon", "1/8 teaspoon salt", "8 tablespoons (4 ounces) unsalted butter, melted", " ", "<strong>Strawberry Cream Cheese Filling</strong>", "1 pound cream cheese, softened", "1 cup (4 ounces) confectioners’ sugar, sifted after measuring", "1 teaspoon finely grated lemon zest", "1 1/2 teaspoons vanilla extract", "1 pound (about 1 1/2 pints) strawberries, rinsed, hulled and halved or quartered if large, or left whole if very small (reserve 1 perfect whole berry)", "Confectioners’ sugar in a shaker for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set racks in the upper and lower thirds of the oven and preheat to 350˚F (180˚C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the topping, in a medium mixing bowl, stir together the flour, sugar, baking powder, cinnamon and salt. Stir in the almonds. Use a rubber spatula to stir in the butter. Let the mixture stand for a few minutes, then use your fingertips to break the mixture into 1/4- to 1/2-inch crumbs. Scatter the crumbs on the prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the tart crust in the lower third of the oven and the crumb topping in the upper third. After 10 minutes, remove the paper and beans from the tart shell and place it on the upper rack and the crumbs on the lower one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue baking the tart shell until it is dry and light golden, 15 to 20 additional minutes. Bake the crumb topping until it is deep golden and firm, 10 to 15 additional minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the crust and the topping on racks. If the crumbs have clumped together during baking, let them cool completely and then use a bench scraper or table knife to chop them coarsely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the cream cheese filling, place the cream cheese in the bowl of an electric mixer fitted with the paddle attachment and beat on medium speed just until it is smooth. Beat in the confectioners’ sugar, lemon zest and vanilla and continue beating until lightened, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the tart, spread half the cream cheese filling on the bottom of the tart crust and arrange the berries on it, cut side down. Spread the remaining filling over the berries. Evenly scatter the crumb topping over the filling. Right before serving, lightly dust the topping with confectioners’ sugar and place the reserved berry in the center of the tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serving:</strong> Unmold the tart and slide it off the pan base to a platter. Serve wedges of the tart&mdash;it needs no accompaniment.<br />\r\n<strong>Storage:</strong> You may have all the components ready, but don’t assemble the tart until a few hours before you intend to serve it. Keep it at a cool room temperature until you do. Wrap and refrigerate leftovers and bring to room temperature before serving again. The crust will soften after it has been refrigerated.</p>"}]}