{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110912-169325-rainbowcakespytop.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "layer cakes", "rainbow cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rainbow Layer Cake", "link": "https://www.seriouseats.com/recipes/2011/09/rainbow-layer-cake-recipe.html", "description": "A six-layer cake in all the colors of the rainbow, this one is dramatic to cut into and always seems to elicit an \"oooooooh\" response. It is impossible to be unhappy while eating this cake.", "totalTime": "4 hours", "recipeYield": "12-14", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["<strong>For the cake:</strong>", "2 batches of your favorite vanilla or yellow cake batter, 9x9-inch pan yield", " ", "<strong>For the frosting:</strong>", "4 sticks (2 cups) unsalted butter, softened", "12-14 cups confectioners' sugar, sifted", "1/4 cup heavy cream, plus 2 tablespoons", "3 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven as specified in your cake recipe. Line six round cake pans (8- or 9-inch) with circles of parchment paper. If you don’t have six pans (it’s OK, neither do I), line as many as you have; you can bake this in a few batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter between six separate bowls. Add food coloring to each of the bowls of batter: red, orange, yellow, green, blue, and violet. Be very liberal with the food coloring, as the colors will fade slightly during baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pans and bake. Since these cakes are fairly thin, keep an eye on the baking time—it will be significantly less than if you were baking all of the batter as a single layer cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once baked, remove the cakes from the pans and set them on wire racks to cool. While you wait for the cakes to cool, prepare the frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the stand mixer with the paddle attachment, mix the butter on medium speed until it is very fluffy. Add 4 cups of the confectioners’ sugar, and mix on low speed until smooth and incorporated. Pause to scrape down the sides of the bowl, and add the cream and vanilla. Beat on medium speed until smooth and creamy, 3 to 5 minutes, continuing to add more sugar, cup by cup, until it has reached your desired spreading consistency. If your frosting becomes too stiff, you can thin it by adding more cream, but be careful to add the cream in small (teaspoon) increments so that the frosting does not become too thin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large knife (preferably serrated), slice the tops of the cakes to make them level. Place the violet layer on a serving plate and top with a dollop of frosting. Do not spread it to the edges, as the weight of the succeeding layers will flatten the frosting. Repeat with the remaining layers until they are stacked from bottom to top: violet, blue, green, yellow, orange, and red on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To stabilize the cake, place 2 to 3 long skewers down through it (just don’t forget to remove them from the slices when served!). Chill the cake for at least 20 minutes; it will help it firm up and be easier to frost. Using an offset spatula, apply a thin crumb coat of frosting to all of the cake surfaces. Return the cake to the refrigerator for about 30 minutes so that the crumb coat becomes firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the refrigerator and apply the rest of the frosting. Keep the cake chilled until 30 minutes before serving.</p>"}]}