{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110125-butternutsquashrisotto.jpg", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["butternut squash", "Eat for Eight Bucks", "rice", "risotto", "scallions", "squash", "Valentine's Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Eat For Eight Bucks: Butternut Squash and Scallion Risotto", "link": "https://www.seriouseats.com/recipes/2011/02/eat-for-eight-bucks-butternut-squash-and-scallion-risotto-recipe.html", "description": "Risotto gets a bad wrap for being difficult. I happen to think the opposite. And the reputation of this dish will only further yours if you pull it off.", "totalTime": "30 minutes", "recipeYield": "2-3", "recipeCategory": ["Eat for Eight Bucks", "Rice", "Squash"], "recipeIngredient": ["1 small butternut squash (around 1 ½ pounds), peeled, seeded, and cut into 1-inch cubes", "1 quart chicken or vegetable stock", "2 tablespoons olive oil", "1 shallot, sliced", "3 scallions, thinly sliced (white and green parts divided) ", "2 garlic cloves, minced", "¾ cup Arborio rice", "1/4 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the squash and the stock in a medium saucepan over high heat. Simmer, uncovered, until the squash is tender, about 15 minutes. Set aside over low heat to keep warm while you proceed with the recipe. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat a dutch oven or deep sauté pan with the olive oil, and set it over medium heat. Add the the shallot, white parts of the scallions, and garlic and cook until fragrant and beginning to brown, about 3 minutes. Add the rice and continue to stir until the grains are covered in oil and beginning to toast, about 1 minute. Add ½ tsp of salt and the wine and cook, stirring, until nearly evaporated, about 3 minutes. Turn the heat down to medium-low, and add 1 cup of the warm stock, stirring occasionally until the rice has absorbed the liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue adding stock to the pot in ½ cup portions, stirring occasionally until each batch is absorbed before adding more. You don’t need to be constantly stirring, but you also want to make sure that the rice does not stick to the bottom of the pan. When the liquids are almost absorbed, add the next ½ cup of stock and repeat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rice is nearly cooked through, add the remaining stock and the squash cubes. Stir in the green parts of the scallions, reserving some for garnish. To serve, ladle the risotto into bowls and sprinkle with the remaining scallions.  </p>"}]}