{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110802-dt-steak-with-anchovy-butter.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["anchovies", "butter", "Dinner Tonight", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Steak with Anchovy Butter", "link": "https://www.seriouseats.com/recipes/2011/08/steak-with-anchovy-butter-recipe.html", "description": "Anchovies and steak are actually old friends. You didn't know? Well, anchovies are actually hiding in plenty of sauces, including Worcestershire. Even when mixed with other ingredients, anchovies have tremendously deep and rounded flavors that complement steak.", "totalTime": "55", "recipeYield": "4", "recipeCategory": ["Beef", "Dinner Tonight"], "recipeIngredient": ["2 pounds steak, at room temperature", "kosher salt", "1 clove garlic, green shoot removed, roughly chopped", "3 anchovy fillets, soaked in water for 15 minutes", "1/8 teaspoon kosher salt", "1 teaspoon olive oil", "2 tablespoon coarsley chopped flat leaf parsley", "1 stick unsalted butter", "freshly cracked black pepper", "1 tablespoon canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the steaks generously with kosher salt and set aside for at least 40 minutes for them to come to room temperature and absorb the salt (if time does not permit, don't salt them until just before cooking).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic, anchovies, salt, and olive oil in a mortar and pestle and mash to a smooth paste (or mince the ingredients together on a cutting board, mashing with the side of a knife to create a paste).  Add the parsley and grind with the pestle until well-combined with the garlic and anchovies.  Mix in the butter and a few grinds of black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the steaks very dry with paper towels.  Prepare a hot grill and rub oil onto the grates (or heat the oil in a large, heavy skillet with ample room for the steaks over high heat until smoking).  Cook the steaks for 3-5 minutes per side for medium-rare, depending on thickness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the steaks from the grill or pan and immediately spoon the butter over them.  After letting them rest for 5-7 minutes, slice and serve.</p>"}]}