{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110711kombuchaprimary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Andrew Schloss", "Drink the Book", "Homemade Sodas", "kombucha", "orange", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Drink the Book: Orange Kombucha", "link": "https://www.seriouseats.com/recipes/2011/07/drink-the-book-how-to-make-kombucha-at-home-recipe.html", "description": "I have to admit I was a bit taken aback when I came across kombucha recipes in <a href=\"http://www.mealtime.org/content.aspx?id=184\">Andrew Schloss</a>'s <em><strong><a href=\"http://www.amazon.com/Homemade-Soda-Sparkling-Carbonated-Concoctions/dp/1603427961/?tag=serieats-20\">Homemade Soda</a></strong></em> since I'd always thought of this fermented tea as more of a health tonic than an easy drinking soda.  But when you think about it, kombucha does fall into the flavored carbonated beverage category, regardless of how good for you if might be. Since kombucha has been on my try-it-out-at-home list for quite a while, giving one of Schloss's fermented tea recipes a whirl seemed like the perfect excuse to delve into the world of kombucha mothers and babies.", "totalTime": "10 days", "recipeYield": "1 liter", "recipeCategory": ["Drink the Book", "Non-Alcoholic", "Orange"], "recipeIngredient": ["1/2 cup kombucha tea starter (see first step below)", "1 kombucha tea starter culture (called \"mother\")", "Distilled white vinegar for rinsing equipment", "1 quart spring water or filtered water", "1/4 cup sugar", "5 black tea bags", "1/2 cup distilled white vinegar", "1/2 cup orange juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the kombucha starter tea:</strong> In addition to a starter culture, you will need a starter tea to brew kombucha. For your first batch, this can be store-bought kombucha tea, or a starter tea obtained from a kombucha brewing friend.  In a pinch, you can substitute vinegar.  Then, every time you make kombucha, reserve a small amount (about 1/2 cup) of finished fermented tea mixed with an equal part of distilled white vinegar.  This liquid is called \"starter tea.\"  Pour it over the kombucha starter culture (\"mother\") and store in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse out a medium stainless-steel sauce pan with distilled white vinegar. Add the water to the pan and bring to a boil over medium-high heat. As soon as the water boils, add the sugar and stir to dissolve. Remove from the heat, add the tea bags, cover, and let sit for 20 minutes. Rinse a slotted spoon with vinegar and use it to remove the tea bags from the pot.</p>\n\n<p>Rinse a large (at least 1 1/2 quart) glass jar with distilled white vinegar.  Pour the sweet tea into the glass jar and let cool to room temperature, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the starter tea into the sweet tea and add the starter culture (\"mother\"). Cover the jar with a coffee filter, cheesecloth, or other material that will keep out debris but allow air to circulate.  Secure with a rubber band.  Set in a warm, dark place to ferment for 8 to 12 days (a spot in the basement near a water heater works well).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As the kombucha ferments a new starter culture (called a \"baby\") will form on the surface, while the mother will either float beneath it or sink to the bottom of the jar.  Strings may extend between the two cultures.  When the new baby is almost as big as its mother, it's time to taste-test the kombucha.  Stick a straw partway into the liquid, cover the end still in the air with a finger, and withdraw the straw from the liquid, thereby removing a dropperful.  Taste the kombucha that you've captured in the straw.  If it is refreshingly tart, it's ready.  If not, let the kombucha ferment longer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the kombucha is fully fermented, preserve the starter culture and starter tea for your next batch of kombucha.  Rinse your hands with distilled vinegar, and then lift the mother and baby into a clean glass bowl or glass jar that has been rinsed with vinegar.  Pour 1/2 cup of the unfiltered kombucha over the culture, and add the 1/2 cup distilled white vinegar.  This liquid is starter tea.  Cover tightly and store in the refrigerator for up to 1 to 2 months. (If you're using a jar for storage instead and it has a metal lid, cover the jar with a layer of plastic wrap first, before putting on the lid, to keep the contents from coming into contact with metal.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Filter the remaining kombucha through a damp coffee filter or several layers of damp cheesecloth into a clean glass jar.  Stir in the orange juice and seal the jar with a plastic or plastic-wrap-lined lid.  Let sit at room temperature for 2 to 4 days, until the kombucha is bubbly, and then chill for 24 hours. Serve over ice.</p>"}]}