{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111027-127355-dinner-tonight-chicken-ginger-mole-primary2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "mole"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Dinner Tonight: Chicken Breasts in Ginger Mole (Mole de Jengibre con Pechugas de Pollo)", "link": "https://www.seriouseats.com/recipes/2011/10/chicken-breasts-in-ginger-mole-recipe.html", "description": "While many Mexican mole preparations require 30-odd ingredients and a three-hour simmer, not all do. In fact, if you're quick and well organized this ginger mole from Priscila Satkoff's <em><a href=\"http://www.amazon.com/%C2%A1Salpic%C3%B3n-Cookbook-Contemporary-Mexican-Cuisine/dp/0811860469/ref=sr_1_1?ie=UTF8&amp;qid=1319752251&amp;sr=8-1\">The ¡Salpicón! Cookbook</a></em> can be whipped up in a reasonable 45 minutes.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["<strong>For the Ginger Mole</strong>", "2 ancho chiles, seeded and deveined", "1 pasilla chile, seeded and deveined ", "2 guajillo chiles, seeded and deveined ", "1 plum tomato", "1/2 white onion", "2 garlic cloves, skins left on ", "2 tablespoons fresh ginger, shredded on a box grater", "1/4 cup sesame seeds, toasted", "1 teaspoon black peppercorns ", "2 cups water", "2 tablespoons canola oil ", "sea salt ", "&nbsp;", "<strong>For the Chicken Breasts</strong>", "four 7-ounce skinless, boneless chicken breast halves", "salt and black pepper", "2 tablespoons canola oil ", "sesame seeds for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the ginger mole: Heat a large, dry skillet over medium heat. When hot, add as many of the chiles as will fit in a single layer. Toast the chiles, turning occasionally, until they are fragrant and soft, one to two minutes. Be careful to make sure they don't burn. Set aside when done. Repeat with any remaining chiles. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the top rack of the oven so it is six inches from the broiler. Then turn the broiler on high. Place the onion, tomato, and garlic cloves on a baking sheet and then place under the broiler. Flip the ingredients every other minute or so. Cook the onion half until it is browned around the edges and starting to soften, about five minutes. Cook the tomato until the skin has blackened all over and is easy to peel off, about 5 minutes. Cook the garlic cloves until the skins are browned and the insides are very soft, about 7 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the tomato and the garlic cloves, and then transfer them to a blender along with the chiles, onion, grated ginger, sesame seeds, peppercorns, and water. Let everything cool for a minute or so, and be careful when blending. Process the mixture until smooth. This should take a couple minutes with the blender on high. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two tablespoons of oil into a medium saucepan and turn the heat to medium-high. When oil is shimmering, pour in the mixture. Be careful, as some of it may splatter. Stir well and bring to a boil, and then reduce the temperature to maintain a simmer. Cook, stirring occasionally, until the mole has reduced somewhat, about 10 minutes. Season to taste with salt. When done, cover and turn heat to very low to keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the chicken breasts: Place one chicken breast between two sheets of plastic wrap. Using a meat mallet, pound the chicken breast until it is an even 1/2-inch thick. Repeat with remaining chicken breasts. Season each with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the two tablespoons of oil into a large skillet set over medium-high heat. Place as many of the chicken breasts in as will comfortably fit in one layer (usually two). Cook until golden brown on the bottom, three to four minutes. Flip each, reduce the heat to medium, and cook until the chicken is fully cooked, another three to four minutes. Set the cooked chicken breasts aside, and repeat process with any remaining chicken. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the chicken breasts between four plates. Spoon the ginger mole on top, and garnish with some sesame seeds. Serve this with white rice and/or warm corn tortillas. </p>"}]}