{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110620-02677-Let-Them-Eat.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["ambrosia", "cakes", "coconut", "mango", "pineapple"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ambrosia Layer Cake", "link": "https://www.seriouseats.com/recipes/2011/06/ambrosia-layer-cake-recipe.html", "description": "Ambrosia is a recipe that pops up in most of my Southern cookbooks as well as in my grandmother's chicken-scratched notebooks. A Southern staple since the late 19th century, the term <em>ambrosia</em> means&mdash;according to Greek mythology&mdash;\"food of the gods.\" Its avatar is a bit more pedestrian: though variations exist, at its most basic the dessert is made up of fresh fruits (often sliced oranges) sprinkled with sugar, topped with grated coconut, and sometimes, splashed with a little booze.", "totalTime": "2 hours", "recipeYield": "10 to 12", "recipeCategory": ["Cakes", "Coconut", "Desserts", "Mango", "Pineapple"], "recipeIngredient": ["baking spray for pans", "8 ounces (2 sticks) unsalted butter, at room temperature", "2 cups sugar", "3 large egg yolks", "2 large eggs", "1 cup milk", "2 teaspoons vanilla extract", "1 teaspoon almond extract", "2 3/4 cups cake flour", "2 teaspoons baking powder", "1 1/4 teaspoons salt", "2 tablespoons water", "2 teaspoons unflavored gelatin", "8 ounces cream cheese, softened", "1 cup confectioners’ sugar", "4 cups heavy cream, chilled (See Notes)", "2 cups mini-marshmallows, plus (optional) additional for decorating", "1 1/2 cups sweetened flaked coconut", "1 cup finely chopped fresh pineapple ", "1 large ripe mango, peeled and cut into 1/4-inch dice (about 1 cup)", "1 1/2 cups sliced almonds, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Lightly coat two 9-inch round cake pans with baking spray. Line bottoms with parchment paper and lightly coat paper with baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, beat butter and sugar on medium speed until light and fluffy, about 3 minutes. Add egg yolks and eggs, one at a time, beating well after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In glass measuring cup, combine milk, 1 teaspoon vanilla extract, and almond extract. In medium bowl, combine flour, baking powder, and 1 teaspoon salt. Decrease mixer speed to medium-low and add flour mixture in three batches, alternating with milk mixture. Scrape sides and bottom of bowl with rubber spatula as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter between prepared pans. Bake until cake tester inserted in center of cakes comes out clean, 20 to 25 minutes. Let cake cool in pans set on wire racks 10 minutes, then turn out directly onto the racks and cool completely, 30 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine water and gelatin in small bowl. Microwave until gelatin dissolves, about 20 seconds. Cool to room temperature, about 5 minutes. Place cream cheese, confectioners’ sugar, remaining 1 teaspoon vanilla, remaining 1/4 teaspoon salt, and dissolved gelatin in large bowl and whisk on medium speed until lightly whipped, about 2 minutes. Add cream and whisk just until thickened, about 2 minutes. Reserve 4 cups whipped cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold marshmallows, coconut, pineapple, and mango into remaining whipped cream; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, cut each cooled cake round in half. Place one cake round on serving dish or cake stand and spread with one-third of marshmallow mixture. Top with second cake round and repeat with another third of marshmallow mixture. Repeat with remaining cake rounds and marshmallow mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost sides and cake with reserved plain whipped cream. Press almonds onto sides and top of cake, and decorate with optional additional mini-marshmallows. Refrigerate cake for 30 minutes prior to slicing.</p>"}]}