{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110927-171960-GFTues-Cake.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["cakes", "chocolate", "fall", "gluten free", "Gluten-Free Tuesday"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Tuesday: Allergen-free Chocolate Pumpkin Spice Cake", "link": "https://www.seriouseats.com/recipes/2011/09/gluten-free-tuesday-allergen-free-chocolate-pumpkin-spice-cake-recipe.html", "description": "While pumpkin is an essential ingredient, you don't really taste the mild pumpkin flavor. It's there in just a whisper; the chocolate and spices vie for flavor dominance. If you prefer a less spicy cake, reduce the pumpkin pie spice from two teaspoons to one. This minor change allows the pumpkin to shine just a bit brighter but when competing with chocolate, it's still just a minor player.", "totalTime": "about one hour", "recipeYield": "8", "recipeCategory": ["Cakes", "Desserts", "Gluten-Free", "Gluten-Free Tuesday", "Halloween", "Pumpkin"], "recipeIngredient": ["2 tablespoons ground flax meal", "1/4 cup hot water", "5 ounces (1 1/4 cups) white rice flour", "1.5 ounces (1/2 cup) cocoa powder", "2 ounces (1/3 cup) potato starch", "2 teaspoons pumpkin pie spice (reduce to 1 teaspoon for a less spicy cake)", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "1/2 teaspoon xanthan gum", "1/2 cup soy-free solid shortening", "7 ounces (1 cup) granulated or raw sugar", "1 (15 ounce) can pumpkin puree (pure packed pumpkin)", "1 ounce allergen-free chocolate, melted* (optional) ", "*Melt chocolate in the microwave. Heat for 30 seconds on HIGH. Remove chocolate, stir, repeat until chocolate melts. Or place chocolate in the top of a double boiler. Heat water over medium-high heat, stir until chocolate melts. "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees F. Spray a 9x13-inch pan with nonstick cooking spray. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In small bowl, whisk together flax meal and hot water. Allow to sit for five minutes. In medium bowl, whisk together white rice flour, cocoa powder, potato starch, pumpkin pie spice, baking powder, baking soda, salt, and xanthan gum. In large bowl, cream together shortening and sugar until a thick paste forms. Add flax meal mixture. Cream until light and fluffy, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half dry ingredients. Mix on medium-low speed until combined. Batter will be thick. Turn off mixer. Add pumpkin. Mix until combined, batter will be thick and fluffy, about 20 seconds. Turn off mixer. Add remaining dry ingredients. Turn mixer on. Mix until combined. Turn off mixer, add remaining pumpkin and melted chocolate. Turn on mixer. Blend, on medium-low until batter is thick and fluffy, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread batter evenly into prepared pan. Bake until cake is set (cake should be aromatic and not jiggly), about 30 minutes. Remove from oven, place pan on a wire rack, and allow to cool. Serve from the pan. </p>"}]}