{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111206-egg-nog-11-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["eggnog", "hazelnut", "nutella", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Nutella Eggnog", "link": "https://www.seriouseats.com/recipes/2011/12/nutella-eggnog-recipe.html", "description": "It's like eating Nutella straight out of the container but without the guilt! Strike that, it's got all the guilt, but at least it's got some booze mixed in there to help you deal with it.", "totalTime": "10 minutes", "recipeYield": "makes about 2 quarts, serving 12 to 16", "recipeCategory": ["Christmas", "Nuts", "Rum"], "recipeIngredient": ["8 eggs, separated", "1/2 cup sugar", "1/2 cup Nutella", "3 cups whole milk", "2 cups heavy cream", "2 cups dark rum", "Toasted hazelnuts, roughly crushed under a skillet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place egg whites in the bowl of a stand mixer and whisk on low speed until frothy, about 30 seconds. Increase speed to medium-high and, watching carefully, beat until they are about the consistency of shaving cream, about 90 seconds. Reduce speed to medium. With mixer running, add half of sugar and beat until incorporated, about 30 seconds. Transfer whites to a large bowl. Do not wash bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add egg yolks and remaining sugar to now-empty stand mixer bowl and beat at medium-high speed until pale yellow and ribbony, shutting off machine and scraping down sides with a rubber spatula as necessary, about 2 minutes total. Add Nutella and mix until homogenous, about 15 seconds. Add milk, cream, and alcohol and mix on low speed to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula or handheld whisk, fold the whipped whites into the egg yolk/milk mixture until completely incorporated. Serve by ladling into goblets and garnishing with crushed toasted hazelnuts.</p>"}]}