{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111212lildebbite610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["buttercream", "chocolate glaze", "chocolate pudding", "Christmas", "holiday cakes", "little debbie", "yellow cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Little Debbie-Style Christmas Tree Cakes", "link": "https://www.seriouseats.com/recipes/2011/12/homemade-little-debbie-christmas-cakes-recipe.html", "description": "Making this cake isn't hard at all, but describing the entire process makes it seem more daunting. Put simply: bake a cake. Make buttercream. Sandwich them together. Cut into shapes. Glaze. Put more obnoxiously, well, read on.", "totalTime": "12 hours", "recipeYield": "14 mini-cakes", "recipeCategory": ["Cakes", "Christmas", "Desserts"], "recipeIngredient": ["<strong>For the Yellow Cake:</strong>", "6 ounce sugar", "1 ounce brown sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/2 teaspoon almond extract", "1 tablespoon vanilla extract", "3 ounces unsalted butter, room temperature", "4 1/2 ounces egg yolks (from about 6 eggs)", "8 ounces flour", "6 ounces milk", "2 ounces spiced rum, like Captain Morgan's", "&nbsp;", "<strong>Chocolate or Vanilla filling:</strong>", "4 ounces milk", "1 egg ", "1 1/4 ounces sugar", "1/8 ounce cornstarch ", "1/8 ounce cocoa powder (omit for vanilla version)", "1 ounces milk chocolate (omit for vanilla version)", "Pinch salt", "8 ounces unsalted butter, room temperature ", "1 tablespoon vanilla extract (increase to 2 tablespoons for vanilla version)", "&nbsp;", "<strong>Hard glaze:</strong>", "18 ounces powdered sugar (use 20 ounces for vanilla version)", "6 ounces water, divided", "2 teaspoons salt", "1/2 ounce vanilla extract", "1 1/2 ounces cocoa powder (omit for vanilla version)", "Sprinkles to garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make and bake the cake layers:</p>\n\n<p>Preheat the oven to 350&deg;F and line two jelly roll style sheet pans with a sheet of parchment.</p>\n\n<p>With a hand or stand mixer, cream together the sugar, brown sugar, baking powder, baking soda, salt, almond extract, vanilla extract and butter. Cream for about 6 minutes on medium speed, or until light and fluffy. Stop about halfway through to scrape the bowl down with a rubber spatula.</p>\n\n<p>While the mixture is creaming, sift the flour through a sieve and set aside.</p>\n\n<p>While still mixing at medium speed, begin adding in the yolks, one at a time. Mix thoroughly after each addition. </p>\n\n<p>Turn the mixer to low speed and, with it still running, add half of the flour. Drizzle in half the milk. Repeat with the remaining flour, milk and rum. Continue mixing only until homogenous.</p>\n\n<p>Shut off the mixer and scrape the bowl down with a spatula and stir, if necessary, to incorporate any lumps of  batter around the sides of the bowl.</p>\n\n<p>Divide the batter evenly between the two sheet pans and use an offset spatula to spread the batter into an even layer. Rap the pans against the counter a few times to dislodge any air bubbles.</p>\n\n<p>Bake for five minutes. You'll notice at this time some uneven bubbling occurring in the cakes. Remove the cakes from the oven and shake gently or rap against the counter to deflate the bubbles. Rotate the cake pans and continue baking another five minutes or until uniformly pale-golden and spongy to the touch. </p>\n\n<p>Set aside to cool until needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the filling:</p>\n\n<p>In a small pot, bring the milk to a simmer over medium heat.</p>\n\n<p>In a medium bowl, whisk together the egg, sugar, cornstarch and cocoa. While whisking, drizzle in the hot milk. Return the milk/egg mixture to the pot and cook over medium-low heat, whisking constantly. Whisk until the mixture begins to bubble and continue mixing one minutes more, to thoroughly cook out the cornstarch.</p>\n\n<p>Use a spatula to transfer the cooked custard to the bowl of a stand mixer. Add in the chocolate and salt. Using the paddle attachment, beat on low speed for 10 minutes, or until the mixture and the bowl itself have become cool to the touch.</p>\n\n<p>Once cool, turn the speed up to medium and, with the mixer still running, add the butter one tablespoon at a time, then drizzle in the vanilla. Shut off the mixer and let stand until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble and cut the cakes:</p>\n\n<p>Run a knife around the edges of the cake pans to loosen the cakes. Place a sheet of parchment over both cakes. Next you need to invert both cakes, remove the parchment paper from their bottoms, then re-invert them right-side up. </p>\n\n<p>More detailed explanation: invert one of the cakes onto a cutting board, set the sheet pan aside, and very gently peel away the bottom layer of parchment. Invert the second cake onto the bottom of the now empty sheet pan from the first cake (it's easier to handle the cake when it's on the bottom of the sheet pan, rather than nestled down into the sheet pan and hard to access). Likewise, peel away parchment paper. Now re-invert this second cake to the bottom of its original sheet pan. You now have both cakes right side up, one on a cutting board, one on an upside down sheet pan. </p>\n\n<p>Use a rubber spatula to transfer all of the chocolate buttercream from the bowl to the cake resting on the cutting board. With an offset spatula, spread the buttercream out as evenly as possible, from corner to corner. Hold the sheet pan with the second cake over the buttercreamed cake; gently slide the cake off the sheet pan and on to the buttercream. Press the cake down gently with your fingers to ensure the layers are even.</p>\n\n<p>Wrap the cutting board in plastic and freeze for one hour. Freezing the cake solidifies the buttercream and makes cutting it into tidy shapes much easier.</p>\n\n<p>To cut into Christmas trees, remove the cake from the freezer and cut lengthwise into two long strips, 4\" wide. There will be a 2\" strip leftover for snacking. </p>\n\n<p>Cut each strip with a chef's knife in a zig zag pattern to create a series of isosceles triangles, 3\" wide at the base. </p>\n\n<p>Arrange all of the triangles to their narrowest end points away from you. This is the basic shape of the tree. Trim away a small notch on either side of the base of the triangle to leave behind a 1\" wide trunk shape.</p>\n\n<p>Cover the trees loosely in plastic and freeze or refrigerate until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the glaze:</p>\n\n<p>In the smallest pot you have that will accommodate the ingredients, combine the powdered sugar, half the water, salt and vanilla extract. Whisk to combine. Set the pot over medium low heat and cook, whisking constantly, until the powdered sugar has dissolved and the mixture just beings to bubble. Remove from heat. Set aside a 1/2 cup of this vanilla glaze.</p>\n\n<p>Now add in the remaining water and cocoa powder (if using) and whisk until combined. Cool to room temperature. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Glaze and decorate the cakes:</p>\n\n<p>Have a sheet pan lined with parchment paper ready.</p>\n\n<p>Remove the cakes from the freezer and drop one straight into the center of the glaze. Use a fork to splash some glaze over the top of the cake. Next, lift the cake up and out of the glaze. Let any excess glaze drip back into the pot. Lightly drag the bottom of the cake/fork against the edge of the pot to minimize dripping and excess glaze. Gently place the cake onto the prepared sheet pan.</p>\n\n<p>Repeat with the remaining cakes. For a thick, dark coating, let the cakes dry for about an hour, then make a second batch of glaze (reserving none of the vanilla) and dip the cakes again. If given only one glaze, the cake will show through the glaze in patches. Whether you dip a second round is entirely up to your sense of perfectionism; one glaze is all it takes for a delicious cake.</p>\n\n<p>Once all of the cakes have been glazed, drizzle with the remaining vanilla glaze (tint the glaze red, if making the vanilla version). If the glaze has become too firm to drizzle, add in a teaspoon of water and stir to thin. Drizzle with a spoon, or with a pastry bag fitted with a small, plain tip. Finally, scatter sprinkles all over. </p>\n\n<p>Place the tray of cakes in a well ventilated and safe location where they may dry, undisturbed by pets or children. Let the cakes stand, uncovered, for about six hours or until the glaze has set. Exactly how long this takes will depend on the air flow and humidity in your home.</p>\n\n<p>Once the glaze has set, the cakes are ready for snacking! (Use a spatula to lift the cakes from the parchment, once free, you can handle them easily.) </p>\n\n<p>The cakes will store, covered, at room temperature for about 2 days, or up to a week in the fridge. </p>"}]}