{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110408-soup-dumpling11.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "Chinese Appetizer Recipe Week", "dumpling", "soup dumpling"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5714285714286", "ratingCount": "7"}, "name": "Soup Dumplings (Xiao Long Bao)", "link": "https://www.seriouseats.com/recipes/2011/04/soup-dumplings-xiao-long-bao-recipe.html", "description": "Soup dumplings are not extremely tough to make, but they are time-consuming, and here's why: in order to get the broth inside the 'pling, it must first be solidified, and that means making a real chicken and/or pork broth&mdash;no cheating...", "totalTime": "12 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese"], "recipeIngredient": ["<strong>For the Broth</strong>:", "3 pounds chicken backs or wings", "1/2 pound Chinese ham or slab bacon", "6 scallions, whites separated, greens roughly chopped", "1-inch knob ginger", "1 tablespoon white peppercorns", "Kosher salt", " ", "<strong>For the Filling</strong>", "1/3 pound ground pork", "1/4 pound raw shrimp, peeled", "2 teaspoons soy sauce", "1 tablespoon XiaoShing wine", "2 teaspoons sugar", " ", "<strong>For the Dough</strong>:", "2 cups (10 ounces) all-purpose flour", "1 cup boiling water", "&nbsp", "Napa cabbage leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chicken bones, ham, scallion whites, half of scallion greens, ginger, and white peppercorns in a saucepan and cover with cold water. Bring to a boil over high heat, remove to a simmer, and simmer for 2 1/2 hours. Strain broth, season to taste with salt, cover, and refrigerate until set into a semi-firm jelly, at least 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine pork, shrimp, soy sauce, wine, sugar, 1 teaspoon salt, and remaining scallion greens in a food processor. Process until a fine paste is formed, about 12 to 15 one-second pulses. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place flour in bowl of food processor. With machine running, slowly drizzle in water until cohesive dough is formed (you probably won't need all the water). All dough to ride around processor for 30 seconds. Form into a ball using floured hands and transfer to a bowl. Cover with a damp towel and let rest for at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When broth is gelled, transfer filling mixture to a bowl along with 1 cup of jellied broth (save the rest for another use). Beat or whisk it in until homogenous. Keep filling well chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into 4 sections, and each section into 10 small tablespoon-sized balls, making 40 balls total. On a well-floured work surface, roll each ball into a round 3 1/2- to 4-inches in diameter. Stack wrappers and keep under plastic until all of them are rolled out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form dumplings, place 1 tablespoon of filling in the center of a wrapper. Moisten the edges of the wrapper with a wet fingertip or a pastry brush. Pleat edges of the wrapper repeatedly, pinching the edge closed after each pleat until the entire dumpling is sealed. in a cinched purse shape. Pinch and twist top to seal. Transfer sealed dumplings to a lightly floured wooden or parchment-lined board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a bamboo steamer over a wok with 2 inches of water. Place over medium high heat until simmering. line steamer with napa cabbage leaves and place dumplings directly on leaves. Steam until cooked through, about 5 minutes. Serve immediately, being careful not to break them.</p>"}]}