{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110722-127677-Dulces-Torta-Elotes-Procedure.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Latin American", "keywords": ["corn", "desserts", "Dulces", "ice cream", "Latin American"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Helado de Maíz y Crema (Corn-Crema Ice Cream)", "link": "https://www.seriouseats.com/recipes/2011/07/dulces-helado-de-maiz-corn-ice-cream-recipe.html", "description": "I'll be the first to admit that ice cream making is a drag, but delayed gratification is deliciously rewarding, especially when it involves this luxurious, velvety ice cream made with sweet corn, tangy crema, and an insinuation of cinnamon.", "totalTime": "5 hours", "recipeYield": "Makes 1 quart", "recipeCategory": ["Corn", "Ice Cream and Frozen Treats", "Latin American"], "recipeIngredient": ["6 ears fresh corn, shucked", "3 cups crema", "1 cup whole milk", "1 cup light brown sugar", "3 cinnamon sticks", "1/4 teaspoon salt", "9 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze ice cream maker insert according to manufacturer’s instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each cob in half crosswise. Stand one piece of cob upright, resting the cut end on a cutting board, pie plate, or large shallow mixing bowl. With a chef’s knife, cut the kernels off, rotating the cob as you go. Reserve the cob. Repeat with remaining cobs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine corn kernels, crema, milk, brown sugar, cinnamon sticks, salt, and corn cobs in medium heavy-bottomed saucepan. Bring to boil over medium-high heat, then, reduce heat to medium low and simmer 20 minutes, stirring occasionally. Remove from heat and let stand 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and discard cobs and cinnamon sticks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pour corn mixture into blender (do this in batches if necessary) and puree until smooth. Strain pureed mixture into large bowl. Wipe out saucepan, return mixture to saucepan, and bring back to simmer over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk egg yolks in large bowl until smooth. In slow, steady stream, slowly and carefully pour in 2 cups of simmering mixture, whisking continuously (See Notes). Whisk egg yolk mixture into mixture in saucepan and cook over medium-low heat, stirring constantly until temperature reaches 170°F, 8 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain custard into large bowl and cool completely, about 3 hours, in refrigerator, or, place bowl in ice bath and stir until cooled, 10 to 15 minutes. Freeze corn custard in ice cream maker according to manufacturer’s instructions. Serve.</p>"}]}