{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110823-167459-Mafalde-with-Roasted-Tomatoes.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Domenica Marchetti", "pasta", "pasta sauces", "sauces", "The Glorious Pasta of Italy", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mafaldine with Roasted Tomatoes, Robiola, and Crushed Fennel Seeds", "link": "https://www.seriouseats.com/recipes/2011/08/mafaldine-with-roasted-tomatoes-robiola-and-crushed-fennel-seeds-recipe.html", "description": "Fresh tomato sauces are wonderful in the summer, but as tomato season heads south for the cooler months, it's always a good idea to have a roasted tomato sauce up your sleeve. A slow roast in the oven takes even the most middling tomatoes to the next level by concentrating all of their great sweet tomato-iness. This plate of <strong>Mafaldine with Roasted Tomatoes, Robiola, and Crushed Fennel Seeds</strong> from <a href=\"http://www.domenicacooks.com/about-2/\">Domenica Marchetti</a>'s Bolognese from <em><a href=\"http://www.amazon.com/Glorious-Pasta-Italy-Domenica-Marchetti/dp/0811872599/?tag=serieats-20\">The Glorious Pasta of Italy</a></em> takes that roasted tomato sauce to an even more thrilling place by pairing it with some unlikely but incredible partners: fennel seeds and robiola cheese.", "totalTime": "3 hours", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Pasta", "Tomato", "Vegetarian"], "recipeIngredient": ["2 1/2 pounds plum tomatoes, cut in half lengthwise", "1/2 cup extra-virgin olive oil ", "3 large cloves garlic, sliced paper-thin", "1 tablespoon fennel seeds, lightly crushed", "Kosher or fine sea salt", "Freshly ground black pepper", "1 pound dried mafaldine, pappardelle, or fettuccine", "8 ounces robiola cheese, cut into bite-sized chunks "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 275°F. Arrange the tomato halves, cut side up, on a large rimmed baking sheet and drizzle the olive oil over them. Scatter the garlic slices and fennel seeds over the tomatoes, and season with a generous sprinkling of salt and a few grinds of pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the tomatoes for 3 to 4 hours, or until they have begun to collapse and are caramelized but are not dry. They should have some shriveling but still look juicy. Let them sit until they are cool enough to handle. Then chop them coarsely and transfer them to a warmed serving bowl, along with any oil and juices left in the pan. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a rolling boil and salt generously. Add the pasta, stir to separate the noodles, and cook according to the manufacturer’s instructions until al dente. Drain the pasta in a colander set in the sink, reserving about 1 cup of the cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pasta to the serving bowl and strew the robiola pieces over it. Toss gently to combine the pasta, tomatoes, and cheese thoroughly, taking care to break apart any large chunks of cheese that stick together. Add a little of the hot cooking water to the bowl to help melt the cheese a bit but not too much—you want some pieces in there. Taste and adjust the seasoning with salt and pepper, if you like. Serve immediately.</p>"}]}