{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/10262011-orange-onion-spinach-salad.jpg", "author": {"@type": "Person", "name": "Jennifer Segal"}, "recipeCuisine": "", "keywords": ["oranges", "salad", "serious salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oranges, Caramelized Red Onions and Spinach with Balsamic Vinaigrette", "link": "https://www.seriouseats.com/recipes/2011/10/oranges-caramelized-red-onions-spinach-recipe.html", "description": "This salad was adapted from one of my favorite cookbooks, <em><a href=\"http://www.amazon.com/dp/0679447369/?tag=serieats-20\">The Inn at Little Washington Cookbook</a></em> by Patrick O'Connell. He takes a classic Italian combination&mdash;oranges, red onions and greens&mdash;and gives it a Moroccan twist by adding cinnamon and nutmeg to the vinaigrette. Sounds unusual but it <em>really</em> works, and the flavors are perfect for fall.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["Orange", "Salads"], "recipeIngredient": ["3/4 cup extra virgin olive oil, best quality (recommended: Lucini or Colavita)", "1/4 cup balsamic vinegar, best quality (recommended: Fini or Colavita)", "1 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "1/8 teaspoon salt", "1 large red onion, cut into 1/8-inch thick rounds (try to keep the rounds intact)", "4 navel oranges", "7 ounces (about 5 cups) baby spinach"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack 5-6 inches from top and preheat broiler. Line a baking sheet with aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make vinaigrette by combining olive oil, balsamic vinegar, cinnamon, nutmeg and salt in a small bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip onions into vinaigrette, being careful to keep rounds intact, and lay in a single layer on prepared baking sheet. Broil until soft and caramelized, 5-10 minutes. Keep a close eye on them so they don't burn. Set aside or refrigerate until ready to assemble salad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel oranges with a sharp knife, carefully removing all of the white membrane. Slice into rounds about 1/4-inch thick, remove any seeds, and place in a 9x13-inch baking dish. Pour vinaigrette over top and let oranges marinate in refrigerator for at least 15 minutes or up to several hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble salad, place spinach on large platter or individual plates. Scatter caramelized onions over spinach, and then place marinated oranges on top. Spoon any remaining vinaigrette, little by little, over oranges until salad is adequately dressed.</p>"}]}