{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111229-185226-pork-adobo.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Filipino", "keywords": ["adobo", "Filipino", "main", "pork", "Spice Hunting", "spices"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pork Adobo", "link": "https://www.seriouseats.com/recipes/2011/12/pork-adobo-philippino-braise-recipe.html", "description": "Adobo is more a cooking style than a recipe. Pork, chicken, fish, beef, or pretty much any protein you want can be adobo'd. Some cooks swear by coconut milk, others consider it <em>verboten</em>. You can add coriander, cumin, and chiles (smoked or fresh), or just stick to classic bay leaf, as I've done here. Even the inclusion of soy sauce is negotiable. There are few rules with adobo, and fewer agreements about what constitutes it.", "totalTime": "3 hours", "recipeYield": "serves 4 to 6 people", "recipeCategory": ["Braising and Stewing", "Filipino", "Mains", "Pork"], "recipeIngredient": ["1 tablespoon oil", "3 pounds fatty pork shoulder, cut into 1 1/2 inch cubes", "1/2 cup soy sauce", "1/2 cup rice vinegar, plus more to taste", "1 cup coconut mik", "4 bay leaves", "8 cloves garlic, peeled and lightly crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large straight-sided saut&eacute; pan on very high heat until oil begins to smoke. Sear pork in batches, leaving plenty of open space in the pan, until a light crust forms, about 1 to 2 minutes per side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When last batch of pork is seared, return all pork to pan and add soy sauce, vinegar, coconut milk, bay leaves, and garlic. Bring to a boil, then reduce to a bare simmer and cook, covered, for 2 1/2 to 3 hours, or until pork is very tender but not completely falling apart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork from pan and set aside. Strain sauce into a fat separator or measuring cup and skim off fat, reserving for another use. Return sauce to pan, add about 1 tablespoon of vinegar, and cook on medium high heat until sauce reduces to less than 1 cup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pork to thickened sauce and add salt and vinegar to taste. Serve with rice and chopped scallions for garnish.</p>"}]}