{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110709preservedblueberryportprimary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["blueberries", "Jam", "port", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry Port Jam", "link": "https://www.seriouseats.com/recipes/2011/07/preserved-blueberry-port-jam-recipe.html", "description": "This jam has a deep, dark purple hue that looks almost black in the jar. The blueberries and port work together to create an intense, full-bodied jam bursting with ripe fruit flavors. In addition to the berries, there are notes of plum, cherry, and raisin. Try it in a peanut butter sandwich, or as a filling between two layers of lemon cake.", "totalTime": "12 hours", "recipeYield": "Makes 7 half-pints", "recipeCategory": ["Blueberry", "Breakfast Sweets", "Desserts"], "recipeIngredient": ["5 1/2 cups granulated sugar", "3 pints fresh blueberries", "One (1.75 ounce) package regular powdered fruit pectin", "1 cup ruby port", "1/2 teaspoon unsalted butter", "1/4 teaspoon ground cinnamon", "1/8 teaspoon ground cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve jam, prepare jars and lids: place 8 half-pint jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure 5 1/2 cups sugar into large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches, coarsely puree blueberries in blender or food processor. You should have four cups. Transfer blueberry puree to large, heavy bottomed pot. Whisk in pectin until dissolved. Add port, butter, cinnamon and cloves and cook over medium-high heat, stirring constantly, until mixture comes to a full rolling boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sugar all at once and continue to cook, stirring constantly, until mixture returns to a full rolling boil. Boil hard for one minute. Remove pot from heat and skim off any foam from surface of jam. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}