{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111013-174987-supper-pierogies-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["dumpling", "pierogy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pierogies", "link": "https://www.seriouseats.com/recipes/2011/10/pierogies-potato-stuffed-dumplings-recipe.html", "description": "Like many of the world's great comfort foods, pierogies take bit of time and effort to prepare, but as with most things, the extra effort pays off.  The flavors of this dish are simple, but like most of the foods that come out of grandmothers' kitchens the sum is more than its parts.", "totalTime": "2 hours 30 minutes", "recipeYield": "makes 48 pierogies", "recipeCategory": ["Mains", "Sunday Supper"], "recipeIngredient": ["<strong>Dough:</strong>", "3 cups all-purpose flour", "large pinch of salt", "1 cup water", "1 large egg, beaten", "2 teaspoons vegetable oil", "&nbsp;", "<strong>Filling:</strong>", "2 large Russet potatoes", "1 1/2 cup shredded sharp Cheddar", "Kosher salt and cracked black pepper", "Sour cream (optional)", "Bacon, cooked crisp (optional)", "1 sliced onion fried in 1 tablespoon butter (optional)", "finely sliced scallions (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make dough:</strong> Place flour and salt in a large bowl and make a well in the center.  Add water, egg and vegetable oil and mix, slowly incorporating flour until soft dough forms.  Turn soft dough out onto floured surface and knead until smooth and elastic, about 8 minutes.  Cover with a clean kitchen towel and let rest for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make filling:</strong> Peel potatoes and cut into 1 inch pieces.  Boil in salted water until potatoes are tender, about 10 minutes.  Drain potatoes and place in a large bowl and mash with a potato masher or fork, slowly adding grated cheese.  Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble pierogies: </strong>Divide dough in half, reserving other half under a kitchen towel.  Divide halved dough into 24 evenly sized pieces.  Roll each piece into a round about 1/8-inch thick.  Wet edges of dough and place a rounded teaspoon worth of filling in center of round.  Close dough around filling creating a semicircle sealing edges with fingers.  Repeat with all remaining dough (there may be some filling left).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil a large pot of water, and working in batches, cook pierogies until they rise to the top of the boiling water.  Serve with any or all of the optional garnishes and copious amounts of cold beer.<br />\n</p>"}]}