{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110215-138065-roast-duck-honey-ginger-glaze.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["duck", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sunday Supper: Roast Duck with Honey Ginger Glaze", "link": "https://www.seriouseats.com/recipes/2011/02/roast-duck-with-honey-ginger-glaze.html", "description": "Roasting a duck is marginally more work than roasting a chicken&mdash;and yet the final product yields a bird that seems much more festive sitting on the cutting board.  This simple glazed duck could serve four people, but, in my opinion, works the best serving two with ample leftovers.", "totalTime": "3 hours 45 minutes", "recipeYield": "4", "recipeCategory": ["Chicken", "Duck", "Mains", "Other Meats", "Sunday Supper"], "recipeIngredient": ["1 whole duck, 4 to 5 pounds", "Kosher salt ", "Cracked black pepper", "1/4 cup honey", "1 teaspoon finely grated fresh ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F.  Dry the duck inside and out using paper towel, if necessary trim excess skin and fat from neck area and cavity.  Remove giblets from cavity and reserve.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly salt and pepper the inside and outside of the duck.  Tuck wing tips under bird and tie the legs together using kitchen twine.  Place breast side up and roast until skin begins to leech out fat, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After an hour, carefully remove duck from the oven and flip over, so that the breast side is down.  Roast for another hour, then remove from oven and turn the bird breast side up again.  Place back in the oven and roast until skin begins to brown, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine honey and ginger in small pan and bring to a simmer. Cook until mixture begins to thicken and ginger is fragrant, about one minute. Once the duck is finished roasting, remove from the oven and increase oven temperature to 425&deg;.  Allow to preheat for 15 minutes. Place duck back in oven and roast until skin is crisp, about 10 minutes.  Remove from oven and brush on glaze, place the duck back in the oven and roast until glaze looks sticky, about five minutes.  Let duck rest then carve, serve with short grain rice and wilted greens.</p>"}]}