{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110323-127355-dinner-tonight-velvet-chicken-asparagus.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Velvet Chicken with Asparagus", "link": "https://www.seriouseats.com/recipes/2011/03/dinner-tonight-velvet-chicken-with-asparagus.html", "description": "This isn't your average stir fried chicken dish. The finicky procedure takes slightly longer than I usually have time for on a weeknight, but results in some of the most remarkably tender and delicate chicken I've ever had. So this is what all those take-out Chinese joints are aiming for.", "totalTime": "1 1/2 hours", "recipeYield": "4 people", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["1 pound boneless, skinless chicken breasts, chilled in the freezer for 20 minutes or so to firm up", "1 large egg white", "1 pound thin asparagus, ends trimmed, cut into 2-inch pieces ", "2 cups peanut oil ", "1 ½ tablespoons water ", "2 ½ teaspoons cornstarch ", "¾ teaspoon kosher salt", "¾ teaspoon sugar", "¼ cup Virginia ham, minced", "¾ teaspoon sesame oil ", "¾ teaspoon Shaoxing wine ", "Pinch of freshly ground white pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly beat the egg white in a medium-sized bowl with a splash of the oil. Remove the chicken breasts from the freezer. Slice the chicken crosswise into very thin ⅛-inch pieces. Add to the egg white, and stir well until all the pieces are coated. Cover bowl with plastic wrap, and transfer to the fridge. Let sit for about an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk together the water, cornstarch, salt, and sugar in a small bowl. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer asparagus pieces to a microwave safe bowl. Cover with plastic wrap and cook on high in the microwave for two minutes. Carefully remove plastic, and taste to see if cooked. If not done, cover again with plastic and cook for another minute. If done, dump asparagus into a bowl of ice water. After a few minutes drain asparagus and dry with paper towels.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When it has been close to an hour, pour the rest of the oil into into a large flat-bottom work or a deep saucepan. Turn the heat to medium-high and bring to only 180&deg;F”. Immediately add the chicken pieces, stirring with two chopsticks to separate the pieces. Cook until the pieces are white, one to two minutes. Remove chicken pieces with a slotted spoon and drain on some paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all but two tablespoons of the oil from the wok or saucepan. Turn heat to high. When oil just starts to smoke, add the asparagus. Stir fry until warmed, about 30 seconds. Add chicken and the ham, stir fry until they are warm, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Re-stir the cornstarch mixture, and then pour it in the wok or pan. Stir well to coat the pieces, and then add the sesame oil and wine. Add a pinch or two of ground white pepper. Turn off the heat and transfer to a large serving platter. Season with more salt and white pepper to taste. </p>"}]}