{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2011/09/deviledeggs.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["appetizer", "boiled egg", "deviled egg", "egg", "hors d'oeuvre", "low carb", "snack", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "6"}, "name": "Great Deviled Eggs", "link": "https://www.seriouseats.com/recipes/2011/09/great-deviled-eggs-recipe.html", "description": "These creamy, super flavorful deviled eggs are inspired by the ones served at The Spotted Pig in New York. They are punchy, thanks to a generous amount of salt and vinegar, and light, because of a nice, loose, homemade mayo. They're everything a bar snack should be.", "totalTime": "20 minutes", "recipeYield": "Makes 16 deviled egg halves", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Deviled Eggs", "Gluten-Free", "Snacks", "Stovetop", "The Food Lab", "Vegetarian"], "recipeIngredient": ["12 large eggs, not too fresh (see note)", "2 tablespoons (30ml) mayonnaise, preferably <a href=\"http://www.seriouseats.com/recipes/2011/10/two-minute-mayonnaise.html\">homemade</a>", "1 tablespoon (15ml) Dijon mustard", "Up to 1 tablespoon (15ml) white wine vinegar", "1/2 teaspoon (3ml) Frank's RedHot sauce", "1/4 cup (60ml) extra-virgin olive oil, divided (see note)", "Kosher salt and freshly ground black pepper", "3 tablespoons (85g) thinly sliced chives", "Crushed red pepper or hot paprika", "Crunchy sea salt, such as Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tray of ice cubes to a large bowl and fill with water. Fill a large pot with 1 inch of water. Place steamer insert inside, cover, and bring to a boil over high heat. Add eggs to steamer basket, cover, and continue cooking over high heat for 12 minutes. Immediately place eggs in bowl of ice water and allow to cool for at least 15 minutes before peeling under cool running water. Slice each egg in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all yolks in the bowl of a food processor. Select 16 of the best-looking egg white halves and set aside; reserve remaining 8 for another use. Add mayonnaise, mustard, 1/2 tablespoon (7ml) vinegar, and hot sauce to food processor and process until smooth, scraping down sides of bowl as necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With machine running, slowly drizzle in 2 tablespoons (30ml) olive oil. Season mixture to taste with salt and remaining vinegar (if desired). Transfer to a zipper-lock bag. Filling and egg white halves can be stored in the refrigerator up to overnight before eggs are filled and served.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off a corner of zipper-lock bag and pipe filling mixture into egg whites, overstuffing each. Drizzle with remaining olive oil and sprinkle with black pepper, chives, crushed red pepper or paprika, and sea salt. Serve immediately.</p>"}]}