{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110420-148301-mississippi-delta-tamales.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cornmeal", "John T. Edge", "Sara Roahen", "tamales", "The Southern Foodways Alliance Community Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Southern Foodways' Mississippi Delta Hot Tamales", "link": "https://www.seriouseats.com/recipes/2011/04/cook-the-book-mississippi-delta-hot-tamales-recipe.html", "description": "Among the more curious dishes in <strong><em><a href=\"http://www.amazon.com/Southern-Foodways-Alliance-Community-Cookbook/dp/0820332755/serieats-20\"></a>The Southern Foodways Alliance Community Cookbook</em></strong> are these <strong>Mississippi Delta Hot Tamales</strong>.  Tamales are traditionally Mexican and the tale of how they made their way into the canon of Southern cooking more than a century ago is a truly American one.  There are many takes on the story, but they all have something to do with Mexican laborers migrating north from Texas to pick cotton.  There they shared their corn husk-wrapped snacks with African-American laborers and the tradition of the Mississippi Delta tamale was born.", "totalTime": "3 hours 30 minutes", "recipeYield": "7 to 8 dozen", "recipeCategory": ["Cook the Book", "Corn"], "recipeIngredient": ["<strong>For the meat filling:</strong>", "6 to 8 pounds boneless meat (pork shoulder, chuck roast, or chicken)", "¾ cup vegetable oil", "¼ cup chili powder", "2 tablespoons paprika", "2 tablespoons salt", "2 teaspoons black pepper", "1 teaspoon ground cayenne pepper", "1 tablespoon onion powder", "1 tablespoon garlic powder ", "1 teaspoon ground cumin", "<strong>For the corn husks:</strong>", "1 to 2 packages dried corn husks", "<strong>For the masa dough:</strong>", "8 cups maseca (masa mix) or yellow cornmeal ", "4 teaspoons baking powder", "2 teaspoons salt", "1⅔ cups lard or vegetable shortening", "6 to 8 cups warm meat broth (from cooking the meat) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the meat filling:</strong> Cut the meat into large chunks and place in a large, heavy pot. Cover with cold water. Bring to a boil over high heat. Cover the pot, reduce the heat to medium-low, and simmer until the meat is very tender, 2 to 2½ hours. Remove the meat and reserve the cooking liquid. When the meat is cool enough to handle, remove and discard any skin or large chunks of fat. Shred or dice the meat into small pieces. There should be about 14 to 16 cups of meat. Heat the vegetable oil in a large, heavy pot over medium heat. Stir in the chili powder, paprika, salt, pepper, cayenne, onion powder, garlic powder, and cumin. Add the meat and stir to coat with the oil and spices. Cook, stirring often, until the meat is warmed through, 7 to 10 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare the corn husks:</strong> While the meat is cooking, soak the husks in a large bowl or sink of very warm water, until they are softened and pliable, about 2 hours. Gently separate the husks into single leaves, trying not to tear them. Wash off any dust and discard any corn silks. Keep any shucks that split to the side, since two small pieces can be overlapped and used as one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the masa dough:</strong> Stir the maseca, baking powder, salt, and lard together in a large bowl until well blended. Gradually stir in enough warm broth (from cooking the meat) to make soft, spongy dough that is the consistency of thick mashed potatoes. The dough should be moist but not wet. Cover the bowl with a damp cloth.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the tamales:</strong> Remove a corn husk from the water and pat it dry. Lay the husk on a work surface. Spread about ¼ cup of the masa in an even layer across the wide end of the husk to within 1 inch of the edges. Spoon about 1 tablespoon of the meat mixture in a line down the center of the masa. Roll the husk so that the masa dough surrounds the filling and forms a cylinder or package. Fold the husk under to close the bottom and complete the package. Place the completed tamales in a single layer on a baking sheet. Repeat until all the masa and filling is used. Simmer or steam the tamales.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To simmer:</strong> Stand the tamales upright, closed side down, in a large pot. Place enough tamales in the pot so that they do not fall over or come unrolled, or tie the bundle together with kitchen twine. Carefully fill the pot with enough water to come just to the top of the tamales, trying not to pour water directly onto the tamales. Bring the water to a boil over high heat. Cover the pot, reduce the heat to medium-low, and simmer until the masa is firm and pulls away from the husk easily and cleanly, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To steam:</strong> Stand the tamales upright, closed side down, in a large steamer basket. Cover the tamales with a damp towel or additional husks. Steam the tamales over simmering water until the masa is firm and pulls away from the husk easily and cleanly, about 1 to 1¼ hours. Serve the tamales warm, in their husks.</p>"}]}