{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111206-cinnamon-sticky-buns-1.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["breakfast pastries", "breakfast sweets", "cinnamon rolls", "Cook the Book", "Serious Eats book", "sticky buns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Kenji's Sticky Buns From 'Serious Eats'", "link": "https://www.seriouseats.com/recipes/2011/12/serious-eats-caramel-sticky-buns-recipe.html", "description": "A good sticky bun (and we're not talking about the mall variety) can be a transcendent experience, just ask our own <strong><a href=\"http://www.seriouseats.com/about-ed-levine/\">Ed Levine</a></strong> who had his mind blown by a roadside bun at <a href=\"http://www.knausberryfarm.com/\">Knaus Berry Farm</a> in Homestead, Florida.  It's pretty much impossible to read Ed's tale of this incredible sticky bun in the <em><strong><a href=\"http://www.amazon.com/Serious-Eats-Comprehensive-Delicious-Wherever/dp/030772087X/?tag=serieats-20\">Serious Eats book</a></strong></em> without needing to try one out for yourself.", "totalTime": "4 hours 30 minutes", "recipeYield": "makes 9 sticky buns", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Cook the Book"], "recipeIngredient": ["<strong>For the dough:</strong>", "6 tablespoons (3/4 stick) unsalted butter", "1/2 cup full-fat yogurt, room temperature", "2 large eggs, room temperature", "1 packet (1/4 ounce) fast-rise yeast", "1 1/2 teaspoons Kosher salt", "3 tablespoons (1 1/4 ounces) granulated sugar", "3 cups (15 ounces) all-purpose flour, plus more for working ", " ", "<strong>For the filling:</strong>", "1/2 cup (about 4 ounces) brown sugar, packed", "2 teaspoons ground cinnamon", "Kosher salt", "2 tablespoons unsalted butter, melted", " ", "<strong>For the caramel sauce:</strong>", "1/2 cup (1 stick) unsalted butter", "1 cup (about 8 ounces) brown sugar, packed", "1 (14-ounce) can sweetened condensed milk", "1 tablespoon rum (optional)", "1 cup (about 4 ounces) chopped toasted pecans (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the dough:</strong> In a large bowl, heat the butter in the microwave at medium power until it is just melted. Add the yogurt, eggs, yeast, kosher salt, and sugar and whisk until the ingredients are well combined. Add the flour and stir with a wooden spoon until the dough forms a ball. Transfer to the bowl of a standing mixer fitted with a dough hook attachment and knead on low speed for 10 minutes, adding flour as necessary until the dough just barely pulls away from the sides of the bowl. Transfer to a large greased bowl, cover with plastic wrap, and allow the dough to rise until doubled in volume, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the filling:</strong> Once the dough has risen, combine the brown sugar, cinnamon, and a pinch of salt in a medium bowl. Turn the dough out onto a floured surface. Roll the dough into an even 12 × 8-inch rectangle, with the long side facing you. Brush melted butter evenly over the surface, leaving a narrow border along the top long edge. Spread the cinnamon sugar evenly over the buttered area, using your hands to gently work it to the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting at the bottom edge, roll the rectangle away from you into a tight cylinder 12 inches wide. Rest the cylinder seam side down and carefully even out the shape and square off the edges. Using a sharp knife, cut the -cylinder into three even pieces. Cut each piece into three more pieces to create nine buns total. Arrange the cut buns in a well-buttered 8 × 8-inch baking dish. Cover the dish tightly with plastic. (The dough can be refrigerated overnight at this point.) Allow the buns to rise at warm room temperature until they are puffy and pressed tightly against each other, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the buns are rising, adjust the oven rack to the lower middle position and preheat the oven to 350°F. Remove the plastic wrap from the dish and bake the buns until they are golden brown and puffy, about 30 minutes. Transfer the baking dish to a wire rack and let the buns cool for at least 10 minutes, while you make the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the caramel sauce:</strong> Heat the butter and the brown sugar in a medium saucepan over medium heat, stirring occasionally until the mixture is bubbling and puffy, about 3 minutes. Whisk in the condensed milk. Simmer until the mixture is reduced to a thick saucelike consistency (the mixture should coat the back of a spoon easily). Whisk in the rum and pecans (if using). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a thin metal spatula, loosen the buns from the sides and turn them out of the dish (but do not separate them yet). Transfer them to a serving platter and spoon half of the caramel sauce evenly over them. Allow the sauce to soak in for about 10 minutes, then serve, pulling the buns apart with your fingers and serving extra caramel sauce on the side.</p>\r\n\r\n<p><small><strong>Note:</strong> The buns can be assembled the night before and placed in the refrigerator after arranging in their baking dish and wrapping with plastic. To bake the next day, allow the buns to rise at warm room temperature for 2 hours before baking as directed.</small><br />\r\n</p>"}]}