{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110130-roast-chicken.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["chicken", "lemon", "mains", "potatoes", "roast chicken", "roasting", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Lemon Roast Chicken with Herb Potatoes", "link": "https://www.seriouseats.com/recipes/2011/01/lemon-roast-chicken-with-herb-potatoes-recipe.html", "description": "Roast chickens are a simple and satisfying meal anytime, and the smell of it roasting on a Sunday evening can set a positive tone for the whole week ahead.  Squeezing lemon juice over the body of the bird helps to not only season the final product, but can also help crisp the skin. And roasting the potatoes in the pan with the bird gives the potatoes a nice dose of chicken fat to roast in.", "totalTime": "2 hours", "recipeYield": "4", "recipeCategory": ["Chicken", "Lemon", "Mains", "Potato", "Sunday Supper"], "recipeIngredient": ["1 large whole chicken (About 5 1/2 pounds)", "8 medium cloves garlic, crushed", "3 medium onions, halved", "2 lemons, halved", "1 1/2 pounds assorted fingerling potatoes", "1/4 cup assorted chopped herbs (rosemary, thyme, parsley, or sage)", "Olive oil", "Kosher salt and freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;. Rinse chicken well and pat dry, remove bag of giblets and discard or save for another use. Trim excess fat from opening of chicken cavity if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange halved onions in center of 9X13 inch pyrex dish to act as a base for chicken to sit on. Place chicken on top of onions.  Squeeze halved lemon onto chicken body and legs, then place lemons in chicken cavity, repeat with all halved lemons.  Place crushed garlic in cavity as well then tie chicken legs together with kitchen twine.  Season chicken liberally with salt and cracked black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash fingerling potatoes and slice largest fingerlings in half lengthwise.  Toss potatoes with olive oil, half the chopped herbs and season with salt and pepper. Place in roasting baking dish around chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast until temperature taken in the thickest part of breast registers 150°F and thighs registers at least 165°F, about an hour.  Remove from oven and allow chicken to rest for 15 minutes. Remove potatoes and toss with remaining chopped herbs. Carve chicken and serve immediately.</p>"}]}