{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110531-bread-baking-oat-loaf.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads", "oat flour", "oats"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Oat Bread", "link": "https://www.seriouseats.com/recipes/2011/05/bread-baking-oat-bread.html", "description": "I made <a href=\"http://cookistry.blogspot.com/2011/05/oaty-buns.html\">oat buns</a> a while back, and really liked the flavor that oat flour added to a mostly-wheat dough. This time I decided to up the ante by increasing the proportion of oat flour, adding quick-cooking oats <em>and</em> sprinkling some oats on top. That triple dose of oats made the bread a little denser and heartier; a great bread platform for peanut butter.", "totalTime": "3 hours", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking", "Other Grains"], "recipeIngredient": ["1/4 cup (1 ounce) quick cooking oats (plus more for topping)", "1/2 cup (2 ounces) oat flour", "2 1/4 teaspoons instant yeast", "1 cup lukewarm water", "9 ounces (about 1 2/3 cups) bread flour", "1 teaspoon salt", "1 tablespoon olive oil (and more for drizzling)", "Egg wash (1 egg, beaten with a bit of water)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the oats, oat flour, yeast, and water. Set aside until it gets bubbly, about 10 minutes. Add the bread flour and knead with the dough hook until the mixture is elastic. It will be a little lumpy from the oats, so it won't be completely smooth, but it should be nicely stretchy. Add the salt and oil and continue kneading until both are fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a bowl, drizzle with a bit of olive oil, and return it to the bowl. Cover the bowl with plastic wrap and set aside until doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 350 degrees and sprinkle some cornmeal on the bottom of a loaf pan, if desired. (I used a 9x5, but a smaller size would work as well.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface lightly and knead the dough, the form it into a log that will fit into the bread pan you're using. Place it in the pan seam-side down. Cover the pan with plastic wrap and set aside until doubled in size, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the loaf with the egg wash and sprinkle with oats. Slash as desired and bake at 350 degrees until nicely browned, about 35 minutes. Cool completely on a rack before slicing.</p>"}]}