{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/7282011-163541-roast-fish-herbs-lemon-sunday-supper.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["fish", "mains", "seafood", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Sunday Supper: Roast Fish Stuffed with Lemon and Herbs", "link": "https://www.seriouseats.com/recipes/2011/07/roast-fish-stuffed-with-lemon-and-herbs-recipe.html", "description": "Between your herb planter your fish monger there are endless combinations and flavors that can be experimented with using this roasting technique. The photo above is sea bream stuffed with parsley and oregano, but snapper filled with cilantro and chives would make a totally different but equally lovely Sunday Supper. When picking out your fish make sure its eyes are clear and that it has an oceany but not funky smell. And although I've recommended three types of fish below, consult an expert and get to know your local fish monger.", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Fish", "Mains", "Sunday Supper"], "recipeIngredient": ["2 x 1.25 pounds whole fish (sea bream, bass, snapper) scaled, gutted and gilled", "Approximately 2 bunches various herbs (parsley, oregano, chives, tarragon, cilantro)", "1 lemon, sliced thinly in rounds", "1 clove garlic, thinly sliced", "Kosher salt and cracked black pepper", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;. Place a large piece of aluminum on a work surface and place some parsley and a few slices of lemon in the center.  Season the fish with salt and pepper, inside and out, and place on top of lemon and parsley. Stuff the body of the fish with parsley, oregano, sliced garlic, and lemon slices. Wrap foil around fish, making sure the foil is well sealed. Repeat with remaining fish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place both packets of fish on a baking tray and roast in the oven until fish is just cooked through, about 20 minutes. Serve with large green salad, crisp white wine and boiled potatoes.</p>"}]}