{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110119-133518-croque-monsieur-madame.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "cheese", "croque madame", "croque monsieur", "ham", "sandwiches", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sunday Brunch: Croque-Monsieur &amp; Madame", "link": "https://www.seriouseats.com/recipes/2011/01/croque-monsieur-madame.html", "description": "<strong>Croque-monsieur</strong> is, very simply, a grilled ham and cheese; the easy addition of a fried egg on top transforms it into a <strong>croque-madame</strong>. There are many different versions of this classic French fast food, including smothering the final product with cheesy mornay sauce.  Here I've opted for the plain version, but as with any sandwich, you should feel free to explore all the different variations until you create your own perfect version.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Cheese", "Eggs", "Ham", "Sandwiches"], "recipeIngredient": ["8 slices crusty bread", "Dijon mustard or mayonnaise, optional", "8 ounces thinly sliced ham", "6 ounces thinly sliced cheese (such as emmanthal, comté, or swiss)", "4 tablespoons of butter", "4 eggs, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter each slice of bread on one side.  Flip over bread and divide ham and cheese evenly on four slices of the bread. Spread mayonnaise or mustard on other slices as desired.  Assemble sandwiches so that buttered side of each piece of bread is on the outside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat large skillet over medium high heat and add sandwiches (you may need to cook in batches).  Cook for 4-7 minutes until cheese begins to melt, and bread is toasted and golden brown.  Flip and cook until cheese is fully melted and other side of sandwich is brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are making the croque monsieur, slice your sandwich in half and serve.  If you’re making a croque madame, fry eggs in same pan over high heat until white is almost set.  Place sandwich on plate, and place fried egg on top.  Serve either version with lightly dressed green salad and cold wheat beer.</p>"}]}