{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110209-136435-raspberry-liqueur-chocolates-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["candy", "chocolates", "Edible DIY", "liqueur"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Raspberry Liqueur Chocolates", "link": "https://www.seriouseats.com/recipes/2011/02/raspberry-liqueur-chocolates-recipe.html", "description": "These easy homemade candies are reminiscent of fancy dipped chocolates. They may not look as pretty, but they are filled with the fresh, pure flavor of dark chocolate and sweet, boozy raspberries. Gussied up in paper liners and arranged in...", "totalTime": "About 3 hours", "recipeYield": "Makes about 32 chocolates", "recipeCategory": ["Chocolate", "Desserts", "Edible DIY"], "recipeIngredient": ["2 cups granulated sugar", "1/4 cup light cream", "1 tablespoon light corn syrup", "2 tablespoons raspberry liqueur, such as Chambord", "One (12-ounce) package semisweet chocolate chips", "2 tablespoons solid vegetable shortening, unsalted butter, or flavorless oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, cream, corn syrup, and 1/2 cup water in heavy medium-large saucepan. Boil over medium-high heat, stirring constantly with wooden spoon until sugar dissolves. Clip candy thermometer to side of saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium-low. Cook, stirring occasionally, until thermometer reaches 240ºF (soft-ball stage), 20 to 30 minutes. Watch mixture carefully. If it bubbles too close to surface of saucepan, stir gently until it recedes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove saucepan from heat. Cool, without stirring, to 110ºF, about 40 minutes. Remove thermometer. Add raspberry liqueur and beat with wooden spoon until fondant mixture is creamy, thick, and quite stiff, 10 to 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the fondant into 1-inch balls and arrange on baking sheet lined with wax paper. Let stand until dry and firm, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt chocolate and vegetable shortening in heatproof bowl set over pan of simmering water. When chocolate is completely melted and smooth remove bowl from pan. Using two forks, carefully roll balls in chocolate. Return balls to baking sheet lined with wax paper and let stand until dry, about 2 hours. Store, tightly covered, in a cool place for up to two weeks. </p>"}]}