{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110817-166611-flour-croissants.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["croissants", "flour", "pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Croissants", "link": "https://www.seriouseats.com/recipes/2011/08/how-to-make-croissants-french-pastry-recipe.html", "description": "For all of you ambitious bakers out there who have been wondering just how the buttery layers of a croissant come to be, this recipe is for you.  Harvard grad <a href=\"http://flourbakery.com/staff.php\">Joanne Chang</a> has written a comprehensive recipe that will hold your hand from dough rolling to shaping to proudly pulling lovely, flaky croissants out of the oven.", "totalTime": "At least 14 hours, including proofing and resting time", "recipeYield": "10", "recipeCategory": ["Bake the Book", "Bread", "Breakfast and Brunch", "Pastry"], "recipeIngredient": ["1 cup plus 2 tablespoons milk, at room temperature", "1 package (2 1/2 teaspoons) active dry yeast or 2/3 ounce fresh cake yeast ", "2 1/4 cups unbleached all-purpose flour ", "2/3 cup bread flour", "2 teaspoons kosher salt", "1/4 cup sugar", "2 tablespoons (1/4 stick) unsalted butter, very soft, plus 1 cup (2 sticks) cold unsalted butter", "1 egg "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a stand mixer fitted with the dough hook (or a hand mixer), mix together the milk and yeast on low speed for 5 to 10 seconds to dissolve the yeast. Add the all-purpose flour, bread flour, salt, sugar, and the 2 tablespoons soft butter and continue to mix on low speed for 3 to 4 minutes, or until the butter is fully incorporated and the dough is smooth. Remove the dough from the mixer bowl, place it on a tray, and cover it loosely with plastic wrap. This dough block is called the détrempe. Place the tray in the refrigerator for at least 6 hours or for up to 12 hours. The dough will firm up and the yeast will take some action and proof a bit. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 6 hours later, put the <em>détrempe</em> on a well-floured work surface, and then press down firmly to create about an 8-inch square. Rotate the square so that, as you face it, it looks like a baseball diamond. Use the sides of your palm to mark a 7-inch square in the middle of the diamond, creating triangular flaps at the 4 corners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As best you can, roll out each of the triangular flaps into a squarish shape (about 3-inch squares). You will have to tug a bit at the edges to pull the flap into a square as you roll. When you are done, the entire piece of dough will be about 12 inches wide and tall, with a 6-inch-square lump in the middle and one squarish flap off of each side of that lump. The 6-inch-square lump will be about 1 inch thick, and the 4 squarish flaps will be about 1/4 inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the 1 cup cold butter in the stand mixer fitted with the paddle attachment, and beat on medium speed for 15 to 20 seconds to break up the butter, yet still keep it quite cold. (Alternatively, pound the cold butter with a rolling pin to soften it and shape it into a 6-inch square.) Scrape the butter out of the bowl directly onto the 6-inch-square lump in the center of the dough, and pat it with your fingers into a square that covers the 6-inch-square lump. The butter should be about the same consistency as the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold one of the flaps up and stretch it over the butter square to cover it entirely. (The dough is quite stretchy, so you can stretch it to cover the butter completely.) Fold and stretch a second flap over the first flap, then repeat with the third and then the fourth flap. Tug at the flaps to keep them in a square that covers the butter. You will now have a butter square that is entirely encased in dough above and below. Using the palms of both hands, firmly press down on this dough package to create about an 8-inch square. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough package is relatively flat, switch to a rolling pin and continue to flatten the dough by pressing up and down on the package with the pin. Roll out the dough into a rectangle about 16 by 10 inches. As you work, flour the dough and the work surface as needed to prevent the rolling pin from sticking to the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the rectangle so a long side is facing you. Using a bench scraper or a knife, score the rectangle in half vertically, to create two 10-by-8-inch rectangles. Brush any loose flour off the dough. Lift the right side of the dough and fold it in, so the right edge meets the scored line in the center. Then lift the left side of the dough and fold it in, so the left edge also meets the scored line in the center and meets the right edge, as well. Square off the folds as much as possible so the edges meet neatly, then fold the right half of the dough on top of the left half. This is called a book fold. Your dough will now be 4 inches wide, 10 inches from top to bottom, and about 2 inches thick. Rotate the dough pile clockwise 90 degrees; it will now be 10 inches wide and 4 inches from top to bottom. The process of folding and rotating is called “turning the dough.”  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, roll out the dough into a rectangle about 18 inches wide and 8 inches from top to bottom. The dough might be a little sticky, so, again, be sure to flour the dough and the work surface as needed to prevent the pin from sticking. Using the bench scraper or knife, this time lightly score the rectangle vertically into thirds. Each third will be 6 inches wide and 8 inches from top to bottom. Brush any loose flour off the dough. Take the right third of the dough and flip it over onto the middle third. Then take the left third of the dough and flip that third on top of the middle and right thirds. (This is like folding a business letter.) Your dough should now be about 6 inches wide, 8 inches from top to bottom, and about 2 inches thick. Rotate the dough pile clockwise 90 degrees; it will now be 8 inches wide and 6 inches from top to bottom. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough on a baking sheet and cover it completely with plastic wrap, tucking the plastic under the dough as if you are tucking it into bed. Refrigerate for at least 1 1/2 hours and no more than 3 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and place it on a well-floured work surface, with a long side of the rectangle facing you. This time roll out the dough into a rectangle about 18 inches wide and 12 inches from top to bottom. If the dough resists rolling, let it sit and relax for up to 15 minutes and roll again. Once again score it vertically into thirds, and then give it another letter fold (fold the right third onto the middle third, and fold the left third on top of that). Return the dough to the baking sheet and again cover it completely with plastic wrap. This time let it rest in the refrigerator for at least 4 hours or up to 16 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator, and place it once again on a well-floured work surface, with a long side of the rectangle facing you. Roll it out into a long, narrow rectangle about 30 inches wide and 6 to 7 inches from top to bottom.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting at the bottom left corner of the rectangle, make a mark along the bottom edge of the rectangle every 5 inches until you reach the bottom right corner. Then, starting at the top left corner of the rectangle, mark along the top edge exactly midway between the notches on the bottom edge. Your first notch will be 2 1/2 inches from the left corner and then continue to notch every 5 inches. Use a chef’s knife to cut the dough rectangle into triangles by cutting on the diagonal from notch to notch. You will end up with 10 triangles and a few edge pieces of scrap. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting at the edge, cut a 1-inch vertical slit at the center of the base of each triangle. Turn all of the triangles so the base is at the top, farthest from you, and the point is directed toward you. Pick up a triangle and hold it by its base with one hand and gently stretch it and stroke it lengthwise with your other hand to elongate it to 10 to 12 inches in length.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the lengthened triangle on the work surface. Fan open the base at the 1-inch slit into a Y, and then roll the dough down to the point. Place the rolled triangle, point-side down, on the parchment-lined baking sheet, so the point is touching the parchment. Repeat with the remaining dough triangles, spacing the pastries 2 to 3 inches apart on the baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the croissants lightly with plastic wrap and leave them in a warm place for 2 to 2 1/2 hours, or until they are somewhat poufy and airy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk the egg until blended. Gently brush the croissants lightly with the egg. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are baking the croissants the same day, cover them again with plastic wrap and let them finish proofing for another 1 hour to 1 hour and 30 minutes. They will get even more poufy and jiggly when you nudge them.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven, and heat the oven to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the croissants are done proofing, brush them again with the beaten egg. Bake at 400&deg;F for the first 5 minutes, then turn down the oven to 350&deg;F and bake for another 25 to 35 minutes (for a total baking time of 30 to 40 minutes), or until they are golden brown all over. Let cool on the pan on a wire rack for 30 to 40 minutes. Serve warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are baking the croissants the next day, after the first 2- to 2 ½-hour proof, brush them lightly with the beaten egg as directed, wrap them in plastic wrap and place in the refrigerator. The next morning, remove them from the refrigerator and let them sit at room temperature for 30 to 40 minutes. Then heat the oven, brush them again with the beaten egg, and bake as directed.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The croissants taste best the day they are baked. They can be stored in an airtight container at room temperature overnight, and then refreshed in a 300&deg;F oven for 5 to 8 minutes before serving. </p>"}]}