{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002-nick-malgieri-ApplePies17.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["apple", "apple pie", "Guest Star", "Nick Malgieri", "Nick Malgieri Week", "pies", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Maida's Big Apple Pie", "link": "https://www.seriouseats.com/recipes/2011/10/maidas-big-apple-pie-recipe-nick-malgieri-galette-recipe.html", "description": "This big free-standing pastry partially encloses a cinnamon and brown sugar-scented cooked apple filling. It's great for a crowd&mdash;in fact, it's perfect for Thanksgiving if you have a lot of people over. Best of all, it's baked on a big round pizza pan or cookie sheet, so you don't need any special equipment.", "totalTime": null, "recipeYield": "Makes one 12-inch pie", "recipeCategory": ["Apple", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Rich Pastry Dough</strong>", "3 cups all-purpose flour (spoon flour into dry-measure cup and level off)", "1 teaspoon salt", "2 teaspoons baking powder", "20 tablespoons (2 1/2 sticks) unsalted butter, cold, cut into 20 pieces", "2 large eggs", "2 large egg yolks", "&nbsp;", "<strong>Apple Filling</strong>", "4 tablespoons (1/2 stick) unsalted butter", "2 1/2 pounds Granny Smith or other tart apples, peeled, halved, cored, and each half cut into 6 wedges", "2 1/2 pounds Golden Delicious apples, peeled, halved, cored, and each half cut into 6 wedges", "1 cup sugar", "1/3 cup light brown sugar, firmly packed", "1 teaspoon ground cinnamon", "<strong>Egg wash:</strong> 1 large egg well beaten with a pinch of salt", "Sugar for sprinkling the pie before baking"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the pastry, combine the flour, salt, and baking powder in the bowl of a food processor fitted with the metal blade.  Add the butter and pulse about 20 times to mix the butter in finely.  Add the eggs and yolks and pulse until the dough just begins to form a ball, but no longer.  Invert the dough to a floured surface and carefully remove the blade.  Use your hands to press the dough into a disk about 1/2-inch thick.  Wrap in plastic wrap and refrigerate the dough for at least an hour or up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the filling, melt the butter in a large pan with a cover.  Add apples and sprinkle with the sugars and cinnamon.  Cover pan and cook over medium heat for 5 minutes, until apples have exuded juices.  Uncover and continue cooking, stirring occasionally, until apples are tender.  About a third will have disintegrated, and the rest of the apple slices should remain intact.  Cool the filling.  May be made several days in advance and stored, covered, in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the pie, preheat the oven to 375&deg;F and set a rack in the lowest level.  Roll dough to about a 16-inch diameter and center on pan.  Spoon filling into center of disk of dough and fold overhanging dough in toward center of pie.  Brush the top of the folded-over dough with the egg wash and sprinkle with the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pie about 40 minutes, until the dough is a golden color and the filling is bubbling.  Cool on a rack.</p>"}]}