{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110709-lebovitz-tartufi.jpg", "author": {"@type": "Person", "name": "David Lebovitz"}, "recipeCuisine": "", "keywords": ["chocolate", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tartufi", "link": "https://www.seriouseats.com/recipes/2011/07/tartufi-chocolate-covered-ice-cream-recipe.html", "description": "Chocolate-covered ice cream balls.", "totalTime": "", "recipeYield": "Makes 8 tartufi", "recipeCategory": ["Chocolate"], "recipeIngredient": ["2 cups (500 ml) ice cream", "6 ounces (170 g) bittersweet or semisweet chocolate, chopped", "6 tablespoons (85 g) unsalted butter, cut into pieces", "1 1/2 tablespoons light corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two large dinner plates with plastic wrap or parchment paper and put them in the freezer. Once the plates are chilled, use an ice cream scoop to make balls of your favorite ice cream, setting them on one of the plates. Take care that the scoops are solid and well formed, with no dangling bits of ice cream; use your hands if necessary. Freeze the ice cream scoops thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To dip the Tartufi, melt the chocolate, butter, and corn syrup in a medium bowl set over a pan of simmering water. Once the chocolate is melted and the mixture is smooth, remove the bowl of chocolate from the improvised double boiler. Remove the ice cream balls from the freezer, and the second plate as well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Here the trick is to going to be to try to get as thin a shell as possible around the ice cream. Using two soup spoons, drop a frozen scoop of ice cream into the melted chocolate mixture and toss it quickly until it’s coated. Transfer it onto the unused dinner plate. Repeat with the remaining scoops of ice cream, then return the scoops to the freezer until ready to serve.</p>"}]}