{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-177675-cranberry-bourbon-pumpkin-pie-610x458-33.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pecans", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Bourbon Pumpkin Pie", "link": "https://www.seriouseats.com/recipes/2011/11/bourbon-pumpkin-pie-recipe-thanksgiving-pie.html", "description": "This is my dream pumpkin pie, smooth and creamy, with a double booze infusion. There's a hint of bourbon in the filling, but since booze that is baked loses its edge, I've incorporated it into the maple bourbon mascarpone topping as well. The combination of the creamy filling and topping and a light layer of toasted pecans makes this pie the winner for adults this holiday season.", "totalTime": "8 hours", "recipeYield": "Serves 8 people", "recipeCategory": ["Nuts", "Pies, Tarts, and Crumbles", "Pumpkin"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "2 cups pumpkin puree (<a href=\"http://sweets.seriouseats.com/2011/11/sweet-technique-making-pumpkin-puree.html?ref=latestc\">homemade</a> or store-bought)", "12 ounces evaporated milk", "1 cup packed light brown sugar", "3 tablespoons bourbon", "1/2 teaspoon salt", "1 tablespoon ground ginger", "1 teaspoon freshly grated nutmeg", "2 eggs and 1 egg yolk", "1/2 pint heavy cream, chilled", "4 ounces mascarpone cheese, chilled", "1/4 cup real maple syrup", "2 to 3 tablespoons bourbon", "3/4 cup pecans, roughly chopped and toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. Line the bottom of the chilled, shaped pie crust with parchment or foil and fill with weights (I like to use and re-use dried beans for this purpose). Bake in the preheated oven for 20 minutes, rotating halfway through. Remove the weights and lining and bake for an additional 10 minutes, or until the bottom is a light golden brown. Allow the crust to cool and lower the oven temperature to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine the pumpkin, evaporated milk, sugar, bourbon, and spices. Puree for 30 seconds, stop and scrape down the sides of the bowl and around the blade, then puree for another 30 seconds. Add the eggs, one at a time, and process for 5 seconds each time. Scrape down the sides one more time and run again for 5 seconds. Pour filling into the cooled pie crust, and bake for approximately 30 minutes on the middle rack, rotating halfway through, or until the filling jiggles just slightly and puffs a bit. If the crust begins to get too dark, place patches of foil over the dark spots. Allow the pie to cool completely. You may refrigerate or hold it at room temperature for up to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Right before serving: Place the heavy cream in the bowl of a stand mixer fitted with a whisk attachment. Whip the cream to soft peaks on medium-high speed then add the mascarpone and whip until the cream is thick and somewhat stiff. Turn the mixer down to low speed and drizzle in maple syrup. Whisk on high until it is incorporated and the mixture is stiff. Reduce the speed to low and add the bourbon. Whisk on high speed to incorporate. Top the pie with a layer of cooled, toasted pecans, reserving some for the top. Cover the pecan layer with the whipped bourbon topping, then sprinkle additional toasted pecans over the top. Serve immediately.</p>"}]}