{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110228-139344-parsnip-vanilla-soup.jpg", "author": {"@type": "Person", "name": "Kristen Swensson Sturt"}, "recipeCuisine": "", "keywords": ["healthy", "healthy and delicious", "parsnips", "root vegetables", "soup", "vanilla", "vanilla bean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Healthy &amp; Delicious: Parsnip Soup with Vanilla", "link": "https://www.seriouseats.com/recipes/2011/03/healthy-delicious-parsnip-soup-with-vanilla-recipe.html", "description": "Frequently overshadowed by more colorful produce, <strong>the humble parsnip deserves more props</strong> than it often receives. The slender, goldenish root vegetable possesses the sweetness of a carrot and a slight starchiness that suggests a potato, all while packing a nice little nutritional punch. A good source of potassium, parsnips are also high in fiber, as well as vitamins C and K. They're much easier to peel than rutabagas, too. So there's that.", "totalTime": "80 minutes", "recipeYield": "4", "recipeCategory": ["Healthy and Delicious", "Soups and Stews"], "recipeIngredient": ["2 pounds parsnips (not too thick at the top), peeled and chopped into 1-inch chunks", "8 cups water", "1/2 vanilla bean", "2 or 3 tablespoons unsalted butter", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, combine parsnips and water. Scrape seeds from vanilla bean and add to Dutch oven along with the husk itself. Bring to a boil. Reduce to a simmer and cook for 60 minutes. Remove vanilla bean husk. Add butter to soup, then using a blender or an immersion blender, carefully puree soup, in batches if necessary. If soup is too thick, add water until it reaches desired consistency. If soup is too thin, simmer to reduce until it reaches desired consistency. Season to taste with salt and pepper.</p>"}]}