{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110222-139128-quick-kimchi.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Korean", "keywords": ["cabbage", "Cecilia Hae-Jin Lee", "Cook the Book", "kimchi", "Korean", "Quick and Easy Korean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Cook the Book: Quick Kimchi", "link": "https://www.seriouseats.com/recipes/2011/02/quick-kimchi-recipe.html", "description": "No Korean meal is complete without a bit of kimchi, the love-or-hate-it fermented vegetable preparation, usually made of cabbage or radish.  Kimchi's flavor varies widely depending on how it's made. It can anywhere from bright red and spicy with plenty of Korean chile powder to over-the-top-brush-your-teeth-immediately garlicky. Personally, I love them all and eat plenty of kimchi straight out of the jar, standing in front of an open fridge.", "totalTime": null, "recipeYield": "1 gallon", "recipeCategory": ["Cabbage", "Cook the Book", "Korean"], "recipeIngredient": ["2 napa cabbages", "1 medium daikon radish", "1/4 cup coarse sea salt ", "1 cup water", "4 green onions, cut into 2-inch lengths", "7 cloves garlic, minced", "2 tablespoons minced or grated ginger", "2 tablespoons Korean chile powder", "2 tablespoons Asian fish sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the cabbages and cut them crosswise into about 2-inch lengths. Peel the daikon, cut lengthwise into quarters, then into pieces about 1/2 inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve the salt in 1 cup water. Put the cabbages and daikon in a large bowl and pour the salt water over them. Let sit at least 6 hours or overnight.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, drain the vegetables but reserve the water. Return the cabbages and daikon to the same bowl. Add the green onions, garlic, ginger, chile powder, and fish sauce and mix well. Pack the mixture into a 1-gallon glass jar. Slowly pour the reserved salty water over the vegetables to cover, leaving about 1 inch of space on top. Tightly close the jar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the jar sit in a cool, dark place for 2 to 3 days, depending on the weather and how ripe (pickled) you like your kimchi. Refrigerate after opening. It will keep for a couple of weeks, after which you'll want to make fried rice, kimchi pancakes, or a hot pot with it.</p>"}]}