{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110627-158681-karashi-mustard-short-ribs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "grill", "grilling", "Harris Salat", "meat", "rib", "short ribs", "Tadashi Ono", "The Japanese Grill"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Karashi Mustard Short Ribs ", "link": "https://www.seriouseats.com/recipes/2011/06/karashi-mustard-short-ribs-recipe.html", "description": "By marinating plenty of fatty short ribs in a mix of karashi mustard, a sinus-clearing paste of nearly wasabi-like spiciness as well as soy, sugar, and a touch of unexpected but perfect balsamic, these ribs have a chance to tenderize slightly and absorb a punchy hit of mustard.  Once marinated (do yourself a favor and let them sit for at least a few hours), <strong>these short ribs can be treated exactly like steak.</strong> Just slap 'em on the grill, brush with the marinade a couple of times, and cook them to your desired level of doneness.", "totalTime": "25 minutes plus at least 1 hour marinating time", "recipeYield": "4Â ", "recipeCategory": ["Beef", "Bread", "Cook the Book", "Grilling"], "recipeIngredient": ["2 pounds short ribs, cut into 4 pieces (each about 3 inches long and 2 inches thick; ask your butcher to do this)", "1 teaspoon salt, plus more for seasoning the meat", "1 tablespoon freshly ground black pepper, plus more for seasoning the meat ", "2 tablespoons karashi mustard", "2 tablespoons balsamic vinegar", "1/4 cup soy sauce", "1 tablespoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously season the short ribs with salt and freshly ground pepper all over. Whisk together the mustard, balsamic vinegar, soy sauce, sugar, the 1 tablespoon pepper, and the 1 teaspoon salt in a bowl to make the marinade; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a grill to medium. Grill the short ribs, covered, this way: Start with the bone side up, grilling for about 5 minutes. Flip the short ribs, so the bone side is now down (the bone will prevent the meat from burning), and brush the marinade on top. Grill about 15 more minutes, brushing with more marinade on top 3 more times. When the short ribs are ready, they’ll be richly browned and glossy. Test for doneness using “The ‘Nick-and-Peek’ Method”. Let the short ribs rest for 5 minutes and serve.</p>"}]}