{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110215CreamyMushroomFettuccine.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["crimini mushrooms", "fettuccine", "French in a Flash", "mushrooms", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "French in a Flash: Creamy Mushroom Fettuccine", "link": "https://www.seriouseats.com/recipes/2011/02/creamy-mushroom-fettuccine-recipe.html", "description": "This pasta dish is sort of a giant mushroom <em>duxelles</em> piled on top of fettuccine.  I always write that crème fraîche is a magic ingredient (and it's even more magic when you can make it <a href=\"http://www.seriouseats.com/recipes/2011/02/how-to-make-creme-fraiche-in-1-easy-step.html?ref=latestc\">in one easy step!</a>), because it just refuses to separate.  You can do anything to it, and it's completely resilient.", "totalTime": "30 minutes", "recipeYield": "4 to 6", "recipeCategory": ["French", "Mushrooms", "Pasta"], "recipeIngredient": ["1/2 cup low-sodium organic chicken stock", "1/4 ounce dried wild mushrooms", "1 tablespoon unsalted butter", "1 tablespoon olive oil", "1 pound cremini mushrooms, cut into eighths", "1 extra large shallot, minced", "2 medium cloves garlic, chopped", "2 teaspons fresh picked thyme leaves", "Kosher salt", "Freshly cracked black pepper", "1 pound dry fettuccine", "1/2 cup crème fraîche", "1/2 cup finely grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil.  In a small covered pot, heat the stock and dried mushrooms together over medium heat until simmering. Remove from heat and allow them to rest for 10 minutes.  In a large, high-sided braising pot, heat the butter and olive oil over medium heat until foaming subsides.  Add the cremini mushrooms and sauté, stirring often, until golden brown, 6 to 7 minutes.  Add the shallot, garlic, and thyme, and season with salt and pepper.  Reduce heat to low and cook, stirring frequently until the shallot is soft, 1 to 2 minutes.  Remove the reconstituted dried mushrooms from the stock.  Add the stock to the fresh mushrooms and shallots, and cook until almost absorbed, 1 minute.  Turn off the heat, and cover the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the fettuccine until al dente, reserving 1/4 cup of cooking water before draining. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mini food processor, blend together the reconstituted dried mushrooms and the crème fraîche.  Add the mixture to the fresh sautéed mushrooms, and stir to melt the crème fraîche into a sauce.  Toss in the pasta, and add just enough pasta water for the mushrooms mixture to lightly coat the strands of pasta.  Toss with Parmesan, and serve alongside a sliced seared steak, or on its own with a drizzle of black truffle oil.</p>"}]}