{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110622-127355-dinner-tonight-mole-huasteco.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "Dinner Tonight", "Mexican", "mole"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Huasteca-Style Chicken in Mole", "link": "https://www.seriouseats.com/recipes/2011/06/huasteca-style-chicken-in-mole-sauce-recipe.html", "description": "I've made loads of Mexican moles over the past few years, but none that have tasted quite like this one from <em><a href=\"http://www.amazon.com/dp/061800713X/?tag=serieats-20\">Zarela's Veracruz</a></em>. In fact, I'd never even heard of Huasteca-Style mole before. But that's also what I love so much about Mexican cuisine. I've learned about dishes from Oaxaca and Puebla, but still have much to know more about other regions, especially from the <a href=\"http://en.wikipedia.org/wiki/La_Huasteca\">northeastern portion of the country</a>.", "totalTime": "1 hour and 15 minutes", "recipeYield": "4 people", "recipeCategory": ["Chicken", "Dinner Tonight", "Mexican"], "recipeIngredient": ["1 chicken, quartered, backbone and wings set aside for another use ", "4 sprigs mint ", "2 small white onions, one left unpeeled, second one chopped ", "1 tablespoons salt ", "6 cups water", "4 large tomatoes, about 2 pounds total", "5 garlic cloves, unpeeled", "1 teaspoons black peppercorns", "One 1-inch piece canela ", "10 cloves", "5 large ancho chiles, stemmed and seeded", "4 tablespoons vegetable oil, divided", "Chopped cilantro", "White rice and/or corn tortillas ", "1 teaspoon sugar (or up to 1 tablespoon, to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken pieces to a large pot, along with the mint, unpeeled onion, 2 teaspoons of salt, and the water. Bring to a boil over high heat, and then reduce to low. Skim off any foam that comes to the surface. Cook the breasts until they register 140&deg; and the legs hit 150&deg;, measuring with a meat thermometer. This should take 25 to 30 minutes. Remove the chicken from the broth, and set aside. When chicken is cool, take off the skin, and remove meat from the bones. Using your fingers, shred the chicken. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place a sheet of aluminum foil on a cast iron skillet set over medium heat. When hot, add the tomatoes. Using a pair of tongs, flip and turn the tomatoes occasionally, until the skins are blistered and blackened all over, about ten minutes. Set aside and let cool for a few minutes. Then peel the skins off and place tomatoes in a blender.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium-low, and add the garlic cloves. Stir occasionally and cook until the insides are soft, about eight minutes. Set garlic aside and let cool, and then remove from skins and place in the blender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the garlic is roasting, add the peppercorns, canela, and cloves to a small heavy skillet set over medium heat. Shake the pan constantly, and toast them until very fragrant, one to two minutes. Transfer to the blender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken is done, remove two cups of the stock and transfer to a medium-sized bowl. Add the chiles and let soak for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two tablespoons of the oil into a large saucepan set over medium heat. When oil is shimmering, add the chopped onions. Stir often and cook until translucent, about three minutes. Add the onions to the blender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chiles are done soaking, add them to the blender, along with their liquid. Puree the mixture thoroughly, stopping occasionally to scrape down the sides with a spatula. It should take a few minutes to do this. Strain this mixture through a medium-mesh sieve into a bowl, using the spatula to force the liquid through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean out the large saucepan, and then add the remaining two tablespoons of oil. Turn the heat to medium, and when shimmering, add the chile mixture. Cover and cook, stirring occasionally, until it has reduced and the fat is starting to separate, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shredded chicken, thin with a little of the remaining stock, and add the sugar. Season to taste with more salt. Serve with white rice, tortillas, and some chopped cilantro.  </p>"}]}