{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110924shuna-scones.jpg", "author": {"@type": "Person", "name": "Shuna Lydon"}, "recipeCuisine": "", "keywords": ["blueberries", "breakfast sweets", "scones", "Shuna Lydon", "Shuna Lydon Week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry, Juniper, and Cornmeal Drop Scones", "link": "https://www.seriouseats.com/recipes/2011/09/blueberry-juniper-and-cornmeal-drop-scones-recipe.html", "description": "I have a thing for foresty flavors. If a tea is described as mossy; if pine needles are infused into a custard; if gnomes built their homes and hung their tall red felt hats there, I'm in. While making a California Bay Laurel leaf pastry cream and blueberry compote for a filled doughnut, I discovered the <strong>blueberry's affinity with piney flavors</strong>. At <strong><a href=\"http://peelsnyc.com/\">Peels</a></strong>, where I'm the pastry chef, we offer seasonal herb, fruit and vegetable monthly-changing sweet and savory scones. Cornmeal offers great textural juxtaposition, as well as an obvious seasonal pairing. On the East Coast there's no better berry to dedicate late summer bakery offerings to than our prized blueberries.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Blueberry", "Breakfast and Brunch", "Breakfast Sweets"], "recipeIngredient": ["<strong>For the Scones:</strong>", "115g cake flour", "325g all-purpose flour", "125g medium cornmeal", "2 1/4 teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon Kosher salt", "225g unsalted butter, cold", "125g honey", "100g light brown sugar", "4 -4 1/2 tablespoons juniper sugar", "2 large egg yolks", "100g buttermilk", "250g labne or greek yogurt", "300g blueberries", " ", "<strong>For the Juniper Sugar:</strong>", "3 tablespoons juniper berries", "150 g raw or Demerara sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Juniper Sugar</strong>: Using a high-powered blender or spice grinder, grind both ingredients together until fully blended. (This will make extra. Reserve remainder.) Juniper sugar will keep, at room temperature, in tightly sealed container, in a cool, dark place, for up to one month. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Scones</strong>: Preheat oven to 350°F. Line a baking sheet with parchment paper. In a large dry bowl, sift weighed cake flour, baking powder, and baking soda. To this bowl add flour, cornmeal, juniper sugar, salt, and light brown sugar. Run your fingers through these dry ingredients and break up all brown sugar until mixture is uniform and unclumpy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl weigh in eggs, yolks, honey, buttermilk and yogurt. Reserve the blueberries in their own bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all ingredients are ready, slice butter into ½ inch pieces and drop into dry ingredient mixture. Bury your hands into the mixture and quickly press and release butter shavings until butter is in nickel- or dime-sized pieces. Gently create “well” in center. Whisk, with one hand, all wet ingredients and pour into “well” of dries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop and breathe for a moment. Recalibrate your mind into <em>salad mode</em>. No, I’m not joking. If you skip this step you will ruin the delicate texture of your scone (and turn it all into a gummy mess).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread both your hands as wide as your fingers will stretch, pitchfork-style. <em>Taut!</em> Do not let your hands let go of this position until you pull them out of the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turning bowl clockwise with your forearms, “toss” scone mix, as if it were salad greens, until <em>almost uniform</em>. Toss all blueberries in at once and finish “tossing” the sticky mass only until <strong>just </strong>evenly incorporated. Pull heavy fingers out and, once out, make hand into fists one hand at a time, “clearing” each hand with the other, being cautious not to pull on dough too much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a scale, weigh scones in at 90 grams per piece, evenly spaced on baking sheet, with at least 1½ inches between each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in middle rack of oven with first timer set at 10 minutes. Turn pan to face opposite direction after 10 minutes and set following timer for 8 – 12 minutes. Scones are done when middle bounces back to the touch or scone can be lifted or slid across tray easily. Please note, because of the ingredients, these scones can get quite dark on the outer edges quite fast. Do not be alarmed; color is flavor! But if your oven runs hot you may want to bake at 325°F. If your oven runs hot you may also want to “double-pan” scones—fit another baking pan under the ones the scones are on. This trick protects the bottoms of the delicate bodies of the scones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you fear you have over-baked the scones, slide parchment off of tray onto a table or cooking rack immediately after coming out of oven.</p>"}]}