{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/02242011-139448-lamb-stew-poppy-seed-dumplings.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["dumplings", "lamb", "stews", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sunday Supper: Lamb Stew with Poppy Seed Dumplings", "link": "https://www.seriouseats.com/recipes/2011/02/lamb-stew-with-poppy-seed-dumplings-recipe.html", "description": "This simple lamb stew is topped with large dumplings that can easily soak up all the meaty juices.  Depending on your preference for the consistency of this stew, you could easily add another cup of stock and punch up the seasoning with more salt and pepper.  A handful of frozen peas mixed in to the stew just before the dumplings are added can add some nice color as well as flavor.", "totalTime": "2 hours", "recipeYield": "4", "recipeCategory": ["Lamb", "Mains", "Sunday Supper"], "recipeIngredient": ["1.5 pounds lamb stew meat", "3 tablespoons all-purpose flour", "Kosher salt and cracked black pepper", "Vegetable oil", "1 medium onion, finely chopped", "1 carrot, finely chopped", "1 rib celery, finely chopped", "1 parsnip, finely chopped", "2 cloves garlic, minced", "1/2 can beer ", "36 ounces (3 1/2 cups) chicken stock", "1/2 bunch curly parsley, roughly chopped", "1/2 – 1 cup frozen peas, optional", "<strong>Dumplings:</strong>", "10 ounces (2 cups) all-purpose flour", "1 tablespoon baking powder", "1 teaspoon salt", "2 teaspoon poppy seeds", "1 egg", "8 ounces (1 cup) milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large drizzle of vegetable oil over medium high heat in large heavy bottomed lidded pot until shimmering.  Combine flour and a good sprinkle of salt and pepper.  Toss lamb stew meat in flour mixture, shaking off excess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brown lamb on all sides in batches, adding more vegetable oil as needed between batches.  Reserve meat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If needed, add another drizzle of vegetable oil followed by chopped onion.  Cook, stirring often, until onions are soft and beginning to brown.  Add carrot, celery, parsnip and garlic and cook until vegetables begin to soften.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add browned meat and all juices back to pot.  Pour over half can of beer, chicken stock and 1/2 the roughly chopped parsley.  Bring to a simmer over medium high heat, then turn to low and partially cover, cook until meat is tender, about 1 hour.  Season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once meat is tender, make dumplings by whisking together flour, baking powder, salt and poppy seeds.  In a separate bowl beat egg and combine with milk.  Add milk and egg to flour mixture stirring gently to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring stew to a rolling simmer over medium high heat.  Add dumpling batter to stew using a 1/4 cup dry measure until all batter is used.  Cover for 10 minutes, remove lid and cook until dumplings are cooked, another 3.5 minutes.  Garnish with parsley and serve with a mug of beer.</p>"}]}