{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110926-171600-sprinklewich2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cake sandwiches", "Cakespy", "dessert sandwiches", "frosting sandwiches", "pound cake", "teacakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sprinkle Cakewiches", "link": "https://www.seriouseats.com/recipes/2011/09/frosting-and-sprinkle-cakewiches-recipe.html", "description": "Time for High Tea? More like high time to give tea sandwiches a totally sweet makeover, with these slim and dainty but devilishly decadent frosting-filled Sprinkle Cakewiches!", "totalTime": "45 minutes", "recipeYield": "9", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["1 pound cake (baked in a loaf pan, approximately 9x5 inches)", "1 stick butter", "2-3 cups confectioners' sugar", "2-3 drops red food coloring (optional)", "Sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill the poundcake in the refrigerator for 1 hour or the freezer for 20-30 minutes. You will need to do this so that it will be firm enough to be sliced thinly without breaking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cake chills, prepare the frosting. In a stand mixer fitted with the paddle attachment, cream the butter until fluffy; add the confectioners' sugar little by little until a creamy, spreadable consistency has been reached. You want this to be slightly less stiff than if you were frosting the outside of a cake, because you will be spreading it on a fairly delicate surface. Adding a couple of drops of red food coloring so you have pink frosting is not necessary, but I highly recommend it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the poundcake from its chilling place and slice into 1/2-inch thick slices. You should get about 18 slices from one loaf cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place two slices side by side, aligned as mirror images so that when you stack them after adding the fillings, the slices will match direction.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread a thin layer (about 1 teaspoon) frosting on each slice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle a generous amount of sprinkles on one of the slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the un-sprinkled side on top of the slice with sprinkles to form a sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the remaining slices until you have made 9 full-sized cakewiches. If desired, slice each sandwich in half for daintier, tea sandwich-sized portions.</p>"}]}