{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110217-138426-SeriousHeat-Shrimp-Popcorn-Jalapenos-Large.jpg", "author": {"@type": "Person", "name": "Andrea Lynn"}, "recipeCuisine": "", "keywords": ["jalapenos", "popcorn", "Serious Heat", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Heat: Sizzling Shrimp Popcorn with Jalapeños", "link": "https://www.seriouseats.com/recipes/2011/03/serious-heat-sizzling-shrimp-popcorn-with-jalapenos.html", "description": "I once saw a friend top their movie popcorn with the pickled jalapeños meant for the nachos&mdash;confiding that they enjoyed not just the spice of the chiles in their popcorn, but also the pickling juice oozing all over it. Then I came across <a href=\"http://today.msnbc.msn.com/id/41060648/ns/today-foodwine/#slice-3\">Todd English's recipe</a> for Sizzling Shrimp Popcorn with Jalapeños and was further intrigued. I wasn't sure about the recipe&mdash;okay, I'm down to try fresh jalapeños topped over my popcorn, but adding shrimp to the mix? However, I'm an equal-opportunity popcorn eater, so I gave it a whirl.", "totalTime": "15", "recipeYield": "4", "recipeCategory": ["Serious Heat", "Shrimp"], "recipeIngredient": ["1/4 cup unpopped popcorn kernels ", "1 tablespoon unsalted butter ", "Salt and pepper to taste ", "1 cup small or medium shrimp ", "1/4 pound whole unsalted sweet butter", "1/2 cup roughly chopped Italian parsley ", "2 jalapeños, sliced thinly", "3/4 cup Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 3-quart stock pot, melt butter over medium heat. Add popcorn kernels and heat until all popped. Transfer from pot into large mixing bowl and toss in salt and pepper. In a saute pan, melt butter over medium heat. Add shrimp and saute for 1 to 2 minutes, constantly stirring, being careful not to overcook shrimp. Finish with salt and pepper. Off heat, add parsley and jalapeños, stirring to combine.  Remove from heat, and pour the contents of the pan with the shrimp over the popcorn. Toss until the popcorn is well coated. Place in a large serving bowl and garnish with Parmesan cheese.<br />\n</p>"}]}