{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110629-food-lab-pie-crust-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["crusts", "desserts", "pies", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5849056603774", "ratingCount": "53"}, "name": "Easy Pie Dough", "link": "https://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html", "description": "This makes enough for two single-crust pies or one double crust pie. For a slightly more tender crust, replace up to 6 tablespoons of butter with vegetable shortening. Pie dough can be frozen for up to 3 months. Thaw in refrigerator before rolling and baking.", "totalTime": "10 minutes", "recipeYield": "Makes 2 single crust or 1 double crusted pie", "recipeCategory": ["Pies, Tarts, and Crumbles"], "recipeIngredient": ["2 1/2 cups (12.5 ounces; 350 grams) all-purpose flour", "2 tablespoons (25 grams) sugar", "1 teaspoon (5 grams) kosher salt", "2 1/2 sticks (10 ounces; 280 grams) unsalted butter, cut into 1/4-inch pats", "6 tablespoons (3 ounces; 85 milliliters) cold water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine two thirds of flour with sugar and salt in the bowl of a food processor. Pulse twice to incorporate. Spread butter chunks evenly over surface. Pulse until no dry flour remains and dough just begins to collect in clumps, about 25 short pulses. Use a rubber spatula to spread the dough evenly around the bowl of the food processor. Sprinkle with remaining flour and pulse until dough is just barely broken up, about 5 short pulses. Transfer dough to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle with water then using a rubber spatula, fold and press dough until it comes together into a ball. Divide ball in half. Form each half into a 4-inch disk. Wrap tightly in plastic and refrigerate for at least 2 hours before rolling and baking.</p>"}]}