{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110719-162015-chicken-tingas-sandwich.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "Cook the Book", "Jean Tang", "Mexican", "sandwich", "Sara Reistad-Long", "The Big New York Sandwich Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Chicken Tingas Sandwich", "link": "https://www.seriouseats.com/recipes/2011/07/chicken-tingas-sandwich-recipe.html", "description": "Piled high with beans, meat, avocado, shredded lettuce, salty cheese, and some sort of spicy sauce-slathered protein, few things are better than a great Mexican sandwich.  Whether it's a <em>torta</em> or a <em>cemita</em>, these guys are equal parts quality and quantity. This <strong>Chicken Tingas Sandwich</strong> from <em><a href=\"http://www.amazon.com/Big-New-York-Sandwich-Book/dp/0762440481/?tag=serieats-20\">The Big New York Sandwich Book</a></em> begins with slow simmered chicken braised in chipotle vinegar adobo sweetened with Mexican Coke and juicy summer tomatoes, otherwise known as <em>tingas</em>.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Mexican", "Sandwiches"], "recipeIngredient": ["<strong>Tingas</strong>", "3/4 cup extra virgin olive oil, divided", "1 small onion, julienned (about 1/2 cup)", "5 or 6 garlic cloves, sliced (about 1/4 cup) ", "8 plum tomatoes, seeds removed, julienned ", "8 ounces Mexican Coca-Cola (or any similar cola made with cane sugar)", "1 cup Chipotle Vinegar Adobo (recipe follows)", "1 bay leaf", "4 skinless boneless chicken breasts ", "&nbsp;", "<strong>Sandwiches</strong>", "4 sesame seed rolls", "8 ounces queso Oaxaca (if unavailable, substitute mozzarella)", "1 (14-ounce) can refried beans", "2 sprigs papalo (if unavailable, substitute cilantro)", "Chicken Tingas", "1/2 head iceberg lettuce, shredded", "1 whole avocado, sliced thinly", "&nbsp;", "<strong>Chipotle Vinegar Adobo:</strong>", "15 dried chipotle chiles", "1/2 medium white onion", "1/2 cup cider vinegar", "2 tablespoons lime juice", "2 tablespoons orange juice", "1 tablespoon honey", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the chipotle vinegar adobo:</strong> Bring a small pot of water to a boil. Remove the stems and seeds from the chiles. Place a dry cast-iron skillet over medium heat. When hot, toast the chiles until deep red-brown, taking care not to burn, about 20 seconds. Place the chiles in a glass bowl and pour enough boiling water over them so they’re just barely covered. Cover the bowl with plastic wrap and let the chiles rest for 15 minutes. Place the cut side of the onion half in the same cast-iron skillet over medium heat and toast until it’s blackened, about 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the chiles, saving the water. Combine the chiles, onion, vinegar, lime juice, and orange juice in a blender and purée on high until a smooth paste forms, adding a little of the chile water, if needed, to achieve a nice smooth texture. Season with honey and salt to taste, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the tingas:</strong> Preheat the oven to 250°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/2 cup of the olive oil in a medium saucepan over a low flame. Add the onion and garlic and sweat them until tender and translucent, but not brown, about 8 minutes. Add the tomatoes, and cook them until they begin releasing their juices, about 5 minutes. At that point, pour in the Mexican Coke and Chipotle Vinegar Adobo. Add the bay leaf. Simmer the mixture over low heat for 30 minutes to marry the flavors and to reduce the liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a Dutch oven or other heavy cooking pot over medium-high heat. Add the remaining 1/4 cup olive oil. When hot, sear the chicken until golden brown. Turn over and sear quickly on the other side. Pour the sauce over the chicken, cover the pot, and place in the oven. Cook until the meat is completely tender, about 45 minutes. For breasts only, aim for 45 minutes. If you’re using legs as well, leave those in for 2 hours, removing the breasts when ready. When the chicken has cooled, shred the meat and toss it with some of the remaining sauce. The mixture should be thick and moist, but not saucy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sandwiches:</strong> Halve the rolls crosswise, add an ounce of cheese to the top side of each, and toast them until the cheese has melted. Smear a bit of the refried beans on the bottom of each bun, place 3 or 4 leaves of papalo on the beans and then evenly pile the tingas mixture onto each bottom bun. Finish each with the shredded lettuce, a quarter of the avocado slices, and the top half of the bun.</p>"}]}