{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/Past%20w%20mushrooms%20and%20eggplant%20-%204%20-%20large.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["eggplant", "pasta", "Portobella", "tomatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Pasta with Eggplant, Portobella, and Tomatoes", "link": "https://www.seriouseats.com/recipes/2011/02/pasta-with-eggplant-portobella-and-tomatoes.html", "description": "I spent a good portion of the last month making eggplant parmesan for <a href=\"http://www.seriouseats.com/2011/02/the-food-lab-all-american-eggplant-parmesan.html\">the Food Lab article</a> on the subject. This left me with a few things: lots of canned tomatoes, plenty of Parmigiano-Reggiano, a slew of eggplants, and a great microwave-then-cook technique for getting the most out of their texture. That's about all there is to say about this recipe, other than the fact that it takes about 20 minutes to throw together, and is really good to boot.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Eggplant", "Pasta", "Vegetarian"], "recipeIngredient": ["1 medium eggplant (about 1/2 pound) cut into 1/2-inch cubes", "1 pound short pasta such as rotini or gemelli", "Kosher salt", "2 tablespoons extra-virgin olive oil", "2 tablespoons unsalted butter", "3/4 pound portabella mushroom caps, cleaned and cut into 1/4-inch slices.", "3 medium cloves garlic, grated on a microplane (about 3 teaspoons)", "2 teaspoons chopped fresh thyme leaves", "1 tablespoon lemon juice from 1 lemon", "1 (28-ounce) can whole tomatoes, drained and roughly chopped", "Freshly ground black pepper", "Parmigiano-reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line large plate with double layer of paper towels or clean kitchen towel. Spread eggplant over paper towels. Cover with another double layer of paper towels and place second large plate on top. Microwave on high power until eggplant pieces collapse easily when pressed, 2 to 3 minutes (be careful, plate will be hot). Remove excess moisture from eggplant pieces by pressing down on paper towels with clean kitchen towel. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pasta in large saucepan and cover with well-salted water by 2 inches. Bring to a boil over high heat, cover pot, remove from heat, and allow to cook until pasta is al dente (see back of box for timing). Drain pasta, reserving 2 cups of liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pasta is cooking, heat olive oil and butter in a 12-inch straight-sided sauté pan over high heat until melted and beginning to brown. Add mushrooms and eggplant and cook, stirring occasionally until mushrooms have released all their moisture and the mushrooms and eggplant are well-browned, about 6 minutes. Add garlic and thyme and cook, stirring constantly until fragrant, about 30 seconds. Add lemon juice and tomatoes and bring to a simmer. Season to taste with salt and black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cooked pasta to sauce, adding extra cooking liquid until sauce reaches desired consistency. Serve immediately with grated Parmigiano-Reggiano.</p>"}]}