{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110322_142975_GFTues_Saltines.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["crackers", "gluten free", "Gluten-Free Tuesday"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Gluten-Free Tuesday: Saltines", "link": "https://www.seriouseats.com/recipes/2011/03/gluten-free-tuesday-saltines-recipe.html", "description": "A person new to the gluten-free diet recently said to me, \"You know what I really miss? <em>Saltines</em>. I'd give anything for a good cracker. Since going gluten-free I eat potato chips instead of crackers and it's just not the same.\" I understood her longing. Before going gluten-free, the humble saltine was my go-to snack. When I went gluten-free, however, I soon realized that gluten-free saltines were not commercially available. Being without saltines was not an option, so I created a recipe for them.", "totalTime": "1 hour", "recipeYield": "multiple people (thirty crackers)", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["4 ounces (1 cup) white rice flour", "2.5 ounces (1/2 cup) brown rice flour", "2.5 ounces (1/2 cup) cornstarch", "1 1/2 teaspoons baking powder", "3/4 teaspoon salt", "1/2 teaspoon xanthan gum", "6 tablespoons cold butter or dairy-free shortening, cut into small pieces", "1/2 cup cold water plus more if needed", "Kosher salt for sprinkling "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center oven racks in middle of oven. Preheat oven to 425&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together white rice flour, brown rice flour, cornstarch, baking powder, salt, and xanthan gum in large mixing bowl or bowl of food processor. Whisk or pulse food processor to combine.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cold butter or shortening. Cut butter into flour until butter is the size of baby peas. If the butter is too incorporated, the crackers won’t be as flaky. Add water. Stir or pulse food processor until a dough forms. Dough will be firm. If dough is dry, add an additional tablespoon of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dough between two pieces of parchment paper. (Parchment should be about 12 x 16-inches.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll dough about 1/16-inch. Remove top piece of parchment paper. Slide dough onto rimmed baking sheet. Prick dough all over with a fork. Using a pizza wheel, cut dough into cracker-size pieces. Generously sprinkle kosher salt all over the top of the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until crackers are golden brown, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pan from the oven and allow crackers to cool. Once cool, break crackers apart, if needed. (Crackers usually break apart while baking.) </p>"}]}