{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110120-133803-wings-al-pastor-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["chicken wings", "lime", "Wing Week", "wings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oven-Fried Chicken Wings Al Pastor", "link": "https://www.seriouseats.com/recipes/2011/01/wing-week-wings-al-pastor.html", "description": "Al pastor on its own is pretty awesome, but on chicken wings&mdash;now that's something special. Guajillo and chipotle chilies give the baked wings an earthy heat, while pineapple, cilantro, and lime add freshness to create a combination that's hard to beat. This also marks our first post of <strong>Wing Week!</strong> Every day this week we'll be sharing a different non-Buffalo wing recipe for your Super Bowl parties next week.", "totalTime": "6-18 hours", "recipeYield": "4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Lime"], "recipeIngredient": ["6 guajillo chilies", "1 small white onion, coarsely chopped", "3 1/2-inch thick pineapple rounds", "1/2 cup fresh orange juice", "1/4 cup distilled white vinegar", "3 garlic cloves, halved", "2 teaspoons coarse kosher salt", "1 teaspoon dried Mexican oregano", "1 teaspoon ground cumin", "1 large or 2 small chipotle chilies in adobo", "1 teaspoons adobo from canned chipotle chilies in adobo", "3 lbs chicken wings, cut into drumettes and flats ", "2 tablespoons chopped fresh cilantro", "1 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Place guajillo chilies on a baking sheet and heat in oven until puffed up and aromatic, about 3-5 minutes. Remove from the oven and allow to cool. Seed chilies, tear into pieces, and process in a spice grinder into a fine powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coarsely chop 2 pineapple rounds, discarding core; cover and chill remaining pineapple. Place chopped onion and chopped pineapple in the jar of a blender. Add orange juice, vinegar, chili powder, garlic, salt, oregano, cumin, chipotles, and adobo; puree marinade until smooth. Place chicken wings in large resealable plastic bag. Add marinade and seal bag, releasing excess air. Turn to coat. Chill at least 4 hours to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pre-heat oven to 425 degrees. Line rimmed baking sheet with aluminum foil and lay a wire rack inside. Arrange chicken wings on rack, leaving a little space between each wing. Place in the oven and cook until deeply browned, about 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely dice the remaining pineapple round. Move wings to a platter, sprinkle with pineapple, cilantro, and the juice of 1 lime. Serve immediately.</p>"}]}