{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110119-serious-sweets-lemon-glazed-cookies-primary.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["almonds", "Cookies", "lemon zest", "Serious Sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Glazed Lemon-Almond Cookies", "link": "https://www.seriouseats.com/recipes/2011/01/glazed-lemon-almond-cookies.html", "description": "...", "totalTime": "2 1/2 hours", "recipeYield": "Makes about 2 1/2 dozen cookies", "recipeCategory": ["Cookies", "Desserts", "Nuts"], "recipeIngredient": ["1 cup toasted slivered almonds", "3 tablespoons grated zest plus 3 tablespoons juice from 3 lemons", "1 cup (2 sticks) unsalted butter, softened", "1 1/2 cups confectioners' sugar", "2 teaspoons vanilla extract", "2 cups all-purpose flour", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse almonds and lemon zest in food processor until almonds are coarsely ground. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat butter on medium-high speed in large bowl until light and fluffy, about 1 minute. Stop the mixer and add 1/2 cup confectioners’ sugar. Beat on low speed until fully incorporated, about 30 seconds. Scrape the sides and bottom of bowl with a rubber spatula and add vanilla. Mix on medium-high speed until incorporated, about 10 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop mixer. Add flour, salt, and almond-lemon mixture and mix on medium-low speed until dough comes together, 60 to 90 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With rubber spatula, scrape down sides and bottom of bowl, patting dough down to unify it. Cover bowl with plastic wrap and refrigerate 30 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, arrange oven rack in middle position and preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a 1 tablespoon measure, scoop dough out and quickly roll between palms into a ball. Arrange balls on an ungreased baking sheet, spacing them 1/2 inch apart. Lightly press cookies down to 1/2 inch thickness. Bake cookies until golden brown on bottom and pale golden on top, 15 to 20 minutes. Transfer baking sheet to cooling rack and cool cookies on sheet for 5 minutes. Transfer cookies directly to cooling rack and cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the glaze, in a small bowl, whisk together remaining 1 cup confectioners’ sugar and lemon juice until smooth. Arrange the cooling rack in a rimmed baking sheet or set it over parchment or aluminum foil to catch any drips. Dip tops of cookies in glaze and transfer to prepared rack, glaze side up. Allow glaze to set, about 15 minutes, before serving.</p>\n\n<p>Cookies will keep in an airtight container for up to 1 week.</p>"}]}