{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110224-139005-date-nut-puff-pastry.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Middle Eastern", "keywords": ["dates", "desserts", "middle eastern", "nuts", "orange blossom water", "pistachios", "puff pastry", "Spice Hunting", "spices", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Date and Nut Puff Pastry Turnovers", "link": "https://www.seriouseats.com/recipes/2011/02/date-and-nut-puff-pastry-turnovers-recipe.html", "description": "Think of these little pastries as drier, neater versions of baklava that you can hold in your hands without the services of a wet-nap. And since they call for puff pastry instead of phyllo dough, they come together in a fraction of the time without all the hassle of painting melted butter on tissue-thin sheets of pastry.", "totalTime": "1 hour 15 minutes", "recipeYield": "45 turnovers", "recipeCategory": ["Middle Eastern", "Nuts", "Pastry"], "recipeIngredient": ["<strong>For the syrup</strong>", "1/2 cup sugar", "1/4 cup light honey", "1/4 cup water", "1 6-inch cinnamon stick (preferably \"true\" or \"Ceylon\" cinnamon)", "2 cloves", "1/4 teaspoon nutmeg, freshly ground", "1/4 teaspoon kosher salt", "1 1/2 teaspoon orange blossom water", "<strong>For the filling</strong>", "1 cup walnuts, toasted", "1 cup pistachio nuts, toasted", "1 cup (4 ounces) dates, pitted and roughly chopped", "<strong>For the pastry</strong>", "3 sheets puff pastry, thawed (or one sheet: see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the syrup:</strong> Combine all syrup ingredients except orange blossom water in a medium saucepan and bring to a simmer. Remove from heat, stir in orange blossom water, and set aside to cool for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the filling:</strong> Combine nuts in food processor and pulse 3 to 5 times, until just broken up. Add dates and pulse until date chunks are the size of marbles. Do not work into a paste. Pour 2 tablespoons of syrup into a small bowl, then mix syrup and filling together in a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Form the turnovers.</strong> Preheat oven to 400&deg;F, spacing three racks evenly. Lightly flour a work surface and roll puff pastry into roughly a 20\" by 12\" rectangle, trimming edges with a sharp knife. Use knife to create a 5 by 3 grid of 4-inch squares. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mentally divide squares into two triangles, and dock the center of one triangle several times with a fork. Place a heaping tablespoon of filling in the docked side of each square. Fold it over on the diagonal into a triangle and crimp edges by pressing the back of a fork's tines firmly against pastry. Poke top with tip of knife to create a small steam hole. Rub a thin coating of syrup on top of each square. Repeat with remaining sheets of puff pastry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake turnovers on parchment-lined sheet pans for 30 minutes, or until well-browned, very flaky, and dry and firm to the touch. Halfway through baking swap top and bottom pans to ensure even cooking and prevent burning. Cool on cooling racks and store in an airtight container. If stacking turnovers, it is best to separate with a sheet of wax or parchment paper.</p>"}]}