{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/08012011-163787-recipe-chocolate-almond-cake-500x375-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["almonds", "cakes", "chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Chocolate-Almond Upside-Down Cake", "link": "https://www.seriouseats.com/recipes/2011/08/chocolate-almond-upside-down-cake-recipe.html", "description": "That it's dense, moist, and satisfyingly chocolatey is reason enough to love this cake, but it's really the topping of toasted almond slivers, caramelized in butter, brown sugar, and honey, that seals the deal.", "totalTime": "3 hours", "recipeYield": "8", "recipeCategory": ["Cakes", "Chocolate", "Desserts", "Nuts"], "recipeIngredient": ["6 tablespoons unsalted butter, melted, plus more for pan", "3/4 cup packed light-brown sugar", "1/4 cup honey", "1 1/4 cups sliced or slivered almonds, lightly toasted", "1 1/4 cups cake flour (not self rising)", "1/2 cup cocoa powder, preferably Dutch-processed", "1 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup (1 stick) unsalted butter, softened", "1 1/2 cups sugar", "3 large eggs", "1 teaspoon pure vanilla extract", "1 cup buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the topping:</strong> Generously butter a 9-inch round nonstick cake pan. Pour 6 tablespoons melted butter into the cake pan and swirl to coat the bottom; sprinkle in brown sugar. Drizzle honey over sugar and sprinkle evenly with almonds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the cake:</strong> Sift flour, cocoa powder, baking soda, and salt together three times to make the cake extra light. Place butter in the bowl of an electric mixer fitted with the whisk attachment and beat until smooth and fluffy. Add sugar and continue mixing. Add eggs, one at a time, beating after each addition. Continue beating until light and fluffy, about 3 minutes. With the mixer running on low speed, add a third of the dry ingredients and mix to combine. Add half the buttermilk and continue mixing. Add another third of the dry ingredients, mix, and add remaining buttermilk and vanilla. Add remaining dry ingredients and mix until smooth. Pour the batter into the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until set in the center and springy, 45 to 55 minutes. Run a knife around the edge of the pan and immediately invert the pan onto a serving platter. Let it sit with the pan still on top for 5 minutes so the caramel can soak into the cake a bit, before removing the pan. If the topping is sticking to the pan, warm the pan surface over a low burner to loosen the caramel and then pour it over the cake. Let cool completely. Cut into wedges with a serrated knife.</p>"}]}