{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111213-183505-caramel-creme-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cookies", "holiday cookies", "sandwich cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Treats Truck's Caramel Crème Sandwich Cookies", "link": "https://www.seriouseats.com/recipes/2011/12/the-treats-trucks-caramel-creme-sandwich-cookies-brown-butter-cookies.html", "description": "These brown sugar sandwich cookies with browned butter filling are just bursting with incredible caramel flavors.", "totalTime": "1 hour 45 minutes", "recipeYield": "28 sandwich cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["<strong>For the cookies:</strong>", "1 ½ cups firmly packed brown sugar  ", "2 cups (4 sticks) butter ", "2 egg yolks ", "4 cups flour ", " &nbsp;", "<strong>For the frosting:</strong>", "½ cup (1 stick) butter ", "2 teaspoons vanilla extract ", "5 cups confectioners’ sugar ", "6 tablespoons milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cookies, in a large bowl, cream the butter and sugar. Add the egg yolks and flour and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the dough in plastic wrap and refrigerate at least 30 minutes, up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F. Grease a baking sheet or line it with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a rolling pin to roll the dough to ¼-inch thick. Cut out the cookies using a round cookie cutter. If the dough seems too soft, refrigerate the rolled out dough for a bit to firm it up before cutting the cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cookies 1 inch apart on the baking sheet and bake for 10 to 12 minutes, or until ever-so-slightly golden. Set aside on the baking sheet to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the frosting, in a medium pan over medium heat, brown the butter, stirring often until small brown flecks appear. Take off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the vanilla and confectioners’ sugar and whisk to combine. Whisk in the milk, 1 tablespoon at a time, until the mixture is creamy and smooth. If the frosting seems too thick, add a little more milk. (You can keep the frosting in a covered container in the fridge if you make it ahead of time or aren’t quite ready to use it. When you’re ready to fill the cookies, give the frosting time to soften a bit, or stick in the microwave for 10 seconds or a bit more.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an offset spatula or a butter knife, frost the underside of 1 cookie and top with a second cookie to make a sandwich. If you prefer, use a piping bag or a plastic storage bag with the tip cut off to place a dollop of frosting on the upturned cookie and then top with the second cookie. Repeat with the rest of the cookies. The cookies will keep in an airtight container for 3 to 5 days.</p>"}]}