{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20111211-127355-dinner-tonight-pork-chops-roasted-peppers-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "Ferran Adrià", "mains", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ferran Adrià's Pork Loin with Roasted Peppers and Parsley Oil", "link": "https://www.seriouseats.com/recipes/2011/12/ferran-adrias-pork-loin-with-roasted-peppers-recipe.html", "description": "This is the third recipe I've made from Ferran Adrià's <a href=\"http://www.amazon.com/Family-Meal-Cooking-Ferran-Adria/dp/0714862533\">The Family Meal</a>, and like the others, it seems almost purposely minimal. Not counting salt and pepper, there are really only five ingredients here. And yet, this still comes out as a full and flavorful meal.", "totalTime": "1 hour", "recipeYield": "serves 4 to 6", "recipeCategory": ["Dinner Tonight", "Mains", "Pork"], "recipeIngredient": ["2 large red bell peppers", "1/2 cup olive oil ", "3 garlic cloves, peeled", "3 sprigs fresh parsley, stems removed ", "10 thin-cut pork loin steaks", "salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. Rinse the bell peppers, and while still wet, place them on a roasting pan. Drizzle with a couple tablespoons of oil, and toss to coat. Set the roasting pan in the oven and cook, rotating the peppers every ten minutes or so, until the peppers are slightly blackened all sides. When done, use a pair of tongs to transfer the peppers to a large bowl, and allow them to cool for a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the garlic cloves in a small saucepan and cover with cold water. Bring to a boil over high heat, and then remove the garlic and toss in a bowl of ice water. When cool, remove the garlic cloves and repeat this process, making sure to start with cold water in the saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss blanched garlic cloves and the fresh parsley into a blender, and pour in about 1/4 cup of the olive oil. Process until everything is finely chopped. Season with a pinch of salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the bell peppers have cooled, remove the stems, seeds, and skins. Try to collect as much of the roasting juice in a bowl as possible. Thinly slice the peppers. Toss the pepper strips and roasting juices into a saucepan. Turn the heat to low and cook for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the pork loin steaks with salt and pepper on both sides. Pour a tablespoon of oil into a large cast-iron skillet set over high heat. Add as many of the pork loin steaks as will fit and cook until browned on each side, about two minutes. Repeat process until all have been cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the pork steaks with peppers on the side and garlic and a tablespoon of parsley oil on top. </p>"}]}