{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111012-mozza-cover.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["appetizers", "Nancy Silverton", "peppers", "recipe newsletter", "seafood", "The Mozza Cookbook", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Baby Peppers Stuffed with Tuna", "link": "https://www.seriouseats.com/recipes/2011/10/roasted-baby-peppers-stuffed-with-tuna-recipe.html", "description": "These <strong>Roasted Baby Peppers Stuffed with Tuna</strong> from <em><strong><a href=\"http://www.amazon.com/Mozza-Cookbook-Angeless-Favorite-Restaurant/dp/0307272842/?tag=serieats-20\">The Mozza Cookbook</a></strong></em> are <strong>Nancy Silverton</strong>'s ode to an antipasto made by <a href=\"http://www.lidiasitaly.com/\">Lidia Bastianich</a>, one of the forebears of traditional Italian cooking in America.", "totalTime": "1 hour", "recipeYield": "makes 48 pepppers", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish"], "recipeIngredient": ["<strong>For the peppers:</strong>", "48 baby peppers (preferably assorted colors), stems attached", "3 tablespoons extra-virgin olive oil ", "Kosher salt ", " ", "<strong>For the tuna stuffing:</strong>", "1 pound albacore tuna", "1/2 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "1 lemon, sliced into 1/4-inch rounds", "1 long sprig of rosemary, broken into a few pieces", "6 cups extra-virgin olive oil, or enough to cover the tuna", "3/4 cup Garlic Mayonnaise (recipe follows)", "2 heaping tablespoons finely chopped fresh Italian parsley leaves", "2 heaping tablespoons capers (preferably salt-packed), soaked for 15 minutes if salt-packed, rinsed, drained, and finely chopped", "1 1/2 tablespoons Dijon mustard", "3 anchovy fillets (preferably salt- packed), rinsed, backbones removed if saltpacked, and finely chopped", "2 1/2 teaspoons apple cider vinegar", "2 teaspoons fresh lemon juice", " ", "<strong>For assembling the peppers:</strong> ", "2 cups loosely packed arugula (preferably wild)", "Finishing-quality extra-virgin olive oil", "1 lemon, halved", "Maldon sea salt or another flaky sea salt, such as fleur de sel ", " ", "<strong>For the Garlic Mayonnaise:</strong>", "1 extra-large egg yolk", "2 teaspoons Champagne vinegar", "2 teaspoons fresh lemon juice", "1 large garlic clove, grated or minced", "1 teaspoon kosher salt, plus more if needed", "3/4 cup grapeseed oil or another neutral-flavored oil, such as canola oil", "1/4 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Garlic Mayonnaise:</strong> Combine the egg yolk, vinegar, lemon juice, garlic, and salt in a medium bowl and whisk to combine. To keep the bowl steady as you whisk, wet a kitchen towel, squeeze out the excess water, and roll it up on the diagonal. Lay the rolled towel in a ring on your work surface and set the bowl in the center of the ring. Combine the grapeseed oil and olive oil and add the oil a few drops at a time, whisking constantly to form an emulsion. When you've added about half of the oil begin to drizzle the oil in a slow steady stream, continuing to whisk constantly, until all of the oil has been added. Taste for seasoning and add more salt, if desired. The garlic mayonnaise can be made up to three days in advance; transfer it to an airtight container and refrigerate until you are ready to use it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the peppers, adjust the oven racks so one is in the middle position and preheat the oven to 350ºF. Place the peppers on a baking sheet, rub them all over with the olive oil, sprinkle with salt, and spread them out in a single layer. Roast the peppers for about 30 minutes, turning them occasionally, until their skins are wrinkled and slightly charred in places. Remove the peppers from the oven, leaving the oven on at the same temperature, and set aside to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the stuffing, cut the tuna into 1-inch thick slices, season with the salt and pepper, and place the slices in a small saucepan. Arrange the lemon slices and rosemary around the tuna and pour in enough olive oil to cover. Place the saucepan in the oven to cook the tuna for about 10 minutes, until medium-rare. (To test, split one of the slices with a fork to see the center.) Remove the tuna from the oven and let it cool to room temperature in the oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the Garlic Mayonnaise, parsley, capers, mustard, anchovies, vinegar, and lemon juice in a large bowl. Remove the tuna from the oil and break it into the bowl with the mixture. Use a wire whisk as you would a potato masher to break up any large chunks but you do want the tuna to have texture. Fold the tuna and other ingredients until they are thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, slice each pepper almost in half lengthwise, leaving them attached on one side. Carefully scrape out and discard the seeds, and spoon a scant tablespoon of stuffing into each pepper. Arrange the peppers on a platter. Scatter the arugula over them, drizzle with the finishing-quality olive oil, and the juice on the lemon, sprinkle with sea salt, and serve.</p>"}]}