{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110918preservedjamresaved.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Concord grapes", "grapes", "Jam", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Concord Grape Jam", "link": "https://www.seriouseats.com/recipes/2011/09/concord-grape-jam-recipe-grape-jelly.html", "description": "Homemade concord grape jam tastes nothing like sticky-sweet supermarket grape jelly. It has a deep, concentrated grape flavor, and is equally tart and sweet. A jar of this jam would make an excellent fall harvest-inspired gift. Try it sandwiched between peanut butter cookies or swirled into banana bread batter.", "totalTime": "About 2 hours", "recipeYield": "Makes 6 half-pint jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Grapes"], "recipeIngredient": ["8 cups Concord grapes", "6 cups granulated sugar", "Juice of half a lemon", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place six half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the grape skins from the pulp by squeezing the grapes between your fingers. Put the skins in the work bowl of a food processor and pulse until they are coarsely chopped. Transfer them to a large heavy-bottomed pot and add 1/4 cup of water. Bring to a simmer and cook until the skins have softened a bit, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the grape pulp in a medium saucepan and bring to a boil. Reduce the heat and simmer until the grapes loose their shape, about 10 minutes. Pour the grape pulp through a fine mesh sieve into a large bowl. Force out as much pulp as you can and discard the seeds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the grape pulp to the pot with the grape skins and stir to combine. Add the sugar, butter, and lemon juice and bring the mixture to a boil, stirring constantly. Reduce the heat and simmer, stirring frequently, until the jam has reduced and thickened and reached the gel stage, about 45 minutes. To test the jam, put a small plate in the freezer. When it is chilled, spoon a bit of jam onto the plate and return it to the freezer for one minute. Drag your fingertip through the jam and tilt the plate from side to side. If the jam stays put and doesn't run, it's set. If not, simmer the jam for a few minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}