{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110207-almondjoy-primary.jpg", "author": {"@type": "Person", "name": "Lee Zalben"}, "recipeCuisine": "", "keywords": ["candies", "chocolates", "coconut", "That's Nuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "5"}, "name": "Almond Joy Hearts", "link": "https://www.seriouseats.com/recipes/2011/02/homemade-almond-joys-chocolate-hearts-recipe.html", "description": "...", "totalTime": null, "recipeYield": "Makes about 24 chocolates", "recipeCategory": ["Chocolate", "Coconut", "Desserts"], "recipeIngredient": ["1 cup shredded coconut (I used Baker’s)", "1/2 cup sliced almonds (I used Diamond) ", "1/2 cup Cream of Coconut (I used Goya)", "18 ounces semisweet chocolate morsels (I used Ghiradelli 60% cacao)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F. Wash heart-shaped silicone mold with warm water. Place on a baking sheet and bake empty for 5 minutes to dry. Remove from oven and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl combine the coconut, almonds, and coconut cream. Mix well. Place 8 to 10 chocolate morsels in each of the heart shaped cavities on the silicone baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/2 teaspoonful of the coconut-almond mixture into center of each cavities, on top of chocolate morsels. Place additional 8 to 10 chocolate morsels on top of the coconut-almond mixture, arranging them so that the centers are mostly covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cookie sheet with mold to oven and bake for until chocolate starts to melt and is easy to spread, 10 to 12 minutes. Remove from oven. Use a teaspoon and with a darting motion run the tip of the spoon around the edges of each cavity to ensure that the melted chocolate completely coats the bottom of the cavity. Use the back of the teaspoon to smooth out the “bottoms” of the chocolates that are face up. Finally, gently shake the silicone mold up and down a little to force out any air bubbles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the silicone mat in the refrigerator for 1 hour to set. Remove from refrigerator and gently invert the cavities to release the chocolates. Use a butter knife to smooth out the flakes and make the bottoms of the chocolates as flat as possible.</p>"}]}