{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110501-breakfast-banh-mi-rimary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bánh mì", "daikon", "egg", "hangover helper", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Breakfast Banh Mi", "link": "https://www.seriouseats.com/recipes/2011/04/breakfast-banh-mi-recipe.html", "description": "Note: for best results, use a real banh mi bun from a Vietnamese bakery. If not available, a soft torpedo roll with a thin, crisp crust is ideal....", "totalTime": "at least 1 hour 20 minutes", "recipeYield": "Makes 1 sandwich", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Sandwiches"], "recipeIngredient": ["1 medium carrot, cut into fine matchsticks", "1 small daikon radish, cut into fine matchsticks", "1 tablesopon sugar", "2 teaspoons salt", "1/4 cup rice vinegar", "1/4 cup water", "3 strips bacon, cut in half crosswise", " 2 eggs", "1 banh mi bun (see note)", "2 tablespoons mayonnaise", "A few dashes Maggi seasoning", "1 long slice cucumber (cut lengthwise from entire length of cucumber)", "4 sprigs cilantro", "1 Thai bird chili, finely sliced", "Kosher salt and freshly ground black or white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Pickled Carrots and Daikon</strong>: combine carrots, daikon, salt, and sugar in a small bowl and toss to coat. Allow to rest 10 minutes until liquid has been drawn out of vegetables and salt and sugar are completely dissolved. Add vinegar and water and transfer to small, sealable container. Let sit at room temperature for 1 hour, or for best results, allow pickled to rest for at least 3 days in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven or toaster oven to 400°F. Cook bacon in a 10-inch nonstick skillet over medium-low heat until crisp and rendered, flipping once halfway through cooking, about 10 minutes total. Transfer to a paper towel-lined plate (leave bacon grease in skillet).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to medium high and heat until bacon fat starts lightly smoking. Add eggs, immediately reduce heat to medium, and cook, spooning hot bacon fat over egg tops as they cook until set to desired consistency (I like my yolks runny and white edges crisp). Transfer eggs to paper towel-lined plate with bacon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast bread in oven or toaster oven until hot and crisp, about 3 minutes. Split in half lengthwise, leaving a hinge. Spread both sides with mayonnaise and a few dashes of Maggi seasoning. Layer bacon strips along bottom and top with eggs. Top with pickled carrots and daikon, cucumber slice, cilantro sprigs, and chilis. Season with salt and pepper. Serve immediately.</p>"}]}