{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110322-dt-lemony-barley-risotto.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["barley", "beets", "Dinner Tonight", "risotto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Golden Beet Barley \"Risotto\" with Ricotta Salata", "link": "https://www.seriouseats.com/recipes/2011/03/dinner-tonight-golden-beet-barley-risotto-recipe.html", "description": "The similarity to risotto with this dish is mostly related to the cooking method&mdash;toasting the grains in fat, letting them absorb some wine, then adding stock little by little until the grains have become tender and released their starch into the pot to turn everything creamy.  It tastes nothing like a traditional risotto, but that doesn't mean this isn't a brilliant dish.", "totalTime": "50", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Mains", "Rice", "Vegetarian"], "recipeIngredient": ["2 medium golden beets, peeled and cut into chunks", "2 teaspoons lemon zest", " 2 tablespoons lemon juice", "6 tablespoons olive oil", "Salt and pepper to taste", "5 cups vegetable or chicken stock", "1 yellow onion, finely chopped", "1 cup pearled barley", "2 cloves garlic, minced", "1 cup white wine", "1 1/2 cups crumbled ricotta salata", "Cooked winter greens, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400 degrees Fahrenheit. In a small casserole dish that holds the beets snugly, combine beets with 3 tablespoons water.  Cover tightly and roast until beets are completely tender, 20-30 minutes.  Coarsely chop the beets, then mash in a bowl with lemon zest, juice, half the olive oil, and salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, pour stock into a medium saucepan and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy pot, such as a dutch oven, heat remaining olive oil over medium heat until shimmering.  Add onion and cook until translucent, about 5 minutes, then add garlic and barley to the pot.   Stir well to coat the grains in the oil, then add the wine and cook until evaporated, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladling stock into the pot little by little, allowing each batch to be absorbed before adding the next, cook the barley until tender, stirring often, 30-45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once barley is tender, stir in most of the beet mixture.  Turn off the heat and add 1 cup of the crumbled ricotta salata, then season to taste with salt and pepper.  If necessary, add water to the pot to create a loose, creamy texture. Serve risotto on plate with olive oil drizzled on top and remaining ricotta salata sprinkled over; serve with winter greens alongside.</p>"}]}