{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110523-152960-classic-creamed-spinach.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "creamed spinach", "Nigel Slater", "sides", "spinach", "Tender", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Classic Creamed Spinach", "link": "https://www.seriouseats.com/recipes/2011/05/classic-creamed-spinach-recipe.html", "description": "This recipe for <strong>Classic Creamed Spinach</strong> from <a href=\"http://www.nigelslater.com/\">Nigel Slater</a>'s <em><strong><a href=\"http://www.amazon.com/Tender-Cook-His-Vegetable-Patch/dp/1607740370/serieats-20\">Tender: A Cook and His Vegetable Patch</a></strong></em> showed me exactly what my spinach was missing: a roux. Slater begins his creamed spinach by infusing milk with black peppercorns, bay leaf, and an onion. The milk is simmered and added to a mix of butter and flour, then whisked into a very thick, creamy roux. Spinach, cream, and nutmeg are incorporated at the very last minute, resulting in the kind of creamed spinach that you'd order at a steakhouse that's been around for longer than you have.", "totalTime": "20 minutes", "recipeYield": "makes 4 servings", "recipeCategory": ["Cook the Book", "Sides", "Spinach", "Vegetarian"], "recipeIngredient": ["1 1/4 cups (300ml) milk ", "A small onion, peeled", "A bay leaf", "6 black peppercorns", "2 pounds (1kg) spinach  ", "4 tablespoons (50g) butter ", "6 tablespoons (50g) all-purpose flour ", "4 tablespoons heavy cream ", "Nutmeg "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the milk in a saucepan with the onion, bay leaf, and black peppercorns. Bring to a boil, then decrease the heat to low and cook for ten minutes for the aromatics to do their stuff. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard the very toughest spinach stalks, then cook the leaves in a lidded pan with a film of water in the bottom. They should be tender in just a minute or two, maybe less. Drain and cool under cold running water, squeeze thoroughly but gently to remove most of the water, then chop finely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a heavy-bottomed nonstick saucepan, stir in the flour, and cook for a couple of minutes, stirring so that it doesn’t burn. Whisk in the warm milk; you don’t need the aromatics, they have done their work. When the sauce starts to thicken, decrease the heat to a low simmer and let it bubble gently for a good fifteen minutes. An occasional stir, taking care to get right in the corners, will prevent it burning. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the cream and chopped spinach, then finish with salt, pepper, and a fine grating of nutmeg.</p>"}]}