{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110828-127355-dinner-tonight-salmon-thai-salad.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Thai", "keywords": ["Dinner Tonight", "fish", "salad", "salmon", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Seared Salmon Salad with Roasted Shallot and Chile Dressing", "link": "https://www.seriouseats.com/recipes/2011/09/seared-salmon-salad-with-roast-shallot-chile-dressing.html", "description": "It's no secret that I'm kind of a sucker for a good Thai salad. But what about this one from Martin Boetz's <em><a href=\"http://www.amazon.com/dp/0804842299/?tag=serieats-20\">Modern Thai Food</a></em>, which, as the book's title suggests, attempts to create a more contemporary version of the already perfect dish? That certainly explains why the nice salmon fillet is here and also why the fish sauce is not.", "totalTime": "45 minutes", "recipeYield": "2 people", "recipeCategory": ["Dinner Tonight", "Salads", "Salmon", "Thai"], "recipeIngredient": ["4 small shallots, skins removed ", "5 tablespoons canola oil, divided ", "2 garlic cloves, thinly sliced", "3 dried red chiles, stems and seeds removed ", "One 7-ounce salmon fillet, any bones removed ", "1/2 teaspoon salt", "1/3 cup superfine sugar (caster sugar)", "1/3 cup freshly squeezed lime juice ", "1 scallion, end removed, thinly sliced lengthwise ", "1/2 medium cucumber, cut lengthwise into long strips ", "1 fresh red chile, end trimmed, thinly sliced into rounds", "1/2 bunch cilantro leaves", "1/2 bunch mint leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 500&deg;F. Toss the shallots with one tablespoon of oil, and place in a very small baking dish. Transfer dish to the oven, and cook until shallots are very soft, about 20 minutes. Turn the shallots every five minutes or so with a pair of tongs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the shallots are roasting, pour two tablespoons of the oil into a small saucepan, and turn heat to medium-high. When oil is hot, add the garlic. Cook, stirring often, until garlic turns golden. Remove with a slotted spoon and drain on some paper towels. Add the chiles to the oil, and cook until they firm up, just a few seconds. Drain them on paper towels, too. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cool, pound the chiles to a powder in a mortar and pestle. Add the salt and sugar, and continue pounding until it is a fine powder. Transfer mixture to a bowl and mix in the lime juice. Stir well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roughly chop two of the roasted shallots. Add them to the mortar and pound until they are a paste. Mix them in with the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the remaining two tablespoons of oil into a large skillet and turn the heat to medium-high. When oil is shimmering, add the salmon fillet and cook until medium-rare, about 1 1/2 minutes each side. Set salmon aside on a cutting board. Remove the skin. If you want to crisp up the skin for a garnish, just add the skin back to the pan over medium-high heat, and cook until crisp, 30 seconds to a minute on each side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the salmon into 6 pieces. Quarter the two remaining roasted shallots. Add both to a large bowl along with the scallion, cucumber, fresh red chili, cucumber, cilantro, and mint. Spoon over a little less than half of the dressing. Toss well. Taste, and add more dressing if needed. Divide the salad between two plates, and sprinkle each with the fried garlic. Drizzle with more dressing if desired. </p>"}]}