{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/MacaroonsSE.jpg", "author": {"@type": "Person", "name": "Olga Massov"}, "recipeCuisine": "", "keywords": ["coconut", "Cookies", "Jewish holidays", "macaroons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coconut Macaroons", "link": "https://www.seriouseats.com/recipes/2011/04/coconut-macaroons-passover-recipe.html", "description": "<strong>Coconut is kosher for Passover,</strong> and coconut macaroons are a cinch to make in the kitchen, so much so that you will never touch those stale Manishewitz things again. <strong>The trick:</strong> Mix shredded coconut with coconut flakes to get just the right texture.", "totalTime": "1 hour", "recipeYield": "Makes about 22 cookies", "recipeCategory": ["Coconut", "Desserts", "Passover"], "recipeIngredient": ["4 large egg whites, at room temperature", "3 cups unsweetened dried coconut flakes ", "1/2 cup unsweetened shredded coconut", "1/2 cup granulated sugar", "1/4 cup demerara sugar", "1 teaspoon vanilla extract", "1 teaspoon almond extract", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all the ingredients in a large heatproof mixing bowl (stainless steel is best) and set the bowl in a skillet with barely simmering water and stir the mixture with a wooden spoon, scraping the bottom to prevent burning. Stir for 5 to 7 minutes until the mixture is very hot to the touch and the egg whites have thickened a bit. They will turn from translucent to opaque. Set the egg white mixture aside for 30 minutes to thicken up more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350oF and place the racks in the upper and lower thirds in the oven. Line 2 cookie sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With two tablespoons, place the coconut mixture in neat heaps on the lined cookie sheets 2 inches apart from one another. Bake for 3 minutes and rotate the sheets from front to back. Bake another 2 minutes, and switch the baking sheets from top to bottom and vice versa. Lower the temperature to 325oF and bake for another 10 to 15 minutes, until the macaroons are a mix of cream and gold colors and the edges get slightly brown.  Cool baking sheets on cooling racks and let cool completely before peeling away from the parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve, preferably, on the day the macaroons are baked – they’re best day one. However, they’re still delicious for a few more days, though it’s doubtful they will last that long in any household that loves a macaroon.</p>"}]}