{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110406-chinese-appetizers-egg-roll-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["Chinese Appetizer Recipe Week", "egg rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispy Pork and Cabbage Egg Rolls", "link": "https://www.seriouseats.com/recipes/2011/04/crispy-pork-and-cabbage-egg-rolls.html", "description": "Note: Char siu can be found at Chinese barbecues. If it's unavailable, regular ham, or ground pork cooked with 1 tablespoons of hoisin sauce, can be used to replace....", "totalTime": "1 hour", "recipeYield": "Makes about a dozen egg rolls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Sides"], "recipeIngredient": ["1 tablespoon vegetable oil", "1 medium carrot, julienned or grated on the large holes of a box grater", "1/2 pound napa cabbage (about 1/2 small head), finely shredded", "1/4 pound shiitake mushroom caps, julienned", "1 tablespoon Shaoxing wine", "2 teaspoons soy sauce", "1 teaspoon sugar", "Kosher salt", "1/4 pound char-siu pork, finely julienned (see note)", "12 to 15 egg roll or spring roll wrappers", "1 1/2 quarts peanut, canola, or vegetable oil", "<a href=\"http://www.seriouseats.com/recipes/2010/07/chinese-plum-sauce-recipe.html\">plum sauce</a> or duck sauce for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a wok or large skillet over high heat until smoking. Add carrot, cabbage, and mushrooms and cook, tossing and stirring frequently, until vegetables are softened but not browned, about 3 minutes. Add Shaoxing wine, soy sauce, and sugar, and toss to coat. Continue cooking until most of the liquid has evaporated and the vegetables begin to sizzle, about 2 minutes longer. Season to taste, then transfer to paper towel-lined rimmed baking sheet to cool. Once cool, transfer to large bowl and toss with pork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay one wrapper down with a corner pointed towards you. Add about 3 tablespoons of filling to the lower third of the wrapper, keeping it in a nice, tight row. Roll from the bottom corner towards the top, keeping everything nice and tight. Roll until nearly half way up, then stop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next step is to fold the left and right corners towards the center. Start by first pressing in on the edges of the filling with your fingertips to make sure it's packed nice and tight. Fold the corners towards the center, again keeping everything tight. Moistening the edges of the wrapper with a bit of water will help it stick to itself and keep its shape.You want the bottom edge to form a 90° angle with the new edge you've just created by folding over the corner.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After both corners have been folded in, continue rolling towards the top of the paper. Moisten the top corner of the wrapper with a bit of water and continue rolling until the entire package is sealed. Repeat with remaining rolls until all the filling is used up. Finished rolls can be frozen for up to 3 months in a sealed container. If freezing, fry directly from the freezer, adding 1 minute to cook time.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large wok or Dutch oven to 350°F as registered on an instant read thermometer. Add 4 to 6 rolls and cook, agitating occasionally with a wire mesh spider, until golden brown and crisp, about 5 minutes. Drain on paper towels and serve immediately with plum sauce or duck sauce. Repeat with remaining egg rolls.</p>"}]}