{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110728-127355-dinner-tonight-clams-sausage-watercress.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["clam", "clams", "Dinner Tonight", "sausage", "shellfish", "sweet potatoes", "The Lee Brothers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Clams with Sweet Potato Smoked Sausage and Watercress", "link": "https://www.seriouseats.com/recipes/2011/08/clams-with-sweet-potato-smoked-sausage-recipe.html", "description": "Fresh Southern</a></em> cookbook the Lee brothers explain that this is one of those recipes that's \"just <em>way</em> too easy to be this satisfying.\" They are completely right. There are really <strong>only six ingredients</strong> here (seven if you count water) but the dish feels miraculously complete.", "totalTime": "20 minutes", "recipeYield": "2 people", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner Tonight", "Sweet Potatoes and Yams"], "recipeIngredient": ["3 ounces smoked sausage, such as andouille, kielbasa, or Spanish chorizo", "2 cups dry white wine", "½ teaspoon kosher salt", "¾ pound sweet potatoes, peeled, cut into ½-inch pieces (about 3 cups)", "24 clams, or 16 clams if they are bigger ", "1 bunch watercress, most of the stems removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sausage to a 3-quart Dutch oven set over medium-high heat. Cook, stirring often, until the pieces are lightly browned and have rendered some of their fat, about five minutes. Use a slotted spoon to remove half of the sausage, and then transfer it to a couple paper towels to drain. Leave the rest in the Dutch oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two cups of water and the wine into the dutch oven. Add the salt, cover, and bring to a boil. Add the sweet potatoes. When the liquid comes back to a boil, cook for three minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump in the clams, stir well, and then again cover the Dutch oven. Cook, stirring every other minute, until all the clams have opened, six to eight minutes. Discard any clams that have not opened. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the watercress between four large bowls. Then add one-quarter of the clams, sausage, and sweet potatoes to each. Pour in enough broth into each bowl to just barely cover everything. Garnish with the reserved sausage. Season to taste with salt.  </p>"}]}