{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/buns%20(2).JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "butter", "rolls", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Bread Baking: Fast Buttery Buns", "link": "https://www.seriouseats.com/recipes/2011/09/bread-baking-fast-buttery-buns-recipe.html", "description": "Bread snob that I am, there are times when all I need is something simple. Something that can be made quickly. But even when I'm in a hurry, I'd prefer that the resulting bread isn't completely bland. Sometimes that means I'm a little more generous with flavor enhancers. Like butter! Just a little extra. Y'all.", "totalTime": "1 hour 55 minutes", "recipeYield": "Makes 12 buns", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons instant yeast", "1 tablespoon cane sugar", "2 1/2 cups (11 1/4 ounces) bread flour (divided)", "1 teaspoon salt", "4 tablespoons unsalted butter, cut into pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the water, yeast, sugar, and 2 cups of the bread flour into the bowl of your stand mixer. Stir to combine. I will be loose and gooey. Put the remaining flour on top. Add the salt. Cover with plastic wrap (yes, you're just leaving that flour on top for now) and set aside for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap and knead the dough with the stand mixer fitted with the dough hook until the dough is smooth, shiny, and elastic. It will be a soft dough. Add the butter and continue kneading until the butter is completely incorporated. Remove the bowl from the stand mixer, cover with plastic wrap, and set aside for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and preheat your oven to 350 degrees. Line a baking sheet with parchment paper. Turn out the dough and knead briefly. It should be soft and feel bouncy. Divide the dough into 12 pieces and shape into balls. Place the balls on the prepared baking sheet.<br />\r\nNote: if you want sandwich/burger buns instead of round rolls, flatten the balls to about 1/2 high. I made 6 of the flatter buns and 6 round buns. Cover the buns with plastic wrap and set aside until doubled in size, about 30 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap and bake at 350 degrees until nicely browned, about 25 minutes. Remove the buns from the baking sheet and let cool on a rack.</p>"}]}