{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/ima/20110520-seriously-asian-1.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "dumpling", "rice", "Seriously Asian", "sesame seed"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Glutinous Rice Balls (Tang Yuan)", "link": "https://www.seriouseats.com/recipes/2011/05/glutinous-rice-balls-tang-yuan.html", "description": "A popular snack all over China, glutinous rice balls (tang yuan) are filled with red bean, sesame, peanut, and other sweet fillings that ooze out from mochi-like dumpling skins. The dumpling skins owe their pleasantly gummy texture to glutinous rice...", "totalTime": "45 minutes", "recipeYield": "Makes about 30 rice balls", "recipeCategory": ["Chinese", "Rice"], "recipeIngredient": ["<strong>For the filling:</strong> ", "2 tablespoons roasted and ground sesame seeds, peanuts, almonds, or cashews", "2 tablespoons sugar", "2 tablespoons lard or coconut oil", "<strong>For the dumpling skin: </strong>", "1 1/2 cups glutinous rice flour", "2 tablespoons regular rice flour or tapioca starch", "1 cup tepid water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling: Grind the seeds or nuts in a mortar and pestle to a fine but not powdery consistency.  In a small saucepan, melt the lard.  In a small bowl, mix the lard with the sugar and ground nuts.  Chill the mixture in the refrigerator or freezer for a few minutes before use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the skins: Mix the two flours together and add the water to make a soft but non-sticky dough. Divide the dough in half.  Working on a surface dusted with rice flour, roll each half into a cylinder about 1 1/2 inches thick and cut the dough into segments about 1 inch wide.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dumplings: Take one piece of dough and make an indent with your thumb to flatten it. Place the stuffing into the indent and draw the sides of the dough up to enclose it.  Roll it gently between your palms to make a smooth ball.  Lay the dumplings on a tray dusted with rice flour until you are ready to cook them. They can also be refrigerated or frozen. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the dumplings: Fill a large pot with water and bring to a boil.  Add the dumplings and gently stir to prevent sticking at the bottom of the pot.  Simmer for 15 minutes, taking care not to let the water boil vigorously or else the dumpling skins will tear.  The dumplings are done when the skins are almost translucent.  Ladle the dumplings into soup bowls along with the cooking water.  </p>"}]}