{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002charmsbowl610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "candy", "cereal", "cereal marshmallows", "gluten free", "marshmallows", "sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispy Cereal Marshmallows", "link": "https://www.seriouseats.com/recipes/2011/10/bravetart-crispy-cereal-marshmallows-homemade-lucky-charms-recipe.html", "description": "The secret to crispy marshmallows is <a href=\"http://bravetart.com/recipes/CornSyrupGF\">homemade corn syrup</a>, a less stable version of what you buy at the store. Sounds like a bad thing, but it's not. You see, it's that very instability we need. During the candy making process, this syrup begins to crystallize due to its instability. This starts a chain reaction that ultimately results in \"defective,\" crunchy marshmallows. Terrible for s'mores and Rice Krispie treats, but a thing of beauty for cereal.", "totalTime": "48-72 hours", "recipeYield": "several hundred tiny marshmallows", "recipeCategory": ["Breakfast Sweets", "Desserts", "Gluten-Free"], "recipeIngredient": ["3/4 ounce gelatin ", "12 ounces cold water", "1 ounce rolled or steel cut oats (omit for gluten free)", "1 Tahitian vanilla bean, split and scraped, seeds reserved ", "6 ounces <a href=\"http://bravetart.com/recipes/CornSyrupGF\">homemade corn simple syrup</a>, (see recipe below) preferably made a day or two in advance  ", "15 ounces sugar", "1/4 teaspoon salt", "2 teaspoons vanilla extract", "1/8 teaspoon orange flower water", "1/16 teaspoon almond extract (about 2 drops)", "optional: food coloring ", "&nbsp;", "<strong>For the Corn Simple Syrup</strong>", "14 ounces corn cobs (from about 4 ears), sliced into 1-inch thick rounds", "42 ounces water, preferably filtered", "1 vanilla bean, split and scraped", "36 ounces sugar", "2 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the marshmallow base:</strong> Have one lightly greased cookie sheet standing at the ready. Add 4 ounces water to bottom of bowl of stand mixer and sprinkle with gelatin. Set aside. In a medium pot, combine the remaining water, vanilla bean pod and oats. Bring to a simmer over medium heat, then turn heat to medium low and simmer gently for about ten minutes. Shut off the heat. Set a fine meshed sieve over a small bowl and carefully drain the oatmeal from the water. Press the oatmeal with a rubber spatula to release as much oat-water as possible; you should have about 8 ounces. If you do not, add enough fresh water to equal eight ounces. Discard the solids (or enjoy for breakfast?) and return the vanilla oat-water to the pot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reserved vanilla bean seeds, corn syrup (see recipe below), sugar and salt to oat water. Set over medium heat and stir gently until the sugar dissolves and the mixture starts to simmer. Keep cooking, undisturbed, until the mixture reaches 240&deg;F on a candy thermometer. You may notice the mixture beginning to crystallize a little around the edges, but that is a good thing. When the mixture reaches 240&deg;, shut off the heat and let it stand until it cools to 210&deg;. Transfer to bowl with gelatin (mixture may crystallize). Fit the bowl with the whisk attachment and whip on medium-high speed until the mixture has nearly doubled in volume and cooled. While mixing, add vanilla extract, orange flower water, and almond extract. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once mixture has doubled and cooled, shut off the mixer. If you're just making white marshmallows, use a lightly greased rubber spatula to  transfer the mixture to the cookie sheet, spreading it out to about 1/4\" thickness. Alternatively, if you'd like to make different color marshmallows, divide the mixture into as many bowls as you'd like colors. Add a few drops of food coloring to each and stir with a spatula until the color has incorporated. Spread each portion across a separate patch of the cookie sheet. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the tray of marshmallows in a dry, well ventilated location where you feel safe leaving them, uncovered, for twenty four hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the marshmallows have dried for 24 hours, peel the big sheet of marshmallows up from the cookie sheet. You will notice the bottom of the marshmallow sheet is slightly damp, while the top is crusty. Transfer to a cutting board, placing it crusty side down, and use a tiny cookie cutter to stamp the marshmallows into shapes, or use a knife to cut them into tiny squares or diamonds. Transfer the marshmallow cut outs to a parchment lined cookie sheet, damp side up. Allow them to dry for another 24 hours, or until they have become crunchy. The exact length of time it takes depends on kitchen humidity. Store the marshmallows in an airtight container, at room temperature for up to 2 weeks. Alternately, freeze or refrigerate indefinitely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Corn Simple Syrup</strong>: In a medium pot, combine the sliced corn cobs and water. Bring the water to a boil, then reduce heat to medium and simmer gently until the water has reduced by half; about thirty minutes. Use a pair of tongs to fish out the corn cob pieces; discard. Add the vanilla bean and seed scrapings, sugar, and salt. Stir constantly until the sugar dissolves. Simmer for twenty minutes, or until the mixture has taken on a thick, syrupy consistency. Cool. Store indefinitely in the fridge along with the vanilla bean.</p>"}]}