{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110921-171745-buckeye-pie.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "buckeyes", "chocolate", "graham crackers", "peanut butter", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Buckeye Pie", "link": "https://www.seriouseats.com/recipes/2011/09/buckeye-pie-chocolate-peanut-butter-pie-recipe.html", "description": "A pie that would look like a buckeye, be made of the same ingredients as a buckeye and have actual homemade buckeyes on top. Crazy? Maybe. But mostly <em>crazy good.</em>", "totalTime": "3 hours", "recipeYield": "10", "recipeCategory": ["Chocolate", "Nuts"], "recipeIngredient": ["<strong>For the Graham Cracker Crust</strong>", "2 cups chocolate graham cracker crumbs", "8 tablespoons (1 stick) unsalted butter, melted", " ", "<b>For the Buckeyes</b>", "2 ounces Neufchâtel (or light cream cheese)", "1 1/2 cups creamy peanut butter", "1 cup graham cracker crumbs", "2 cups confectioners’ sugar", "10 tablespoons unsalted butter, melted and cooled", "1 teaspoon vanilla", "12 ounces dark chocolate (I used 72%), coarsely chopped", " ", "<strong>For the Peanut Butter Pie Filling</strong>", "6 ounces of Neufchâtel (or light cream cheese)", "1/4 cup creamy peanut butter", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. In a 9 inch glass pie dish combine chocolate graham cracker crumbs and melted butter until crumbs are thoroughly moistened. Press crumbs into bottom and sides of dish. Bake for about ten minutes until crust is firm. Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric stand mixer add Neufchâtel (or cream cheese) and peanut butter, mix until well combined. Add graham cracker crumbs, confectioners sugar, melted butter, and vanilla then mix until thoroughly combined. In a medium bowl, set aside two cups worth of peanut butter mixture for the buckeyes and reserve the rest for the pie filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To shape the buckeyes, scoop slightly less than a tablespoon of peanut butter mixture and roll into a ball. Place balls on parchment lined baking sheet pricking each with a toothpick. Place peanut butter balls in the freeze for approximately 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While peanut butter balls are in the freezer, mix together the reserved peanut butter filling with Neufchâtel (or cream cheese) and peanut butter in the bowl of a stand mixer until well combined. Slowly add in heavy cream and mix on medium high until well combined. Mixture will be lighter and fluffier. Scoop mixture into cooled chocolate graham cracker crust and refrigerate until set, 2 to 3 hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a double boiler, or microwave safe glass bowl, melt chocolate until smooth. If using the microwave, heat on high for 30 seconds then stir, then repeat in 10 second increments until smooth. Let chocolate cool slightly. Remove chilled peanut butter balls from freezer and dip and swirl in chocolate using the toothpicks being careful to leave a circle of exposed peanut butter on top. Return buckeyes to parchment lined baking sheet to set. When you've finished dipping the buckeyes, remove the toothpicks and use them to smooth over the hole. Refrigerate for 30 minutes or until completely set. Once buckeyes are set, place 10 evenly spaced buckeyes on top of the chilled pie. Cover and refrigerate any leftovers.</p>"}]}