{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111030-176846-preserved-cranberry-port-jam-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cranberries", "Jam", "port", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Port Jam", "link": "https://www.seriouseats.com/recipes/2011/10/cranberry-port-jam-recipe.html", "description": "Cranberries in all forms, with their zingy sweet flavor and crimson hue, are a delicious symbol of the holiday season. This luscious jam combines fresh and dried cranberries with a generous amount of ruby port. It would be perfect spread on cornbread, pumpkin bread, or anything slathered with cream cheese.", "totalTime": "1 hour", "recipeYield": "Makes 6 half-pint jars", "recipeCategory": ["Breakfast Sweets", "Cranberry", "Fruit Desserts"], "recipeIngredient": ["One (12-ounce) bag fresh cranberries", "1 1/2 cups ruby port", "One (1.75-ounce) package regular powdered fruit pectin", "1/2 teaspoon butter", "1/2 cup dried cranberries, chopped", "4 1/2 cups granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse the cranberries in a food processor until they are coarsely chopped. Transfer them to a large, heavy-bottomed pot and add the port and 1/2 cup of water. Bring to a boil, then lower the heat and simmer until the cranberries have softened, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the pectin over the cranberry mixture and stir to combine. Stir in the butter. Return the mixture to a boil. Add the dried cranberries and then the sugar all at once. Return the mixture to a boil and boil hard for one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into the hot sterilized jars, leaving 1/4-inch headspace. Wipe the rims of the jars, cover with the lids, and screw the bands on until just barely tight. Place the jars on the rack in the pot and cover completely with water. Cover the pot and bring to a boil over high heat. Boil for 10 minutes. Turn off the heat, uncover the pot, and allow the jars to rest in water for five minutes. Remove the jars from the pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}