{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/bread-baking-light-rye-buns.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "buns", "greek yogurt", "rye", "rye flour"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Light Rye Burger Buns", "link": "https://www.seriouseats.com/recipes/2011/08/bread-baking-light-rye-burger-buns-recipe.html", "description": "Years ago, we used to go to a restaurant that was famous for its burgers. The buns had just a touch of rye in them. Not a lot&mdash;most people couldn't even figure out what was different about them. Just that they were different. But of course, bread geek that I was, I knew the secret.", "totalTime": "3 hours", "recipeYield": "Makes 15 buns", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup water", "1/2 cup Greek-style yogurt", "2 teaspoons active dry yeast", "3 5/8 ounces (1 cup) white rye flour", "11 1/4 ounces (about 2 cups) bread flour", "1 1/2 teaspoons salt", "2 tablespoons olive oil (plus more for drizzling)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yogurt, rye flour, and yeast in the bowl of your stand mixer. Stir to combine (it's fine if it's not smooth) and set aside for 10 minutes, until it's bubbly.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bread flour and salt, and knead with the dough hook until the dough is smooth and very elastic. It will be sticky. Add the oil and continue kneading until all the oil is incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn out the dough. Knead the dough briefly, then form it into a ball. Drizzle with olive oil to coat, and but it back in the bowl. Cover the bowl with plastic wrap and set aside until it has doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 350 degrees and sprinkle cornmeal on a baking sheet (or line it with parchment, if you prefer). Flour your work surface and knead the dough briefly to knock the air out. Divide it into 15 pieces. Form each piece into a ball, then flatten the balls into disks, making sure they're thinner at the center than at the edges. Place the disks on the baking sheet, cover with plastic wrap, and set aside until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, remove the plastic wrap and bake at 350 degrees until nicely browned, about 25 minutes. Remove the buns from the pan and  let them cool completely on a rack.</p>"}]}