{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110429-bar-pie-pizza-lab-primary.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bar pie", "bar-style pizza", "pizza", "pizza crust", "Pizza Lab", "Star Tavern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Crispy Bar-Style Pizza", "link": "https://www.seriouseats.com/recipes/2011/04/crispy-bar-style-pizza-star-tavern-recipe.html", "description": "The uniquely crisp, crunchy, slightly chewy underbelly of bar-style pizza comes from a two-stage cooking process. The dough is first rolled and stretched onto an oiled pie plate from which all but the back lip has been cut off. During this stage, the bottom of the pizza begins to fry a bit, the oil working itself up into the crumb.", "totalTime": "3 days", "recipeYield": "Makes four 12-inch pies", "recipeCategory": ["Pizza", "The Pizza Lab"], "recipeIngredient": ["18 ounces (about 3 3/4 cups) all-purpose flour", ".25 ounces (about 2 teaspoons) salt", "1 tablespoon sugar", "1 1/2 teaspoons instant yeast", "2 tablespoons olive oil", "12 ounces lukewarm water", "1 tablespoon canola, grapeseed, or vegetable oil", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2010/10/new-york-style-pizza-sauce.html\">New York Style Pizza Sauce</a>, pureed with a hand blender or standing blender until smooth", "2 ounces finely grated parmesan", "1 to 1 1/2-pounds grated low-moisture mozarella cheese", "Toppings as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, sugar, salt, and yeast in bowl of food processor. Pulse 3 to 4 times until incorporated. Add olive oil and water. Run food processor until mixture forms ball that rides around the bowl above the blade, about 15 seconds. Continue processing 15 seconds longer. Alternatively, combine ingredients in a stand mixer and mix on low speed for ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough ball to lightly floured surface and knead once or twice by hand until smooth ball is formed. Transfer to a gallon-sized zipper lock bag, seal, and place in the refrigerator. Allow to ferment for at least one, and up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least two hours before baking, remove dough from refrigerator and divide into four even balls. Shape into balls by gathering dough towards bottom and pinching shut. Flour well and place each one in a separate bowl (cereal bowls or small mixing bowls work well). Cover tightly with plastic wrap and allow to rise at warm room temperature until roughly doubled in volume.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust oven rack with pizza stone to top position and place a second rack one position below it. Preheat oven to 550°F for at least one hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn single dough ball out onto floured surface. Use a rolling pin to roll it out into a 12-inch circle, lifting and stretching by hand if necessary. Grease an aluminum baking sheet with 1 tablespoon canola oil. Transfer dough to baking sheet. Spread about 1/2 cup of sauce evenly over entire surface of pie. Sprinkle with 1/4 of parmesan. Spread 1/4 of cheese in even layer over surface. Top with additional toppings as desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven on rack immediately under the baking stone. Bake until edges are just beginning to brown, about 5 minutes. Remove from oven (close oven). Using a thin flexible metal spatula, careful separate the pizza's edges from the pan (the pizza should slide around freely). Carefully slide pizza off of pan and onto baking stone. Continue baking until bottom is deep golden brown and cheese is melted and bubbly. Transfer pizza to a cutting board with a pizza peel. Cut into 8 slices, and serve. Repeat steps 5 and 6 with remaining pizzas.</p>"}]}