{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110725karendemascocakewhole.jpg", "author": {"@type": "Person", "name": "Karen DeMasco"}, "recipeCuisine": "", "keywords": ["cake", "coconut", "Karen DeMasco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Karen DeMasco's Black and White Cakes", "link": "https://www.seriouseats.com/recipes/2011/07/karen-demascos-black-and-white-cakes-lamington-coconut-cake-recipe.html", "description": "I first discovered this Australian treat, classically called a Lamington, when I was in Japan. It was a snack left for me in my hotel room, and I was blown away. Cubes of super moist white cake are glazed in chocolate. Once the glaze is set, it helps hold the fragile cake together, and the whole thing just melts in your mouth.", "totalTime": "", "recipeYield": "16", "recipeCategory": ["Cakes", "Coconut"], "recipeIngredient": ["2 cups unsweetened shredded coconut", " ", "<strong>For the cake:</strong>", "1/2 cup all-purpose flour", "1/2 cup cake flour", "1 teaspoon baking powder", "1/2 teaspoon kosher salt", "1/2 cup plus 1 1/2 tablespoons granulated sugar", "5 1/2 tablespoons (2 1/4 ounces) unsalted butter, soft", "1 egg", "1/4 cup plus 3 tablespoons whole milk", " ", "<strong>For the Glaze:</strong>", "1/4 cup plus 3 tablespoons cocoa powder", "2 cups powdered sugar", "1/4 teaspoon kosher salt", "1/2 teaspoon vanilla extract", "1/4 cup plus 2 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Grease and 8x8 inch square baking pan with nonstick spray or soft butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the coconut on a baking sheet and toast it until a light golden brown, about five minutes. Keep it on the baking sheet and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine flours, baking powder, and salt. Whisk them together to remove any lumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a tabletop mixer, combine sugar and butter. Whip this mixture on medium high speed with the paddle attachment, scraping down the sides of the bowl, until it is light and fluffy. Add egg and yolk, one at a time, mixing to thoroughly combine after each addition. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternate adding the dry ingredients and milk in 3 additions, letting the batter whip after each addition. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the batter into the prepared pan, spread the batter evenly from edge to edge, and bake for about 40-50 minutes, rotating the pan after 30 minutes, until the cake springs back to the touch, and a cake tester comes out with a moist crumb. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the pan on a cooling rack. Flip cooled cake onto a cutting board or the back of a baking sheet, and cut it into 16 2-inch squares. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the glaze, whisk together the cocoa, powdered sugar, salt, vanilla, and water in a medium sized metal mixing bowl. Place the mixing bowl over a pot of simmering water and stir until the glaze is thin and warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take each cake square, one at a time, and drop it into the bowl of glaze. Using a fork or small offset spatula, flip the cake so the entire surface is covered with glaze. Lift it out of the glaze, letting any excess drip off, and drop the cake gently onto the tray of toasted coconut. Flip the cake again, so that the entire surface is coated with coconut. Move the cake onto a cooling rack for about half an hour, so that the glaze can set and absorb into the cake. Repeat this until all 16 cakes are glazed and coconut-covered.</p>"}]}