{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110503-149772-GFTues-SaltChoc1.JPG", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["almonds", "chocolate", "Cookies", "desserts", "gluten free", "gluten-free cookies", "Gluten-Free Tuesday", "nuts", "salty-sweet desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Tuesday: Salted Marcona Almond Cookies", "link": "https://www.seriouseats.com/recipes/2011/05/salted-marcona-almond-cookies-recipe-gluten-free-desserts.html", "description": "This is <strong>part brownie, part cookie</strong> that highlights the salty marcona almonds in a decidedly rich, chocolate body.", "totalTime": "About 5 hours", "recipeYield": "Makes about 2 dozen cookies", "recipeCategory": ["Cookies", "Desserts", "Gluten-Free", "Gluten-Free Tuesday", "Nuts"], "recipeIngredient": ["4 ounces (1 cup) white rice flour", "1 ounce (1/4 cup) cornstarch", "1 teaspoon baking powder", "1/2 teaspoon salt", "1/4 teaspoon xanthan gum", "2 ounces unsweetened chocolate", "2 tablespoons butter", "8 ounces (1 cup) granulated sugar", "2 large eggs", "About 2 dozen marcona almonds (skinned and lightly salted) for cookie tops", "Kosher salt for sprinkling "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium mixing bowl, whisk together white rice flour, cornstarch, baking powder, salt, and xanthan gum. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate in microwave-safe bowl. Microwave for 20 seconds. Remove bowl from microwave and stir. Repeat until chocolate is melted. Or place chocolate into top of double-boiler that is set over hot but not boiling water. Stir chocolate frequently until melted. In a separate small bowl, melt butter. (Butter and chocolate melt at different temperatures. By melting them separately, I'm guaranteed the butter won’t spurt all over the microwave while the chocolate finishes melting.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, stir together melted chocolate and melted butter. Add granulated sugar. Stir to combine until chocolate and butter are thoroughly incorporated. Add eggs. Stir mixture until smooth. Add whisked dry ingredients. Stir until a thick batter forms. Press a piece of plastic wrap directly onto dough. Chill for four hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg; F. Line baking sheet with parchment paper. Scoop dough, about one tablespoon each, and roll into balls. Place dough on prepared baking sheet. Press one marcona almond into the center of dough. (Flat-side down). Sprinkle lightly with kosher salt. Cookies spread during baking. Be sure to space cookies about three-inches apart on baking sheet. Chill remaining dough between batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until cookies have a dry, crackled appearance, about 11-13 minutes. Cool on pan for two minutes. Transfer cookies to wire rack to cool. </p>"}]}