{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110729karendemascogood.jpg", "author": {"@type": "Person", "name": "Karen DeMasco"}, "recipeCuisine": "", "keywords": ["Cookies", "oatmeal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Karen DeMasco's Oatmeal Sandwich Cookies", "link": "https://www.seriouseats.com/recipes/2011/07/karen-demascos-oatmeal-sandwich-cookies-recipe.html", "description": "The oatmeal cookies should be baked just until they are golden brown, crispy on the edges, but soft in the middle. Fill them the day they will be eaten, or they can get a bit too soft.", "totalTime": "", "recipeYield": "2 dozen sandwich cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["2 sticks (8 ounces, 16 tablespoons) unsalted butter, cool not cold, cut into small pieces", "1 1/4 cup plus 1 tablespoon dark brown sugar", "2 large eggs", "1 teaspoon vanilla extract", "1 1/2 cups all-purpose flour", "1 1/2 teaspoon baking soda", "1 teaspoon cinnamon", "3/4  teaspoon kosher salt", "3 cups quick rolled oats", " ", "<strong>For the filling:</strong>", "4 1/2 ounces white chocolate, chopped into small pieces", "6 ounces cream cheese, room temperature and cut into small pieces", "6 tablespoons (3 ounces) unsalted butter, room temperature and cut into small pieces", "1/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees F. Line 3 baking sheets with parchment paper. Mix butter and sugar in the bowl of a stand mixer with the paddle attachment until they are well combined. Add the eggs and vanilla and mix until they are incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, whisk together the flour, baking soda, cinnamon, and salt. Add the oats. In two additions, mix these dry ingredients into the butter mixture. Scrape down the sides of the bowl with a rubber spatula, making sure the dough is well mixed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the dough into rounded teaspoon sized pieces and roll them into balls. Space them evenly on the baking sheets. With the bottom of a glass or measuring cup, flatten each ball into a disk. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies for about 15 minutes, rotating the pans halfway though baking, until the cookies are golden brown and crisp on the edges yet still soft in the middle. Remove from oven and let cookies come to room temperature. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, bring about 2 inches of water to a boil in a medium sized saucepan. Place a metal bowl with the white chocolate over the saucepan and turn off the heat. Mix the chocolate with a rubber spatula as it melts. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer with the paddle attachment, combine butter, cream cheese, and salt. Mix on medium speed, scraping the bowl down several times with a rubber spatula, until butter and cream cheese are well combined, but not whipped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the melted white chocolate all at once while warm and mix on medium speed until it is well mixed. At this point, the filling can be scraped into a storage container and chilled for at least 1 hour or more. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the filling out of the refrigerator 30 minutes before you are ready to fill the cookies. If the filling is still too hard to work with, scrape it into the bowl of a stand mixer and slowly mix it with paddle attachment until it is creamy and easier to spread. Pipe or spoon the filling onto half of the cookies and top with the other half. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the filling has become too soft, pop the tray of cookies into the freezer for 10 minutes. </p>"}]}