{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/tortillas%203.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Not Your Abuelita's Tortillas", "link": "https://www.seriouseats.com/recipes/2011/12/bread-baking-not-your-abuelitas-tortillas-recipe.html", "description": "These have good corn flavor with a more flour tortilla-like texture. No, they aren't any bit authentic. Your abuelita probably won't approve.", "totalTime": "1 hour, 25 minutes", "recipeYield": "Makes 8 tortillas", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup (4 1/2 ounces) bread flour", "1 cup (4 ounces) masa harina", "1 tablespoon sugar", "1 teaspoon salt", "2 teaspoons instant yeast", "1 tablespoon olive oil", "2/3 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the flour, masa harina, sugar, salt, and yeast in your food processor fitted with the proper blade for working dough. Pulse a few times to distribute the ingredients. Add the oil, turn the processor on, and with it running, add the water through the feed tube as fast as the flour will absorb it. It should form a ball - if it doesn't, add tiny bit more water to get it to form that cohesive ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue processing for another minute. The dough will feel gritty from the masa harina, but it should also feel like a cohesive dough. Put the dough in a plastic bag or in a small bowl covered with plastic wrap. Set aside to rise for an hour. It won't double, but it will be noticeably larger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a cast iron frying pan, griddle, or other heavy pan on the stovetop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn out the dough. Divide it into 8 even pieces. Form each piece into a ball, then flatten the first ball into a disk. Roll it with a rolling pin to circle about 6-8 inches in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the circle in the preheated pan and cook until you see large bubbles forming and the bottom has browned spots - about a minute. Flip it over and cook another 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tortilla and cover it with a clean kitchen towel. Continue rolling and cooking the tortillas, stacking them up and covering them as you go. Serve them warm. You can also reheat them briefly on a hot pan.</p>"}]}