{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-roasted-pear-pomegranate-hazelnut-salad-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["hazelnuts", "pears", "pomegranate seeds", "salad", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Roasted Pear Salad With Endive, Pomegranate, Blue Cheese, and Hazelnut Vinaigrette", "link": "https://www.seriouseats.com/recipes/2011/11/roasted-pear-salad-with-endive-pomegranate-stilton-hazelnut.html", "description": "A hearty sweet and savory salad for wintry weather.", "totalTime": "30 minutes", "recipeYield": "8 to 12", "recipeCategory": ["Christmas", "Nuts", "Pear", "Salads", "Thanksgiving"], "recipeIngredient": ["<strong>For the Hazelnut Vinaigrette</strong>", "1 tablespoon honey", "3 tablespoons balsamic vinegar", "1/2 cup toasted crushed hazelnuts", "1/2 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "&nbsp;", "<strong>For the Pears</strong>", "2 tablespoons butter", "2 tablespoons sugar", "3 bosc pears, slightly underripe, cored, halved, and cut into 1/4-inch slices", "&nbsp", "<strong>For the Salad</strong>", "4 whole Belgian endives, bottoms trimmed, separated into individual leaves", "4 heads frisée lettuce, pale yellow leaves only, roughly pulled apart by hand, rinsed and spun dry in a salad spinner", "6 cups (about 8 ounces) baby arugula leaves, rinsed and spun dry in a salad spinner", "4 ounces crumbled Gorgonzola, Stilton, or Cabrales cheese", "4 ounces seeds from 1 medium pomegranate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the vinaigrette:</strong> Combine honey, vinegar, and hazelnuts in a medium bowl and whisk to combine. Place bowl on top of kitchen towel rolled into a ring to keep it steady, and slowly pour olive oil into bowl while whisking constantly. Vinaigrette should form a semi-stable emulsion. Season to taste with salt and pepper, then aside in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pears:</strong> Heat butter in a 12-inch heavy bottomed skillet over medium-high heat until foaming subsides. Add sugar and swirl until melted and starting to brown. Add pears and toss to coat. Cook, tossing occasionally until pears are softened but still retain some texture and exteriors are a burnished, glazy brown, about 4 minutes total. Transfer to a large plate and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Combine endives, frisée, arugula, and pears in a large bowl and drizzle with 6 tablespoons vinaigrette. Season to taste with salt and pepper. Gently toss with hands until evenly coated with vinaigrette. Taste and add more vinaigrette or salt and pepper as necessary. Add cheese and pomegranate and toss briefly. Serve immediately.</p>"}]}