{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110602-154274-green-chile-buttermilk-fried-chicken-primary.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["buttermilk", "chicken", "chiles", "fried chicken", "green chile", "mains", "poultry", "Spice Hunting"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Green Chile Fried Chicken", "link": "https://www.seriouseats.com/recipes/2011/06/green-chile-fried-chicken-buttermilk-recipe.html", "description": "[Photograph: Max Falkowitz] I feel green chiles pair far better with chicken than red ones, especially in quick-cooking applications like frying. And all the more so when you bring buttermilk into the equation, whose twang is elevated by green chile's...", "totalTime": "30 minutes (plus an overnight brine)", "recipeYield": "serves 6", "recipeCategory": ["Deep Frying", "Fried Chicken", "Mains"], "recipeIngredient": ["6 assorted bone-in, skin-on chicken pieces (about 3 pounds)", "4 tablespoons plus two teaspoons kosher salt, divided", "1 teaspoon nutmeg, freshly ground", "2 cups low-fat buttermilk", "6 to 8 dried green Thai bird chiles, seeds removed and freshly ground", "Flour, as needed, for dredging", "Oil, as needed, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large airtight container or zip-top freezer bag, combine chicken, 4 tablespoons salt, and nutmeg. Rub salt and nutmeg into chicken well, then pour over with buttermilk. Seal and let brine overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, drain chicken of excess brine. Reserve the buttermilk and do not pat the chicken dry. Rub green chile into chicken well. Fill a pie plate with some flour and a couple heavy pinches of salt, and lightly dip chicken into flour. Shake off all excess. If dredging once, let chicken sit on a cooling rack. If dredging twice, dip chicken in reserved buttermilk, shaking off excess, and dredge again in flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken rests, heat a large skillet (preferably 12-inch cast iron) with enough oil to come halfway up chicken on medium high heat. Oil is hot when a pinch of flour mixed with buttermilk sizzles readily. Add chicken pieces, skin side down, making sure they do not touch. Fry for about 10 minutes or until a dark golden crust forms on first side, then flip over and fry for about another 10 minutes, or until dark crust forms. Depending on thickness of chicken, some pieces may need to fry on a third side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken to a cooling rack to drain off excess oil. Internal temperature of chicken should read between 165 and 170&deg;F (if lower, finish cooking chicken in a 400&deg;F oven). Allow chicken to rest ten minutes, then serve warm or room temperature.</p>"}]}