{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111018-dt-crispy-chicken-and-apple-salad.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["apple", "chicken salad", "cranberries", "Dinner Tonight", "fall", "quick", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Crispy Chicken and Apple Salad", "link": "https://www.seriouseats.com/recipes/2011/10/crispy-chicken-and-apple-salad-recipe.html", "description": "If you've ever wondered how to get juicy, crisp chicken without pulling out the deep fryer, this is the technique to do it (it will work for chicken thighs, too).  The only secret is to lightly pound the meat to an even thickness so that it cooks consistently throughout just as the bread crumbs are perfectly golden. Paired with some farmer's market apples, dried cranberries, and the tangy, creamy dressing, this chicken completes a salad of fall flavors.", "totalTime": "20 min", "recipeYield": "4", "recipeCategory": ["Apple", "Chicken Salad", "Cranberry", "Dinner Tonight", "Salads"], "recipeIngredient": ["1/4 cup all-purpose flour", "salt and pepper", "1 large egg", "1 cup panko breadcrumbs", "1 pound boneless, skinless chicken breast, gently pounded to even thickness", "2 tablepoons olive oil", "1/4 cup buttermilk", "2 tablespoons mayonnaise", "1 tablespoon white wine vinegar", "1 tablespoon chopped fresh parsley", "1-2 heads red-leaf lettuce (to make 8 cups of torn leaves)", "2 apples, cut into thin wedges", "1/2 cup dried cranberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On three small plates, set up the dredging stations: the flour on one, the egg whisked with 1 tablespoon of water on another, and the breacrumbs on the third. Season the flour with 1/4 teaspoon salt, and the pano with 1/2 teaspoon salt.  Dry the chicken breasts thoroughly with paper towels until tacky. Dredge first in the flour and shake off the excess, then into the egg mixture, allowing the excess to drip off, and finally in the bread crumbs, pressing gently to adhere. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium skillet, heat the olive oil over medium until shimmering.  Add the chicken and cook until golden, then flip and finish cooking, 8-10 minutes total.  Drain on paper towels, allow to cool for a few moments, then slice into strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the chicken cooks, whisk together the buttermilk, mayonnaise, vinegar, and parsley.  Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the lettuce on a platter and scatter with the apples and cranberries.  Lay the chicken over the top, drizzle with dressing, and serve.</p>"}]}