{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110502-149567-spaetzle-blend.JPG", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": ["pasta", "peas", "spatzle", "speck"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Herb Spätzle with Speck and Peas", "link": "https://www.seriouseats.com/recipes/2011/05/herb-spatzle-with-speck-and-peas-recipe.html", "description": "Spätzle serves as a great accompaniment to rich stews, but here it gets to stand more on its own. This herb spätzle is tossed with speck, peas and buttered bread crumbs to make a main dish that is hearty, but not heavy.", "totalTime": null, "recipeYield": "Serves four", "recipeCategory": ["Legumes", "Pasta"], "recipeIngredient": ["1 cup all-purpose flour", "½ cup semolina flour", "1 teaspoon Kosher salt, plus more for cooking water and final seasoning", "1 teaspoon each finely minced fresh thyme, fresh sage", "Large pinch freshly ground black pepper", "2 eggs", "1/3 – ½ cup milk", "3-4 tablespoons unsalted butter", "½ cup bread crumbs", "1 tablespoon minced fresh parsley", "1 – 2 teaspoons neutral cooking oil, such as grapeseed oil", "2 ounces diced speck or bacon", "½ cup cooked peas "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, whisk together flours, salt, herbs, and pepper. Beat eggs lightly with 1/3 cup milk and add to dry ingredients. Using a fork, quickly and gently combine wet and dry ingredients. If dough is very thick and difficult to work together, add more milk, up to ½ cup in total. Allow dough to rest for about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meanwhile, prepare a large pot of salted boiling water. Moisten a wooden cutting board with cool water. Spread a portion of the batter in a long strip along the board. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a large offset spatula to cut off small, thin strips of the batter and drop them into salted, boiling water. Cut the dough at small angles to keep the spätzle from getting too long. As you cut the dough, let the small bits drop into the boiling water. Once the spätzle floats, let them cook at a gentle boil for another 1-2 minutes, until they no longer have a raw flour taste and have a pleasantly firm texture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cooked spätzle with a strainer and shock briefly in ice water. Drain the cooled spätzle well and spread on a baking sheet to dry further while you continue cutting and cooking remaining dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a skillet over medium heat, melt one tablespoon of butter and add bread crumbs and parsley. Toss to coat evenly and cook until lightly toasted and crisp. Transfer bread crumbs out of pan and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a small amount of cooking oil (a little more if speck is very lean) to the skillet. Cook speck or bacon until fat is rendered and meat is crispy. Add peas and remaining 2-3 tablespoons of butter. When butter is melted, add spätzle. Cook until spätzle is heated through and slightly browned in some spots. Season with additional salt, to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a serving platter and top with buttered bread crumbs. Serve hot. </p>"}]}