{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/assets_c/2011/01/IMG_1674-thumb-500x375-135535.jpg", "author": {"@type": "Person", "name": "Caroline Ford"}, "recipeCuisine": "", "keywords": ["salad", "salad dressing", "verjus"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spirited Cooking: Crab and Citrus Salad with Verjus Vinaigrette", "link": "https://www.seriouseats.com/recipes/2011/03/spirited-cooking-crab-citrus-salad-with-verjus-vinaigrette.html", "description": "Thanks to a few financially savvy winemakers, verjus is gaining a resurgence in popularity. This fresh, vibrant juice (it literally means \"green juice\") is <strong>made from the pressing of unripe wine grapes that must be pruned from the vines</strong> so the rest of the grapes can ripen properly. This vibrant sweet-tart juice is excellent in a vinaigrette.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Condiments and Sauces", "Dressings and Vinaigrettes", "Salads"], "recipeIngredient": ["<strong>For the Vinaigrette:</strong>", "1/2 cup verjus", "1/2 teaspoon pink peppercorn", "1/2 teaspoon coriander seed", "1 large clove garlic, smashed", "4 tablespoons neutral-flavored olive oil", "Salt and Pepper to taste", " ", "<strong>For the Salad:</strong>", "2 medium fennel bulbs, trimmed, reserve some fronds", "2 celery stalks, trimmed, reserve some celery leaves", "1  grapefruit", "3-4 medium oranges or blood oranges, or combination", "8 ounces lump crab meat, picked over for shells"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place verjus, pink peppercorns, coriander, and garlic in small, heavy bottomed saucepan over medium-high heat. Simmer until reduced to 2 to 3 tablespoons. Strain liquid and discard solids. Slowly whisk oil into reduced verjus to create an emulsified vinaigrette. Season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut ends off of grapefruit and oranges. Remove peels and white pith with a knife. Cut fruits into thin rounds, about 1/8\" thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a mandoline, cut very thin slices of fennel and celery. Toss with half of vinaigrette until vegetables are well coated. Taste and add more salt accordingly. Let sit for 5 to 10 minutes, fennel and celery will soften slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dressed fennel and celery among plates. Top evenly with citrus and crab meat. Drizzle more vinaigrette over the top of each salad. Garnish with fennel fronds and celery leaves. </p>"}]}