{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111107-127355-dinner-tonight-chicken-stir-fried-lemongrass-chile.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "lemongrass", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Chicken Stir-Fried with Lemongrass and Chile", "link": "https://www.seriouseats.com/recipes/2011/11/chicken-stir-fried-with-lemongrass-chile-recipe.html", "description": "I've been on a little lemongrass kick lately, so I was excited about this recipe from Andrea Nguyen's <em><a href=\"http://www.amazon.com/dp/1580086659/?tag=serieats-20\">Into the Vietnamese Kitchen</a></em> from the very beginning, even if the title made it sound relatively straightforward. But something happens during he cooking process to those innocent looking chicken hunks, because by the end they start tasting an awful lot like glistening bits of fatty pork. Which is to say, they start tasting really, <em>really</em> good.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Chicken", "Dinner Tonight", "Stir Frying"], "recipeIngredient": ["1 ⅓ pounds boneless, skinless chicken thighs, cut into 1-inch chunks ", "½ teaspoon salt", "1 ½ teaspoons sugar ", "2 ½ teaspoons Madras curry powder", "2 ½ teaspoons fish sauce", "2 tablespoons canola oil ", "1 large shallot, finely chopped (about ⅓ cup)", "1 to 2 Thai chiles or serranos, finely chopped", "1 stalk lemongrass, trimmed, and finely chopped (about 3 tablespoons)", "1 small red bell pepper, stemmed and seeded, cut into ¾-inch squares", "½ cup coconut milk", "3 to 4 sprigs fresh cilantro, leaves coarsely chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, add the chicken, salt, sugar, curry powder, and fish sauce. Toss until the chicken pieces are evenly coated. Set aside in the fridge to marinate for at least 15 minutes minutes and as much as an hour – whatever you have time for. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is done marinating, remove from the fridge. Pour the oil into a large wok or skillet set over high heat. When just about ready to smoke, add the shallot, chiles, and lemongrass. Stir-fry until very fragrant, about one minute. Add the chicken and red bell pepper. Stir well, and then let the chicken pieces cook undisturbed until lightly browned, about one minute. Using a spatula, flip the chicken pieces, and cook until lightly browned on the other side, about another minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the coconut milk and reduce heat to maintain a simmer. Cook, stirring occasionally, until the coconut milk has almost completely evaporated, six to eight minutes. The fat in the coconut milk will just start to separate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a serving plate, and garnish with cilantro. Serve with white rice. </p>"}]}