{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110913-dt-roasted-salmon-with-rough-chopped-romesco.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Spanish", "keywords": ["Dinner Tonight", "fish", "Romeco sauce", "salmon", "spanish", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salmon with Deconstructed Romesco Sauce", "link": "https://www.seriouseats.com/recipes/2011/09/salmon-with-deconstructed-romesco-sauce-recipe.html", "description": "Since \"deconstructed\" makes most people think of modernist cooking, I'm not sure it's the right word for this recipe. Yet that's essentially what this is: all the ingredients in a traditional pureed Spanish Romesco sauce left intact: the crisp-chewiness of the bread, the crunch of almond, the smoothness of tomato and roasted pepper, the bright acidity. It's a phenomenal combination as a sauce, and it works really well as a kind of stuffing.", "totalTime": "45", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Salmon", "Spanish", "Tomato"], "recipeIngredient": ["2 red bell peppers", "1/2 cup olive oil", "2 thick slices crusty bread", "1 clove garlic, minced", "1/2 cup roughly chopped tomato (1 medium)", "3 tablespoons slivered almonds", "1 tablespoon chopped parsley", "1/2 tablespoon sherry vinegar", "1/2 tablespoon lemon juice", "Salt and pepper to taste", "4 fillets salmon, about 2 pounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450 degrees. Under a broiler or over an open flame, roast the peppers until skin is blistered and blackened on all sides, then transfer to a bowl and cover for 15 minutes to allow the skin to steam and loosen.  Peel skins, de-seed, and chop into 1/4-inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, heat 2 tablespoons of the olive oil in a large (12-inch) skillet over medium heat until shimmering.  Add the bread and fry until golden on both sides, about 4 minutes total.  Remove, allow to cool, and cut into 1/4-inch cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add another tablespoon of olive oil to the skillet and heat until shimmering.  Add the almonds and sauté briefly until toasted, then add garlic and tomatoes.  Cook until the juices have evaporated, 2-3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the contents of the skillet, along with the roasted peppers, bread, parsley, vinegar, lemon juice, and remaining olive oil.  Mix well and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the salmon fillets on both sides with salt and pepper and lay them skin side down on in a roasting pan.  Spoon the romesco stuffing around the fillets and roast until the salmon is almost cooked through,10-15 minutes depending on thickness. Broiler for the final few minutes of cooking to caramelize the ingredients. Serve with romesco spooned around the salmon.</p>"}]}