{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110221-138962-pulled-pork-empanadas-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["appetizers", "doughs", "empanadas", "grilling", "pork", "pulled pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Barbecue: Mini Pulled Pork Empanadas", "link": "https://www.seriouseats.com/recipes/2011/02/barbecue-mini-pulled-pork-empanadas-recipe.html", "description": "There wasn't anything not to love here. The pulled pork was as smoky and tender as always, with the added tang and spice from the sauce, and the empanada crust was flaky and crisp. They'd be perfect for this weekend's couch marathon, AKA the Oscars.", "totalTime": "3 hours", "recipeYield": "8-10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Grilling", "Pork"], "recipeIngredient": ["<strong>For the Dough</strong>", "3 3/4 cups all-purpose flour, plus more for dusting the work surface", "1 tablepsoon sugar", "2 teaspoons kosher salt", "12 tablespoons unsalted butter (1 1/2 sticks), cut into 1/2-inch cubes and frozen for 10 minutes", "1 1/4 cups ice water ", "&nbsp;", "2 cups <a href=\"http://www.seriouseats.com/recipes/2009/09/barbecue-bbq-pulled-pork-recipe.html\">pulled pork</a>, at room temperature", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2008/10/north-carolina-barbecue-vinegar-sauce.html#546939\">North Carolina vinegar sauce</a>", "&nbsp;", "1 egg, beaten", "&nbsp;", "1 cup <a href=\"http://www.seriouseats.com/recipes/2009/05/grilling-basic-barbecue-cue-bbq-sauce-recipe.html\">barbecue sauce</a>, for serving <em>(optional)</em>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process the flour, sugar, and salt together in a food processor until combined, about 6 seconds. Scatter the butter pieces over the flour mixture and pulse until the mixture resembles coarse crumbs with butter bits no larger than small peas, about 16 pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the flour mixture to a large mixing bowl. Working with 1/4 cup of water at a time, sprinkle the water over the flour mixture and stir it in using a rubber spatula, pressing the mixture against the side of the bowl to form a dough, until no small bits of flour remain (you may not need to use all of the water).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a clean work surface and divide it into 2 equal pieces. Press each dough half into a cohesive ball, then flatten the ball into a 6-inch disk. Wrap each disk in plastic and refrigerate until firm but not hard, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the dough rests, place pulled pork in a small bowl and add enough vinegar sauce until meat is very moist (you may not need the entire ½ cup of sauce).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425 degrees. Line 2 baking sheets with parchment paper; set aside. Remove 1 disk of dough from the refrigerator. Roll the dough out on a lightly floured work surface into an 18-inch circle about 1/8 inch thick. Using a 3-inch round biscuit cutter, cut out 18 rounds and transfer them to the prepared baking sheet, discarding the dough scraps. Place a heaping tablespoon of pulled pork to the middle of each round. Seal dough around filling, using tines of a fork to crimp edges shut. Repeat with second disk of dough and second prepared baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush empanadas with the egg. Bake until golden brown, 20 to 25 minutes, switching and rotating the trays halfway through the baking time. Let cool for 5 minutes. Transfer to a platter and serve with a bowl of barbecue sauce, if desired.</p>"}]}