{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110516-grilled-patty-melt-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "grill", "grilling", "patty melts", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Patty Melts", "link": "https://www.seriouseats.com/recipes/2011/05/grilled-patty-melts-recipe.html", "description": "[Photograph: Kenji Lopez-Alt] What could go better with juicy ground beef, oozy melty cheese, and sweet caramelized onions than a bit of smoke from a real fire? Ok, perhaps cold beer. But that goes without saying. The key to cooking...", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Beef", "Burger", "Sandwiches"], "recipeIngredient": ["2 thick slices raw yellow onion", "1/2 teaspoon vegetable oil", "2/3 pound freshly ground beef", "Kosher salt and freshly ground black pepper", "4 slices rye bread", "4 slices American or Swiss cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a large chimney 2/3 full of coals and burn until coals are covered in gray ash. Spread evenly over 1/2 of coal grate. Place cooking grate above, cover grill, and preheat for 5 minutes. Scrape grill grates clean with a brush. Rub onion evenly with oil. Form beef into two even patties about 5 inches wide and 1/2-inch thick. Season onions and beef on all sides with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill onions and beef over hot side of grill until well-charred on first side, about 2 minutes. Flip and cook until charred on second side, about 2 minutes longer. Center of burger patties should register around 110°F on an instant-read thermometer. Transfer to cool side of grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bread slices along center of grill and cook, turning occasionally, until lightly toasted on first side, about 2 minutes. Flip bread slices so toasted side is up and place 1 slice of cheese each on two of them. Place burger patty on top of cheese. Top with onion, another slice of cheese, and remaining slices of bread, toasted side facing in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and cook, opening cover every minute or so to turn sandwiches until well-toasted on both sides and center of beef registers 130 to 140°F. Remove from grill, allow to rest for five minutes, then serve.</p>"}]}