{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111011-174414-sqash-spinach-quinoa-salad.jpg", "author": {"@type": "Person", "name": "Carolyn Cope"}, "recipeCuisine": "", "keywords": ["fall", "quinoa", "salad", "squash", "The Crisper Whisperer", "vegetarian", "winter squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Crisper Whisperer: Squash and Quinoa with Cilantro-Lime Dressing", "link": "https://www.seriouseats.com/recipes/2011/10/dumpling-squash-spinach-quinoa-cilantro-lime-dressing-recipe.html", "description": "It's a bright, beautiful bowl of roasted dumpling squash, baby spinach, and quinoa, tossed together with a zingy cilantro-lime dressing and a few crunchy pepitas. Is it a salad? Sure, you could call it that if you feel like it, and even serve it chilled. But if you're in the mood for a warming main at dinner, you could also serve it hot.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["Crisper Whisperer", "Dairy-Free", "Quinoa", "Salads", "Squash", "Vegan", "Vegetarian"], "recipeIngredient": ["1 medium dumpling squash", "3 tablespoons good olive oil, divided", "3/4 teaspoon sea salt, divided", "1 cup uncooked quinoa, rinsed in a few changes of water and drained well", "5 ounces baby spinach", "Juice and zest of 1 lime", "Freshly ground black pepper", "1/4 cup chopped fresh cilantro", "1/4 cup hulled pumpkin seeds (pepitas)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450°F. Cut the squash into quarters. Scoop out and discard the seeds and stringy pulp. Cut each squash quarter into 1/4-inch-thick wedges. Place squash wedges on a baking sheet and toss with 1 tablespoon of the olive oil and 1/4 teaspoon of the salt. Spread the wedges in a single layer in the pan. Roast for about 30 minutes, until tender and slightly browned. Set aside to cool slightly. (Alternatively, if you have a convection oven, it's great to use here, at 400°F.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the quinoa in a 4-quart pot over medium-high heat. Cook, stirring, until lightly toasted, about two minutes. Add 2 cups of water and bring to a boil over high heat. Simmer, uncovered, until quinoa turns translucent and water is almost absorbed, about 10 minutes. Then stir in the baby spinach all at once, place a lid on the pot, and cook over low heat for 5 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dressing, whisk together the remaining 2 tablespoons olive oil, the lime zest and juice, the remaining 1/2 teaspoon salt, and freshly ground black pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, place the roasted squash, quinoa-spinach mixture, chopped cilantro, and pumpkin seeds. Drizzle with the dressing and toss gently to coat. Serve warm or at room temperature. Keeps well in the fridge for up to three days.</p>"}]}