{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110711-160135-grasshopperpie2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "frozen desserts", "grasshopper pie", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grasshopper Pie in a Brownie Crust", "link": "https://www.seriouseats.com/recipes/2011/07/grasshopper-pie-in-a-brownie-crust-mint-cream-pie-recipe.html", "description": "Comprised of a boozy, creamy mint filling in a chocolate cookie pie crust, Grasshopper Pie is a deliciously refreshing summertime dessert. But when you swap out the chocolate cookie crust for a crumbled brownie crust, you've got something even more amazing. \r\nBut when you swap out the chocolate cookie crust for a crumbled brownie crust, you've got something even more amazing.", "totalTime": "4 hours", "recipeYield": "8", "recipeCategory": ["Cakespy", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1/2 batch baked and cooled brownies from a recipe yielding a finished 8x8-inch pan", "3 tablespoons butter, melted (if needed; see Step 1)", "1 cup whipping cream", "3/4 cup light cream", "24 large marshmallows", "1/4 cup creme de menthe liqueur", "2 tablespoons creme de cacao (try to find a light-colored one)", "2 drops green food coloring (or, 1 drop gel food coloring)", "Ice cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place your baked and cooled brownies into a large bowl. Crush with your hands. This should be a very sticky, cohesive mass; if it is crumbly, add up to 3 tablespoons of melted butter to the crushed brownie mixture; this should make it sticky to the point where you could form it into a ball with your hands. Transfer to a pie plate and press the brownie bits into the bottom and up the sides of the dish. Refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip the cup of whipping cream until it has attained soft peaks. Refrigerate until it is needed in step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour light cream into a saucepan, add marshmallows. Melt marshmallows over medium heat, stirring constantly. Remove from heat and let cool. Add creme de menthe and creme de cacao, mix well. Add a drop or two of green food coloring if desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the whipped cream into the marshmallow mixture, stirring gently until the green color has become evenly distributed. Pour into the chilled pie shell. Freeze for 3 or 4 hours. If desired, serve with a scoop of ice cream on top of each slice.</p>"}]}