{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110708-160286-sweet-italian-sausage.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alexandra Zissu", "Cook the Book", "Josh and Jessica Applestone", "pork", "sausages", "The Butcher's Guide to Well-Raised Meats"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Sweet Italian Sausage", "link": "https://www.seriouseats.com/recipes/2011/07/sweet-italian-sausage-recipe.html", "description": "The key to really great sausage, as you'll learn from this recipe for <strong>Sweet Italian Sausage</strong> from <a href=\"http://www.fleishers.com/about-legacy.htm\">Joshua and Jessica Applestone</a>'s <strong><em><a href=\"http://www.amazon.com/Butchers-Guide-Well-Raised-Meat-Great-Poultry/dp/0307716627/?tag=serieats-20\">The Butcher's Guide to Well-Raised Meats</a></em>,</strong> is allowing your chunks of pork shoulder or stew meat to sit or \"sweat\" in a spice blend for 24 hours before grinding them. The chilled meat grinds beautifully and letting the herbs and spices sit makes sure that you're left with patties (or links, if you're feeling ambitious) that are uniformly flavored.", "totalTime": "30 minutes, plus 1 day for chilling", "recipeYield": "makes 3 pounds", "recipeCategory": ["Cook the Book", "Pork"], "recipeIngredient": ["3 pounds pork stew meat or boneless shoulder, cleaned and cut into ½-inch pieces or strips ", "3 tablespoons whole white peppercorns ", "2 tablespoons whole black peppercorns", "2 tablespoons fennel seeds", "2 tablespoons dried sage", "2 tablespoons kosher salt", "1/4 cup garlic powder ", "2 tablespoons onion powder", "1/2 bunch fresh parsley", "1/4 hank of natural hog casings (optional; you need only about 2 feet of hog casings for each pound of sausage mixture)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As you cut up your meat make sure to remove any gristle or hard bits of fat; you don’t want any nasty surprises in your sausage. Make sure that the meat pieces fit easily into the mouth of the grinder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a spice or coffee grinder, grind the white and black peppercorns, fennel seeds, sage, and salt to a medium-fine grind, working in batches if necessary. Transfer the spices to a large bowl, add the garlic powder and onion powder, and mix well. Add the meat and mix until thoroughly blended with the spices. Transfer the pork to the refrigerator and chill (or “sweat”) for 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork mixture from the refrigerator. Add the parsley and mix until well blended. To test the flavor, grind a small amount of the meat, cook a little patty, and taste. Adjust the spices accordingly. When you have the flavor you want, grind the whole mixture into a chilled metal bowl. The grind should look like nice fat worms. If the worms look mushy or are not separating properly it means the grinder blade is not making good contact with the plate or the grinder blade is dull. Try reattaching the plate after thoroughly cleaning the grinder mechanisms. If this doesn’t work, you may have to buy a new blade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stuff the pork into the casings if using and link or leave the meat uncased and form it into patties. Sausages will keep refrigerated for 4 to 5 days and in the freezer for 6 months. If freezing patties, place sheets of plastic in between them so they don’t stick to each other.<br />\n</p>"}]}