{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110304-150317-goat-skewers-in-a-vinegary-herb-sauce.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bruce Weinstein", "Cook the Book", "goat", "Goat: Meat Milk Cheese", "grill", "grilling", "Mark Scarbrough", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Goat Skewers with a Vinegary Herb Sauce", "link": "https://www.seriouseats.com/recipes/2011/05/goat-skewers-with-a-vinegary-herb-sauce-recipe.html", "description": "[Photographs: Marcus Nillson] Bruce Weinstein and Mark Scarbrough, authors of Goat: Meat, Milk, Cheese, are quick to tell you that most people's aversion to goat meat stems from curry, more specifically the very goaty sort that's popular in Jamaican takeout...", "totalTime": "4 hours", "recipeYield": "4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Grilling", "Mains"], "recipeIngredient": ["1/4 cup (55 g) minced fresh chives or the green bits of a scallion", "1/4 cup (55 g) stemmed, packed fresh cilantro leaves", "1/4 cup (55 g) stemmed, packed fresh parsley leaves", "3 tablespoons red wine vinegar", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon salt", "2/3 cup (165 ml) olive oil", "1 1/2 pounds (680 g) goat meat chunks from the leg, cut into 1-inch (2.5-cm) cubes", "1 teaspoon mild paprika", "1/2 teaspoon ground cardamom", "4 metal kebab skewers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whir the chives, cilantro, parsley, vinegar, pepper, and salt in a food processor fitted with the chopping blade. While the machine is running, pour the olive oil through the open feed tube in a slow dribble to make a light sauce.</p>\n\n<p>No food processor? Mince the chives, cilantro, and parsley on a cutting board, then mash them with the other ingredients in a mortar with a pestle until pasty. Drip in the oil, grinding the mixture into a sauce as the oil is added in dribs and drabs. It won’t be as smooth as that from a food processor, but it’ll do in a pinch.</p>\n\n<p>No food processor, no mortar, no pestle? (Are you sure you wanted to buy a goat cookbook?) You can make this sauce by rocking a knife through the herbs on a cutting board until they’re minced, almost pur&eacute;ed, then adding coarse-grained salt and wiping the side of the knife’s blade across the mess, using the grainy salt to further mash the herbs into a pulp. Scrape all this into a bowl, stir in the vinegar and pepper; then whisk in the olive oil in a slow, steady stream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half of this herb sauce in a large bowl (reserve the remainder in a separate bowl in the fridge for a garnish). Add the meat cubes, paprika, and cardamom. Stir well, cover, and refrigerate for at least 4 hours or up to 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thread the meat cubes onto the skewers and set them aside at room temperature while you prepare the grill, either heating a gas grill to high heat (about 550&deg;F [288&deg;C]) or building a high-heat coal bed in a charcoal grill. If you don't want to use the grill outside, heat a large, heavy grill pan over medium-high heat until smoking. As the grill is heating up, take the reserved sauce out of the fridge so it comes back to room temperature. You can even nuke it for a few seconds to take the chill off (but don;t get ut too hot or the taste will become too pronounced, almost bitter.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the skewers directly over the heat (or in the grill pan). Grill for 6 minutes, turning occasionally, until browned on all sides and an instant-read thermometer inserted into a cube without touching the skewer registers 160&deg;F (71&deg;C). Serve the skewers with the reserved sauce on the side.</p>"}]}