{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110301-bread-baking-soudough-English-Muffins.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "english muffins", "muffins"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Sourdough English Muffins", "link": "https://www.seriouseats.com/recipes/2011/03/bread-baking-sourdough-english-muffins-recipe.html", "description": "I love English Muffins. There's something about the way butter melts into the nooks and crannies in a toasted muffin, with the soft interior and the crispy toasted bits. In some ways, English muffins are better than bread. Sure, you can toast bread, but it's not the same. Not at all.", "totalTime": "2 hours", "recipeYield": "8", "recipeCategory": ["Bread Baking", "Breakfast and Brunch", "Yeast Bread"], "recipeIngredient": ["1/2 cup sourdough starter", "1 cup water, divided", "6 3/4 ounces (about 1 1/4 cups) bread flour, divided", "1/4 cup nonfat dry milk", "1 tablespoon butter cut into several pieces", "1 teaspoon sugar", "1 teaspoon salt", "1 teaspoon instant yeast (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If your starter is refrigerated, take it out of the refrigerator the day before you will use it, feed enough so that you'll be able to take out 1/2 cup of starter the next day, and leave it unrefrigerated over night. If your starter is room temperature, you don't need to wait. Put 1/2 cup of starter, 1/2 cup of water, and about 1/3 of your flour into a bowl. Stir well to combine, cover the bowl, and set aside for 60 minutes. After the starter mixture has rested for 60 minutes it should be very active. If it isn't, you can let it sit longer, or add 1 teaspoon of instant yeast in the next step.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a separate bowl, combine 1/2 cup very hot tap water, dry milk, butter, sugar and salt. Stir to combine. The water should be hot enough to melt the butter. Set aside to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine your two mixtures. add the remaining flour (and instant yeast if you need it), and beat well with a wooden spoon. Cover the bowl and set aside for 30 minutes. After 30 minutes, it should have risen in the bowl and be light and bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a griddle on medium heat and place 8 English muffin rings on the griddle (or you can do this in a large frying pan, making 4 muffins at a time). Spray the interior of the rings with nonstick spray. Using a large disher, and without stirring the batter, divide it between the 8 rings. Cover the rings with a cookie sheet or large pot lid and cook for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pair of tongs, flip the rings over to cook on the other side. At this point, the muffins may already be shrinking away from the sides of the rings, so you may need a spatula underneath to help you flip. Cover the rings again, and cook for another 5 minutes. The muffins should be golden brown on both sides. Move the muffins to a rack to cool. Split them with a fork, and toast before serving.</p>"}]}