{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110333-143435-grandma-stevens-coconut-cake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cakes", "coconut", "Cook the Book", "desserts", "icing", "Molly O'Neill", "One Big Table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Cook the Book: Grandma Stevens's Coconut Cake", "link": "https://www.seriouseats.com/recipes/2011/03/grandma-stevenss-coconut-cake-recipe.html", "description": "Desserts don't get more Southern than a towering coconut cake. Fluffy and white, dusted with shaved coconut and gobs of seven-minute icing, it's a gorgeous way to end a meal. This particular version from <a href=\"http://onebigtable.com/about-molly/\">Molly O'Neill</a>'s <strong><em><a href=\"http://www.amazon.com/One-Big-Table-fishermen-pit-masters/dp/0743232704/serieats-20\">One Big Table</a></em></strong> incorporates an extra layer of coconut flavor in the form of a sour cream-coconut filling.  Mixed up a few days before baking, it's a dead ringer for chocolate Easter egg filling, i.e., super delicious and plenty coconutty.", "totalTime": null, "recipeYield": "12", "recipeCategory": ["Bake the Book", "Cakes", "Coconut", "Cook the Book", "Desserts"], "recipeIngredient": ["<strong>For the Filling:</strong>", " 2 cups sour cream", "2 cups sugar", "Three 6-ounce packages frozen shredded or grated coconut, thawed", "<strong>For the Cake:</strong>", "3 cups cake flour", "1 tablespoon baking powder", "1/2 teaspoons salt", "1 cup unsalted butter, cut into 1-inch pieces and slightly softened", "2 cups sugar", "5 large eggs", "2 teaspoons vanilla", "1 1/4 cups buttermilk ", "<strong>For the Seven-Minute Icing:</strong>", "2 large egg whites", "1 1/2 cups sugar", "1/8 teaspoon table salt", "1/4 cup water", "1 tablespoon light corn syrup", "1 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Two days before serving, make the filling:</strong> In a large bowl, stir together the sour cream, sugar, and most of the coconut. (Save a bit for sprinkling on top at the end.) Cover and refrigerate.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The day before serving, make the cake:</strong> Preheat the oven to 350°F. Butter two 8 x 2-inch cake pans, line with parchment or wax paper, butter again, and set aside. in a medium bowl, sift the flour, baking powder, and salt together and set aside. Place the butter in another bowl and beat until light and fluffy with an electric mixer, about 2 minutes. Add the sugar a little at a time, beating after each addition. reduce the mixer speed to low, add the vanilla, then the buttermilk, and beat again at high speed for 10 seconds.  Add the flour mixture and beat until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter between the two pans and tap on the counter to remove air bubbles. Bake until the cake is lightly browned and firm to the touch, about 45 minutes. Remove, cool completely on a rack, then turn out each layer onto plates. Split each one horizontally into two equal layers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside 1 cup of the filling. Use the rest to “build” the four-layer cake. Spread a thin layer of filling underneath the first layer so that the cake doesn’t stick to the plate. Then spread a layer of filling on the top of the first layer, and add the second layer. repeat until four layers have been assembled (this is like stacking bricks with a layer of mortar in-between). Cover the top with only a thin layer of filling, as icing will be added. Lightly cover the unfrosted cake and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Seven-Minute Icing:</strong> With a handheld mixer, beat together the egg whites, sugar, salt, water, and corn syrup in the top of a double boiler. Place over boiling water and beat until soft peaks form. Remove from the heat and add the vanilla. continue beating until stiff peaks form and the sides of the double boiler top are cool. (Note: this may take longer than 7 minutes!)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, mix the reserved filling with the Seven-Minute Icing and ice the whole cake. Sprinkle the top with the reserved coconut.</p>"}]}