{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110321-143496-bananas-foster-shake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Adam Ried", "bananas", "bananas foster", "Drink the Book", "ice cream", "milkshakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Drink the Book: Bananas Foster Shake", "link": "https://www.seriouseats.com/recipes/2011/03/drink-the-book-bananas-foster-shake.html", "description": "While Bananas Foster is typically served <em>with</em> ice cream, milkshake maven <a href=\"http://adamried.com/\">Adam Ried</a> decided to blend the caramelized bananas into ice cream for this <strong>Bananas Foster Shake</strong>.  To make this shake you begin by slowly sautéing bananas with butter and brown sugar until gooey and soft and then finish with a dramatic rum flambé.  (Watch out, that stuff really does flame up!)", "totalTime": "30 minutes", "recipeYield": "4", "recipeCategory": ["Banana", "Drink the Book", "Ice Cream and Frozen Treats", "Milkshake", "Rum"], "recipeIngredient": ["1 1/2 tablespoons unsalted butter (about  3/4 ounce/22 grams) ", "1 large banana, sliced (about  6 ounces/170 grams) ", "3 tablespoons light  brown sugar (about  1 1/2 ounces/38 grams", "1/4 cup dark or amber rum (about  2 ounces/60 milliliters) ", "Pinch of ground  cinnamon ", "1/3 cup cold whole or  lowfat milk (about 2 1/2 ounces/ 75 milliliters) ", "8 medium scoops  French vanilla ice  cream (about  1 quart/24 ounces/  680 grams), softened until just melty  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the bananas:</strong> Melt the butter in a medium nonstick skillet over medium heat and heat until it stops foaming. Add the bananas and brown sugar, stir to help melt the sugar and coat the bananas, and cook, stirring occasionally, until the bananas are soft and saucy, about 2 minutes. Add 3 tablespoons (1½ ounces/45 milliliters) of the rum, allow it to warm for a few seconds, and carefully wave a lit chimney match over the pan until the rum ignites. Allow the rum to burn until it extinguishes, about 30 seconds. Off the heat, add the cinnamon, stir to combine, and allow the mixture to cool to room temperature, about 20 minutes. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the shake Place the bananas, sauce, milk, and remaining 1 tablespoon (½ ounce/15 milliliters) of rum in a blender and blend to mix thoroughly, about 30 seconds. Add the ice cream and pulse several times to begin breaking it up. With the blender motor off, use a ﬂexible spatula to mash the mixture down onto the blender blades. Continue pulsing, stopping, and mashing until the mixture is well blended, thick, and moves easily in the blender jar, roughly 30 to 90 seconds. Pour into a chilled glass or glasses, and serve at once. <br />\r\n</p>"}]}