{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110620-157210-chocgooeybutter.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cake", "cake mix", "chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Gooey Butter Cake", "link": "https://www.seriouseats.com/recipes/2011/06/cakespy-chocolate-gooey-butter-cake-st-louis-butter-cake-recipe.html", "description": "Recipes for traditional St. Louis gooey butter cake always call for a cake mix, but this one twists the tradition slightly, using a chocolate cake mix instead of the usual yellow, and employs cocoa in the filling.", "totalTime": "1 hour", "recipeYield": "20 bars", "recipeCategory": ["Cakes", "Cakespy", "Chocolate"], "recipeIngredient": ["1 box (18.25 ounces) chocolate cake mix", "1/2 cup (1 stick) butter, melted", "2 teaspoons vanilla, divided", "4 eggs", "1/4 cup nuts or chocolate chips (optional)", "1 (8-ounce) package cream cheese, at room temperature", "3 1/2 cups confectioners' sugar", "2 tablespoons cocoa powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a 9x13-inch pan and set aside. Preheat your oven to 350 F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle attachment, mix together the cake mix, melted butter, 1 teaspoon of vanilla, and 2 of the eggs on medium speed until it forms a soft, cohesive dough. If you'd like, you can add 1/4 cup of nuts or chocolate chips to add a little flavor and texture contrast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the mixer; you don't need to clean the bowl or the beater, you can just re-use for the filling. Pat the dough into the prepared pan, with a slight \"lip\" on the sides of about half an inch to accommodate the cream cheese batter, which will be poured on top of this crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the confectioners' sugar and cocoa powder; set to the side for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Back at the mixing bowl, beat the softened cream cheese until fluffy, about 2 minutes on medium speed. Add the remaining 2 eggs and the remaining 1 teaspoon of vanilla, and continue mixing on medium speed until incorporated, about a minute more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the confectioners' sugar and cocoa powder bit by bit, pausing occasionally to scrape down the sides of the bowl with a rubber spatula, until it has all been added and the mixture is smooth and creamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour this batter into the waiting crust. Bake for 40-45 minutes, or until the top has a dull finish (if a few cracks have formed on top, it's OK. Just top it with some whipped cream or confectioners' sugar. It will still taste fine).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the entire pan to a wire rack to cool (do not remove the cake from the baking pan). Let cool completely, then cut into squares to serve.</p>"}]}