{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110626blueberryconserveprimaryu.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["blueberries", "maple syrup", "pecans", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry-Maple-Pecan Conserve", "link": "https://www.seriouseats.com/recipes/2011/06/blueberry-maple-pecan-conserve-ice-cream-topping-pancake-topping-recipe.html", "description": "I love the combination of tart, juicy blueberries and caramelized, earthy maple syrup. This versatile conserve is a cinch to prepare, and would be wonderful over sweets like vanilla ice cream or pancakes, or savories like a wheel of baked brie.", "totalTime": "6 hours", "recipeYield": "Makes five (4-ounce) jars", "recipeCategory": ["Blueberry", "Breakfast Sweets", "Condiments and Sauces", "Nuts"], "recipeIngredient": ["2 cups fresh blueberries", "1/2 cup maple syrup", "1 tablespoon freshly squeezed lemon juice", "1/2 cup water", "1 cup packed dark brown sugar", "1/2 cup dried currants", "1/2 cup chopped pecans", "1/2 teaspoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the conserve, prepare jars and lids: place five (4-ounce) jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse blueberries in food processor a few times until coarsely chopped. Transfer blueberries to a medium-sized, heavy-bottomed pot. Add maple syrup, lemon juice, and 1/2 cup water. Bring to a boil over high heat. Reduce heat and simmer five minutes, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in brown sugar and currants. Return to a simmer and cook, stirring occasionally, until the mixture has thickened, about 30 minutes. Remove from heat. Stir in pecans and cinnamon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot conserve into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}