{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110930-127677-Dulces-Coco.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Latin American", "keywords": ["coconut", "icebox cake", "Latin American", "sweetened condensed milk"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Tres Leches de Coco (Coconut Tres Leches Cake)", "link": "https://www.seriouseats.com/recipes/2011/09/dulces-tres-leches-de-coco-how-to-make-tres-leches-cake-coconut-recipe.html", "description": "<em>Tres leches</em> is typically topped with mounds of whipped cream, but this one gets a toasted marshmallow cap with bits of bronzed and toasted coconut.", "totalTime": "4 hours, 45 minutes", "recipeYield": "12 to 16", "recipeCategory": ["Cakes", "Coconut", "Latin American"], "recipeIngredient": ["<strong>For the Cake:</strong>    ", "2 cups all-purpose flour, sifted", "4 teaspoons baking powder", "6 large eggs, separated and at room temperature", "1 teaspoon salt", "1 1/2 cups sugar", "1/2 cup milk, at room temperature", "2 teaspoons pure vanilla extract", "2 cups sweetened shredded coconut", "   ", "<strong>For the Coconut Milk Bath:</strong>    ", "2 (13.5-ounce) cans coconut milk", "2 (14-ounce) cans sweetened condensed milk", "1 cup heavy cream", "   ", "<strong>For the Toasted Meringue Topping:</strong>  ", "1 1/3 cups sugar", "1/4 cup water", "2 tablespoons light corn syrup", "6 large egg whites, at room temperature", "1/4 teaspoon salt", "2 cups toasted sweetened shredded coconut (See Notes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to middle position and preheat oven to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour and baking powder together in small bowl; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, beat egg whites and salt with whisk attachment on medium-low speed until whites begin to loosen and froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes. Slowly add the sugar and continue beating until stiff, glossy peaks form, 2 to 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add egg yolks and beat just until combined. Decrease speed to low and add flour mixture in three batches, alternating with milk. Scrape sides and bottom of bowl with rubber spatula as necessary. Add vanilla and beat just until combined. Fold in coconut with rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into ungreased 13- by 9-inch baking dish and smooth out top. Bake until cake tester inserted in center of cake comes out clean, 45 to 50 minutes, rotating cake halfway through baking. Transfer cake to cooling rack and cool in pan completely, 1 to 2 hours. Once cooled, poke cake all over with fork or skewer and run a paring knife along the edges just to separate the cake from the sides of the baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coconut Milk Bath:</strong> Whisk coconut milk, sweetened condensed milk, and cream together in large bowl. Pour mixture evenly all over cake (See notes). Transfer to refrigerator and chill at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Toasted Meringue Topping:</strong> Stir sugar, water, and corn syrup in heavy-bottomed medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 240°F on candy thermometer, 8 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While syrup boils, in large bowl, beat egg whites and salt with whisk attachment on medium-low speed until whites begin to loosen and froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With mixer running on medium-high speed, slowly and carefully add syrup to egg whites. Beat until outside of bowl is cool to the touch and whites are thick and glossy, about 7 minutes. Fold in toasted coconut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread topping on cooled cake with a spatula, pulling up on meringue to create decorative peaks. Torch meringue to lightly toast. If you don’t have a torch, adjust oven rack to upper third and preheat oven to 450°F. Bake until golden, about 5 minutes.</p>"}]}