{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20101109beetgreengratin.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beet greens", "beets", "cheese", "Cook the Book", "Faith Durand", "goat cheese", "gratin", "Not Your Mother's Casseroles", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beet Gratin with Goat Cheese and Greens", "link": "https://www.seriouseats.com/recipes/2011/02/beet-gratin-with-goat-cheese-and-greens-recipe.html", "description": "Back in November we discovered that beet greens make for a <a href=\"http://www.seriouseats.com/recipes/2010/11/cook-the-book-beet-green-gratin-thanksgiving-sides.html\">fantastic gratin</a> courtesy of a recipe from Alton Brown's <em><a href=\"http://www.amazon.com/Good-Eats-2-Middle-Years/dp/1584798572/serieats-20\">Good Eats 2: The Middle Years</a>.</em> So when we came across this <strong>Beet Gratin with Goat Cheese and Greens</strong> from <a href=\"http://www.faithdurand.com/\">Faith Durand</a>'s <em><strong><a href=\"http://www.amazon.com/Your-Mothers-Casseroles-Faith-Durand/dp/1558324844/serieats-20\">Not Your Mother's Casseroles</a></strong></em> we had a feeling that adding sliced beets and goat cheese to the mix would only make the gratin that much better.", "totalTime": "1 hour 30 minutes", "recipeYield": "8", "recipeCategory": ["Cheese", "Cook the Book", "Sides", "Vegetarian"], "recipeIngredient": ["3 pounds red beets (about 6 medium beets), with greens attached", "Salt and freshly ground black pepper ", "Olive oil", "2 cloves garlic, minced", "2 ounces goat cheese, finely crumbled", "1/2 cup whole milk", "1 cup dry bread crumbs", "Zest of 1 lemon", "4 sprigs fresh thyme (leaves only)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and lightly grease the baking dish with olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put on disposable kitchen gloves and chop the stalks and green tops off the beets. Cut off the root and stem ends of each beet root so that each end is flat. Lightly rinse the beet roots in the sink and peel them with a vegetable peeler. Slice the peeled beets very thin with a mandoline—the slices should be about 1/8 inch thick. (This entire operation is best done in the sink, to avoid beet-juice splatters.) Line the prepared baking dish with half of the beet slices, overlapping them as necessary to form a thick layer. Sprinkle the slices lightly with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the green leaves from the lower, thicker stalks. Cut the stalks into 1/2-inch segments and rinse them well. Drain and set aside in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each beet leaf in half, then into thin ribbons. Wash very well and drain thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a deep 10-inch sauté pan over medium heat and add a generous drizzle of olive oil. When the oil is shimmering, add the minced garlic and cook for a moment, then add the chopped beet stalks. Cook, stirring occasionally, for about 5 minutes. Add the ribbons of beet greens and stir them in. Add a pinch of salt and pepper and cook, stirring frequently, for another 5 minutes, or until the greens are slightly wilted. Turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a slotted spoon to lift out the beet stalks and greens, leaving any extra liquid behind in the pan. Spread the greens and stalks evenly over the sliced beets in the baking dish. Sprinkle the crumbled goat cheese evenly over the greens. Top with the remaining beet slices, again overlapping them as needed to form a thick layer. Sprinkle them lightly with salt and pepper. Pour the milk evenly over the beets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the bread crumbs, lemon zest, and thyme leaves in a small bowl. Add a pinch of salt and pepper and a drizzle of olive oil. Mix until the bread crumbs have the texture of wet sand, and then spread them evenly over the top layer of beets. Drizzle with olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 1 hour, or until the beets are tender when pierced with a fork and the bread crumbs are golden. Remove the dish from the oven and let it stand for 15 minutes before serving.</p>"}]}