{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111106-178311-farfalle-abruzzese.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Mario Batali", "Molto Batali", "pasta", "porcini", "spinach", "veal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Farfalle Abruzzese with Veal, Porcini, and Spinach", "link": "https://www.seriouseats.com/recipes/2011/11/farfalle-abruzzese-with-veal-po.html", "description": "This <strong>Farfalle Abruzzese with Veal, Porcini, and Spinach</strong> from <a href=\"http://www.mariobatali.com/about_mario.cfm\">Mario Batali</a>'s latest, <em><strong><a href=\"http://www.amazon.com/Molto-Batali-Simple-Family-Meals/dp/0062095560/?tag=serieats-20\">Molto Batali</a></strong></em> is genius in that it gives you a deeply concentrated meaty ragu in barely any time at all.  The secret here is the umami factor in the dried porcinis, chopped up fine and added with their liquid to a ground veal, rust-colored tomato paste and tomato sauce. The mushrooms add a depth that make it seem as though this sauce has been lazily bubbling away on the stove for hours instead of minutes.", "totalTime": "25 minutes", "recipeYield": "8 to 10 as a first course, 6 as a main", "recipeCategory": ["Cook the Book", "Pasta", "Spinach"], "recipeIngredient": ["3 ounces dried porcini mushrooms, soaked in 2 cups hot water for 10 minutes", "¼ cup extra virgin olive oil", "5 garlic cloves, thinly sliced", "1½ pounds ground veal shoulder", "Salt and freshly ground black pepper", "¼ cup double-concentrated tomato paste ", "1 cup dry white wine", "1 cup basic tomato sauce", "1½ pounds farfalle pasta", "8 ounces baby spinach, trimmed", "½ cup freshly grated Pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the porcini, reserving the soaking liquid, and coarsely chop the porcini. Strain the soaking liquid through a fine mesh sieve, and set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat the olive oil over medium-high heat. Add the garlic and cook until it is lightly toasted. Add the veal and the chopped porcini, and cook, stirring, over medium-high heat until the meat is well browned, about 10 minutes. Season with salt and pepper to taste, and add the tomato paste. Cook over high heat, stirring constantly, until the paste turns a rust color, 5 minutes. Then add the wine and 1 cup of the strained porcini soaking liquid, and cook for 5 minutes, until the wine has almost completely evaporated. Add the tomato sauce and reduce the heat to a very low simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 8 quarts of water to a boil in a large spaghetti pot, and add 2 tablespoons salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the farfalle into the water and cook for 1 minute less than the package instructions indicate. Just before the pasta is done, carefully ladle ¼ cup of the cooking water into the veal mixture. Stir the baby spinach into the veal mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta in a colander, and add it to the veal mixture. Toss over medium heat for about 30 seconds, until the pasta is nicely coated. Pour into a warmed serving bowl and serve immediately, with the grated pecorino on the side.</p>"}]}