{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20100215-apple-butter-swirl-bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["apple", "apple butter", "bread baking", "breads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bread Baking: Apple Butter Swirl Bread", "link": "https://www.seriouseats.com/recipes/2011/02/bread-baking-apple-butter-swirl-bread-recipe.html", "description": "The resulting bread had a nice soft crumb, even between the closest swirls, with none of the typical smashed flat sections. I'm pretty pleased with this method. <strong>This is a great breakfast bread</strong> and makes an interesting grilled cheese sandwich, as well.", "totalTime": "3 hours", "recipeYield": "1 loaf", "recipeCategory": ["Apple", "Bread", "Bread Baking", "Breakfast and Brunch", "Breakfast Sweets"], "recipeIngredient": ["1 cup warm water", "2 tablespoons honey", "2 1/4 teaspoons instant yeast", "13 1/2 ounces (about 3 1/2 cups) bread flour", " 1 1/2 teaspoons salt", "4 tablespoons unsalted butter at room temperature", "1/2 cup apple butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, combine water, honey and yeast and set aside until frothy, about 10 minutes. Add the bread flour and knead with the dough hook until it is smooth and elastic. It will seem a bit dense, but the butter will add moisture, so don't be tempted to add more water. Add the salt and butter and continue kneading until the butter and salt are completely incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the bowl, form it into a ball, drizzle with olive oil, and return it to the bowl. Turn it to coat completely with olive oil, and cover the bowl with plastic wrap. Set aside to rest until doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to the middle position and preheat the oven to 325°F. Spray an 8-inch loaf pan with baking spray and sprinkle some cornmeal on the bottom. When the dough has risen, flour your work surface and turn out the dough. Without mashing it down too much, stretch into an 8- by 16-inch rectangle. Spread the apple butter on the dough leaving a 1-inch uncovered border on one short end. Roll up the dough, jelly roll style towards that uncovered end. Seal the seam and sides, and place the dough seam-side down, in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan with plastic wrap and set aside until doubled in size, about 30 minutes. When the dough has doubled, slash the top of the dough and bake at 325 degrees until nicely browned and the loaf sounds hollow when tapped on the bottom, about 35 minutes. Remove the bread from the pan and let cool completely on a rack before slicing.</p>"}]}