{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110215SalmonAsparagusEnCroute.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French", "French in a Flash", "puff pastry", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "French in a Flash: Salmon en Croûte with Rosemary and Asparagus", "link": "https://www.seriouseats.com/recipes/2011/03/french-in-a-flash-salmon-en-croute-with-rosemary-and-asparagus-recipe.html", "description": "The French version of the \"complete meal in a box\" is the <strong>en croûte</strong> (\"in crust\"). Consider puff pastry your packing material. Then pack everything you need for your meal&mdash;your protein, your vegetable, your sauce&mdash;inside, with the package doubling as your carb. Foolproof. Genius, even.", "totalTime": "50 minutes", "recipeYield": "4", "recipeCategory": ["French", "Salmon"], "recipeIngredient": ["16 medium-stalked asparagus (about 3/4 pound), trimmed and peeled", "1/2 teaspoons chopped fresh rosemary", "1 clove garlic, grated", "2 tablespoons crème fraîche", "1 teaspoon zest from 1/4 lemon", "2 sheets (1 box) frozen puff pastry, thawed but very cold", "2 1/2-pound boneless, skinless salmon fillets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.  Bring a pot of water to boil, and salt the water.  Drop the asparagus in the boiling water and cook for 2 minutes.  Transfer the asparagus to an ice bath, and cool completely.  Dry on a paper towel, then slice into thin coins on a bias.  Mix the asparagus pieces with rosemary, garlic, crème fraîche, and lemon zest in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unfold both sheets of puff pastry, and lay them separately on a counter or cutting board.  Place one piece of salmon on one side of each sheet of puff pastry.  Top each salmon fillet with half the asparagus mixture.  Then, fold the pastry over the salmon, and press the pastry together to form a seal.  Trim any pastry border in excess of 1 inch, and then crimp the edge of the pastry.  Cut 2 or 3 steam vents in the top of the pastry, and place the two parcels on a parchment-lined rimmed baking sheet.  Bake until puffed and golden, about 35 minutes. Slice each parcel in half, and serve immediately.</p>"}]}