{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/08152011-166329-cupcake-500x375-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "cupcakes", "Dorie Greenspan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Dorie Greenspan's Double Chocolate Cupcakes", "link": "https://www.seriouseats.com/recipes/2011/08/dorie-greenspans-double-chocolate-cupcakes.html", "description": "This is a more grown-up version of the modern cupcake. It's not too sweet, with super-moist chocolate cake that contains semisweet chocolate and cocoa powder, and a luscious, ganache frosting on top. The recipe is from Dorie Greenspan's <em>Baking: From My Home to Yours</em>, a book that inspired me to learn to bake and eventually \"go pro\". I love topping them with <a href=\"http://www.seriouseats.com/recipes/2011/08/how-to-make-spun-sugar-recipe.html\">spun sugar</a> for birthday celebrations.", "totalTime": "1.5 hours", "recipeYield": "12", "recipeCategory": ["Cakes"], "recipeIngredient": ["1 cup all-purpose flour", "1/4 cup cocoa powder", "1/4 teaspoon baking soda", "1/4 teaspoon baking powder", "8 tablespoons unsalted butter, at room temperature", "3/4 cup sugar", "1 egg", "1 egg yolk", "1/2 teaspoon vanilla extract", "1/2 cup buttermilk", "2 ounces bittersweet chocolate, melted and cooled", "3 ounces bittersweet chocolate, coarsely chopped", "1 tablespoon confectioner's sugar", "2 tablespoons cold, unsalted butter, cut into 6 pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting ready:</strong> Center a rack in the oven and preheat to 350 degrees Fahrenheit. Fit the 12 molds of a muffin tin with paper muffin cups. Place on a baking sheet and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the cupcakes:</strong> Whisk together flour, cocoa powder, baking soda, baking powder, and salt. Set aside. Working with a stand mixer or a hand mixer and a large bowl, beat the butter at medium speed until soft and creamy. Add the sugar and beat for two minutes, until it is blended into the butter. Add the egg, then the yolk, beating for 1 minute between each addition and scraping down the sides of the bowl as needed. Beat in the vanilla, then reduce the mixer speed to low and add half the dry ingredients, mixing only until they disappear. Scrape down the bowl and add the buttermilk, mixing until incorporated, then mix in the remaining dry ingredients. Scrape down the bowl, add the melted chocolate, and mix it in by hand with a rubber spatula. Divide the batter evenly into the prepared molds. Bake for 22 - 25 minutes, or until the tops of the cakes are springy and a tester inserted in the centers comes out clean. Transfer the muffin pan to a cooling rack and allow the cakes to cool for 5 minutes before unmolding them. Cool to room temperature before glazing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the glaze: </strong>Melt the chocolate in a heatproof bowl over a saucepan of simmering water.Transfer the bowl to the counter and allow it to sit for five minutes. Stir in sifted confectioner's sugar, followed by pieces of cold butter. Stir until the butter completely disappears into the chocolate. Use a small spatula to spread the glaze on the cupcakes or dip them if the glaze seems very thin (if you'd prefer, allow the glaze to cool more, then spread.)</p>"}]}