{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110920-171381-creme-brulee-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["Crème Brûlée", "custards"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "2"}, "name": "Vanilla Bean Crème Brûlée", "link": "https://www.seriouseats.com/recipes/2011/09/vanilla-bean-creme-brulee-recipe.html", "description": "This classic preparation of crème brûlée highlights the simple, subtle flavors of vanilla bean and burnt caramel. Be careful when applying the torch; the aim is to melt the sugar as much as possible before allowing it to burn and caramelize.", "totalTime": "6 hours", "recipeYield": "8", "recipeCategory": ["Desserts", "Puddings and Custards"], "recipeIngredient": ["1 quart heavy cream", "1 vanilla bean, pod split, seeds scraped", "1 cup sugar, divided, plus more for the bruleed tops", "6 egg yolks", "pinch of salt", "very hot water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325 degrees Fahrenheit. Whisk the yolks, 1/2 cup sugar, and the salt together for 2 minutes, until it is slightly foamy and lightened in color. In a medium sized saucepan, combine cream, the pod and seeds of the vanilla bean, and 1/2 cup of the sugar. Bring to a boil, then remove from heat and allow it to steep for 15 minutes. Remove the vanilla bean pod after steeping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a large roasting pan by lining the bottom with a cotton dishtowel. Place the ramekins on top, spaced apart. Pour the hot water carefully into the pan, taking care not to splash any into the ramekins. Fill the pan so the ramekins are submerged 2/3 of the way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly temper the egg mixture with the cream mixture and whisk well. Strain the mixture into a container with a pouring spout. Evenly divide the liquid into the ramekins, taking care not to splash custard on the sides. Cover the top of the pan tightly with foil and bake for 20 minutes, rotating halfway through. After 20 minutes, pull back the foil and begin checking the ramekins by gently shaking them. The custard should be set a bit around the edges and jiggly in the center. If they are not done, return them to the oven with the foil over them and check frequently. As soon as they are done, remove the ramekins from the hot water and place on a rack to cool for 20 minutes, then chill completely in the fridge for 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle sugar on top of the chilled custards. Swirl and shake the ramekins gently to create an even coating of sugar, just shy of 1/16 inch thick. Light the torch and slowly bring it toward the surface of the custard, stopping at the point where the sugar just begins to melt. Circle the outer edge at that level until the melted sugar begins to darken. Move the torch towards the center, which will smoke and even catch on fire. Finish by touching up light areas with the torch. Serve immediately.</p>"}]}