{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201105016-152221-blackberry-and-summer-apple-pie.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Andrea Reusing", "apple", "blackberries", "Cook the Book", "Cooking in the Moment", "fruit pies", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Blackberry and Summer Apple Pie", "link": "https://www.seriouseats.com/recipes/2011/05/blackberry-and-summer-apple-pie-recipe.html", "description": "Tart, seedy little blackberries are mixed with slices of crisp apple and baked in a crumbly, lightly sweet cornmeal crust. It's that great sort of juicy, oozy pie where the filling leaks out, making for little bits of caramelized crust around the edges.  Since the crust has a bit of sugar in it you can hold back on oversweetening the filling and give the berries and apples a chance to cook down and release their natural sugar", "totalTime": "3 hours", "recipeYield": "10 to 12", "recipeCategory": ["Apple", "Bake the Book", "Cook the Book", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Cornmeal Crust:</strong>", "2 cups all-purpose flour", "⅔ cup stone-ground cornmeal ", "3 tablespoons confectioners’ sugar", "1 teaspoon kosher salt ", "1¼ cups (2½ sticks) unsalted butter, cut into pieces, cold ", "5 to 7 tablespoons ice water", "<strong>For the Filling:</strong>", "4 cups fresh blackberries", "1 large or 2 small tart summer apples or Granny Smith, unpeeled, cored, and sliced into ¼-inch slices (2 cups)", "1 cup granulated sugar, depending on the tartness of the fruit", "3 tablespoons powdered tapioca or cornstarch", "1 teaspoon fresh lemon juice", "Pinch of kosher salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, cornmeal, confectioners’ sugar, and salt in a bowl and mix with a spatula. Using a pastry cutter or two knives, cut in the butter. (Alternatively, you can use a food processor.) The butter chunks should vary from pea-size to quarter-size. Drizzle in 5 tablespoons ice water and stir with the spatula. Add another tablespoon or so of ice water if the mixture seems too dry. The dough should not be coming together too much at this point. Next, dump the mixture onto a clean work surface, and using the floured heel of your hand, smear the dough to incorporate. Gather up the dough and do this once or twice more, just until it comes together and you can see streaks of butter throughout. Divide the dough in half and form into 2 loose balls. Wrap them in plastic wrap and press down to flatten the dough into two ½-inch thick disks. Refrigerate for a couple of hours or overnight, until well chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from the refrigerator and allow to sit at room temperature for 10 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all the filling ingredients in a bowl and let sit while you roll out your pie crust. Using a rolling pin on a lightly floured surface, roll each disk to ⅛-inch thickness. Line a 9-inch pie tin with one round of dough, add the filling, and cover with the other round of dough. Crimp the edges with a fork or pinch them with your fingers to seal, removing any excess dough. Cut about five vents around the top of the pie to allow the steam to escape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pie in the lower third of the oven for 30 minutes. Then reduce the oven temperature to 350ºF, slip a baking sheet underneath the pie tin to catch any bubbling juices, and bake for another 30 to 45 minutes. The pie crust should be nice and browned and the juices should be bubbling through the vents. Pull the pie out and let it cool before cutting.</p>"}]}