{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111122-180525-nasty-bits-turkey-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["confit", "gizzards", "hearts", "The Nasty Bits", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Turkey Confit with Olive Oil", "link": "https://www.seriouseats.com/recipes/2011/11/turkey-confit-with-olive-oil-recipe.html", "description": "Olive oil is a great fat with which to confit. The flavor of meat confited in olive oil tends to be a little lighter than meat cooked in duck fat and certainly lard, but the real advantage of confiting in olive oil is that you don't have to track down good-quality animal fat. Any bottle of olive oil will do and after you have used the oil to confit the meat, you can use it again to roast your vegetables.", "totalTime": "4 hours cooking plus overnight salting", "recipeYield": "serves 4 to 6", "recipeCategory": ["Mains", "Offal", "The Nasty Bits", "Turkey"], "recipeIngredient": ["One turkey, cut up into wings, thighs, and gizzards and heart, about five pounds", "2 teaspoons kosher salt per pound of meat", "1 onion, diced", "Crushed black pepper", " ", "<strong>For confiting:</strong>", "4 cups olive oil, or enough to completely cover the meat", "1 head of garlic, the ends cut off to expose the cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large nonreactive mixing bowl, toss the turkey parts with the salt, pepper, and onion. Cover tightly and refrigerate overnight, up to twenty-four hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, rinse the turkey under cold running water and place all the parts in a medium ceramic or enameled cast iron pot. Try to fit the parts in a single layer. Pour on the oil and and make sure that all the parts are covered. Set the pot over very heat and cook until the oil comes to a simmer, about 30 minutes. Turn the heat down even more and continue simmering over very low heat on the stovetop for 2.5 to 3 hours, until the turkey is tender. Take care that the oil does come to a more vigorous simmer. The turkey parts should be pale and soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When parts are cooked, turn off the heat and let the turkey parts and the oil cool down in the pot. When sufficiently cool, cover the pot and transfer it to the refrigerator. Make sure the parts are completely covered by the oil&mdash;if not, pour on more olive oil until everything is submerged.  The meat will hold in the refrigerator for several weeks.</p>"}]}