{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110627_chile-vodka.jpg", "author": {"@type": "Person", "name": "Heather Arndt Anderson"}, "recipeCuisine": "", "keywords": ["bloody mary", "brunch drinks", "chiles", "infusions", "tomato", "tomato water", "vodka"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tomato Water and Chili Vodka (Not-So-Bloody Mary)", "link": "https://www.seriouseats.com/recipes/2011/07/tomato-water-chili-vodka-not-so-bloody-mary-brunch-drink-recipe.html", "description": "A daintier, more delicate Bloody Mary, made with tomato water and hot pepper vodka.", "totalTime": "2 days", "recipeYield": "serves 2", "recipeCategory": ["Tomato", "Vodka"], "recipeIngredient": ["750 mL vodka", "10-12 small chilies, such as bird's eye, washed and split lengthwise", "1 pound ripe tomatoes, cores removed, cut into rough chunks", "Ice", "Salt and freshly ground black pepper", "Garnish: pickled green beans, okra, asparagus, etc."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vodka and chilies to a quart-sized jar, affix lid and shake. Store jar at room temperature for two days to infuse. Strain vodka into bottle and discard chilis. Taste and dilute with plain vodka as necessary to suit your palate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a fine mesh strainer with triple layer of cheesecloth or a large tea bag (available at Chinese groceries or in tea stores) and set strainer over large bowl. Place tomatoes into jar of blender or food processor. Blend until finely pureed, about 30 seconds. Transfer puree to lined strainer. Set in refrigerator and allow to drain for at least a few hours or up to overnight. You should end up with about 1 cup tomato water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a glass or Mason jar with ice, pour in an ounce and quarter of the pepper vodka, and four ounces of the tomato water. Season to taste with salt and pepper and stir. Garnish with skewered pickled vegetables, such as green beans, okra, or olives. Serve.</p>"}]}