{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110816mainblizzardf.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["ice cream", "milkshakes", "oreos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Oreo 'Blizzards'", "link": "https://www.seriouseats.com/recipes/2011/08/how-to-make-your-own-oreo-blizzards-like-dairy-queen-homemade-recipe.html", "description": "Use the crappiest milk, cream and eggs you can find. Bottom shelf. Good quality dairy and eggs have a wonderful flavor and color that will shine through and, I'm horrified to say, that's not what we're going for here.", "totalTime": "24 hours", "recipeYield": "two 16 ounce \"Blizzards\"", "recipeCategory": ["Ice Cream and Frozen Treats", "Milkshake"], "recipeIngredient": ["8 ounces whole milk", "12 ounces heavy cream", " 1 Tahitian vanilla bean, split and scraped; seeds reserved", "1 1/2 ounces egg yolks (from between 2-3 eggs)", "7 ounces sugar", "1/2 teaspoonn salt ", "1 1/4 ounce Frangelico", "6 ounces of your favorite mix-in, like <a href=\"http://sweets.seriouseats.com/2011/08/meet-the-fauxreo-how-to-make-oreos-homemade.html\">Fauxreos</a>, candy, or cookie dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the ice cream base: In a medium pot, bring the milk and cream to a simmer together with the vanilla bean. When the mixture begins to simmer, shut off the heat and cover with a lid. Steep for one hour, or as long as 24. If you plan to steep it for longer than 4 hours, stash the pot in the refrigerator. </p>\r\n\r\n<p>Meanwhile put the egg yolks in a medium bowl and whisk sugar in gradually. It's a lot of sugar, so don't dump it in all at once or it will be difficult to incorporate. Whisk in salt. </p>\r\n\r\n<p>Return dairy to a simmer and fish out the vanilla bean. Use a spatula to scrape out the heavily flavored cream from inside the pod. Set the bean aside for another use or discard.</p>\r\n\r\n<p>Now whisk some of the hot cream into the egg yolks, one ladle-full at a time, until egg mixture is quite warm. Then whisk egg mixture into the pot of cream. Turn heat to medium low. Stir constantly with a rubber spatula, making sure to scrape all along the bottom of the pot to avoid curdling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Normally, ice cream recipes entreat you to cook until the mixture is \"thick enough to coat the back of a wooden spoon,\" but with this recipe, that will never happen. Instead, cook until a thermometer registers 145° F. When it does, immediately shut off the heat and strain the custard through a sieve and into a large bowl. Stir in Frangelico. Cool in an ice bath and refrigerate, covered, overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare mix-ins: in the case of Oreos or other cookies, you may simply put them into a heavy duty zip top bag and smash them with a rolling pin. </p>\r\n\r\n<p>Large candies, like Reese's Cups or Snickers Bars will need  to be chopped with a knife. Sticky mix ins, like cookie dough, need to be portioned into bit sized chunks with your fingers. Small candies like M&Ms may be stirred in as-is.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finishing the Blizzard: Process chilled ice cream base in ice cream maker according to manufacturer's directions; take care not to over-churn. The base contains an incredible amount of cream and if neglected it will happily turn into frozen butter.</p>\r\n\r\n<p>You'll know the ice cream is ready when it has a familiar Blizzard-like body. When the ice cream has finished churning, stir in your mix-in(s) of choice with a rubber spatula and immediately divide into two 16 ounce portions.</p>\r\n\r\n<p>The Blizzard is best enjoyed immediately, preferably with a bright red spoon.</p>"}]}