{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110131-134876-ghogcut.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "Groundhog Day", "holiday"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Groundhog Day Cake", "link": "https://www.seriouseats.com/recipes/2011/01/cakespy-groundhogs-day-cake-recip.html", "description": "My family has an unusual tradition: <strong>we celebrate Groundhog Day</strong>. In a completely non-ironic way. And to herald the occasion, there is always a cake-homage to the skittish little critter.", "totalTime": "45 minutes (does not include time for baking and cooling cake)", "recipeYield": "8", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["1 9 or 10-inch round chocolate cake", "2 cups chocolate frosting of your choice", "2 chocolate chips", "2 slivered almonds", "1 square chocolate (I used a piece of a Hershey's chocolate bar)", "1-2 strips uncooked pasta, for whiskers (I used chocolate pasta)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake your favorite chocolate cake recipe in a round pan; let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Level the cake by cutting off the top, so that you have a flat cake top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the cake in half, the way you'd cut a sandwich, so that you have two half-moon pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread a dollop of frosting on top of one of the cake halves; use this to adhere the second half to the first. Set them on your decorating surface, flat sides down, so that you have one large half moon shaped mound of cake. This will form the groundhog's body.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, shave off part of the cake on either side that you deem the \"front\", so that the front of the cake comes to a gentle point (this will be the Groundhog's snout).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply a very light crumb coat of frosting to your cake, and let it chill for about 20 minutes so the crumb coat can set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost the prepared cake on all sides. It will look vaguely like a big chocolate frosted football with only one pointed end.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, cut your chocolate square into a small triangle. Adhere this about an inch and a half above the bottom of the \"snout\".</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break your pasta into pieces: you'll need 4-6 strips that measure approximately 3-4 inches long, for whiskers, and three strips that measure approximately one inch, for the mouth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the longer strips of pasta on either side of the nose, to form whiskers. You'll want to put 2-3 whiskers on either side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the smaller pieces of pasta below the nose, one aligned vertically downward, and at the bottom of this piece, the two others, aligned either horizontally or so that they form a \"v\" pointing upward toward the nose. Now you have the full snout! This could also be done with writing icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Above the nose, place one chocolate chip on either side of the face, to form eyes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slightly above the eyes and slightly further out from the center of the face, press the slivered almonds in either side of the groundhog's face to form little ears.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, cut pieces left over from leveling the chocolate cake into little triangles and adhere to the sides of the cake to form little feet and a tail.</p>"}]}