{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111018-127355-dinner-tonight-chicken-lemongrass-curry.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Vietnamese", "keywords": ["curry", "Dinner Tonight", "poultry", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Chicken, Lemongrass, and Potato Curry (Ca-Ri Ga)", "link": "https://www.seriouseats.com/recipes/2011/10/dinner-tonight-chicken-lemongrass-and-potato-curry-ca-ri-ga-recipe.html", "description": "I was sold on this recipe from <em><a href=\"http://www.amazon.com/Into-Vietnamese-Kitchen-Treasured-Foodways/dp/1580086659/?tag=serieats-20\">Into the Vietnamese Kitchen</a></em> the moment after I read the first step. That's where author Andrea Nguyen describes watching the \"whirling blizzard\" of lemongrass in the food processor as it transforms from chopped stalks into a \"fine, fluffy mass.\" Sure enough, the lemongrass puffs up sort of like cotton candy, before eventually turning into a paste when you add the onion and ginger. Theatrics aside, it's really just a fragrant base for a dish that is far more comforting than I had expected.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Dinner Tonight", "Vietnamese"], "recipeIngredient": ["3 to 4 hefty lemongrass stalks, trimmed and coarsely chopped (about 2/3 cup total)", "1-inch piece fresh ginger, peeled and chopped", "1 yellow onion, chopped ", "2 tablespoons canola oil ", "2 tablespoons Madras curry powder (or other curry powder)", "1/2 teaspoon dried red chile flakes", "1 1/2 teaspoons salt", "1/2 teaspoon black pepper", "One 13 1/2-ounce can coconut milk ", "2 1/2 pounds bone-in chicken thighs, skin removed ", "1 1/2 pounds red potatoes, peeled and cut into 1-inch chunks", "1 lime, cut into wedges  ", "Handful cilantro  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the chopped lemongrass into a food processor. Process until it turns into a \"fine, fluffy mass,\" scraping the sides with a spoon occasionally, about three minutes. Add the ginger, and pulse until it is chopped finely. Then add the onion. Process, scraping the sides with a spoon occasionally, until it is a paste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large saucepan set over medium heat. When shimmering, add the lemongrass paste. Cook, stirring often with a wooden spoon, until very fragrant, about two minutes. Add the curry powder and red chiles flakes, stir well, and cook for a minute. Add the salt, pepper, and coconut milk. Stir well with the wooden spoon, and then add the chicken pieces. If the liquid does not cover the pieces add a little bit of water to do so. Once liquid starts to boil, reduce heat to maintain a slow simmer. Cook, uncovered, for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the potatoes, stir well, and turn heat up again to bring to a strong simmer. Then reduce heat to maintain a bare simmer, and cook until the potatoes are tender, 15 to 20 minutes. When done, turn off the heat, cover the saucepan, and let rest for as long as you can stand it. (The recipe advocates 30 minutes, but I dug in after five.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the dish with the lime wedges, cilantro, and white rice.</p>"}]}