{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110807-164644-preserved-plum-conserve-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["conserve", "Jam", "plums", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Plum Conserve", "link": "https://www.seriouseats.com/recipes/2011/08/preserved-plum-conserve-recipe.html", "description": "This conserve is bursting with juicy, ripe plums, sweet golden raisins, and crunchy walnuts. Try it over ice cream, stirred into yogurt, or as a sweet accompaniment to grilled meats.", "totalTime": "One hour 30 minutes", "recipeYield": "Makes about 7 half-pints", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Edible DIY", "Plum"], "recipeIngredient": ["3 pounds fresh, ripe plums", "4 cups granulated sugar", "Zest and juice of one medium orange", "Zest and juice of one lemon", "1 1/2 cups golden raisins", "1 cinnamon stick", "1 cup chopped walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the conserve, prepare the jars and lids: place six half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pit and slice the plums. Transfer them to a food processor and pulse a few times until they are coarsely chopped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chopped plums to a large, heavy-bottomed pot. Add the sugar, orange zest and juice, lemon zest and juice, raisins, and cinnamon stick. Clip a candy thermometer to the side of the pot. Bring to a boil over medium-high heat and cook, stirring frequently, until the mixture thickens and reaches the gel stage (220°F), about 45 minutes. Stir in walnuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot conserve into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. <br />\n</p>"}]}