{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110823CampanelleEggplantCaviar.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["condiments", "French", "French in a Flash", "pastas", "sauces", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French in a Flash: Campanelle with Eggplant Caviar", "link": "https://www.seriouseats.com/recipes/2011/08/french-in-a-flash-campanelle-with-eggplant-caviar-recipe.html", "description": "For this pasta dish, I purée roasted garlic, basil, and a touch of chili with the eggplant, and toss it over trumpets of campanelle pasta, studded with toasted pine nuts and laced with strings of fresh basil. Since eggplant is in season in the late summer, along with basil, now is the time when this dish is cheapest and best. Don't waste another second!", "totalTime": "1 hour 15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dairy-Free", "French", "Pasta", "Vegan", "Vegetarian"], "recipeIngredient": ["2 pounds eggplant (about 2 large eggplant)", "Kosher salt", "1 head garlic", "4 tablespoons olive oil, divided, plus more for garnish", "2 teaspoons white wine vinegar", "10 leaves basil, plus more for garnish", "A pinch of chili flakes", "Freshly cracked black pepper", "1 pound campanelle pasta", "1/4 cup pine nuts, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 500&deg;F. Cut the tops off the eggplant, and cut the eggplant in half lengthwise. Sprinkle the cut surfaces of the eggplant with 1/4 teaspoon of salt, and leave in a large colander in the sink to drain for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the top fifth off the head of garlic, and wrap the garlic tightly in foil. Place the garlic in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the garlic has been in the oven and the eggplant has drained for 30 minutes, pat the eggplant dry and toss the eggplant halves with 1 tablespoon olive oil. Place the eggplant cut side down on a parchment-lined baking sheet. Place the eggplant with the garlic in the oven, and roast for 30 minutes (the garlic will roast for a total of 1 hour), until the eggplant flesh is completely soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil for the pasta. Once the eggplant and garlic have come out of the oven, scoop the flesh away from the skin of the eggplant, and place the flesh in a mesh colander over the sink to remove any excess liquid. Squeeze the roasted garlic into a food processor, and add the drained eggplant. Add 3 tablespoons of olive oil, the vinegar, basil, chili flakes, and salt and pepper to taste. Run the machine until the eggplant mixture is smooth and velvety. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta until just al dente, and reserve a cup of pasta water before draining. Add the pasta back to the pot, and add the eggplant caviar, a half a cup at a time, until you’ve dressed the pasta thoroughly, but lightly. You may add some of the reserved pasta water, spoonful by spoonful, to thin out the sauce if necessary. Put the hot pasta in a big bowl, and top with the pine nuts, ribbons of fresh basil, and an extra drizzle of olive oil. Serve right away, next to grilled fish, or on its own.</p>"}]}