{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110413-147212-caramelized-onion-dip-with-thick-cut-chips.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chip", "Cook the Book", "dips", "holiday dips", "Michael Schwartz", "Michael's Genuine Food", "onion dip", "potato chips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Caramelized Onion Dip with Thick-Cut Potato Chips", "link": "https://www.seriouseats.com/recipes/2011/04/caramelized-onion-dip-with-thick-cut-potato-chips-recipe.html", "description": "One of the first things I heard upon receiving my copy of <strong><em><a href=\"http://www.amazon.com/Michaels-Genuine-Food-Down-Earth/dp/0307591379/serieats-20\">Michael's Genuine Food</a></em></strong> was that I <em>needed</em> to try <a href=\"http://www.michaelsgenuine.com/\">Michael Schwartz</a>'s <strong>Caramelized Onion Dip with Thick-Cut Potato Chips</strong>.  It was, of course, a no-brainer since I'm a huge <a href=\"http://www.seriouseats.com/recipes/2011/01/real-french-onion-dip-recipe.html\">onion dip</a> fan (even the dehydrated soup packet kind).", "totalTime": "30 minutes", "recipeYield": "About 2 cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book"], "recipeIngredient": ["<strong>For the Caramelized Onion Dip:</strong>", "2 tablespoons extra-virgin olive oil", "1 tablespoon unsalted butter", "2 large onions (about 1 1/2 pounds), thinly sliced", "Kosher salt and freshly ground black pepper", "4 ounces cream cheese, at room temperature", "1/2 cup sour cream", "1/2 cup quality store-bought mayo", "Chopped fresh chives", "<strong>For the Thick-Cut Potato Chips:</strong>", "2 large russet (baking) potatoes (about 1 pound), scrubbed", "Canola oil, for frying ", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Caramelized Onion Dip:</strong> Put a large skillet over medium heat and add the oil and butter. When the butter has melted, add the onions and season with 1/2 teaspoon salt and 1/4 teaspoon pepper. Cook, stirring occasionally, until the onions are a deep golden brown and caramelized, roughly 20 minutes. Watch carefully—you don’t want the onions to burn. Set aside and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat the cream cheese on low speed for 1 minute just until smooth and free of lumps. Mix in the sour cream and mayo. Fold in the onions with all their juices; season again with salt and pepper if needed. Cover and refrigerate for at least 2 hours or up to 2 days. Bring to room temperature before serving, garnished with chives, with a bowl of chips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Thick-Cut Potato Chips:</strong> Using a mandoline, slice the potatoes about the thickness of a nickel. You<br />\nshould get about 50 slices per potato. Put the slices in a large bowl and fill with cool water to cover. Swish the potatoes around to remove the excess starch; this will make the chips really crispy. Change the water 2 or 3 times until the water is no longer cloudy. Drain the potatoes well in a colander, then spread them out on a pan and pat dry with paper towels. This will prevent the oil from spattering from excess moisture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 inches of oil to 350°F in a countertop electric fryer or deep pot. If<br />\nyou don’t have a deep-fry thermometer, a good way to test if the oil is hot<br />\nenough is to stick the end of a wooden spoon or chopstick in it. If bubbles<br />\ncircle around the end, then you’re good to go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potato slices in a fryer basket or spider strainer and carefully lower into the hot oil; do this in batches to avoid overcrowding and to keep the oil temperature constant. Give the potatoes a stir to keep them from sticking together. Fry the chips for 7 to 8 minutes, until they are golden brown and crispy. Remove the chips with the spider, allowing some of the excess oil to drain off, and set on a paper towel–lined platter. Season lightly with salt while the potato chips are still hot.</p>"}]}