{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110304-140309-duck-fat-caramel-ice-cream.JPG", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["caramel", "duck", "duck fat", "frozen desserts", "ice cream", "savory desserts", "soy sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Scooped: Duck Fat Caramel Soy Sauce Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/03/duck-fat-salted-caramel-soy-sauce-ice-cream-recipe.html", "description": "If this sounds like something up your alley, you can look forward to what may be the richest caramel you will ever eat. Besides adding complex flavor, the duck fat lets the caramel linger on the tongue long after the ice cream is gone. Soy sauce works surprisingly well with caramel, drawing out its buttery qualities.", "totalTime": "50 minutes, plus an overnight chill", "recipeYield": "10-12 (makes about 1 quart)", "recipeCategory": ["Desserts", "Duck", "Ice Cream and Frozen Treats", "Other Meats"], "recipeIngredient": ["1 1/2 cups sugar", "3 cups half-and-half (or 1 1/2 cups each cream and whole milk)", "6 egg yolks", "3 tablespoons duck fat", "3 tablespoons high quality soy sauce", "1 1/2 teaspoons vanilla extract", "Nutmeg, freshly grated, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy 3 quart saucepan, combine sugar with just enough water to barely moisten it. Place on high heat and let sugar melt and begin to caramelize. As sugar caramelizes, the bubbles will shrink and pile on each other. The caramel is nearly ready when bubbling significantly slows and the syrup is the color of an old penny, a dark amber. Do not stir the pot at this point. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Caramel will begin to smoke; let it for three seconds and then stir in half-and-half and turn off heat. If caramel seizes, heat on low and stir till dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together egg yolks, duck fat, and soy sauce till thoroughly combined. Ladle in about 1/3 of the caramel mixture, whisking constantly, to temper eggs. Then return egg mixture to saucepan. Heat custard on low, stirring frequently, until custard coats the back of a spoon and a finger swipe leaves a clean line. Remove from heat, stir in vanilla, and transfer to an airtight container. Chill overnight in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Custard may curdle slightly overnight. Pour through a fine-mesh strainer into an ice cream maker and churn according to manufacturer instructions. Chill in a cold freezer, 3 hours for a soft serve and 8 to 12 for a firmer ice cream. Sprinkle with a pinch of freshly grated nutmeg just before serving. Ice cream will melt quickly once scooped.</p>"}]}