{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111221-184769-stuffed-veal-breat-with-prunes-and-chicken-livers.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Kosher", "keywords": ["Arthur Boehm", "Cook the Book", "Geila Hocherman", "hanukkah", "hanukkah mains", "Kosher Revolution", "veal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kosher Revolution's Stuffed Veal Breast with Chicken Livers and Prunes", "link": "https://www.seriouseats.com/recipes/2011/12/stuffed-veal-breast-with-chicken-livers-prunes.html", "description": "Brisket is an old standby when it comes to Jewish holiday celebrations but after testing out this <strong>Stuffed Veal Breast with Chicken Livers and Prunes</strong> from <em><strong><a href=\"http://www.amazon.com/Kosher-Revolution-Techniques-Recipes-Unlimited/dp/1906868530/?tag=serieats-20\">Kosher Revolution</a></strong></em> we'd seriously consider retiring it. There's something about a big, bone-in roast stuffed with a rich filling of livers and prunes that just feels like a special occasion.  It's big, regal in presentation, and tastes like the holidays.", "totalTime": "4 hours", "recipeYield": "serves 6", "recipeCategory": ["Beef", "Cook the Book", "Kosher"], "recipeIngredient": ["<strong>For the Stuffing:</strong>", "1/2 ounce dried porcini", "2 tablespoons grapeseed or canola oil", "3 shallots, minced", "8 ounces chicken livers", "8 ounces prunes, chopped", "1 teaspoon salt", "1/2 teaspoon white pepper", "3 tablespoons minced fresh sage, or 1 tablespoon dried", "1/4 cup port", "1 1/2 cups breadcrumbs", "2 large eggs", "6 tablespoons grapeseed or canola oil", "2 celery stalks, finely chopped", "2 carrots, peeled, finely chopped", "1 large onion (about 12 ounces), finely chopped", "3 sprigs thyme", "1 bay leaf", "8 black peppercorns", "5 garlic cloves, crushed with the flat of a knife", "3 tablespoons all-purpose flour", "1 1/2 cups white wine", " ", "One 5- to 7-pound veal breast, bone in, with pocket", "Kosher salt", "4 cups veal, beef, or chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First make the stuffing: In a small bowl, combine the porcini with 1 cup<br />\r\nboiling water and soak until soft, about 20 minutes. Strain and chop the<br />\r\nporcini. Set aside with the water.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium skillet, heat 2 tablespoons of the oil over medium heat.<br />\r\nAdd the shallots and sauté, stirring, until translucent, about 5 minutes.<br />\r\nAdd the livers, prunes, porcini, salt, pepper and sage, and sauté, stirring,<br />\r\nuntil fragrant, 2 to 3 minutes. Add the port, avert your face, and ignite<br />\r\nwith a grill lighter or match. Cook until almost all of the liquid has<br />\r\nevaporated, 4 to 5 minutes. Remove half of the prunes and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the stuffing mixture to a food processor. Combine with the<br />\r\nbreadcrumbs and eggs, and pulse until smooth. Transfer the stuffing to<br />\r\na medium bowl, add the remaining prunes and blend. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350ºF. Add 2 tablespoons of the oil to a roasting<br />\r\npan and heat until hot but not smoking. Add the celery, carrots, onion,<br />\r\nthyme, bay leaf and peppercorns, and sauté, stirring, until soft but not<br />\r\nbrown, 8 to 10 minutes. Add the garlic and sauté 2 minutes. Sprinkle with<br />\r\nthe flour and sauté, stirring, for 2 minutes. Add the wine and reduce by<br />\r\nhalf, about 5 minutes. Add the porcini liquid and simmer to blend the<br />\r\nflavors, about 5 minutes. Transfer to a medium bowl and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the veal pocket, stuff with the liver mixture, and secure the open<br />\r\nside with kitchen twine. Season the veal on all sides with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the roasting pan to the burners and heat the remaining oil over<br />\r\nmedium heat. Place the veal in the pan, and brown well, turning once,<br />\r\n15 to 20 minutes. Reduce the heat if the veal begins to burn. Position the<br />\r\nveal bone-side down and add the reserved vegetable mixture and stock.<br />\r\nBring to a boil, cover the pan tightly with foil, and bake until a bone can<br />\r\nbe easily pulled from the roast, 2 1/2 to 3 hours. Transfer the roast to a<br />\r\ncutting board, tent with foil and let rest for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, strain the pan contents through a fine-mesh strainer into<br />\r\na large measuring cup, pressing down the solids. Discard the fat. For a<br />\r\nchunky sauce, discard the herbs and return the vegetables to the sauce.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bones from the veal, carve and serve with the sauce.<br />\r\n</p>"}]}