{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110318-142353-prosecco-lemon-ginger-granita.JPG", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["desserts", "frozen desserts", "granita", "lemon", "Prosecco", "sparkling wine", "wine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scooped: Prosecco, Lemon, and Ginger Granita", "link": "https://www.seriouseats.com/recipes/2011/03/prosecco-lemon-and-ginger-granita-recipe.html", "description": "I often hear people lament their inability to make frozen desserts for lack of equipment. But nothing's quite as satisfying as pulling dessert out of the freezer at the end of a long meal&mdash;nodding, <em>yes, it</em> is <em>homemade.</em> For these occasions, we have granita, one of the easiest and most elegant desserts ever made. The ingredients couldn't be simpler, the technique no more elementary. And they wake up the palate like nothing else. No ice cream maker required.", "totalTime": "6 hours", "recipeYield": "8 to 10", "recipeCategory": ["Dairy-Free", "Desserts", "Ginger", "Ice Cream and Frozen Treats", "Lemon", "Vegan"], "recipeIngredient": ["1 cup water", "1/2 cup sugar", "1 1/2 tablespoons grated ginger, with its juice", "1/4 teaspoon kosher salt", "2 1/2 cups prosecco (recommended: Santa Margherita)", "Zest of one lemon", "5 teaspoons freshly squeezed lemon juice, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, heat water, sugar, ginger, and salt on low heat for five minutes, stirring to dissolve sugar. Remove from heat and pour into a wide, flat container like a take-out container or a baking dish. Stir in prosecco, lemon zest, and lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer container to a flat surface in the freezer. After 45 minutes, run a fork along sides of container to break up any large chunks of ice. Check on granita several times, every half-hour to an hour, gently breaking up chunks of ice with fork. Granita is ready when ice is full of large, irregular flakes with little to no liquid remaining. For best flavor and texture, serve within two days of making.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you can't stir the granita every half hour, let it freeze into a block of ice overnight. The next day, scrape it into flakes with a large fork. The texture won't be quite as light, but it'll come close.</p>"}]}