{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110815cantaloupeprimaryu.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cantaloupe", "Jam", "peaches", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cantaloupe Conserve", "link": "https://www.seriouseats.com/recipes/2011/08/preserved-cantaloupe-conserve-how-to-make-cantaloupe-jam.html", "description": "The combination of ripe peaches and floral, sweet melon make for a perfect end-of-summer treat. Try this conserve over slices of pound cake or zucchini bread, or served alongside cornbread and grilled ribs.", "totalTime": "About two hours", "recipeYield": "Makes 7 half-pints", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Peach"], "recipeIngredient": ["4 cups diced ripe cantaloupe", "4 cups chopped peeled ripe peaches", "6 cups granulated sugar", "1/4 cup freshly squeezed lemon juice", "1/4 teaspoon nutmeg", "Freshly grated zest of one small orange", "One pouch liquid pectin ", "1/2 cup coarsely chopped slivered almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the conserve, prepare the jars and lids: place six half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cantaloupe and peaches in a large, heavy-bottomed pot. Bring to a boil, then reduce heat and simmer for 20 minutes, stirring frequently and mashing the fruit with the back of a fork or spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar and lemon juice and return the mixture to a simmer. Clip a candy thermometer to the side of the pot and cook, stirring frequently, until the mixture has thickened and reduced slightly, and the thermometer reaches 220°F, about 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in nutmeg and orange zest, then stir in pectin. Bring the mixture back to a boil and boil hard for one minute. Remove the pot from the heat and skim any foam from the surface with a metal spoon. Stir in almonds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot conserve into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}