{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110824-167221-making-monkey%20bread-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["breads", "breakfast", "brioche", "brunch", "cinnamon", "Monkey Bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brioche Monkey Bread", "link": "https://www.seriouseats.com/recipes/2011/08/brioche-monkey-bread-recipe.html", "description": "Learning to make brioche dough has allowed me to delve into all kinds of new frontiers, but I think this decadent recipe for monkey bread is my crowning achievement with the dough. I've added a caramel to the mix, and turned up the spice with ginger and nutmeg. It's definitely not diet food, and it's highly addictive. It's a perfect sweet for serving at brunch with lots of people around. Making it alone is too dangerous.", "totalTime": "3 hours", "recipeYield": "8-10", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Mother's Day", "Yeast Bread"], "recipeIngredient": ["1/2 recipe <a href=\"http://www.seriouseats.com/recipes/2011/08/brioche-bread-recipe.html\">brioche dough</a>", "1 cup dark brown sugar", "1/2 cup butter", "2 tablespoons honey", "1 teaspoon salt, divided", "1 cup granulated sugar", "2 tablespoons cinnamon", "1 teaspoon powdered ginger", "1/2 teaspoon nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Proof the dough:</strong> Remove brioche dough (that has chilled overnight) from the fridge. Divide evenly into 20 pieces. Shape each piece into a ball and allow to proof on the bench for 1-2 hours in a warm place, covered loosely with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the caramel:</strong> Combine butter, honey, brown sugar, and 1/2 teaspoon salt in a small saucepan over medium heat. Whisk the mixture as the butter melts completely. Continue whisking until the sugar has melted and the caramel is homogenous. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Put it all together:</strong> Grease a loaf pan with butter and pour about 1/3 of the caramel into the bottom. Preheat the oven to 350 degrees Fahrenheit. Once the dough has proofed (the pieces should feel light, like soft, fragile pillows filled with air), combine sugar, spices, and 1/2 teaspoon salt in a large bowl. Gently toss the balls of dough, a few at a time, in the sugar mixture. Place 10 of them gently into the bottom of the prepared pan, taking care not to squeeze them too close together. Sprinkle about 1/2 of the sugar mixture over the tops, then pour 1/3 of the caramel over them. Repeat to form a second layer of dough balls and top with any remaining sugar mixture and caramel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bake:</strong> Place the pan on the center rack of the preheated oven on a sheet tray to catch any overflowing caramel. Bake for approximately 50 minutes, until the top crust is nicely browned, and a thermometer inserted in the center reads 210 degrees Fahrenheit. Cool in the pan for 20 minutes, and invert only a plate to serve. This bread is at its best if consumed shortly after baking, and may need to be placed in a 350°F oven for 10 minutes if it has cooled too much, to loosen the caramel.</p>"}]}