{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/tomato%20on%20dough.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["basil", "bread", "bread baking", "pesto", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Tomato-Pesto Swirl Bread", "link": "https://www.seriouseats.com/recipes/2011/10/bread-baking-tomato-pesto-swirl-bread-recipe.html", "description": "As you might guess, my house quite often smells like baking bread. I won't say that I'm immune to the delicious fumes, but I'm pretty used to them. Once in a while, though, some bread will have a little extra something that has me sniffing the air in anticipation. This is one of those.", "totalTime": "3 hours", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking", "Pesto", "Tomato"], "recipeIngredient": ["2 teaspoons instant yeast", "1 cup water", "1 tablespoon sugar", "2 cups (9 ounce) bread flour, divided", "1/2 cup (3 ounces) semolina flour", "1 teaspoon salt", "1 tablespoon garlic olive oil", "1 tablespoon olive oil", "3 tablespoons tomato paste", "3 tablespoons basil pesto"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the yeast, water, sugar, and 1 cup of the flour. Whisk to combine and let it rest for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the bread flour along with the semolina and salt. Knead with the bread hook until the dough is smooth and elastic. Add the garlic oil and olive oil and continue kneading until both are completely incorporated. Form the dough into a ball, drizzle with a small amount of olive oil, and return it to the bowl. Cover the bowl with plastic wrap and set aside for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface, line a baking sheet with a piece of parchment paper, and preheat the oven to 350 degrees. Turn the dough out and form it into a rough rectangle. With a rolling pin, roll it to a rectangle about 18 inches wide and 15 inches high. position it so that one of the longer sides is facing you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a pastry brush, your fingers, or the back of a spoon, spread the tomato paste on the lower half of the dough, leaving about 1/2 inch uncovered along the edges. Fold the uncovered dough over the tomato-covered dough. Now you have a piece of dough that's about 18 inches wide by 7 1/2 inches high. Use a rolling pin to flatten the folded edge and to make sure that the dough is evenly thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the pesto on the dough leaving about 1/2 inch uncovered on the far edge (the folded edge). Roll the dough up jelly-roll style, starting at the edge closest to you and moving towards the edge that you left uncovered. Don't roll it overly tightly. When you get to the far edge, seal the seam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough on the baking sheet seam-side down and adjust it so that it's evenly thick. Form it into a ring and seal the ends together. Cover with plastic wrap and set aside until it has doubled in size - about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slash the top of the loaf and bake at 350 degrees until nicely browned, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the loaf cool on a rack before slicing.</p>"}]}