{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111213-ctb-good-food-to-share-white-beans.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beans", "Cook the Book", "Good Food to Share", "Sara Kate Gillingham-Ryan", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sara Kate Gillingham-Ryan's Rosemary White Beans with Fontina", "link": "https://www.seriouseats.com/recipes/2011/12/sara-kate-gillingham-ryan-rosemary-white-beans-with-fontina-recipe.html", "description": "Beans might not be the first thing that pops into your head when you're thinking elegant entertaining, but these <strong>Rosemary White Beans with Fontina</strong> are pure cold weather magic, at home on any holiday table. The prep here is as minimal as can be: All you really have to do is remember to soak your beans for at least six hours. After that it's just a matter of throwing a few cloves of garlic into the pot along with rosemary sprigs and bay leaves.", "totalTime": "7 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cook the Book", "Sides", "Vegetarian"], "recipeIngredient": ["1 rounded cup dried cannellini beans", "3 large cloves garlic, unpeeled", "2 sprigs fresh rosemary, plus 1 1/2 teaspoons finely chopped rosemary", "2 bay leaves", "2 tablespoons extra-virgin olive oil", "1/4 pound fontina cheese, shredded", "Sea salt and freshly ground pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick over the beans and remove any grit, small pebbles, or misshapen beans. Put the beans in a colander, rinse under cold running water, and let drain thoroughly. Transfer the beans to a bowl and add tepid water to cover by 1 inch. Let soak at room temperature for at least 6 hours or up to overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the beans, rinse, and drain again. Put in a large saucepan and add fresh cold water to cover by 1 inch. Add the garlic, rosemary sprigs, bay leaves, and olive oil. Bring to a boil over high heat, then reduce the heat to maintain a low but steady simmer. Cover partially and cook until the beans are tender but not mealy, about 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off any excess cooking liquid from the beans. Remove and discard the rosemary sprigs and bay leaves. (If any rosemary leaves have fallen off the stems during cooking, you can leave them in the beans.) Squeeze the cooked garlic cloves from their skins into the beans. Stir in about three-fourths of the cheese and the chopped rosemary and season with salt and pepper. Serve right away, sprinkling the remaining cheese on top. </p>"}]}