{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110815-127355-dinner-tonight-steak-sandwich-cucumber-ginger.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chiles", "cucumbers", "mayonnaise", "sandwich", "steak", "steak sandwiches", "Tom Colicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Steak Sandwich with Cucumber, Ginger Salad, and Black Chile Mayonnaise", "link": "https://www.seriouseats.com/recipes/2011/08/steak-sandwich-with-cucumber-ginger-salad-black-chile-mayonnaise-recipe.html", "description": "Most steak sandwiches are manly affairs. As <strong>Tom Colicchio</strong> explains in sandwich cookbook, <em><a href=\"http://www.amazon.com/dp/0609610511/?tag=serieats-20\">'wichcraft</a></em>, the beef is \"usually paired with onions, cheese, or similarly rich flavors.\" I'd like to add that there isn't anything wrong with that approach, but it is interesting to come across a recipe like this one that pairs the seared beef with ginger, cucumber, cilantro, and lime&mdash;all ingredients that help lighten the load. The black chile mayonnaise here is the one exception.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Ginger", "Sandwiches"], "recipeIngredient": ["<strong>For the Black Chile Mayonnaise</strong>", "2 chiptole chiles (not the kind from the can)", "1 ancho chile", "1 cup grapeseed oil or canola oil ", "1 large egg yolk", "½ teaspoon minced garlic ", "juice from 1 lime ", "¼ teaspoon sugar", "½ teaspoon kosher salt ", "&nbsp;", "<strong>For the Steak Sandwich</strong>", "1 pound flank steak, flatiron steak, or skirt steak", "kosher salt and freshly ground black pepper", "1 teaspoon canola oil ", "4 cibatta rolls sliced in half cross-wise (or ciabatta bread cut into four sections, and then sliced in half cross-wise)", "2 cups English cucumber, peeled, cored, and julienned ", "2 tablespoons fresh ginger, peeled, and julienned ", "1 cup cilantro leaves", "Juice of 1 lime "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the black chile mayonnaise: If using a gas stove, turn one of the burners on high. Hold one of the chipotle chiles with a pair of tongs right over the flame and char it on all sides. It will puff up slightly, and then turn black. Set the chile aside, and repeat with the second chipotle chile, and the ancho chile. If you don't have gas stove, set a cast-iron skillet over high heat, and char the chiles on the skillet. When the chiles are cool to the touch, discard the stems and remove the seeds from the ancho. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the chiles into a food processor and finely grind. Transfer to a bowl and pour in the 1 cup of oil. Stir well. Without cleaning the food processor, add in the egg yolks, garlic, lime juice, sugar, salt, and two tablespoons of water.  Process until combined. With the motor running, slowly drizzle in the chile oil in a steady stream. The mayonnaise should be thick and creamy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the steak sandwich: Season the steak with salt and pepper on both sides. Pour the teaspoon of oil into a cast-iron skillet set over high heat. When just beginning to smoke, add the steak. Cook until well-browned on the bottom, about five minutes, and then flip. Cook until well-browned on that side, about another five minutes. Check its temperature with a meat thermometer; it should register about 140 degrees. If so, set aside and let rest for five minutes. (If it is below 140 degrees, cook for another minute or two on each side.) Then thinly slice the meat against the grain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop out some of the middle of each piece of ciabatta. Spread one tablespoon of the black chile mayonnaise on each top half. Divide the steak, cucumber, ginger, and cilantro between the four bottom halves. Drizzle each with lime juice, and season with salt. Place the top halves on each, mayonnaise side down. Serve.  </p>"}]}