{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-177675-caramel-610x458-26.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["candies", "candy", "caramel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Soft Caramels", "link": "https://www.seriouseats.com/recipes/2011/11/soft-caramels-candy-recipe-how-to-make-caramel.html", "description": "Buttery, chewy, soft caramel makes great candies and is a tooth-saving alternative for tough or hard caramel apples. I love making it with the seeds scraped from the inside of a vanilla bean, with fleur de sel sprinkled on the top. These caramels wrapped in a twisted square of waxed paper make wonderful homemade gifts.", "totalTime": "4 hours", "recipeYield": "makes 30 pieces", "recipeCategory": ["Candy"], "recipeIngredient": ["1 cup heavy cream", "5 tablespoons unsalted butter", "1 teaspoon fleur de sel (or other coarse salt), plus more for sprinkling", "Optional: seeds scraped from the inside of one vanilla bean", "1 1/2 cups sugar", "1/4 cup corn syrup", "1/4 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line bottom and sides of an 8-inch square baking pan with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring cream, butter, vanilla bean seeds, and fleur de sel to a boil in a small saucepan, then remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, corn syrup, and water in a 3- to 4-quart heavy saucepan, taking care not to get excess on the sides of the pan. Ensure that the sugar is completely hydrated by mixing it with your fingers. Wash down the sides of the pot with a pastry brush dipped in water. Bring the mixture to a boil, without stirring. Once the mixture begins to darken around the edges, begin swirling the pot to even out the caramelization, until the caramel is a deep amber color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat and carefully add the cream mixture (mixture will bubble up) and simmer. Once the bubbling calms down, return to low heat, stirring frequently, until caramel registers 250°F on thermometer, 10 to 15 minutes. Pour into baking pan and cool 2 hours. Cut into 1-inch rectangles, then wrap each piece in a 4-inch square of wax paper, twisting 2 ends to close. For caramels that are a bit chewier, chill, for softer caramels, store in the fridge in a sealed plastic bag.<br />\r\n</p>"}]}