{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111217oreodetail610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "candy cane", "Cookies", "Fauxreos", "gluten free", "holiday cookie", "holiday cookies", "peppermint", "sandwich cookies", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Limited Edition Holiday Fauxreos", "link": "https://www.seriouseats.com/recipes/2011/12/bravetart-limited-edition-holiday-fauxreos-how-to-make-holiday-oreos.html", "description": "I absolutely cannot resist normal sweets kicked into Holiday Mode. You can make the candy cane version <em>or</em> the white chocolate version, or you can do the right thing. You can make white chocolate covered candy cane Faureoxs.", "totalTime": "2 hours", "recipeYield": "Makes 32 sandwich cookies", "recipeCategory": ["Christmas", "Cookies", "Desserts", "Gluten-Free"], "recipeIngredient": ["3 ounces unsalted butter, room temperature", "3 3/4 ounces sugar", "1 1/2 ounces brown sugar", "1 1/2 teaspoons salt", "1/4 plus 1/8 teaspoons baking powder", "1/4 teaspoon baking soda", "1 1/2 teaspoons vanilla extract", "1 teaspoon peppermint oil", "2 egg yolks", "4 ounces all purpose flour (or rice flour), sifted ", "3 ounces cocoa powder, sifted", "&nbsp;", "<strong>For the filling:</strong>", "2 ounces shortening or unsalted butter at room temperature", "5 ounces powdered sugar, sifted", "1 teaspoon vanilla extract", "1/2 teaspoon peppermint oil", "1/8 teaspoon salt", "optional: red or pink food coloring", "4 candy canes, crushed", "&nbsp;", "<strong>White Chocolate Coating:</strong>", "8 ounces cream ", "19 ounces white chocolate, chopped", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cookies: Using a hand or stand mixer set to medium speed, cream together butter, both sugars, salt baking powder, baking soda, vanilla extract and peppermint oil until combined. With mixer still running, add in egg yolks one at a time. Once incorporated, shut off mixer and scrape bowl down with a rubber spatula. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn mixer to its lowest setting. Dump in flour and cocoa all at once. The mixture will be stiff. Continue mixing until uniform. Shut off mixer. Use a spatula to scrape the dough from the bowl and knead lightly to form a smooth ball. Use your hands to flatten into a disc.</p>\n\n<p>You may begin rolling the dough right away, or you may wrap it with plastic and refrigerate for up to a week.</p>\n\n<p>If you've kept the dough refrigerated, let it sit at room temperature to soften before starting to roll.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg; F. Sift some cocoa powder onto the counter (using cocoa instead of flour gives the Fauxreos their uniquely dark color). Use a rolling pin to roll the dough to 1/8\" thickness (as thick as 3 dimes, stacked).</p>\n\n<p>When finished, slide a metal spatula between the dough and counter to loosen. This will prevent the cookies from sticking.</p>\n\n<p>A 2\" round cutter makes perfect \"Oreos\" but use any cutter you like. Cut out the cookies and use a metal spatula to lift and transfer to cookie sheet.</p>\n\n<p>Arrange cookies on ungreased cookie sheet. (If the cookie sheet is dinged up or uneven, line with parchment paper first.) The cookies will not spread during baking, so they may be arranged quite close together. Set the sheets aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather up, knead, and re-roll the remaining dough scraps, likewise cutting and arranging on a cookie sheet.</p>\n\n<p>To pipe a design on the cookies, place any remaining dough in a mixing bowl. Mix with a hand or stand mixer and add about 1 tsp of hot water. Continue adding hot water, a teaspoon at a time, until the dough has thinned into a paste. You can always add more liquid, but you can't take it away. Add slowly and let each addition mix in fully before adding more. When the mixture reaches a frosting-like consistency, use a spatula to scrape it out. Transfer to a piping bag fitted with a very small tip, or a heavy duty Ziploc bag with a tiny hole poked in the corner.</p>\n\n<p>Holiday Oreos have winter-themed designs atop them, like snowflakes and ice skates.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cookies have been decorated, bake for about 12 minutes, or until quite firm to the touch. If your oven has an uneven heating element, rotate the cookie sheets after six minutes. Once the cookies have baked, cool thoroughly, directly on the cooling rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling: With a hand or stand mixer, cream together shortening/butter, powdered sugar, vanilla and salt. Cream on medium speed for five minutes; use a rubber spatula to scrape the bowl down periodically. The long mixing time aerates the filling, making it especially white and less gritty.</p>\n\n<p>Using a spatula, transfer half the filling to a small pastry bag fitted with a plain tip. Alternately you can use a Ziploc bag with the corner snipped off as a makeshift pastry bag.</p>\n\n<p>Add the peppermint oil and the food coloring to the remaining mixture and beat until evenly colored (or don't! It looks really nice kinda swirled and uneven). Likewise transfer this mixture to a piping bag. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cookies: Flip half the wafers upside down. Onto each, pipe a swirl of vanilla filling, like you're making a yin-yang symbol. After, pipe on the other half with the peppermint. To finish, sprinkle each cookie generously with crushed candy cane bits, then top with remaining wafers. Press down with your fingers, applying very even pressure so the filling will spread uniformly across the cookie.</p>\n\n<p>Transfer cookies to an airtight container and refrigerate for several hours. This is crucial. After whipping the filling, it will be quite soft. Refrigerating it will solidify the filling, restoring its proper texture, and bonding it with the wafers. </p>\n\n<p>If you plan to dip the cookies, store them in the freezer until needed (dipping them while cold helps the ganache coat them in a thicker layer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the white chocolate coating:</p>\n\n<p>In a small sauce pan, bring cream to a simmer. Shut off the heat and begin adding white chocolate a little at a time, while whisking. Continue whisking until white chocolate has melted completely. If the mixture becomes too thick or too cool and it seems the white chocolate has stopped melting, turn the heat to low and whisk until melted. Whisk in the salt.</p>\n\n<p>Transfer this white chocolate mixture to the smallest bowl you have that will accommodate it. (This creates more depth, making dipping easier.) Let the white chocolate stand, stirring occasionally to prevent a skin from forming, until it is no longer hot. It should be about body temperature.<br />\n </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the cookies:</p>\n\n<p>Have a parchment lined sheet pan standing nearby.</p>\n\n<p>Drop one cookie into the center of the bowl. Use a fork to submerge it completely. Lift it from the ganache and tap the fork against the edge of the bowl quite firmly to encourage excess ganache to drip off. Drag the cookie bottom across the edge of the bowl to scrape off any excess from the bottom, and transfer to the parchment lined pan.</p>\n\n<p>Continue dipping all the cookies; if the ganache becomes too thick, microwave for just 10 seconds and stir with a fork to restore fluidity, then continue dipping.</p>\n\n<p>Refrigerate the cookies for about 20 minutes, until the ganache has set. Dip the cookies a second time, warming the bowl of ganache in the microwave as needed. Return the cookies to the fridge to set, and then? Dig in.</p>\n\n<p>Store the dipped cookies in the fridge for several days. Undipped cookies will last, refrigerated,  about two weeks.</p>"}]}