{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110924shuna-icecream.jpg", "author": {"@type": "Person", "name": "Shuna Lydon"}, "recipeCuisine": "", "keywords": ["Guest Star", "honey", "ice cream", "Shuna Lydon", "Shuna Lydon Week", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hojicha-Burnt Honey Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/09/hojicha-burnt-honey-ice-cream-recipe.html", "description": "It seems odd to say that one of my favorite aspects of this ice cream is its bitterness&mdash;its 1-2 punch of double bitterness created by the burning of the honey and the long steeping of a tannic roasted tea&mdash;but it's true.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["600 grams honey", "55 grams Hojicha tea", "350 grams whole milk", "350 grams heavy whipping cream, not ultra pasteurized", "110 grams large egg yolks", "50 grams honey, plus more to taste", "Sea or smoked salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy bottomed non-reactive sauce pot boil honey until it reduces by a third. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another sauce pot, measure in hojicha tea, milk, and cream. Stir to incorporate and place on medium heat until hot. Whisk to incorporate and let infuse for one to two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When tea is fully steeped, turn heat back on to medium-high, whisking occasionally. When steeped dairy has just come to a simmer, shut off heat and pour liquid through a fine meshed sieve into pot containing the honey. Turn heat on to medium, whisking every few minutes until honey has dissolved into dairy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure egg yolks into a medium bowl and whisk to break up. Whisk in 50 grams of honey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When burnt dairy mixture has just barely reached a simmer, shut off heat. Using a ladle, whisk hot liquid into honeyed yolks until yolk mixture is hot. Scrape yolk mixture into pot and cook, stirring constantly, with a wooden spoon, on low heat, until mixture coats the back of spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour immediately into a non-reactive container and taste. Season with salt and more honey if desired. Ice cream base should always taste a little stronger than you think because you lose about ten percent of that strength when ice cream is frozen. Chill, tightly covered, in refrigerator overnight or up to 5 days. Churn according to the ice cream machine manufacturer’s instructions.</p>"}]}