{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110330-144985-fig-taleggio-and-radicchio-pizza.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "figs", "Joe Yonan", "pizza", "radicchio", "Serve Yourself", "Taleggio", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Fig, Taleggio, and Radicchio Pizza", "link": "https://www.seriouseats.com/recipes/2011/04/fig-taleggio-and-radicchio-pizza-recipe.html", "description": "You have to love the fact that <a href=\"http://www.joeyonan.com/\">Joe Yonan</a>, author of <strong><em><a href=\"http://www.amazon.com/Serve-Yourself-Nightly-Adventures-Cooking/dp/158008513X/serieats-20\">Serve Yourself</a>,</em></strong> has created easy, accessible homemade pizza recipes for the single cook. Yonan adapted Jim Lahey's <a href=\"http://www.seriouseats.com/recipes/2010/03/basic-no-knead-bread-dough-jim-lahey-recipe.html\">No-Knead Bread</a> recipe into pizza dough form, a \"throw it together and leave it\" dough that can be started in the morning and ready to bake by dinner time.", "totalTime": "8 to 12 hours", "recipeYield": "1", "recipeCategory": ["Cheese", "Cook the Book", "Pizza", "Vegetarian"], "recipeIngredient": ["<strong>For the Pizza:</strong>", "3 dried Mission figs", "1/2 cup dry red wine", "2 tablespoons raw walnut pieces", "All-purpose flour", "1 (6-ounce) ball No-Knead Pizza Dough (recipe follows)", "2 tablespoons extra-virgin olive oil", "1/2 small head radicchio, shredded (about 1/4 cup)", "2 ounces Taleggio or another pungent cheese, cut into small pieces ", "<strong>For the No-Knead Pizza Dough:</strong>", "4 cups bread flour, plus more as needed", "1/4 teaspoon instant dry yeast (also known as rapid-rise or bread machine yeast)", "1 1/2 teaspoons fine sea salt", "1 1/2 cups water", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the No-Knead Pizza Dough:</strong>  Combine the flours, salt, and yeast in a large bowl.  Add the water and stir until blended.  Cover the bowl with plastic wrap and let it rest for 8 to 12 hours at room temperature (about 70&deg;F).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 8 hours, the dough will have risen and be bubbly on the surface.  The timing is very forgiving here; you can let it continue bubbling and very slowly expanding for several more hours if you like. Transfer the dough to the refrigerator for about an hour before dividing, so it’s easier to work with.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly rub your hands and work counter with olive oil. Turn out the dough onto the counter in one piece. Lightly dust it with flour and fold it onto itself a few times, adding more flour if necessary, until the dough comes together and holds its shape when you form it into a ball. Cut into 5 equal pieces (for pizza), about 6 ounces apiece, or 10 equal pieces (for flatbread), about 3 ounces apiece.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate or freeze what you’re not going to use right away. Transfer the balls to individual freezer-safe plastic food storage bags, drizzle with olive oil, and turn the dough to coat it in the oil. Refrigerate for up to 3 days or freeze for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the piece(s) you are going to use immediately with flour and transfer to a lightly floured baking sheet. Cover with a towel or plastic wrap and let rise for about 1 hour.</p>\n\n<p><small><strong>Note:</strong>Note: If you have refrigerated the dough, remove it from the refrigerator and let it rise for about 1 hour. If you have frozen the dough, defrost in the refrigerator for 8 to 12 hours, then transfer it to the counter to rise for an hour. The dough should be pliable and able to be easily stretched into shape.</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Pizza:</strong> Preheat the broiler with the rack set 5 inches from the element or flame. If you are using a cast-iron skillet or griddle pan for the pizza, set it over medium-high heat until it gets smoking hot, about 15 minutes. Transfer the skillet (turned upside down) or griddle pan to the broiler. If you are using a baking stone, heat it in a 500°F oven for an hour, then carefully transfer it to the broiler. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the figs in a small skillet set over medium heat, pour in the wine, and bring to a boil. Turn off the heat and let the figs soak for at least 30 minutes. Drain, then chop into 1/2-inch pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the walnut pieces in a small, dry skillet over medium-high heat, shaking the skillet frequently, until they are very fragrant and starting to brown, 3 to 4 minutes. Immediately transfer to a plate, let cool, and then coarsely chop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To shape the dough, dust a work surface liberally with flour and put the ball of dough on it. Sprinkle with flour and knead a few times until the dough comes together and holds its shape when you form it into a ball. Add more flour if necessary. Form it into an 8-inch round by pressing from the center out toward the edges, leaving a 1-inch border thicker than the rest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sure you have all the topping ingredients measured out and ready before you assemble the pizza, because once you place the dough on the cooking surface you can’t easily move it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the oven or broiler door, and quickly slide out the rack with the cooking surface (skillet, griddle pan, or baking stone) on it. Pick up the dough and quickly transfer it to the cooking surface, pressing it back into shape if need be, while being careful not to touch the cooking surface with your fingers. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle 1 tablespoon of the oil onto the dough, scatter the walnut pieces on top, then the radicchio, then the chopped figs, and then the cheese. Slide the broiler rack back into the oven and close the door. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Broil the pizza until the crust has puffed up around the edges, the pizza has blackened in spots, and the cheese has melted, 3 to 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pizza with a wooden or metal pizza peel or a square of cardboard, transfer it to a cutting board, and let it rest for a few minutes. Drizzle the remaining 1 tablespoon of oil on top, cut the pizza into quarters, transfer it to a plate, and eat.</p>"}]}