{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110208-bread-baking-sprouted-wheat-sliced.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "sprouted wheat", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Sprouted Wheat Bread", "link": "https://www.seriouseats.com/recipes/2011/02/bread-baking-sprouted-wheat-bread.html", "description": "This bread is a perfect example of how far you can break the rules and still end up with a really great loaf of bread. This loaf was a little sweeter than a normal whole wheat&mdash;or maybe it was just less bitter. The texture wasn't quite like plain white bread, but it also wasn't as rough as a normal whole wheat loaf. Overall, I thought it was pretty darned good.", "totalTime": "4 hours, 15 minutes", "recipeYield": "one loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup warm water", "2 1/4 teaspoons active dry yeast", "1 tablespoon sugar", "1 cup (4 1/2 ounces) sprouted yeast flour", " 1 1/2 cups (6 3/4 ounces) bread flour (divided)", "1 teaspoon salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine water, yeast and sugar, and set aside until foamy, about 10 minutes. Add the sprouted yeast flour and 1 cup of the bread flour. Stir to combine, cover the bowl with plastic wrap, and set aside for 2 hours. It will rise and possibly collapse in this time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining bread flour and knead with the dough hook until the dough is smooth and elastic. Add the salt and olive oil and continue kneading until both are completely incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and sprinkle some cornmeal on a baking sheet. Remove the dough from the bowl and knead briefly by hand, then shape into your preferred shape. Place it on the prepared baking sheet, cover with plastic wrap, and set aside until doubled in size, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap, slash as desired, and bake until nicely browned, about 40 minutes. Remove from the oven and let the bread cool completely on a rack before slicing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: you don't have to use this unorthodox rising schedule - this is just an example of what you can do if you've got odd time constraints. Normally, I would have let the mixture sit for 20 minutes or so instead of the two hours, then finished the dough and let it rise until doubled before forming and baking.</p>"}]}