{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111204-pork-shoulder-07-primary.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["holiday entrees", "low carb", "pork", "pork shoulder", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8928571428571", "ratingCount": "28"}, "name": "Ultra-Crispy Slow-Roasted Pork Shoulder", "link": "https://www.seriouseats.com/recipes/2011/12/ultra-crispy-slow-roasted-pork-shoulder-recipe.html", "description": "Pull-apart tender meat and ultra-crisp skin. It's not the most gorgeous roast in the world, but you'd be hard pressed to find one more flavorful.", "totalTime": "9 hours", "recipeYield": "serves 8 to 12", "recipeCategory": ["Christmas", "Dairy-Free", "Gluten-Free", "Mains", "Pork", "Roasting", "Thanksgiving", "The Food Lab"], "recipeIngredient": ["1 whole bone-in, skin-on pork shoulder, 8 to 12 pounds total", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 250°F (121&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with heavy duty aluminum foil (see note) and set a wire rack inside it. Place a piece of parchment paper on top of the wire rack. Season pork on all sides liberally with salt and pepper and place on parchment paper. Transfer to oven and roast until knife or fork inserted into side shows very little resistance when twisted, about 8 hours total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork from oven and tent with foil. Let rest at room temperature for at least 15 minutes and up to 2 hours. Increase oven to 500°F and allow to preheat. Return pork to the oven and roast until skin is blistered and puffed, rotating every 5 minutes, about 20 minutes total. Remove from oven, tent with foil and allow to rest an additional 15 minutes. Serve by picking in the kitchen or just bring it to the table and let guests pick meat and crispy skin themselves, dipping into sauce of their choice on the side (see note).</p>"}]}