{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110304-corned%20beef-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "American", "keywords": ["beef", "cabbage", "carrot", "corned beef", "corning", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.7777777777778", "ratingCount": "9"}, "name": "Corned Beef Brisket, Potatoes, Cabbage, and Carrots for St. Patrick's Day", "link": "https://www.seriouseats.com/recipes/2011/03/homemade-corned-beef-brisket-with-potatoes-cabbage-carrots-recipe.html", "description": "There are two basic steps to corned beef: the rub and the cooking. The rub consists of a mix of spices and, more importantly, the salt and nitrites that give corned beef its characteristic hammy flavor. Cooking the brisket after it's been cured is simple&mdash;you can essentially just simmer it until tender&mdash;but for the best corned beef, you'll want to use low and steady heat for a long time for the juiciest results. ", "totalTime": "1 week for cure, 1 day for cooking", "recipeYield": "serves 6 to 10", "recipeCategory": ["American", "Beef", "Cabbage", "Potato", "St. Patrick's Day", "The Food Lab"], "recipeIngredient": ["1 whole flat or point cut beef brisket, trimmed, about 2250 grams/5 pounds", "100 grams/3 1/2 ounces (about 3/4 cup) Diamond Crystal kosher salt", "10 grams/.325 ounces (about 1 1/2 teaspoons) of <a href=\"https://www.amazon.com/dp/B07J179V3G/?tag=serieats-20\">pink salt</a> or 7.5 grams/.25 ounces (about 2 teaspoons) saltpeter ", "30 grams/1 ounce  (about 2 tablespoons) packed brown sugar", "2 tablespoons whole black peppercorns", "2 tablespoons yellow mustard seeds", "2 tablespoons whole coriander seeds", "1 tablespoon allspice berries", "6 whole cloves", "1 tablespoon ground ginger", "6 bay leaves, roughly torn", "2 pounds carrots, peeled and roughly chopped", "2 pounds russet potatoes, peeled and roughly diced ", "1 whole head white or green cabbage, cut into 6 to 8 wedges (2 to 3 pounds total)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 days before serving, combine salt, saltpeter (or pink salt), and brown sugar in a small bowl and whisk until homogenous. Rub evenly over every surface of brisket. Combine peppercorns, mustard, coriander, allspice, cloves, ginger, and bay leaves and sprinkle evenly over both sides of beef, pressing spices gently into the meat until they stick. Seal the beef in a vacuum sealed bag or a zipper-lock bag with all of the air pressed out of it. Place in coldest part of refrigerator and let rest for 7 days, flipping once a day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook in a Sous-Vide Cooker:</strong> The day before serving, remove the beef from the bag and carefully rinse off all spices under cold running water. Pat dry with paper towels. Re-seal in a vacuum bag and cook at 180° until tender, about 10 hours. Proceed to step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook in a Dutch Oven:</strong> The day before serving, remove the beef from the bag and carefully rinse off all spices under cold running water. Pat dry with paper towels. Preheat oven to 200°F. Place brisket in large Durch oven, cover with water by several inches, and bring to a simmer over high heat. Remove from heat, cover with lid slightly ajar, place in oven, and cook until completely tender, about 10 hours. Proceed to step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once beef is cooked, transfer to an airtight container along with cooking liquid (if cooked in a water oven, just store it in its vacuum bag). Let rest at least overnight, and up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The day of: transfer cooking liquid to a large saucepan or Dutch oven along with carrots, potatoes, and cabbage. Top up with water until vegetables are submerged. Slice beef thinly against the grain and fan slices out in large skillet. Add 1 cup of liquid from pot to skillet and place skillet on top of pot. Cover skillet. Bring the pot to a boil over high heat, then reduce to a simmer. Cook until vegetables are completely tender and beef is heated through, about 45 minutes. Serve immediately with hot mustard.</p>"}]}