{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110122-134043-wild-rice-salad-with-beets-and-oranges.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Appetite for Reduction", "beets", "Cook the Book", "Isa Chandra Moskowitz", "oranges", "salad", "wild rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Wild Rice Salad with Oranges and Roasted Beets", "link": "https://www.seriouseats.com/recipes/2011/01/wild-rice-salad-with-oranges-and-roasted-beets-recipe.html", "description": "It seems as though beet and orange salads&mdash;usually mixed with a handful of baby greens, a tart vinaigrette, and a crumble of goat cheese&mdash;are the fashionable salads of cold weather months.  And while I'm a big fan of the combo, I have to admit that I was thrilled to see the ingredients handled in a new, exciting way in <a href=\"http://www.theppk.com/about/\">Isa Chandra Moskowitz</a></strong>'s <em><strong><a href=\"http://www.amazon.com/Appetite-Reduction-Filling-Low-Fat-Recipes/dp/1600940498/serieats-20\">Appetite for Reduction</a></strong></em>.", "totalTime": "2 hours", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Orange", "Salads"], "recipeIngredient": ["1 navel orange", "2 tablespoons sesame seeds", "1 recipe <strong>Orange–Sesame Vinaigrette</strong> (recipe follows)", "2 cups cooked wild rice, cooled", "1/4 cup dried currants", "2 cups red leaf lettuce, torn into bite-size pieces", "1 pound <strong>Tinfoil Beets</strong> (see recipe follows), cooled ", "<strong>For the Orange–Sesame Vinaigrette:</strong>", "3/4 cup freshly squeezed orange juice (2 to 3 navel oranges)", "2 tablespoons red wine vinegar", "1 tablespoon toasted sesame oil", "1/8 teaspoon salt", "1 teaspoon hot chili sauce, such as Sriracha", "1 teaspoon Microplaned or finely minced fresh ginger "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, prepare the orange segments. Slice a thin layer off the top and bottom of the orange, then place the orange right side up on the cutting board and simply slice the peel downward, using a chef’s knife and following the natural curve of the orange. A little of the white part (called the pith) is okay; just try to get as much orange as you can. Then slice the orange widthwise and cut each piece into q-inch segments. Then toast the sesame seeds. Preheat a small, heavy-bottomed pan over medium-low heat. Place the sesame seeds in the pan and stir often for about 2 minutes. They should be toasting by then (if not, then raise the heat). Use a spatula to toss continuously for another minute or so, until they are varying shades of toasty brown. Remove from the pan ASAP to prevent burning. Pour the dressing into a large mixing bowl. Add the wild rice, currants, and lettuce. Using tongs, toss to coat. Add the orange segments and sesame seeds, and toss again. Last, fold in the beets. Serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tinfoil Beets:</strong>  Unwrapping a tinfoil beet is a lot like unwrapping a present. Well, maybe not really, because you know exactly what’s going to be in there, but it’s still somehow such an exciting surprise. roasting brings out the beet’s sweet flavor, so they’re like precious rubies in a candy box when ready to eat. I usually do two pounds at a time on a weeknight or Sunday afternoon, and use some of them that evening as a side dish with whatever I’m eating. Then I refrigerate the rest and use them in salads or just for a quick snack throughout the week. The cooking method and time really varies depending on the size of the beets you’re using. If using small beets, say golf ball size, and they are very fresh, then don’t bother to peel them first. Just slice in half, wrap in foil, and roast. And remember to save the beet greens to sauté with some olive oil and garlic. But if using those big honkers of a beet that you’re more likely to find come January and February, then it’s a little different. Peel them and then slice top down into segments (like orange slices) that are about P inch thick at their widest. If a beet is especially big—say, softball size—then I sometimes will slice widthwise, too. Then, keeping all the slices together in a neat package, place on tinfoil and wrap so that you can easily unfold it from the top. roasting times will vary, but I do at least an hour at 425°F. They’re ready when pierced easily with a fork. Be careful when handling, because there will be a lot of red beet juice justdying to drizzle out and stain your countertops. Although maybe that could look cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Orange–Sesame Vinaigrette:</strong> Vigorously mix together all the ingredients. Just mix them right into a measuring cup so as not to use too many dishes. If you’re using the dressing for a grain salad, you can also mix it directly into the large mixing bowl that you will use to prepare your salad. Keep refrigerated in a tightly sealed container until ready to use. </p>"}]}