{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110824process.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate", "chocolate cookies", "Fauxreos", "gluten free", "ice cream", "ice cream sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vanilla Ice Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2011/08/homemade-vanilla-ice-cream-sandwiches-recipe.html", "description": "This recipe is essentially for <a href=\"http://www.seriouseats.com/recipes/2011/08/fauxreos-homemade-oreos-recipe.html\">Fauxreos</a>, but with the addition of hot coffee to create a thick, cake-like batter that is spread with a spatula, not rolled out.", "totalTime": "24 hours", "recipeYield": "12 ice cream sandwiches", "recipeCategory": ["Gluten-Free", "Ice Cream and Frozen Treats"], "recipeIngredient": ["4 ounces unsalted butter, room temperature", "5 ounces sugar", "2 ounces brown sugar", "1 1/2 teaspoons salt", "1/2 teaspoon baking powder", "1/8 teaspoon baking soda", "1 1/2 teaspoons instant espresso powder ", "2 teaspoons vanilla extract", "4 egg yolks", "5 1/4 ounces all purpose flour, sifted (use rice flour for gluten free)", "4 ounces cocoa powder, sifted", "6 ounces hot coffee", "2 quarts vanilla ice cream, store bought or <a href=\"http://www.seriouseats.com/recipes/2011/08/how-to-make-your-own-oreo-blizzards-like-dairy-queen-homemade-recipe.html\">homemade</a>", "Optional: a few tablespoons of neutral oil like safflower or coconut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the chocolate wafers:</strong> Preheat oven to 350° and line 2 sheet pans with parchment paper. With a hand or stand mixer, cream together butter, sugars, salt, baking soda, powder, espresso, and vanilla on medium speed. Mix for about two minutes, just until combined. </p>\r\n\r\n<p>Then (with the machine still running) add in the yolks, one at a time. During this process, shut off the mixer and scrape the bowl down with a rubber spatula once or twice. Reduce mixing speed to low and dump in the flour and cocoa all at once. Mix until the dry ingredients have fully incorporated.</p>\r\n\r\n<p>With the mixer still running on low, drizzle in the hot coffee a little at a time. About halfway through, stop the mixer and scrape the bowl down. Continue drizzling in the coffee to transform the dough into a paste.</p>\r\n\r\n<p>In the end, it should have a smooth cake-batter like consistency. If you notice any lumps, crank up the mixer speed to medium and beat until the lumps have disappeared. If a few remain, don't worry; they'll bake out.</p>\r\n\r\n<p>Divide the batter evenly between the two sheet pans (roughly 15 ounces each). Use an offset spatula or the back of a spoon to spread the batter into a thin layer; you don't need the batter to reach to the very corners, it only needs to cover a 10\" by 14\" area. Rap the sheet pans against the counter to help level the batter.</p>\r\n\r\n<p>Bake for about 7-10 minutes, or until the cookie-sheets have puffed up and become firm to the touch. Cool thoroughly.</p>\r\n\r\n<p>For greatest ease of handling, refrigerate or freeze the wafers before proceeding. If you're quite careful, it's not necessary, but it does make the process easier.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the wafers:</strong> Line a 9\" x 13\" brownie pan with parchment paper. The paper should overhang the long sides by 4 inches or so. </p>\r\n\r\n<p>Use a knife to cut the two cooled chocolate wafers into 9 x 13\" rectangles. Set aside the excess scraps. </p>\r\n\r\n<p>Fit one of these giant wafers, shiny side down, into the bottom of the parchment lined brownie pan. Once you've fitted it in, peel off the parchment paper stuck to the bottom. If the wafer cracks or breaks in any place, use some of the trimmings to patch up the hole. The wafers will meld together nicely just by pressing two pieces together firmly. </p>\r\n\r\n<p>Store the pan and remaining chocolate wafer in the freezer until needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fill the ice cream sandwich:</strong> If you're opting for homemade ice cream, you will want to use it immediately after it's finished churning in your ice cream maker. If you're using store bought, store it in the refrigerator for 30 minutes or until it has become soft and spreadable.</p>\r\n\r\n<p>In either case, spread the ice cream into the brownie pan, atop the first chocolate layer. Use a spoon or offset spatula to push the ice cream up into the corners of the pan, and to distribute it evenly. </p>\r\n\r\n<p>Invert the remaining frozen chocolate wafer onto a cutting board. Peel of the parchment paper and then place it shiny side up on top of the ice cream.</p>\r\n\r\n<p>Cover the wafer with a piece of parchment or plastic wrap, then use your hands to gently press the top wafer down and seal it against the ice cream. If you notice there are any thin or uneven places, gently push on the chocolate wafer to redistribute the ice cream below.</p>\r\n\r\n<p>Return the pan to the freezer and allow it to freeze for at least 12 hours before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make your own waxed foil:</strong> Of course, you don't have to make wrappers. But it's fun and easy. Simply take a sheet of tin foil, shiny side up, and use a pastry brush or paper towel to coat it lightly with oil. Then press a sheet of parchment paper against the oiled surface of the foil. Use your fingers to smooth the parchment down, pressing out any air bubbles. If you have a bench scraper, that's also a good tool for removing air bubbles.</p>\r\n\r\n<p>Cut the newly formed wax/foil into 7\" squares with scissors or an xacto knife. Repeat until you have 12 squares altogether. Set aside until needed.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cut the ice cream sandwiches:</strong> Pull the brownie pan from the freezer. Run a knife around the edges to loosen, then take hold of the overhanging parchment and lift the whole thing out. It may take a bit of tugging on one side, then the other.</p>\r\n\r\n<p>Transfer this giant ice cream sandwich to a cutting board.</p>\r\n\r\n<p>Use a large chef's knife to cut it into 12 pieces. It's easiest to first cut it into quarters, then to cut each quarter into three pieces. I</p>\r\n\r\n<p>Wipe your knife clean with a hot, wet towel between slices for the cleanest cut.</p>\r\n\r\n<p>Store the sandwiches in an airtight container or, to make the most out of your ice cream sandwich nostalgia, wrap each in the prepared foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Wrap the ice cream sandwiches:</strong> Remove half of the ice cream sandwiches from the freezer. Place each on the center of the foil or parchment square.</p>\r\n\r\n<p>Wrap much like you would a Christmas present: fold the long sides to the middle. Then at each edge, fold the short sides to the middle. Then fold the long sides. The foil will crease and stay in place without tape.</p>\r\n\r\n<p>Return to the freezer, and repeat with the other half. They will keep quite well for about a month, if they last that long, which I doubt.</p>"}]}