{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110507sundaysupper.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["mushrooms", "rice", "salmon", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Kulebyaka", "link": "https://www.seriouseats.com/recipes/2011/05/kulebyaka-russian-salmon-dish-recipe.html", "description": "This classic Russian dish always signals celebration.  It's possible to take much of the grueling work out of this arguably arduous dish by making all the separate parts the day before; then it's a simple matter of assembling and baking, once your party is ready to eat.  A cucumber salad and a few bottles of something with bubbles will be the perfect thing to cap off this Mother's Day meal.", "totalTime": "1 1/2 - 2 hours", "recipeYield": "4", "recipeCategory": ["Mains", "Mushrooms", "Rice", "Salmon", "Sunday Supper"], "recipeIngredient": ["olive oil", "1 onion, finely chopped", "4 sprigs of thyme", "8 ounces button mushrooms, sliced", "1 small bunch of dill", "6 peppercorns", "1 clove garlic, thinly sliced", "2 pounds salmon fillets (divided into 4 pieces)", "4 eggs, hard-boiled ", "1/2 cup long grain rice, cooked", "2 pounds puff pastry (thawed overnight if frozen)", "Kosher salt and cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in small saucepan; add chopped onion, 4 springs of thyme and cook until onion is soft and slightly brown.  Add sliced mushrooms and cook until soft and dry.  Remove from heat and reserve.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet large enough to hold salmon fillets, place small bunch of dill, peppercorns and garlic; cover with cold water and bring to a simmer.  Add salmon fillets one by one and cook until just firm (about 1 minute) then flip and cook for an additional 30 seconds.  Gently remove from skillet and cool.  Slice hard-boiled eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all ingredients are cool, preheat oven to 375&deg;, then divide puff pastry into 4 sections (frozen puff pastry will come in sheets).  In center of pastry place 1/4 of rice, followed by 1/4 of mushroom mixture, followed by one sliced hard-boiled egg, followed by one salmon fillet.  Wrap puff pastry gently around salmon, seal with an egg wash, and place on prepared baking sheer.  Repeat with remaining ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven and cook until pastry is golden brown, about 30 minutes. Serve with a crisp green salad and plenty of sparkling wine for toasting Mum.</p>"}]}