{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110726RoundZucchinis.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French", "French in a Flash", "vegetarian", "zucchinis"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French in a Flash: Little Stuffed Zucchinis", "link": "https://www.seriouseats.com/recipes/2011/07/french-in-a-flash-stuffed-zucchinis-recipe.html", "description": "Little, round zucchini stuffed with fresh breadcrumbs, garlic, onion, cheese, mint, basil, walnuts, and chili makes for a vegetarian feast or a creative summer side dish full of Provençal flavor.", "totalTime": "50 minutes", "recipeYield": "serves 4", "recipeCategory": ["French", "Vegetarian", "Zucchini"], "recipeIngredient": ["4 small round zucchini", "4 tablespoons olive oil, plus 4 teaspoons", "1 small yellow onion, minced", "6 small cloves garlic, minced", "1/2 teaspoon chili flakes", "Kosher salt", "Freshly ground black pepper", "4 tablespoons chopped fresh basil", "2 teaspoons chopped fresh mint", "2 cups very roughly ground homemade breadcrumbs (made from running cubes of day-old bread through the food processor)", "20 walnuts halves, well chopped", "1 cup coarsely grated Pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. Cut the tops off the zucchini, and use a teaspoon to scoop out the flesh and seeds, leaving the exterior walls of the zucchini intact. Chop up the flesh well. If using small long zucchini, cut the zucchini in half lengthwise, and scoop out the flesh that way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide sautépan, heat 4 tablespoons olive oil over medium-low heat.  Add the onions, garlic, and chili, and season with salt and pepper. Cook until soft and translucent, about 5 minutes. Add the zucchini flesh, and cook another 5 minutes. Finally, add the herbs and breadcrumbs, and cook a final 5 minutes. Pour the mixture into a medium-sized bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the walnuts and cheese into the breadcrumb mixture, reserving 2 tablespoons of cheese to the side. Drizzle the zucchini with the remaining olive oil, and rub inside and out. Season the zucchini inside and out with salt and pepper. Stuff the breadcrumb mixture into the cavity until the zucchinis are brimming. Place the zucchinis and their little stem tops (separately) on a foil-lined baking sheet. Sprinkle the top of the stuffing with the remaining cheese. Bake for 15 minutes. Pull the zucchini out of the oven, place the stem tops on top of the stuffing, and wrap each whole zucchini package tightly in foil. Replace all 4 back on the baking sheet, and bake until the zucchini is tender, another 15 minutes. Unwrap, and serve right away.</p>"}]}