{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110303-127355-dinner-tonight-koshary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Middle Eastern", "keywords": ["Dinner Tonight", "egyptian", "koshary", "lentils", "pasta", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Dinner Tonight: Koshary (Rice, Lentils, and Pasta with Tomato Garlic Sauce)", "link": "https://www.seriouseats.com/recipes/2011/03/koshary-rice-lentils-and-pasta-recipe.html", "description": "I've probably watched the Egypt episode of <strong>Anthony Boudain's <em>No Reservations</em></strong> at least four times at this point, but this is the first time that watched him eat koshary and decided I had to have it. To be sure, the dish sounds slightly off. You might have <a href=\"http://www.seriouseats.com/2011/02/egypt-revolution-cairo-tahrir-square-food-what-are-they-eating-koshary-feeding-a-revolution.html\">read about it here on SE</a> last month. <strong>It's a combination of rice, lentils, and pasta (!), which is then topped with a vinegary tomato and garlic sauce,</strong> and caramelized onions. It looks slightly ridiculous, but apparently the carb fest is one of the most popular dishes in Cairo.", "totalTime": "1 hour", "recipeYield": "4 to 6 people", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Middle Eastern", "Pasta", "Rice"], "recipeIngredient": ["<strong>Tomato and Garlic Sauce</strong>", "½ tablespoon olive oil ", "½ tablespoon garlic, chopped", "one 16-ounce can tomato sauce", "½ cup water", "¼ cup vinegar", "<strong>Koshary</strong>", "1 large onion, thinly sliced", "6 ounces dried brown lentils", "8 ounces elbow macaroni, or any other compact pasta shape", "2 cups long-grain rice ", "3 cups water", "2 sticks cinnamon", "3 cardamom pods", "½ teaspoon whole cumin", "½ teaspoon whole coriander", "4 ½ tablespoons olive oil ", "Salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Tomato and Garlic sauce: Pour olive oil into a medium-sized saucepan set over medium heat. Add garlic and cook until fragrant, about 30 seconds. Add the tomato sauce. Simmer this until slightly thickened, about 10 minutes. Add the water and vinegar, and turn the heat to high. When it starts to boil, immediately turn off the heat. Transfer to a medium-sized bowl, season with salt to taste, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Koshary: Pour one tablespoon of olive oil into a heavy-bottomed 12-inch stainless steel skillet set over medium-high heat. When shimmering, add onion and stir well. Once coated in the oil, reduce heat to low and cook until heavily caramelized, about 45 minutes to an hour. Stir often. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the oven to 350&deg;F\". Also, fill a medium-sized pot with water and bring to a boil over high heat. Add the lentils, and then reduce heat to medium-low. Simmer until cooked, but still al dente, about 15 minutes. Drain lentils and set aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refill medium-sized pot with water and bring to a boil over high heat. Add pasta and cook according to the directions on the packaging. When al dente, drain pasta, and dump in a medium-sized bowl. Add one tablespoon of oil, and toss well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two tablespoons of olive oil into a dutch oven set over medium heat. Add the cinnamon sticks and stick until fragrant. Add the cardamom, cumin, and rice. Stir well, and cook until the spices are aromatic, and about half of the rice is opaque. Then pour in the water. Bring it to a boil, stir well, and the cover the dutch oven. Place in the oven and cook for 13 minutes. If done, fluff with a fork, and season with salt to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place another skillet over medium-high heat. Pour in ½ tablespoon of oil. When shimmering, add the pasta. Let it cook undisturbed for about a minute, or until it is crusty on the bottom. Toss well, and cook until it is toasty and slightly chewy. Transfer pasta to a bowl. Add another ½ tablspoon of oil to the pan. When shimmering, add the lentils and cook them until they are slightly toasted, about 30 seconds a side. Transfer them to another bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop out some rice onto a plate. Top with a scoop of pasta, lentils, tomato sauce, and some of the caramelized onions. </p>"}]}