{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111013-dt-chicken-with-star-anise-and-ginger.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Dinner Tonight: Star Anise and Ginger Chicken", "link": "https://www.seriouseats.com/recipes/2011/10/dinner-tonight-star-anise-and-ginger-chicken-recipe.html", "description": "It's hard to imagine this recipe could be anything but delicious upon reading the ingredient list. Ginger, garlic, honey, soy sauce, scallions&mdash;each one is delicious on its own, and they blend together beautifully in this recipe from <em><a href=\"http://www.amazon.com/exec/obidos/ASIN/1849750378/serieats-20\">Home Cooked Comforts</a></em> via <a href=\"http://leitesculinaria.com/70292/recipes-ginger-chicken.html#comments\">Leite's Culinaria</a>. The addition of star anise, with its subtle licorice influence, gives the dish that special something to set it apart.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["1 tablespoon vegetable oil", "2 pounds bone-in, skin-on chicken pieces (such as thighs and legs)", "1-inch piece fresh ginger, peeled and cut into thin strips", "3 garlic cloves, thinly sliced", "1/3 cup Chinese rice wine (or use sherry or sake)", "1/2 cup chicken stock or water", "1 tablespoon honey", "1 star anise", "1/4 cup light or low-sodium soy sauce", "3 to 4 tablespoons fresh clementine or orange juice, optional", "2 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) skillet, heat the oil over medium heat until shimming.  Add the chicken pieces skin-side down and cook undisturbed until they pull away easily from the pan and the skin is golden, 5-8 minutes.  Turn the pieces with tongs and cook for a minute longer, just to lightly brown the other side. Remove with tongs to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off all but a tablespoon of the oil and add the ginger, garlic, rice wine, stock or water, honey, star anise, and soy sauce to the pan.  Bring the mixture to a boil, add the clementine or orange juice, and put the chicken back into the skillet skin-side up (it should be about half-submerged with the crisp skin still exposed).  Simmer until the chicken is just cooked though, 5-10 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken to a plate and turn the heat to high. Bring the sauce to a boil and reduce until almost syrupy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the chicken to the pan to glaze in the sauce. Sprinkle with scallions and serve with white rice.</p>"}]}