{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110916-171043-pineapple-greens-and-tofu-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Thai", "keywords": ["Cook the Book", "Lynne Rossetto Kasper", "pineapple", "salad", "Sally Swift", "thai", "The Splendid Table's How to Eat Weekends", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pineapple, Greens, and Tofu with Roasted Chile-Coconut Dressing", "link": "https://www.seriouseats.com/recipes/2011/09/pineapple-greens-tofu-with-roasted-chile-coconut-dressing-recipe.html", "description": "This <strong>Pineapple, Greens, &amp; Tofu with Roasted Chile-Coconut Dressing</strong> is inspired by Su-Mei Yu's fascinating <em><a href=\"http://www.amazon.com/Elements-Life-Contemporary-Traditions-Healthier/dp/0471757071\">The Elements of Life</a></em>, a Thai cookbook that incorporates the tradition of eating for one's home element&mdash;earth, water, wind, or fire.  It's a gloriously fresh salad that incorporates the hot, sour, salty, and sweet that make Thai flavors so satisfying.", "totalTime": "25 minutes", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Pineapple", "Salads", "Thai", "Tofu"], "recipeIngredient": ["<strong>Roasted Chile–Coconut Dressing</strong>", "½ cup expeller-pressed canola oil ", "4 generous teaspoons coarsely ground Aleppo chile or other flavorful medium-hot to hot ground chile", "4 large garlic cloves, finely chopped", "1¹⁄³ cups coconut milk, or to taste", "2 to 2½ tablespoons Asian fish sauce", "4 tablespoons sugar", "¼ teaspoon salt", "Juice of ½ large lime", "&nbsp;", "<strong>Salad</strong>", "3 large handfuls mixed tart greens, such as the tender yellow hearts of escarole, arugula, frisée, curly endive, mizuna, watercress, purslane, lamb’s ear, and baby spinach", "8 to 10 leaves of napa cabbage, cut crosswise into thin slivers ", "4 scallions (white and green parts), thinly sliced ", "1½ cups bite-sized pieces fresh pineapple, or canned in pineapple juice and drained ", "½ cup roasted, salted, and broken cashews or peanuts ", "1½ to 2 cups diced firm tofu or cooked and diced tempeh, chicken, or seafood", "½ lightly packed cup fresh mint, cilantro, or basil leaves, torn", "Salt and freshly ground black pepper", "Juice of 1 to 1½ large limes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the dressing:</strong> In a 12-inch straight-sided sauté pan, combine the oil, chile, and garlic. Heat slowly over medium heat so the flavors will open up but nothing will burn, about 2 minutes. Stir with a wooden spatula until the garlic begins to sizzle, but do not let it brown.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly add the coconut milk, raise the heat to medium-high, and boil the coconut milk for 30 seconds, or until it’s a deep red-gold. Stir in 2 tablespoons  \u2028of the fish sauce, or more to taste. Then mix in the sugar and salt and boil for  \u202830 seconds, or until the dressing is thickened with glossy bubbles and is the  \u2028color of light caramel.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately scrape the dressing into a bowl to stop the cooking. Add the juice of half a lime. Rinse and dry the pan and keep it handy for reheating the dressing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the salad:</strong> Toss the greens and cabbage and divide them among 4 dinner plates. Divide the scallions, pineapple, cashews, tofu, and mint among the plates, scattering them over the greens. Season the salads with salt and pepper to taste.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the dressing in the pan to a bubble, then stir in the juice of ½ lime. Drizzle the warm dressing over each serving. Squeeze generous amounts of fresh lime juice over the salads and serve. \u2028</p>"}]}