{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111112-tortilla-soup-primary2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["quick", "soup", "turkey", "turkey soups"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Turkey Tortilla Soup", "link": "https://www.seriouseats.com/recipes/2011/11/turkey-tortilla-soup-recipe.html", "description": "Turkey and chilies go remarkably well together. Heck, the turkey's even the national bird of Mexico, or at least it would have been had the Golden Eagle and a half dozen other birds in line for the job in front of it had posed slightly less imposing silhouettes on a coat of arms. It <em>is</em>, however, widely consumed in Mexico.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Soups and Stews", "Turkey"], "recipeIngredient": ["2 cups peanut oil for frying tortilla strips (see note)", "4 corn tortillas, cut in half, then sliced crosswise into 1/2-inch strips (see note)", "Kosher Salt", "2 pasilla chilies", "2 ancho chilies", "2 whole chipotle chilies canned in adobo sauce plus 1 tablespoon sauce", "2 quarts low sodium canned or homemade chicken or turkey broth", "2 tablespoons vegetable oil", "1 large onion, finely diced", "1 whole poblano pepper, seeds and stem removed, finely diced", "2 cloves garlic, grated on a microplane grater", "2 teaspoons ground cumin", "1 pound leftover turkey meat, shredded by hand into rough 10-inch pieces", "sliced scallions, sliced cilantro, diced avocado, diced jalapeño and lime slices for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat peanut oil to 350°F in a dutch oven or wok over high heat. Add tortilla strips and fry, agitating with a metal spider or slotted spatula until strips are crisp, about 2 minutes. Transfer to a paper towel-lined plate, season with salt, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all chilis in a medium saucepan and add half of the chicken broth. Simmer over medium-high heat until the chilies are completely tender, about 15 minutes. Transfer to a blender or hand blender cup and blend until completely smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chilies are simmering, heat vegetable oil in a large saucepan or Dutch oven over high heat until shimmering. Add the onions and poblano pepper and cook, stirring frequently, until softened but not browned, about 2 minutes. Add garlic and cumin and cook, stirring constantly, until fragrant, about 30 seconds. Add remaining chicken broth. Add chili purée from step 2 as soon as it is ready. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil over high heat, reduce to a simmer, add turkey meat, and cook until flavors have blended, about 5 minutes. Season to taste with salt. Serve hot, passing tortilla strips, scallions, cilantro, avocado, jalapeños, and lime wedges at the table.</p>"}]}