{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110730-162562-GFTues-OatmealCookies.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["blueberries", "chocolate chips", "Cookies", "gluten free", "Gluten-Free Tuesday", "oatmeal", "oatmeal cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Tuesday: White Chocolate Blueberry Oatmeal Cookies", "link": "https://www.seriouseats.com/recipes/2011/07/gluten-free-tuesday-white-chocolate-blueberry.html", "description": "Oh, raisins. I've tried <em>and tried</em> to like them. At this point, I can tolerate a few <strike>especially if they are dipped in chocolate</strike> but in general I avoid them. This means I've turned down more than one oatmeal cookie because of the raisin element. But one day I threw a handful of dried blueberries into a batch of oatmeal cookies. <em>Oh my.</em> I finally got it. There's something wonderful about the chew and sweetness of dried fruit paired with the nutty-grain flavor of oatmeal.", "totalTime": "about one hour", "recipeYield": "makes about two dozen cookies", "recipeCategory": ["Blueberry", "Cookies", "Desserts", "Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["6 ounces (1 1/4 cups) brown or white rice flour", "3.25 (3/4 cup) sorghum flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "1/4 teaspoon xanthan gum", "6 ounces (1 1/2 sticks) unsalted butter, softened", "10 ounces (1 1/4 cups) brown sugar", "2 large eggs", "12 ounces (3 cups) gluten-free oats ", "5 ounces (about 1 cup) dried blueberries", "6 ounces (about 1 cup) white chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to the middle position and preheat oven to 350&deg;F.  Line a baking sheet with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, whisk together rice flour, sorghum flour, baking soda, salt, and xanthan gum. Set aside. In bowl of stand mixer, cream together butter and brown sugar on medium-high speed until light, about 45 seconds. Add eggs, one at a time. Mix until well combined and sugar-egg mixture lightens slightly, about 25 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off mixer and add whisked dry ingredients. Turn mixer back on to medium-low. Mix until a dough forms. The dough will be soft. Turn off mixer. Add oats, blueberries, and white chocolate chips. Turn mixer back on to medium-low. Blend until ingredients are thoroughly mixed throughout the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill dough for five minutes. Scoop dough, about one tablespoon each, onto prepared baking sheet. Bake until cookies are golden brown and set, about 18 minutes. Remove pan from oven. Allow cookies to cool on the baking sheet for three minutes before transferring to wire rack to cool. Allow pan to cool between batches. Repeat with remaining dough. </p>"}]}