{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110403-143879-eastertaco14.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy", "Choco Taco", "dessert tacos", "jelly beans", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "2"}, "name": "Cakespy: Easter Candy Dessert Taco Plate", "link": "https://www.seriouseats.com/recipes/2011/04/cakespy-easter-candy-dessert-taco-plate-recipe.html", "description": "What happens when you combine Easter Candy with a <a href=\"http://www.seriouseats.com/recipes/2009/02/how-to-make-a-choco-taco-from-scratch.html\">Choco Taco</a>?", "totalTime": "2 hours", "recipeYield": "6-8 tacos", "recipeCategory": ["Cakespy", "Candy", "Easter", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>For the taco shells:</strong>", "2 large eggs", "1/2 cup sugar", "1/4 cup (1/2 stick) butter, melted", "1/2 teaspoon vanilla extract", "1/3 cup all purpose flour", "1/4 teaspoon salt", "1/2 cup vegetable oil, for frying", "3-4 ounces chocolate morsels, or two approximately 2-ounce chocolate Easter bunnies", "1 tablespoon shortening", "<strong>For the filling:</strong>", "6-8 scoops ice cream (I used chocolate)", "1 cup assorted Easter candies of your choosing (I used Easter corn and red jelly beans)", "3/4 cup sweetened  shredded coconut, colored green with food coloring", "<strong>On the side:</strong>", "1 1/2 cups rice pudding", "1/2 cup jelly beans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the eggs and sugar in a large bowl until frothy. Whisk in the melted butter, cream, and vanilla. Gradually add the flour and salt and whisk until smooth. The batter should be pourable, like pancake batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a small non-stick skillet or griddle to medium-high heat. Pour a small amount of vegetable oil in the skillet (not all of it; you can replenish as needed), and when shimmering, pour about 1/4 cup of batter into the skillet; rotate the skillet to form a circle, about 5 inches in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the underside is golden brown, flip it over and cook until golden on the second side (this was about 1 minute for each side, for me). Remove the \"taco shell\" from the pan, and while still hot, drape over the fat handle of a wooden or heat resistant spoon, to form a taco shape. It will start to hold its shape after a few minutes; insert a toothpick half or a wadded-up piece of tinfoil to ensure that it maintains the shape and doesn't cave in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the remaining batter; you should have 6-8 taco shells. Replenish the vegetable oil as needed, if your skillet is getting dry-looking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the shells cool, melt your chocolate and shortening in the top of a double boiler. It is not necessary to use chocolate that comes in bunny form, but it is in keeping with the Easter theme, and awfully gratifying to watch them melt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once melted, gently coat the insides of the \"taco shells\" with chocolate, using a pastry brush. Re-insert your toothpicks or foil so that they won't cave in. Let them chill out for about an hour so that the chocolate can set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point, spoon a scoop of ice cream into each waiting shell. If you are not serving the tacos right away, you can wrap them in waxed paper at this point and store in the freezer until you are ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once ready to serve, add a handful of whatever Easter candy mix you'd like; you can press it into the ice cream to ensure that it sticks. Top each taco with your green-colored coconut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Optional: Serve each taco with a spoonful of rice pudding studded with jelly beans.</p>"}]}