{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111227rhino610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["animal crackers", "BraveTart", "Cookies", "crackers", "cut out cookies", "egg whites"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Homemade Animal Crackers", "link": "https://www.seriouseats.com/recipes/2011/12/bravetart-homemade-animal-crackers-recipe.html", "description": "These taste just like the animal crackers you buy in a vending machine, not the sort that come in an adorable cardboard boxcar. Those are cookies. These? These are decidedly crackers: not too sweet, hyper crisp, and begging for a glass of milk.", "totalTime": "4 hours", "recipeYield": "About 30 cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["8 ounces flour", "3 ounces unsalted butter, room temperature", "4 ounces sugar", "1/4 ounce powdered milk", "1/4 teaspoon nutmeg", "1/4 teaspoon salt", "1/8 teaspoon baking soda", "1/2 ounce vanilla extract", "1 1/2 ounces egg whites", "Extra flour for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cookie dough:</p>\n\n<p>Using a sieve to sift the flour. Set aside.</p>\n\n<p>Using a hand or stand mixer (fitted with a paddle attachment) cream together the butter and sugar, along with the powdered milk, nutmeg, salt and baking soda, on medium speed. Not until light and fluffy, but only until well combined. About a minute. Scrape the bowl down with a rubber spatula and cream a minute more.</p>\n\n<p>Set the mixer to low. Drizzle in the vanilla. With the mixer still running, add half the flour and mix until just incorporated. Then add half the egg whites. Repeat with the remaining flour and egg whites. Mix until homogenous, then shut off the mixer.</p>\n\n<p>Use a rubber spatula to scrape the cookie dough onto a large sheet of plastic wrap. Wrap the dough and refrigerate for at least 3 hours, or overnight, before rolling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut and bake the cookies:</p>\n\n<p>Preheat the oven to 350&deg; and have 2 parchment lined sheet pans standing by. </p>\n\n<p>On a well floured surface, roll the cookies to just a little over 1/4\" thickness (3/8\" if you like to be precise). Run a metal spatula between the dough and the rolling surface, to ensure the dough isn't sticking in any places. Cut the dough with your desired cutters and transfer the cut-outs to the cookie sheet. They won't spread significantly in the oven, so they can be placed fairly close together. </p>\n\n<p>If you like, dock the cookies twice with the tip of a clicky pen (clicked to the retracted position) to mimic the large, deep dock marks on the <a href=\"http://mike.shannonandmike.net/2010/10/28/animal-cracker-index/\" target=\"_blank\">originals</a>. </p>\n\n<p>You can gather, knead and re-roll the scraps three times; the dough is very forgiving.</p>\n\n<p>Bake the cookies for approximately 12 minutes, or until quite firm to the touch and just beginning to brown. Cool thoroughly. Store in an airtight container at room temperatures for up to a month.</p>"}]}