{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110919-171366-mahogany-glazed-chicken-wings.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["appetizers", "chicken wings", "Cook the Book", "Lynne Rossetto Kasper", "Sally Swift", "The Splendid Table's How to Eat Weekends", "wings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Mahogany-Glazed Chicken Wings", "link": "https://www.seriouseats.com/recipes/2011/09/mahogany-glazed-chicken-wings-recipe.html", "description": "Cooking my way through <em>How to Cook Weekends</em>, it's becoming more and more clear that Lynne and her producer <a href=\"http://splendidtable.publicradio.org/press/#bios\">Sally Swift</a> not only put out a great radio show but excel in recipe writing.  The steps for making these sticky-salty-sweet-and-sour wings are laid out in a manner that's both comprehensive and informative, the sort of recipe that leaves cooks with no lingering questions and a plate of truly spectacular wings.", "totalTime": "12 to 48 hours refrigeration in marinade; 2 hours oven time", "recipeYield": "4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Cook the Book"], "recipeIngredient": ["½ cup hoisin sauce", "½ cup soy sauce ", "¼ cup honey", "¼ cup Chinese plum sauce", "¼ cup dry sherry", "¼ cup cider vinegar", "6 large garlic cloves ", "3¼ to 4 pounds chicken wings, rinsed and pierced in several places with a paring knife"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender or food processor, purée the hoisin sauce, soy sauce, honey, plum sauce, sherry, cider vinegar, and garlic. Reserve ¼ cup of the marinade for basting the wings. Combine the remaining mixture with the chicken wings in large plastic bags and refrigerate for 12 to 48 hours.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325ºF. Line a large shallow baking pan (a half-sheet pan is ideal) with foil. Set a large cake rack inside the pan. Arrange the wings on the rack, trying not to stack them so they can all caramelize evenly.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the chicken for 1¼ to 1½ hours, turning the wings often and basting them with the reserved marinade until the last 30 minutes of cooking. Halfway through the roasting, pierce each wing several times with a knife to release some of its fat and help it crisp. The wings are cooked when they are easily pierced with a knife. If in doubt, roast longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give the wings a final crisping by raising the heat to 450ºF. for 15 to 20 minutes, turning them so they are a rich red-brown on all sides. Pile the wings on a platter and serve warm or at room temperature. </p>"}]}