{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110412-146068-eastercorn5.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy", "candy corn"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Homemade Easter Corn", "link": "https://www.seriouseats.com/recipes/2011/04/cakespy-homemade-easter-corn-recipe.html", "description": "It's time to let you in on a little secret: <strong>Easter Corn is the same thing as Candy Corn, but colored differently.</strong> And like Candy Corn, it tastes better when made at home.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cakespy", "Candy", "Easter"], "recipeIngredient": ["2 1/2 cups confectioners' sugar, sifted", "1/3 cup powdered milk", "1 cup granulated sugar", "2/3 cup light corn syrup", "1/3 cup salted butter", "1 teaspoon vanilla extract", "Various food colorings in pastel colors"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized bowl, whisk the sifted confectioners' sugar and powdered milk together; set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the granulated sugar, corn syrup, and butter over high heat, stirring frequently until it comes to a boil. Reduce heat to medium, stir in the vanilla, and continue stirring frequently for five minutes. The mixture will begin to reduce and thicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat. Stir in the confectioners' sugar bit by bit, stirring after each addition, until it has all been mixed into the wet mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can either leave the dough in the saucepan, or turn it out into a bowl sprinkled with confectioners' sugar, just until it is cool enough to be handled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into as many sections as you'd like to create colored segments for your finished candy, and place them in small separate bowls. Mix each mound of dough with food coloring until the color is consistent and streak-free. (You might want to wear gloves to ensure that you don't stain your hands)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On top of a sheet of waxed or parchment paper, roll out each color of dough into a long, thin rope. The thinner the rope, the smaller that segment of color will be in your finished candy. I created 3 ropes about 12 inches long for each color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press together your ropes of dough in whatever color combination you'd like; I ended up with three separate 12-inch long \"lines\" of colored candy. To ensure that each segment sticks together, press a second sheet of waxed or parchment paper on top and press very gently with a rolling pin or your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a very sharp knife, cut dough into triangle segments. Keep a damp, clean cloth nearby to wipe off the knife should it get sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the finished kernels set for an hour or two before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Optional: up the cute quotient by placing a dab of green frosting in the inside of a lid of an empty baby food container, and place 2-3 kernels on top, then screw on the jar, bottom-side up, to create a magical forest of an Easter Corn terrarium.</p>"}]}