{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111207HoneyThymePorkLoin.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["honey", "pork", "The Secret Ingredient"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "The Secret Ingredient (Honey): Honey-Thyme Roasted Pork Loin", "link": "https://www.seriouseats.com/recipes/2011/12/the-secret-ingredient-honey-honey-thyme-roast.html", "description": "Pork loin, lean, tender, and juicy, is doused in a honey-butter-thyme glaze, and then roasted until the honey bubbles up and sticks in a sweet-savory layer on the outside of the pork.  Served with an earthy and easy pan sauce, this is the easiest and best way to cook pork.", "totalTime": "25 minutes", "recipeYield": "2 to 3 servings", "recipeCategory": ["Mains", "Pork", "The Secret Ingredient"], "recipeIngredient": ["1 1 1/4-pound pork tenderloin", "Kosher salt", "Freshly cracked black pepper", "2 tablespoons olive oil", "3 tablespoons fresh thyme", "1/4 cup thyme or lavender honey", "1 tablespoon unsalted butter, room temperature", "1/4 low-sodium organic chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F.  Take the pork out of the fridge 15 minutes before you want to use it.  Pat it dry with a paper towel, and season the pork liberally on all sides with salt and pepper.  Heat the olive oil in a skillet over medium-high heat.  When the oil shimmers, sear the pork until golden brown on all sides, about 3 minutes per sides, or 12 minutes total.  Take the pork out of the pan, and add the chicken stock.  Scrape up all the brown bits from the bottom of the pan, and reserve the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pork is searing, whisk together the thyme, honey, and butter until completely incorporated.  Season the mixture with salt and pepper.  Carefully rub the mixture all over the outside of the seared pork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the honey-ed pork on a foil-lined rimmed baking sheet that has been lightly oiled.  Use a spoon to pour any of the honey mixture that runs off the meat back on top of the pork loin.  Pour the chicken stock from the searing pan into the baking sheet.  Roast the pork in the oven until the pork reaches an internal temperature of 145°F.  Take the pork out of the oven, tent with foil, and allow to rest for 10 minutes.  Slice into medallions, and serve with the pan sauce and a few extra sprigs of fresh thyme.</p>"}]}