{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111210-182925-sunday-brunch-bran-brandy-muffins-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["bran", "brandy", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brandy Bran Muffins", "link": "https://www.seriouseats.com/recipes/2011/12/brandy-bran-muffins.html", "description": "To me, muffins have never been the most enticing food.  There's something about the overly sweet, sticky lumps sitting in a cardboard box in my office kitchen that I've always found disconcerting. But the lightly toasted bran, and sweet, soft, boozy raisins make this recipe a muffin I crave.  Bran may not be the flashiest muffin, but it's the simplicity of the flavors in this recipe that drew me in.  If you end up with any leftover muffins the following morning I recommend cutting a muffin in half, smearing it in butter, then searing the buttered side in a hot pan until crisp.", "totalTime": "45 minutes", "recipeYield": "makes 12 muffins", "recipeCategory": ["Bread", "Breakfast and Brunch", "Breakfast Sweets"], "recipeIngredient": ["1 cup wheat bran", "1 cup raisins", "1/2 cup brandy", "1/2 cup buttermilk", "1/2 cup water", "1/2 cup brown sugar", "1/2 cup vegetable oil", "1 egg", "1 egg white", "3/4 cup all purpose flour", "1/2 cup whole wheat flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F.  Line a 12-muffin tin with muffin cups or grease with cooking spray or butter.  Place bran on a baking sheet and bake for 6-8 minutes, tossing once until bran smells toasted.  Remove from oven and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix raisins and brandy together, and if possible let sit for an hour or more until plumped.  If not, heat gently over low heat, making sure alcohol doesn’t ignite.  Mix together buttermilk, water, brown sugar, vegetable oil, egg and egg white until thoroughly combined.  In another bowl combine all-purpose flour, whole wheat flour, baking powder, baking soda, salt and toasted bran and mix well.  Mix together buttermilk mixture and raisin/brandy mixture and then combine with dry ingredients.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each muffin cup evenly with batter and bake until center of each muffin is set, about 30 minutes.  Serve with room-temperature butter and hot coffee topped with brandy.</p>"}]}