{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/452011-145942-garlic-octopus.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["octopus", "olive", "seafood", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Garlic and Olive Octopus", "link": "https://www.seriouseats.com/recipes/2011/04/garlic-and-olive-octopus-recipe.html", "description": "Octopus can intimidate the home cook. Once you understand that it takes <strong>two simple techniques</strong> to take octopus from threatening foe to cherished dinnertime friend, you'll be hooked on its mild oceanic flavor and slightly springy texture.", "totalTime": "2 to 3 hours (depending on size of octopus)", "recipeYield": "4", "recipeCategory": ["Grilling", "Mains", "Olives", "Other Seafood", "Sunday Supper"], "recipeIngredient": ["3 to 4 small cleaned octopus (about 3 pounds)", "6 garlic cloves, crushed", "1/2 bunch parsley", "1 lemon, quartered", "8 black peppercorns", "Olive oil", "1 small onion, finely chopped", "6 garlic cloves, sliced", "1 (28 ounce) can peeled plum tomatoes", "8 ounces manzanilla olives", "1/2 teaspoon red pepper flakes to taste", "Kosher salt and cracked black pepper", "1 pound fresh pasta (like pappardelle) or 1 loaf of crusty bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place octopus, garlic cloves, parsley, peppercorns and lemon in pot cover with cold water and bring to a simmer.  Cook until octopus is tender and skin comes easily from firm white flesh.  Depending in the thickness of the octopus tentacles this can take anywhere from 1-1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once octopus is tender remove from the pot with tongs and discard liquid and remaining ingredients.  Reserve until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle large skillet with olive oil and heat until shimmering.  Add onion and cook until softened then add garlic.  Cook until garlic just begins to take on color.  Remove tomatoes from liquid and add to onion and garlic, crushing each tomato in your hands before adding it.  Simmer until sauce begins to thicken, about 15 minutes.  Add red pepper flakes, and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once octopus is cool enough to handle, Gently remove from flesh carefully with fingers or using a paper towel.  Separate tentacles from one another, and slice head into strips.  Drizzle octopus with olive oil and sprinkle with salt and pepper, heat grill pan until smoking and place octopus on grill, cook until just beginning to char, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If serving with pasta, cook pasta and toss with tomato sauce and serve topped with charred octopus.  Or, if serving with bread place pasta sauce in serving dish, top with charred octopus and serve with sliced bread charred on the grill.</p>"}]}