{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110801-163334-silken-tofu-katsuoboshi-primary.JPG", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": ["how tos", "soybeans", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Fresh Silken Tofu", "link": "https://www.seriouseats.com/recipes/2011/08/fresh-silken-tofu-recipe.html", "description": "This is the most sure-fire method that I have tried. I have gotten smooth, custard-like tofu with this recipe every time.", "totalTime": "1 hour 25 minutes (including chilling time, if desired)", "recipeYield": "Six Â½-cup portions", "recipeCategory": ["Beans and Pulses", "Tofu", "Vegetarian"], "recipeIngredient": ["One batch homemade soy milk (see recipe), about 3 cups, chilled  ", "½ teaspoon Epsom salt or magnesium chloride (nigari) dissolved in 2 tablespoons water", "Optional garnishes such as dried bonito flakes, soy sauce or ponzu sauce, freshly grated ginger, finely chopped cucumber, chopped scallion"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the Epsom salt or magnesium chloride coagulant solution into the soy milk, using a spoon to blend them together with a couple of gentle plunging motions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taking care not to agitate the mixture too much, distribute it among 6 ½-cup heatproof bowls, cups or ramekins. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the filled dishes in a pan that is deep enough to accommodate them. Pour simmering water into the pan so that it reaches the same level as the soy milk mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pan with a lid that is lined with a clean, dry dish towel (fold up the edges over the lid to prevent the towel from catching fire) and simmer gently over low heat until the tofu is just set. It should jiggle like a custard. The exact time will vary depending on the thickness and material of your dishes, but should be roughly 10 minutes. If you use larger dishes, it will take a little longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the dishes from their water bath and allow the tofu to set a little further for about 10 minutes at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or chilled. The tofu can be served directly in their little bowls or inverted onto a small dish. Some serving suggestions: garnish with lemon zest, finely chopped cucumber, and sea salt flakes; dried bonito flakes and ponzu sauce; freshly grated ginger, chopped scallion, and soy sauce. </p>"}]}