{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110209-137060-asian-cabbage-rolls-with-pork.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cabbage", "Cook the Book", "Faith Durand", "Not Your Mother's Casseroles", "pork", "stuffed cabbage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Asian Cabbage Rolls with Spicy Pork", "link": "https://www.seriouseats.com/recipes/2011/02/asian-cabbage-rolls-with-spicy-pork-recipe.html", "description": "Stuffed cabbage is one of those wonderfully forgiving creations that can be flavored with virtually any combination of flavors and still emerge from the oven hearty, delicious, and totally satisfying. Steamed or sauced; stuffed with pork, beef, lamb, or chicken; there's something magical that happens when the cabbage leaves are stuffed and baked.  This recipe for <strong>Asian Cabbage Rolls with Spicy Pork</strong> from <a href=\"http://www.faithdurand.com/\">Faith Durand</a>'s <a href=\"http://www.amazon.com/Your-Mothers-Casseroles-Faith-Durand/dp/1558324844/serieats-20\"><em><strong>Not Your Mother's Casseroles</strong></em></a> takes a savory, gingery approach with a filling inspired by Chinese dumplings.", "totalTime": "35 minutes", "recipeYield": "8", "recipeCategory": ["Cabbage", "Cook the Book", "Pork"], "recipeIngredient": ["2 large heads napa cabbage", "2 teaspoons salt", "1 pound ground pork", "1 cup cooked white rice, from 1⁄3 cup rice steamed in 2⁄3 cup water", "1⁄2 pound shiitake mushrooms, finely chopped", "2 large eggs, beaten", "1 tablespoon toasted sesame oil", "1⁄4 cup reduced-sodium soy sauce", "One 3-inch piece fresh ginger, peeled and grated ", "4 cloves garlic, minced or 1 tablespoon garlic paste", "Freshly ground black pepper", "1 bunch scallions, chopped", "2 cups fresh cilantro, chopped ", "<strong>For the sauce:</strong>", "1⁄4 cup reduced-sodium soy sauce", "1⁄4 cup rice vinegar", "1 cup low-sodium chicken broth", "1 tablespoon toasted sesame oil ", "1 teaspoon sugar", "1 teaspoon sriracha or other hot chili sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Remove 24 large outer leaves from the heads of cabbage (take 12 from each). Roll each leaf with a rolling pin gently to flatten and smooth it. Core the remaining cabbage and chop it very fine. Sprinkle it with the salt and set aside in a colander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, mix the pork, rice, mushrooms, beaten eggs, sesame oil, soy sauce, ginger, garlic, and a generous amount of black pepper. Stir in the scallions and cilantro. Press and drain any remaining water off the salted cabbage and stir the cabbage in as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Lay a prepared cabbage leaf down with the stem end facing you. Place about 2⁄3 cup meat mixture onto the stem end of the cabbage leaf. Fold in the sides and roll up the leaf, then place the bundle, seam side down, in one of the baking dishes. Repeat with the rest of the cabbage leaves and meat mixture, placing 2 rows of 6 rolls in each dish. (If you have any leftover mixture it can be rolled into meatballs and tucked between the cabbage rolls to bake with them.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, whisk together all the ingredients in a small bowl and pour it over the cabbage rolls, dividing it between the 2 baking dishes. (At this point the rolls can be covered and refrigerated for up to 24 hours. You can also freeze one dish for later use. Before adding the sauce, place the dish in the freezer and let the rolls freeze completely, then remove the rolls from the dish and stack them in a freezer bag or container. To bake, thaw the rolls in the refrigerator overnight, place in a baking dish, pour the sauce over them, and bake as directed below.)<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, uncovered, for 35 minutes, or until an instant-read thermometer inserted into a roll at the center of the dish registers 160°F. Serve drizzled with the pan juices.<br />\n</p>"}]}