{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110822-127677-LTE-Nilla-Wafer-Banana-Cake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["bananas", "cakes", "Let them eat cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Nilla Wafer-Banana Cake", "link": "https://www.seriouseats.com/recipes/2011/08/let-them-eat-nilla-wafer-banana-cake-recipe.html", "description": "This is a mash-up of recipes. I'd shelved a banana cake recipe that had a few accidents along the way, but when I remembered the Nilla Wafer cake, I decided to dust it off and give it another go with the new secret ingredient. Mashed up bananas are cooked until reduced and concentrated for a stronger backbone of flavor. Of course, there are Nilla wafer crumbs for that signature vanillin flavor, and brown sugar and buttermilk are also ingredients. It's moist, rich, complex and coated with brown sugar cream cheese icing. It's sensational. Wish I had a piece of it left.", "totalTime": "3 hours", "recipeYield": "8 to 10", "recipeCategory": ["Banana", "Cakes"], "recipeIngredient": ["<strong>For the Cake:</strong>    ", "Baking spray", "8 ounces (2 sticks) plus 2 tablespoons unsalted butter, at room temperature", "3 medium-sized ripe bananas, mashed (See Notes)", "2 cups plus 2 tablespoons packed light brown sugar", "1 1/2 cups Nilla Wafer crumbs (See Notes)", "1 1/2 cups all-purpose flour", "1 1/2  teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "3/4 cup buttermilk, at room temperature", "1 teaspoon pure vanilla extract", "3 large eggs, at room temperature", "   ", "<strong>For the Frosting:</strong>    ", "16 ounces cream cheese, cut into small pieces, at room temperature", "4 ounces (1 stick) unsalted butter, at room temperature", "1 tablespoon pure vanilla extract", "1/2 teaspoon salt", "1/2 cup confectioners’ sugar", "1/2 cup light brown sugar", "1 cup toasted pecans, coarsely chopped (See Notes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cake:</strong>  Adjust oven rack to middle position and preheat oven to 350°F. Lightly coat cake pans with baking spray. Line bottoms of cake pans with parchment paper rounds and coat lightly with baking spray once again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons butter in medium skillet over medium-high heat. Add mashed bananas and 2 tablespoons brown sugar and cook, stirring, until banana cooks down to a paste and reduces to 1/2 cup, about 10 minutes. Transfer to plate and cool completely, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whisk together cookie crumbs, flour, baking powder, baking soda, salt, cinnamon, and nutmeg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In separate medium bowl, whisk together buttermilk, vanilla, and cooled mashed bananas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, beat remaining 2 sticks butter and remaining 2 cups brown sugar on medium speed until light and fluffy, about 3 minutes. Add eggs, one at a time, beating well after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decrease mixer speed to low and add cookie crumb mixture in three batches, alternating with banana mixture. Scrape sides and bottom of bowl with rubber spatula as needed. Increase speed to medium and beat mixture just until combined, 20 to 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape equal amounts of batter into prepared pans. Bake 30 to 35 minutes, rotating and alternating cakes’ positions halfway through baking, until a cake tester comes out clean when inserted in center of cakes. Transfer to cooling racks and cool in pans 10 minutes. Invert cakes directly onto cooling racks and cool completely, 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the frosting:</strong> Using whisk attachment, whip cream cheese, butter, vanilla, and salt on medium speed until light and fluffy, about 2 minutes. Reduce speed to low, add confectioners’ sugar and light brown sugar, and whip until incorporated, scraping bottom and sides of bowl with rubber spatula as needed, 30 to 60 seconds. Increase speed to medium-high and continue to whip until frosting is light and fluffy, 2 to 3 minutes. Stir in pecans.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble:</strong> Place one cake round on serving dish or cake stand and spread with a heaping cup of frosting. Top with second cake round and frost sides and top of cake. Serve. </p>"}]}