{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110513-149986-goat-cheese-brownies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["brownies", "Bruce Weinstein", "chocolate desserts", "Cook the Book", "goat cheese", "Goat: Meat Milk Cheese", "Mark Scarbrough"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Cook the Book: Goat Cheese Brownies", "link": "https://www.seriouseats.com/recipes/2011/05/goat-cheese-brownies-recipe.html", "description": "These <strong>Goat Cheese Brownies</strong> are an ideal introduction to the world of goat-centric desserts, all moist and chocolatey upfront but made with enough chèvre and goat butter to give them a bigger goat flavor. Adding goat cheese in place of some of the butter makes for brownies with an intriguingly light texture&mdash;not chewy and dense or crumbly and cake-like&mdash;these have a lovely, almost melting softness about them.", "totalTime": null, "recipeYield": "about 24 brownies", "recipeCategory": ["Bake the Book", "Chocolate", "Cook the Book", "Cookies", "Desserts"], "recipeIngredient": ["10 tablespoons cool goat butter (or cow butter, if you must), cut into small bits, plus a little extra for greasing the baking dish ", "2 cups all-purpose flour, plus more for the baking dish", "4 ounces dark or bittersweet chocolate (between 60% and 72% cocoa solids), chopped", "4 ounces unsweetened chocolate (sometimes called baking chocolate), chopped", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "8 ounces fresh chèvre or soft goat cheese", "1 3/4 cups sugar", "1 large egg, at room temperature", "4 large egg yolks, at room temperature", "1 tablespoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sure the rack is in the center of the oven and get the oven heated up to 350 °F (177 °C). Take a little butter on a wadded-up paper towel or piece of wax paper and run it around the inside of a 9 x 13-inch (23 x 33-cm) baking dish, coating the whole thing, particularly the corners and edges. You can also use the butter wrapper for this job because it often has butter still adhering to its inside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a little flour in the baking dish and turn it this way and that to make sure the flour covers the bottom and sides, knocking it against the counter to get the flour off sticky spots and moving easily across the dish. (You’ll also be able to see if you’ve got any spots without a slick of butter—you can fix these at this point.) Tap the baking dish on one edge against the counter to get all the flour down in one corner, then dump out the excess flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt all the chocolate. You can do this in one of several ways:</p>\n\n<p>Set a double boiler with about an inch (2.5 cm) of water in the bottom part over medium heat. Bring the water to a simmer, add both kinds of chocolate to the top part, and reduce the heat to low so the water simmers slowly; stir until about two-thirds of the chocolate has melted. Turn off the heat, remove the top part of the double boiler from the bottom pan, and continue stirring on the counter until the chocolate has fully melted.</p>\n\n<p>Do a similar operation with a jury-rigged double boiler: a medium saucepan and a mixing bowl that fits securely in it without touching the water bubbling beneath. Be careful when you remove the bowl—escaping steam can cause nasty burns.</p>\n\n<p>Put both kinds of chocolate in a big bowl and microwave on high in 6- or 7-second increments, stirring after each, until the chocolate is about two-thirds melted. Then take the bowl out of the microwave and continue stirring on the counter until all the chocolate has melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix 2 cups (455 g) flour, the baking powder, and salt in a bowl with a fork to make sure the baking powder and salt are evenly distributed throughout the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter, chèvre, and sugar in a separate bowl with an electric mixer at medium speed until creamy and light, maybe up to 5 minutes. You can barely overbeat the thing at this stage. You want it light and airy, the sugar mostly dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat in all the melted chocolate, scrape down the inside of the bowl, and beat in the whole egg until fully incorporated. Then beat in the egg yolks one at a time (or close enough if you’ve already got them together in one small bowl—the real point is to make sure the eggs get fully mixed into the batter). Finally, beat in the vanilla.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the beaters, scrape them down, and remove them. Add the flour mixture and fold it in with a rubber spatula or a wooden spoon, turning it over in the batter just until there are no more bits of undissolved flour. You can overbeat—and even overstir—the mixture at this point, getting that gluten too gooey and stretchy. Once there’s no more white flour in the mix, scrape and spread the batter into the prepared baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until set, until a toothpick or cake tester inserted into the center of the brownie comes out with a few moist crumbs attached, about 25 minutes. The more crumbs, the fudgier the thing will be. But no wet batter on the toothpick, please. Cool the brownies in the baking dish on a wire rack for at least 10 minutes before cutting into squares. These can be stored between sheets of wax paper in a sealable plastic container for up to 5 days at room temperature or up to 4 months in the freezer.</p>"}]}