{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110405-venison-neck-pot.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["braise", "game meats", "Nasty Bits", "neck", "red wine", "venison"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Wine-Braised Venison Neck", "link": "https://www.seriouseats.com/recipes/2011/04/wine-braised-venison-neck-recipe.html", "description": "Adapted from Bones by Jennifer McLagan...", "totalTime": "4 hours", "recipeYield": "6", "recipeCategory": ["Braising and Stewing", "Other Meats", "The Nasty Bits"], "recipeIngredient": ["1 bone-in venison neck, about 5 pounds", "15 grams dried wild mushrooms", "Kosher salt and freshly ground black pepper", "3 tablespoons vegetable oil", "5 ounces slab bacon or pancetta, rind removed and cut into 4 pieces", "2 roughly chopped onions", "2 roughly chopped celery stalks", "2 garlic cloves", "1 large rosemary sprig", "2 bay leaves", "5 sage leaves", "3 flat leaf parsley stems", "1 thyme sprig", "1 long cinnamon stick", "Zest of 1 lemon, removed in wide strips", "5 cups Barbaresco or other hearty dry red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One hour before cooking, remove neck from refrigerator. Pour 2 cup boiling water over the mushrooms in a small bow, and leave them to soak.  Preheat the oven to 300 F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the neck dry and season with salt and pepper.  In a dutch oven or large flameproof casserole, heat 2 tablespoons of the oil over medium high heat.  Brown the neck on all sides, including the bone.  Transfer the meat to a plate and discard any fat from the pot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bacon or pancetta and the remaining 1 tablespoon of oil to the pot and cook over low heat for 2 minutes.  Increase the heat, add the onions, carrots, and celery, and cook until the onions begin to soften, about 5 minutes, scraping the bottom of the pot frequently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift the mushrooms from the soaking liquid and add them to the pot, along with garlic and herbs.  Strain the mushroom liquid through a fine sieve, discarding any sand or grid, and the liquid to the pot, with the cinnamon stick and lemon zest. Bring to a boil, deglazing the pot by scraping the browned bits from the bottom.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the neck int the pot.  Pour in any meat juices, add the wine, and bring to a boil. Cover with a damp piece of parchment paper and then the lid, and braise in the oven for 3 to 3.5 hours.  The meat should be very tender and lift easily from the bone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the neck to a platter and cover with saran wrap to prevent drying out.  Discard the herbs, cinnamon stick, and zest and let the sauce cool off slightly, then puree it with an immersion blender or food processor.  Bring the sauce to a boil, skim off the foam, and boil hard for 10 to 12 minutes to reduce it to 4 cups.  Cool the meat and sauce separately, then refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove any fat from the sauce.  Preheat the oven to 300 F. Place the neck back into the pot with the sauce and place into the oven.  Depending on you like to serve your meat, either serve in the pot, letting your guest take the neck meat off the bone, or debone prior to bring the neck to the table. </p>"}]}