{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002-nick-malgieri-OrangeCake13.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["cakes", "Guest Star", "Nick Malgieri", "Nick Malgieri Week", "olive oil", "orange"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange-Scented Olive Oil Cake", "link": "https://www.seriouseats.com/recipes/2011/10/orange-scented-olive-oil-cake-recipe.html", "description": "This is a great dessert to make if you're expecting a crowd; it makes 2 cakes with one batter that's easily mixed. The best part is that they can be made days in advance, wrapped, and frozen, so you don't have to fuss any more than defrosting the cakes and making some whipped cream before you serve them.", "totalTime": "", "recipeYield": "Makes 2 9-inch round cakes", "recipeCategory": ["Cakes", "Orange"], "recipeIngredient": ["3 large navel oranges", "3 large eggs", "2 1/2 cups sugar", "1 1/2 cups pure or light olive oil", "1 1/2 cups whole milk", "2 1/2 cups all purpose flour (spoon flour into dry-measure cup and level off)", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a rack in the middle level of the oven and preheat to 350 degrees. Oil two 9-inch round pans, 2 inches deep, and line the bottoms with disks of parchment paper cut to fit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate the zests from the oranges into the bowl of a stand mixer.  Then use a knife to completely cut away the remaining skin from the oranges.  Cut the oranges into 3/8-inch thick slices and refrigerate them covered for serving with the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs to the bowl containing the orange zest and whisk well to mix.  Whisk in one cup of the sugar.  Place the bowl on the mixer and whip with the whisk attachment until light, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By hand, whisk in the oil, followed by the milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl, stir together the remaining 1 1/2 cups sugar with the flour, baking powder, baking soda, and salt.  Whisk into the egg mixture in three separate additions, whisking smooth after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter equally between the prepared pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cakes until they are well risen, deep golden, and firm in the center when pressed with a fingertip, about 50 to 55 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the cakes on racks for 5 minutes, then unmold, turn right side up again, and cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong>  Serve a wedge of the cake with some of the sliced oranges and a dollop of whipped cream.  Fritz suggests a scoop of vanilla ice cream or orange sherbet as other good accompaniments.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Store:</strong>  Double wrap the cakes in plastic wrap, keep them at room temperature, and use them within 24 hours.  Or freeze them for up to a month.  Defrost and bring them to room temperature before serving.</p>"}]}