{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110629-127355-dinner-tonight-grilled-zucchini-prosciutto.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "lentils", "salad", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Lentil Salad with Grilled Zucchini and Prosciutto", "link": "https://www.seriouseats.com/recipes/2011/07/dinner-tonight-lentil-salad-with-grilled-zucchini-prosciutto.html", "description": "I love the time of year, when zucchini just starts to pop up at the farmers' market, and this recipe from <a href=\"http://thestonesoup.com/blog/2010/02/the-definitive-guide-to-salad-part-5-legumes/\">Stonesoup</a> is the perfect way to show off the vegetable. A simple lentil salad gets spruced up here with the addition of grilled ribbons of zucchini and a few slices of salty prosciutto. The lightly blackened vegetable lends a smokey essence to each bite, while the prosciutto helps make this a relatively filling main course salad.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Grilling", "Mains", "Salads", "Zucchini"], "recipeIngredient": ["6 ounces small green lentils ", "2 tablespoons red wine vinegar", "2 garlic cloves, lightly crushed", "8 tablespoons extra-virgin olive oil, divided ", "salt and pepper ", "6 medium zucchini, finely sliced lengthwise into ribbons", "6 sprigs flat leaf parsley, stems discarded, leaves chopped", "4 ounces thinly sliced prosciutto "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour lentils into a medium-sized saucepan and cover with water by an inch. Turn heat to medium and bring to a boil, and then reduce heat to maintain a steady simmer. Cook until lentils are tender, about 15 minutes, and then drain them in a colander. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk together the vinegar, four tablespoons of oil, and garlic in a large bowl. Add the lentils and toss well. Season to taste with salt and pepper </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a grill for medium-high heat, or set a grill pan on the stove and turn the heat to medium-high. Toss the zucchini slices with the remaining olive oil in a bowl. Place as many of the zucchini slices on the grill or grill pan as will fit comfortably in one layer. Cook until grill marks appear on the bottom, one to two minutes. Flip the pieces and cook again until the grill marks appear. Transfer cooked slices to the bowl with the lentils. Repeat process until all zucchini slices are cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the zucchini and lentil salad, and then divided it among four large plates. Also, divide the prosciutto among the plates. Serve with additional salt if necessary, but watch out, the prosciutto is pretty salty. </p>"}]}