{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205-182838-lemon-meringue-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["lemon desserts", "lemons", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon Meringue Pie", "link": "https://www.seriouseats.com/recipes/2011/12/classic-lemon-meringue-pie-recipe.html", "description": "This is a great recipe for a classic lemon meringue pie, with just a slight twist. Instead of a raw French meringue topping, it has one made of Swiss meringue instead. I think the texture is better with the Swiss Meringue, but it's important to only make the meringue just before you plan to serve it, or else it will get rubbery on top.", "totalTime": "8 hours", "recipeYield": "Serves 8", "recipeCategory": ["Desserts", "Lemon", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "4 3/4 ounces (1/4 cup plus 1 teaspoon) freshly squeezed and strained lemon juice", "14 ounces (3/4 cup plus 1 tablespoon) water", "17.5 ounces (2 1/3 cup) granulated sugar, divided", "1.5 ounces (1/4 cup) cornstarch", "1/2 teaspoon salt", "4 egg yolks", "1.5 ounces (3 tablespoons) cold butter, cut into small pieces", "4 egg whites", "Pinch salt", "Pinch cream of tartar", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. Line the shaped, chilled, pie crust with parchment or foil and fill with weights (I like reusing dried beans for this purpose) and bake for 15 minutes on the lower rack. Remove the liner and weights and bake until the whole crust is golden brown. Remove from the oven and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the lemon juice, water, and zest in a medium sized saucepan. Whisk together the cornstarch, 9 ounces (1 1/3 cups) sugar, and salt, and add it to the saucepan. Whisk the egg yolks then add them to the mixture and whisk continuously over medium heat until the mixture becomes thick and bubbles, 7 to 8 minutes. Whisk for an additional two minutes once it's begun to bubble, without stopping, then remove from heat. Whisk in the butter until it is completely melted. Pour the mixture into the baked pie shell and press plastic wrap directly onto the surface. Allow the pie to come to room temperature, then chill for at least four hours (ideally, overnight) with the plastic wrap still on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before serving: Fill medium saucepan one quarter full with water. Set the saucepan over medium heat, and bring water to a simmer.Combine egg whites, remaining sugar, and cream of tartar in the heatproof bowl of electric mixer, and place over saucepan. Whisk constantly until sugar is dissolved and whites are warm to the touch, 3 to 3 1/2 minutes. Test by rubbing between your fingers. Transfer bowl to electric mixer fitted with the whisk attachment, and whip, starting on low speed, gradually increasing to high until stiff, glossy peaks form, about 10 minutes. Add vanilla, and mix until combined. Remove the plastic from the top of the chilled pie and top with the meringue. Place the pie under the broiler and watch if carefully, the top should brown but not burn, and it changes quickly. Chill for 10 minutes, then serve.<br />\n</p>"}]}