{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/622011-154840-lobsterfarro.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["farro", "lobster", "salads", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Supper: Grilled Lobster Tails with Warm Farro, Roasted Corn and Tomato Salad", "link": "https://www.seriouseats.com/recipes/2011/06/grilled-lobster-tails-with-warm-farro-roasted-corn-seafood-recipe.html", "description": "Simple meals that feel elegant are just what Sunday evenings in the summer call for&mdash;and this grain salad with grilled lobster is just that. Although this dish is equally successful using a grill pan or an actual grill, it's far more festive to sear these tails outdoors.  If you've never cooked farro before, it's a whole grain that to me feels somewhere between brown rice and barley, and it's delicious served room temperature in this salad.", "totalTime": "1 hour 15 minutes", "recipeYield": "4", "recipeCategory": ["Grilling", "Lobster and Crab", "Mains", "Salads", "Sunday Supper"], "recipeIngredient": ["2 ears corn", "Olive oil", "Kosher salt and cracked black pepper", "1/4 cup cider vinegar", "3 tablespoons olive oil", "1 teaspoon Dijon mustard", "1 cup farro, cooked according to package directions", "1 pint cherry tomatoes, halved", "4 sprigs of thyme, leaves plucked off", "4 lobster tails"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your grill or grill pan.  Shuck both ears of corn and drizzle with olive oil, salt and pepper.  Grill until some of the kernels begin to char, about 6 minutes.  Remove from grill.</p>\r\n\r\n<p><br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together vinegar, olive oil and Dijon mustard, and season with salt and pepper.  Toss dressing with farro and cherry tomatoes (and leaves from thyme springs) and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split your lobster tails in half by slicing through the underside.  If possible, try and keep back half of shell partially connected.  Season with olive oil, salt, and pepper, and place on grill, shell side down.  Grill until shell becomes pinkish red, 4-7 minutes.  Flip and cook until lobster is cooked but not too firm, 2-6 minutes.  Serve farro salad topped with lobster tail with a tall glass of sparkling wine.</p>"}]}