{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110214-137699-miso-tofu-nuggets.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bento", "bento boxes", "Cook the Book", "edamame", "lunch", "Makiko Itoh", "The Just Bento Cookbook", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Cook the Book: Miso Tofu Nuggets with Edamame", "link": "https://www.seriouseats.com/recipes/2011/02/miso-tofu-nuggets-with-edamame-recipe.html", "description": "These <strong>Miso Tofu Nuggets with Edamame</strong> are perfect bento material&mdash;crisp on the outside and creamy on the inside croquettes of tofu mixed with big, umami flavors.  The tofu is whipped together with ginger, miso, sesame oil, scallions, and edamame, forming a salty, custardy batter that's dipped in cornstarch then shallow-fried.", "totalTime": null, "recipeYield": "3", "recipeCategory": ["Cook the Book", "Tofu", "Vegetarian"], "recipeIngredient": ["3 tablespoons finely chopped green onion", "2 teaspoons peeled and finely chopped fresh ginger", "1 teaspoon sesame oil", "3 tablespoons  frozen or fresh shelled edamame beans", "1 pound firm tofu, drained", "3 tablespoons moromi miso, or miso of your choice", "1/2 teaspoon sea salt (omit if the miso you choose is salty)", "Cornstarch, for coating ", "Vegetable oil, for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sauté the green onion and ginger in the sesame oil for a couple of minutes, then remove from the heat. Boil the edamame in just enough water to cover for about 5 minutes, until tender yet still firm. Alternatively, put the edamame on a plate, cover with plastic wrap, and microwave on high for 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble the tofu in a bowl. Add the sautéed green onion and ginger, miso, and salt. Mix together thoroughly using your impeccably clean hands. Alternatively, you can mix this in a food processor, pulsing to combine. When everything is combined to a smooth paste, mix in the edamame.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the tofu mixture into nine portions and form round- or oval-shaped flattened nuggets. Coat in cornstarch. Heat 1 inch (2.5cm) of the oil in a large frying pan over medium-high heat. The oil is hot enough when a small piece of the cornstarch-coated tofu dropped into the oil turns brown in a few seconds. Fry the nuggets in batches, taking care not to overcrowd the pan, until browned on both sides. Drain well and cool before packing.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Note:</strong>These nuggets can be frozen quite successfully. The texture will change a little, but they will still be good. Cold nuggets can be pan-fried in a dry nonstick frying pan over medium heat until crispy on the outside and heated through, or gently poached in dashi stock for a softer texture. They are also good in soup. </small></p>"}]}