{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110719-162028-peppers-and-eggs-sandwich.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Defonte's", "egg", "Jean Tang", "peppers", "recipe newsletter", "sandwich", "Sara Reistad-Long", "The Big New York Sandwich Book", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Peppers and Eggs Sandwich", "link": "https://www.seriouseats.com/recipes/2011/07/peppers-and-eggs-sandwich-recipe.html", "description": "Second only to the coldcut heavy Italian sub, <strong>Peppers and Eggs</strong> is about as Italian-American as you can get, sandwich-wise. This recipe, adapted from <a href=\"http://defontesofbrooklyn.com/\">Defonte's</a> in Brooklyn for <em><a href=\"http://www.amazon.com/Big-New-York-Sandwich-Book/dp/0762440481/?tag=serieats-20\">The Big New York Sandwich Book</a>,</em> is a spot-on home adaptation of the deli classic. Sautéed and simmered onions and bell peppers are scrambled with eggs, finished with a hefty handful of mozzarella and piled into a crusty long roll.", "totalTime": "15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Eggs", "Sandwiches", "Vegetarian"], "recipeIngredient": ["4 (10-inch) Italian hero loaves (or other large, soft roll), halved lengthwise", "2 teaspoons plus 2 tablespoons vegetable oil ", "1 large Spanish onion, cut into 1-inch pieces", "2 green bell peppers, quartered, deseeded, and diced", "2 red bell peppers, quartered, deseeded, and diced", "16 eggs, beaten", "Salt and fresh-cracked black pepper, to taste", "2 cups shredded whole-milk mozzarella (Defonte’s uses Polly-O)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay each hero roll on a plate. Add the 2 teaspoons of oil to a skillet. Add the onion and sweat until soft, about 3 minutes. Place the cooked onions and the raw peppers in a medium pot, and cover with water. Bring to a boil. Lower the heat, and cook until soft, about 8 minutes. Drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the vegetables are cooking, whisk the eggs in a large mixing bowl, and season with salt and pepper to taste. Using the onion skillet, add 1 to 1 1/2 teaspoons of oil (if necessary). When the skillet is hot, add a quarter of the beaten eggs, or about 4 eggs. After 2 minutes, add a quarter of the vegetables, season again, and scramble. Just before the mixture has reached desired doneness, add the mozzarella. Fill each hero roll with the scrambled egg. Cook the remaining 3 batches the same way. </p>"}]}