{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111213-cookie-swap-05-walnut-coffee.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cookies", "holiday cookies", "SE Cookie Swap 2011"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coffee Walnut Cookies", "link": "https://www.seriouseats.com/recipes/2011/12/coffee-walnut-cookies.html", "description": "Swapped at the 2011 Cookie Swap by ad sales director / Cereal Eats columnist Leandra Palermo. Adapted from Alice Medrich....", "totalTime": null, "recipeYield": null, "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["2 cups all purpose flour", "1 cup walnut halves", "3/4 cup of sugar", "1/4 tsp salt", "2 tsp fresh ground coffee beans (medium roast)", "1 tsp vanilla extract", "1 1/2 sticks salted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, walnuts, sugar and salt in the bowl of a food processor and pulse until the walnuts are finely ground. Add the ground coffee and pulse to mix. Add the butter (cut in several pieces if firm) and pulse until the mixture looks damp and crumbly. Drizzle in the brandy and vanilla extract and pulse until the dough begins to clump up around the blade. Remove the dough, press it into a ball and knead it by hand a few times to complete the mixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a 12-inch log about 2 inches in diameter. Wrap the dough in plastic wrap and refrigerate for at least 2 hours, or preferably, overnight, or up to 3 days. The dough can also be frozen for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the racks in the upper and lower thirds of the oven and heat the oven to 350 degrees. Use a sharp knife to cut the cold dough log into one-fourth-inch-thick slices. (If the dough crumbles when you cut into it, let it soften for several minutes.) Place the cookies at least 1 inch apart on silicone-lined baking sheets. Press a coffee bean into the center of each cookie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Bake the cookies until light golden brown at the edges, 12 to 15 minutes, rotating the sheets from top to bottom and front to back halfway through the baking. Let the cookies firm up on the pans for about 1 minute, then transfer them to a rack with an offset spatula. Cool completely. These cookies are delicious fresh but are even better the next day. They can be stored in an airtight container for at least a month.</p>"}]}