{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111213-cookie-swap-32-biscotti-primary.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["Cookies", "holiday cookies", "SE Cookie Swap 2011"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry-Almond Biscotti", "link": "https://www.seriouseats.com/recipes/2011/12/cranberry-almond-biscotti.html", "description": "[Photograph: Robyn Lee] Swapped at the 2011 Cookie Swap by the Blatteis twins. Adapted from Martha Stewart....", "totalTime": null, "recipeYield": "Makes about 4 dozen", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["1/2 cup dried cranberries", "1/2 cup boiling water", "3 cups all-purpose flour, plus more for dusting", "2 teaspoons baking powder", "1/4 teaspoon salt", "4 tablespoons unsalted butter, room temperature", "1 cup sugar, plus more for sprinkling", "3 large eggs, plus 1 large egg, lightly beaten", "2 teaspoons pure vanilla extract", "1/2 cup (2 1/2 ounces) unsalted pistachios, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Line a large baking sheet with parchment paper; set aside. Place cranberries in a small bowl; add boiling water. Let stand until plump, about 15 minutes. Drain, and set aside. Sift together flour, baking powder, and salt into a medium bowl; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, beat butter and sugar on medium speed until light and fluffy, about 2 minutes. Add 3 eggs, one at a time, beating to incorporate after each addition and scraping down sides of bowl as needed. Beat in vanilla. Add flour mixture, and mix on low speed until combined. Mix in cranberries and pistachios.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out dough onto a lightly floured surface; divide in half. Shape each piece into a 16-by-2-inch log, and transfer to prepared baking sheet, about 3 inches apart. With the palm of your hand, flatten logs slightly. Brush beaten egg over surface of the dough logs, and sprinkle generously with sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, rotating sheet halfway through, until logs are slightly firm to touch, about 25 minutes. Transfer logs on parchment paper to a wire rack to cool slightly, about 20 minutes. Reduce oven temperature to 300 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place logs on a cutting board. Using a serrated knife, cut logs crosswise on the diagonal into 1/2-inch-thick slices. Place a wire rack on a large rimmed baking sheet. Arrange slices, cut sides down, on rack. Bake until firm to touch, about 30 minutes. Remove pan from oven; let biscotti cool completely on rack. Biscotti can be kept in an airtight container at room temperature for up to 1 week.</p>"}]}