{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110920-dt-swiss-chard-and-cheddar-frittata.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "egg", "frittatas", "potatoes", "swiss chard", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Swiss Chard Frittata", "link": "https://www.seriouseats.com/recipes/2011/09/swiss-chard-frittata-recipe.html", "description": "It seems obvious now, but eggs are among the simplest and most versatile things for making dinner, and very hard to mess up. Later I found out if you can make an omelette then you can also also make a frittata. Just mix the filling into the eggs beforehand instead of folding them in after; the result is somehow much fancier. The ingredients in this one are classic: some cooked-down greens with a little onion and garlic, cubed potato, and shredded cheddar cheese to add a salty tang.", "totalTime": "45", "recipeYield": "4", "recipeCategory": ["Breakfast and Brunch", "Dinner Tonight", "Eggs", "Potato", "Vegetarian"], "recipeIngredient": ["1 red potato, diced", "1 tablespoon olive oil", "1 small yellow onion, thinly sliced", "1 clove garlic, minced", "1 bunch Swiss chard, leaves removed and roughly chopped ", "8 eggs", "Pinch of salt", "Black pepper to taste", "1/2 cup grated sharp cheddar cheese", "1/4 cup grated Parmesan cheese", "1 tablespoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Put the diced potato in a small bowl, cover with a plate, and microwave on high for 3 to 4 minutes, until tender when pierced with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) skillet, heat the olive oil over medium heat until shimmering.  Add the onion and cook until softened, about 3 minutes, then add the garlic and cook for a minute more.  Add the chard and a splash of water, cover, and cook until the chard is completely soft.  Add more water if necessary if the skillet is too dry and the chard is still tough. Before proceeding, cook off any leftover moisture, and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk the eggs with the salt and cheeses, then stir in the chard and onion mixture and the potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter in a medium skillet or small pan over medium heat until foaming, then add the egg mixture.  Cook until the bottom and sides begin to set, then transfer to the oven and continue cooking until the center is solid, 5-15 minutes depending on the shape of the pan.  Allow to cool somewhat before serving.</p>"}]}