{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110301-140251-whole-wheat-spaghetti-with-roast-chicken-and-brussels-sprouts.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Bird in the Oven and Then Some", "brussels sprouts", "chicken", "Cook the Book", "Mindy Fox", "pasta", "poultry", "whole wheat pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Whole Wheat Spaghetti with Roast Chicken, Shredded Brussels Sprouts, and Parmesan", "link": "https://www.seriouseats.com/recipes/2011/03/whole-wheat-spaghetti-with-roasted-chicken-shredded-brussels-sprouts-and-parmesan-recipe.html", "description": "Another ingenious leftover chicken recipe from <a href=\"http://www.ediblemanhattan.com/20101103/how-a-cookbook-author-gleaned-inspiration-from-new-york%E2%80%99s-flavors/\">Mindy Fox</a>'s <strong><em><a href=\"http://www.amazon.com/Bird-Oven-Then-Some-Delectable/dp/1906868336/serieats-20\">A Bird in the Oven and Then Some</a></em></strong>, this Whole Wheat Spaghetti with Roast Chicken, Shredded Brussels Sprouts, and Parmesan is a perfect farewell to brussels sprouts season.  Thinly shredded and sautéed with a butter and olive oil, the brussels sprouts are mixed with shredded chicken, golden fried slices of garlic, and loads of grated Parmesan.", "totalTime": null, "recipeYield": "4 to 6", "recipeCategory": ["Chicken", "Cook the Book", "Pasta"], "recipeIngredient": ["Good basic kitchen salt, for the water", "1 1/4 pounds brussels sprouts, discoloured leaves discarded, stems intact", "2 tablespoons unsalted butter", "6 tablespoons extra-virgin olive oil, plus extra for drizzling ", "2 garlic cloves, thinly sliced", "1 pound whole wheat spaghetti", "1 cup chicken stock, preferably homemade, heated to a simmer", "1 1/2 cups sliced roast chicken", "2 cups freshly grated Parmigiano-Reggiano cheese", "Freshly ground black pepper ", "Flakey coarse sea salt  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large saucepan of well-salted water to the boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Holding each brussels sprout by the stem end, cut into very thin slices using an adjustable-blade slicer or thinly slice with a good sharp knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter and 2 tablespoons of the oil in a 5 1/2- to 7-quart Dutch oven or heavy pot with lid over a medium heat until the butter is melted. Add the brussels sprouts and a generous pinch of salt. Reduce the heat to low, cover and cook, stirring frequently, for 5 minutes. Add 1/4 cup of water and continue to cook, covered and stirring occasionally, for about a further 15–20 minutes until the sprouts are tender but still firm to the bite.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the garlic and remaining oil in a small frying pan or saucepan over a low heat, swirling the pan occasionally, for 5–6 minutes until fragrant and lightly golden. Remove from the heat. When the sprouts are done, let them to stand, covered, off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta in the boiling water until al dente, then, reserving 1/2 cup of the pasta cooking liquid, drain and transfer the pasta to a large serving bowl. Immediately add the sprouts, stock, garlic and oil, and toss together. Add the chicken and 1 1/2 cups of the cheese. Toss together. Add the cooking liquid to moisten, if desired. Serve the pasta immediately, drizzled with extra oil and sprinkled with ample black pepper, the remaining cheese and a little coarse sea salt on top.</p>"}]}