{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111224-chinese-american-jewish-christmas-3.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["hanukkah latkes", "latkes", "potatoes", "sichuan peppercorns", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Latkes with Sichuan Peppercorns", "link": "https://www.seriouseats.com/recipes/2011/12/latkes-with-sichuan-peppercorns.html", "description": "The Hanukkah classic with a spicy, tingly update.", "totalTime": "1 hour", "recipeYield": "Makes about 20 latkes, serving 6 to 8", "recipeCategory": ["Potato", "Vegetarian"], "recipeIngredient": ["about 4 pounds russet potatoes", "5 cups diced onions", "4 eggs ", "about 1 cup matzoh meal", "2 tablespoons kosher salt, or to taste ", "freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shred potatoes with the grating attachment of a food processor or on the finer holes of a box grater. Pick up grated potato one handful at a time and squeeze water into a medium bowl. Transfer squeezed potatoes shreds to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the potato water rest until starch has sunk to the bottom, about 5 minutes. Carefully pour excess water into the sink, taking care not to discard the starch. Add the drained starch, diced onions, eggs, and matzo meal to the potatoes. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour a 1/4-inch layer of oil into the skillet and place over medium heat.  A sliver of potato should immediately start bubbling.  Put down mounds of potato mixture in the oil, forming lacy rounds.  (Alternatively, form patties 3 to 4 inches in diameter and 1/2 to 1 thick in the center.)  Fry on medium low heat on one side until completely browned, about 2 to 5 minutes depending on thickness of latkes. Carefully flip patties and cook until second side is crisp. Transfer cooked latkes to a large plate lined with paper towels to drain. Repeat until all potatoes are cooked. Dust latkes with Sichuan peppercorn and serve immediately with apple sauce and sour cream.</p>"}]}