{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110222-138951-vegetarian-bibimbap.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Korean", "keywords": ["Bibimbap", "Cook the Book", "Korean", "rice", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Vegetarian Bibimbap", "link": "https://www.seriouseats.com/recipes/2011/02/cook-the-book-vegetarian-bibimbap-korean-recipe.html", "description": "This <strong>Vegetarian Bibimbap</strong> is all about knowing how to treat your vegetables right&mdash;cooking and seasoning every component individually with just the right amount of salt, garlic and sesame oil.  It might sound a bit time consuming to prepare all of these vegetables individually, but cooking separately ensures that textures and flavors keep their integrity and really shine.  Once all of your vegetables have been cooked they are placed on top of a bowl of steamed white rice (no need to reheat the vegetables, the heat from the rice will take care of it), and finished with cool grated cucumber, toasted sesame oil, and a dollop of seasoned chile paste.", "totalTime": null, "recipeYield": "5", "recipeCategory": ["Cook the Book", "Korean", "Rice", "Vegetarian"], "recipeIngredient": ["<strong>For the Spinach:</strong>", "2 bunches spinach (about 8 ounces), trimmed and well rinsed", "1 tablespoon Asian sesame oil", "1 clove garlic, minced ", "1/2 teaspoon salt", "<strong>For the Mushrooms:</strong>", "1 tablespoon vegetable oil", "10 shiitake or other mushrooms, trimmed and sliced ", "1 clove garlic, minced", "1/2 teaspoon salt", "<strong>For the Carrots:</strong>", "1 tablespoon vegetable oil ", "2 medium carrots, grated", "1/2 teaspoon salt", "<strong>For Serving:</strong>", "5 cups hot cooked rice", "2 pickling cucumbers, grated", "5 teaspoons Asian sesame oil", "Seasoned Chile Paste (recipe follows)", "<strong>For the Seasoned Chile Paste:</strong>", "4 tablespoons Korean chile paste (<em>gochujang</em>) ", "2 tablespoons Asian sesame oil ", "1 tablespoon soy sauce", "2 cloves garlic, minced", "1 tablespoon toasted sesame seeds ", "1 tablespoon sugar or Korean malt syrup (<em>mool yut</em>) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spinach:</strong> Bring about 1/4 inch water to a boil in a large pot. Add the spinach, cover, and steam until the leaves are just wilted, about 2 minutes. Immediately transfer to a colander and rinse with cold water. Squeeze the water from the spinach. Combine with the sesame oil, garlic, and salt. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mushrooms:</strong> Heat the oil in a medium skillet over medium-high heat. Add the mushrooms and garlic and sauté until the mushrooms are limp and just starting to brown, about 3 minutes. Remove from the heat. Season with salt, toss, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Carrots:</strong> Using the same skillet, heat the oil over medium-high heat. Add the carrots and sauté until the carrots just turn limp, about 3 minutes. Remove from the heat. Season with salt, toss, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Serving:</strong> Spoon 1 cup rice into each of 5 serving bowls. Arrange the cooked vegetables and grated cucumbers on top of the rice, dividing them evenly. Spoon 1 teaspoon sesame oil over each serving and pass the Seasoned Chile Paste for each person to add their own.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Seasoned Chile Paste:</strong> Combine all the ingredients in a small bowl. It will keep in a tightly sealed container in the refrigerator for about 1 week. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small><strong>Variation:</strong> You can add any number of other vegetables to this dish including soybean sprouts, zucchini, fern bracken, shredded lettuce, or even daikon sprouts. To make it extra fancy, top each bowl with a fried egg.</p>"}]}