{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/21001201-181900-sunday-supper-fried-fish-yucca-2.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cassave", "fish", "Sunday Brunch", "yucca"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Fried Fish and Yucca", "link": "https://www.seriouseats.com/recipes/2011/12/fried-fish-and-yucca-recipe.html", "description": "The first time I came across this green sauce was in Peru, but I've made some alterations because the Ají amarillo chili can be difficult to find in some parts of the world. (Ideally the fish in this dish will be freshly caught with a spear gun during a morning swim, but if not any firm fleshed white fish will work.)  Although not absolutely necessary, a food processor comes in very handy when making this sauce, and if you're not in the mood for sauces, lime wedges work very well.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Fish"], "recipeIngredient": ["1 large yucca", "2 pounds firm-fleshed white fish, such as cod or haddock", "1/3 cup flour", "kosher salt and cracked black pepper", "2 eggs, beaten", "1/3 cup cornmeal", "vegetable oil for frying", "—", "<strong>Green Sauce:</strong>", "1 jalapeno, finely chopped", "1 cup cilantro, finely chopped", "1/3 cup queso seco, grated", "1 tablespoon vegetable oil", "1/2 teaspoon vinegar", "1 clove garlic, minced", "1/4 cup mayonnaise", "1 lime, juiced", "Sliced limes to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel yucca and cut into pieces about 1 inch wide, 4 inches long if possible.  (Otherwise use your judgement on the size of the yucca pieces.)  Place in a large pot of boiling water and cook until soft, about 30 minutes.  Once yucca are cooked through, place on paper towel and allow to dry as much as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the fish into evenly sized pieces and coat in flour seasoned with salt and pepper; then coat with egg, then with cornmeal.  Repeat with remaining pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all ingredients for the green sauce and whisk to combine. Season to taste with salt.  If you have a food processor, this is a great place to use it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to low. Add oil to pot. Oil should come at least three inches up the side of the pot. Heat oil over high heat to 380°F.  Make sure yucca are totally dry by blotting with paper towel, then add a few pieces to the pot of oil, making sure not to overcrowd the pot.  Working in small batches, cook the yucca and keep warm in oven.  Repeat with fish, cooking until cornmeal is brown on each side, about 4 minutes per side, once again making sure to not overcrowd the pot.  Once yucca and fish are cooked serve hot with green sauce, beer and lime wedges.</p>"}]}