{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/upload/2011/09/20110919-khichdi-with-eggplant-fritters.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["Beyond Curry", "eggplants", "Indian", "lentils", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Beyond Curry: Khichdi with Eggplant Fritters", "link": "https://www.seriouseats.com/recipes/2011/09/khichdi-with-eggplant-fritters-recipe.html", "description": "If Indian food is just chicken tikka and biryani to you, then please keep reading. In India, food varies from region to region, home to home, and religion to religion. And it's not all spicy and complicated. Most Indian food is surprisingly simple to make and very, very rewarding to eat. In this new Indian cooking column, I'd like to introduce you to the <em>real</em> food we cook and eat at home. For starters, <strong><em>khichdi</em></strong>, a sort of one-pot comfort meal of rice, lentils and vegetables.", "totalTime": "30 minutes", "recipeYield": "2", "recipeCategory": ["Beans and Pulses", "Indian", "Mains", "Vegetarian"], "recipeIngredient": ["<strong>For the Khichdi:</strong>", "2 tablespoons vegetable oil", "1 medium onion, thinly sliced (about 1 cup)", "2 inch stick cinnamon", "3 cloves", "1 tablespoon garlic, grated on a microplane grater", "1 tablespoon ginger, grated on a microplane grater", "1 tablespoon ground cumin", "½ teaspoon ground turmeric", "I medium potato, cut into 1/2-inch dice (about 1 cup)", "6 cauliflower florettes (about 1/4 cup)", "1 cup rice, washed and drained", "1½ cups mixed lentils (split green gram/mung dal, split yellow gram tuvar dal, or any lentil of your choice) washed and drained", "1 teaspoon red chilli powder (or more according to taste)", "Kosher salt", "½ cup chopped coriander leaves and stems", "1 medium tomato cut into rounds", "4 cups water", "½ tablespoon ghee", "&nbsp;", "<strong> For the Eggplant Fritters:</strong>", "1 medium sized eggplant, about 6 inches, cut into 1/2-inch rounds", "2 1/2 tablespoon split Bengal gram flour", "1 teaspoon salt ", "1 teaspoon ground red chilli", "½ teaspoon ground turmeric", "2 tablespoons water (or a little more-to make a thick coating batter consistency)", "3 tablespoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the khichdi:</strong> Heat oil in a large saucepan over medium heat until shimmering. Add the onions and cook, stirring frequently until just beginning to brown, about 4 minutes. Add cinnamon stick and cloves and cook, stirring constantly, until fragrant, about 30 seconds. Reduce heat to low. Add garlic and ginger and cook, stirring constantly, until aromatic, about 30 seconds. Add cumin and turmeric and continue to cook over low heat, stirring constantly, until oil separates, about 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the potato and cauliflower and cook, stirring constantly for 30 seconds. Add the rice and lentils and cook for one minute, stirring to coat with spices. Add the chilli powder, a pinch of salt, corriander, tomatoes, and water, and stir to combine. Bring to a boil over high heat. Cover and reduce heat to lowest possible setting and cook until rice is tender, about 10 minutes. Keep warm while making eggplant fritters.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Eggplant Fritters:</strong> Cut the eggplant into 1-centimeter rounds. Whisk together gram flour, salt, red chilli, turmeric and water into a medium bowl. Add water and whisk to form a mixture with the consistency of pancake batter.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil over medium high heat until shimmering. Reduce heat to low. Dip eggplant slices in batter, allow excess to drain, and cook until golden brown on both sides, 5 to 7 minutes per side. Drain, season with salt, and serve immediately with hot khichdi.</p>"}]}