{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110315SalmonBeets.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["beets", "breadcrumbs", "fish", "French in a Flash", "London", "rosemary", "salmon", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French in a Flash: Crunchy Broiled Salmon with Beets", "link": "https://www.seriouseats.com/recipes/2011/03/crunchy-roasted-salmon-with-beets-recipe.html", "description": "This recipe is a combination of a fantastic salad from <a href=\"http://www.frenchrevolutionfood.com/2011/03/londons-calling-the-canton-arms/\">Canton Arms</a>, a gastropub in London, and a recipe I read in a French food magazine on an airplane. Beets and salmon are roasted together with olive oil and a bed of fresh thyme, all topped with simply toasted rosemary panko breadcrumbs.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["French", "Salmon"], "recipeIngredient": ["3 large beets, red and golden", "3 tablespoons panko", "4 teaspoons olive oil, divided", "1/2 teaspoon chopped fresh rosemary", "Kosher salt", "Freshly cracked black pepper", "4 6-ounce boneless, skinless salmon fillets", "1 small bunch of fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to boil.  Peel the beets, and cut each beet into 8 wedges.  Salt the boiling water, and boil the beets until tender to the point of a knife, about 25 minutes depending on the size of the beets.  Drain, and set aside.  Note: if cooking both golden and red beets, boil the two colors separately, or the red beets with stain the golden beets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler.  While the beets are cooking, toast the panko.  In a small nonstick sauté pan, mix together the panko, 1 teaspoon olive oil, the rosemary, and salt and pepper.   Cook over medium heat, stirring often, until the panko is golden-brown—less than 5 minutes.  Set aside in a single layer on a paper towel to cool and remain crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season each fillet of salmon with 1/2 teaspoon of olive oil and salt and pepper.  Make 4 piles of fresh thyme stems on a parchment-lined rimmed baking sheet, and place one piece of salmon on each bed of thyme, tucking the thyme under the salmon.  Toss the beets with 1 teaspoon olive oil, and salt and pepper.  Place between and alongside the salmon fillets.  Broil the salmon and beets about 6 inches from the heat source (the second rack placement from the top) until the salmon is crisp and golden on top and cooked through: 15 minutes.  If you prefer your salmon less well cooked, take it out after 10 to 12 minutes (Salmon should register 130° with an instant read thermometer inserted into the thickest part for medium rare, 150° for well-done).  Top with the rosemary panko crumbs, and serve right away.</p>"}]}