{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110214-137122-chocnanaimo2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bar cookies", "Cakespy", "chocolate", "chocolate desserts", "nanaimo bars", "Valentine's Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cakespy: Triple Chocolate Nanaimo Bars", "link": "https://www.seriouseats.com/recipes/2011/02/cakespy-triple-chocolate-nanaimo-bars-recipe.html", "description": "Nanaimo Bars are a fairly perfect food to begin with: a decadent three-part confection made up of a chocolate graham cracker crust, a (vanilla) custardy middle section, and chocolate topping. Of course, like so many things, they're even better with more chocolate.", "totalTime": "2-3 hours (includes cooling)", "recipeYield": "36 bite-size bars", "recipeCategory": ["Cakespy", "Chocolate"], "recipeIngredient": ["<strong>For the bottom layer</strong>", "1/2 cup (1 stick) butter", "1/4 cup dark brown sugar", "5 tablespoons cocoa (I used Hershey's Special Dark)", "1 large egg, beaten", "1 cup shredded sweetened coconut", "1 1/2 cups finely crumbled chocolate wafer cookies", "1/2 cup finely chopped nuts (such as almonds or pecans)", "<strong>For the middle layer</strong>", "1/2 cup (1 stick) butter", "2 tablespoons heavy cream", "2 tablespoons Custard Powder (such as Bird's), or substitute pudding powder (instant)", "2 cups confectioners' sugar, sifted", "1 1/2 tablespoons cocoa (I used Hershey's Special Dark)", "<strong>For the top layer</strong>", "4 ounces high-quality dark chocolate, coarsely chopped", "1 1/2 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of an 8-inch square baking pan with a strip of parchment paper or foil, for easy removal of the bars from the pan once they are cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the bottom layer: melt the butter, sugar, and cocoa powder in a double boiler. Add the beaten egg and stir vigorously with a wooden spoon until incorporated and thick. Remove the pan from the heat, transfer to a large bowl, and stir in the graham cracker crumbs, nuts, and coconut, and nuts. Press firmly into your the prepared pan. Put this in the refrigerator for about half an hour so that it can set before you add the next layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the middle layer: in a stand mixer fitted with the paddle attachment, cream the butter, cream, custard powder, cocoa, and confectioners' sugar together until very light and fluffy. Spread over the bottom layer, taking care to spread it as flat and evenly as possible. Return the pan to the refrigerator while you prepare the topping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the top layer: in a medium saucepan or double boiler, melt the chocolate and butter over medium heat, stirring often to ensure that the mixture doesn't scorch. Remove from heat. Let sit until the mixture is still liquid but very thick, then pour it over the second (middle) layer and gently spread it with a spatula to ensure even coverage (but work carefully, because the still-warm chocolate will get messy if you press too hard while spreading it and tear up the buttery layer below).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate for at least an hour before cutting into bars.</p>"}]}