{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110811-127355-dinner-tonight-chiles-stuffed-corn-crema.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["chile rellenos", "chiles", "cinco de mayo", "corn", "Dinner Tonight", "Mexican", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Baked Chile Rellenos with Corn and Crema", "link": "https://www.seriouseats.com/recipes/2011/08/baked-chile-rellenos-with-corn-crema-recipe.html", "description": "The smoky charred chiles were the perfect vessel for the filling, adding just enough spice to make your lips tingle. Instead of heavy and fatty, the corn adds natural sweetness to balance out the dairy. All told, if you're looking for an intro chile relleno recipe, this is an excellent place to start.", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Corn", "Dinner Tonight", "Mains", "Mexican", "Vegetarian"], "recipeIngredient": ["6 poblano chiles ", "5 ears fresh corn, husks and silks removed", "2 tablespoons olive oil ", "1 red onion, chopped", "2 garlic cloves, finely chopped", "½ teaspoon salt", "Black pepper", "2 cups Monterey Jack cheese, or other Mexican melting cheese", "½ cup Mexican crema"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper middle position and preheat oven to 375&deg;. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, if you have a gas stove, turn heat to high on one of the burners, and set as many of the poblanos as will fit on the grate. Cook, flipping and moving the chiles often with a pair of tongs, until blackened on all sides. If you don't have a gas stove, turn on broiler to high. Place chiles on a baking sheet covered with aluminum foil, and place underneath the broiler. Cook, flipping occasionally with a pair of tongs, until blacked on all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chiles are blackened, transfer to a plastic bag and seal. Let them steam for at least five minutes. When done, peel off the blackened skins. Cut a slit down the side of each, starting under the stem and continuing down to the tip. Carefully remove the seeds, being careful not to tear the chile. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, cut the kernels off the corn cobs. Heat the olive oil in a large skillet set over medium-high heat. When shimmering, add the onion and garlic. Cook until onion is translucent, about two minutes. Add the corn, and season with salt and pepper. Cook, stirring often, until corn turns golden brown, about five minutes. Turn off heat and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully stuff each chile with a layer of ½ cup of the sauteed corn mixture, ¼ cup of the shredded cheese, and 1 ½ tablespoons of the crema. Finally, add a 1 ½ tablespoon of cheese on top of each slit. When stuffed, place each chile slit side up on a baking dish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer baking dish to the upper middle rack in the oven and cook for ten minutes. Turn on the broiler to high, and cook until the cheese is golden brown, about five minutes. Serve immediately.  </p>"}]}