{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/knotted.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Them Bones!", "link": "https://www.seriouseats.com/recipes/2011/10/bread-baking-them-bones.html", "description": "With Halloween rapidly approaching, I considered a black and orange bread. Or something spider-shaped. Or ghost-like. But, no, I went with bones instead. It's a simple idea. Make dough, tie ends in a knot, and you've got bones.", "totalTime": "2 hours 15 minutes", "recipeYield": "8", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch", "Breakfast Sweets", "Halloween"], "recipeIngredient": ["2 teaspoons instant yeast", "2 cups (9 ounces) all purpose flour", "4 tablespoons cane sugar, divided", "3/4 cup water", "1 teaspoon salt", "2 tablespoons butter", "1/4 cup almond flour", "1 tablespoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the yeast, flour, and 3 tablespoons of sugar, and water in the bowl of your stand mixer. Knead with the dough hook until the dough becomes elastic. Add the salt and butter and continue kneading until both are incorporated and you have a smooth, soft, elastic dough. Cover with plastic wrap and set aside until doubled in size, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the almond flour, the remaining tablespoon of sugar, and the cinnamon. Stir to combine. Line 2 baking sheets with parchment paper and preheat the oven to 325 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn out the dough. For ease of handling divide it in half. Roll half of the dough into a rectangle about 12 x 10 inches. Cut the dough into 4 strips, 3 inches wide by 10 inches long. Do the same with the second piece of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Distribute the almond mixture lengthwise down the center of each strip of dough, stopping just short of the ends. Fold the dough over the almond mixture and seal the seam and the ends so you have a rope about 10 inches long.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick the rope up and squeeze it from one end to the other so the dough is firmly around the filling with no big air bubbles, and it's somewhat evenly thick from end to end. This will probably result in the rope lengthening a bit, to about 12 inches long. That's fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tie a knot in each end of the rope and place the ropes on the prepared baking sheets. In theory they would all fit on one sheet, but you don't want them touching during the baking, so use a second sheet to give them plenty of space. Cover the sheets with plastic wrap and set aside to rise until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap and bake at 325 until the bones are a light golden brown, about 25 minutes. Remove the bones from the baking sheet and let cool on a rack.</p>"}]}