{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110418-127355-dinner-tonight-hanger-steak-shallots-mushrooms.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "hanger steaks", "mushrooms", "shallots", "steaks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Hanger Steak with Shallots and Mushrooms", "link": "https://www.seriouseats.com/recipes/2011/04/hanger-steak-with-shallots-and-mushrooms-recipe.html", "description": "There are loads of hanger steak and shallot recipes out there for a reason&mdash;because they taste really freaking good together. It's just a fact. This slight variation from <em><a href=\"http://www.foodandwine.com/recipes/hanger-steak-with-shallots-and-mushrooms\">Food &amp; Wine</a></em> adds mushrooms for a bit of meatiness. Really, this is all about how the softened and sweet shallots balance the succulent and surprisingly rich steak.", "totalTime": "40 minutes", "recipeYield": "4 people", "recipeCategory": ["Beef", "Dinner Tonight", "Mushrooms"], "recipeIngredient": ["1 ½ pound hanger steak ", "3 tablespoons extra-virgin olive oil", "Salt and pepper ", "2 tablespoons unsalted butter", "½ pound shiitake mushrooms, stems removed, caps thickly sliced", "½ pound white mushrooms, stems removed, caps thickly sliced", "6 shallots, ends trimmed, very thinly sliced (about 1 cup)", "2 tablespoons red wine vinegar", "½ cup dry red wine ", "¼ cup chicken stock ", "2 tablespoons fresh parsley, chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the hanger steak with salt and pepper. Place a heavy-bottomed 12-inch skillet over medium-high heat. Pour in one tablespoon of the oil and swirl it around the pan. Once oil begins to smoke, add the steak. Cook until well browned on all sides medium-rare on the inside, 10 to 12 minutes. Turn down the heat if it looks like the steak is burning. Transfer steak to a cutting board and let rest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully clean out the skillet (the fond is probably too burnt to use), and place it over medium heat. Add the rest of the oil and one tablespoon of the butter. When shimmering, add the mushrooms along with a pinch of salt and pepper. Cook, stirring occasionally, until they begin to brown, about 6 minutes. Add the sliced shallots to the skillet. Cook, stirring occasionally, until they soften, but don’t brown, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the red wine vinegar into the skillet. Stir well, and cook until it evaporated. Add the wine, and cook until it has evaporated. Then pour in the chicken stock and add the remaining butter. Stir well until the sauce is thick and silky. Turn off the heat and add the parsley. Stir well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the steak against the grain into thick slices. Add any accumulated meat juices to the sauce, stir well, and then serve the steak with the sauce. </p>"}]}