{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111108_GFTues_Stuffing.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "Gluten-Free Tuesday", "stuffing", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Stuffing", "link": "https://www.seriouseats.com/recipes/2011/11/gluten-free-tuesday-thanksgiving-stuffing.html", "description": "Perhaps the most personal dishes on the Thanksgiving table is stuffing. Here's a recipe for a classic gluten-free version, which you can personalize to fit your preferences.", "totalTime": "about one hour", "recipeYield": "6", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday", "Thanksgiving"], "recipeIngredient": ["1 loaf gluten-free bread, cut into bite-size cubes (8-9 cups)", "2 tablespoons olive oil", "4 links (about 10 ounces) sweet Italian sausage, removed from casing and broken into small pieces. ", "2 cups chopped celery (about 4 large stalks)", "2 cups chopped onion (about 1 large onion)", "2 tablespoons minced garlic (about four cloves)", "1 1/2 teaspoons dried basil", "1 teaspoon dried oregano", "1/2 teaspoon ground sage", "1/2 teaspoon dried thyme leaves", "1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "4 cups gluten-free turkey, chicken, or vegetable stock, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325 &deg;F. Divide bread cubes between two large baking sheets. Toast until bread is golden brown and dry, about 30 minutes. Remove pans from oven and allow bread to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a 9x13-inch baking sheet and set aside. Place bread cubes in a large bowl. In a large pot, heat olive oil until shimmering. Add sausage, break apart into small bites with a fork as it cooks.  Cook until no pink pieces of sausage remain, about three minutes. Remove the sausage from the oil using a slotted spoon. Place sausage on a plate and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add celery. Cook until celery just begins to soften, about two minutes.  Stirring frequently. Add onion. Cook for two minutes, continue to stir frequently. Add garlic, herbs, salt, and pepper. Cook until celery and onions are soft and aromatic. Spoon vegetables onto the bread cubes. Add sausage pieces and stir. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour about two cups of the broth over the bread. Stir until cubes absorb the broth. This takes a minute. Add an additional cup of broth. Continue to stir until broth is absorbed. If bread seems dry, add final cup of broth. (Bread cubes should be moist but not soggy. It’s okay it the some of the cubes fall apart. This is normal.) Transfer stuffing to prepared pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pan with aluminum foil and bake in a 325 &deg;F oven until warm, about 30 minutes. Remove foil and return pan to the oven and bake until golden brown, about five minutes. </p>"}]}