{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110808-127355-dinner-tonight-andouille-greens-grits.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["andouille", "Dinner Tonight", "greens", "grit", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Sautéed Andouille and Greens With Grits", "link": "https://www.seriouseats.com/recipes/2011/08/sauteed-andouille-and-greens-with-grits-recipe.html", "description": "The grits come out creamy and rich. They're the perfect base for full-flavored greens, which are boiled first then sautéed in sausage fat. Yum. Since you're already going for real grits, try to track down some good andouille, or, at the very least, another fine smoked sausage.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Leafy Greens", "Pork"], "recipeIngredient": ["2 cups milk", "Salt and pepper", "1 cup regular grits", "6 ounces extra-sharp white cheddar, grated", "1 bunch collard greens, thick stems removed, leaves chopped into 1-inch pieces", "1 tablespoon unsalted butter", "1/2 pound andouille sausage, sliced", "2 shallots, thinly sliced", "1 red bell pepper, stemmed, seeded, and thinly sliced", "Louisiana Hot Sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large saucepan with water, and bring to a boil over high heat. Add 2 teaspoons of salt and the collard greens. Cook until collards are just tender, six to eight minutes. Drain in a colander, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the milk, ¼ teaspoon of salt, and two cups of water to a simmer in a heavy-bottomed saucepan set over medium heat. Reduce heat to medium-low to keep liquid at a bare simmer. Whisk in the grits. Stir often and cook until they are thick and creamy, about 20 minutes. Turn off the heat, and stir in the cheddar and butter.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While grits are cooking, add the sausage to a large skillet set over medium heat. Brown the sausage on both sides, two to three minutes a side. Remove sausage with a slotted spoon, keeping as much of the rendered fat in the pan as possible, and drain on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shallots and bell pepper strips to the skillet with the rendered fat. Season with a ¼ teaspoon of salt and ⅛ teaspoon black pepper. Cook, stirring occasionally, until bell pepper strips are beginning to soften, about three minutes. Add the cooked greens to the skillet, and cook until warmed through. Mix in the sausage, and carefully fold everything together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the grits between four large bowls, and top each with the sausage and greens mixture. Season with more salt and pepper to taste, and serve with hot sauce, if wanted.</p>"}]}