{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110830-dt-clams-alla-vongole.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Brooklyn", "clam", "clams", "Dinner Tonight", "pasta", "seafood", "spaghetti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Dinner Tonight: Pasta alla Vongole", "link": "https://www.seriouseats.com/recipes/2011/08/pasta-alla-vongole-recipe.html", "description": "Despite the so-so reputation that Pasta all a Vongole might hold&mdash;an Italian standby of tough, overcooked clams and gray \"dishwater\" sauce turned cloudy from the simmering clam shells&mdash;when done right, it has the potential to be remarkable.  Many pasta dishes are this way, requiring attention to detail that's rewarded with great flavor.", "totalTime": "30", "recipeYield": "4", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner Tonight", "Pasta"], "recipeIngredient": ["2 dozen manila clams, or a small amount of large ones", "12 ounces spaghetti", "1/2 cup olive oil", "1 large shallot, minced", "4 tablespoons chopped garlic", "1 teaspoon red chile glakes", "1 tablespoon dried oregano", "1 cup dry white wine", "2 tablespoons chopped flat leaf parsley", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with cold salted water and add the clams.  Allow to soak for 10 minutes, then drain and scrub to remove any grit.  Discard any clams that are broke, cracked, or don't close when tapped firmly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil and cook the spaghetti until al dente.  Reserve 1 cup of pasta cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) skillet or sauté pan, heat the olive oil over medium until shimmering.  Add shallots, garlic, and chile flakes and cook until garlic just begins to turn a light golden brown, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the clams to the pan along with the white wine, and turn the heat to high.  Shake the pan often and continue cooking until the clams open; as they do, remove to a plate to rest, leaving the liquid in the pan. Bring the liquid in the pan to a boil and reduce the volume by half (it should cling nicely to the pasta).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the drained pasta to the skillet and toss well to coat with the sauce.  Add half the parsley and toss well to combine, then season to taste with pepper, and salt if needed.  Divide among bowls and serve topped with the clams and remaining parsley.</p>"}]}