{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111121-179954-crannanaim.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bar cookies", "Cakespy", "Cookies", "nanaimo bars", "Thanksgiving desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Chocolate Cranberry Nanaimo Bars", "link": "https://www.seriouseats.com/recipes/2011/11/chocolate-cranberry-nanaimo-bars-cookies-recipe.html", "description": "The Canadian classic takes a tart-but-sweet Thanksgiving turn by adding dried cranberries to each of the three layers. The resulting seasonal variation is bound to delight family and friends at Thanksgiving festivities and start the holiday cookie season off sweetly.", "totalTime": "3 hours (includes cooling)", "recipeYield": "Serves 36", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["<strong>For the crust:</strong>", "1/2 cup unsalted butter", "1/4 cup sugar", "3 tablespoons cocoa (dutch process preferred)", "1 egg, beaten", "1 1/2 cups graham wafers, crumbled into fine crumbs", "1/2 cup diced dried cranberries", "1 cup shredded coconut", " ", "<strong>For the middle layer:</strong>", "1/2 cup unsalted butter", "2-3 tablespoons cream", "2 tablespoons Birds Custard powder (or vanilla pudding powder)", "2 cups confectioners' sugar", "1/4 cup dried cranberries, cut into small pieces", " ", "<strong>For the top layer:</strong>", "4 squares semi-sweet chocolate (1 ounce each)", "2 tablespoons unsalted butter", "1/2 cup dried cranberries, either whole or diced", "1/4 cup shredded coconut (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the bottom layer: </strong>Melt first 3 ingredients in top of double boiler. Add egg and stir to cook and thicken. Remove from heat. Stir in crumbs, coconut, and cranberry bits. Press firmly into an ungreased but parchment-lined 8\" x 8\" pan. Put the pan in the refrigerator for about 20 minutes to half an hour, or until the mixture has set and is roughly room temperature (you don't want the next layer to just melt on top of it!).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the middle layer:</strong> Cream butter, cream, custard powder, and icing sugar together well. Beat until light. Stir in the cranberry pieces. Spread over bottom layer, assuring an even layer. You want to spread it as flat and evenly as possible, so that the top layer of chocolate will lay fairly flat on top. Return the pan to the refrigerator while you prepare the top layer; chilling it will make the middle layer more firm so that it won't melt when you pour the chocolate topping on top of it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the top layer: </strong>Melt chocolate and butter over low heat. Cool. Once cool, but still liquid, pour over second layer. Sprinkle the cranberries (and a bit of coconut too, if you'd like) on top while the chocolate is still soft and glossy (they won't adhere if you wait until it has hardened or cooled) and chill in refrigerator until the topping has set. When ready to serve, remove from the refrigerator and let come to close to room temperature before slicing into bars; if you cut while the mixture is still cold, the top layer can crack. They still taste good, but ideally to get clean slices, you want to slice the bars when they are cool-but-not-cold.</p>"}]}