{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110806-163799-basil-sweet-corn-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["basil", "corn", "frozen desserts", "ice cream", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Basil Sweet Corn Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/08/basil-sweet-corn-ice-cream-recipe.html", "description": "Between the corn kernels and cobs in this recipe, there's no shortage of corn flavor. As written, basil and corn are equal partners. If you want your corn to shine as the star, cut the basil back by half.", "totalTime": "Overnight", "recipeYield": "6 to 8 (makes about 3 1/2 cups)", "recipeCategory": ["Corn", "Ice Cream and Frozen Treats"], "recipeIngredient": ["3 cups half and half ", "Corn kernels shucked from 3 cobs (2 cups), cobs reserved", "1 cup basil leaves, washed ", "6 egg yolks", "3/4 cup sugar", "3/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, combine half and half, corn kernels, and corn cobs (cut in half) over medium heat. Cook, stirring occasionally, for 15 minutes. Add basil and cook for another 15 minutes. Meanwhile, combine egg yolks and sugar in a large bowl and whisk until lighter in color and slightly thickened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to a blender and blend on high for two minutes or until smooth. Pour through a fine-mesh strainer back into saucepan. <strong>Tip:</strong> If your blender comes with a plastic stopper insert in the lid, remove it and cover the opening with a few folds of paper towel. This will prevent hot liquids from bursting out the top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly whisk yolk-sugar mixture into corn-basil base, and cook on medium-low heat, stirring frequently, until mixture coats the back of a spoon and a finger swipe leaves a clean line. Add salt to taste. Strain into in an airtight container and let chill overnight, then churn the next day according to manufacturer's instructions. </p>"}]}