{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111226-184801-handreidel.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "Kosher", "keywords": ["candies", "dreidels", "hanukkah", "holiday desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hanukkah Marshmallow Dreidels", "link": "https://www.seriouseats.com/recipes/2011/12/hanukkah-marshmallow-dreidels-candy-recipe.html", "description": "Why not make good use of the remaining nights of Hanukkah and whip up a batch of these easy and cute marshmallow treats? They're easy and cute and guaranteed to disappear faster than you can spin a dreidel.", "totalTime": "2 hours", "recipeYield": "serves 12", "recipeCategory": ["Cakespy", "Candy", "Kosher"], "recipeIngredient": ["1 1/4 cups chocolate chips, dark or milk chocolate, or 1 1/4 cups blue-toned candy melts", "12 jumbo marshmallows", "12 thin, 3-4 inch long pretzel sticks (the type that come in mini snack packs)", "12 chocolate kisses or nonpareils", "1 tube white writing icing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with waxed or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a double boiler or microwave-safe bowl, melt the chocolate chips or candy melts over low heat, stirring frequently to prevent scorching. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spear each marshmallow with a pretzel stick, making sure it goes about 3/4 of the way into the marshmallow. Dip the bottom of a chocolate kiss or nonpareil into the melted chocolate and adhere it to the other end of the marshmallow. Place it on its side on the waxed paper to set. Repeat with the remaining marshmallows. Put them in the fridge for 15-30 minutes to ensure that the components have adhered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently reheat the chocolate so that it is soft and melty again. Using the pretzel stick as a handle, dip one of your treats into the chocolate so that it is coated up to the top of the marshmallow. Place on the lined baking sheet; repeat with the remaining marshmallows. Note: One side will remain slightly flattened, but that is ok--it makes them easier to display anyway.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the white decorating icing, add Hebrew letters to the sides of the dreidels. I find that for newbies, the \"hay\" symbol, which vaguely resembles the pi sign, is the easiest to draw. Of course, you could always decorate them with the Star of David or a snowflake image, even if not technically dreidel-accurate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the dreidels set for about 30 minutes before serving.</p>"}]}