{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111220figbarspri.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cookies", "figs", "holiday cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fine Cooking's Fig Bars with Thyme", "link": "https://www.seriouseats.com/recipes/2011/12/fine-cookings-fig-bars-with-thyme-updated-fig-newtons.html", "description": "Even if you're not a fan of the Newton, these Fig Bars with Thyme just might help you learn to love the figgy cookie.", "totalTime": "2 hours", "recipeYield": "makes twenty-five 1 1/2-inch squares", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["<strong>For the pastry:</strong>", "2 ounces (1/2 cup) walnuts", "1/4 cup plus 2 tablespoons granulated sugar", "6 3/4 ounces (1 1/2 cups) unbleached all-purpose flour ", "1/2 cup packed light brown sugar", "1/2 teaspoon table salt", "1/2 teaspoon baking powder", "4 ounces (1/2 cup) cold unsalted butter, cut into small pieces", "1 large egg yolk", "1 teaspoons pure vanilla extract", "&nbsp;", "<strong>For the jam:</strong>", "2 pounds very ripe figs, stems removed, unpeeled ", "1/4 cup granulated sugar", "7 to 8 large sprigs fresh thyme", "Finely grated zest of 1 lemon", "1 to 2 tablespoons fresh lemon juice; more or less to taste "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the pastry:</strong> Position a rack in the center of the oven and heat the oven to 350&deg;F. In a food processor, grind the walnuts with 2 tablespoons of the granulated sugar until fine; remove and set aside. Put the flour, the remaining 1/4 cup granulated sugar, the brown sugar, salt, and baking powder in the food processor; process until blended. Add the butter; process until the mixture looks crumbly. Add the egg yolk and vanilla and pulse until the mixture is wet and clumping, about \u202840 seconds (it won’t form a ball). Pack two-thirds of the dough into an ungreased 8x8-inch baking dish; set aside the other third. Bake until the dough is lightly browned and keeps a slight indentation when you press it lightly, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the jam:</strong>While the crust is baking, coarsely chop the figs. Put them in a nonreactive skillet with the sugar and thyme and cook over medium-high heat, stirring occasionally, until the juices have reduced and the fruit is tender and thick, about 20 minutes. Discard the thyme sprigs. Stir in the lemon zest, add the lemon juice to taste, and set aside. (If not using right away, refrigerate in a closed container.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the fig bars:</strong> In a bowl, crumble together the remaining dough with the reserved walnut and sugar mixture. Gently spread the fig jam on top of the baked crust and sprinkle the dough mixture over the filling. The top will look crumbly. Bake until browned on top, about 40 minutes. Let cool completely before cutting into\u2028 1 1/2-inch squares.</p>"}]}