{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110907-169510-iced-lemon-loaf-primary.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "cake", "lemon", "lemon zest"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Iced Lemon Loaf", "link": "https://www.seriouseats.com/recipes/2011/09/iced-lemon-loaf-cake-amanda-hesser-maida-heatter-recipe.html", "description": "This recipe is adapted from Amanda Hesser's Lemon Cake recipe from <a href=\"http://www.amazon.com/Essential-New-York-Times-Cookbook/dp/0393061035/?tag=serieats-20\">The Essential New York Times Cookbook</a>, which in turn was adapted from Maida Heatter's East 62nd Street Lemon Cake", "totalTime": "3 hours", "recipeYield": "20", "recipeCategory": ["Cakes", "Desserts", "Lemon"], "recipeIngredient": ["<b>For the Candied Lemon Peel</b>", "3 lemons", "1 cup sugar", "1 cup water", "&nbsp;", "<b>For the Cake</b>", "3 cups all-purpose flour", "3 tablespoons buttermilk powder", "½ teaspoon baking powder", "½ teaspoon baking soda", "1 teaspoon kosher salt", "½ pound (2 sticks) unsalted butter", "1 cup sugar", "Zest from 6 large lemons (approximately ⅓ cup)", "¼ cup fresh lemon juice", "¾ cup water", "1 tablespoon vanilla extract", "4 extra large eggs", "&nbsp;", "<b>For Lemon Syrup</b>", "Reserved syrup from candied lemon peel", "Juice from one large lemon", "&nbsp;", "<b>For Lemon Icing</b>", "1 ¾ cup confectioners sugar", "Juice from 1 large lemon", "1 teaspoon of vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the candied lemon peel: Fill two small to medium saucepans with 1 quart of water and set to boil over high heat. In a large bowl prepare an ice bath by filling ¾ with cool water and ice cubes. You’ll want your ice bath to be large enough to accommodate your strainer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a vegetable peeler remove long strips of lemon peel from 3 lemons, end to end. Dig your peeler in shallowly to avoid the pith. Trim peel into thin strips with a paring knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water comes to a boil, add peel to Pot #1 blanch for 20 seconds. Strain peel. Place strainer in ice bath (so peel remains contained) Rinse and refill Pot #1 with another quart of water, and return the pot to a boil. Repeat process alternating between Pot #1 and Pot #2. You will blanch the peel a total of five times. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once blanching process is complete, combine one cup of water and one cup of sugar in one of your clean pots. Stir until sugar dissolves. Add peel and simmer for 20 minutes.  Remove from heat to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Grease and flour two 8.5 inch loaf pans. Line the pan bottoms with parchment paper. In a large bowl mix flour, buttermilk powder, baking powder, baking soda, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, using the paddle attachment, beat butter and sugar on medium until light and fluffy. Add lemon zest and mix until just combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl combine lemon juice, water and vanilla. Alternate adding the liquid mixture and dry mixture to the butter mixture beginning and ending with the dry mixture. Mix until thoroughly combined, scraping the sides as necessary. Add eggs, one at a time, mixing until just combined. Divide batter evenly among prepared pans and bake for 45-60 minutes or until cake tester comes out clean. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While loaves are baking, use a fork to remove candied lemon peel from syrup. Set peel aside on a bowl or plate. Add the juice of one lemon to the reserved candied lemon peel syrup. Whisk until sugar dissolves, heat over low flame stirring to melt any crystallized sugar, if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool finished loaves in pan for 10 minutes then invert on wire rack set up over a baking sheet. To ease absorption of syrup make several evenly scattered pricks with cake tester . Spoon about an 1/8 of a cup of lemon syrup over each loaf and let cool for about 5 minutes. Flip loaves make pricks to the top then spoon another 1/8 cup of lemon syrup on each loaf and let cool completely. Leftover syrup can be stored in the refrigerator in an airtight container for several days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together confectioners sugar, lemon juice and vanilla until smooth. Pour icing over tops of cooled lemon cakes allowing it to drip down the sides. Top immediately with candied lemon peel. Store covered.</p>"}]}