{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120820-tomato-jam-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Jam", "Preserved", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Tomato Jam", "link": "https://www.seriouseats.com/recipes/2011/08/tomato-jam-recipe.html", "description": "Tomatoes are perfect candidates for end-of-the-summer jam. In this recipe, juicy heirlooms are paired with fresh ginger, cinnamon, and a dash of red pepper flakes for kick. This jam is absolutely delicious on a BLT or a grilled cheddar cheese sandwich. It also makes a lovely accompaniment to grilled fish or a condiment for burgers.", "totalTime": "About 3 1/2 hours", "recipeYield": "Makes 3 half-pints", "recipeCategory": ["Condiments and Sauces", "Tomato"], "recipeIngredient": ["3 pounds best quality tomatoes, cored and chopped", "2 cups granulated sugar", "1/4 cup freshly squeezed lemon juice", "1 tablespoon freshly grated ginger", "2 teaspoons red pepper flakes", "1 teaspoon salt", "1/2 teaspoon cinnamon", "1/4 teaspoon cumin", "2 tablespoons liquid pectin (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place three half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine tomatoes, sugar, lemon juice, ginger, red pepper flakes, salt, cinnamon, and cumin in a large, heavy-bottomed pot and bring to a boil over medium-high heat, stirring frequently. Reduce heat and simmer until the mixture reaches a thick, jam like consistency, about two and a half hours. Stir in the pectin (if using) and simmer for one minute more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 15 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}