{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110511-tabor-exterior.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "Czech", "dumplings", "eastern european", "food trucks", "Heather Shouse", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Paprikash with Dumplings", "link": "https://www.seriouseats.com/recipes/2011/05/chicken-paprikash-with-dumplings-tabor-portland-or-recipe.html", "description": "[Photograph: Robyn Lee] Most food trucks' menus lean towards handheld foods that can be eaten on the go&mdash;sandwiches, burgers, hot dogs, tacos and the like, but others, like Portland's Tabor, are more concerned with doling out delicious, authentic fare, unconcerned...", "totalTime": "3 hours", "recipeYield": "makes 4 servings", "recipeCategory": ["Chicken"], "recipeIngredient": ["<strong>For the Chicken:</strong>", "2 tablespoons vegetable oil ", "1 small yellow onion, diced ", "3 tablespoons unsalted butter", "1 tablespoon Hungarian paprika", "1 1/2 cups plus 2 tablespoons water", "1/2 teaspoon freshly ground black pepper", "1 teaspoon salt", "1 pound boneless, skinless chicken thighs, cut into 3-inch pieces", "2 tablespoons all-purpose flour", "1/4 cup heavy cream", "1/4 cup sour cream", "1/4 cup ajvar (a Middle Eastern pepper spread, optional)", "&nbsp;", "<strong>For the Dumplings:</strong> ", "3 1/2 cups all-purpose flour, plus more as needed", "1 teaspoon dry yeast", "1 cup whole milk, at room temperature, plus more as needed ", "2 eggs, beaten", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the chicken:</strong> Heat 1 tablespoon of the oil over medium heat in a large sauté pan. Add the onion and cook, stirring every few minutes, until the onions are nice and brown and the oil has been absorbed. Add the butter and paprika, followed immediately by the 1 1/2 cups water (paprika turns bitter when burned, so be sure to add the water quickly). Add the pepper and salt and turn the heat down to a low simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large nonstick pan over high heat. Add the remaining 1 tablespoon oil and slowly place the chicken, one piece at a time, into the pan, being careful not to crowd (cook the chicken in batches if your pan isn’t large enough so that the pieces doesn’t overlap). Don’t touch the chicken for 4 to 5 minutes, then turn each piece to allow the other side to brown. Once the pieces are brown, transfer them to the sauté pan holding the sauce and simmer for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small mixing bowl, combine the flour with the remaining<br />\n2 tablespoons water and whisk until smooth. Slowly add the flour mixture to the chicken mixture while gently stirring. Bring just to the boiling point, then turn off the heat. Gently stir in the cream, sour cream, and ajvar. Spoon over the dumplings and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dumplings:</strong> Mix 1 cup of the flour and the yeast together with a fork in a large mixing bowl, then whisk in the milk. Let the mixture rest for about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs, mixing with a fork as you add them, then slowly add the remaining 2 1/2 cups flour. Knead the dough until it thickens, is somewhat springy, and no longer sticks to your hands (add more flour or milk if necessary to get the right consistency). Divide the dough into two equal pieces and roll each piece into a log about 2 inches in diameter. Allow the dough to rise until the logs have doubled in size, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large stockpot about 3/4 full with water, add the salt, and bring to a boil. Carefully place each roll of dough into the pot. Let the water return to a boil, lower the heat to medium, cover, and cook for 13 minutes. Using a slotted spoon, remove the dumpling rolls from the water, and quickly stab each side a few times with a sharp knife. Allow the dumplings to rest for at least 5 minutes. Slice the dumplings crosswise into rounds 1/2 inch thick just before serving.</p>"}]}