{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110323-143437-tea-brined-batter-fried-picnik-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "fried chicken", "Molly O'Neill", "One Big Table", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Tea-Brined Batter Fried Picnic Chicken", "link": "https://www.seriouseats.com/recipes/2011/03/cook-the-book-tea-brined-batter-fried-picnic.html", "description": "Sweet tea and fried chicken might just be the most Southern of all pairings.  This recipe for <strong>Tea-Brined Batter Fried Picnic Chicken</strong> from <strong><em><a href=\"http://www.amazon.com/One-Big-Table-fishermen-pit-masters/dp/0743232704/serieats-20\">One Big Table</a></em></strong> by <a href=\"http://onebigtable.com/about-molly/\">Molly O'Neill</a> comes from <a href=\"http://www.blackberryfarm.com/\">Blackberry Farm</a>, an absolutely gorgeous resort in Tennessee.  Blackberry Farm has two major draws&mdash;breathtaking grounds and an incredible kitchen.  This chicken is meant to be cooled and packed for a picnic lunch the following day, preferably to be enjoyed while out exploring the resort's acres.", "totalTime": "3 days", "recipeYield": "serves 8", "recipeCategory": ["Cook the Book", "Deep Frying", "Fried Chicken"], "recipeIngredient": ["<strong>For the Chicken:</strong>", "1 quart freshly brewed tea ", "Zest of 1 lemon, removed with a vegetable peeler", "1 cup sugar", "1/2 cup kosher salt", "1 quart ice water", "8 whole chicken legs, thighs and legs separated", "<strong>For the Coating:</strong>", "5 cups all-purpose flour", "2 cups buttermilk ", "2 large eggs", "2 cups finely ground cornmeal", "2 tablespoons seasoning, such as Old Bay", "1 tablespoon chili powder", "1 tablespoon fine sea salt", "1 teaspoon freshly ground black pepper", "6 cups vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To brine the chicken: Two days before serving the chicken, combine the tea, lemon zest, sugar, and salt in a saucepan and simmer for 2 to 3 minutes, until the salt and sugar are dissolved. Remove from heat, add the ice water and cool completely. Submerge the chicken pieces in the liquid, cover, and refrigerate for 48 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 1 hour before serving, remove the chicken from the brine and drain in a strainer for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the coating: Place 3 cups of the flour in a large bowl. Whisk together the buttermilk and eggs in a second bowl. Whisk together the remaining flour, the cornmeal, Old Bay, chili powder, salt, and pepper in a third bowl. Set two wire racks over two separate rimmed baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the chicken dry with paper towels. Coat each piece lightly the plain flour and shake off the excess. Dip in the buttermilk and egg batter, and finally roll the chicken in the cornmeal mixture. Transfer the pieces to a rack and let sit 20 to 30 minutes before frying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large cast-iron skillet and heat over high heat until a pinch of flour sprinkled into the oil immediately bubbles or a deep-frying thermometer registers 365°F. Working in batches, fry the chicken pieces, adjusting the heat as necessary to maintain the oil temperature. Cook for 8 minutes, flip, and cook for 7 minutes more. The chicken should be golden brown. The juices should run clear when the thickest part is pierced, and an instant-read thermometer should register 165°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pieces to the clean wire rack; blot them with paper towels. Cool for a few minutes or cover lightly and place in the refrigerator overnight before serving.</p>"}]}