{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201104019-dt-fish-with-saffron-tomato-cous-cous.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["cous cous", "Dinner Tonight", "fish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Dinner Tonight: Fish with Saffron-Tomato Cous Cous", "link": "https://www.seriouseats.com/recipes/2011/04/fish-with-saffron-tomato-cous-cous-recipe.html", "description": "Usually, my go-to technique when cooking fish is to crank up the heat for a smoking hot sear. The theory goes that fish, especially white-fleshed varieties, are pretty mild in flavor, so the more caramelization and flavor that can be built into the cooking process, the better. Of course, that all falls apart when you taste a recipe like this, with the fish resting in a broth so intensely flavored you don't need much else.", "totalTime": "35 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Fish"], "recipeIngredient": ["4 cups fish stock or broth", "4 fillets mild white fish", "2 tablespoons olive oil", "2 tablespoons tomato paste", "1/4 teaspoon red chile flakes, or more to taste", "1 pinch saffron, dissolved in a little hot fish stock or water", "1 1/2 cups instant cous cous", "2 tablespoons chopped parsley", "sliced or slivered almonds, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pot large enough to hold the fish fillets snugly, bring the fish stock to a simmer.  Immerse the fillets in the stock and cooking, turning once if necessary to cook evenly, until just done, 8-15 minutes depending on thickness. Transfer fillets carefully to a platter, remove skin if they have it, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (10-inch) skillet, heat the olive oil over medium until shimmering.  Add tomato paste and chile flakes and cook stir well to combine.  Cook for about a minute, until the tomato paste begins to caramelize.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the fish stock gradually, stirring well into the paste to combine, then add saffron.  Add cous cous to the pot and remove from heat until it has cooking and absorbed enough liquid (if using non-instant cous cous or large Israeli cous cous, simmer until cooked through). Stir in parsley just before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide couscous mixture amongst 4 bowls, top with fish, and garnish with toasted almonds.  Serve immediately.</p>"}]}