{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110420-148324-revelatory-caramel-cake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cakes", "caramel", "Cook the Book", "John T. Edge", "Sara Roahen", "The Southern Foodways Alliance Community Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Revelatory Caramel Cake", "link": "https://www.seriouseats.com/recipes/2011/04/revelatory-caramel-cake-recipe-ann-cashion.html", "description": "Adapted by D.C. chef <a href=\"http://www.starchefs.com/features/women/html/bio_cashion.shtml\">Ann Cashion</a>, this <strong>Revelatory Caramel Cake</strong> from strong&gt;<em><a href=\"http://www.amazon.com/Southern-Foodways-Alliance-Community-Cookbook/dp/0820332755/serieats-20\"></a>The Southern Foodways Alliance Community Cookbook</em></strong>, this caramel cake is similar in flavor to an angel food cake but with a much denser crumb.  Once baked and cooled, it can be iced and filled any which way you please. But being a caramel cake, this one is really all about the icing. It's actually more like a candy coating.", "totalTime": "1 hour 30 minutes", "recipeYield": "one 8-inch layer cake", "recipeCategory": ["Bake the Book", "Cakes", "Cook the Book", "Desserts"], "recipeIngredient": ["<strong>For the white cake layers:</strong>", "4 large egg whites, at room temperature", "1 cup whole milk, divided", "2¼ teaspoons vanilla extract", "3 cups sifted cake flour", "1½ cups sugar", "4 teaspoons baking powder", "¾ teaspoon salt", "¼ pound plus 4 tablespoons (1½ sticks) unsalted butter, cut into 1-tablespoon pieces, at room temperature", "<strong>For the caramel icing:</strong>", "3 cups sugar, divided", "3 tablespoons light corn syrup", "1½ cups whole milk", "4 tablespoons (½ stick) unsalted butter", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cake layers:</strong> Preheat the oven to 350ºf. Grease 3 eight-inch cake pans. Line the bottoms with rounds of parchment and grease the parchment. Lightly coat the inside of the pans with flour, tapping out the excess. Set the pans aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the egg whites, ¼ cup of the milk, and the vanilla in a small bowl; set aside. In a large bowl, whisk together the flour, sugar, baking powder, and salt. Scatter the pieces of butter over the top and pour in the remaining ¾ cup of milk. Use an electric mixer set to low speed to mix the batter until the dry ingredients are moistened. Increase the mixer to medium speed and beat the batter for 90 seconds. Scrape down the sides of the bowl with a rubber spatula. With the mixer set to medium speed, add the egg mixture in 3 additions, beating the batter for 20 seconds after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly among the 3 prepared pans and smooth the tops with the spatula. Bake until a tester inserted into the center of the cakes comes out clean and the cakes are just beginning to pull away from the sides of the pan, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The layers will be light golden on top, not browned. Cool the layers in the pans on a wire rack for 10 minutes. Turn out the layers onto the rack to cool to room temperature before making the icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the caramel icing:</strong> In a small saucepan, stir together 2½ cups of the sugar, the corn syrup, and the milk; cook over medium heat, stirring until the sugar dissolves. Keep warm over low heat. In a deep, heavy saucepan, sprinkle the remaining ½ cup of sugar evenly over the bottom. Cook over medium heat without stirring until the sugar dissolves, caramelizes, and turns the color of amber. Carefully pour the warm milk mixture into the caramel; the mixture will bubble vigorously and hiss, and the caramel will harden. Cook over medium-high heat, stirring constantly with a wooden spoon, until the caramel loosens from the bottom of the pan and dissolves into the liquid. Cook without stirring until the mixture reaches soft-ball stage (235ºf ) on a candy thermometer. Remove from the heat and stir in the butter and vanilla. Set aside to cool for 15 minutes. Beat vigorously with a wooden spoon or an electric mixer set to medium speed until the icing is no longer shiny and is thick and creamy enough to spread, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the cake:</strong>Place a cake layer on a serving plate. Pour enough icing over the layer to cover the top. Add the next cake layer and cover the top with icing. Add the final cake layer and slowly pour the rest of the icing over the top, letting it run down the sides. Use an offset spatula to gently spread the icing evenly around the sides of the cake, taking care to not rip the cake. Let the cake rest at room temperature at least 2 hours or until the icing is set before serving.</p>\n\n<p><small><strong>Note: </strong>You can also bake the cake in 2 nine-inch pans. Increase the baking time to about 30 minutes.</small><br />\n</p>"}]}