{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110105-shack-stack-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "sandwich", "The Burger Lab", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Fake Shack, Mach Two: The Double Shack Stack Cracked", "link": "https://www.seriouseats.com/recipes/2011/01/the-fake-shack-mach-two-double-shack-stack-burger-recipe.html", "description": "Where the Double Shack Stack veers towards extra-awesomeness is with the addition of a 'Shroom Burger between the smashed beef patties. Two portobello mushroom cups sandwich around big glob of cheese that gets breaded in panko-style breadcrumbs and deep fried...", "totalTime": "45 minutes", "recipeYield": "makes 2 burgers", "recipeCategory": ["Beef", "Burger", "Sandwiches", "The Burger Lab"], "recipeIngredient": ["1 pound fresh ground beef, preferably the <a href=\"http://www.seriouseats.com/recipes/2009/10/the-fake-shack-shake-shack-burger-recipe.html\">Shake Shack blend</a>", "4 portobello mushroom caps, 4-inches wide each, stems and gills discarded", "2 ounces grated muenster cheese", "2 ounces grated sharp cheddar cheese", "1 cup flour", "2 eggs, beaten", "1 cup panko breadcrumbs", "1 quart peanut oil", "Kosher salt", "Freshly ground black pepper", "1/2 teaspoon vegetable oil", "4 slices American cheese", "2 Martin's Sandwich-sized Potato Rolls, toasted in butter", "2 tablespoons <a href=\"http://www.seriouseats.com/recipes/2009/10/the-fake-shack-shake-shack-burger-recipe.html\">Shack Sauce</a>, or condiments of your choice", "2 leaves green-leaf lettuce", "4 slices roma tomato"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide beef evenly into four 4-ounce patties and shape each into a puck approximately 2 inches tall by 2.5 inches wide. Set aside in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line large plate with triple layer of paper towels. Place mushroom caps on plate and top with another triple layer paper towels. Top with heavy second plate and microwave on high heat until mushrooms are completely tender and flexible, about 4 minutes (they will be very hot). Alternatively, steam mushrooms in steamer until tender, about 10 minutes. Once slightly cooled, press firmly between paper towels to remove excess moisture. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine muenster and cheddar cheese and divide in half. Place one mushroom cap top side down on a 12-inch square of plastic wrap. Form half the cheese into a 3-inch patty and place on top of the mushroom cap. Top with second mushroom cap, top side up. Gather plastic wrap and twist to form mushrooms and cheese into compact patty shape. Repeat with remaining mushrooms and cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one mushroom patty, coat in flour, dip in egg wash, and coat in breadcrumbs. Return for a second layer of egg wash, and a second layer of breadcrumbs. Repeat with the second mushroom patty and allow both patties to rest in the crumbs for five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the oil in a wok or sauté pan to 375°F over high heat (use a thermometer). Add the mushroom patties to the hot oil and fry, shaking gently until golden brown on first side, about 2 minutes. Flip and continue to cook until second side is golden brown, about 2 minutes longer. Transfer to a paper-towel lined place, season with salt, and tent with foil while you cook the burgers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using wadded-up paper towel, rub inside of heavy-bottomed 12-inch skillet with vegetable oil, then place over medium-high heat until just beginning to smoke. Season beef pucks on top side with salt and pepper, then place, seasoned side down, in skillet. Using back of heavy, flat spatula, press down on beef pucks firmly to form 4-inch round patties, being careful not to let it stick to bottom of spatula. Season top side with salt and pepper. Cook until crisp brown crust has formed, about 2-minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully scrape patties from skillet, and flip. Top each patty with 1 slice American cheese. Cook until cheese is melted, about 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While burgers are cooking, spread top bun with 1 tablespoon sauce. Place 1 leaf lettuce and 2 tomatoes on top of sauce. Place 1 cooked burger patty on each bottom bun followed by the mushroom patty and the second burger patty. Close the sandwiches, and serve immediately.</p>"}]}