{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110406-chinese-appetizers-dumplings-12.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["appetizers", "Asian", "Chinese", "Chinese Appetizer Recipe Week", "dumpling"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "6"}, "name": "Chinese Fried Pork and Cabbage Dumplings With Homemade Wrappers (guo tie)", "link": "https://www.seriouseats.com/recipes/2011/04/pork-and-leek-dumplings-with-homemade-wrapper.html", "description": "Nice fatty pork keeps things moist, while cabbage acts much in the way that breadcrumbs work in meatloaf or meatballs: it physically impedes the pork muscly proteins from binding too tightly with each other, ensuring that the filling stays tender...", "totalTime": "1 1/2 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Christmas", "Sides"], "recipeIngredient": ["<strong>For the Dough:</strong>", "2 cups (10 ounces) all-purpose flour", "1 cup boiling water", "&nbsp;", "<strong>For the Filling:</strong>", "1/2 pound napa cabbage (about 1/2 a small head), roughly chopped", "1 teaspoon kosher salt", "2 scallions, roughly chooped", "1/2 pound fatty ground pork", "2 teaspoons soy sauce", "1 tablespoons Shaoxing wine", "2 teaspoons sugar", "&nbsp;", "<strong>For the Dipping Sauce:</strong>", "2 tablespoons soy sauce", "2 tablespoons Chinkiang vinegar (or rice vinegar)", "1 teaspoon sugar", "1 tablespoon finely sliced scallion greens", "1 teaspoon ginger, grated on a microplane", "&nbsp;", "<strong>To Cook:</strong>", "Vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough</strong>: place flour in bowl of food processor. With machine running, slowly drizzle in water until cohesive dough is formed (you probably won't need all the water). All dough to ride around processor for 30 seconds. Form into a ball using floured hands and transfer to a bowl. Cover with a damp towel and let rest for at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the filling</strong>: Place cabbage and salt in food processor and pulse until finely chopped, about 10 one-second pulses. Transfer to a fine-meshed strainer set over a bowl. Allow to rest for 30 minutes. Meanwhile, place scallions, pork, soy sauce, Shaoxing wine, and sugar in bowl of food processor. Pulse until homogeneous and pasty, about 10 one-second pulses. Transfer to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After cabbage has purged, squeeze any remaining moisture out with your fingers, then transfer to the bowl with the pork. Fold together with a spatula until homogeneous. Microwave a small ball of the filling in a bowl for 10 seconds and eat it to taste for seasoning. Add more salt, soy sauce, or sugar as necessary and repeat tasting/seasoning step until the filling tastes like you want it to. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Dumplings:</strong> Divide dough into 4 sections, and each section into 10 small tablespoon-sized balls, making 40 balls total. On a well-floured work surface, roll each ball into a round 3 1/2- to 4-inches in diameter. Stack wrappers and keep under plastic until all of them are rolled out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form dumplings, place 1 tablespoon of filling in the center of a wrapper. Moisten the edges of the wrapper with a wet fingertip or a pastry brush. Fold in half and pinch the bottom-right corner closed. Pleat the front edge of the wrapper repeatedly, pinching the edge closed after each pleat until the entire dumpling is sealed. Transfer sealed dumplings to a lightly floured wooden or parchment-lined board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Sauce</strong>: Combine all sauce ingredients in a small bowl and set aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook the Dumplings</strong>: Bring a large pot of water to a boil. Add a 6 to 12 dumplings and boil until they float (About 1 minute). Continue boiling for 2 minutes longer, then transfer to a plate with a wire-mesh spider or slotted spoon. Heat 3 tablespoons vegetable oil in a 10-inch nonstick skillet or the bottom of a well-seasoned cast iron wok over medium heat until shimmering. Add dumplings flat-side down and cook, swirling occasionally, until bottom of dumplings are golden brown and crisp. Serve immediately with dipping sauce. Repeat step 7 with remaining dumplings, working in batches.</p>"}]}