{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111127-180817-preserved-vanilla-pear-jam-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["brandy", "Jam", "pears", "Preserved", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brandied Vanilla Pear Jam", "link": "https://www.seriouseats.com/recipes/2011/11/brandied-vanilla-pear-jam-recipe.html", "description": "For pear lovers, this jam is a must. It combines juicy, mildly floral Bartlett pears with the seeds of a vanilla bean and generous pour of brandy. Try it with a cheese plate, or use it to dress up slices of simple gingerbread or pound cake.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes 5 cups, or 5 half-pint jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Desserts", "Fruit Desserts", "Pear"], "recipeIngredient": ["1 1/2 cups sugar", "3 teaspoons Pomona's Universal Pectin", "4 cups coarsely pureed pears (from about 7 or 8 medium ripe pears)", "1/4 cup freshly squeezed lemon juice", "1/4 cup brandy", "1/2 vanilla bean, split and seeds scraped", "4 teaspoons calcium water (included in the Pomona's box)", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place five half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sugar and pectin in a medium bowl and whisk to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the pears, lemon juice, calcium water, brandy, and the vanilla bean and seeds in a large, heavy-bottomed saucepan and bring to a boil over medium heat, stirring frequently. Add the sugar-pectin mixture and the butter and return the mixture to a full rolling boil. Boil for one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}