{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111016-braised-chicken-with-paprika1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "paprika", "peppers", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Easy Skillet Braised Chicken with Peppers and Paprika", "link": "https://www.seriouseats.com/recipes/2011/11/easy-skillet-braised-chicken-with-peppers-and-paprika-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: You can finish this dish 100% on the stovetop by lowering the heat to the lowest possible setting in step 3, covering the pot, and cooking until tender (about 45 minutes). Stew will improve the...", "totalTime": "1 hour", "recipeYield": "4 to 6", "recipeCategory": ["Chicken"], "recipeIngredient": ["4 to 6 chicken leg quarters", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil", "1 large onion, finely sliced (about 1 1/2 cups)", "1 green bell pepper, finely sliced (about 1 cup)", "1 red bell pepper, finely sliced (about 1 cup)", "2 cloves garlic, finely sliced", "1 tablespoon mild Spanish smoked paprika (or regular paprika)", "1 teaspoon dried marjoram (savory or oregano will work just fine)", "1 tablespoon flour", "1 cup dry white wine", "3 cups low sodium chicken broth", "1 large tomato, peeled, seeded, and cut into 1/2-inch pieces (about 1 cup, see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 350°F. Lightly season chicken legs with salt and pepper. Heat oil in a 12-inch skillet or sauté pan over high heat until lightly smoking. Using tongs, carefully add chicken pieces skin-side-down. Cover with splatter screen or partially cover with lid to avoid splattering. Cook without moving until chicken is deep golden brown and skin is crisp, about 4 minutes. Flip chicken pieces and continue to cook until second side is golden brown, about 3 minutes longer. Transfer chicken to a large plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions and peppers to skillet and cook, using a wooden spoon to scrape up browned bits from bottom of skillet. Stir frequently until completely softened and just starting to brown, about 4 minutes. Add garlic and cook, stirring constantly until fragrant, about 30 seconds. Add paprika, marjoram, and flour, and cook, stirring constantly, until fragrant, about 1 minute longer. Add white wine. Using wooden spoon, scrape browned bitts off of bottom of skillet. Add chicken broth and tomatoes and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle chicken pieces into broth and vegetables so that only crisp skin is showing. Cover pot and transfer to oven (see note). Cook for 20 minutes. Remove lid and continue to cook until chicken is falling off the bone tender, skin is crisp, and sauce is rich, about 20 minutes longer. Season sauce to taste with salt and pepper. Serve with egg noodles, spätzle, rice, or boiled potatoes.</p>"}]}