{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110925-172064-ruhlmans-lemon-pepper-vinaigrette.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["caesar salad", "Cook the Book", "Michael Ruhlman", "Ruhlman's Twenty", "salad", "salad dressings", "vinaigrettes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Lemon-Pepper Vinaigrette, Two Ways", "link": "https://www.seriouseats.com/recipes/2011/09/lemon-pepper-vinaigrette-two-ways-recipe.html", "description": "In his latest cookbook, Michael Ruhlman has included a dressing model that every home cook should try: <strong>Lemon-Pepper Vinaigrette, Two Ways</strong>.  It's a tangy dressing made from lemon juice, olive oil, garlic, Parmigiano, and pepper that can be whisked up in just a few minutes or transformed into a stand up Caesar with the addition of an egg yolk and a few anchovies. It's the sort of light, lemony dressing that gently coats leaves of crisp romaine perfectly, making for a salad that acts at a simple, bright palate awakener, and of course, a brilliant accompaniment to Ruhlman's <a href=\"http://www.seriouseats.com/recipes/#carousel01\">Perfect Roast Chicken</a>.", "totalTime": "5 minutes", "recipeYield": "4", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Dressings and Vinaigrettes", "Salads"], "recipeIngredient": ["<strong>Vinaigrette with Crisp Lettuce</strong>", "3 tablespoons lemon juice", "1 large garlic clove, finely minced or smashed with the flat side of a knife", "Kosher salt", "Freshly ground black pepper", "1/2 cup milliliters olive oil or canola oil", "Zest from ½ lemon", "3/4 pound crisp lettuce such as wedges of iceberg lettuce or romaine/Cos lettuce", "1/2 cup grated Parmigiano-Reggiano (optional) ", " ", "<strong>Caesar variation</strong>", "3 tablespoons lemon juice", "1 large egg yolk", "1 large garlic clove, finely minced or smashed with the flat side of a knife", "1 or 2 anchovies, chopped to a paste if whisking in a bowl, left whole if using a blender", "1/2 cup olive oil or canola oil", "Kosher salt", "Freshly ground black pepper", "3/4 pound romaine/Cos lettuce", "1/2 cup grated Parmigiano-Reggiano", "Croutons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Vinaigrette with Crisp Lettuce:</strong> In a small bowl, combine the lemon juice and garlic and season with salt and pepper. Add the lemon zest. Whisk in the oil. Toss the vinaigrette with the lettuce, season with more pepper, and garnish, if desired, with Parmigiano-Reggiano.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caesar Variation:</strong> Combine the lemon juice, egg yolk, garlic, and anchovies in a bowl or blender. Whisking continuously or with the blender running, pour in 2 or 3 drops of the oil, then continue pouring the oil in a continuous stream until all the oil is emulsified into the vinaigrette. Season with salt and pepper. In a bowl, toss the lettuce with three-fourths of the vinaigrette. Taste and add more dressing if you wish. Garnish with the Parmigiano-Reggiano and croutons.</p>"}]}