{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110330-144982-philly-style-chicken-cutlet-sandwich.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bread crumbs", "broccoli rabe", "chicken", "Cook the Book", "Joe Yonan", "panko", "Philadelphia", "sandwich", "Serve Yourself"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Philly-Style Chicken Cutlet Sandwich", "link": "https://www.seriouseats.com/recipes/2011/04/philly-style-chicken-cutlet-sandwich-recipe.html", "description": "This <strong>Philly-Style Chicken Cutlet Sandwich</strong> is a dressed-up version of the classic with a panko-crusted chicken breast and sweet-spicy Peppadew mayo.", "totalTime": "30 minutes", "recipeYield": "1", "recipeCategory": ["Chicken", "Cook the Book", "Sandwiches"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "1/2 teaspoon red pepper flakes", "3 stalks broccoli rabe, cut into 2-inch pieces", "4 or 5 peppadew peppers, drained and finely chopped", "1 tablespoon mayonnaise", "1 small (about 4 ounces) boneless, skinless chicken breast half", "Kosher or sea salt", "Freshly ground black pepper", "1 egg", "1/4 cup Japanese-style panko", "2 slices provolone cheese, preferably aged (piccante)", "1 large soft Portuguese sweet roll or Philly-style submarine roll, halved "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 tablespoon of the oil into a medium skillet over medium heat.  When it starts to shimmer, add the red pepper flakes and cook, stirring, for a minute or two. Add the broccoli rabe and sauté until the broccoli rabe is tender, 4 to 5 minutes. Use a slotted spoon to transfer the broccoli rabe and red pepper flakes to a plate or bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the peppadew peppers and mayonnaise. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the chicken between two large pieces of plastic wrap on your work surface, and pound it to a thickness of about 1/4 inch. Season it generously on all sides with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl, whisk the egg to combine. Spread the panko crumbs onto a plate. Dip the chicken breast in the egg, then dredge it in the panko crumbs, turning it and patting them on with your hands to coat the chicken well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the remaining 2 tablespoons of oil into the skillet over medium heat. When it starts to shimmer, lay the chicken cutlet in the pan and let it cook undisturbed until it is golden brown on the bottom, 2 to 3 minutes. Use tongs to turn the cutlet over, then lay the provolone pieces on the cooked side of the chicken, overlapping slightly, and cook until the bottom is golden brown and the chicken is cooked through, 2 to 3 minutes. Transfer the chicken to a serving plate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the sandwich, place the two roll halves on the serving plate. Spread one slice with the peppadew mayonnaise, then top with the chicken cutlet, broccoli rabe, and remaining roll half, and eat.</p>"}]}