{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110614-156661-bring-it-on-brisket.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "brisket", "Guy Fieri", "Guy Fieri Food", "mains", "recipe newsletter", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bring It On Beef Brisket", "link": "https://www.seriouseats.com/recipes/2011/06/bring-it-on-beef-brisket-recipe.html", "description": "Fieri's brisket is seared and slowly braised with his homemade chili sauce that ends up being more like a tart, cooked salsa than that sweet jarred stuff. A pile of leeks, carrots, celery, and onion is placed over the brisket and cooked down to nearly melting. Once the brisket is pull-apart tender the sauce is skimmed and blended with the melted veggies, making a fresh, tangy, tomatoey gravy for a brisket so juicy it could easily be served on its own. In other words, bring it on!", "totalTime": "5 hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Beef", "Mains"], "recipeIngredient": ["4 1/2 to 5 pounds beef brisket ", "1 tablespoon kosher salt", "2 tablespoons freshly cracked black pepper", "2 tablespoons canola oil", "2 yellow onions, cut into 1- inch rings", "2 leeks, white and light green parts only, cleaned and cut into thirds", "2 shallots, quartered", "1 carrot, cut in half lengthwise, then into 1- inch chunks", "4 celery stalks, cut into thirds", "3/4 cup Chili Sauce (recipe follows) ", "1/2 cup low- sodium beef stock", "1 12-ounce beer, at room temperature (such as a pale ale)", "&nbsp;", "<strong>Chili Sauce</strong>", "5 large Roma tomatoes", "1 onion, coarsely chopped", "1 jalapeño, seeded and chopped", "1/2 cup apple cider vingar", "2 tablespoons sugar", "1/4 teaspoon salt", "1/2 teaspoon red chili flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chili Sauce:</strong> In a medium saucepan over medium-high heat, combine all of the ingredients and bring to a boil.  Reduce the heat to medium to keep the liquid at a strong simmer and cook for 25 to 30 minutes, until thickened and broken down, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree the mixture in a blender. Return the sauce to the saucepan and simmer for 25 to 30 minutes more, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool, refrigerate, and use for dressings, BBQ sauces, and so on. The sauce will keep in the refrigerator for 3 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Brisket:</strong> Preheat the oven to 350°F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the brisket and pat it dry. Season each side with the salt and pepper, pressing them into the beef. In a large cast-iron Dutch oven over high heat, heat the canola oil to the smoking point. Add the beef, fat side down, and sear until well browned. Repeat on the other side, 3 to 4 minutes per side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with the onions, leeks, shallots, carrot, and celery. Combine the chili sauce and beef stock and pour over the brisket. Cover and roast in the oven for 2 hours, basting every 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pale ale, cover, and cook for 1 1/2 hours more, basting every 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and let the brisket rest at room temperature for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the brisket from the Dutch oven and set it on a cutting board. Carefully remove the fat cap with the edge of a fork and discard. Remove the vegetables and run them through a food mill or pur&eacute;e in a food processor. Skim the fat from the pan juices or use a gravy separator. Add the puréed vegetables back to the Dutch oven with the pan juices. Adjust the seasonings if necessary and heat the sauce over low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the beef on the diagonal, across the grain, and serve with the sauce.</p>"}]}