{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110614-156630-Nick-Malgieri-Brown-sugar-cookies-beauty-610458.jpg", "author": {"@type": "Person", "name": "Nick Malgieri"}, "recipeCuisine": "", "keywords": ["Cookies", "Nick Malgieri"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crisp Brown Sugar Wafers", "link": "https://www.seriouseats.com/recipes/2011/06/crisp-brown-sugar-wafers-recipe.html", "description": "All good cookies are addictive, but these are particularly dangerous. If their shatteringly crisp texture weren't enough, the buttery flavor is accentuated and deepened by brown sugar.", "totalTime": "45 minutes, plus dough refridgeration", "recipeYield": "About forty 2 to 2 1/2-inch cookies", "recipeCategory": ["Cookies"], "recipeIngredient": ["2 1/4 cups (10.5 ounces) all-purpose flour (spoon flour into dry-measure cup and level off)", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "12 tablespoons (1 1/2 sticks) unsalted butter, softened", "1 1/2 cups (12 ounces) light brown sugar, firmly packed", "2 teaspoons vanilla extract", "1 large egg", "1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the flour, baking soda, and salt together and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter, brown sugar, and vanilla with the paddle attachment of an electric mixer on medium speed until well mixed, about a minute. Beat in the egg and yolk one at a time, beating smooth after each addition. Scrape the bowl and beater and beat again for half a minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the mixer, add the flour mixture, and beat in on lowest speed. Remove the bowl and use a large rubber spatula to give a final mixing to the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough onto a large piece of plastic wrap, fold the wrap over it and<br />\r\npress the dough to about 1/2-inch thick. Refrigerate until you are ready to bake the cookies, up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to bake the cookies, set racks in the upper and lower thirds of the oven and preheat to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and cut it into quarters. Return 3 of<br />\r\nthe pieces to the refrigerator. Place the piece of dough on a floured surface and gently knead it until it is slightly softened and malleable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour the dough again and gently roll it out to 1/4-inch thick. Use a 2 to 2 1/2-inch plain cutter to cut cookies, placing them on one of the prepared pans about 3 inches apart in all directions to allow for spreading.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the next piece of dough incorporating the scraps from the previous piece as you knead it. Continue cutting out cookies and repeat adding the scraps with the remaining pieces of dough. When you have nothing bust scraps left to roll, form the dough into a sausage shape and roll it to a rectangle as wide as the cutter you are using. Discard the last few scraps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies until they are firm and dry looking, about 12 to 15 minutes. If your oven gives strong bottom heat, bake the pan of cookies on the lower rack stacked on another pan for insulation.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the papers from the pans to racks to cool.</p>"}]}