{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110802-164325-chocolate-crack-saltines.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate", "cookie bars", "salty-sweet desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5714285714286", "ratingCount": "7"}, "name": "Chocolate 'Crack'", "link": "https://www.seriouseats.com/recipes/2011/08/chocolate-crack-chocolate-bark.html", "description": "This salty and sweet bark is super easy to make and more than mildly addictive. Most traditional recipes use semi-sweet chocolate chips, but if you have access to really good dark chocolate, it will take the recipe to the next level.", "totalTime": "2 hours", "recipeYield": "1 (ok, maybe more like 20, but be warned, it's addictive)", "recipeCategory": ["Chocolate", "Desserts"], "recipeIngredient": ["51 saltine crackers (approximately)", "1 cup unsalted butter", "1 cup dark brown sugar", "1 teaspoon vanilla extract", "12 oz high quality dark chocolate (70% or greater)", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Line a 12 x 17 inch jelly roll pan with foil. Place saltine crackers salt side up and side-by-side in the pan as tightly as possible without overlapping. Use saltine pieces to fill any gaps at the bottom of the pan. Set aside. Chop chocolate so pieces are about the size of standard chocolate chips and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan melt butter over medium heat stirring frequently with a spatula. Once butter has melted, add brown sugar and vanilla stirring to combine. Cook for about 5 minutes or until mixture is an even dark brown color and has begun to bubble. Remove from heat and pour over saltines using spatula to spread sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake crackers for 5 minutes or until butter mixture begins to bubble. Remove from oven and sprinkle evenly with chocolate allowing the heat to melt the chocolate. Spread chocolate evenly with the spatula so all of the crackers are completely covered. Sprinkle with sea salt. Refrigerate until chocolate sets and hardens. Break apart and serve.</p>"}]}