{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111211-182840-preserved-fruitcake-conserve-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["figs", "fruitcake", "Jam", "Preserved", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fruitcake Conserve", "link": "https://www.seriouseats.com/recipes/2011/12/fruitcake-conserve-jam-recipe.html", "description": "This conserve incorporates the best flavors of fruitcake&mdash;dried apricots, figs, and raisins; sweet cherries; and a bit of booze. Walnuts add texture and crunch. Try it slathered over scones or dolloped over pancakes.", "totalTime": "1 hour", "recipeYield": "3 cups, or 3 half-pint jars", "recipeCategory": ["Fruit", "Nuts"], "recipeIngredient": ["1 cup finely chopped fresh pineapple, plus any juices", "1/2 cup coarsely chopped pitted cherries (can use canned cherries)", "1 cup finely chopped dried apricots", "1/2 cup finely chopped dried figs", "1/4 cup coarsely chopped walnuts", "1/4 cup raisins", "1 cup red wine, white wine, apple juice, or water", "1 tablespoon freshly squeezed lemon juice", "1 teaspoon cinnamon", "1/4 teaspoon nutmeg", "2 teaspoons calcium water (included in the Pomona's Pectin box)", "1/4 teaspoon unsalted butter", "1/4 cup honey", "1 1/2 teaspoons Pomona's Pectin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the conserve, prepare the jars and lids: place three half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy bottomed pot, combine the pineapple and any juices, cherries, apricots, figs, walnuts, raisins, wine, lemon juice, cinnamon, nutmeg, calcium water, and butter. Bring to a simmer over medium heat, stirring frequently. Simmer until the dried fruits have softened a bit, about five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, stir together the honey and pectin in a small bowl. Add the honey mixture to the pot and return a full rolling boil. Boil hard for one minute. Remove the pot from the heat and skim any foam from the surface of the conserve with a cold metal spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot conserve into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}