{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111205-181509-ccmacaroons.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["christmas cookies", "Cookies", "holiday cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Christmas Tree Coconut Macaroons", "link": "https://www.seriouseats.com/recipes/2011/12/christmas-tree-coconut-macaroonpcookie-recipe.html", "description": "These sweet little somethings are rendered adorable simply by tinting the coconut with green food coloring and then decorating with sprinkles and writing icing post-baking. They're fun and easy to make, sweet to eat, and it's a very child-friendly baking project to boot!", "totalTime": "1 hour", "recipeYield": "Makes 12 cookies", "recipeCategory": ["Cookies"], "recipeIngredient": ["1 1/3 cups flaked coconut", "green food coloring", "1/3 cup sugar", "2 tablespoons flour", "1/4 teaspoon salt", "2 egg whites", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the coconut and several drops of green food coloring in a large bowl. Using your hands (if you do, wear gloves) or a wooden spoon, mix until the green color is evenly distributed. Depending on the type of dye you are using, add more drops and stir until the color has reached your desired hue of green.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar, flour, and salt, stirring with a wooden spoon until the mixture is evenly distributed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the egg whites and vanilla, once again stirring until evenly distributed; the mixture should be wet and somewhat sticky and thick. At this point, put the mixture in the refrigerator for about half an hour to chill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Near the end of your cooling time, preheat your oven to 325&deg;F. Line a cookie sheet with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the dough by rounded teaspoonfuls about 2 inches apart on your prepared sheet. Using your hands, shape the mounds into as much of a Christmas tree shape as you can--kind of pinch it into a point on top. They will flatten a bit during baking, but the general shape should hold. If desired, sprinkle on red sprinkles to resemble little ornaments on the trees; star-shaped sprinkles can be added on the top of each mound.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 18-22 minutes, or until they appear solid when lightly poked (it will be hard to detect light browning because of the green color). Remove cookies from the oven and let cool for 5 minutes before transferring to a wire rack to cool completely. Once cooled, add whatever other decorations you'd like: garlands or \"lights\" drawn in with writing icing, for instance.</p>"}]}