{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110405-144992-catfish-tacos-with-chipotle-slaw.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cabbage", "catfish", "chipotle", "cole slaw", "Cook the Book", "Joe Yonan", "Serve Yourself", "slaw", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Catfish Tacos with Chipotle Slaw", "link": "https://www.seriouseats.com/recipes/2011/04/catfish-tacos-with-chipotle-slaw-recipe.html", "description": "Crunchy fish, crisp slaw, and a touch of sour heat from the salsa verde. These have serious West Coast fish taco cred and make for ideal spring and summer eating.", "totalTime": "45 minutes", "recipeYield": "1", "recipeCategory": ["Cabbage", "Cook the Book", "Fish"], "recipeIngredient": ["1 cup shredded red cabbage (about 1/4 small head)", "1 teaspoon kosher or coarse sea salt, plus more to taste", "2 tablespoons Mexican crema or sour cream", "1 teaspoon adobo sauce (from canned chipotle in adobo) or 1/2 teaspoon ground chipotle chile", "6 ounces catfish fillet, cut crosswise into 2-inch strips", "Freshly ground black pepper", "1 egg", "1/2 cup Japanese-style panko ", "Canola oil, for frying", "3 corn tortillas", "1/4 cup salsa verde or other tangy salsa", "1 lime, cut into quarters", "A few sprigs cilantro (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the cabbage and salt in a colander set over a plate or baking sheet, put a plate directly on the cabbage, and weight it down with a heavy object, such as a large can of tomatoes or beans, for at least 30 minutes. Drain the cabbage. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out a couple of sheets of paper towels on your countertop. Transfer the cabbage to the paper towels. Roll up the paper towels and, holding it above a bowl, use your hands to squeeze the extra moisture out of the cabbage. Transfer the cabbage to a small bowl and add the crema and adobo sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the catfish well on both sides with salt and pepper. Whisk the egg in a medium bowl until just combined; spread the panko on a plate. Dredge each piece of catfish first in the egg, then in the panko, packing the panko lightly onto the fish with your hands to get it to stick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a plate with paper towels. Pour enough canola oil into a large cast-iron skillet to come to a depth of 1/2 inch and turn the heat to medium-high. When the oil starts to shimmer, add the fish and fry without turning until the panko crumbs are a deep golden brown, 2 to 4 minutes. Turn and fry until golden brown on the other side, another 2 to 4 minutes. Transfer the fish to the paper towel–lined plate. (Alternatively, preheat the oven to 425°F. After coating the fish, transfer it to a small rack set on a baking sheet and bake for 10 to 12 minutes, or until lightly golden brown and crisp.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the fish is frying or baking, warm the tortillas and wrap in aluminum foil to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the tacos, lay the tortillas out on a plate. Divide the fish strips among the tortillas. Top with the chipotle slaw, salsa verde, a squeeze of lime, and cilantro, and eat.</p>"}]}