{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110913-127355-dinner-tonight-corn-cakes.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["corn", "corn cakes", "Dinner Tonight", "goat cheese", "Martha Stewart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner Tonight: Corn Cakes with Goat Cheese and Bacon", "link": "https://www.seriouseats.com/recipes/2011/09/corn-cakes-with-goat-cheese-an.html", "description": "It's that time of year (at least in the Midwest) when it's nearly impossible to stumble across a bad ear of corn. They are obviously wonderful when cooked simply and slathered in butter, but I'm also a fan of taking the fantastically sweet kernels off the cob and using them to perk up what would normally be a standard dish. This recipe from <a href=\"http://www.marthastewart.com/335559/corn-cakes-with-goat-cheese\">Martha Stewart</a> would probably be fine with frozen corn, but using the best stuff makes a real difference.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Bacon", "Corn", "Dinner Tonight"], "recipeIngredient": ["2 tablespoons plus 1 teaspoon extra-virgin olive oil", "3 cups fresh corn (about 3 ears corn)", "1 zucchini, diced ", "salt and black pepper ", "8 slices bacon ", "2 scallions, ends trimmed, thinly sliced", "2 large eggs, lightly beaten ", "1/4 cup cornmeal ", "2 ounces goat cheese, crumbled "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 teaspoon of the oil into a large non-stick skillet set over medium heat. When oil starts to shimmer, add the corn and zucchini, and season with salt and pepper. Cook, stirring occasionally, until the zucchini softens, three to five minutes. Transfer mixture to a large bowl and let cool for five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook the bacon in a separate skillet until crisp. Set aside when done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the scallions, eggs, and cornmeal to the bowl with the corn and zucchini. Stir well. Wipe out the nonstick skillet, and then pour in the remaining 2 tablespoons of the olive oil and turn the heat to medium. When oil is shimmering, scoop out about 1/2 cup of the corn mixture and pour into the skillet. Add as many scoops as will bit comfortably in the skillet. Cook until each is browned on the bottom, about three minutes. Flip, and brown on the bottom, about two minutes. Drain each cake on some paper towels. Repeat this process until all of the corn mixture has been used. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the corn cakes garnished with the crumbled goat cheese, salt and pepper to taste, and the bacon. </p>"}]}