{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110104-130771-GFTues-WeddingSoup.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "Gluten-Free Tuesday", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gluten-Free Tuesday: Italian Wedding Soup", "link": "https://www.seriouseats.com/recipes/2011/01/gluten-free-tuesday-italian-wedding-soup.html", "description": "Have you ever eaten Italian Wedding Soup at a wedding? Probably not, and there's a good reason why: the name for this dish most likely comes from a mistranslation of the classic Neapolitan soup <em>Minestra Maritato</em>, which translates to \"married soup\". The soup's name doesn't refer to a marriage between people, but to how well the meat and greens work together in the soup.", "totalTime": "about two hours", "recipeYield": "6", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday", "Soups and Stews"], "recipeIngredient": ["<strong>For the Meatballs</strong>", "1 pound (93 percent) lean ground beef", "1/4 cup grated Parmesan cheese", "1 large garlic clove, minced or put through a garlic press", "2 teaspoons dried parsley", "2 teaspoon dried basil", "1 teaspoon salt", "1 teaspoon freshly ground black pepper ", "2 tablespoons plain gluten-free dried breadcrumbs", "1 large egg", "&nbsp;", "<strong>For the Soup</strong>", "1 tablespoon olive oil", "2 medium carrots, peeled and sliced into coins (about 3/4 cup)", "2 stalks celery, trimmed and cut into thin pieces (about 3/4 cup)", "1 medium onion, diced (about 1/2 cup)", "2 garlic cloves, minced or put through a garlic press", "1/2 teaspoon salt", "8 cups homemade chicken stock or reduced sodium gluten-free chicken broth", "3 cups water", "5 ounces baby spinach, washed", "Non-stick cooking spray", "2 cups uncooked gluten-free bite-sized pasta shells"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make the meatballs:</em> Spray a baking sheet lightly with non-stick cooking spray.  In a medium mixing bowl, combine ground beef, Parmesan cheese, garlic, parsley, basil, salt, and black pepper. Using your hands, or a wooden spoon, mix beef until all ingredients are evenly distributed. Add egg and bread crumbs. Mix until combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pinch off about two teaspoons of meatball mixture and roll into balls. Place meatballs on greased baking sheet. Set baking sheet aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make the Soup:</em>  Heat olive oil in a large (5 1/2 quart) pot over medium-high heat until hot and shimmering but not smoking. Add carrots. Cook, stirring occasionally with a wooden spoon, until carrots begin to soften, about  three minutes. Add celery, onions, garlic and salt. Cook, stirring occasionally, until vegetables begin to soften, about two minutes. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chicken broth and water. Bring to a boil. Once the soup reaches a boil, add meatballs, one at a time. After you’ve added half the meatballs, stir soup gently with a wooden spoon. Add remaining meatballs and stir. Allow to cook for five minutes. Reduce heat to low and simmer (look for occasional gentle bubbles) for about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While soup simmers, cook pasta. Fill a medium (4 quart) pot 3/4 full with water. Cover pot and bring to a boil over medium-high heat. When water reaches a boil, add 2 teaspoons of salt and pasta. Stir pasta with a wooden spoon for a few seconds to keep it from sticking. Cook pasta until just al dente. Drain  pasta and add to soup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add baby spinach. Stir soup with a wooden spoon. Cook until spinach is wilted and tender, about three minutes. Season with salt and pepper to taste. </p>"}]}