{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110406-127677-Serious-Sweets-Torta-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["desserts", "dulce de leche", "pineapple", "Serious Sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pineapple-Dulce de Leche Torta", "link": "https://www.seriouseats.com/recipes/2011/04/pineapple-dulce-de-leche-cake-recipe.html", "description": "Notes: Pineapple jam can be made up to three days in advance; cool completely and refrigerate in a covered container. I prefer goat's milk dulce de leche, such as Coronado, but any variety of store-bought dulce de leche will do....", "totalTime": "2 hours, 30 minutes", "recipeYield": "8 to 10", "recipeCategory": ["Pastry", "Pineapple"], "recipeIngredient": ["1 large, ripe pineapple, peeled, cored, and cut into small pieces", "1/2 cup water", "2 tablespoons cornstarch", "1 1/2 cups sugar", "1/2 teaspoon salt", "4 tablespoons unsalted butter, cut into 1-inch pieces", "All-purpose flour for dusting counter and rolling pin", "2 sheets Dufour brand frozen puff pastry, thawed according to package instructions (see notes)", "1 1/2 cups dulce de leche (see notes)", "2 tablespoons confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pineapple in food processor and pulse until it becomes a thick puree. Transfer pineapple to large pot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk cornstarch and water in small bowl and stir into pineapple. Stir in sugar and salt and bring mixture to boil over medium-high heat. Reduce heat to medium-low and simmer, stirring occasionally, until golden and jam-like, 45 to 60 minutes. Off heat, stir in butter. Cool completely, 30 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust clean, dry counter and rolling pin with flour. Roll one thawed sheet of puff pastry to a 20- by 14-inch rectangle (see notes). Cut in half crosswise and transfer to prepared baking sheets. Prick pastry all over with fork and bake until golden, alternating sheets halfway through baking, 15 to 20 minutes. Transfer to cooling racks. Once sheets are cool, transfer pastry sheets directly to cooling racks, roll out second sheet of thawed puff pastry, and repeat baking procedure. Cool pastry completely, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer one baked and cooled puff pastry sheet to large platter or inverted baking sheet lined with parchment paper. Spread half of pineapple jam over puff pastry sheet. Top with second puff pastry sheet. Spread 3/4 cup dulce de leche over pastry (see notes). Repeat with remaining puff pastry sheets, pineapple jam, and dulce de leche. Dust confectioner’s sugar over top.  Cut into pieces with sharp knife and serve.</p>"}]}