{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110905-169249-concord-grape-gallette-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["galette", "grapes", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grape Galettes", "link": "https://www.seriouseats.com/recipes/2011/09/concord-grape-galette-grape-pies-what-to-do-with-concord-grapes-recipe.html", "description": "Grapes make a wonderful pie filling that's too beautiful to hide under a top crust. Show off the colors of this fruit's short harvest season by baking local grapes into a rustic galette. This is a versatile recipe that yields either one large free-form galette, or ten mini galettes that are baked inside of 3 inch tart rings to reinforce the sides during the first part of baking.", "totalTime": "4 hours", "recipeYield": "10", "recipeCategory": ["Desserts", "Fruit Desserts", "Grapes", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One double crust recipe for Easy Pie Dough</a>, rolled out into a large circle and chilled ", "1 pound grapes (Concord or other local variety)", "1/2 to 3/4 cup sugar, depending on tartness of grapes", "2 tablespoons cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg; F. Seed grapes either by cutting them open and removing the seeds, or by squeezing the insides out of the skins (set the skins aside), and passing the flesh through a food mill. Combine the skins and insides in a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk sugar and cornstarch together, and then add it to grapes. Stir to combine, until starch is completely hydrated, and sugar has evenly coated grape skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If making mini galettes: Cut 10 circles measuring 4-5 inches in diameter out of the chilled dough sheet. Loosely form the circles into pouches inside the tart rings, placed on a baking sheet lined with parchment paper. fill the pouches of dough 2/3 to the top with filling (the filling will bubble up more during baking), and then chill for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If making one large galette: Place the dough on a sheet tray lined with parchment paper. Pour half of the filling into the center of the dough circle (approximately 18-20 inches in diameter) and allow it to spread 12 inches. Begin forming walls with the dough by folding the edges up where the edge of the filling begins. Pour the rest of the filling into the galette, and fold the edges over the filling so there is a top crust around the perimeter but not over the center. Chill for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the galette(s) in the preheated oven for 10 minutes, then reduce the heat to 350&deg; and rotate the sheet tray. Bake mini galettes for an additional 5 minutes, then carefully remove the rings and allow them to finish baking, approximately 5 more minutes, or until the crust is golden brown and the filling is bubbling. For large galettes, continue baking for approximately 30 minutes after turning down the oven, until the crust is golden brown and the filling is bubbling. Cool for at least 30 minutes before serving.</p>"}]}