{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110415-147530-pan-roasted-striped-bass-with-tunisian-chickpea-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chickpeas", "Cook the Book", "fish", "Michael Schwartz", "Michael's Genuine Food", "salad", "striped bass", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Pan-Roasted Striped Bass with Tunisian Chickpea Salad and Yogurt Sauce", "link": "https://www.seriouseats.com/recipes/2011/04/pan-roasted-striped-bass-with-tunisian-chickpea-salad-and-yogurt-sauce-recipe.html", "description": "This recipe for <strong>Pan-Roasted Striped Bass with Tunisian Chickpea Salad and Yogurt Sauce</strong> can be appreciated on multiple levels. Not only is it a fantastically light fish dish packed full of fresh Mediterranean flavors, but take away the fish and you're left with an awesome vegetarian (and possibly even vegan) chickpea salad spiked with Tunisian <a href=\"http://en.wikipedia.org/wiki/Harissa\">harissa</a> that can be enjoyed hot or cold, and with or without the yogurt sauce depending on how you feel about dairy.", "totalTime": "40 minutes", "recipeYield": "4", "recipeCategory": ["Cook the Book", "Fish", "Legumes", "Salads"], "recipeIngredient": ["Two 15-ounce cans chickpeas, drained and rinsed ", "1/2 small red onion, finely chopped", "1/2 English (hothouse) cucumber, cut lengthwise, seeded, and diced ", "1/4 cup fresh cilantro leaves", "2 celery stalks and leafy tops, chopped", "1/4 teaspoon ground cumin", "1/4 cup drained canned fire-roasted crushed tomatoes mixed with 1 tablespoon harissa", "1/2 cup extra-virgin olive oil", "2 tablespoons champagne vinegar", "Kosher salt and freshly ground black pepper ", "2 tablespoons canola oil ", "Four 8-ounce striped bass fillets, skin on, about 1 1/2 inches thick ", "Yogurt Sauce (recipe follows)", "<strong>For the Yogurt Sauce:</strong>", "1/2 cup Greek-style yogurt", "Juice of 1/2 lemon", "1 garlic clove, minced", "1 tablespoon extra-virgin olive oil", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 1/2 cup of the chickpeas in a mixing bowl. Mash the beans with a fork or potato masher until they are smashed but still have some texture. Add the remaining chickpeas, the onion, cucumber, cilantro, celery, cumin, harissa, olive oil, and vinegar; season generously with salt and pepper. Set aside at room temperature, or cover and refrigerate overnight. Return to room temperature before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a large cast-iron skillet or nonstick ovenproof skillet over medium high heat and coat with the canola oil. Pat both sides of the fish dry with paper towels and season generously with salt and pepper. When the oil is shimmering, lay the fish skin side down in the pan. Sear for 4 to 5 minutes without moving the fillets. Transfer the pan to the oven and roast until the fish is opaque, 6 to 8 minutes. Remove the pan from the oven and carefully flip the fish over with a flat spatula, so the skin side is now up; it should be brown, crisp, and make a sound when you tap it. Let the fish sit in the hot pan for a minute to sear the bottom side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, pool 2 tablespoons of the yogurt sauce on each of 4 plates, place the fish skin side up on top of the sauce, and pile the chickpea salad next to it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Yogurt Sauce:</strong> In a small bowl, combine the yogurt, lemon juice, garlic, and oil; season with salt and pepper. Transfer the yogurt sauce to a container, cover, and refrigerate until ready to use, for up to 7 days.</p>"}]}