{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110705-159702-achiote-marinated-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["banana leaves", "chicken", "Cook the Book", "grill", "grilling", "Latin Grilling", "Lourdes Castro"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Achiote-Marinated Chicken Wrapped in Banana Leaves", "link": "https://www.seriouseats.com/recipes/2011/07/cook-the-book-achiote-marinated-chicken-wrapped-in-banana-leaves.html", "description": "These <strong>Achiote-Marinated Chicken Breasts Wrapped in Banana Leaves</strong> from <a href=\"http://www.lourdes-castro.com/Lourdes-Castro/Lourdes.html\">Lourdes Castro</a>'s <strong><em><a href=\"http://www.amazon.com/Latin-Grilling-Patagonian-Yucatecan-Barbecue/dp/1607740044/?tag=serieats-20\">Latin Grilling</a></em></strong> take inspiration from <em><a href=\"http://en.wikipedia.org/wiki/Cochinita_pibil\">cochonita pibil</a></em>, a Yucatecan dish of marinated suckling pig slow roasted in a banana leaf, preferably buried underground. Since hole digging and piglet obtaining are not exactly standard backyard barbecue activities for most of us, Castro has created a friendlier version using chicken breasts and a grill.", "totalTime": "1 hour", "recipeYield": "8", "recipeCategory": ["Chicken", "Cook the Book", "Grilling"], "recipeIngredient": ["<strong>Achiote Marinade:</strong>", "1/4 cup annatto seeds ", "1 head garlic, cloves separated and peeled", "2 tablespoons salt", "2 tablespoons ground cumin ", "1/4 cup dried oregano", "1 tablespoon black pepper", "3/4 cup apple cider vinegar", "3/4 cup orange juice ", "&nbsp;", "8 skinless, boneless chicken breasts (about 3 pounds total)", "3 large banana leaves ", "4 plum tomatoes, cored and sliced", "1 red onion, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the marinade:</strong> Place the annatto seeds in a blender and turn on high until the seeds are ground. It’s all right if the powder is not evenly ground—just try to get it as fine as you can. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining marinade ingredients in the blender and puree until all the ingredients are well blended into a paste. Remove the marinade from the blender jar and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken breasts in a large resealable plastic bag (you may need to use two) and pour in the marinade. Make sure to coat the chicken well with the marinade. Press out as much air as possible from the bag, seal it, and refrigerate for at least 45 minutes, or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the banana leaf packets:</strong> Use kitchen scissors to cut eight pieces of banana leaves, each approximately 12 inches by 12 inches. Reserve any extra scraps of leaves to make ties. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the marinated chicken from the refrigerator. Lay a banana leaf square in front of you, making sure the shiny side is facing up. Place the chicken breast, with marinade still clinging to it, in the center of the leaf and top it with 3 or 4 slices of tomato and several onion slices. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold one side of the leaf over the chicken. Overlap the opposite side over the leaf. Fold the two ends in toward the center and place the package on a baking sheet seam side down. Tear a long strip from an extra piece of banana leaf and tie it around the chicken-stuffed package to secure it. Repeat with the remaining chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the packets Heat your grill to high (550°F) and close the lid. Wait at least 15 minutes before lowering the heat to medium-high (450°F) and continuing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the banana leaf packets on the grill, close the lid, and cook for 25 minutes. The leaves will turn dark brown and have a burnt appearance. They will also begin to give off a smoky scent.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serve:</strong> Pile the banana leaf packets on a serving platter and allow your guests to serve themselves and unwrap their packages. </p>"}]}