{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20121218-183964-mulled-wine-jelly-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["jelly", "mulled wine", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mulled Wine Jelly", "link": "https://www.seriouseats.com/recipes/2011/12/mulled-wine-jelly-recipe-christmas-gift.html", "description": "This quick and easy recipe combines all the flavors of mulled wine in a festive, elegant jelly. If you don't have premixed mulling spices, simply add a few cinnamon sticks, star anise, whole cloves, and strips of orange zest to the pot with the wine. This jelly can take up to two weeks to set properly, so plan ahead!", "totalTime": "1 hour", "recipeYield": "Makes about 3 cups, or 6 four-ounce jars", "recipeCategory": ["Condiments and Sauces"], "recipeIngredient": ["2 cups red wine", "2 tablespoons mulling spice", "3 cups sugar", "1/4 teaspoon unsalted butter", "One (3-ounce) pouch liquid pectin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jelly, prepare the jars and lids: place six (4-ounce) jars on a rack in a large pot. Add enough water to cover the jars, and bring to a boil over high heat. Boil for 10 minutes, then turn off the heat and allow the jars to rest in the hot water. Meanwhile, put the bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from the heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the wine into a medium, heavy-bottomed pot. Add the mulling spices and bring the wine to a simmer. Cover the pot, reduce the heat to low, and simmer until the wine is fragrant, about 10 minutes. Check the pot occasionally to make sure the wine isn't boiling. Strain the wine into a large measuring cup, discarding any solids. You should have two cups. If not, make up the difference with a little more wine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the wine to the pot. Add the sugar and butter and bring the mixture to a boil. Add the pectin and return the mixture to a boil. Boil for one minute. Remove the pot from the heat and skim any foam from the surface of the jelly with a cold metal spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jelly into hot sterilized jars, leaving 1/4-inch headspace. Wipe the rims of the jars, cover with the lids, and screw the bands on until just barely tight. Place the jars on a rack in a pot and cover completely with water. Cove the pot and bring to a boil over high heat. Boil for 10 minutes. Turn off the heat, uncover the pot, and allow the jars to rest in the water for five minutes. Remove the jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}