{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110504-150179-candied-jalapenos-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["canning", "cider vinegar", "condiments", "Edible DIY", "jalapenos", "peppers", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Candied Jalapeños", "link": "https://www.seriouseats.com/recipes/2011/05/candied-jalapenos.html", "description": "These sweet, very hot candied jalapeños work equally well as a cocktail garnish, sandwich condiment, cupcake topper, or guacamole ingredient. The cayenne adds even more spice. Feel free to omit it if you prefer....", "totalTime": "30 minutes", "recipeYield": "Makes three (8-ounce) jars", "recipeCategory": ["Edible DIY"], "recipeIngredient": ["1 pound jalapeño peppers", "2/3 cup cider vinegar", "2 cups granulated sugar", "1/2 teaspoon cayenne (optional)", "Freshly grated zest and juice of 2 limes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve conserve, prepare jars and lids: place 3 half-pint jars on rack in large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in the hot water. Meanwhile, put bands and lids in small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice jalapeño peppers into 1/4-inch thick rounds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine vinegar, sugar, cayenne, and lime juice in medium saucepan. Bring to a boil over medium heat. Reduce heat to low and simmer until sugar is dissolved and mixture is syrupy, about 5 minutes. Add jalapeños, bring mixture back to a simmer, and cook until peppers are slightly wilted and darkened, about 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, transfer jalapeños to prepared jars. Return syrup to a boil and cook for 5 minutes. Remove saucepan from heat. Stir in lime zest. Ladel hot syrup over jalapeños in jars. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To preserve the jalapeños, place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>\n\n<p>If you are not going to preserve jalapeños, simply store jars in the refrigerator for up to 3 months. </p>"}]}