{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110111-new-quesadillas-with-greens-and-feta.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "feta", "quesadilla", "Super Bowl mains", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "6"}, "name": "Dinner Tonight: Quesadillas Stuffed with Greens and Feta", "link": "https://www.seriouseats.com/recipes/2011/01/dinner-tonight-quesadillas-stuffed-with-greens-feta.html", "description": "On its own, this filling would make a superb side dish; the briny and salty feta cheese play a perfect foil against the savory greens.  But slipped inside a corn tortilla and griddled, along with a few cubes of diced mozzarella, the whole thing melts into an oozy, satisfying dinner.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Dinner Tonight", "Mains", "Vegetarian"], "recipeIngredient": ["2 tablespoons oil", "1/3 cup minced onion", "1 pound mixed cooking greens, such as kale, mustard and collard, ribs removed and leaves roughly chopped", "1 teaspoon salt", "1/2 teaspoon crushed red chile flakes", "2 teaspoons minced garlic", "1 cup diced feta cheese", "12 corn tortillas", "1/4 pound low-moisture mozzarella, cut in small dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large (12-inch) skillet, heat 1 tablespoon oil over medium heat until shimmering.  Add onion and cook, stirring occasionally, until soft and beginning to color, 3-5 minutes.  Add rinsed greens with any water clinging to leaves, along with salt, chile flakes, and garlic.  Cook, stirring frequently, until greens are tender, 15-30 minutes, depending on type used. Add water as necessary to keep skillet from drying out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When greens are cooked, stir in feta and remove from heat.  Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large, heavy skillet or griddle, heat remaining oil over medium-high heat until shimming, using a spatula to spread evenly on surface.  Add as many tortillas as will fit and cook on one side until softened, 2-3 minutes. Flip, then spoon 2-3 tablespoons of filling onto tortillas, along with some mozzarella.  Use a spatula to fold tortillas in half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook until tortillas are golden and cheese is melted, 2-3 minutes per side. If necessary, keep cooked quesadillas in warm oven until all are cooked.  Repeat with remaining tortillas and filling. Serve immediately.</p>"}]}