{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110921-cheese-slices-burger-lab-primary.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cheese", "condiment", "The Burger Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Melty American-Style Cheddar Cheese Slices for Burgers and Grilled Cheese", "link": "https://www.seriouseats.com/recipes/2011/09/melty-american-style-cheddar-cheese-slices-for-burgers-and-grilled-cheese-recipe.html", "description": "This recipe will work with any medium-dry cheese such as Gruyère, Comté, Swiss, or Jack. Do not use pre-grated cheese as it is coated in starch that will affect its smoothness when melting.", "totalTime": "10 minutes, plus at least 10 minutes to chill", "recipeYield": "makes about 1 pound American-style Cheese", "recipeCategory": ["Cheese", "The Burger Lab"], "recipeIngredient": ["1/4 ounce (about 1 tablespoon) powdered gelatin", "1 tablespoon water", "4 ounces (about 1/2 cup) evaporated milk", "12 ounces sharp cheddar cheese, fresh grated (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two flat rimmed baking sheets or large square or rectangular platters with a layer of plastic cling wrap and set aside. In a small bowl or cup, sprinkle the gelatin over the water and allow it to hydrate, about 1 minute. Meanwhile, heat the evaporated milk in a small saucepan over medium high heat, stirring constantly with a rubber spatula to prevent burning on the bottom of the pan. When milk comes to a simmer, add hydrated gelatin and stir until melted. Remove pan from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cheese all at once and stir with a whisk to combine. Return pan to low heat and continue to whisk until mixture is homogenous and registers between 160 and 170°F on an instant read thermometer. Beat with the blade of an immersion blender directly in the pot until glossy and smoother. Alternatively, transfer to the bowl of a blender or food processor and blend, starting at the lowest speed and slowly increasing to the highest. Blend for 30 seconds, stopping to scrape down sides as necessary. If necessary, blend in two separate batches, pouring first half onto lined sheet tray before proceeding to second half (see step 3).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour mixture out of the blender and onto the prepared baking sheets. You should end up with a layer a few millimeters thick on each tray. Use a rubber spatula to distribute the cheese in an even layer. Transfer to a flat place in the refrigerator and allow to cool until firm to the touch, at least ten minutes (you may need longer depending on how cold your fridge it, how thick your plates or trays are, and how well your fridge circulates air).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cheese has cooled, carefully lift the plastic wrap and transfer the whole thing to a cutting board. Cut the cheese into square slices, cutting all the way through the plastic. Carefully left each slice with the plastic still attached and stack, leaving the plastic in between each layer. Repeat with the other sheet tray. Store cheese slices in a sealed container in the fridge for up to 3 weeks.</p>"}]}