{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110403-127355-dinner-tonight-breakfast-burrito-chorizo-potato.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["burrito", "chorizo", "Dinner Tonight", "egg", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Breakfast Burrito with Chorizo, Potato, and Egg", "link": "https://www.seriouseats.com/recipes/2011/04/breakfast-burrito-with-chorizo-potato-egg-recipe.html", "description": "I'm not the biggest burrito fan. There, I said it. Oversized and out of balance, they're sort of the antithesis of what I usually love. But for some reason I still have a strange affection for the breakfast burrito, probably due to their hangover cure powers. So, what separates a burrito from a breakfast burrito?", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Eggs", "Potato"], "recipeIngredient": ["1 large baking potato, peeled, and cut into ½-inch cubes", "1 teaspoon vegetable oil ", "12 ounces Mexican chorizo, casings removed", "4 scallions, white parts discarded, green parts chopped", "6 large eggs", "1 tablespoon olive oil", "4 10-inch flour tortillas ", "⅔ cup Mexican melting cheese (chihuahua, Monterrey Jack)", "½ cup fresh cilantro, chopped", "½ cup salsa ", "1 avocado, halved, pitted, peeled, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss chopped potatoes into a medium-sized bowl along with 1 teaspoon oil and a pinch of salt. Cover with plastic wrap. Place in microwave and cook on high for 4 minutes. Carefully remove plastic wrap. Potatoes should be tender. If not, recover and cook for another minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump potatoes into a non-stick skillet set over medium heat. Cook, stirring occasionally, until potatoes are golden brown and slightly crisp. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add chorizo to a large skillet set over medium-high heat. Cook, breaking it up with a wooden spoon, until cooked through, about 5 minutes. Add the scallions, stir well, and cook for another 30 seconds. Transfer chorizo to a bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean skillet, and then pour in the olive oil and set back over medium heat. Whisk together the eggs in a medium-sized bowl. Season with salt and pepper. Add the eggs to skillet and cook, stirring with a wooden spoon, until softly scrambled. Immediately transfer eggs to a second bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean skillet again, and then warm over medium heat. Warm tortillas in skillet until pliable, about 20 seconds aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the potatoes, chorizo, eggs, cheese, cilantro, salsa, and avocado between the four warmed tortillas. Roll the tortillas into a burrito shape. Check out this <a href=\"http://www.youtube.com/watch?v=TpazxwU-LzM\">handy guide</a> if you need more help. </p>"}]}