{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110715icecream-carey.jpg", "author": {"@type": "Person", "name": "Carey Jones"}, "recipeCuisine": "", "keywords": ["ice cream", "raisins", "rum", "Rum Raisin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Carey's Favorite Rum Raisin Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/07/careys-favorite-rum-raisin-ice-cream-recipe.html", "description": "I like my ice cream boozy, but feel free to hold back a bit on the rum if you'd rather it be less of a prominent flavor. Don't skip the raisin-soaking step, though; I've found that the raisins freeze hard if they're not rum-saturated.", "totalTime": "4-6 hours", "recipeYield": "", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["1 cup (packed) raisins", "2/3 cup dark rum (I use Myer's Dark Rum)", "8 egg yolks", "1 cup sugar", "3 cups whole milk", "1 1/2 cups whipping cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine raisins and rum in small bowl. Cover; let stand at room temperature at least 2 hours (I've found better results with a 3-4 hour soak). Drain raisins, reserving 1/2 cup rum (or 1/4 cup, if you like your ice cream less boozy). Combine drained raisins and reserved rum in same bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring milk and whipping cream to boil in heavy large saucepan over medium heat. Meanwhile, whisk egg yolks and sugar in large bowl until blended and slightly lightened in color. Gradually whisk warm ingredients into yolk mixture. Return mixture to saucepan; stir over medium-low heat until custard thickens, about 15 minutes. (The custard should coat the back of a spoon, and a finger swipe down the back of the spoon should leave a clean line.) Strain custard into bowl. Cool. Add raisin mixture to custard. Refrigerate until cold, at least 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer custard to ice cream maker and process according to manufacturer's instructions. Freeze ice cream in covered container until firm enough to scoop, at least 2 hours.</p>"}]}