{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110413-147226-my-fathers-daughter-duck-ragu.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["duck", "gremolata", "Gwyneth Paltrow", "My Father's Daughter", "pasta", "ragu", "Weekend Giveaway"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "'My Father's Daughter': Gwyneth Paltrow's Duck Ragu", "link": "https://www.seriouseats.com/recipes/2011/04/my-fathers-daughter-duck-ragu.html", "description": "Last week <a href=\"http://www.seriouseats.com/user/profile/Ed%20Levine\">Ed</a> was invited to a cookbook launch party for <strong>Gwyneth Paltrow</strong>'s <strong><em><a href=\"http://www.amazon.com/Fathers-Daughter-Delicious-Celebrating-Togetherness/dp/0446557315/serieats-20\">My Father's Daughter</a></em></strong>.  In attendance were none other than Jay-Z, Jerry Seinfeld, and Alex Rodriguez of New York Yankees fame.  Great set of friends, right?  When asked about the <em>food</em>, though, Ed mentioned that the <strong>Duck Ragu</strong> was quite good, which made me want to investigate this recipe for myself.", "totalTime": "4 to 5 hours", "recipeYield": "4 to 6", "recipeCategory": ["Chicken", "Duck", "Mains", "Other Meats", "Pasta"], "recipeIngredient": ["<strong>For the ragu:</strong>", "1 organic large duck, washed and dried  ", "3 tablespoons extra virgin olive oil", "Coarse salt", "Freshly ground black pepper", "4 slices duck bacon, finely diced", "1 medium yellow onion, peeled and finely diced", "2 medium carrots, peeled and finely diced", "2 medium stalks celery, finely diced", "5 cloves garlic, peeled and minced", "2 5-inch sprigs fresh rosemary, stems discarded and leaves finely minced", "3 14-ounce cans whole peeled tomatoes with their juice", "1 cup Italian red wine", "1/4 cup plus 2 tablespoons tomato paste", "<strong>For serving:</strong>", "1 pound pappardelle (fresh or dried)", "Gremolata Bread Crumbs (recipe follows) or freshly grated Parmesan cheese,", "<strong>For the Gremolata Bread Crumbs:</strong>", "2/3 cup fresh bread crumbs, toasted and coarsely ground", "Zest of 2 lemons", "1 1/2 tablespoons finely chopped fresh parsley", "Small pinch of coarse salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim off excess skin from the opening to the duck’s cavity and from the back end. Rub the entire duck with 1 tablespoon of olive oil and sprinkle liberally with salt and pepper, inside and out. Roast it for a total of 2 hours, flipping it from its back to its breast (and vice versa) every 1/2 hour. Let it cool in the pan until you can handle it. Drain off the fat and either discard or reserve it for another use, such as roasting potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the duck is roasting, heat 2 tablespoons of olive oil in a Dutch oven over medium-high heat and add the duck bacon. Cook for 5 minutes, stirring occasionally, or until starting to crisp. Add the onion, carrots, celery, garlic, and rosemary, turn the heat down to low, and cook, stirring occasionally, for 15 minutes, or until softened. Add the tomatoes and their juice and put 1/2 cup water into one can, swish it around to get all the tomato stuck to the sides, pour into the next can, and repeat again with the third. Add the tomato water to the Dutch oven along with the wine, a good grind of pepper, and a healthy pinch of salt. Bring to a boil and then turn the heat down very low and let simmer for 1 hour and 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the duck has cooled down a bit, remove and discard the skin and bones and shred the meat. Fold the duck meat into the ragu along with the tomato paste and cook on very low heat, uncovered, for at least 1 hour and up to 4, adding splashes of water if necessary to keep it from drying out (continue to season with salt and pepper as you splash).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cook the pasta, divide it among bowls, and spoon a generous amount of duck ragu over the pasta. Top with the Gremolata Bread Crumbs or Parmesan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Gremolata Bread Crumbs:</strong> Toss everything together.</p>"}]}