{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111206-egg-nog-01.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["domaine de canton", "eggnog", "holiday", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gingersnap Eggnog", "link": "https://www.seriouseats.com/recipes/2011/12/gingersnap-eggnog-recipe.html", "description": "This variation adds a splash of ginger liqueur to the mix along with a sweet rim of ground gingersnap cookies.", "totalTime": "10 minutes", "recipeYield": "makes about 2 quarts, serving 12 to 16", "recipeCategory": ["Christmas", "Ginger", "Rum"], "recipeIngredient": ["8 eggs, separated", "2/3 cup sugar", "3 cups whole milk", "2 cups heavy cream", "1 1/2 cups dark rum", "1/2 cup Domaine de Canton ginger liqueur", "8 gingersnap cookies, finely ground in a spice grinder or food processor"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place egg whites in the bowl of a stand mixer and whisk on low speed until frothy, about 30 seconds. Increase speed to medium-high and, watching carefully, beat until they are about the consistency of shaving cream, about 90 seconds. Reduce speed to medium. With mixer running, add half of sugar and beat until incorporated, about 30 seconds. Transfer whites to a large bowl. Do not wash bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add egg yolks and remaining sugar to now-empty stand mixer bowl and beat at medium-high speed until pale yellow and ribbony, shutting off machine and scraping down sides with a rubber spatula as necessary, about 2 minutes total. Add milk, cream, rum, and ginger liqueur and mix on low speed to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula or handheld whisk, fold the whipped whites into the egg yolk/milk mixture until completely incorporated. Place ground ginger snaps in a shallow pie plate. Drip rim of each glass into eggnog and press into ground ginger cookies. Ladle eggnog into glass, dust with more ground gingersnaps, and serve.</p>"}]}