{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/392011-141520-pot-roast-mushrooms.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["beef", "mushrooms", "pot roast", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sunday Supper: Pot Roast with Mushrooms", "link": "https://www.seriouseats.com/recipes/2011/04/pot-roast-with-mushrooms-beef-recipe.html", "description": "<strong>A pot roast is a great meal to end the weekend with. </strong> Its long cooking time lets you get all the end of the weekend duties finished up, while still filling the house with a delicious aroma. Many pot roasts call for potatoes to be included in the pot with all the other ingredients, but I prefer some simple mashed potatoes and hot buttered peas on the side.  An amber ale, or smoky red wine would sit very well next to this roast.", "totalTime": "3 hours 35 minutes", "recipeYield": "4", "recipeCategory": ["Beef", "Mains", "Mushrooms", "Sunday Supper"], "recipeIngredient": ["1 cup dried mushrooms (a mixed variety is fine)", "olive oil", "3 – 3 1/2 pound boneless chuck roast", "8 ounces button mushrooms, quartered", "1 onion, finely chopped", "2 carrots, chopped", "2 ribs celery, chopped", "16 ounces (2 cups) beef broth", "Kosher salt and cracked black pepper", "1 tablespoon flour", "1 tablespoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;.  Place dried mushrooms in a bowl and cover with boiling water.  Cover bowl with plastic wrap and let sit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large drizzle of olive oil in braising dish and place over medium high heat until oil is shimmering.  Season all sides of pot roast with salt and pepper and sear on all sides until browned, about 15 minutes.  Remove and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add quartered mushrooms to pan, stirring until browned (more olive oil may be necessary), about 6 minutes.  Add onions and cook until beginning to brown, about 5 minutes.  Add carrots and celery, and cook until beginning to wilt, about another 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place roast and all the accumulated juiced back in pan.  Pour dried mushrooms and liquid over roast, along with beef broth.  Bring to a simmer, cover with lid, and place in oven until roast is fully cooked and very tender, about 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the roast is done, remove it from the braising dish, leaving behind all the liquid and vegetables, and season with salt and pepper.  Mash together butter and flour to form a paste. Bring the liquid to a simmer and using a whisk, vigorously stir in flour butter paste.  Simmer until thickened and serve the roast sliced, drizzled with cooking liquid.</p>"}]}