{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110828-127355-dinner-tonight-whitefish-tomato-sauce-olives.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["basil", "capers", "Dinner Tonight", "fish", "Jamie Oliver", "olive", "whitefish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Whitefish Baked with Tomatoes, Olives, and Capers", "link": "https://www.seriouseats.com/recipes/2011/08/whitefish-baked-with-tomatoes-olives-capers-recipe.html", "description": "As anyone who has followed a Jamie Oliver recipe before knows, directions are free-form and amounts are purposely vague. Olive oil is dished out in \"glugs.\" Red wine is added in \"tiny swigs.\" What is written below is exactly what I used for two portions, but you could easily add additional vinegar if you need more tang or another chile if you need more heat.", "totalTime": "1 hour", "recipeYield": "2 people", "recipeCategory": ["Dinner Tonight", "Fish", "Olives"], "recipeIngredient": ["2 garlic cloves, thinly sliced ", "1 small bunch fresh basil, leaves and stems separated ", "1 tablespoon olive oil ", "1 fresh red chile, stemmed, and slit open ", "1 pound fresh tomatoes, skinned, stemmed, and chopped (or one 14-ounce can whole tomatoes)", "Salt and black pepper ", "1 teaspoon red wine vinegar ", "two 5-ounce whitefish fillets, skin and any bones removed ", "1/4 cup black olives, squashed with a knife and pits removed ", "1/2 tablespoon capers, drained "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop the basil stalks. Pour the olive oil into a large oven-safe skillet set over medium heat. When shimmering, add the garlic, basil stalks, and red chile. Cook, stirring often, until garlic is fragrant but not browned, one to two minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes to the skillet, and season with salt and pepper. Reduce heat to medium-low, and cook until the tomatoes have reduced to a thick sauce, about 30 minutes. During the process, smash the tomatoes with the back of a wooden spoon. When done, remove the chile and discard. Add the red wine vinegar, stir well, and taste to see if more salt or pepper is needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tomato sauce is cooking, preheat the oven to 425&deg;F. Season both sides of the fish fillets with salt and pepper. When the tomato sauce is done cooking, turn the burner off. Place the fillets on the tomato sauce. Top the two fillets with the olives, capers, and basil leaves. Transfer skillet to the oven and cook until fish is done, 10 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the fillets with the tomato sauce. I also added some sautéed kale as a side. </p>"}]}