{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110629-lobster-roll-primary1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["butter", "lobster", "lobster rolls", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Connecticut-Style Warm Buttered Lobster Rolls", "link": "https://www.seriouseats.com/recipes/2011/06/connecticut-style-warm-buttered-lobster-rolls.html", "description": "Last week we took a look at <a>New England-style lobster rolls</a>. The cold, mayo-based lobster salad variety, that is. For most people, that's what a lobster roll is and always will be. But there are certain pockets of the population, mostly in Connecticut, that prefer their lobster rolls hot and buttered.", "totalTime": "30 minutes", "recipeYield": "4", "recipeCategory": ["Lobster and Crab", "Sandwiches", "The Food Lab"], "recipeIngredient": ["4 lobster, about 1 1/2 pounds each", "1 stick (8 tablespoons) butter", "8 top-split hot dog buns, preferably Pepperidge Farm brand", "1/4 cup finely sliced scallion greens or chives", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Kill each lobster by pressing the tip of a heavy chef's knife in the crack just behind the eyes in the center of the carapace. Press down firmly, then split head in half. Using kitchen towels, twist off tail and claws (including knuckles) from carapace. Save carapace for another use. Press each tail flat against the cutting board and insert wooden skewers along their entire length to keep them straight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a steamer insert in the bottom of a large lidded stock pot and add 1-inch of water. Bring to a boil over high heat. Add a single layer of lobster claws and legs (about half the lobster) and cover pot. Let steam for exactly two minutes. Transfer lobsters to sink and set under running cold water. Return liquid to a boil and repeat with remaining lobster tails and claws.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As soon as lobster is cool enough to handle, remove meat from shell using kitchen shears, lobster crackers, and/or the back of a heavy cleaver to help crack the shells (It's OK if the meat gets a little mangled). Roughly chop into bite-sized pieces and set on double layer of paper towels to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon of butter in a heavy bottomed 12-inch skillet over medium-low heat. Swirl to coat pan. Add four buns with one cut side down. Cook, pressing on buns gently and moving them around the pan until golden brown on first side. Remove from pan, add another tablespoon of butter, and toast second side. Repeat with second batch of buns. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining butter in skillet over medium heat. As soon as butter is melted, add lobster meat. Cook, tossing constantly and using a spoon to gently fold meat and butter over itself int he skillet until lobster is mostly opaque (butter should not sizzle), about 3 minutes. Add scallion greens and continue to cook until lobster is cooked through, about 1 minute longer. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide lobster filling evenly between rolls. Spoon excess juices over each roll. Serve immediately.</p>"}]}