{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110724bourbonpeachjam.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["bourbon", "Jam", "peach", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1", "ratingCount": "10"}, "name": "Bourbon Peach Jam", "link": "https://www.seriouseats.com/recipes/2011/07/bourbon-peach-jam-recipe.html", "description": "Few things in life are better than biting into a fuzzy, sun-warmed peach, the nectar dribbling down your chin. This simple jam is full of ripe, fresh peach flavor with hints of bourbon, cinnamon, and vanilla. I like to serve it with warm buttermilk biscuits, or use it as a filling for a quick summer tart.", "totalTime": "About 1 hour", "recipeYield": "Makes 6 half-pints", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Condiments and Sauces", "Edible DIY", "Peach"], "recipeIngredient": ["3 1/2 pounds ripe peaches", "7 1/2 cups granulated sugar", "1/4 cup freshly squeezed lemon juice", "1/2 cup bourbon", "1 cinnamon stick", "1 vanilla bean, split lengthwise", "1/2 teaspoon unsalted butter", "One (6-ounce) package liquid pectin (two foil packets)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place six half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Fill a large bowl with ice water. Cut a shallow X into the bottom of each peach and drop them into the boiling water. Blanch for 20 to 30 seconds, then immediately plunge the peaches into the ice water. Peel and chop the peaches. Transfer them to a blender and pulse just until they are coarsely pureed. You should have about 4 cups of puree. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the peaches to a large, heavy-bottomed pot. Add the sugar, lemon juice, bourbon, cinnamon stick, vanilla bean, and butter. Bring to a full rolling boil over medium-high heat, stirring constantly. Add the pectin and return the mixture to a full rolling boil. Boil hard for one minute. Remove to pot from the heat and skim any foam from the surface with a metal spoon. Discard the cinnamon stick and the vanilla bean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. Preserved jam will keep for up to one year in a cool, dark place. Unpreserved jam will keep in the refrigerator for about six months. </p>"}]}