{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111024-176348-duck-pho.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Anita Lo", "Cook the Book", "Cooking Without Borders", "duck", "phở", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Duck Phở", "link": "https://www.seriouseats.com/recipes/2011/10/duck-pho-recipe.html", "description": "Swap out beef bones for duck to make a stock that has all of those warm and wonderful phở notes plus that unmistakable fattiness that can only come from duck. To the stock she adds a touch of fish sauce, sheds of duck leg, rice noodles and all of your go-to phở garnishes.", "totalTime": "2 hours", "recipeYield": "4, as an appetizer", "recipeCategory": ["Chicken", "Cook the Book", "Duck", "Other Meats", "Soups and Stews"], "recipeIngredient": ["1 tablespoon neutral-flavored vegetable oil", "1 onion, thinly sliced lengthwise", "Raw carcass and legs of 1 duck (see Note)", "3 cloves garlic, smashed", "1 slice fresh ginger", "3 pieces star anise", "5 whole cloves ", "1 cinnamon stick", "1 dried shiitake mushroom", "3 sprigs fresh cilantro ", "¼ cup fish sauce, or to taste", "Salt and black pepper ", "&nbsp;", "<strong>To serve:</strong>", "1 package rice noodles", "4 (1-ounce) pieces foie gras (optional)", "A few thin slices red onion", "A few leaves fresh Thai basil or mint ", "Vietnamese chile-garlic sauce (tuong ot toi Vietnam) ", "Hoisin sauce", "1 lime, quartered", "1 cup bean sprouts "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a stockpot over low heat and add the onion. Cook, stirring, until golden brown. Add the duck carcass and legs, garlic, ginger, star anise, cloves, cinnamon, mushroom, cilantro, and enough cold water to cover. Bring to a boil. Skim off the foam and scum that rise to the top, then lower the heat to a simmer. Simmer until well flavored, 1 to 2 hours, adding more cold water if necessary to keep the ingredients covered and skimming when necessary. Remove the duck legs and set them aside, then pour the broth through a fine-mesh sieve and discard the other solids. Season the broth to taste with the fish sauce and add 1 teaspoon each of salt and pepper. Shred the duck leg meat and season with teaspoon each of salt and pepper. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, reheat the broth. Cook the noodles in a large pot of boiling salted water until tender, then drain. Divide among 4 soup bowls and top with the broth. In a smoking-hot dry pan, sear the foie gras, then add one piece to each bowl. Divide the duck leg meat, red onion, Thai basil, and bean sprouts among the bowls. Serve with the chile-garlic sauce, hoisin sauce, and lime wedges on the side. </p>\n\n<p><small><strong>Note:</strong> From a whole duck, cut off the legs, breast meat, and fat. Use the carcass and the legs with the skin removed for this soup. Refrigerate or freeze the boneless breasts for another use. The fat can be rendered (melted over low heat and then strained) and kept for another use.</small></p>"}]}