{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111122-hot-brown-louisville-kentucky-hangover-helper-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["hangover helper", "Kentucky", "quick", "sandwich", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Kentucky Hot Brown", "link": "https://www.seriouseats.com/recipes/2011/11/kentucky-hot-brown-mornay-sauce-recipe.html", "description": "The Hot Brown is ostensibly an open-faced sandwich&mdash;it starts with a piece of toasted bread (the original recipe calls for Texas Toast) and gets topped with sliced roasted turkey. But from there it leaps directly into Hangover Helper territory when a precisely measured volume (known as a morethanyoucouldreasonablyhopetoneed) of <strong>cheesy, creamy Mornay sauce</strong> is poured over the top and the whole thing is placed under the broiler to bake until bubbly.", "totalTime": "15 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Mains", "Sandwiches", "Turkey"], "recipeIngredient": ["3 tablespoons butter", "3 tablespoons flour", "1 pint heavy cream", "3 ounces grated Pecorino Romano cheese", "Kosher salt and freshly ground black pepper", "2 slices hearty toast", "8 to 12 ounces roasted sliced turkey", "4 slice thick cut bacon, cooked until crisp", "1 tablespoon minced parsley leaves", "Dash paprika", "4 slices ripe tomato (optional, if in season)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler or toaster oven to high. Melt butter in a small saucepan over medium-high heat. Add flour and whisk to combine. Continue to cook, whisking constantly until pale golden blond, about 1 minute. Slowly pour in heavy cream, whisking constantly. Bring to a simmer then remove from heat. Whisk in grated cheese, then season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1 slice toast in the bottom of each gratin dish and top each with half of the roasted turkey. Pour half the sauce over each sandwich, completely coating it. Place under broiler until spotty brown and bubbly, 2 to 3 minutes. Place 2 slices of bacon in a cross on top of each dish and sprinkle with parsley and paprika. Add 2 slices tomato  to each dish if using. Serve immediately.</p>"}]}