{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110728-sandwich-chutney.jpg", "author": {"@type": "Person", "name": "Shell Tu"}, "recipeCuisine": "", "keywords": ["chutney", "Michael Schwartz", "Michael's Genuine Food", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tomato Onion Chutney", "link": "https://www.seriouseats.com/recipes/2011/07/tomato-onion-chutney-recipe.html", "description": "We had to find the recipe for this chutney when we tried it in the pâté sandwich at Michael's Genuine Food &amp; Drink in Miami. Read more about the sandwich <a href=\"http://www.seriouseats.com/2011/07/a-sandwich-a-day-pate-sandwich-from-michaels-genuine-food-and-drink-miami-fl.html\">here!</a>", "totalTime": null, "recipeYield": "Makes 3 cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Tomato"], "recipeIngredient": ["4 ripe tomatoes, preferably red beefsteak, cored", "1/4 cup extra-virgin olive oil", "1lb cipollini onions, peeled and halved lengthwise or quartered, depending on size", "2 whole cloves", "1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "1/4 cup champagne vinegar", "2 tablespoons agave nectar or honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to a boil. Prepare an ice bath by filling a large bowl halfway with water and adding a tray of ice cubes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a paring knife, cut a little cross mark on the bottom of the tomatoes. Immerse them in the boiling water for 15 to 30 seconds, until the skin starts to peel away. Using a slotted spoon, remove the tomatoes from the pot and transfer to the ice bath to cool quickly and stop the cooking process. Peel the tomatoes with your hands or a paring knife. Cut them in half and squeeze out the seeds. Coarsely chop the tomatoes and set aside. You should have roughly 3 1/2 cups</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a large skillet over medium heat and coat with the oil. When the oil is shimmering, add the onions. Cook, sitrring occasionally, until they soften slightly and get a little bit of color, about 5 minutes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes and cloves and season with salt and pepper. Cook, stirring occasionally, until the tomatoes start to break down and release their liquid, about 10 minutes. Add the vinegar and agave. Continue to cook, stirring often to prevent burning, until the liquid has evaporated and the chutney is think, about 5 minutes. The chutney will keep covered in the refrigerater for up to 1 week</p>"}]}