{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110803paletas.jpg", "author": {"@type": "Person", "name": "Fany Gerson"}, "recipeCuisine": "", "keywords": ["Fany Gerson", "Fany Gerson Week", "paletas", "popsicles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spiked and Spiced Grapefruit Paletas", "link": "https://www.seriouseats.com/recipes/2011/08/spiked-and-spiced-grapefruit-paletas.html", "description": "This grapefruit-tequila paleta is particularly refreshing. If you want an extra kick, blend a bit of the chiles with the grapefruit base, or infuse the simple syrup with more chiles. Just like a margarita, these paletas have a seasoning on the top; I love both options and couldn't decide between them, so I'll leave the topping up to you.", "totalTime": "", "recipeYield": "Makes 8 to 10 paletas", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["2 grapefruits", "1-2 fresh serrano or jalapeno chiles, finely chopped", "3/4 cup water", "1 cup sugar", "2 cups freshly squeezed grapefruit juice, preferably Ruby Red (about 4 grapefruits)", "1/3 cup white tequila", "<strong>Optional:</strong> Sugar in the Raw or chili powder blended with salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a bit of each end off the grapefruits to expose the flesh. Stand the grapefruit on one of the exposed sides and cut away the skin and any white parts by using the knife and following the natural curve of the fruit. Once you have removed all skin and pith, take a small knife and cut away segments . Put the knife as close to the white lines as possible, as these will give you wider segments and will also help cut the segments more easily. Toss the grapefruit segments with the diced chiles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the water and sugar in a small saucepan and bring to a boil. Turn off heat and allow to cool. Stir in the grapefruit juice and tequila using a whisk.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the segments amongst the molds and mix any juices with the base. Pour the base into the molds but leave a bit of room at the top of each one, as the mixture will expand as it freezes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Insert a stick once the mixture is semi-frozen so the stick will stand on its own. Freeze until completely set, at least several hours. Unmold the paletas by dipping the molds into a pan with tall sides, filled with warm water. Leave for a few seconds and pull up gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As soon as you unmold them, dip the tops in Sugar in the Raw or some chili powder mixed with a bit of salt.</p>"}]}