{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110502-texas-beef-council-marinated-grilled-flank-steak-7.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["beef", "flank steak", "salad", "steak", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Thai-Style Marinated Flank Steak and Herb Salad", "link": "https://www.seriouseats.com/recipes/2011/05/thai-style-marinated-flank-steak-and-herb-sal.html", "description": "[Photographs: J. Kenji Lopez-Alt] My absolute favorite way to marinate flank steak is with a sweet and spicy Thai-style sauce. I make mine with palm sugar (brown sugar will do fine), dried Thai chili flakes, fish sauce, garlic, and lime...", "totalTime": "at least 1 1/2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Beef", "Salads", "Thai"], "recipeIngredient": ["<strong>For the Marinade</strong>", "1/2 cup palm sugar or brown sugar", "1/4 cup water", "3 tablespoons fish sauce", "1/3 cup lime juice", "2 cloves garlic, grated on a microplane zester", "1 tablespoon Thai chili powder (or red chili flakes)", "1/4 cup vegetable oil", "1 whole flank steak, about 2 pounds (see note)", "&nbsp;", "<strong>For the Salad</strong>", "1/2 cup loosely packed mint leaves", "1/2 cup loosely packed cilantro leaves", "1 small bunch chives, cut into 1 1/2-inch segments", "1/2 cup loosely packed basil", "4 shallots, thinly sliced", "1 to 2 cups mung bean sprouts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water and sugar in a small saucepan and heat over medium heat until completely dissolved. Transfer to a small bowl, add fish sauce, lime juice, garlic, and chili powder and stir to combine. Transfer half to a small container and reserve until step 3. Add oil to remaining half and whisk to combine. Place flank steak inside a gallon-sized zipper-lock bag with marinade. Press out air, seal bag, and allow meat to marinate, turning occasionally, for at least 1 hour and up to 12.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove steak from marinade and pat dry with paper towels. Ignite a large chimney full of coals and wait until they're covered in grey ash. Spread evenly over 1/2 of grate, leaving the other half empty. Put the cooking grate in place, cover, and allow grill to preheat for 5 minutes. Scrape cooking grates clean, then place flank steak over hot side of grill. cook until well charred, about 3 minutes. Flip steak and continue to cook until second side is well charred, about 3 minutes longer. Transfer steak to cooler side of grill, cover, and cook until the center of the steak registers 125°F on an instant-read thermometer for medium-rare, or 135° for medium, about 5 minutes longer. Transfer to a cutting board, tent with foil, and allow steak to rest for at least 5 minutes. Proceed to step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Alternatively, to finish indoors:</strong> Heat 2 tablespoons vegetable or canola oil in a large stainless steel or cast iron skillet over high heat until shimmering. Add steak and cook, turning frequently, until an instant-read thermometer registers 125°F for medium-rare or 135&Deg;F for medium, reducing heat as necessary if steak smokes excessively or starts to burn. Transfer to a wire rack set in a rimmed baking sheet and allow to rest 5 to 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice beef against the grain and transfer to a large bowl. Add herbs, shallots, bean sprouts, and reserved marinade, and toss to combine. Serve immediately.</p>"}]}