{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/bread%20cut%201.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Spiky Loaf", "link": "https://www.seriouseats.com/recipes/2011/08/bread-baking-spikey-loaf.html", "description": "Part of the puzzlement about making decorative loaves is that when you see a loaf that's baked, risen, and beautiful, it's sometimes hard to imagine what it looked like before it was brown and puffy. Fancy shapes aren't always as practical as baking sandwich bread, but there's something fun about tearing into a pretty loaf at the dinner table, particularly if it's one that invites ripping apart.", "totalTime": "2 hours, 15 minutes", "recipeYield": "Makes 2 loaves", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 1/4 cups water", "2 teaspoons sugar", "2 1/4 teaspoons instant yeast", "3 cups (13 1/2 ounces) bread flour (divided)", "1/4 cup instant mashed potatoes", "1 teaspoon salt", "1 tablespoon olive oil (plus more for drizzling)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, sugar,yeast, and 1 cup of flour in the bowl of your stand mixer. Mix well and set aside for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rest of the flour, the instant mashed potatoes, and the salt. Knead with the dough hook until it's smooth and elastic Add the olive oil and continue kneading until the oil is incorporated. Form the dough into a ball, drizzle with olive oil, and return it to the bowl. Cover with plastic wrap and set aside until doubled, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your works surface, preheat the oven to 375 degrees, and line a baking sheet with parchment paper. If you want a crisp crust, put an oven-proof pan with hot water on the bottom rack of the oven. This will create the steam you need to crisp the crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough and divide it in half. Form each half into a log about 13 inches long. Place the logs on the baking sheet. Cover with plastic wrap and set aside until the loaves have doubled, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a sharp pair of scissors, starting at one end of the dough, make a series cuts in the dough at a 45-degree angle at least 3/4 of the way through the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As you make each cut, move the cut pieces to one side and then the other, alternately ...</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>... until you get all the way to the other end of the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the loaves at 375 degrees until nicely browned, about 25 minutes. Let the loaves cools completely on a rack.</p>"}]}