{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110803-cornpaleta.jpg", "author": {"@type": "Person", "name": "Fany Gerson"}, "recipeCuisine": "", "keywords": ["corn", "Fany Gerson", "Fany Gerson Week", "ice pops", "paletas", "popsicles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Corn Paletas", "link": "https://www.seriouseats.com/recipes/2011/08/corn-paletas-popsicles-recipe.html", "description": "One of the best things about working in markets is the wonderful people you meet. There's a particularly cute couple that are regulars at the Hester Street Fair and they love these paletas; they would buy several at a time last year to take home so they could enjoy for the week. I just bought some wonderful bicolor corn from the farmers market to make some and wanted to dedicated this recipe to them!", "totalTime": "", "recipeYield": "Makes 10-12 paletas", "recipeCategory": ["Corn", "Ice Cream and Frozen Treats"], "recipeIngredient": ["4 ears of corn", "2 cups milk", "½ cup sugar", "1 cup half and half", "pinch salt", "½ teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shuck the corn and remove all the stringy bits. Discard the leaves and strings and hold the corn vertically over a clean cloth . Hold the corn with one hand and slice down all around to get the kernels off (the cloth will help avoid getting kernels flying all around). Take the centers of corn and break into 3-4 pieces with your hands or, if they’re too hard, with a knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the corn, the core bits, milk and sugar in a medium saucepan over moderate heat and cook, stirring once in a while, until the corn is tender (about 20 minutes or so). Cover and steep for 20-30 to get lots of corn flavor out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain, throw away the corn centers and blend about 2/3 of the kernels with the milk. (You can strain if desired, but I actually like the texture it gives.) Stir in the half and half, salt, and vanilla, and chill completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into the molds, leaving a bit of room at the top as it expands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze and insert a stick once the mixture is semi-frozen so the stick will stand on its own and freeze until completely set for several hours. Unmold them by dipping the molds into a pan with tall sides, filled with warm water. Leave for a few seconds and pull up gently.</p>"}]}