{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110606-127355-dinner-tonight-chicken-morels-favabeans.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "fava beans", "morels", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Chicken Casserole with Morels, Fava Beans, and Spring Potatoes", "link": "https://www.seriouseats.com/recipes/2011/06/chicken-casserole-with-morels-fava-beans-spring-potatoes-recipe.html", "description": "I usually think of roast chicken as a comforting winter meal, especially when served with potatoes that have cooked in all the glorious chicken fat. But there is no doubting that this recipe from <em><a href=\"http://www.amazon.com/dp/0679404090/?tag=serieats-20\">Cooking with Daniel Boulud</a></em> is a spring dish. There is no other time of the year when the combination of morels, fava beans, and small new potatoes would taste so good.", "totalTime": "one hour and 20 minutes", "recipeYield": "4 people", "recipeCategory": ["Beans and Pulses", "Chicken", "Dinner Tonight", "Potato"], "recipeIngredient": ["1 cup chicken stock ", "2 cups shelled fresh fava beans (about 3 pounds in their pods)", "1 tablespoons plus 1 ½ teaspoons olive oil", "½ pound fresh morels, stems removed, rinsed twice, sliced ½-inch thick", "salt and pepper", "1 chicken (about 3 ½ pounds)", "16 garlic cloves, unpeeled ", "1 bay leaf", "1 sprig fresh thyme ", "½ pound small new potatoes (about golf ball size), scrubbed, cut in half ", "8 small shallots, peeled and halved ", "3 tablespoons fresh chives, minced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven 425&deg;. Cut the chicken into 10 pieces. You'll end up with two legs, two thighs, two wings, and two breasts cut in half crosswise. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour one quart of water into a saucepan set over high heat. When boiling, add the shelled fava beans. Cook for one minute, and then drain in a colander. Rinse under cold water to cool. Remove the tough outer skins of all of the fava beans. Discard the skins. Set the fava beans aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the 1 ½ teaspoons of olive oil into a large skillet set over high heat. When shimmering, add the morels, and a pinch of salt and pepper. Cook, stirring often, until tender, about 2 minutes. Pour in the chicken stock, and boil for three minutes. Turn off the heat and set skillet aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the remaining one tablespoon of oil into a large cast-iron pan or large roasting pan. Season chicken pieces with salt and pepper. Turn heat to high, and when oil is shimmering, add the chicken pieces skin side down. Cook pieces until golden brown, five to seven minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip each piece of chicken, and then add the garlic cloves, bay leaf, chopped thyme, potatoes, shallots, and a pinch of salt and pepper. Stir well, and then transfer to the oven and cook for 15 minutes. Stir every five minutes or so. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the morels and chicken stock, stir again, and cook until the chicken is completely cooked, 25 to 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven, and set back over a burner. Turn heat to medium and add the fava beans and half the chives. Cook until everything is incorporated, about three minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve chicken pieces with the potatoes and fava beans. Garnish with the rest of the chives. </p>"}]}