{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110704-127355-dinner-tonight-peas-fava-beans-poached-eggs.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "egg", "fava beans", "peas", "toast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Fava Bean Salad with Toast and Poached Egg", "link": "https://www.seriouseats.com/recipes/2011/07/fava-bean-salad-with-poached-egg-recipe.html", "description": "Though it initially looks like a super healthy plate of food, this dish actually <strong>reminded me the most of a proper English breakfast.</strong> Just think about it: you have your bacon, eggs, tomatoes, peas, toast, and beans (albeit the green kind). Sure, you're missing the sausage, but the feeling is the same. There's a lot of green on this plate, but it's a hearty meal. Just about everything is cooked in some kind fat.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Eggs", "Legumes"], "recipeIngredient": ["2 ½ pounds fava beans in the shell, shelled", "6 ounces bacon, chopped ", "1 teaspoon red wine vinegar", "4 large eggs", "4 thick slices country bread", "1 ½ tablespoons extra-virgin olive oil ", "8 ounces cherry tomatoes", "2 tablespoons unsalted butter", "2 cups sweet green peas", "¼ cup mint leaves, chopped", "¼ cup basil leaves, chopped", "Salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium-sized saucepan halfway full of water to boil. Add the fava beans and cook for one minute. Remove with a slotted spoon, and rinse under cold water in a colander. Peel the skins off the fava beans, and then return to the boiling water. Cook until slightly tender, about two minutes. Drain in the colander and set aside. Refill the medium-sized saucepan halfway up with water, add the vinegar, and return it to the stove top. Turn heat to medium and bring to a gentle boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add the bacon to a large cast-iron skillet set over medium-low heat. Cook until the fat has rendered and bacon is crispy, about seven minutes. Remove with a slotted spoon, and drain the bacon on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to medium and add the as many of the slices of bread as will fit in one layer. Cook each until lightly browned on the bottom, and then flip and cook until lightly browned on the other side. Remove bread and set aside. Repeat process with any remaining slices of bread. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the skillet, and then add 1 ½ teaspoons of the olive oil. Turn heat medium, and when oil is shimmering, add the fava beans. Cook until lightly browned, stirring occasionally, one to two minutes. Remove the fava beans and set aside in a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining olive oil to skillet, and add the cherry tomatoes. Cook over medium heat until tomatoes are softened, one to two minutes. Remove the tomatoes from the skillet and transfer to the bowl with the fava beans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keep heat on medium, and add the butter. Once it has melted, add the peas. Cook until tender, one to two minutes. Transfer to the bowl with the fava beans and tomatoes. Season this mixture with salt and pepper, and add the mint and basil. Stir well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the slices of bread and the fava bean mixture between four plates. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat on the medium-sized saucepan to medium-low. One at a time, crack an egg into a shallow dish and then add to the simmering water. Cook the eggs until the whites just hold together, but the yolks are still runny, about three minutes. Remove each with a slotted spoon, and carefully dry on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place each poached egg on top of a slice of bread. Season to taste with salt and pepper, sprinkle with the bacon, and serve immediately. </p>"}]}