{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110501-larb-with-harold-duck-kin-shop-7.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["duck", "duck larb", "larb", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Harold Dieterle's Duck Larb", "link": "https://www.seriouseats.com/recipes/2011/05/duck-larb-thai-recipe-kin-shop-west-village-harold-dieterle.html", "description": "Chicken breast, beef chuck, pork loin or shoulder, or even firm fish can be substituted for the duck. Toasted glutinous rice powder can be purchased at Thai grocers. Thai red chili powder can be found in Asian grocers, or you can substitute red chili flakes. This dish is extremely hot. You can tone down the heat to suit your taste if desired.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 as an appetizer", "recipeCategory": ["Duck", "Other Meats", "Thai"], "recipeIngredient": ["<strong>For the pickled red onions</strong>:", "1 cup rice wine vinegar", "1/2 cup water", "1/2 cup sugar", "2 teaspoons kosher salt", "1 large onion, peeled cut into 1/4- to 1/8th-inch rings, base reserved", "&nbsp;", "1/2 cup glutinous or short grain rice", "1 tablespoons vegetable or canola oil", "1 pound duck meat from legs or breasts, well-chilled, cut into 1-inch cubes", "1 medium shallot, finely minced (about 2 tablespoons)", "2 large cloves garlic, finely minced (about 1 tablespoon)", "2 teaspoons finely minced fresh ginger", "1 stalk lemongrass, tender bottom portion finely minced (about 1 tablespoon)", "1 tablespoon Thai dried ground chili", "1/2 cup long bean or green beans cut into 1-inch segments", "1 1/2 cups mixed basil, mint, and cilantro leaves", "2 tablespoons fish sauce", "2 tablespoons lime juice", "Romaine lettuce leaves for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine rice vinegar, water, sugar, and salt in a small saucepan and bring to a boil. Add onions and onion bottom. Cover pot and remove from heat. Allow onions to pickle for at least 1 hour before using. Pickled onions can be stored in a sealed container covered in brine in the refrigerator for at least 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat rice in a dry 10-inch skillet over medium-high heat, tossing and stirring constantly until deep golden brown, about 5 minutes. Transfer to a spice grinder and grind into a fine powder. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grind duck through the course plate of a food grinder, or by pulsing in a food processor 1/2-pound at a time with 10 to 12 one second pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 12-inch skillet over high heat until lightly smoking. Add duck and cook, stirring occasionally, until no longer pink and fat has mostly rendered. Drain fat and return duck to skillet. Add shallot, garlic, ginger, lemongrass, and half of chili. Cook, stirring occasionally, until aromatic, about 1 minute. Add long beans and red onions and continue to cook, stirring constantly, for 1 minute. Add herbs, fish sauce, and lime juice, and toss to combine. Taste for heat and add remaining chili powder if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place lettuce leaves with cupped side facing up on a serving platter. Spoon larb into lettuce leaves, sprinkle with toasted rice powder, and serve.</p>"}]}