{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-177675-caramel-apple-pie-610x458-33.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["apple", "apple pie", "Pie Week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Caramel Apple Pie", "link": "https://www.seriouseats.com/recipes/2011/11/caramel-apple-pie-thanksgiving-recipe.html", "description": "This is a classic apple pie, infused with the flavor of slightly bitter, creamy caramel. My favorite apple for this pie is the Northern Spy, because I enjoy the sweet and tart contrast that it lends, as well as its ability to hold its shape when it's baked.", "totalTime": "8 hours", "recipeYield": "8", "recipeCategory": ["Apple", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "400 grams granulated sugar", "112 grams corn syrup", "224 grams water", "220 grams heavy cream", "2 teaspoons vanilla extract", "1/2 teaspoon salt", "10 apples (Northern Spy preferred) peeled, cored, and cut into 1/4 inch pieces", "240 grams sugar", "2 tablespoons flour", "<strong>Egg wash:</strong> 1 egg beaten with a big pinch of salt (allow this to sit for 5 minutes before using)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the caramel</strong>: In a heavy, medium-sized saucepan, combine the sugar, corn syrup, and water, taking care not to splash anything on the sides of the pot. Use a pastry brush dipped in water to wash away any splatters above the line of the mixture. Set the pot over medium-high heat. The mixture will begin to boil. Continue to wash down the sides with the brush dipped in clean water. After about 10 minutes, the mixture will begin to darken and turn amber. Begin swirling the pot over the burner to evenly distribute the caramelization. When the caramel grows darker and begins to smoke, immediately remove from heat and add the cream. Stand back, the mixture will grow and sputter. Once it dies down again, whisk in the vanilla and salt and continue to whisk until the mixture is smooth. Place in a heatproof container and allow it to cool for half an hour at room temperature before covering it and transferring to the fridge to cool completely, for at least one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> <strong>Shape the pie:</strong> Preheat the oven to 425&deg;F with a baking stone on the bottom rack (if you have one). Toss the apples with the remaining sugar and the flour to coat them, then pour all but 1/4 cup of the caramel over the apples and toss to distribute. The caramel will look gloppy. Pour the apple mixture into the chilled pie shell and cover with the chilled top crust. Shape the crust as desired, cut slits in the top, and allow the pie to chill for at least 20 minutes before baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bake the pie: </strong>Once the pie has chilled, brush the top of the pie with egg wash and sprinkle with sugar if desired. Place the pie on the lowest rack in the oven on the preheated baking stone (if you have one) and line the bottom of the oven with foil to catch leaking pie juice. Bake the pie for 20 minutes at 425, rotating halfway through. Then lower the oven to 350&deg;F and continue baking for approximately 30 minutes, or until the top is golden brown and the filling is bubbling all the way through. If you need to place patches of foil over parts of the crust that are getting to dark, this is a good strategy for preventing burnt spots. Allow the pie to cool for at least three hours before serving. Drizzle with the reserved caramel just before serving, if desired.</p>"}]}