{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110928-ruhlmans-twenty-cover.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "mashed potatoes", "Michael Ruhlman", "potatoes", "recipe newsletter", "Ruhlman's Twenty", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Brown Butter Mashed Potatoes", "link": "https://www.seriouseats.com/recipes/2011/09/brown-butter-mashed-potatoes-recipe.html", "description": "This recipe for <strong>Brown Butter Mashed Potatoes</strong> incorporates a few easy but game changing elements. First off is the potato cooking method. Instead of aggressively boiling, Ruhlman opts for a gentle simmer on medium-low heat; this way the exterior doesn't disintegrate into the cooking water. The potatoes are then drained and left aside for their steam to release, therefore drying out the potatoes slightly and making for a fluffier mash. The final element added to this amazing mash&mdash;and the one that sets it apart&mdash;is brown butter, with all its caramelly, nutty flavor. Incorporating brown butter into mashed potatoes gives them an added element of richness in a way that is both nearly effortless but totally elegant. This is of those recipes that will certainly change the way you think about humble mashed potatoes from here on out.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Mashed Potatoes", "Sides", "Vegetarian"], "recipeIngredient": ["1 pound russet/baking or Yukon gold potatoes, peeled and cut into large pieces", "1 cup milk, plus more if needed", "Kosher salt", "1/2 cup butter  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes in a medium saucepan and add water to cover. Bring to a simmer over high heat, then reduce the heat to medium-low and cook until the potatoes are tender throughout, about 20 minutes. Don’t boil the potatoes; this can disintegrate the exterior. Drain the potatoes and set aside to let the moisture steam off. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same saucepan, combine the milk and 2 teaspoons salt and set over medium heat. When the milk is hot, return the potatoes to the pan. You can mash them in the pan with a masher (I like them chunky so I prefer this method), or mash them directly into the pan with a ricer or food mill. Stir the potatoes just to combine with the milk; don’t overmix. Taste and season with salt if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan over medium-high heat, melt the butter. When the foaming subsides, stir the butter and note the color of the solids. When the solids are golden brown, add half of the butter to the mashed potatoes. Taste for seasoning. If you prefer the potatoes thinner, add a little more milk. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the potatoes topped with a spoonful of the remaining brown butter.</p>"}]}