{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110621-bread-baking-tomato-scones.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "King Arthur Flour", "scones", "sun-dried tomatoes", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Savory Tomato Scones", "link": "https://www.seriouseats.com/recipes/2011/06/savory-tomato-scones-recipe.html", "description": "Most scones suffer from being too sweet. I went to the other side&mdash;to the savory scone side. You can find sun-dried tomatoes in the dried fruit section, which I like better for this recipe than the jarred kind. This way, you're just adding the dried tomatoes, not any oil or extra liquid.", "totalTime": "40 minutes", "recipeYield": "8", "recipeCategory": ["Bread Baking", "Quick Bread", "Tomato"], "recipeIngredient": ["9 ounces (about 1 2/3 cups ) all purpose flour", "2 teaspoons sugar", "1 teaspoon salt", "1 tablespoon baking powder", "4 tablespoons cold butter", "2 ounces goat cheese (chevre)", "1/2 cup sun-dried tomatoes cut in 1/4-inch pieces", "1/2 cup milk", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 375 degrees and line a baking sheet with parchment paper. In a medium bowl, combine the flour, sugar, salt, and baking powder. Whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the butter and goat cheese into about 1/4-inch chunks and add it to the dry ingredients. Cut it in with a pastry cutter until you have pea-sized pieces, or rub it in with your fingertips until you have flat pieces. Add the tomatoes and stir to distribute them. In a separate container, combine the milk and egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the liquid ingredients to the dry, and fold it in gently until all the flour is moistened, but without breaking up the butter any more than necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn out the dough. Flour your hands and pat the dough flat. Fold it in half, and pat it down to about an inch thick. If the dough is sticking to the counter, use a bench scraper. Put more flour under the dough, if needed. Fold the dough in half again (in the opposite directions) and pat down as before. Fold it a third time. You should have a smooth rather than shaggy dough. If not, pat and fold one more time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a disk 7-8 inches in diameter. Transfer it to the baking sheet. Cut dough into 8 wedges. If you prefer a crisp crust on your scones. move the wedges apart. If you prefer softer scones, leave them touching. Bake at 375°F for 15 to 18 minutes, until nicely browned.</p>"}]}