{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110411krangosturacollageprimary.jpg", "author": {"@type": "Person", "name": "Zachary Feldman"}, "recipeCuisine": "", "keywords": ["Angostura bitters", "aromatic bitters", "bitters", "Bitters Old Men"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Krangostura Bitters", "link": "https://www.seriouseats.com/recipes/2011/04/krangostura-bitters-make-your-own-angostura-bitters-recipe.html", "description": "These Krangostura Bitters, a loose play on the quintessential Angostura brand, are brimming with clove and cardamom and supported by a backbone of gentian root and cinchona bark. Try them in your next Manhattan or Old Fashioned and branch out from there.", "totalTime": "one month", "recipeYield": "makes roughly five 5 ounce portions", "recipeCategory": ["Other Drinks"], "recipeIngredient": ["<strong>For the Bitters</strong>", "1/2 cup whole cloves", "1/4 cup whole black cardamom", "3/4 cup blades of mace", "2 tablespoons whole allspice berries", "1/4 cup cinchona bark (available at Kalustyans and <a href=\"https://herbsofmexico.com/store/bulk-herbs-to-z/h/cinchona-bark\">Herbs of Mexico</a>.)", "1 heaping teaspoon gentian root (available as chips and twigs from <a href=\"http://www.mountainroseherbs.com/search/search.php?refine=y&keywords=gentian&x=0&y=0\">Mountain Rose Herbs</a>)", "2 ounces Indonesian cinnamon (about 16 2\" long sticks, or 8 full-size)", "2/3 cup black raisins", "3 tablespoons blackstrap molasses", "About 400 milliliters Everclear 190 or highest available proof neutral grain spirit", "2 Meyer Lemons and 1 Cara Cara orange, for peels added after two weeks", "&nbsp", "<strong>For Dilution Liquid</strong>", "4 cups water", "&nbsp;", "<strong>For Muscovado Simple Syrup</strong>", "1 cup muscovado sugar", "1 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Loosely mash cloves, cardamom, mace, and allspice in a mortar and pestle to release oils&mdash;just a few good bashes, not enough to pulverize. Add to 750 milliliter airtight nonreactive container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cinchona bark, gentian root, cinnamon, raisins, and molasses and cover with enough alcohol that solids are submerged and there's an additional half-inch of alcohol in the container. Store in a dark place and shake daily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After two weeks of daily shaking, peel Meyer lemons and Cara Cara orange. Open container and add peels, tearing up peels by hand to release essential oils. Reseal container and store in a dark place, continuing to shake daily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At the end of the fourth week, strain the solid ingredients through cheesecloth and set the strained alcohol aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make dilution liquid, place solid ingredients in a soup pot and cover with 4 cups water. Bring this mixture to a boil for about 15 minutes to infuse the flavor of the ingredients into the water. Let cool and strain through cheesecloth. Measure the strained alcohol and mix with an equal amount of strained dilution liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make muscovado simple syrup, heat 1 cup water with 1 cup of muscovado sugar and stir until sugar dissolves. Let cool. Add 3/4 cup simple syrup to the diluted bitters mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point, you should check for clarity by pour some bitters into a clear glass container and holding it up to the light. If you are satisfied with the clarity, consider yourself done. If you'd like to remove any present sediment, either pass bitters through a coffee filter or multiple layers (5+) of cheesecloth and repeat until you've reached desired clarity.</p>"}]}