{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110812-165814-chicken-cordon-bleu.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Canal House Cooking", "Canal House Cooking Volume No. 6", "chicken", "chicken cordon bleu", "Christopher Hirsheimer", "Cook the Book", "ham", "Melissa Hamilton"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cook the Book: Chicken Cordon Bleu", "link": "https://www.seriouseats.com/recipes/2011/08/chicken-cordon-bleu-recipe.html", "description": "When was the last time you had <strong>Chicken Cordon Bleu</strong>?  It's probably been too long.  Brush away all of those 1970s-era dinner party connotations and you'll find a dish that really does deserve a comeback.  Why?  Well, because dated or not, it's fried chicken stuffed with ham and cheese.", "totalTime": "20 minutes", "recipeYield": "2", "recipeCategory": ["Chicken", "Cook the Book", "Ham"], "recipeIngredient": ["2 thin slices boiled ham ", "2 thin slices melting cheese, such as Munster, Fontina, or Gruyère ", "½ cup flour ", "1 cup panko  ", "1 egg, beaten", "1 whole boneless, skinless chicken  breast, cut in half to separate it  into 2 lobes ", "Salt and pepper", "Canola Oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay each slice of ham on a cutting board, put a slice of cheese on top of each,  and fold the ham around the cheese as you would fold up a business letter. Set aside. Put the flour in a wide dish, put the panko in another, beat the egg  in a third dish, and set them aside. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay each chicken breast half on the cutting board, smooth side facing down.  If the breasts are big and fat, you can remove the tenderloin, if you like, and  use it for another meal, but if the breasts are smaller and thinner, leave the  tenderloins in place. They’ll cover up any accidental nicks that may happen  when cutting out the pocket in each breast. Using a narrow sharp knife with  a pointed tip, make an incision in the side of the breast, then carefully cut out  a long deep pocket without puncturing the rest of the breast. Repeat with the  other breast. Tuck the ham and cheese into each pocket and gently press the  breast to close up the pocket. Season the chicken with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough oil to a medium skillet to reach a depth of 1–2 inches. Heat the  oil over medium heat until it is hot but not smoking, ideally to a temperature of 350º (use a candy thermometer to check the temperature). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dredge one piece of chicken at a time in the flour, tapping off the excess,  then dip it in the egg, then dredge it in the panko. Fry the chicken in the hot  oil until golden brown all over and cooked through, about 5 minutes per side  depending on the thickness of the breasts. Transfer the chicken to a wire rack set over paper towels to drain. Season with salt while still hot. </p>"}]}