{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/pic500px.JPG", "author": {"@type": "Person", "name": "Lee Zalben"}, "recipeCuisine": "", "keywords": ["chocolate", "fudge", "peanut butter", "That's Nuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Easy Chocolate Peanut Butter Crunch Fudge", "link": "https://www.seriouseats.com/recipes/2011/06/easy-chocolate-peanut-butter-crunch-fudge-recipe.html", "description": "I was recently introduced to <strong>Alton Brown</strong>'s recipe for <a href=\"http://www.foodnetwork.com/recipes/alton-brown/peanut-butter-fudge-recipe/index.html\">microwave peanut butter fudge</a>. I was skeptical.  Fudge is tricky, and microwaves don't really allow for precise temperature control.  And microwaves vary in wattage. This seemed like a kitchen disaster waiting to happen&mdash;except it actually worked.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Chocolate", "Desserts", "Nuts"], "recipeIngredient": ["8 ounces unsalted butter, plus more for greasing pan", "1 1/4 cup crunchy peanut butter", "1 teaspoon vanilla extract", "1 pound powdered sugar", "1/2 cup semisweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line an 8\" x 8\" baking dish with wax or parchment paper.  Lightly grease with butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the butter and peanut butter in a large glass, ceramic, or otherwise microwave-safe bowl and cover with plastic wrap. Microwave for 2 minutes on high.  Remove from microwave and stir until smooth.  Return to microwave and cook on high for 2 additional minutes.  Remove from microwave.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the vanilla and powdered sugar to the peanut butter mixture and quickly stir to combine with a wooden spoon. Don't over beat the fudge.  Just as the mixture starts to lose its sheen and becomes hard to stir, add half of the chocolate chips and as soon as they begin to marble the fudge, begin spreading the candy into the prepared pan, disturbing it as little as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the remaining chocolate chips on top of the fudge and cover the top with a sheet of wax or parchment paper, lightly pressing down on the top of the fudge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate until completely cool, about 2 hours.  Cut into bite size pieces and store in an airtight container at room temperature for up to a week. </p>"}]}