{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110120VanillaPotDeCreme.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["desserts", "pot de creme", "The Secret Ingredient", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Secret Ingredient (Vanilla): Vanilla Cream Pots", "link": "https://www.seriouseats.com/recipes/2011/01/the-secret-ingredient-vanilla-vanilla-cream-pots.html", "description": "Pot de crème is extremely thick, like you have to tug it off the spoon with your lips.  Dense, and almost cloying, it is so redolent of its flavor, whether that's the Bourbon vanilla at my favorite place, or chocolate, or caramel, or whatever else.", "totalTime": "Overnight", "recipeYield": "4", "recipeCategory": ["Desserts", "Puddings and Custards", "The Secret Ingredient"], "recipeIngredient": ["1 cup heavy cream", "1 vanilla bean", "4 eggs yolks", "2 tablespoons granulated sugar", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300&deg;F.  Boil a kettle of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the cream in a small saucepot over medium heat.  Split the vanilla bean lengthwise, and use a paring knife to scrape out the seeds.  Add the seeds and the pod to the cream, and heat, stirring occasionally, until little bubbles start to form around the rim of the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cream is heating, beat together the egg yolks and sugar on medium-high speed for 2 minutes, until the mixture is pale and light.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the vanilla extract to the hot cream, and discard the vanilla pod.  Whisking continuously, slowly pour the hot cream into the egg yolk mixture.  Pour the mixture into 4 individual ramekins, and set the ramekins in a square baking dish.  Pour hot water in the baking dish halfway up the sides of the ramekins.  Bake until the center of the creams is slightly set, 30 minutes.  Let the creams come to room temperature in their water bath, then cover the ramekins with plastic wrap, and refrigerate overnight.  Serve straight from the fridge.</p>"}]}