{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110121-133847-eat-for-eight-bucks-roasted-tomato-quesadilla.JPG", "author": {"@type": "Person", "name": "Phoebe Lapine and Cara Eisenpress"}, "recipeCuisine": "", "keywords": ["cheap", "Eat for Eight Bucks", "quesadilla", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eat for Eight Bucks: Roasted Tomato Quesadillas with Cilantro Cream", "link": "https://www.seriouseats.com/recipes/2011/01/eat-for-eight-bucks-roasted-tomato-quesadillas.html", "description": "Cheese is the obvious answer to what goes inside a quesadilla. Freshly roasted tomatoes are a little more counterintuitive, when we're talking cheap and when the season is winter.  But pints of cherry tomatoes are relatively flavorful, even in January, and roasting them brings out all their sweet fruity tones&mdash;so much so that a bite into one of these quesadillas could almost transport you to summertime. A dollop of herbed sour cream on top brings all the flavors together and makes the presentation plenty attractive to serve to a guest.", "totalTime": "10 minutes", "recipeYield": "2", "recipeCategory": ["Eat for Eight Bucks", "Vegetarian"], "recipeIngredient": ["1/4 cup sour cream", "1/2 cup cilantro leaves", "1 dash cayenne pepper", "Kosher salt", "1 pint cherry tomatoes", "1 teaspoon sugar", "2 tablespoons olive oil", "Three 10-inch flour tortillas", "4.5 ounces white cheddar, grated", "1 cup fresh spinach"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 350°F. In small bowl, combine sour cream, cilantro, and cayenne. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large cast iron skillet or baking dish, toss tomatoes together with 1 teaspoon salt, sugar, and olive oil. Bake in oven until tomatoes have released a lot of liquid and their skins have begun to burst, 15 to 20 minutes.</p>\n\n<p>Turn heat up to 450°F and cook until skins are blistered, about 10 minutes. Remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the shredded cheese between three tortillas, arranging it on one-half of each. Top each with 1/3 of the spinach and about 10 tomatoes (you may have a few leftover). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 12-inch cast iron skillet or grill pan over medium heat for 4-5 minutes. Fold tortillas in half and place 2 in skillet with cheese layer on the bottom. Cook until both sides are toasted and cheese is melted, flipping once halfway through cooking, 3 to 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each quesadilla into quarters and arrange 6 on each plate. Top with cilantro cream and serve.</p>"}]}