{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111005-174063-sunday-super-roast-chicken-herb-waffle.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["chicken", "roasted chicken", "Sunday Supper", "waffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Sunday Supper: Roast Chicken with Herb Waffles", "link": "https://www.seriouseats.com/recipes/2011/10/roast-chicken-with-herb-waffles-recipe.html", "description": "There's nothing new about chicken and waffles.  But this version of the Southern classic adds additional savory elements to the waffle with fresh herbs, and lightens up the chicken by simply roasting it with salt, pepper and lemon juice.  Although the traditional fried version of this dish is always a hit, this spin on the classic is a way to end your weekend feeling a little happier with your waistline, but still satisfied.  Serve with a green salad and cold white wine.", "totalTime": "1 hour 30 minutes", "recipeYield": "4", "recipeCategory": ["Chicken", "Sunday Supper"], "recipeIngredient": ["1 5-pound chicken", "Kosher Salt and cracked black pepper", "Lemon juice", "&nbsp;", "<strong>Herb Waffles:</strong>", "1 1/2 cup all-purpose flour", "1/4 cup cornmeal", "1 tablespoon baking powder", "1 teaspoon sugar", "1 teaspoon salt", "2 tablespoons chopped mix of fresh herbs (chives, oregano, parsley etc)", "3 eggs, beaten", "4 tablespoons butter, melted", "1 1/2 cup milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425°F.  Rinse and pat dry chicken.  Place in baking dish, drizzle with lemon juice and season with salt and pepper.  Place in oven and roast for 1 hour, or until thickest part of bird reaches 180°F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat waffle iron.  Combine flour, cornmeal, baking powder, sugar and salt and whisk to combine.  In a separate bowl, combine herbs, eggs, melted butter and milk and whisk to combine.  Combine wet and dry ingredients, whisking until there are no lumps and batter is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once your chicken is out of the oven and resting, make your waffles by adding between 1/3 and 1/2 cup of batter (depending on the size of waffle iron) to the hot waffle iron and cooking until waffles are cooked through and golden brown.  Repeat until all batter is used.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve roast chicken on top of waffles with drippings, mustard, or a seasoned mayo and lots of cold crisp beer.</p>"}]}