{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/201104012-dt-senegalese-rice-and-peas.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["black eyed peas", "Dinner Tonight", "rice and beans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Senegalese Rice and Peas", "link": "https://www.seriouseats.com/recipes/2011/04/dinner-tonight-senegalese-rice-and-peas-recipe.html", "description": "It's humble food, but delicious.  Though I substituted regular long-grain rice for the Senegalese red variety, and couldn't find palm oil, which also apparently gives this dish a vibrant red color, I still liked the result. The pungent flavor comes from a puree of onion, habanero, and fish sauce--only recommended for those who don't mind the taste of fish sauce, but I found it unexpectedly delicious.  Another version of rice and beans to the repertoire.", "totalTime": "60", "recipeYield": "4", "recipeCategory": ["Dinner Tonight", "Mains", "Sides"], "recipeIngredient": ["1 cup dried black-eyed peas", "1 cup Djola red rice, or subsitute long grain rice", "1/2 onion", "1 habanero pepper, or to taste", "2 tablespoons fish sauce", "salt to taste", "1/2 cup red palm oil or canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, cover peas with warm water and let stand twenty minutes, then drain. Place the soaked peas in a food processor and pulse a few times, just enough to loosen the skins.  Cover with cold water and the skins should float to the top. Pour them away and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer peas to large saucepan and cover with 1 quart of water.  Bring to a boil then simmer until tender, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice to the pot and continue simmering, covered, for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, combine the onion, pepper, and fish sauce in a blender and blend into a puree.  Stir mixture into the pot and simmer until the rice is tender, adding more water if necessary.  Stir in the oil and serve.</p>"}]}