{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205-182838-chocolate-orange-pie-610x548-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "orange", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Chocolate Orange Cream Pie", "link": "https://www.seriouseats.com/recipes/2011/12/chocolate-orange-cream-pie-christmas-foil-wrapped-chocolate-oranges-recipe.html", "description": "A pie inspired by foil-wrapped chocolate oranges.", "totalTime": "8 hours", "recipeYield": "serves 8 people", "recipeCategory": ["Chocolate", "Christmas", "Desserts", "Orange", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "16 ounces whole milk", "2 tablespoons orange zest (from approximately 2 oranges)", "13 ounces 65% chocolate, chopped into 1/4-inch pieces or smaller", "5 tablespoons corn syrup", "Pinch of salt", "4 ounces mascarpone cheese", "6 ounces heavy cream", "2 tablespoons confectioners' sugar", "Optional garnish: <a href=\"http://www.seriouseats.com/recipes/2011/06/sweet-technique-recipe-candied-citrus-zest.html\">candied orange zest</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. Line the bottom and sides of the chilled, shaped pie crust with parchment or foil and fill with pie weights (I re-use dried beans for this purpose). On the bottom rack of the oven, bake the shell for 20 minutes rotating halfway through, then remove the weights and liner and bake for an additional 10 minutes, or until the bottom of the pie is golden brown. Remove the shell from the oven and allow it to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized saucepan, combine milk and orange zest. Bring them just to a boil over medium heat, then remove from heat and allow them to sit for 20 minutes. Pour the mixture through a fine mesh strainer to remove the zest, and return the infused milk to a clean, medium-sized saucepan. Combine chopped chocolate, salt, and corn syrup in a large bowl. Bring milk just to a boil, then pour milk over the chocolate mixture and allow it to sit for 2 minutes. Then, stir milk and chocolate mixture until all of the chocolate is melted. Pour mixture back into the saucepan over low heat, and stir continuously for approximately 8 minutes, taking care to prevent the mixture from burning on the bottom of the pan. The mixture will thicken and begin to bubble. Continue stirring until it has thickened to the consistency of pudding. Remove from heat and pour the filling into the pie shell. Press plastic wrap directly on the surface of the filling (not over the crust), and chill for at least 4 hours (overnight is ideal).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: In the bowl of a stand mixer fitted with a whisk attachment, whip the cream and confectioner's together until the cream has thickened but does not yet hold soft peaks. Add the mascarpone and whip until the mixture holds medium peaks. Top pie with the whipped mixture and decorate with candied orange zest (if desired). Serve immediately.</p>"}]}