{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111002-apple-pie-food-lab-primary-2.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["apple pie", "comfort", "essential", "pie", "Thanksgiving desserts", "Thanksgiving pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.4545454545455", "ratingCount": "11"}, "name": "Perfect Apple Pie", "link": "https://www.seriouseats.com/recipes/2011/10/perfect-apple-pie-recipe-double-crusted-thanksgiving-dessert.html", "description": "For best results, pair this recipe with our <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">Easy Pie Dough</strong> recipe. See our article on <a href=\"http://sweets.seriouseats.com/2011/10/the-food-lab-what-are-the-best-apples-for-apple-pies-how-to-make-pie.html\">the best apples for pies</a> to select good apples.", "totalTime": "3 hours", "recipeYield": "about 8", "recipeCategory": ["Christmas", "Pies, Tarts, and Crumbles", "Thanksgiving"], "recipeIngredient": ["4 to 4 1/2 pounds Golden Delicious, Braeburn, or other baking apples, peeled cored, and sliced into 1/4-inch slices", "3 quarts boiling water (or cider, see note)", "10 tablespoons granulated sugar, plus 1 tablespoon for sprinkling over crust", "1/4 teaspoon cinnamon (or more, to taste)", "1/4 teaspoon salt", "2 to 4 tablespoons cornstarch (see note)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">Easy Pie Dough</a>", "1 egg white, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and place a heavy rimmed baking sheet on it. Preheat the oven to 425°F. Place apple slices in a large bowl or pot. Pour boiling water or cider directly over top. Cover and set aside at room temperature for ten minutes. Drain apples well and let sit in a colander in the sink, tossing occasionally until completely dry, about 10 minutes. Transfer to a large bowl and add 10 tablespoons sugar, cinnamon, salt, and cornstarch, and toss until apples are evenly coated. Set mixture aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll one disk of pie dough into a circle roughly 12-inches in diameter. Transfer to a 9-inch pie plate. Add filling, discarding any excessive juices in the bottom of the bowl. Roll remaining disk of pie dough into a circle roughly 12-inches in diameter. Transfer to top of pie. Using a pair of kitchen shears, trim the edges of both pie crusts until they overhang the edge of the pie plate by 1/2 an inch all the way around. Fold edges of both pie crusts down together, tucking them in between the bottom crust and the pie plate and working your way all the way around the pie plate until everything is well tucked. Use the forefinger on your left hand and the thumb and forefinger on your right hand to crimp the edges. Cut 5 slits in the top with a sharp knife for ventilation.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a pastry brush to brush an even coat of lightly beaten egg white all over the top surface of the pie. Sprinkle evenly with a tablespoon of sugar. Transfer pie to sheet tray in the oven and bake until light golden brown, about 20 minutes. Reduce heat to 375°F and continue baking until deep golden brown, about 25 minutes longer. Remove from oven and allow to cool at room temperature for at least 2 hours before serving.</p>"}]}