{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/segment-1.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["custards", "desserts", "meringue", "orange", "Serious Sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange-Cream Pavlovas", "link": "https://www.seriouseats.com/recipes/2011/06/orange-cream-pavlovas-recipe.html", "description": "In the 1920s while on a world tour, Russian ballerina <strong>Anna Pavlova</strong> visited Australia and New Zealand. She inspired audiences and kitchens alike&mdash;it was during this trip that the <strong>pavlova, a meringue topped with whipped cream and fruit,</strong> was introduced.", "totalTime": "2 hours, 30 minutes", "recipeYield": "6", "recipeCategory": ["Fruit Desserts", "Orange"], "recipeIngredient": ["3 large egg whites, at room temperature", "1 teaspoon white vinegar", "1/2 teaspoon salt", "1 1/4 cups sugar", "2 teaspoons cornstarch", "1/2 teaspoon pure vanilla extract", "4 large eggs, at room temperature", "3 large egg yolks, at room temperature", "3 tablespoons zest and 1/2 cup juice from 2 oranges (See Notes)", "1 teaspoon zest and 2 tablespoons juice from 1 lemon", "2 tablespoons unsalted butter, cut into small pieces", "1 orange (See Notes)", "1 cup heavy cream, chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 200°F. Line baking sheet with parchment paper and spray lightly with baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat whites, vinegar, and 1/8 teaspoon salt on medium-low speed until loosened, about 30 seconds. Increase speed to medium-high and beat until soft peaks form, 2 to 3 minutes. Combine 3/4 cup sugar and cornstarch and, with mixer running, slowly add to bowl 1 tablespoon at a time. Once all the sugar mixture has been added, continue mixing until stiff, glossy peaks form, about 2 minutes longer.  Add vanilla and beat just until combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon 6 meringues about 1 inch apart onto prepared baking sheet, using the back of the spoon to make an indentation—meringues should resemble nests. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until firm and dry, about 1 1/2 hours. Turn oven off, prop oven door open with a wooden spoon, and allow meringues to cool in oven about 1 hour. Meringues may be stored in an airtight container up to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk the eggs, egg yolks, remaining 1/2 cup sugar, and remaining 3/8 teaspoon salt together in a medium heavy-bottomed saucepan. Add 2 tablespoons orange zest, lemon zest, orange juice, and lemon juice and cook over medium-low heat, whisking constantly, until thickened and the consistency of pudding, 8 to 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain curd into medium bowl. Add butter and stir until completely incorporated. Place a piece of plastic wrap directly on the surface of the custard and chill completely. Alternatively, place bowl in ice bath and stir constantly until custard is completely cooled, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make segments, cut off about 1/2-inch from to and bottom of orange. Using a sharp knife, cut the skin and pith off the orange, leaving the flesh exposed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut between the membranes to obtain segments. Cut each segment into 3 or 4 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk cream in a chilled bowl until stiff peaks form, 2 to 3 minutes. Stir 1/3 of the cream into the chilled custard, then, fold in the remaining cream, remaining 1 tablespoon orange zest, and orange segments.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, top each pavlova with orange-cream custard.</p>"}]}