{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110920EggplantTian.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["basil", "eggplants", "French", "French in a Flash", "light eating", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French in a Flash: Easy Awesome Eggplant Tian", "link": "https://www.seriouseats.com/recipes/2011/09/easy-awesome-eggplant-tian-recipe.html", "description": "This eggplant tian is a refreshing, lighter break from Eggplant Parm, full of sweet balsamic-roast eggplant, oozing mozzarella cheese, and summery-fresh basil.", "totalTime": "1 hour and 20 minutes", "recipeYield": "4", "recipeCategory": ["Eggplant", "French", "Vegetarian"], "recipeIngredient": ["2 large eggplants", "1 teaspoon Kosher salt", "1/2 cup olive oil", "3 tablespoons balsamic vinegar", "1 large clove garlic, grated", "Freshly cracked black pepper", "1 1/2 cups marinara sauce, divided", "9 ounces fresh mozzarella, torn in small chunks", "4 tablespoons finely grated Parmigiano Reggiano", "4 teaspoons pesto sauce or pistou"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the eggplant into 1/2-inch rounds.  Toss the eggplant with the salt in a large colander, and allow to sit and drain in the sink for 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the boiler.  In a large bowl, whisk together the olive oil, balsamic vinegar, garlic, and pepper.  Without rinsing the eggplant, toss them with the vinaigrette, and let marinate for 15 minutes.  Arrange the slices in a single layer on a large nonstick baking sheet (you may need to do this in batches).  Broil for 12 minutes.  Flip the eggplant slices over with a spatula.  Broil another 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 425&deg;F.  Place 2 tablespoons of marinara sauce in the bottom of each of 4 round au gratin dishes.  Divide the eggplant slices among the 4 dishes.  Top each dish with 1/4 cup of marinara sauce.  Then divide the mozzarella pieces among the 4 dishes, and finally the Parmigiano Reggiano.  Place the gratin dishes on a rimmed baking sheet to catch any spills, and bake for 30 minutes until the marinara sauce is bubbling, and the cheese is melted.  Let the tians rest for 10 minutes.  Drizzle with 1 teaspoon of pesto sauce per tian, and serve.</p>"}]}