{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110904poptartsprocess1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "dried fruit", "fruit tart", "gluten free", "pastry", "Pop Tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Strawberry \"Pop-Tarts\"", "link": "https://www.seriouseats.com/recipes/2011/09/homemade-pop-tarts-recipe.html", "description": "Either Kellogg's now manufactures Pop-Tarts using a reformulated recipe or the tastebuds I possessed as a child had not developed enough to distinguish between crap and yum. As a kid, I thought Pop-Tarts represented the absolute pinnacle of deliciousness. I remember each nibble bringing supreme, no, <em>divine</em> pleasure. My adult palate, however, finds every bite a new adventure in disappointment.", "totalTime": "2 hours", "recipeYield": "12 Pop Tarts", "recipeCategory": ["Dairy-Free", "Desserts", "Gluten-Free", "Pastry", "Vegan"], "recipeIngredient": ["<strong>Tart Dough:</strong>", "8 ounces cold butter, cubed (use shortening for vegan)", "10 ounces all purpose flour ", "1 teaspoon salt", "6 ounces corn syrup ", " ", "<strong>Fruit Filling:</strong>", "2 ounces freeze dried strawberries (see note)", "4 ounces dried pear", "4 ounces dried apple", "1 ounce corn syrup", " ", "<strong>Frosting:</strong>", "12 ounces powdered sugar", " 2 egg whites <strong>or</strong> 2 ounces corn syrup", "1/2 teaspoon salt", "2 teaspoons vanilla", "rainbow sprinkles, <a href=\"http://bravetart.com/recipes/RainbowSprinkles\">homemade</a> or store bought"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the tart dough:</strong> With your fingers, cut butter into flour, along with salt, until reduced to pea sized lumps. Next, add corn syrup all at once and mix with a fork until it forms a ball. Dust your hands with a little flour, scoop out the dough, and knead lightly until smooth.</p>\r\n\r\n<p>Flatten dough into a squarish shape, wrap in plastic, and chill at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the filling:</strong> Place a sheet of plastic wrap over a cutting board and set aside. Also have ready a small bowl of water.</p>\r\n\r\n<p>Combine dried fruit and corn syrup together in a food processor. Pulse until the fruit has been pureed; stop periodically to scrape the bowl down with a plastic spatula to ensure no chunks of fruit remain. Continue pulsing until an incredibly thick, dough-like paste is formed.<br />\r\n <br />\r\nNow sprinkle a little water on the plastic wrapped cutting board. Use a spatula to scrape the fruit paste from the processor and on to the cutting board. If you need to use your hands, moisten them with water before touching the fruit paste to prevent sticking.</p>\r\n\r\n<p>Place the fruit paste into center of the plastic wrap and use damp fingers to pat it into a square. Sprinkle it with a few drops of water, then put another sheet of plastic wrap on top.</p>\r\n\r\n<p>Use a rolling pin to roll the paste between the the sheets of plastic; aim for a 12 inch square, about 1/8” thin. Take care to roll evenly, both up-and-down and left-and-right, to maintain a very square-like shape.</p>\r\n\r\n<p>Gently peel off the top layer of plastic. Use a dampened ruler (it will stick to the paste if you don’t moisten it with water!) to trim the paste into a 12” square. Peel up the scraps and use them to patch together any gaps and to complete the square shape.</p>\r\n\r\n<p>If necessary sprinkle some more water over the paste, reapply the plastic wrap, and roll a little more. This will seal the patchwork together and ensure the paste is uniformly thin.</p>\r\n\r\n<p>Use a dampened ruler and a pizza cutter (or knife) to cut out 12, 2 3/4” x 3 3/4” pieces. Don't bother trying to lift or move those pieces, just cut them. Refrigerate the paste, uncovered, until needed (the pieces are easier to handle when cold).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg; F and have a parchment lined sheet pan ready. Roll the dough to a little shy of 1/4” thick. <i>This is important</i>. Each Pop-Tart will ultimately have 4 “layers” (pastry + filling + pastry + icing), so pay close attention to the thickness of each. If you don’t, you may wind up with unreasonably thick Pop-Tarts.</p>\r\n\r\n<p>Take the chilled squarish lump of dough and set it onto a surface dusted in sifted powdered sugar. Roll the dough evenly both left-and-right and up-and-down, but don’t roll diagonally! This will preserve the square shape and minimize re-rolling. Lift and move the dough periodically to make certain it hasn’t stuck, dusting underneath as needed.</p>\r\n\r\n<p>Once the dough has reached about a 1/4” thickness and an overall square shape, use a ruler to cut it into however-many 3 1/8” wide strips. Then, cut each strip every 4 inches. Gather up any remaining scraps, roll, and cut likewise until you have 24 pieces all together.</p>\r\n\r\n<p>On half off the pieces, place a rectangle of prepared fruit paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To seal and bake the tarts:</strong> Cover each fruit paste-topped portion with remaining dough pieces. Use the rounded end of a bench knife or your fingers to smooth the dough over the fruit filling and to gently press out any air pockets. </p>\r\n\r\n<p>Use the handle of a bench knife, the handle of a wooden spoon, or the side of your hand to gently seal the dough along all four sides of each tart. Do not use a fork to crimp the edges; have you ever seen a Pop Tart before? No crimping.</p>\r\n\r\n<p>Once you’ve smoothly sealed the edges of the Pop-Tart, carefully dock with a fork.</p>\r\n\r\n<p>Use a bench knife or spatula to transfer the Pop-Tarts to a parchment lined cookie sheet. Bake for about 20 minutes, until lightly browned all over. You don’t want them “golden brown” by any means, real Pop-Tarts look downright anemic.</p>\r\n\r\n<p>Occasionally, a Pop-Tart or two will spread somewhat irregularly during baking. While they’re still warm from the oven, you can trim the edges again quite easily with a bench scraper or knife. Cool thoroughly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the frosting and finish the tarts:</strong> Use a clean towel or dry pastry brush to dust off the cooled Pop-Tarts, removing any stray crumbs.</p>\r\n\r\n<p>Combine all of the icing ingredients in a bowl and mix until a smooth paste forms. Put some of the icing into a piping bag fitted with a small, plain tip. Pipe a boarder of icing around the perimeter of each tart, leaving about a 1/4” margin.</p>\r\n\r\n<p>Thin the remaining icing, a tablespoon of water at a time, until it reaches a pourable consistency. Pour a tablespoon of icing onto each tart and use the tip of a metal spatula or spoon to help it reach all of the corners. Pop-Tarts only have a thin smear of icing on top, so take care not to over do it.</p>\r\n\r\n<p>Let the icing dry for about 3 minutes or so before decorating with sprinkles. Homemade or store bought, the sprinkles tend to bleed if they go on too soon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Aging the Pop-Tarts:</strong> Transfer the tarts to a baking sheet and store them in a cool, dry location where they will be undisturbed (the inside an empty microwave works perfectly). Let the Pop-Tarts dry, uncovered, overnight. This will significantly improve their texture.</p>\r\n\r\n<p>The Pop-Tarts will keep for about two weeks at room temperature and, in fact, get better with age. </p>"}]}