{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110609-goodbye-dumpling-51.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["dog food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dumpling's Favorite Chow", "link": "https://www.seriouseats.com/recipes/2011/06/dumplings-favorite-chow.html", "description": "If this was good enough for Dumpling, it's definitely good enough for your dog. (Dumpling had very fine taste. Wait, he actually just ate anything.)", "totalTime": "30 hour", "recipeYield": "One dog, for many meals", "recipeCategory": [], "recipeIngredient": ["1 stick butter", "1 pound carrots, cut into small dice", "1 pound celery, cut into small dice", "1 pounds green beans, squash, zucchini, or broccoli, cut into small pieces", "1 pound bag frozen, chopped spinach", "4 pounds 80/20 ground chuck (or high fat ground turkey, lamb, or pork)", "2 quarts low-sodium chicken broth or homemade chicken broth", "2 (28-ounce) cans chopped tomatoes", "3 cups instant oatmeal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a large saucepan or Dutch oven over medium-high heat. Add carrots, celery, and green beans, and cook, stirring constantly, until completely softened but not browned. Add spinach and cook, stirring frequently, until hot. Add beef, broth, and tomatoes, and cook, stirring vigorously with a whisk to break up any chunks of meat. Cook, stirring occasionally with a whisk until meat is no longer pink, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add oatmeal to mixture and cook, stirring constantly, until oatmeal has absorbed liquid and mixture has consistency of thick paste (you may need to thin it with some water). Transfer mixture into freezer-safe containers, allow to cool to room temperature, then freeze. Remove containers from freezer to defrost at least two days before needed.</p>"}]}