{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/cinnamon%20rolls%20unbaked.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["apple", "baking", "bread baking", "breads", "cinnamon rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Cinnamon Apple Sweet Rolls", "link": "https://www.seriouseats.com/recipes/2011/09/bread-baking-cinnamon-apple-sweet-rolls.html", "description": "The dough for these rolls isn't overly sweet. Too much sugar in a dough can result in a poor rise, so I kept the dough just slightly sweeter than usual. It was light, fluffy, and perfect for pulling off little bits to nibble on. The sweetness came from the sugar and cinnamon, while the apple added just a bit of tartness and interesting texture to the party. There were a few chewy caramelized bits of sugar around the outer edges of the rolls&mdash;a little bonus.", "totalTime": "3 hours 15 minutes", "recipeYield": "Makes 9 rolls", "recipeCategory": ["Apple", "Bread", "Bread Baking"], "recipeIngredient": ["1 teaspoon instant yeast", "2 1/2 cups (11 1/4 ounces) bread flour", "2 tablespoons plus 1/4 cup sugar, divided", "1 teaspoon salt", "7 tablespoons unsalted butter, divided", "1 teaspoon almond extract", "1 cup cold water", "1 apple (use an apple variety that's good for baking)", "1 tablespoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the yeast, flour, 2 tablespoons of sugar, 1 teaspoon of salt, 2 tablespoons of butter, 1 teaspoon of almond extract and 1 cup of cold water into your bread machine. (This is the order I filled mine, but I've noticed that the proper order depends on the machine. Follow your manufacturer's instructions) Set the bread machine to a knead-only setting. On this model, I used the kneading setting for pizza. If there's a long final rise on your machine, consider taking the dough out sooner (unless you're planning on baking right away). When the kneading is done, drizzle a small amount of olive oil into a zip-top bag and transfer the dough to the bag. Squeeze out the air and refrigerate the dough overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 1 tablespoon of butter in a small frying pan. Peel, core, and slice the apples thinly, and drop them into the frying pan. Cook, stirring as needed, until the apple is fork-tender. Transfer the apple to a storage container and refrigerate until needed. You can cook the apples the next day, but you want them to be fully chilled before you use them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready to assemble, take the remaining 4 tablespoons of butter of out of the refrigerator and let it come to room temperature. Spray a square Pyrex baking pan with baking spray (if you want a little extra insurance against sticking - or you can use a metal pan if you like, but I prefer the Pyrex for this.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn out the dough. Knead it briefly, then roll it out to a rectangle about 10 x 15 inches. With one of the long sides facing you, spread the softened butter on the dough starting at the edge closest to you and to within an inch or two of the far edge. It's fine if there are gaps and blobs of butter, as long as it's somewhat evenly distributed from side to side. Top the butter with the sugar, again leaving an inch or two at the far end uncovered. Do the same with the cinnamon. Again, it's fine if it's not perfectly even.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the apples from the refrigerator and place a row of them across the dough on the edge closest to you. Leave a gap of about two inches and place another row of apples. (this leaves space for making the first turn of the spiral. Depending on how thin your slices are, and how you arrange your apples, this might use them all up. If not, place another row right above the second row, and continue until all the apples are used up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting at the edge closest to you, begin rolling the dough up, jelly-roll style, until you reach the far end. Seal the seam. Arrange the log you've created so it's somewhat evenly thick from one end to the other. Slice the log into thirds, then slice each of those into thirds again, so you have 9 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pieces, spiral sides up, in the prepared pan. Press down on the rolls so they're all the same height. You don't want to mash them to death, just gently press down. It's fine if they're touching each other. Cover the pan with plastic wrap and set aside until doubled. Depending on how much your dough has warmed up, it might take as much as an hour to rise. It's better to let it rise fully than to bake it before it has time to get fluffy, so if it needs more time, be patient. About 20-30 minutes before the rolls have risen fully (or sooner, if you prefer) preheat the oven to 325 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the rolls have doubled in size and feel puffy when you touch them, remove the plastic wrap and bake them at 325 degrees until the are cooked through and nicely browned, about 45 minutes. There's likely to be some sugary goo on the bottom of the pan, so turn the rolls out and let them rest upside down first, before you flip them over to finish cooling.</p>"}]}