{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20111205-41-chocolate-cherry-cordials.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["candies", "cherry", "cherry cordials", "chocolate", "fondant"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Cherry Cordials", "link": "https://www.seriouseats.com/recipes/2011/12/how-to-make-chocolate-cherry-cordials-like-russell-stover-recipe.html", "description": "The cherries are soaked overnight in a few tablespoons of liquor. I used Jack Daniels because it's what I had on hand, but any liquor will work&mdash;try brandy or even Grand Marnier.", "totalTime": "2 days, 14 hours", "recipeYield": "makes 24", "recipeCategory": ["Cherry", "Chocolate", "Desserts"], "recipeIngredient": ["<strong>To soak the cherries:</strong>", "24 maraschino cherries with stems", "3 tablespoons bourbon or liquor of choice", "&nbsp;", "<strong>For the Fondant:</strong>", "1 cup granulated sugar", "1/3 cup water", "4 tablespoons liquid from maraschino cherry jar", "1 tablespoon light corn syrup", "&nbsp;", "<strong>To Dip the Cherries:</strong>", "8 ounces bittersweet chocolate, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cherries in small bowl with liquor. Cover and rest overnight, stirring occasionally. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cherries on paper towel lined pan to dry, standing each cherry upright. In small saucepan, combine sugar, water, cherry juice, and light corn syrup. Cook over medium heat, stirring to dissolve sugar. When mixture comes to boil, stop stirring and continue to cook until mixture registers 240&deg;F on instant read thermometer, occasionally brushing edge of pan with water to dissolve crystals.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour sugar syrup onto large marble slab or rimmed baking sheet set over a towel, and let cool until just barely warm, about 25 minutes. Using bench scraper, scrape syrup up and over itself. Continue this motion while moving mass of thickened syrup back and forth across pan. Syrup will begin to thicken as it cools. Use offset spatula to scrape syrup from bench scraper. Continue working fondant until mixture begins to turn from translucent to opaque, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to work mixture back and forth across marble until it begins to thicken considerably, to the point of becoming a thick paste, about 15 minutes more. Transfer fondant to small saucepan and set over low heat, stirring until just melted. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line baking sheet with parchment paper and set aside. Holding cherry by the stem, dip in fondant to coat, and set on prepared sheepan. Remelt fondant if it thickens before cherries are finished being dipped. Let fondant dry onto cherries, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate in heatproof bowl set over pan of barely simmering water. Stirring gently, heat until about half of chocolate is melted. Remove bowl from heat and continue to stir chocolate until completely melted. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One by one, dip fondant covered cherries in chocolate, covering completely and then allowing excess chocolate to drip from cherry. Set each cherry back on parchment lined sheetpan. Chill at least 48 hours before serving.</p>"}]}