{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110829-127677-LTE-OrangeCheesecake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cheesecakes", "desserts", "Let them eat cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange Blossom Cheesecake", "link": "https://www.seriouseats.com/recipes/2011/08/orange-blossom-cheesecake-cakes-recipe.html", "description": "This cheesecake, which is infamous in my family, was exclusively made on special occasions, and I would always request it on birthdays. It is rich and creamy, but lightened with the inclusion of egg whites beaten to stiff peaks. The crust was usually Galletas María crumbs and it was served plain--very understated but sumptuous.", "totalTime": "6 hours", "recipeYield": "10", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Candied Orange Slices:</strong>    ", "1 cup sugar", "1 cup water", "1/8 teaspoon salt", "1 orange, washed and cut into 1/4 inch-thick slices (See Notes)", "1 cinnamon stick", "   ", "<strong>For the Crust:</strong>    ", "2 1/2 cups graham cracker crumbs", "4 ounces (1 stick) unsalted butter, melted and slightly cooled", "1/3 cup packed light brown sugar", "1/4 teaspoon salt", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "   ", "<strong>For the Filling:</strong>   ", "4 large eggs, separated and at room temperature", "1/2 cup sugar", "16 ounces cream cheese, cut into small pieces and at room temperature", "3 tablespoons all-purpose flour", "1 tablespoon finely grated zest of 1 orange", "1 cup heavy cream", "1 tablespoon orange blossom water (See Notes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the candied orange slices:</strong> Line large baking sheet with wax or parchment paper; set aside.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, water, and salt in medium heavy-bottomed saucepan and bring to boil over medium-high heat, stirring until sugar dissolves. Add orange slices and cinnamon stick, reduce heat to medium-low and simmer, turning the slices occasionally, until rinds become soft and syrup begins to foam, 35 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange orange slices in single layer on prepared baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the crust:</strong> Adjust oven rack to middle position and preheat oven to 350°F.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cracker crumbs, melted butter, brown sugar, salt, cinnamon, and cloves in small bowl, stirring until crumbs are thoroughly saturated with butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press onto bottom and up sides of springform pan, leaving about 1/2 inch from top of pan. Line exterior of pan with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake crust until golden, 10 to 12 minutes. Transfer to cooling rack and cool completely, 15 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the filling:</strong> Decrease oven temperature to 275°F.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of standing mixer or large bowl, whip egg whites with whisk attachment on medium speed until soft peaks form, about 2 minutes. Gradually add sugar and continue whipping until stiff peaks form, 1 to 2 minutes longer. If you used the stand mixer bowl, transfer whites to separate bowl and wipe out bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With paddle attachment, beat cream cheese, egg yolks, flour, and orange zest on medium speed until light and fluffy, about 2 minutes. Add cream and orange blossom water and continue beating until creamy and smooth, about 2 minutes longer, scraping down sides and bottom of bowl with rubber spatula as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir 1/3 of egg whites into cream cheese mixture, then gently fold in remaining egg whites. Scrape batter into cooled crust and bake until cheesecake is set but still a bit wobbly in the center, 75 to 90 minutes. Shut oven off and let cheesecake sit in oven 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate cheesecake until completely chilled and set, at least 3 hours. Remove from springfrom mold and set on serving dish. Arrange orange slice on top of cake and drizzle with 2 to 3 tablespoons syrup. Serve, passing remaining syrup at table if desired.</p>"}]}