{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110227-127355-dinner-tonight-ground-sliced-flank-steak-sandwich.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "sandwich", "Simple Italian Snacks", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Flank Steak Panini with Goat Cheese and Caramelized Onions", "link": "https://www.seriouseats.com/recipes/2011/03/flank-steak-panini-with-goat-cheese-caramelized-onions-recipe.html", "description": "Steak sandwiches are a lot trickier to execute than it might initially seem. Though a great steak often needs little more than a nice sear and some salt and pepper, when you stuff that steak between two slices of bread, something strange happens. The meat often ends up both bland and tough, which is puzzling. In <strong><em><a href=\"http://www.amazon.com/dp/1298925956/?tag=serieats-20\">Simple Italian Snacks,</a></em> Jason Denton and Kathryn Kellinger</strong> get past this by cooking a flank steak until medium-rare, then slicing it thinly against the grain. It also helps that it's topped with an herby goat cheese and caramelized onions. This sandwich has flavor to spare.", "totalTime": "30 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Sandwiches"], "recipeIngredient": ["8 ounces fresh goat cheese", "1 tablespoon fresh mint, chopped", "1 tablespoon fresh basil, chopped", "1 tablespoon fresh thyme, chopped", "1 ½ pounds flank steak ", "salt and pepper", "2 tablespoons canola oil ", "2 sweet onions, cut into ½-inch slices ", "⅓ cup balsamic vinegar ", "8 slices crusty bread, (ciabatta works)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine goat cheese, mint, basil, and thyme in a medium-sized bowl. Stir together with a fork and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season both sides of flank steak with salt and pepper. Preheat a 10-inch cast iron pan over medium-high heat. Add one tablespoon of canola oil. When oil starts to smoke, add the flank steak. Cook until well browned on one side, three to four minutes, and then flip. Cook until browned on that side, three to four minutes, and then transfer to a cutting board and let it rest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium and add the rest of the oil and the onions. Stir well until onions are coated in oil, about one minute. Then season with about ¼ teaspoon of salt and pour in the balsamic vinegar. Cook over medium heat until onions are soft and caramelized, about 20 minutes. Turn off heat, and transfer onions to a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice the flank steak against the grain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out the eight slices of bread. Smear a little goat cheese on one side of each. Divide the meat between four slices of bread, and season with salt and pepper. Spoon a tablespoon or two of the caramelized onions on the steak. Top each with the remaining four slices of bread, making sure the goat cheese spread faces down. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a panini press to medium. Place the sandwich in and cook until sandwiches are well browned, about four minutes. Also, you could preheat a grill pan to medium. Places the sandwiches on top, and weigh them down with a heavy iron skillet. Cook them until well browned, about three minutes a side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the sandwiches in half and serve. </p>"}]}