{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111219-184483-peanut-butter-chocolate-shortbread-bars.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chocolate", "Cookies", "holiday cookies", "peanut butter", "shortbread cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Fine Cooking's Peanut Butter and Chocolate Shortbread Bars", "link": "https://www.seriouseats.com/recipes/2011/12/a-cookie-a-day-fine-cookings-peanut-butter-and-chocolate-shortbread-bars-holiday-baking.html", "description": "Like your favorite peanut butter cups&mdash;with an added layer of peanutty shortbread on the bottom.", "totalTime": "3 hours", "recipeYield": "makes 4 dozen 1 1/2-inch-square bars", "recipeCategory": ["Chocolate", "Cookies", "Nuts"], "recipeIngredient": ["<strong>For the peanut shortbread crust:</strong>", "7 ounces (14 tablespoons) unsalted butter, melted and cooled to just warm ", "1/2 cup granulated sugar  ", "1/2 teaspoon table salt", "9 1/2 ounces (2 cups plus 2 tablespoons) \u2028unbleached all-purpose flour", "1/2 cup unsalted peanuts, finely chopped ", " ", "<strong>For the peanut butter filling:</strong>", "1 cup creamy peanut butter (not natural but an emulsified variety such as Jif)", "3 ounces (6 tablespoons) unsalted butter, at room temperature", "6 ounces (1 1/2 cups) confectioners’ sugar", "1 teaspoon pure vanilla extract", " ", "<strong>For the ganache:</strong>", "5 ounces good-quality bittersweet chocolate, such as Lindt Excellence, chopped (about 1 heaping cup)", "1/2 cup plus 2 tablespoons heavy cream "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the peanut shortbread:</strong> Line a straight-sided 13x9-inch metal baking pan with foil, letting the ends create an overhanging edge for easy removal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir the butter, sugar, and salt. Stir in the flour and\u2028peanuts to make a stiff dough. Press the mixture evenly into the bottom of\u2028the prepared pan. Prick the dough all over with a fork. Refrigerate the pan for\u202830 minutes (or freeze for 5 to 7 minutes), until the dough is firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, position a rack in the center of the oven and heat the oven to 325&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the dough for 20 minutes, then reduce the oven temperature to 300&deg;F and bake until the crust is golden-brown all over and completely set, 20 to 25 more minutes. Let the crust cool completely before topping. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the peanut butter filling:</strong> Put the peanut butter and butter in the bowl of a stand mixer fitted with the paddle attachment (or in a large bowl for hand mixing) and beat on medium speed until smooth, about 1 minute. Add about half of the confectioners’ sugar to the mixer along with the vanilla and 1 Tbs. hot water. Beat on low speed until combined, then on medium speed until smooth and fluffy, about1 more minute. Beat in the remaining sugar and mix, about 1 more minute, until the mixture is smooth and thick, like frosting. If the filling seems too stiff, add another 1 Tbs. hot water and beat for another minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a knife or metal offset spatula, spread the filling over the fully cooled crust. The filling may not spread smoothly and evenly, but don’t worry; the ganache will cover it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the ganache:</strong> Put the chocolate in a small heatproof bowl. In a small saucepan, bring the heavy cream to a boil. Remove from the heat and pour over the chocolate. Let sit for 3 minutes. Stir gently with a rubber spatula until combined and smooth. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the ganache over the peanut butter filling with a metal offset spatula to coat evenly. Let the bar sit for at least 3 hours to allow the ganache to set before cutting (or refrigerate for 1 hour).<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully lift the bar from the pan using the foil sides and transfer them to a cutting board. Separate the foil from the bar by sliding a spatula between them. Cut into 1 1/2-inch-square bars. They will keep at room temperature for\u20281 week.</p>"}]}