{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111024-127355-dinner-tonight-saffron-basmati-fried-rice-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["apricots", "Dinner Tonight", "fried rice", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Saffron Fried Rice with Dried Apricots and Almonds", "link": "https://www.seriouseats.com/recipes/2011/10/saffron-fried-rice-with-dried-apricots-almonds-recipe.html", "description": "Susanna Foo in <em><a href=\"http://www.amazon.com/dp/B001218YVS/?tag=serieats-20\">Fresh Inspiration: New Approaches to Chinese Cuisine</a></em> admits that this is more of an \"Indian-style pilaf\" than a traditional fried rice recipe. Saffron, dried apricots, and toasted almonds are all used, giving the dish a really unique character. Sure, the rice is still sautéed with all the other ingredients, but that's about where similarities end.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Apricot", "Dinner Tonight", "Fried Rice"], "recipeIngredient": ["1/4 cup half-and-half ", "pinch of saffron threads", "3 tablespoons vegetable oil ", "2 tablespoons finely chopped shallots (from 1 to 2 shallots) ", "1 tablespoon finely chopped garlic (from about 2 garlic cloves)", "1/2 cup diced dried apricots ", "1 1/2 cups basmati rice, rinsed and drained", "1 teaspoon kosher salt", "2 large eggs, lightly beaten together in a small bowl ", "4 scallions, green parts only, chopped into 1/4-inch lengths", "freshly ground black pepper", "1/4 cup sliced almonds, toasted", "2 tablespoons chopped fresh parsley (chives or cilantro also work) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk into a small bowl and add the saffron. Place in the microwave and cook for 30 seconds. You can also warm the milk in a small saucepan over low heat for 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two tablespoons of the vegetable oil into a medium-sized saucepan set over medium-high heat. When oil is shimmering, add the shallots, garlic, and apricots. Cook, stirring often with a wooden spoon, until shallots are soft, about one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice and salt, stir well, and toast for a few seconds. Then pour in 1 1/2 cups water and the milk and saffron mixture. Bring to a boil. Stir well, cover the saucepan, and turn the heat to low. Cook until the rice has absorbed the liquid, 10 to 12 minutes. When done, turn off the heat, remove the cover, and fluff the rice with a fork, and then cover the pot again. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the rice has been fluffed, pour the remaining tablespoon of oil into a large wok or skillet set over medium heat. When warm, add the beaten eggs and swirl to cover the bottom. Stir occasionally with a spatula until you get small, firm lumps, one to two minutes. Add the chopped scallions, stir well, and cook for another minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice mixture to the eggs. Stir often with a wooden until everything is well mixed and the rice is hot, one to two minutes. Turn off the heat, season to taste with black pepper and salt, and add the toasted almonds and parsley. Serve immediately.   </p>"}]}