{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110421-127355-dinner-tonight-red-lentil-tofu-curry.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Asian", "curry", "Dinner Tonight", "lentils", "red lentils", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Red Lentil and Tofu Curry", "link": "https://www.seriouseats.com/recipes/2011/04/red-lentil-and-tofu-curry-recipe.html", "description": "Though I hate to admit this, I am a little frightened of cooking lentils. Sure, they look harmless enough, but they just have a tendency of not cooking for me. Instead, they remain little pebbles in the saucepan far past the recommend cooking time. But <strong>red lentils are the great exception.</strong> They only require 15 to 20 minutes to become tender, and they faithfully stick to that schedule.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Beans and Pulses", "Dinner Tonight", "Tofu", "Vegetarian"], "recipeIngredient": ["2 tablespoons olive oil, divided", "1 small onion, chopped ", "1 garlic clove, minced", "½-inch piece fresh ginger, peeled and minced", "½ cup red lentils, rinsed and drained", "3 cups water", "½ pound firm tofu, cut into ½-inch cubes", "1 teaspoon cumin seeds", "1 teaspoon curry powder", "¼ teaspoon cayenne pepper", "1 teaspoon salt ", "1 tablespoon fresh cilantro, chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour one tablespoon of the olive oil into a medium-sized saucepan set over medium heat. Add the onion and cook until translucent and soft, about five minutes. Toss in ginger and cook until fragrant, about one minute. Then add lentils and the water. Turn heat to high and bring to a boil. Then reduce heat to low, and simmer until the lentils are soft, 15 to 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, dry tofu cubes on some paper towels. Place a large wok over medium heat. Add the cumin and cook until very fragrant, about one minute. Transfer to a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the remaining one tablespoon of olive oil into the wok. When shimmering, add the tofu cubes. Stir-fry until lightly browned on most sides, about four minutes. Add the curry powder, cayenne pepper, and salt. Cook until very fragrant, one to two minutes, and then transfer contents to saucepan with lentils. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the lentils and tofu cook over medium heat for five minutes. Serve curry with rice and garnish with cilantro. </p>"}]}