{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111129-bone-broth-recipe-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["broths", "Nasty Bits", "sichuan", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bone Broth and Dipping Sauce", "link": "https://www.seriouseats.com/recipes/2011/11/bone-broth-and-dipping-sauce-recipe.html", "description": "[Photograph: Chichi Wang]...", "totalTime": "about 3 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Soups and Stews", "The Nasty Bits"], "recipeIngredient": ["2 pounds soup bones, from the neck, tail, shin, or shoulder", "1/2 cup rice wine", "one 2-inch section of ginger, cut into thirds", "Salt to taste, a few tablespoons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To bleed the meat: Rinse all the meat under cold running water and place in the pot.  Add enough water to cover the meat by a few inches.  Place the pot over medium heat and cook until just about to boil, then quickly pour all the meat into a colander and pour out all the water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the pot again with water to cover by a few inches.  Place the pot over medium heat and bring to a simmer.  Add the wine, ginger, and salt.  Turn the heat to low and simmer until very tender, at least 2.5 hours.  Skim off whatever scum rises to the top.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dipping sauce: Toast the chili peppers and sichuan peppercorns, separately, in a heavy-bottomed skillet until both are fragrant, 10 to 20 seconds.  Remove and let cool.  Grind to a medium to fine consistency in a mortar and pestle and place in a ceramic bowl or glass jar.   In a small saucepan, heat the oil until it's warm but not close to smoking.  Pour the oil over the roasted and ground spices, and add salt to taste.  Oil prepared in this way can be kept in the cabinets for weeks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>De-fat the broth, either by skimming the fat from the top or by waiting for the soup to solidify overnight before removing the sheet of fat.   Serve the soup with noodles and simmered vegetables, if desired, and dipping sauce on the side.</p>"}]}