{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111129milanobite610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "chocolate", "Cookies", "ganache", "holiday cookies", "milanos", "Pepperidge Farm", "sandwich cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Milanos", "link": "https://www.seriouseats.com/recipes/2011/12/copycat-pepperidge-farm-milanos-recipe.html", "description": "To make mint or orange Milanos, just substitute the extract of choice for the vanilla in the ganache.", "totalTime": "45 minutes", "recipeYield": "makes 30, 2\" sandwich cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["3/4 ounce cornstarch", "8 ounces flour", "4 ounces butter", "3 1/2 ounces sugar", "2 ounces corn syrup", "1/4 teaspoon baking soda", "1/4 teaspoon salt", "1/4 ounce powdered milk", "1 egg", "2 egg whites", "Optional: 1 teaspoon vanilla bean paste or a teaspoon of any extract ", "&nbsp;", "<strong>Ganache filling:</strong>", "4 ounces dark or milk chocolate ", "2 ounces cream, a pinch more if necessary", "1 teaspoon vanilla extract (or other flavor of your choice)", "a pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cookie batter:</p>\n\n<p>Preheat the oven to 300&deg; and line two cookie sheets with parchment and set aside.</p>\n\n<p>Use a sieve to sift the cornstarch and flour together. </p>\n\n<p>With a hand or stand mixer (fitted with a paddle attachment), cream together the butter, sugar, corn syrup, baking soda, salt, powdered milk and flavorings (if using). Cream for about 5 minutes on medium speed, until light and fluffy. About halfway through the mixing, scrape the bowl down with a rubber spatula.</p>\n\n<p>After 5 minutes, with the mixer still running, add the whole egg and mix until fully incorporated.</p>\n\n<p>Turn the mixer to low and add in half the starch/flour mixture. After it has incorporated, add one egg white. Repeat with the remaining flour and egg white. Continue mixing until homogenous; shut off the mixer.</p>\n\n<p>Use a rubber spatula to transfer the batter to a piping bag, fitted with a 1/2\" plain tip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pipe and bake the cookies:</p>\n\n<p>Pipe a smidgen of cookie dough onto all four corners of both sheets of parchment. Then flip the parchment over so the doughy corners are directly touching the cookie sheet. Use your fingers to smooth the parchment down. Now the parchment is \"glued\" to the cookie sheet and won't slide around while you pipe.</p>\n\n<p>Aim to pipe the cookies 30 to a tray, in five rows of six. Pipe the cookies a little more than a half inch wide and 2\" long. To pipe, hold the pastry bag so that the tip is perpendicular to the tray and only about an 1/8\" from the surface. Really, you are aiming to smear the dough out rather than pipe it out. </p>\n\n<p>Squeeze the bag to begin piping and as soon as the dough has hit the surface of the tray, immediately drag the tip two inches to the right (left if you are left handed). Stop piping and bring the tip back slightly toward the center of the cookie. Lift the tip straight up. This will give each cookie an oval shape with a roughly barbell like swelling at each end, and a peak of dough at one end. </p>\n\n<p>Of course, you can pipe the cookies into any shape you like. Just take care that they are all roughly the same size so they will sandwich together nicely. </p>\n\n<p>If you're a perfectionist and unhappy with your piping job, you can use a rubber spatula to scrape the dough back up and into the bag. Give yourself a fresh sheet of parchment and start again.</p>\n\n<p>Bake for 25 minutes, rotating the trays halfway through, or until the cookies have just taken on the slightest golden color around the edges but are otherwise quite anemic. If you notice the cookies beginning to brown early, your oven may be running a little hot and your cookies will finish sooner.</p>\n\n<p>Remove the cookies from the oven and set aside, still on the cookie sheets, until thoroughly cooled.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the ganache:</p>\n\n<p>In a very small pot, bring the cream to a simmer. Shut off the heat and add the chocolate, vanilla (or other flavor) and salt. Use a whisk to stir gently, until the chocolate melts. Whisk more vigorously to bring the ganache together. </p>\n\n<p>If the mixture seems slightly curdled or lumpy, drizzle in a little extra cream, one Tablespoonful at a time. Whisk all the while, until the ganache is smooth.</p>\n\n<p>Use a spatula to transfer the ganache to a piping bag fit with a 1/4\" plain tip. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Filling and finishing the cookies:</p>\n\n<p>Begin matching up the cookies into pairs that fit, bottom to bottom, together nicely. Don't worry if they don't match up closely, you just want to make sure you pair the biggest cookie and the smallest cookies together so there's no huge discrepancy between pairs.</p>\n\n<p>Arrange half of the cookies bottoms up, with their mate sitting right beside, bottoms down.</p>\n\n<p>Pipe a 1\" strip of ganache down the center of each bottoms-up cookie (stopping a little shy of each end). Top each ganache covered cookie with its mate, using your fingers to gently press the cookies together and to push the ganache out until its flush with the edges.</p>\n\n<p>Repeat until all cookies have been sandwiched. Place the cookies in the fridge and chill for 10 minutes. Once the cookies have chilled, transfer them to an airtight container, placing a sheet of parchment paper between layers.</p>\n\n<p>Store at room temperature for one week, or two weeks refrigerated.<br />\n</p>"}]}