{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20111113-preserved-cranberry-orange-jam-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cranberries", "orange", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Orange Jam with Crystallized Ginger", "link": "https://www.seriouseats.com/recipes/2011/11/cranberry-orange-jam-with-crystallized-ginger-recipe.html", "description": "What I like best about this jam is that tastes a lot like orange marmalade, but it only takes a fraction of the work to make. The secret is to pulse whole unpeeled oranges into a pulp in the food processor. To make it even more festive, I added a cinnamon stick and a generous handful of chopped crystallized ginger.", "totalTime": "1 1/2 hours", "recipeYield": "Makes 6 half-pint jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Cranberry", "Ginger", "Orange"], "recipeIngredient": ["2 medium thin-skinned juice oranges", "3 cups cranberries", "1 cinnamon stick", "One (1.75-ounce) package regular fruit pectin", "1/2 teaspoon unsalted butter", "4 1/2 cups sugar", "1/2 cup chopped crystallized ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are going to preserve the jam, prepare the jars and lids: place six half-pint jars on a rack in a large pot. Add enough water to cover the jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow the jars to rest in the hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until the water is simmering, then remove the pan from heat and allow the bands and lids to rest in hot water until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the oranges into quarters (leave the peels on) and remove the seeds. Transfer the oranges to a food processor and pulse until coarsely chopped. Transfer the orange pulp to a large, heavy-bottomed pot. Pulse the cranberries in the food processor until coarsely chopped. Add them to the pot with the oranges. Add 2 cups water and the cinnamon stick and bring to a boil. Reduce heat and simmer until the cranberries and orange peels have softened, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the pectin over the cranberry mixture and stir to combine. Stir in the butter. Return the mixture to a boil. Add the sugar all at once and return to a boil. Boil hard for one minute. Remove the pot from the heat. Remove and discard the cinnamon stick. Stir in the crystallized ginger. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for five minutes. Remove jars from pot and allow them to rest undisturbed on countertop for six hours or overnight. </p>"}]}