{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110401-144989-yucatan-style-slow-roased-pork.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Joe Yonan", "pork", "pork shoulder", "Serve Yourself"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Yucatan-Style Slow-Roasted Pork", "link": "https://www.seriouseats.com/recipes/2011/04/yucatan-style-slow-roasted-pork-recipe.html", "description": "Once your pork is roasted, it can be portioned out and incorporated into all sorts of easy weeknight meals.  It makes a killer pulled pork sandwich (even better when topped with some slaw), incredible tacos (especially with some quickly pickled onions), or on its own with rice and beans. You could even make a \"faux-lognese\" sauce, by cooking it down with carrots, celery, shallots, white wine, and crushed tomatoes.", "totalTime": "4 to 5 hours", "recipeYield": "makes 4 to 5 cups, or 6 to 8 servings", "recipeCategory": ["Cook the Book", "Pork"], "recipeIngredient": ["3 tablespoons annatto seeds", "3 tablespoons whole black peppercorns  ", "1 tablespoon toasted cumin seeds", "3/4 cup peeled garlic cloves", "3/4 cup lightly packed fresh cilantro leaves and stems", "1 1/2 tablespoons kosher or coarse sea salt", "1 seedless orange, peeled and cut into large chunks", "1/4 cup beer of any type", "2 teaspoons red pepper flakes", "1 teaspoon ground allspice", "1 teaspoon pimenton (smoked Spanish paprika)", "1 teaspoon ground ancho chile", "3 pounds fresh pork shoulder (Boston butt or picnic shoulder) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 275°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spice grinder (such as a coffee grinder reserved for spices), grind the annatto seeds, peppercorns, and cumin seeds to a fine powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine the garlic cloves, cilantro, and salt and process until finely chopped. Add the orange, beer, red pepper flakes, allspice, pimenton, ground ancho, and the ground annatto mixture and process until a fairly smooth paste forms. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a 2-foot sheet of aluminum foil on your work surface. Set the pork in the middle of it. Spread the spicy paste over the pork, coating it on all sides, then tightly roll up the pork inside the foil, tucking in the sides as you go, as if you’re making a burrito. Use another long strip of foil to create another layer, being sure to seal the pork tightly inside the foil.  Place the pork packet in a roasting pan, fill it with water to come a couple of inches up the side of the foil-wrapped pork, then use another piece of aluminum foil to cover and seal the whole pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the pork until you can feel it falling apart inside its package if you push on it, and a skewer inserted through the top of the foil and into the meat encounters no resistance, 4 to 5 hours. (If you’re not sure, err on the side of longer cooking; you really can’t overcook this.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the roast in its foil from the pan, transfer to a platter, and let it cool for at least 30 minutes before slashing open the foil. Discard any large pieces of fat, and use two forks to shred the meat. Combine the meat with enough of the sauce created from the spices and pan drippings so that it is very juicy but not swimming, reserving the rest of this sauce for other uses, such as spooning onto pan-fried pork chops or adding extra moisture to a pulled pork sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat one serving of the meat however you like (with tortillas, pickled onions, and sour cream is a good bet) while letting the rest cool to room temperature. Refrigerate the leftovers for up to 1 week or divide into 4 to 6 portions, seal in heavy-duty plastic freezer bags, removing as much air as possible, and freeze for up to 6 months.</p>"}]}