{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110727-163253-recipe-creamsicle-pie-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["graham cracker crust", "oats", "pie crust"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "Oat Crumble Crust", "link": "https://www.seriouseats.com/recipes/2011/08/oat-crumble-crust-recipe.html", "description": "I often use this recipe as an alternative to a graham cracker crust. It's very crumbly, tastes like a buttery oatmeal cookie, and has a nice salty and sweet thing going on which is a great contrast to most sweet fillings. Use it whenever recipes call for a graham cracker crust.", "totalTime": "1 hour", "recipeYield": "8", "recipeCategory": ["Desserts", "Other Grains", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["3 cups rolled oats", "1 teaspoon salt", "1/2 cup all-purpose flour", "8 ounces butter, softened", "1 cup packed light brown sugar", "3 tablespoons melted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg; F. Combine rolled oats, salt, and flour in the bowl of a food processor. Grind the mixture until the oats are broken into small pieces, about 20 seconds. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cream 8 ounces butter and brown sugar in a stand mixer with a paddle attachment or with an electric beater until light and fluffy, about 4 minutes. Add the dry ingredients and mix on low until blended. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the mixture in an even layer over a parchment lined sheet tray, stopping 1 inch before the edges. Bake for 10 minutes, rotating halfway through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 10 minutes, remove the pan from the oven. Break up the mixture using a spatula, stirring it up so the golden brown exterior and the lighter interior are mixed. Re-spread the mixture evenly over the sheet tray, and return to the oven for an additional 10 minutes, rotating halfway through, until the top is golden brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the pan to cool. Break up the crust into pieces and place them in the bowl of a food processor and process until homogeneous and mealy. Slowly pour 3 tablespoons of melted butter into the food processor through the top feeder tube as it's running. The mixture will feel slightly damp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into a pie plate and press the crust into shape on the edges and bottom. Chill for 20 minutes before filling.</p>"}]}