{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110210-137058-onion-panade.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bread pudding", "Cook the Book", "Faith Durand", "greens", "Not Your Mother's Casseroles", "stale bread", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Bread and Onion Panade with Spicy Greens", "link": "https://www.seriouseats.com/recipes/2011/02/bread-and-onion-panade-with-spicy-greens-recipe.html", "description": "This <strong>Bread and Onion Panade with Spicy Greens</strong> from <a href=\"http://www.faithdurand.com/\">Faith Durand</a>'s <a href=\"http://www.amazon.com/Your-Mothers-Casseroles-Faith-Durand/dp/1558324844/serieats-20\"><em><strong>Not Your Mother's Casseroles</strong></em></a> takes crisp cubes of sour dough and layers them with sticky sweet caramelized onions, bitter spicy greens, and nutty shredded gruyère.  Once the casserole is assembled it's doused with warm chicken stock and baked until the top is bubbly brown, and the greens on the surface are just short of charred.", "totalTime": "65 to 75 minutes", "recipeYield": "8", "recipeCategory": ["Bread Pudding", "Cook the Book", "Sides", "Vegetarian"], "recipeIngredient": ["3/4 pound good-quality sourdough bread, cut into 2-inch cubes", "2 tablespoons unsalted butter ", "1 1/2 pounds onions, sliced into thin half-moons ", "Salt", "4 cloves garlic, minced", "1/2 pound mustard greens, broccoli rabe, or Swiss chard, cut into fine ribbons", "Freshly ground black pepper", "1 cup grated Parmesan or Gruyère cheese ", "4 cups low-sodium chicken or vegetable broth ", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and lightly grease the baking dish or Dutch oven with olive oil or butter. Spread the bread cubes on a large baking sheet and toast for 45 minutes in the oven while preparing the rest of the ingredients.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter in a deep, heavy skillet over medium heat. When the butter foams up, add the onions and sprinkle them lightly with salt. Cook over low heat for about 25 minutes, stirring occasionally. When they are soft, turn up the heat a notch or two and cook them for another 5 to 10 minutes or until they are golden brown. Stir frequently to keep them from burning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn down the heat and add the garlic. Cook for 5 minutes or until golden and fragrant. Add the greens and cook, stirring frequently. Sprinkle the greens with salt and pepper as they cook. When they are wilted and soft, take them off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer half of the toasted bread cubes in the bottom of the prepared dish. Spread half of the greens mixture over the bread cubes and pack it down into the gaps between the bread. Sprinkle with about half of the cheese. Make another layer of the remaining bread cubes and remaining greens. Cover with the remaining cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the broth to a simmer in a small saucepan and carefully pour it into the baking dish. The bread and greens will look rather drowned and soupy; this is correct. Drizzle the top with olive oil. (At this point the panade may be covered and refrigerated for up to 24 hours.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and bake for 45 minutes, then uncover the dish and bake for another 20 to 30 minutes, or until the top is golden brown and crisp. Let stand for at least 10 minutes before serving hot.<br />\r\n</p>"}]}