{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110228-140054-chicken-in-porchettata.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Bird in the Oven and Then Some", "chicken", "Cook the Book", "Mindy Fox", "porchetta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Roast Chicken in Porchettata", "link": "https://www.seriouseats.com/recipes/2011/02/roast-chicken-in-porchettata-porchetta-recipe.html", "description": "This recipe for <strong>Roast Chicken in Porchettata</strong> or \"chicken in the style of porchetta\" from <a href=\"http://www.ediblemanhattan.com/20101103/how-a-cookbook-author-gleaned-inspiration-from-new-york's-flavors/\">Mindy Fox</a>'s <strong><em><a href=\"http://www.amazon.com/Bird-Oven-Then-Some-Delectable/dp/1906868336/serieats-20\">A Bird in the Oven and Then Some</a></em></strong> was inspired by chef <strong>Sara Jenkins,</strong> proprietor of New York's <a href=\"http://www.porchettanyc.com/\">Porchetta</a>, a restaurant specializing in what else?  Porchetta. It's pretty genius&mdash;a perfectly roasted chicken meets the gorgeous Italian herbs that go into the roast pork dish.", "totalTime": null, "recipeYield": "4", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["1 (4-pound) whole chicken", "4 tablespoons unsalted butter, at room temperature", "3 large garlic cloves, finely chopped", "1 1/2 tablespoons finely chopped fresh sage", "1 tablespoon wild fennel pollen", "1 tablespoon finely chopped rosemary leaves", "1 tablespoon finely chopped thyme leaves", "Flakey coarse sea salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the 450°F with the rack in the middle. Pull off the excess fat around the cavity of the chicken, then rinse and pat dry very well, inside and out. From the edge of the cavity, slip a finger under the skin of each breast, then gently but thoroughly use your fingers to loosen the skin from the meat of the breasts and thighs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, mix the butter, garlic, sage, fennel pollen, rosemary and thyme together well.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands and working with about 1 tablespoon of the butter mixture at a time, gently push the mixture into the spaces you created between the chicken skin and meat, being careful not to tear the skin. As you work the mixture in, gently rub your hand over the outside of the skin to smooth out the mixture and push it further down between the skin and meat where you may not be able to reach with your hand. Tie the legs together with kitchen string. Season the chicken all over the outside, using 1 tablespoon of salt and generous pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a roasting pan (not non-stick) or 9x13-inch baking dish in the oven to heat for 10 minutes. Remove from the oven and immediately put the chicken into the tin, breast-side up. Roast for 35 minutes, then rotate the tin and reduce the heat to 375°F. Continue roasting, basting with the juices occasionally, for a further 25–35 minutes until the juices run clear when a thigh is pierced with a fork, or an instant-read thermometer inserted into the thickest part of the thigh reads165°F. Remove the bird from the oven and leave to rest in the tin for 15 minutes, then baste with the juices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chicken to a chopping board; carve and serve with the pan juices and extra salt for sprinkling.</p>"}]}