{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110218-pueblo-slopper-chili.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["AHT", "chili", "green chili", "pork", "The Burger Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pueblo Green Chili", "link": "https://www.seriouseats.com/recipes/2011/02/pueblo-green-chili-recipe-for-slopper-burgers-colorado.html", "description": "This chili goes on anything&mdash;especially whole cheeseburgers to make Pueblo Sloppers. Place a cheeseburger, bun and all into a bowl. Top with a handful of shredded cheese and pout a couple ladles of green chili on top. Note: the chili...", "totalTime": "3 hours", "recipeYield": "Makes about 2 quarts", "recipeCategory": ["Chili", "Pork", "Pressure Cooker", "The Burger Lab"], "recipeIngredient": ["8 Mira Sol chilis (or 2 poblanos and 4 cubanelles)", "1 jalapeño, finely chopped", "2 tablespoons raisins", "1 (28-ounce) can whole tomatoes packed in juice", "4 tablespoons vegetable oil", "1 large onion, finely diced (about 1 1/2 cups)", "5 medium cloves garlic, grated on a microplane grater", "2 teaspoons dried oregano", "1 1/2 quarts chicken stock", "1 pound pork shoulder or sirloin, cut into 1/2-inch chunks", "3 tablespoons all-purpose flour", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast chilis directly over a gas burner set on high heat until well charred on all sides (about 10 minutes total). Transfer to a paper bag, tightly seal the top, and let rest for 10 minutes. Alternatively, char the chilis under a preheated broiler until charred on all sides, about 15 minutes total. Peel the skins off the chilis and chop into 1/2- to 1/4-inch pieces. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cover raisins with hot water in a small microwave-safe bowl Microwave on high heat for 1 minute, then let raising steep until fully softened, about 5 minutes. Blend soaked raisins and tomatoes with a hand blender or in a standing blender until nearly smooth. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in pressure cooker (see note) over medium-high heat until shimmering. Add onions and cook, stirring occasionally softened, about 4 minutes. Add garlic and oregano and cook, stirring frequently until fragrant, about 1 minute. Add peppers, tomato mixture, chicken stock, and pork. Seal pressure cooker and cook at high pressure for 15 minutes. Release pressure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid from pressure cooker and continue to cook without lid until liquid is reduced to half, about 30 minutes. Meanwhile, heat remaining 3 tablespoons oil and flour in a small saucepan over medium heat. Cook, stirring constantly until light blond in color, about 3 minutes. Slowly whisk flour mixture into simmering chili. Continue to cook until desired texture is reached. Season to taste with salt. Cooked chili will keep in a sealed container in the refrigerator for up to 1 week.</p>"}]}