{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110727-127355-dinner-tonight-blt-animal-style.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["blt", "In-N-Out", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: BLT, Animal-Style", "link": "https://www.seriouseats.com/recipes/2011/07/blt-animal-style-sandwich-recipe.html", "description": "I've made Kenji's astonishing replica of <a href=\"http://www.seriouseats.com/recipes/2010/07/in-n-outs-double-double-animal-style-burger-recipe.html\">In-N-Out's Double-Double, Animal-Style</a> so many times now that I can almost make it in my sleep. The burger already has lettuce and tomato, so what would happen if I got rid of the cheese, doubled the amount of tomato, and replaced the beef with bacon?", "totalTime": "1 hour", "recipeYield": "4 people", "recipeCategory": ["Bacon", "Dinner Tonight", "Sandwiches"], "recipeIngredient": ["1 large onion, finely chopped (about 1 1/2 cups)", "Kosher salt", "2 tablespoons plus 2 teaspoons mayonnaise", "1 tablespoon ketchup", "2 teaspoons sweet pickle relish", "1/2 teaspoon sugar", "1/2 teaspoon distilled white vinegar", "4 slices thick-cut bacon", "8 slices of toast ", "8 thin dill pickle slices, or 16 dill pickles chips", "8 quarter-inch-thick slices ripe tomato (about two tomatoes)", "4 leaves lettuce, preferably iceberg, though red leaf will work ", "1/4 cup yellow mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the onions, I'll just quote Kenji's original article: \"Heat 1 teaspoon oil in a 10-inch non-stick skillet over medium-high heat until shimmering. Add onions and 1/2 teaspoon salt to skillet. Reduce heat to medium low, and cook, tossing and stirring occasionally until onions are well browned, about 15 minutes. Once onions begin to sizzle heavily and appear dry, add 1 tablespoon water to skillet and stir. Continue cooking until water evaporates and onions start sizzling again. Repeat process, adding 1 tablespoon of water with each iteration until onions are meltingly soft and dark brown, about 3 times total. Transfer to a small bowl and set aside.\" </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the onions are cooking, make the sauce. Combine mayonnaise, ketchup, relish, sugar, and vinegar in small bowl. Stir to combine, and then set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bacon in a cold 10-inch iron skillet. Turn heat to medium, and cook until crispy, flipping occasionally with a pair of tongs. Remove bacon and drain on paper towels. Spread one tablespoon of mustard on each slice, and then break each in half. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear one-quarter of the sauce on top of four slices of toast. Top each with two pickle slices (or four pickle chips), two slices of tomato, one piece of lettuce, two half slices of bacon, one-quarter of the caramelized onions, and, finally, another piece of toast. Serve immediately. </p>"}]}