{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110825-167776-sweet-corn-and-black-raspberry-ice-cream.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["corn", "ice cream", "Jeni's Splendid Ice Creams at Home", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet Corn and Black Raspberry Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/08/sweet-corn-and-black-raspberry-ice-cream-recipe.html", "description": "Corn might not be up there with chocolate and vanilla in the upper echelon of ice cream flavors, but its subtle sweetness makes for one fantastically summery scoop.", "totalTime": "1 hour", "recipeYield": "1 quart", "recipeCategory": ["Bake the Book", "Corn", "Ice Cream and Frozen Treats", "Raspberry"], "recipeIngredient": ["1 ear sweet corn, husked", "2 cups whole milk", "1 tablespoon plus 1 teaspoon cornstarch ", "1 1/2 ounces (3 tablespoons) cream cheese, softened", "1/4 teaspoon fine sea salt", "1 1/4 cups heavy cream", "2/3 cup sugar", "2 tablespoons light corn syrup", "Black Raspberry Sauce (recipe follows) ", " ", "<strong>Black Raspberry Sauce</strong>", "2 cups black raspberries", "1 cup sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Black Raspberry Sauce:</strong> Combine the berries and sugar in a small saucepan and bring to a boil over medium-high heat. Continue boiling, stirring occasionally, until it reaches 220°F (5 to 8 minutes). Let cool slightly, then force through a sieve to remove the seeds. (Or leave a few seeds in there just to prove you made it.) Refrigerate until cold before using.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Sweet Corn Ice Cream:</strong> Slice the kernels from the corn cob, then “milk” the cob by scraping it with the back of your knife to extract the liquid; reserve the kernels and liquid. Mix about 2 tablespoons of the milk with the cornstarch in a small bowl to make a smooth slurry. Whisk the cream cheese and salt in a medium bowl until smooth. Fill a large bowl with ice and water.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the remaining milk, the cream, sugar, corn and juices, and corn syrup in a 4-quart saucepan, bring to a rolling boil over medium-high heat, and boil for 4 minutes. Remove from the heat and force the mixture through a sieve into a bowl, leaving the corn “cases” behind. Return the mixture to the saucepan and gradually whisk in the cornstarch slurry. Bring back to a boil over medium-high heat and cook, stirring with a heatproof spatula, until slightly thickened, about 1 minute. Remove from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually whisk the hot milk mixture into the cream cheese until smooth. Pour the mixture into a 1-gallon Ziploc freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the ice cream base into the frozen canister and spin until thick and creamy. Pack the ice cream into a storage container, alternating it with layers of the black raspberry sauce and ending with a spoonful of sauce; do not mix. Press a sheet of parchment directly against the surface, and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours.</p>"}]}