{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110816-166390-eggplant-tomatoes-harissa.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["eggplant", "harissa", "sides", "Spice Hunting", "spices", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Charred Eggplant and Tomatoes with Harissa and Mint", "link": "https://www.seriouseats.com/recipes/2011/08/charred-eggplant-and-tomatoes-with-harissa-mint-recipe.html", "description": "Young, firm eggplants are the best for this dish. Cook them just till they char and become tender, any longer and they will turn mushy. After a few seconds, they will absorb all the oil in the pan; they will cook just fine without the need for more.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Eggplant", "Sides", "Tomato", "Vegetarian"], "recipeIngredient": ["6 tablespoons olive oil, divided", "1 1/2 pounds eggplant, diced into 1-inch cubes", "1 pound fresh tomatoes, large dice (small tomatoes can be halved)", "4 cloves garlic, sliced", "Harissa, to taste, plus more for the table", "Lemon juice, to taste", "1/2 to 2/4 cup roughly chopped mint leaves, loosely packed", "Extra virgin olive oil for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast iron skillet on very high heat until it smokes. Add 4 tablespoons oil and wait till it shimmers, then add eggplant. Stir to coat with oil and cook until lightly charred and tender but toothsome, stirring occasionally. Remove from skillet to a bowl or plate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let skillet heat again until smoking, then add remaining two tablespoons oil and let shimmer. Add tomatoes and a fat pinch of salt, stirring occasionally until softened, juicy, and lightly charred. Add garlic, 1 to 1 1/2 teaspoons harissa (more if you like), and cooked eggplant to skillet. Toss and cook for one minute, then remove skillet from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add lemon juice, mint, and a glug of extra virgin olive oil. Toss, add salt to taste, and serve immediately, with extra harissa at the table.</p>"}]}