{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110801-127677-Serious-Sweets-Green-Tomato-Cake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cakes", "desserts", "green tomatoes", "layer cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Green Tomato Cake", "link": "https://www.seriouseats.com/recipes/2011/08/let-them-eat-green-tomato-cake-recipe.html", "description": "This cake is extremely moist and the frosting quite soft. I like to frost the cake and refrigerate it for 1 to 2 hours for neater slicing; I also happen to think it tastes better chilled.", "totalTime": "3 hours", "recipeYield": "8 to 10", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Cake:</strong>    ", "Baking spray", "2 cups all-purpose flour", "2 teaspoons baking soda", "2 teaspoons ground cinnamon", "1 1/2 teaspoons ground allspice", "1 teaspoon salt", "1/2 teaspoon ground nutmeg", "1 1/3 cups vegetable oil", "2 cups sugar", "4 large eggs", "3 cups finely chopped green tomatoes  (see notes)", "&nbsp;  ", " <strong>For the Frosting:</strong>    ", "4 ounces (1 stick) unsalted butter, cut into 8 pieces", "16 ounces cream cheese, at room temperature", "1/2 cup sour cream", "1 teaspoon pure vanilla extract", "1/4 teaspoon salt", "16 ounces confectioners’ sugar", "1 cup toasted walnuts, chopped", "1/2 cup raisins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the cake, adjust oven rack to middle position and preheat oven to 325°F. Lightly coat cake pans with baking spray. Line bottoms of cake pans with parchment paper rounds and coat lightly with baking spray once again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, baking soda, cinnamon, allspice, salt, and nutmeg in medium bowl or on large sheet of parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, beat oil and sugar on medium speed until fully incorporated, about 2 minutes. Add eggs, one at a time, beating well after each addition. Add tomatoes and beat just until incorporated, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decrease mixer speed to low and gradually add flour mixture to green tomato mixture. Mix just until combined, scraping down sides and bottom of bowl as necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter equally between baking pans and bake until a toothpick inserted in the center of cakes comes out clean, 45 to 60 minutes. Transfer cakes to cooling racks and cool in pans for 15 minutes. Invert cakes directly onto racks. Peel off and discard parchment lining and cool completely, about 90 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in medium stainless steel saucepan or skillet, melt butter over medium heat until beginning to foam, 3 to 4 minutes. Swirl the pan gently from time to time and continue cooking until foam subsides and solids beginning to brown at bottom of skillet, 2 to 3 minutes longer. Remove from heat and transfer to bowl. Cool to room temperature, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the frosting: </strong>Using whisk attachment, whip cream cheese, sour cream, butter, salt, and vanilla on medium speed until light and fluffy, about 2 minutes. Reduce speed to low, add confectioners’ sugar, and whip until incorporated, scraping bottom and sides of bowl with rubber spatula as needed, 30 to 60 seconds. Increase speed to medium-high and continue to whip until frosting is light and fluffy, 2 to 3 minutes. Stir in walnuts and raisins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble: </strong> Place one cake round on serving dish or cake stand and spread with about 2 cups frosting. Top with second cake round and frost sides and top of cake. (See Notes). Serve. </p>"}]}