{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110925-127355-dinner-tonight-chinese-ratatouille.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Dinner Tonight", "eggplants", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Chinese-Style Ratatouille", "link": "https://www.seriouseats.com/recipes/2011/09/chinese-style-ratatouille-recipe.html", "description": "I fell in love with this recipe the moment I first uncovered it in <strong>Susanna Foo's <em><a href=\"http://www.amazon.com/dp/0618393307/?tag=serieats-20\">Fresh Inspirations</a></em>.</strong> There is obviously nothing wrong with the traditional version of ratatouille but the idea of tweaking it, especially by adding chiles, appealed to me for some reason. The vegetables come out intensely flavored and dynamic. You could cut the amount of oil in half, but I'm not sure it would taste as good. Either way, paired with some rice, this a perfect way to say goodbye to the summer produce.", "totalTime": "1 hour", "recipeYield": "6 to 8 as a main course, 12 people as a side dish", "recipeCategory": ["Chinese", "Dinner Tonight", "Stir Frying", "Vegetables", "Vegetarian"], "recipeIngredient": ["1 1/4 pounds Chinese eggplants (about four large ones)", "Kosher salt", "1 pound plum tomatoes, peeled and cored, cut into ½-inch thick slices  ", "1 cup extra-virgin olive oil, divided ", "1 large onion, quartered and thinly sliced crosswise ", "6 large garlic cloves, thinly sliced", "4 jalapeños, stemmed and thinly sliced", "1 large red bell pepper, cored, seeds and veins removed, chopped into 1-inch pieces", "1 1/2 pounds zucchini, trimmed, cut in half lengthwise, and sliced crosswise into 1/4-inch pieces", "Black pepper ", "1 tablespoon sugar", "1 tablespoon soy sauce", "1 tablespoon red wine vinegar", "1 bunch scallions, trimmed and cut into 1-inch pieces", "1/2 cup fresh cilantro leaves, chopped", "15 fresh basil leaves, julienned "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each eggplant in half lengthwise, and then cut into ½-inch thick slices. Pour four cups of water into a medium-sized bowl, and whisk in one tablespoon of salt. Add the eggplant slices to the water and set aside for ten minutes. Then drain the eggplant in a colander, and dry on some paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour ½ cup of the oil into a wok set over high heat. When just starting to smoke, add the eggplant, and immediately reduce the heat to medium. Cook, stirring often, until eggplant pieces are soft, eight to ten minutes. Remove the eggplant slices with a slotted spoon and transfer to a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the remaining ½ cup of oil. Keep the heat at medium, and when oil starts to shimmer, add the onion, garlic, jalapenos, and red pepper. Cook, stirring occasionally, until all the vegetables are soft, five to seven minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the zucchini, season with a teaspoon of salt, and cook until zucchini is tender but not soft, about two minutes. Add the eggplant back to the wok, along with the sugar, soy sauce, and vinegar. Season with black pepper to taste. Cook for another two minutes, stirring gently so as not to break up the vegetables. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes and scallions. Stir gently, and cook until the tomatoes are hot, about one minute. Season with more salt and pepper if needed. Turn off the heat, stir in the cilantro and basil. This can be served warm or at room temperature, makes a great dinner with white rice. </p>"}]}