{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110527-153939-blue-hawaii-jelly-shots.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["blue curacao", "Drink the Book", "Jelly Shot Test Kitchen", "jelly shots", "Michelle Palm", "pineapple", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Drink the Book: Blue Hawaii Jelly Shots", "link": "https://www.seriouseats.com/recipes/2011/05/drink-the-book-blue-hawaii-jelly-shots-jello-shot-recipes.html", "description": "The Blue Hawaii, a mix of rum, pineapple juice, and blue Curaçao, conjures up Waikiki resorts, Elvis movies, and tiki mugs with paper umbrellas. And it's an ideal cocktail inspiration for fanatically colorful, tropically flavored layered jelly shots.", "totalTime": "3 hours", "recipeYield": "18 to 24 jelly shots", "recipeCategory": ["Drink the Book", "Pineapple", "Rum"], "recipeIngredient": ["<strong>Blue Layer</strong>", "1⁄4 cup canned pineapple juice, strained to remove solids", "1⁄4 cup vodka", "1 envelope Knox gelatin", "1⁄4 cup blue curaçao liqueur", "1⁄4 cup white rum", " ", "<strong>Yellow Layer</strong>", "3⁄4 cup pineapple juice, strained to remove solids", "1⁄4 cup Lemon Syrup (recipe follows)", "1 envelope Knox gelatin", " ", "<strong>Lemon Syrup</strong>", "1 ½ cups water", "1 cup granulated sugar", "4 medium lemons, each cut into 8 wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Blue Layer:</strong> Combine the pineapple juice and vodka in a small saucepan and sprinkle with the gelatin. Allow the gelatin to soak for a minute or two. Heat over low heat, stirring constantly, until gelatin is fully dissolved, about 5 minutes. (Take care to use very low heat, to avoid overheating the alcohol.) Remove from the heat and stir in the curaçao and rum. Transfer mixture to loaf pan or molds and refrigerate for at least an hour or until fully set. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lemon Syrup:</strong> Combine all ingredients in a medium saucepan. Muddle the lemon wedges. Bring to a rolling boil over medium heat. Reduce heat to low and simmer for 5 minutes. Remove from the heat and strain immediately. Allow the syrup to cool to room temperature.</p>\r\n\r\n<p><strong><small>Short cut:</strong> A 50-50 mix of frozen lemonade concentrate and water may be substituted for Lemon Syrup. Make sure to strain to remove any lemon pulp!</small></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Yellow Layer:</strong> Combine the pineapple juice and 1/4 cup lemon syrup in a small saucepan and sprinkle with the gelatin. Allow the gelatin to soak for a minute or two. Heat over very low heat, stirring constantly, until gelatin is dissolved, about 5 minutes. Remove from the heat and allow to cool slightly. Remove set Blue Layer from refrigerator, and ladle the yellow gelatin mixture over the top. Refrigerate until fully set, several hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cut into desired shapes or unmold shots.</p>"}]}