{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110803-quinoa-salad-corn-tomatoes-avocado-lime.jpg", "author": {"@type": "Person", "name": "Jennifer Segal"}, "recipeCuisine": "", "keywords": ["avocado", "cilantro", "cinco de mayo", "corn", "lime", "quinoa", "salad", "serious salads", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Quinoa with Corn, Tomatoes, Avocado, and Lime", "link": "https://www.seriouseats.com/recipes/2011/08/quinoa-salad-corn-tomatoes-avocado-lime-recipe.html", "description": "This is a delicious summer salad that you can eat with reckless abandon. Nourishing quinoa is infused with vegetable broth and dotted with fresh-cut sweet corn, juicy summer tomatoes, bright green scallions, spicy jalepeno peppers and chunks of creamy avocado.", "totalTime": "45 minutes", "recipeYield": "4", "recipeCategory": ["Avocado", "Corn", "Lime", "Quinoa", "Salads", "Tomato"], "recipeIngredient": ["2 tablespoons olive oil, divided", "1/2 cup chopped yellow onion, from one small onion", "1 cup pre-washed quinoa (if not pre-washed, follow package instructions for rinsing)", "1-2/3 cups low sodium vegetable broth (recommended brand: Swanson Organic)", "1 teaspoon salt, divided", "1 cup chopped tomatoes, from 2 medium tomatoes", "1-1/4 cups fresh cut cooked corn, from 2 cobs", "2 scallions, white and green parts, finely sliced", "1 small jalapeno pepper, seeded and finely chopped", "1/3 cup chopped fresh cilantro", "2 tablespoons lime juice, from 1 large lime", "1 avocado, cut into bite-sized chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil in a medium sauce pan over medium-low heat. Add onions and cook, stirring frequently, until soft and translucent, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add quinoa to onions and continue cooking, stirring constantly, for 3-4 minutes. Add vegetable broth and stir in 1/2 teaspoon salt. Turn heat up to high and bring to a boil. Cover pan tightly with lid, turn heat down to low and simmer for 17-20 minutes, until liquid is absorbed and quinoa is cooked. Transfer cooked quinoa to mixing bowl and chill in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When quinoa is cool, add remaining tablespoon olive oil, tomatoes, corn, scallions, jalapeno, cilantro, remaining 1/2 teaspoon salt and lime juice. Taste and adjust seasoning if necessary. Right before serving, scatter avocado chunks over top.</p>"}]}