{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110809-163701-GFTues-CornChowder.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["chowders", "corn", "corn chowder", "gluten free", "Gluten-Free Tuesday", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Gluten-Free Tuesday: Corn Chowder", "link": "https://www.seriouseats.com/recipes/2011/08/gluten-free-tuesday-corn-chowder.html", "description": "You know those foods that you just prefer a certain way? I'm like that with chowder. I like my chowder thick but not ultra rich. Sounds like an oxymoron, right? Let me explain.", "totalTime": "about one hour", "recipeYield": "4", "recipeCategory": ["Corn", "Gluten-Free", "Gluten-Free Tuesday", "Sides"], "recipeIngredient": ["2 tablespoons unsalted butter", "1 small onion, finely diced", "1/4 cup sweet rice flour", "3 cups milk, warmed", "2-3 cups homemade chicken stock or store-bought reduced-sodium broth", "2 cups corn, either fresh cut from the cob or frozen", "2 medium russet potatoes, peeled and diced (about two cups)", "1/2 teaspoon dried thyme", "Salt and freshly ground black pepper", "1/4 teaspoon hot pepper sauce "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt  butter in large pot over medium-high heat. Add onion and cook, stirring with a wooden spoon, until tender but not brown, about three minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Switch to a whisk and stir in  sweet rice flour. The flour will coat the onions and be very dry. Whisking constantly, cook for three minutes. In a slow and steady steam, add milk. Allow the paste to absorb the milk as you add it. This will prevent clumping. At first, add the milk slowly; as you add more milk, you can slightly increase the pouring speed until it’s all in. Stir in the chicken stock, corn, potatoes, thyme, 1/2 teaspoon salt, and 1/2 teaspoon pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the soup to a gentle boil. Lower the heat to medium-low and simmer (look for occasional gentle bubbles) for 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle about two cups of the soup into a blender and blend until smooth. The soup shouldn’t fill the blender more than halfway. If you have a small blender, do this in batches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the puréed soup to the pot and stir to combine. Add the hot pepper sauce. If you prefer your chowder thin, add the additional cup of stock. Taste and adjust the seasoning with salt and pepper as needed. Simmer over medium heat for five minutes, or until the soup is hot. Serve.</p>"}]}