{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110815-127355-dinner-tonight-linguine-tomatoes-capers-anchovies.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["anchovies", "Dinner Tonight", "fresh pasta", "Michael Symon", "pasta", "tomato", "tomato sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner Tonight: Linguine with Heirloom Tomato, Capers, Anchovies, and Chile", "link": "https://www.seriouseats.com/recipes/2011/08/linguine-with-heirloom-tomatoes-capers-anchovies.html", "description": "This <strong>Michael Symon</strong> recipe from <em><a href=\"http://www.amazon.com/dp/0307453650/?tag=serieats-20\">Live to Cook</a></em> is the kind of pasta dish I adore. Namely because the sauce is cooked quickly, using a mix of fresh, in-season produce and salty cured products. When the pasta is done cooking, it's tossed right into the pan with the sauce, so that each bite is coated with the flavorful mixture. It actually comes off something like a mix between a funky puttanesca and a fiery all'amatriciana.", "totalTime": "15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Pasta", "Tomato"], "recipeIngredient": ["Kosher salt", "1 cup bread crumbs", "1 tablespoon olive oil", "3 garlic cloves, thinly sliced", "1 teaspoon crushed red pepper flakes", "1 pound linguine, fresh or dried", "1 large heirloom tomato, peeled, cored, seeded, diced (about 1 cup)", "6 salt-packed anchovies, rinsed, filleted, and minced", "1 tablespoon salt-packed capers, rinsed and patted dry", "1/4 cup extra-virgin olive oil", "1/4 cup fresh parsley, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. If using dried linguine, add now, and cook according to the directions on the packaging; you should be able to cook the sauce in the amount of time the pasta takes to cook. If using fresh linguine, hold off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toast the breadcrumbs in a large dry skillet set over medium heat. Toss occasionally, and cook until they are lightly browned. (I cooked mine a tad too long.) Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the one tablespoon of olive oil into a large skillet set over medium heat. When oil is shimmering, add the sliced garlic and cook until lightly browned, one to two minutes. Add the red pepper flakes, and cook until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using the fresh linguine, it's about time to add the pasta to the boiling water. Cook until al dente, about two minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the diced tomato, anchovies, capers, and a pinch of salt to the skillet. Stir well, and simmer until the sauce has thickened, about two minutes. Turn off the heat, and add the parsley and extra-virgin olive oil. Stir well. Taste and add more salt if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When either the dried or fresh pasta is al dente, transfer it with a pair of tongs directly from the pot to the skillet. Toss well. Divide the pasta between four plates, and top each with a sprinkling of bread crumbs. Season to taste with salt. </p>"}]}