{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110705-159849-crab-potato-avocado-terrine.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["avocado", "Cook the Book", "crab", "Latin Grilling", "Lourdes Castro", "mashed potatoes", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cook the Book: Crab, Avocado &amp; Potato Terrine", "link": "https://www.seriouseats.com/recipes/2011/07/crab-avocado-potato-terrine-recipe.html", "description": "I have to thank <a href=\"http://www.lourdes-castro.com/Lourdes-Castro/Lourdes.html\">Lourdes Castro</a>, author of <em><a href=\"http://www.amazon.com/Latin-Grilling-Patagonian-Yucatecan-Barbecue/dp/1607740044/?tag=serieats-20\">Latin Grilling</a></em> for bringing this <strong>Crab, Avocado, and Potato Terrine</strong> (or <em>Causa Limeña</em> as it's known in its native Peru) into my life.  With its layers of creamy, spicy mashed potatoes, sweet crab tossed with scallions, cilantro, and lime juice, and cool avocado, it marries three separately delicious elements into one mind-blowing terrine.", "totalTime": "45 minutes plus 5 hours chilling time", "recipeYield": "serves 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Avocado", "Cook the Book", "Lobster and Crab", "Mashed Potatoes"], "recipeIngredient": ["1 1/2 pounds Yukon gold potatoes", "Salt", "3 tablespoons butter", "1/2 cup half-and-half", "1/4 teaspoon cayenne pepper", "1 teaspoon turmeric", "1/2 pound lump crabmeat", "2 limes", "2 green onions, roots trimmed, white and pale green parts thinly sliced ", "1/4 cup lightly packed cilantro leaves and tender stems, finely chopped", "2 Hass avocados"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the potatoes:</strong> Peel the potatoes and place them in a medium pot. Cover the potatoes with cold water, bring to a boil, add 1/2 teaspoon salt, and cook the potatoes until fork-tender, about 20 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the potatoes and place in a mixing bowl. Add the butter, half-and-half, cayenne pepper, and turmeric and mash until the potatoes are smooth and creamy. Taste for seasoning and add salt if necessary. Set aside to cool at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the crabmeat:</strong> Place the crabmeat in a bowl and pick through it with your fingers to remove any cartilage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the juice of 1 lime, half of the green onion, and the cilantro and toss well. Taste for seasoning and add salt if necessary. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the avocados:</strong> Cut the avocados in half and remove the seeds. Using a spoon, scoop out all of the flesh and place it in a bowl. Add the juice of the other lime and mash. Season with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the terrine:</strong> Cut a piece of plastic wrap that is long enough to hang over the sides of a 9 by 5-inch loaf pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the avocado mixture in the loaf pan and pat it down to an even layer. Create the second layer by spooning the crab mixture over the avocado and spreading it out. Finish the terrine by layering the mashed potato over the crab and smoothing \u2028it out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the plastic wrap over the mashed potato, covering the terrine well. If the potato is not completely covered, place another sheet of plastic over the top of the loaf pan. Refrigerate for at least 5 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Garnish and serve:</strong> Have a serving platter ready. Remove the terrine from the refrigerator and open the plastic wrap. Invert the platter over the loaf pan and flip both over so the pan is now upside down on top of the dish. Carefully lift off the loaf pan and peel off the plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish by sprinkling the remaining green onion over the terrine. Gently slice the terrine crosswise, being careful to avoid crumbling the crab layer. I find it best to use a long serrated knife for this and slowly cut through the terrine using a sawing motion.</p>"}]}