{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110709-lebovitz-pecan.jpg", "author": {"@type": "Person", "name": "David Lebovitz"}, "recipeCuisine": "", "keywords": ["butterscotch", "ice cream", "nuts", "pecans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Butterscotch-Pecan Ice Cream", "link": "https://www.seriouseats.com/recipes/2011/07/butterscotch-pecan-ice-cream-recipe.html", "description": "Pecans, butter, sugar: a classic combination.", "totalTime": "", "recipeYield": "Makes about 1 quart (1 liter)", "recipeCategory": ["Ice Cream and Frozen Treats", "Nuts"], "recipeIngredient": ["6 tablespoons (75 g) granulated sugar", "3/4 cup (170 g) packed dark brown sugar", "4 tablespoons (2 ounces/60g) unsalted or salted butter, cut into pieces", "1/2 cup (125 ml) plus 1 1/2 cups (375 ml) heavy cream", "3/4 cup (180 ml) half-and-half or whole milk", "1/2 teaspoon salt", "6 large egg yolks", "1 1/2 cups (150 g) pecans, toasted and coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the butterscotch mixture, spread the granulated sugar in an even layer in a medium heavy-bottomed saucepan and cook over medium heat without stirring until the sugar begins to melt around the edges. Using a heatproof utensil, slowly drag the liquified sugar to the center and stir gently until all the sugar is melted. Continue to cook, stirring infrequently, until the caramel turns dark amber in color and begins to foam a bit. Remove from the heat and immediately stir in the brown sugar, butter, the 1/2 cup (125 ml) cream, the half-and-half or milk, and salt. The mixture will steam and bubble up vigorously, then the bubbling will subside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the remaining 11/2 cups (375 ml) cream into a large bowl and set a mesh strainer across the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, whisk the egg yolks, then gradually add some of the warm butterscotch mixture, whisking constantly as you pour. Pour the warmed yolks back into the saucepan. Cook over low heat, stirring constantly and scraping the bottom of the pan with a heatproof spatula, until the custard is thick enough to coat the spatula. Pour the custard through the mesh strainer into the cream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the bowl containing the custard over a larger bowl of ice water. Stir the custard until cool, then cover and refrigerate until thoroughly chilled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze in an ice cream machine according to the manufacturer’s instructions. Stir the pecans into the just-churned ice cream when you remove it from the ice cream machine.</p>"}]}