{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205-182838-bouche-de-noel-610x458-33.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["buche de noel", "cakes", "chocolate", "chocolate cakes", "Christmas", "holiday cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bûche de Noël", "link": "https://www.seriouseats.com/recipes/2011/12/buche-de-noel-french-christmas-chocolate-cake-recipe.html", "description": "Making a traditional Bûche de Noël is a lengthy project that requires time and planning. you'll want to make many of the components in advance so they have time to chill: the <a href=\"http://www.seriouseats.com/recipes/2011/12/mushroom-meringues-for-buche-de-noel.html\">mushroom meringues</a>, soaker, compote, and pastry cream keep for up to 2 days before use.", "totalTime": "8 hours", "recipeYield": "serves 12", "recipeCategory": ["Cakes", "Christmas", "Desserts"], "recipeIngredient": ["one recipe <a href=\"http://www.seriouseats.com/recipes/2011/10/swiss-buttercream-recipe-cake-decorating.html\">Swiss Buttercream</a>, with 3 ounces praline paste whisked in", "450 grams milk", "100 grams granulated sugar", "50 grams all purpose flour", "2 tablespoons cornstarch", "1/4 teaspoon salt", "2 eggs", "5 ounces chestnut paste", "30 grams dark rum", "8 ounces fresh cranberries", "75 grams sugar (plus more to taste)", "50 grams water", "100 grams sugar", "125 grams granulated sugar", "100 grams water", "4 egg whites", "booze or extract for flavor", "4 egg yolks", "125 grams cake flour, sifted", "60 grams butter, melted and cooled", "<a href=\"http://www.seriouseats.com/recipes/2011/12/mushroom-meringues-for-buche-de-noel.html\">Mushroom Meringues</a>, marzipan decorations, melted chocolate, piped (all optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the pastry cream:</strong> Place milk and vanilla bean seeds in a medium saucepan and bring to a boil. Meanwhile, in a medium bowl, sift together flour, sugar, salt, and cornstarch. Add eggs, and whisk mixture until pale and stiff. Continue whisking while slowly adding half of the hot milk mixture. Transfer egg mixture to saucepan with the remaining milk mixture. Place over medium-high heat, whisking constantly, and bring to a boil. Cook for 2 minutes. In a small bowl, whisk together chestnut paste and rum, if using. Remove egg mixture from heat, and whisk in chestnut paste mixture. Pour mixture into a wide shallow dish, and cover the surface directly with plastic wrap to prevent a skin from forming. Refrigerate until cool. Whisk before using.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the cranberry compote:</strong> Place the fresh cranberries, sugar, and water in a saucepan over medium heat and bring the liquid to a simmer. Turn the heat to low and allow the mixture to simmer until the cranberries have burst and the sauce has reduced, approximately 15 minutes. Taste the mixture and adjust the sweetness by adding additional sugar. Remove from heat, place in an airtight container and chill until completely cool. Whisk before use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the soaker:</strong> Combine the 100 grams of sugar, water, and booze or flavoring (to taste, if using), in a small saucepan and bring to a boil over medium heat. Once the mixture reaches a boil, turn off the heat and allow to cool completely before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the sponge cake roll:</strong> Preheat the oven to 350&deg;F. Draw an X across the center of a jelly roll pan with a small pat of butter and line the pan with parchment paper. Prepare a French meringue with the egg whites and sugar and whisk the meringue to stiff peaks in a stand mixer with a whisk attachment. The meringue should be shiny and smooth, not puffy and dull. Whisk the egg yolks and fold them into the meringue, then fold in the cake flour, taking care not to deflate the batter. Fold in the cooled, melted butter. Immediately pour the batter onto the parchment-lined pan and spread it evenly with a large offset spatula. Bake the sponge for approximately 5-7 minutes, or until it is browned and springs back to the touch. Do not over-bake, or the sponge will be too stiff to roll. Allow the cake to cool in the pan for 10 minutes, then run a knife along the edges, place another piece of parchment on top and an inverted jelly roll pan atop the parchment, and flip the cake onto the inverted pan. Carefully peel off the parchment paper, and make the roulade as soon as the cake is cool to prevent hardening.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble:</strong> With the sponge sitting on a piece of parchment, brush the cake with soaker using a pastry brush. Spread an even layer of pastry cream over the entire cake (between 1/8 and 1/4 inch thick) using an offset spatula. Sprinkle small amounts of the cranberry compote over the surface. Using the parchment underneath to stabilize, begin rolling the cake into the roulade the long way, as you would a carpet, resting the roll on the seam. Cut the cake on an angle 1/3 way up the roulade using a serrated knife, then cut a round off of the bottom of the small piece. Arrange the bigger part of the roulade on a serving plate, and cover with a thick layer of buttercream. Arrange the smaller pieces so they look like branches coming out of the big roulade, then frost the smaller pieces with buttercream. Draw patterns in the buttercream to resemble bark, and decorate the cake as you see fit. The cake can be stored in the fridge until serving, but do not refrigerate the meringues or they will melt.</p>"}]}