{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110623-158172-old-fashioned-cake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "boiled icing", "cakes", "chocolate", "chocolate cake", "icing", "Meg Ray", "Miette"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Old-Fashioned Cake from Miette", "link": "https://www.seriouseats.com/recipes/2011/06/old-fashioned-cake-miette-recipe-chocolate-cake-boiled-icing.html", "description": "Just right for birthdays or other special occasions, this <strong>Old-Fashioned Cake</strong> is a perfect balance of moist bittersweet chocolate cake and marshmallowy icing.", "totalTime": "2 hours", "recipeYield": "8 to 10, one 6-inch cake", "recipeCategory": ["Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["1 Double Chocolate Cake baked in a contour pan (recipe follows)", "About 1 1/2 cups freshly made Boiled Icing (recipe follows)", "1 large maraschino cherry, with stem intact", "&nbsp;", "<strong>Double Chocolate Cake</strong>", "1 1/2 cups all-purpose flour", "1 1/4 cups natural unsweetened cocoa powder (see note)", "1 1/2 teaspoons baking soda", "1/2 teaspoons baking powder", "3/4 teaspoon kosher salt", "2 ounces 70% cacao chocolate, coarsely chopped", "1 cup boiling water", "1 cup buttermilk", "1/2 teaspoon vanilla extract", "2 large eggs, at room temperature", "1/2 cup vegetable oil", "2 1/4 cups sugar", "&nbsp;", "<strong>Boiled Icing:</strong>", "1 1/2 cups sugar ", "1/4 teaspoon cream of tartar", "1/4 cup water ", "3 large egg whites ", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Double Chocolate Cake:</strong>  Liberally butter two 6-by-3-inch regular or contour cake pans and dust with sifted cocoa powder. Tap out the excess cocoa. Preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, cocoa powder, baking soda, baking powder, and salt into a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chocolate in a heatproof bowl and pour the boiling water over it. Whisk until the chocolate is melted. Let the mixture cool for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, whisk together the buttermilk and vanilla. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the whisk attachment, whisk the eggs on high speed until foamy, about 2 minutes. Reduce the speed to low and slowly pour in the oil, whisking until combined, about 30 seconds. Raise the speed to medium and whisk until fully incorporated, about 30 seconds longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the speed to low and slowly pour the cooled chocolate mixture into the egg mixture. Slowly pour in the buttermilk and vanilla mixture. Add the sugar and whisk until the batter is smooth and liquid, about 2 minutes. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the mixer. Remove the bowl and add the sifted dry ingredients and mix until just incorporated, preferably by hand, lifting and folding in from the bottom center. Using a rubber spatula, scrape down the sides of the bowl and mix again just briefly by hand. The batter may still look a little lumpy, but stop mixing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter through a medium-mesh sieve into a large measuring cup or bowl to remove any lumps. Press against the solids in the sieve with a rubber spatula to push through as much batter as possible, then discard the lumps. Divide the batter between the prepared pans. Bake until the tops spring back when lightly pressed and a tester inserted in the centers comes out clean, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to wire racks and let cool in the pans for about 20 minutes. When the cakes are cooled enough to handle the pans but still a tad warm to the touch, carefully run an offset spatula around the edges of the pans to loosen them, then invert the cakes onto the racks and remove the pans. (Note: If you are making the Old-Fashioned Cake and therefore using a contour pan, just invert the pans and drop them sharply onto the racks; they should fall out cleanly. Using an offset spatula in a contour pan will mar the edges of the cake.) Let cool for about 20 minutes longer. Wrap the cakes tightly in plastic wrap and refrigerate to ensure that the interiors are completely cooled before decorating, at least 1 hour or for up to 3 days. To freeze, wrap tightly in a second layer of plastic and store in the freezer up to 2 months. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Boiled Icing:</strong> Combine the sugar, cream of tartar, and water in a small saucepan fitted with a candy thermometer. Stir the sugar to dissolve and begin to heat it over medium-low. Have a heatproof measuring cup sitting nearby.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the egg whites and vanilla in a stand mixer fitted with the whisk attachment. When the sugar reaches 240&deg;F, immediately pour it into the measuring cup to prevent it from getting hotter. With the mixer on medium speed, slowly pour the sugar syrup into the egg whites, aiming for the side of the bowl rather than the whisk. When all the syrup is added, turn the mixer to medium-high and whisk until the icing becomes thick and holds a firm peak. Continue to whisk until the icing is just slightly warm and very thick, about 10 minutes total. Do not continue to beat, or the icing will become too thick to spread and pipe. Use immediately on an Old-Fashioned Cake or on any other cake. Boiled icing must be used fresh and cannot be stored.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the Old-Fashioned Cake:</strong> Make the Double Chocolate Cake as directed, using a contour pan, and make sure it is cool inside and out. (If frozen, let thaw in the refrigerator, 3 to 4 hours. If time demands, you can thaw on the countertop, 1 to 2 hours, but be careful not let it sit too much longer before you begin working with it, as the texture will lose quality.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center the cake on a presentation plate or platter, dome-side up. Clear a space in your refrigerator large enough for the cake on its platter.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit a pastry bag with a medium (1/2- or 5/8-inch) round tip and fill halfway with the Boiled Icing. Pull up the cuff and twist it to seal and tighten the frosting down into the cone. Purge the bag of air bubbles by squeezing the bag until there is a burst of air and frosting sputters out of the bag. Keep the bag tightly twisted so that the frosting doesn’t come back up on your hands. Holding the piping tip at a 90-degree angle about 1 inch above the center of the cake, squeeze firmly to release a large mound of icing.  Keep the tip slightly submerged in the icing and continue. Begin to slowly squeeze the bag again, more gently this time, so that the icing continues to flow outward (like lava) and move the bag slightly in tiny, smooth, uniform circles to increase the flow until you make a mound that tops the cake, about 2 to 3 inches thick. Stop about 1/4 inch from the edge to show off the contour of the cake. When the icing process is complete, pull the tip straight up to make a point in the middle for the final flourish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently squeeze the cherry to drain it of any excess syrup, and wrap it in a paper towel for about 10 minutes. This will keep it from bleeding on the icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the maraschino cherry in the center of the cake with the stem raised attractively at a 45-degree angle. Refrigerate the cake for at least 30 minutes and up to 8 hours. Remove from the refrigerator 30 minutes before serving. It is best to eat the cake the same day you make it. </p>"}]}