{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110924shuna-berry.jpg", "author": {"@type": "Person", "name": "Shuna Lydon"}, "recipeCuisine": "", "keywords": ["cheesecake", "Guest Star", "Shuna Lydon", "Shuna Lydon Week", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Labne Yogurt Cheesecake", "link": "https://www.seriouseats.com/recipes/2011/09/labne-yogurt-cheesecake-recipe.html", "description": "Even if you despise cheesecake, as I tend to, I beg of you to try this version. Be warned&mdash;it's barely sweet. Feel free to alter that if you like.", "totalTime": "", "recipeYield": "about 6", "recipeCategory": ["Cakes"], "recipeIngredient": ["3 large eggs", "75 grams sugar", "Pinch of sea salt", "675 grams unsalted Labne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F. Whisk eggs well, add sugar and sea salt and whisk to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spatula, smooth out measured labne in a medium to large bowl. Fold and smooth out until no lumps appear. Make “well’ in center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a whisk, pour one third of the egg mixture into the labne well. Whisk in tight concentric circles, taking care not to incorporate any air into mixture. Whisk remaining egg mixture into labne only until mixture is uniform.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into desired serving vessels, such as small jars. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cheesecake baking vessels into a shallow roasting pan or pot and fill with enough hot water to come up halfway up sides of cheesecake vessels. Cover roasting pan with lid or aluminum foil hat, tucking around edge to create seal. Place roasting pan in preheated oven on low or middle rack of oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set first timer for 15 minutes and check on cheesecakes by unfurling one corner of aluminum foil and very lightly moving {do not shake!) roasting pan while looking closely at middle of cheesecakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cheesecakes are done when edges soufflé slightly or wiggle in middle of cheesecake is more like a flat pond than a waterbed. A little under-baked is better than overbaked, since they will continue to bake slightly out of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cheesecakes are done, leave at room temperature until cool. Cheesecakes will keep tightly covered and refrigerated for up to 3 days but are best eaten a few hours after they’ve been baked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish with fresh fruit, jam or compote, crumbled cookie crumbs, toasted nuts, sorbet or anything that suits!</p>"}]}