{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110426-bread-baking-white-whole-wheat.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "sandwich bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Whole Wheat Sandwich Loaf", "link": "https://www.seriouseats.com/recipes/2011/04/bread-baking-whole-wheat-sandwich-loaf-recipe.html", "description": "This is a nice sandwich loaf that's got a higher percentage of white to whole wheat than I usually use, but it's a little lighter and fluffier than you'd expect, thanks to the potato flakes. It's also an easy loaf to make. Since gluten develops during the long overnight rest in the refrigerator, it requires just a little kneading. The overnight cold rest also helps develop flavor, so not only is it an easy loaf, it's also tasty.", "totalTime": "4 hours, plus overnight rest", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 1/2 cups warm water", "2 1/4 teaspoons  instant yeast", "1 tablespoon sugar", "9 ounces (2 cups) white whole wheat flour", "2 1/4 ounces (about 1/2 cup) bread flour", " 1/4 cup instant mashed potato flakes", "1 teaspoons salt", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast and sugar in a small bowl or measuring cup and stir to combine. Meanwhile, in a medium bowl, combine white whole wheat flour, bread flour, potato flakes, and salt. Stir to combine. Add the liquid to the flour mixture and stir well with a wooden spoon or spatula to combine. Put the olive oil into a zip-top plastic bag. Transfer the dough to the plastic bag and make sure the dough is coated on all sides with the oil. Remove most of the air from the bag, and seal. Place it in the refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove the bag from the refrigerator, open it to expel the gas, and massage the dough inside the bag briefly. Leave the dough at room temperature for 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare an 8-inch loaf pan by spraying it with baking spray and sprinkling cornmeal on the bottom of the pan. If the cornmeal sticks to the sides of the pan, that’s fine, too. Preheat the oven to 325 degrees. Flour your work surface and turn the dough out. The dough will be very soft and sticky at first. Knead the dough until it feels smooth and elastic, just a minute or two, adding flour as needed to keep it from sticking to the work surface. Try to add as little flour as possible, though, to keep the dough soft. Form the dough into a log about 8 inches long, to fit inside the bread pan. Place the loaf seam-side down in the pan and cover with plastic wrap. Set aside until it has risen just beyond the top of the pan, about 30 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap, slash the loaf down the center, and bake at 325˚ until the loaf is nicely browned and sounds hollow when tapped on the bottom, about 40 minutes. Remove the loaf from the pan and let cool completely before slicing. If you prefer a soft crust, cover the loaf with a clean kitchen towel as it cools.</p>"}]}