{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111127-181187-lamb-chili-with-chickpeas-and-raita.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["American Flavor", "Andrew Carmellini", "chili", "Cook the Book", "lamb", "raita", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Andrew Carmellini's Lamb Chili with Chickpeas and Raita", "link": "https://www.seriouseats.com/recipes/2011/11/lamb-chili-with-chickpeas-and-raita.html", "description": "This recipe for <strong>Lamb Chili with Chickpeas and Raita</strong> from <a href=\"http://andrewcarmellini.com/about/#content\">Andrew Carmellini</a>'s <em><strong><a href=\"http://www.amazon.com/American-Flavor-Andrew-Carmellini/dp/0061963291/?tag=serieats-20\">American Flavor</a></strong></em> brings together two perfect winter warmers: meaty chili and lamb simmered with Indian spices.  Served over aromatic basmati rice with a cool and tart cucumber raita, this chili is fusion in the most seamless of ways, blending the heartiness and spice of an American chili with subtle Indian spices, delicate coconut milk, and nutty little chickpeas.", "totalTime": "3 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Chili", "Cook the Book", "Lamb"], "recipeIngredient": ["<strong>For the Raita:</strong>", "1 medium English cucumber", "Juice of 1 lemon (about 2 tablespoons)", "1 cup thick yogurt (I like Fage)", "6 large fresh mint leaves, minced ", "1/2 teaspoon salt", "1/4 teaspoon ground cumin ", "Pinch of cayenne pepper ", " ", "<strong>For the Chili:</strong>", "1 tablespoon corn oil", "2 pounds ground lamb", "1 medium red onion, diced (about 1 cup)", "One 1-inch piece of fresh ginger, peeled, sliced thin, and diced (1 tablespoon)", "1 clove garlic, minced", "3 teaspoons garam masala (or 2 teaspoons curry powder plus a pinch of cinnamon) ", "1 teaspoon chili powder", "1/2 teaspoon salt", "1/2 teaspoon fresh-ground black pepper", "1 cup canned coconut milk ", "One 28-ounce can chopped tomatoes with their juice ", "3 cups low-sodium chicken broth, vegetable broth, or water", "1 medium red bell pepper, diced (about 1 cup) ", "One 15-ounce can chickpeas, drained ", " ", "<strong>To finish the dish:</strong>", "1/2 cup torn fresh cilantro leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Raita:</strong> Use a vegetable peeler to peel the cucumber. Cut the cucumber in half lengthwise, and then cut each piece in half widthwise. Use a small spoon to scrape out the seeds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a box grater or a large flat grater, grate the cucumber into a bowl. Tip the bowl over the sink, holding the cucumber in with your hand or with a plate, and drain out the excess cucumber water. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze the lemon juice into the cucumber, using your hand as a filter to catch any seeds. Add the yogurt and mix everything together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the mint, salt, cumin, and cayenne, and mix gently. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl and put it in the fridge. The raita should be served cold. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Chili:</strong> Heat the corn oil in a large saucepot over medium-high heat. Use your hands to break the ground lamb into small pieces; then add the meat to the pot. Cook for about 2 to 3 minutes; use a wooden spoon to keep breaking the meat up, chopping it and stirring it constantly so that it browns evenly without clumping up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat down to medium. Add the red onion, ginger, garlic, garam masala, chili powder, salt, and pepper. Mix everything together so the meat is well coated in the spices and the oil, and then toast the mixture for a minute or so, until the spices release their flavor and aroma. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the coconut milk, tomatoes, broth, and bell pepper. Mix everything together, turn the heat up to medium-high, and bring the chili up to a simmer. Then let it cook, uncovered, at a low bubble, stirring occasionally to make sure it doesn’t stick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chili has been cooking for an hour and a half, stir in the chickpeas, and cook for another hour, until the chili has thickened and the flavors are rich and well combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To finish the dish:</strong> Ladle the chili into individual bowls, and add a spoonful of the cold raita and a sprinkling of the fresh cilantro to each one. Serve the chili up right away, with basmati rice and cold beer.</p>"}]}