{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110815-127355-dinner-tonight-smothered-shrimp-tosadas.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["Dinner Tonight", "Mexican", "shrimp", "tomato", "tostadas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Smothered Shrimp Tostadas", "link": "https://www.seriouseats.com/recipes/2011/08/smothered-shrimp-tostadas-recipe.html", "description": "Right in the middle of August, I tend to coddle perfectly ripe tomatoes like rare jewels, being careful not to bruise or puncture them. That is, until I get home, turn the heat to high, and char their skins until black. This trick, which we can thank Mexico for, intensifies the flavor, lends a wonderful smoky note, and, you know, looks really cool. No need to worry about burning your food; that's the point. The skins are peeled off and discarded and the tomatoes are blended with roasted garlic, chipotles, and red wine vinegar. The sauce is good to go. That's the sauce for these tostadas.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Dinner Tonight", "Mexican", "Shrimp", "Tomato"], "recipeIngredient": ["1 pound tomatoes (about 2 large ones)", "2 garlic cloves, unpeeled ", "1 canned chipotle chile", "1 teaspoon red wine vinegar ", "½ teaspoon salt ", "1 pound large shrimp, peeled, deveined, and sliced in half lengthwise ", "1 tablespoon olive oil ", "12 flat tostada shells", "1 head lettuce (romaine, iceberg, or green leaf), shredded", "1 cup Mexican crema", "¼ cup fresh cilantro, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a large cast-iron skillet over medium-high heat. When hot, add the garlic cloves and tomatoes. Roast, turning everything occasionally with a pair of tongs, until tomatoes are blackened on all sides and garlic is soft, about 15 minutes. Remove the tomatoes and garlic, and let them cool for a few minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the blackened skin from the tomatoes, and slip the softened garlic cloves out of their skins. Add both to a blender along with the chipotle chile, vinegar, and salt. Puree until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the shrimp on both sides with salt. Pour the oil into a large non-stick skillet set over medium-high heat. When shimmering, add the shrimp, and cook until pink, 30 seconds to one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the tomato mixture into the skillet with the shrimp. It should bubble furiously. Stir well, reduce heat to medium, and simmer until the sauce has thickened, about five minutes. Turn off the heat, and season with more salt and pepper if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now it’s time to construct the tostadas. Take one tostada and top with ¼ cup of shredded lettuce, three to four pieces of shrimp, a few spoonfuls of the tomato sauce, a drizzle of crema, and a sprinkling of fresh cilantro. Repeat process with remaining tostadas. Serve immediately. </p>"}]}