{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/169692-coconut-dessert-soup.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["coconut", "modernist cuisine", "soup", "spherification"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet Coconut Soup with Fruit Pearls", "link": "https://www.seriouseats.com/recipes/2011/09/dessert-sweet-coconut-soup-with-fruit-pearls-spherification-recipe.html", "description": "Sweet dessert soups are common in East and South East Asia. I'm partial to those made with coconut milk, which make a silky base for inclusions of fruit, red bean, tapioca pearls, and jellies. Spherified fruit juices combine the best of these add-ins: intense fruit flavor with a dynamic, juicy texture. I used guava juice, but use whatever flavors (perhaps in combination) you like. You can even dilute flavored syrups (like ginger or cinnamon) in water for your fruit juice. Just stay away from acidic ones like lime juice, which in my experience do not set as well.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Coconut", "Soups and Stews"], "recipeIngredient": ["<strong>For coconut soup</strong>", "1 1/2 cups coconut milk", "1 ounce palm sugar (can substitute raw or brown sugar)", "2 to 2 1/2 cups coconut water, to taste", "Zest of one lime", "Salt, to taste", "<strong>For fruit pearls</strong>", "250 grams fruit juice or syrup-enriched liquid (such as ginger syrup)", "2 grams sodium alginate (0.8% weight of liquid)", "<strong>For water bath</strong>", "500 grams water", "2.5 grams calcium chloride (0.5% weight of liquid)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For coconut soup:</strong> Combine coconut milk and sugar, whisk until fully dissolved. Thin out with coconut water to desired consistency, between 2 and 2 1/2 cups. Whisk in lime juice and salt to taste, then chill in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For fruit pearls:</strong> In a blender, combine fruit juice with sodium alginate and blend until very smooth. Strain into a wide bowl and let sit for several minutes for large air bubbles to disperse. In the meantime combine water and calcium chloride in a large bowl and stir until dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a syringe or the edge of a spoon, add fruit juice drop by drop into water bath. Drop juice in from a low height to keep pearls relatively round and uniform. Let pearls sit in water bath for one minute, then taste one. If skin is too thin and bursts too easily (likely in your hands), let sit for one or two more minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all pearls are set, transfer to strainer and rinse under cold water to remove bitter taste of water bath. Place pearls in bottom of soup bowls and top with chilled coconut broth.</p>"}]}