{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111102-ultra-crispy-roast-potatoes-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["potato", "roasted potato", "thanksgiving", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7058823529412", "ratingCount": "17"}, "name": "Ultra-Crispy Roast Potatoes", "link": "https://www.seriouseats.com/recipes/2011/11/ultra-crispy-roast-potatoes-recipe.html", "description": "These potatoes are parboiled, then tossed roughly in a bowl with a metal spoon until their surfaces are roughed and scratched up. All those microscopic nooks and crannies make for an extra-crunchy exterior.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Christmas", "Dairy-Free", "Gluten-Free", "Potato", "Roasting", "Sides", "Thanksgiving", "Vegetables"], "recipeIngredient": ["4 1/2 pounds (2kg) russet potatoes (see note), rinsed, peeled if desired, and cut into 2-inch chunks", "Kosher salt", "1 tablespoon (15ml) white vinegar", "1/4 cup (60ml) duck fat (see note)", "Freshly ground black pepper", "12 sprigs thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower and upper positions and preheat oven to 500&deg;F (260&deg;C). Place potatoes in a large saucepot and cover with cold water by 1 inch. Add 2 tablespoons (28g) salt and vinegar. Bring to a boil over high heat, reduce to a simmer, and cook until exteriors are tender, about 5 minutes. Potatoes should show slight resistance when poked with a paring knife or a cake tester. Drain potatoes and transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add fat to bowl with potatoes. Season with pepper and more salt to taste, then toss with a large metal spoon until exteriors are slightly bashed up and coated in a thin layer of potato/fat paste. Divide potatoes evenly between 2 heavy rimmed baking sheets. Spread thyme sprigs over potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer baking sheets to oven and roast until bottoms of potatoes are crisp and golden brown, about 20 minutes total, swapping trays top for bottom and rotating them once halfway through roasting. Using a thin metal spatula, flip potatoes and roast until second side is golden brown, another 15 to 20 minutes. Discard thyme sprigs and serve.</p>"}]}