{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111026crisscross610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["3 musketeers", "BraveTart", "candy", "candy bars", "chocolate", "gluten free", "meringue", "nougat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1.5", "ratingCount": "2"}, "name": "Homemade 3 Musketeers", "link": "https://www.seriouseats.com/recipes/2011/10/homemade-3-musketeers-bars-candy-halloween-recipe.html", "description": "Admittedly, this version of the 3 Musketeers isn't quite as fluffy as the original, but it does have the mild chocolate flavor your remember. Use milk chocolate for a classic 3 Musketeers bar, or dark chocolate for a \"Midnight\" edition.", "totalTime": "12 hours", "recipeYield": "makes 12 candy bars", "recipeCategory": ["Candy", "Chocolate", "Gluten-Free", "Halloween"], "recipeIngredient": ["<strong>For the Cooked Meringue:</strong>", "4 ounces egg whites", "7 ounces sugar", "4 ounces water", "1 tablespoon vanilla extract", " ", "<strong>Hot Sugar Syrup:</strong>", "14 ounces sugar", "6 ounces corn syrup", "2 ounces water", "2 teaspoons salt", "1 1/4 ounces cocoa powder, sifted", "1 pound chocolate, melted and/or tempered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the meringue:</strong> Lightly grease an 8\" square cake pan and set aside.</p>\r\n\r\n<p>Place the egg whites in the bowl a stand mixer (or in a large bowl & use a hand mixer). Fit the mixer with the whisk attachment and set aside.</p>\r\n\r\n<p>In a very small sauce pot (really, the smallest you have), combine the sugar and water. Simmer together, stirring occasionally with a heat resistant spatula until the sugar dissolves. Periodically, brush the sides of the pot down with a pastry brush dipped in water to wash down any sugar crystals that accumulate on the sides of the pot. </p>\r\n\r\n<p>When the mixture registers 220&deg;F on a candy thermometer, begin whipping the egg whites on medium speed, continue beating until a stiff meringue forms.</p>\r\n\r\n<p>When sugar syrup registers 240&deg;F, carefully pour the hot syrup in a steady stream over the meringue, with the mixer still running. Once the syrup has been fully incorporated, add in the vanilla extract. Whip until cool; shut off mixer, but leave the meringue and whisk in place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the sugar syrup:</strong> Combine the sugar, corn syrup, salt, and water in a small sauce pot. Cook, as with the first mixture, until the mixture registers 280&deg;. Immediately shut off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish the candy:</strong> With the mixer on lowest speed, slowly pour the sugar syrup over the meringue. Continue mixing until fully incorporated. Immediately add in the cocoa powder and mix until just combined. Shut off the mixer.</p>\r\n\r\n<p>Pour the mixture into the prepared cake pan, wrap in plastic and refrigerate at least 6 hours (and up to 24) or until completely cooled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cut & Dip the candy bars:</strong> Have two parchment lined sheet trays set aside. Remove the candy bars from the cake pan (loosen the edges with a knife or bench scraper, and peel up the nougat with your fingers) and transfer to a cutting board. With a chef's knife, cut the block of nougat in half, then cut each half into six pieces.</p>\r\n\r\n<p>Transfer the cut candy to one of the prepared sheet pans and freeze until needed.</p>\r\n\r\n<p>Meanwhile, melt and/or temper the chocolate. Transfer the prepared chocolate to a small bowl.</p>\r\n\r\n<p>Use a fork to drop each nougat piece, one at a time, into the chocolate. Dunk each one under the chocolate to ensure even coating and then use the fork to lift it back out. The nougat pieces may sag a little bit over the fork, but will straighten back out during the next step.</p>\r\n\r\n<p>Drag the bottom edge of the candy against the lip of the bowl to remove excess chocolate, then transfer the chocolate coated nougat to the second prepared sheet pan. </p>\r\n\r\n<p>For an authentic 3 Musketeers look, use a fork to create hash marks in the chocolate before it solidifies.</p>\r\n\r\n<p>For tempered chocolate, simply wait for the chocolate to solidify. For untempered chocolate, refrigerate the candy bars until solidified. For the neatest look, use a sharp knife to trim away any excess chocolate from each candy bar. Transfer the finished bars to an airtight container.</p>\r\n\r\n<p>Untempered chocolate bars must be stored in the refrigerator, where they will last for a few weeks. Tempered chocolate may be stored at room temperature.<br />\r\n</p>"}]}