{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110518-127355-dinner-tonight-asparagus-hash.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["asparagus", "hash", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Dinner Tonight: Spring Asparagus and Bacon Hash", "link": "https://www.seriouseats.com/recipes/2011/05/spring-asparagus-and-bacon-hash-recipe.html", "description": "This is the time of year when I figure out as many ways as possible to eat asparagus. Right now nearly every asparagus spear is perfectly sweet and crisp. I've realized that I just need to cram all of my asparagus needs into one short spurt during spring when it <em>really</em> matters. While serving spears with a little butter or Parmesan cheese is almost always a good idea, eventually I start to wonder how I can turn asparagus into a full meal.", "totalTime": "45 minutes", "recipeYield": "4 people", "recipeCategory": ["Asparagus", "Bacon", "Dinner Tonight", "Potato"], "recipeIngredient": ["¼ pound bacon, cut into ¼-inch dice (pancetta is also a good idea)", "1 pound fingerling potatoes, peeled, cut into ½-inch dice ", "1 small yellow onion, diced ", "½ pound asparagus, ends trimmed, cut into 1-inch segments", "salt and pepper ", "2 tablespoons butter ", "4 eggs "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon to a large cast iron pan set over medium heat. Cook, stirring occasionally, until it is browned and crisp, about ten minutes. Remove bacon with a slotted spoon and drain on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add potatoes to the pan, stir well until they are coated in the rendered fat, and then spread them out into a single layer. Season with salt and pepper, and cook without stirring until lightly browned on the bottom. Using a spatula, flip the potatoes and cook until lightly browned. Continue this process until all sides are lightly browned, about 15 minutes total. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion to the pan and stir well. Cook until onions are softened, about five minutes. Add the asparagus, stir well, and then cover the pan. Cook, stirring occasionally, until asparagus is crisp and tender, five to eight minutes. Return the bacon to the pan, stir, and let cook for a minute until warm. Season with salt and pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a non-stick skillet set over medium heat. Crack the eggs into the skillet and cook until whites are set, three to four minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the hash between four plates, and top each with a fried eggs. Season with salt and pepper to taste. </p>"}]}