{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/622011-154845-steaktartare.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["meat", "steak", "steak tartare", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sunday Brunch: Steak Tartare", "link": "https://www.seriouseats.com/recipes/2011/06/steak-tartare-recipe.html", "description": "Those who love steak tartare generally have very strong opinions about how it should be served.  Ground or chopped, seasoned in the kitchen or at the table; even the array of ingredients that can be included is always in question.  This version is an over-arching recipe so that those who haven't quite formed a solid opinion can try a few variations.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Beef", "Breakfast and Brunch", "Mains"], "recipeIngredient": ["1 pound eye of round or beef tenderloin", "2-4 egg yolks", "2 shallots, finely minced", "Kosher salt and freshly cracked pepper", "anchovy fillets, minced (optional)", "Dijon mustard (optional)", "Tomato ketchup (optional)", "Worcestershire sauce (optional)", "Olive oil (optional)", "Finely minced capers (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim all the visible fat from the meat, then place in the freezer for 15 minutes, or until just slightly firm.  Remove from freezer and cut into slices about 1/8th of an inch thick (or as close and you can manage), then make a small pile and slice once again into thin strips, then finally cut those strips into a very fine dice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Depending on how you are serving your tartar, you can toss this meat with shallots, salt and pepper, then mound onto 4 plates and top with egg yolks; then surround the tartar with little piles of any or all of the optional ingredients so that the diners can season for themselves.  Or gently toss all the meat with yolks, shallots, salt and pepper to taste, followed by any or all of the optional ingredients to taste and serve either family style, or on 4 small plates.  Any way you choose, to serve remember to have lots of crusty bread or toast points.</p>"}]}