{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111205-182364-serious-eats-pulled-pork-sandwiches.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["coleslaw", "Cook the Book", "pork", "pulled pork", "sandwich", "Serious Eats book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Eats' Pulled Pork Sandwiches With Coleslaw", "link": "https://www.seriouseats.com/recipes/2011/12/serious-eats-pulled-pork-sandwiches-with-cole.html", "description": "To get that great slow-cooked smokiness, the spiced and rubbed pork belly or butt is grilled over smoldering coals and wood chips until it gets all pull-apart-y. Tossed in a sauce of sweet-tangy cider vinegar, hot sauce, and chile flakes, our pulled pork is pretty darn close to the real deal, even more so when topped with finely chopped coleslaw and served on that perfect kind of squishy white bread bun.", "totalTime": "6 to 8 hours", "recipeYield": "makes 4 to 5 pounds cooked pork; serves 8 to 10", "recipeCategory": ["Cook the Book", "Pork", "Sandwiches"], "recipeIngredient": ["<strong>For the pulled pork:</strong>", "3 tablespoons light brown sugar ", "3 tablespoons paprika", "2 tablespoons chili powder", "1 teaspoon garlic powder", "2 teaspoons freshly ground black pepper", "2 teaspoons ground coriander", "1 tablespoon kosher salt", "2 large slabs (about 7 pounds) rib-on, skin-on pork belly, 2 inches thick (see Note)", "5 to 6 cups wood chips, soaked in water for at least 30 minutes", "&nbsp;", "<strong>For the sauce:</strong>", "1 cup cider vinegar", "1/4 cup light brown sugar, packed", "2 tablespoons red pepper flakes", "2 tablespoons hot sauce (such as Frank’s) ", "2 teaspoons kosher salt", "&nbsp;", "<strong>For the coleslaw:</strong>", "1 head green cabbage, cored and finely sliced or chopped (about 8 cups chopped)", "1 medium red onion, finely sliced (about 1 cup)", "1 large carrot, grated on large holes of box grater (about 1 cup) ", "1 tablespoon table salt, plus more to taste", "6 tablespoons cider vinegar", "1 tablespoon Dijon mustard", "3/4 cup mayonnaise", "2 tablespoons granulated sugar", "2 teaspoons freshly ground black pepper, plus more to taste", "&nbsp;", "<strong>To serve:</strong>", "8 to 10 soft buns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> <strong>For the pulled pork:</strong> Mix the brown sugar, paprika, chili powder, garlic powder, black pepper, coriander, and salt in a small bowl. Set the spice mixture aside. Place both slabs of the belly on a cutting board rind side down and rub them evenly with one-fourth of the mixture on each slab. Pick up one slab and place it rind side up on the other slab to create a single 4-inch-thick slab of belly, with rind on both the top and the bottom. Using butcher’s twine, secure the slabs tightly in this position. Rub the remaining spice rub on the exterior of the tied pork belly. (At this point, belly can be stored in refrigerator, uncovered, for up to 24 hours.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a disposable aluminum baking sheet on the rack underneath one half of a charcoal grill. Ignite a large chimney starter half full with charcoal (about 50 coals). When the coals are mostly covered with gray ash, empty them onto the other half of the grill and arrange them into an even layer. Add 2 cups of soaked wood chips directly on top of coals. Set the cooking rack in place and cover the grill with the vents fully open until the wood begins to smoke heavily, about 5 minutes. Add the pork belly to the cool side of the grill, keeping it as far from the live coals as possible. Cover the grill. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Every hour, for 6 to 8 hours total, flip and rotate the belly, and add 12 coals and 1/2 cup of wood chips. Cook until the belly is tender enough to shred with a fork (the rind will be hard and crusty—check the sides of the belly for doneness). Remove it from the grill, tent with foil, and allow to rest for 30 minutes. While the pork is cooking, make the sauce and the coleslaw.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sauce:</strong> Combine the vinegar, brown sugar, red pepper flakes, hot sauce, and salt in a medium bowl. Whisk until the sugar is dissolved.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the coleslaw:</strong> Combine the cabbage, onion, carrot, salt, vinegar, mustard, mayonnaise, sugar, and ground pepper in a large bowl and toss to combine. Allow the slaw to rest for at least 1 hour, covered in the refrigerator, then toss again. Adjust salt, pepper, and sugar to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pork is done -resting, use heatproof gloves or two forks to shred the meat into 1-inch pieces, discarding the bones, fat, and rind, if desired. Toss the pulled pork with the sauce to season to taste. Serve immediately on soft buns topped with coleslaw.</p>\n\n<p><small><strong>Note:</strong> Look for two large slabs of pork belly with the rib bones and rind still attached. Pork shoulder can be substituted for the belly. Pork shoulder is often labeled “Boston butt” or “pork butt.” Look for bone-in, skin-on shoulders, if using.</small></p>"}]}