{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110805-grilled-rice.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "onigiri", "rice", "Seriously Asian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Yaki Onigiri", "link": "https://www.seriouseats.com/recipes/2011/08/yaki-onigiri-grilled-rice-asian-recipe.html", "description": "Most onigiri is not grilled. Sticky, short-grain rice compressed around fillings of fish, pickled vegetables or umeboshi (pickled plums) is the norm.  A common home-style treat, onigiri is also sold in Japanese convenience stores and grocery stores where sheets of nori (seaweed) wrappers are covered in plastic to remain crispy.", "totalTime": "20 minutes", "recipeYield": "4", "recipeCategory": ["Japanese", "Rice", "Vegetarian"], "recipeIngredient": ["3 cups cooked short-grain white rice, or 2 cups white rice and 1 cup brown rice", "1/4 cup soy sauce for glazing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wet your hands and scoop balls of rice, approximately 2/3 cups of rice per ball, between your cupped palms. Squeeze and compress the rice balls to form it into a triangular shape.  Brush the onigiri with the soy sauce and set aside until you are ready to grill. Onigiri made be made in advance and kept covered at room temperature for a few hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill yaki onigiri over low heat on the edges of a grilll, taking care not to burn the rice. Place the balls carefully on the grate and let the bottom sides harden and brown, about 10 minutes, before flipping them.  Flip carefully with a pair of tongs so as not to break the compacted onigiri.  Brown for another 10 minutes or so on the other side. Serve immediately, with extra soy sauce for dipping. </p>"}]}