{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110125-bread-baking-rye-with-flax.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "flax", "whole grain"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Bread Baking: Rye with Caraway and Flax", "link": "https://www.seriouseats.com/recipes/2011/01/bread-baking-rye-with-caraway-and-flax.html", "description": "I'll admit that I was a little bit slow jumping on the flax seed bandwagon. Maybe it was an anti-hype reaction. Before I baked with them, I sampled whole light flax seeds and I was surprised to find they actually tasted good. Here's a way to incorporate flax into your bread (and your diet.)", "totalTime": "3 hours 15 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons active dry yeast", "1 tablespoon sugar", "1 cup (3 3/4 ounces) medium rye flour", "1/4 cup flax meal", "9 ounces (about 1 2/3 cups) bread flour, divided", "1 teaspoon salt", "1/4 cup Greek-style yogurt", "1 tablespoon whole flax seeds", "2 tablespoons caraway seeds", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast, and sugar in the bowl of your stand mixer and set aside until it's foamy, about 5 minutes. Add the rye flour, flax meal and about half of the bread flour. Stir to combine, cover with plastic wrap, and set aside for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Knead with the dough hook until the gluten begins developing, about 5 minutes. Then add the remaining bread flour, salt, and yogurt. Knead with the dough hook until the mixture is elastic. Add the seeds and oil and continue kneading until the oil is incorporated and the seeds are well distributed in the dough. Form the dough into a ball and drizzle with a bit of olive oil to coat. Return the dough to the bowl, cover with plastic wrap, and set aside until doubled, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and preheat your oven to 350 degrees. Sprinkle some cornmeal on a baking sheet. Remove the dough from the bowl and form it into your preferred shape. Place it on the prepared baking sheet, seam-side down, and cover with plastic wrap. Set aside until it has doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap, slash the loaf as desired, and bake at 350 degrees until nicely browned, about 40 minutes. Remove from the oven and let cool completely on a rack before slicing.</p>"}]}