{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/10/20111018-bread-baking-batter-bread-primary.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bread Baking: Herbed Batter Bread", "link": "https://www.seriouseats.com/recipes/2011/10/bread-baking-herbed-batter-bread-recipe.html", "description": "Because this dough doesn't have the flavor-enhancement of a long, slow rise, it benefits from other flavor enhancements&mdash;in this case, herbs. The herbs in this recipe worked well together but of course you could substitute any you like. Or cheese. Cheese is always good, right?", "totalTime": "1 hour, 45 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["3 cups (13 1/2 ounces) all purpose flour, divided", "2 1/4 teaspoons instant yeast", "1 1/4 cups lukewarm water", "1 tablespoon sugar", "1 teaspoon salt", "1 teaspoon dried dill", "1 teaspoon celery seeds", "1 teaspoon dried savory", "2 tablespoons olive oil", "baking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a loaf pan with baking spray. Combine 2 cups of the flour with the yeast, water, sugar, salt, dill, celery seeds, savory, and olive oil in a medium bowl. Beat on low with a hand mixer until all the ingredients are combined. Increase the speed to high and continue beating until the gluten is well developed; the batter will hold together in sheets if you try to lift it with a spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining flour and mix with a wooden spoon until the flour is evenly incorporated into the dough. Transfer the dough to the baking pan. Wet your hands and smooth the top of the dough and even it out in the pan. Spray the top of the dough with baking spray or cooking spray and cover the pan with plastic wrap. Set aside until the dough has doubled in size, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. When the dough has doubled, remove the plastic wrap and bake at 375°F until the bread is nicely browned an cooked through, about 45 minutes. Remove the bread from the pan and let it cool completely on a rack before slicing.</p>"}]}