{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/07/20110801-163342-soymilk-primary.JPG", "author": {"@type": "Person", "name": "Kumiko Mitarai"}, "recipeCuisine": "", "keywords": ["drinks", "how tos", "milk", "soy milk"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Soy Milk", "link": "https://www.seriouseats.com/recipes/2011/08/homemade-soy-milk-recipe.html", "description": "This fresh, clean homemade soy milk is delicious on its own. But you can add vanilla, almond extract, honey, or sugar. The nice thing is you get to control how much goes in, unlike the sweetened store-bought versions, which also happen to be quite a bit more expensive.", "totalTime": "10 hours and 30 minutes (including soaking time)", "recipeYield": "Makes 3 to 3 Â¼ cups", "recipeCategory": ["Non-Alcoholic", "Other Drinks"], "recipeIngredient": ["1 cup dried soybeans ", "3 ½ cups water ", "Optional flavors or sweeteners such as vanilla or almond extract; honey, agave nectar, or sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse, drain, and soak beans in about 6 cups of water for 8 to 10 hours. Rinse and drain again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer beans into a blender or food processor along with 1 cup of water. Puree, scraping down sides as necessary, until thick and creamy, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a large mixing bowl with a strainer or colander set into it. Line the colander with a large tea towel – it should be strong but not too thick. You’ll want the soy milk to pass through without letting out any of the soybean pulp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer puree plus 2 cups water into a large pot. Cook over medium-high heat, stirring occasionally to prevent scalding, until very foamy and just beginning to boil. Pour the hot puree into the lined strainer and wash out the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the sides of the towel together and twist. Press the contents against the strainer with a pestle or the bottom of a sturdy bottle so that the milk drains out and into the mixing bowl. (A silicone oven mitt can also be used to protect your hands if you want to press the hot sack directly.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the soybean pulp seems pretty much dried out, open up the towel and pour in the final ½ cup of water over it. Close up the towel again and squeeze out the final drops of soy milk. You should have about 3 ¼ cups of raw soy milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the soy milk to the pot and bring to a boil over medium-high heat, then reduce the heat to medium-low. Simmer gently until the milk is sweet and has lost its raw bean flavor, about 7 minutes. Stir in additional flavoring or sweetener, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or cold and consume within a few days. </p>"}]}