{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/09/20110913-170459-cheese-enchiladas-with-chili-con-carne.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chili", "chili con carne", "Cook the Book", "enchiladas", "Lisa Fain", "The Homesick Texan Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cook the Book: Cheese Enchiladas with Chili Con Carne", "link": "https://www.seriouseats.com/recipes/2011/09/cheese-enchiladas-with-chili-con-carne-recipe.html", "description": "Cheesy enchiladas sauced with a rich, meaty ladle of chili con carne is Texas on a plate, according to <a href=\"http://homesicktexan.blogspot.com/p/frequently-asked-questions.html\">Lisa Fain</a>, author of <em><strong><a href=\"http://www.amazon.com/Homesick-Texan-Cookbook-Lisa-Fain/dp/1401324266/?tag=serieats-20\">The Homesick Texan Cookbook</a></strong></em>. It's that combination of bean-less chili gravy and cheese stuffed and covered corn tortillas that is the essence of Tex-Mex and a true taste of Texas.", "totalTime": "1 hour", "recipeYield": "serves 4 to 6", "recipeCategory": ["Beef", "Chili", "Cook the Book"], "recipeIngredient": ["<strong>For the Chili Con Carne:</strong>", "6 dried ancho chiles, stems and  seeds removed  ", "1 tablespoon vegetable oil or lard ", "1/2 medium yellow onion, chopped ", "2 cloves garlic, chopped ", "1/2 tablespoon ground cumin ", "1/2 teaspoon dried oregano ", "1/4 teaspoon ground allspice ", "1/4 teaspoon ground cinnamon ", "1/4 pound ground beef ", "2 cups beef broth ", "Salt, black pepper, and cayenne, to taste ", " ", "<strong>For the Enchiladas</strong>", "1 tablespoon vegetable oil or lard ", "12 corn tortillas ", "4 cups grated cheddar cheese   (16 ounces) ", "1/2 medium yellow onion, diced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a dry skillet heated on high, toast the ancho chiles on each side for about 10 seconds or just until they start to puff. Fill the skillet with enough water to cover chiles. Leave the heat on until the water begins to boil and then turn off the heat and let the chiles soak until soft, about 30 minutes.  Once hydrated, discard the soaking water and rinse the chiles.  Place in a blender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot or Dutch oven, heat the vegetable oil or lard, and cook the onions, occasionally stirring, until translucent, about 5 minutes.  Add the garlic and cook for 30 more seconds.  Place the cooked onions and garlic into the blender, along with the cumin, oregano, allspice, cinnamon, and 1 cup of water.  Blend until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot you used to cook the onions and garlic, on medium heat, brown the beef, stirring occasionally, about 10 minutes.  (If you like, you can drain the extra fat once the meat is browned,)  Add the chile puree and the beef broth, heat on high until boiling, and then turn the heat down to low and simmer for 30 minutes, stirring occasionally.  After 30 minutes, adjust the seasonings, add salt, black pepper, and cayenne to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the enchiladas, first preheat the oven to 350&deg;F and greases a large baking dish.  In a skillet, heat up the oil or lard on medium-low heat.  One at a time, heat up the tortillas in the hot oil.  Keep them warm in a cloth or tortilla warmer until all of the tortillas are heated.  <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take a heated tortilla and use tongs to dip it into the sauce.  Shake off most of the sauce, but be sure that it's moist enough to be pliable.  Lay the tortilla on a plate or clean cooking surface, add ¼ cup of the grated cheese down the center of it, along with a few diced onions.  Roll the tortilla.  Place the rolled enchilada in the greased baking dish and repeat with the remaining tortillas.  Pour the sauce over enchiladas and top with remaining grated cheese and diced onions.  Bake for 15 minutes or until the cheese is lightly browned and bubbling.</p>"}]}