{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/11/20111130-127355-dinner-tonight-alton-browns-man-breakfast-hashbrowns.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Alton Brown", "Dinner Tonight", "egg", "hash browns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Alton Brown's 'Man Breakfast' with Bacon, Eggs, and Hash Browns", "link": "https://www.seriouseats.com/recipes/2011/11/alton-browns-man-breakfast-with-bacon-eggs-an.html", "description": "No, I did not make up the \"man breakfast\" thing. It's actually in Alton Brown's <em><a href=\"http://www.amazon.com/dp/158479903X/?tag=serieats-20\">Good Eats 3: The Later Years</a></em>. While you can argue about the name, my wife can attest to the fact that females can enjoy this meal, too. I mean, what's not to love about properly made hash browns with eggs and bacon? But the best part is that this meal comes together so quickly. Anyone else craving breakfast for dinner?", "totalTime": "20 minutes", "recipeYield": "serves 2", "recipeCategory": ["Breakfast and Brunch", "Dinner Tonight", "Eggs"], "recipeIngredient": ["<strong>For the Hash Browns</strong> ", "4 slices of bacon", "8 ounces russet potatoes, scrubbed and rinsed, not peeled", "kosher salt", "&nbsp;", "<strong>For the Eggs</strong>", "4 large eggs", "2 teaspoons unsalted butter", "kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the hash browns: Add the bacon slices to a 10-inch cast-iron skillet set over medium heat. Cook, flipping occasionally, until the slices are cooked to your liking. Turn down the heat if they are cooking too quickly. When done, drain the bacon on some paper towels and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all but two tablespoons of the bacon fat, and reduce the heat to medium-low. Grate the potatoes on the largest holes of a box grater. Add the potatoes to the skillet and spread out evenly with a spatula. Sprinkle with a couple pinches of salt. Let the potatoes cook undisturbed for five minutes. Flip the potatoes with a spatula, reduce heat to low, and cook for an additional five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the eggs: With five minutes left with the potatoes, add the butter to a non-stick skillet set over low heat. When the butter foams, carefully crack in the four eggs. (Brown suggests cracking the eggs into a custard cup, and then adding them in.) Season with salt and pepper, and then cover the skillet. Cook until the whites are set but the yolk is still runny, three to five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the eggs are done, use a spatula place two eggs on two separate plates. On each plate, add half of the hash browns and bacon. Serve immediately. </p>"}]}