{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110315handpiesprimary.jpg", "author": {"@type": "Person", "name": "Caroline Ford"}, "recipeCuisine": "", "keywords": ["Guinness Week", "hand pies", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Guinness Week: Pork and Guinness Hand Pies", "link": "https://www.seriouseats.com/recipes/2011/03/pork-guinness-hand-pies.html", "description": "I moved this week, and since I live in Oregon, that meant shuffling all of my worldly possessions from one location to another in cold, pouring ran. Mid-way through the scurrying, I came inside and pulled one of these hand pies from the refrigerator. I didn't even warm it up. Just inhaled the whole thing straight from the plastic wrap, and it was perfect. A bit savory, a bit sweet, and hearty enough to sustain me through the rest of the heavy lifting.", "totalTime": "2 hours 30 minutes", "recipeYield": "8", "recipeCategory": ["Mains", "Pork"], "recipeIngredient": ["<strong>For the Dough</strong>", "2 1/2 cups flour (spooned and leveled)", "1 teaspoon salt", "2 sticks cold unsalted butter, cut into 1/2 inch pieces", "1/4 cup ice cold water", "&nbsp;", "<strong>For the Filling</strong>", "1/2 tablespoon olive oil", "1 cup finely chopped red onion, about 1 small ", "3 medium cloves garlic, finely chopped", "1 pound ground pork", "Kosher salt and freshly ground pepper", "1 pound sweet potato, peeled and cut into 1/2 inch pieces", "1 cup Guinness", "1/3 cup dried cherries, roughly chopped", "1/4 teaspoon ground ginger", "1/4 teaspoon cinnamon", "pinch of cayenne", "1 egg, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place flour and salt in food processor. Pulse to combine. Add cold butter; pulse until mixture resembles coarse meal, with pea-size pieces remaining. Slowly add cold water, 1 tablespoon at a time, until mixture is a bit crumbly, but holds together when squeezed. Shape dough into a 1-inch thick disk, wrap tightly in plastic wrap, and refrigerate at least 1 hour or until firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large saute pan over medium-high heat. Add onion and cook until soft, 3-4 minutes. Add garlic and cook another 1 minute. Add ground pork and cook until no longer pink, 3-5 minutes. Season with a generous sprinkle of salt and pepper while meat cooks. Add potato, Guinness, dried cherries, ginger, cinnamon, and cayenne. Cover and cook 15 minutes or until potatoes are fork tender. Gently mash mixture together with a fork. Taste and adjust with salt and pepper. Keep warm or refrigerate mixture until ready to fill dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450 degrees. Divide dough in half. On a floured surface, roll out one half to 1/8 inch thickness. With a knife or biscuit cutter, cut out 8 5-inch circles (rerolling dough if necessary) and transfer, onto a  parchment lined baking sheet. Repeat with remaining dough, cutting out eight (slightly larger) 5 1/4-inch rounds. Chill rounds on sheet until ready to use.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a heaping 1/3 cup filling on each smaller round of dough, leaving a 1/2 inch border. Brush edges with egg and press larger round over top, using fingers to firmly seal. With the tines of a fork, crimp edges. Cut 3 small vents in the top of each pie. Brush tops with egg mixture and bake until golden brown and bubbling, 20-25 minutes, rotating sheet halfway through. Let cool slightly on wire racks. Serve warm. </p>"}]}