{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/08/20110823-167411-Yellow-Birthday-Cake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["birthday cakes", "cake", "chocolate", "flour", "frosting", "yellow cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Yellow Birthday Cake with Fluffy Chocolate Ganache Frosting", "link": "https://www.seriouseats.com/recipes/2011/08/yellow-birthday-cake-recipe-chocolate-ganache-frosting-flour-bakery.html", "description": "Tender yellow cake with smooth chocolate frosting, this is birthday cake done right.", "totalTime": "1 hour 30 minutes", "recipeYield": "8 to 10", "recipeCategory": ["Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["1 1/2 cups (3 sticks) unsalted butter, at room temperature", "2 cups sugar", "3 eggs ", "3 egg yolks ", "1 teaspoon vanilla extract", "3 cups cake flour", "1 teaspoon baking powder ", "1/2 teaspoon baking soda", "1/2 teaspoon kosher salt", "1 cup nonfat buttermilk  ", "&nbsp;", "<strong>Fluffy Chocolate Ganache Frosting</strong>", "12 ounces semisweet chocolate, finely chopped ", "1 cup heavy cream", "1 cup (2 sticks) unsalted butter, at room temperature", "1 cup confectioners’ sugar", "1/4 teaspoon kosher salt", "1/2 teaspoon vanilla extract "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven, and heat the oven to 350&deg;F. Butter and flour two 8-inch round cake pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a stand mixer fitted with the paddle attachment (or a handheld mixer), cream together the butter and granulated sugar on medium speed for 3 to 4 minutes, or until light and fluffy. (This step will take 8 to 10 minutes if using a handheld mixer.) Stop the mixer a few times and use a rubber spatula to scrape the sides and bottom of the bowl and the paddle to release any clinging butter or sugar.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the eggs, egg yolks, and vanilla just until combined. On low speed, slowly pour the egg mixture into the butter mixture and mix just until incorporated. Scrape the bowl and paddle again, then beat on medium speed for 20 to 30 seconds, or until the mixture is homogeneous. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, sift together the flour, baking powder, baking soda, and salt. On the lowest speed, add about one-third of the flour mixture to the egg-butter mixture and mix just until barely combined. Immediately pour in about half of the buttermilk and continue to mix on the lowest speed until the buttermilk is almost thoroughly incorporated. Stop the mixer and scrape the sides and bottom of the bowl well. Again on the lowest speed, add about half of the remaining flour mixture and mix just until barely combined. Add the rest of the buttermilk and mix just until combined. Be careful not to overmix. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point, it is best to finish the mixing by hand. Remove the bowl from the mixer stand and, using the rubber spatula, fold in the remaining flour mixture just until the batter is homogeneous. As you fold, be sure to incorporate any batter clinging to the sides and bottom of the bowl. Divide the batter evenly between the prepared cake pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 40 to 50 minutes, or until the tops are golden brown and the cakes spring back when pressed in the middle with a fingertip. Let cool completely in the pans on wire racks. (The cooled cakes can be tightly wrapped in plastic wrap and stored in the freezer for up to 1 week. Thaw at room temperature, still wrapped tightly in plastic wrap.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cake layers are cooling, make the frosting. To make the ganache, put the chocolate in a medium heatproof bowl. In a small saucepan, scald the cream over medium-high heat (bubbles start to form around the edge of the pan, but the cream is not boiling). Pour the hot cream over the chocolate and let sit for about 1 minute, then slowly whisk the chocolate and cream together until the chocolate is completely melted and the mixture is smooth. Let sit at room temperature for 1 to 2 hours, or until completely cool. (Or, refrigerate the ganache until cool, about 30 minutes, whisking every 10 minutes.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit the stand mixer with the paddle attachment (or use a handheld mixer) and beat the butter on medium-low speed for 10 to 15 seconds, or until smooth. Add the confectioners’ sugar, salt, and vanilla and continue to beat on medium-low speed for about 2 minutes, or until the mixture is fluffy and smooth. Stop the mixer a few times and use a rubber spatula to scrape the bowl and the paddle to release any clinging butter or sugar. On medium speed, add the cooled ganache and beat for about 2 minutes, or until completely combined. Stop to scrape the sides and bottom of the bowl. Turn the mixer speed to medium-high and beat for about 1 minute, or until the frosting lightens in color and thickens. You should have about 4 cups. (Use the frosting the day you make it, or cover and store in the refrigerator for up to 1 day, then bring to room temperature and paddle again for a few minutes until smooth before using.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cooled cakes from their pans. (Be sure they are completely cool. If they are even the slightest bit warm, the frosting will melt and you will have a mess.) Using a long, serrated knife, trim the top of each cake to level it (the layers will have rounded a bit in the oven; the trimmed scraps make great nibbles). Place 1 cake layer on a cake plate or cake pedestal (if you have a revolving cake stand, use it). Spoon about 1 cup of the frosting on top and use an offset spatula to spread it evenly to the edges. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully place the second cake layer, top side down (so the even, sharp edges will be on the top of the finished cake), on top. Spoon about 1 cup of the frosting on top and spread it over the top and down the sides of the cake, smoothing the frosting as well as you can and covering the entire cake with a thin layer. This is the crumb coat, which will keep any loose crumbs from migrating to the surface of the finished cake. Spoon a heaping cup of frosting on top of the cake, and spread it evenly across the top and down the sides. This is the finishing layer of frosting. If desired, spoon any remaining frosting into a pastry bag fitted with a small round or star tip and pipe a decorative line along the top and/or bottom edge of the cake. </p>\n\n<p>The cake can be stored in an airtight container at room temperature for up to 2 days.</p>"}]}