{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110223-138940-chocolate-almond-orangettes-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["almonds", "chocolate", "Edible DIY", "orangettes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bitter Chocolate-Almond Orangettes", "link": "https://www.seriouseats.com/recipes/2011/02/bitter-chocolate-almond-orangettes-recipe.html", "description": "Orangettes are not only très chic, they're also très economical. In this version, the flavors are pumped up with bitter dark chocolate, toasted almonds, and a splash of amaretto. They will keep for up to two weeks, stored in an...", "totalTime": null, "recipeYield": "Makes approximately 100 orangettes", "recipeCategory": ["Candy", "Chocolate", "Desserts", "Edible DIY", "Nuts"], "recipeIngredient": ["6 medium navel oranges", "4 cups granulated sugar, plus more for coating", "1 cup slivered almonds", "7 ounces (two 3.5-ounce bars) dark chocolate, preferably 85%, chopped", "1 teaspoon amaretto "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice tops and bottoms off each orange. Score remaining peel into quarters. Remove each peel in four strips. Reserve oranges for another use. Cut strips lengthwise into 1/4-inch slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put orange peels in medium saucepan and add cold water to cover. Bring to boil over medium heat. Pour off water. Repeat one or two more times. (Blanching peels removes some of the bitterness.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 4 cups sugar and 1 cup water in large saucepan. Bring to a simmer, and cook for 10 minutes. Add orange peels and continue to simmer until peels are slightly translucent, 45 minutes.  Drain peels and toss with sugar to coat. Let peels dry on wire rack for 6 to 8 hours, or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300ºF. Spread slivered almonds on baking sheet and bake until golden and fragrant, 5 to 7 minutes. Transfer almonds to food processor and pulse until coarsely ground. Transfer ground almonds to shallow bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate in heatproof bowl set over pan of simmering water. Heat, stirring frequently, until chocolate has melted. Remove bowl from heat and stir in amaretto.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip each orange peel in chocolate and then roll in ground almonds. Transfer peels to wire rack and allow to stand until chocolate has hardened, 2 to 3 hours. Store orangettes in airtight container at room temperature for up to two weeks. </p>"}]}