{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20110629emilyluchetti-summerpudding.jpg", "author": {"@type": "Person", "name": "Emily Luchetti"}, "recipeCuisine": "", "keywords": ["Emily Luchetti", "fruit desserts", "puddings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Summer Pudding", "link": "https://www.seriouseats.com/recipes/2011/06/summer-pudding-recipe-berry-dessert.html", "description": "For me, this is the quintessential summer dessert; once I have it, I know summer has arrived. The summer berry pudding takes a bit of time to prepare, but it's all done ahead of time, so it's not too much effort.", "totalTime": "6 hours 35 minutes", "recipeYield": "8", "recipeCategory": ["Fruit Desserts", "Puddings and Custards"], "recipeIngredient": ["3 pints strawberries (about 6 cups), hulled and quartered", "1 cup granulated sugar", "1 tablespoon freshly squeezed lemon juice", "Pinch of kosher salt", "2 pints blackberries (about 4 cups)", "2 1/2 pints raspberries (about 5 cups)", "1 loaf (1 pound) Brioche, Challah, or thick sliced white bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray an 8 1/2-by-4 1/2-by-2 3/4-inch loaf pan with nonstick spray. Line the sprayed pan with plastic wrap, making sure to press it into the corners and allowing a 1 1/2-inch overhang on all sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy, nonreactive saucepan, combine the strawberries, sugar, lemon juice, and salt over medium-low heat and cook, stirring occasionally, until the strawberries begin to give up some of their juice, about 10 minutes. Add the blackberries and raspberries and continue cooking until all the berries are soft and have broken apart, forming a sauce, about 10 minutes. Remove from the heat and let cool to warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim off the crusts from the brioche and cut the loaf into 32 slices. Each slice will be about 1/4 inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread 1/2 cup of the berry sauce into the bottom of the prepared pan. One piece at a time, dip the brioche into the sauce in the saucepan, saturating it. Place the berry-soaked brioche pieces in the pan, forming a single layer and a snug fit. Spread 1/2 cup of the berry sauce on top of the brioche. Repeat the layering, starting with the berry-soaked brioche, until the pan is full, ending with the berry sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with the plastic wrap overhanging the sides and place the loaf pan on a baking sheet. Cover with a pan just large enough to fit over the loaf pan, and put a large food can or other weight heavy enough to compress the pudding into the second pan. Refrigerate for at least 6 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To unmold the pudding, remove the weight and second pan, fold back the plastic wrap, and invert the loaf pan onto a cutting board. Lift off the pan and carefully peel off the plastic. Cut the loaf into 8 slices and place on individual plates. Top with whipped cream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Planning Ahead:</strong> The pudding may be made 2 days in advance and kept refrigerated. Unmold just before serving.<br />\r\n</p>"}]}