{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120610-stir-fry-grill-wok-21.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["beef", "Chinese", "Chinese American", "pepper steak", "quick", "stir fry", "The Food Lab", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1818181818182", "ratingCount": "11"}, "name": "Chinese Pepper Steak (Stir-Fried Beef with Onions, Peppers, and Black Pepper Sauce)", "link": "https://www.seriouseats.com/recipes/2012/06/chinese-pepper-steak-stir-fried-beef-with-onions-peppers-and-black-pepper-sauce-recipe.html", "description": "<em>Wok Hei</em>, the smoky, charred flavor or well-cooked stir-fries can make or break Pepper Steak, the classic Chinese-American staple. Our version combines tender steak with bell peppers and onions in a savory black pepper-flavored sauce. For best results, we cook it on a wok set on an outdoor coal grill.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Chinese", "Mains", "Stir Frying", "The Food Lab"], "recipeIngredient": ["1 pound flank steak, skirt steak, hanger steak, or flap meat, cut into 1/4-inch thick strips", "1/4 cup soy sauce (divided)", "1/3 cup shaoxing wine or dry sherry (divided)", "2 tablespoons corn starch", "1/3 cup low-sodium homemade or store-bought chicken stock", "1 tablespoon sesame oil", "1 tablespoons sugar", " 1 tablespoon freshly ground black pepper", "2 green bell peppers, cored and cut into 1-inch squares (about 2 cups)", "1 red bell pepper, cored and cut into 1-inch squares (about 1 cup)", "1 medium onion, cut into 1-inch strips from pole to pole (about 1 1/2 cups)", "2 medium cloves garlic, finely minced (about 2 teaspoons)", "2 teaspoons finely minced fresh ginger", "3 scallions, whites only, finely minced", "4 tablespoons vegetable, peanut, or canola oil", "Kosher salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beef, 1 tablespoon soy sauce, and 1 tablespoon xiaoshing wine in a bowl and toss to coat. Let marinate for at least 20 minutes at room temperature and up to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine remaining soy sauce with corn starch and stir with a fork to form a slurry. Add remaining xiaoshing wine, chicken stock, sesame oil, sugar, and pepper. Set aside. Combine peppers and onions in a bowl and set aside. Combine garlic, ginger, and scallions in a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Grill With a Wok Insert</strong>: <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals in a pile on center of cooking grate. Place  <a href=\"http://www.amazon.com/gp/product/B0044EQM9Q/?tag=serieats-20\">Weber 8835 Gourmet BBQ System Hinged Cooking Grate</a> on grill and set wok in center. Add oil and heat until smoking. Add beef and cook, stirring and tossing until beef is lightly charred but still pink in spots, about 1 minute. Push beef to sides of wok to clear space in center. Add peppers and onions and cook, stirring vegetables in center until lightly charred, about 30 seconds. Toss with beef and push up sides of wok. Add garlic/ginger/scallion mixture to center of wok and immediately push all ingredients into center, tossing and stirring until beef is cooked through and vegetables are just barely tender, about 30 seconds longer. Stir sauce and pour into wok (it should immediately start to boil). Toss all ingredients to coat in sauce and cook until lightly thickened, about 30 seconds. Carefully transfer to a serving platter and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook On A Burner</strong>: When ready to cook, heat 1 tablespoon oil in a wok over high heat until smoking. Add half of beef and cook without moving until well seared, about 1 minute. Continue cooking while stirring and tossing until lightly cooked but still pink in spots, about 1 minute. Transfer to a large bowl. Repeat with 1 more tablespoon of oil and remaining beef, adding beef to same bowl. Wipe out wok. Repeat with 1 more tablespoon oil and half of peppers and onions. Transfer to bowl with beef. Repeat with remaining oil and remaining peppers/onions. Return wok to high heat until smoking. Return peppers/onions/beef to wok and add garlic/ginger/scallion mixture. Cook, tossing and stirring until fragrant, about 30 seconds. Add sauce and cook, tossing and stirring constantly until lightly thickened, about 45 seconds longer. Carefully transfer to a serving platter and serve</p>"}]}