{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120221star610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "candy", "fruit roll ups", "gluten free", "strawberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Strawberry Fruit Roll-Ups", "link": "https://www.seriouseats.com/recipes/2012/03/strawberry-fruit-roll-up-recipe.html", "description": "These fruit roll-ups might not be healthy, but they taste exactly like the ones you remember.", "totalTime": "3 hours", "recipeYield": "makes 16 roll-ups", "recipeCategory": ["Candy", "Dairy-Free", "Desserts", "Gluten-Free", "Strawberry", "Vegan"], "recipeIngredient": ["12 ounces dried pears or apple, roughly chopped ", "24 ounces apple juice, divided ", "12 ounces sugar", "6 ounces corn syrup", "1.2 ounces (1 bag) freeze dried strawberries or other fruit", "1 ounce lemon juice", "3/4 ounce coconut oil, or other neutral flavored oil", "1/2 teaspoon rose flower water", "optional: a few drops of food coloring"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make The Fruit Puree:</strong> Combine chopped dried fruit with 12 ounces of apple juice, sugar and corn syrup in a medium pot. Bring to a simmer and cook until the fruit has become tender and the mixture has become extremely dry and thick.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in the bowl of a food processor, pulse the freeze dried strawberries until reduced to a powder. </p>\n\n<p>When the fruit has finished cooking, add the mixture to the strawberry powder in food processor bowl. Pulse until chunky. Add the remaining apple juice, lemon juice, coconut oil, rose flower water and food coloring, if using. Processes continuously until the mixture has become quite smooth and no large chunks remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the most authentic Fruit Roll-Ups, pass this fruit mixture through a food mill or a sieve and discard any solids that won't pass through (about 3 ounces). It'll take some elbow grease, but you'll be rewarded with some freakishly smooth roll-ups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Dry The Roll-Ups:</strong> Preheat the oven to 150&deg;F, or as low as your oven will go. Line two sheet pans with silicon mats (I've read microwave-safe plastic wrap works too, but I haven't tested that myself). Pour half the mixture into each and spread into an even, thin layer with an offset spatula.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry roll-ups in the oven for 6 to 10 hours. I know that's a big window, but all ovens differ wildly in how low of a temperature they can achieve. The time it takes will depend on your lowest oven temperature and roll-up preferences. In any event, you want to dry the fruit puree until it is perfectly dry to the touch and not at all squishy when pressed firmly. You should be able to peel up a corner and tug gently without the roll-up tearing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cut And Store The Roll-Ups: </strong> When the fruit puree has dried adequately, remove from oven and cool to room temperature. Use a knife to loosen the fruit sheets from the edges of the pan. Press a sheet of parchment or wax paper against the surface of the fruit and invert onto a cutting board. Peel off the plastic wrap or silicon from the bottom. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want to make shapes for \"pull outs,\" use the tip of a knife to gently score each sheet into 8 square portions (this will prevent you from stamping shapes that will accidentally get cut in half when you portion out the roll-ups). Next, use a cookie cutter to stamp various shapes, but do not remove them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, whether you're making pull outs or not, place a fresh sheet of plastic wrap over the exposed fruit. Use the tip of a chef's knife to cut through the plastic wrap, fruit and parchment, dividing each fruit sheet into 8 squares. For Fruit by the Foot, just cut each large sheet into 8 long strips instead. Either way, roll them up and store in an airtight container for about one week at room temperature. </p>"}]}