{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120710-127677-LTE-Coconut-Espresso-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cake", "coconut", "espresso", "layer cakes", "Let them eat cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coconut and Espresso Cream Layer Cake", "link": "https://www.seriouseats.com/recipes/2012/07/coconut-and-espresso-cream-layer-cake-recipe.html", "description": "Layers of cake permeated with coconut flavor are slathered with heady espresso and sweetened condensed milk whipped cream. Each bite is soft, rich, and luscious.", "totalTime": "3 1/2 hours", "recipeYield": "serves 12", "recipeCategory": ["Cakes", "Coconut", "Let Them Eat..."], "recipeIngredient": ["<strong>For the Cake Layers:</strong>    ", "Baking spray", "2 1/4 cups (about 11 1/4 ounces) all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt", "1/2 teaspoon baking soda", "2 sticks (8 ounces) unsalted butter, at room temperature", "1 1/4 cups (about 8 3/4 ounces) granulated sugar", "3/4 cup (about 5 1/4 ounces) coconut sugar (see note)", "1 cup (from 1 15-ounce can) sweetened cream of coconut (See Notes)", "4 large eggs, at room temperature", "1 cup buttermilk, at room temperature", "2 teaspoons pure vanilla extract", "2 cups sweetened flaked coconut", "   ", "<strong>For the Espresso Cream:</strong>    ", "3 tablespoons instant espresso powder", "1 tablespoon boiling water", "1/2 cup sweetened condensed milk", "3 ounces cream cheese, softened", "1 cup confectioners’ sugar", "1/8 teaspoon salt", "3 cups heavy or whipping cream, chilled", "1 teaspoon pure vanilla extract", "1 tablespoon cocoa nibs (Optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake Layers:</strong> Adjust oven racks to upper middle and lower middle positions and preheat oven to 350&deg;F. Spray three 9-inch round baking pans with baking spray. Line bottoms of pans with parchment paper rounds and once again spray with baking spray.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, baking powder, salt, and baking soda together in medium bowl; set aside. Beat butter, granulated sugar, and coconut sugar on medium speed until light and fluffy, 2 to 3 minutes. Add cream of coconut and beat to combine, about 1 minute. Add eggs, one at a time, beating until each egg is fully incorporated into batter prior to adding the following one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce speed to low and add flour mixture in three batches, alternating with buttermilk, scraping bottom and sides of bowl with rubber spatula as needed. Add vanilla and beat just to combine, about 5 seconds. Fold in coconut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter equally among prepared pans. Place two cake pans side by side on top rack and third cake pan on bottom rack. Bake until cake tester inserted in center of cakes comes out clean, 20 to 25 minutes, alternating and rotating cake pans’ positions halfway through baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cakes to cooling racks and cool in pans 10 minutes. Turn cakes directly onto cooling racks and cool completely, about 1 hour. Once cooled, with a serrated knife, trim off any excess, ragged pieces of cake tops. Cut each cake in half to create 6 layers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Espresso Cream and Assembly:</strong> Combine espresso powder and boiling water in small bowl. Stir in sweetened condensed milk; reserve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat cream cheese, confectioners’ sugar, and salt on low speed until combined, about 20 seconds. Increase speed to medium and beat until fluffy, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sweetened condensed milk/espresso mixture and beat to combine, about 30 seconds. Reduce speed to low, add cream and vanilla, and beat to combine. Return speed to medium and beat until cream forms soft peaks, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one cake layer on cake stand or serving plate. Spread layer with about 1 cup whipped cream, then top with second cake layer and additional 1 cup whipped cream. Repeat procedure with remaining cake layers and cream. Sprinkle top with optional cocoa nibs. Chill cake 1 hour prior to serving. Store leftovers in refrigerator.</p>"}]}