{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120500-knead-book-fast-breads-corn-sticks%202.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "cornbread", "cornsticks", "knead the book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fast Breads' Southern Corn Sticks", "link": "https://www.seriouseats.com/recipes/2012/05/fast-breads-southern-corn-sticks.html", "description": "[Photograph: Donna Currie] As always with our Knead the Book feature, we have five (5) copies of Fast Breads to give away this week. Enter the contest here. These corn sticks from Fast Breads use just a little bit of...", "totalTime": "25 minutes", "recipeYield": "Makes 7 corn sticks", "recipeCategory": ["Bread Baking", "Cornbread"], "recipeIngredient": ["2 teaspoons unsalted butter, melted", "1 tbsp corn or canola oil plus 1 tbsp", "2 tablespoons unbleached all-purpose  flour", "3/4 cup fine-grind stone-ground yellow cornmeal", "1 tablespoon granulated sugar ", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon kosher salt ", "1/2 cup buttermilk, any fat content ", "1 large egg "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and preheat to 425ºF. Have ready a heavyweight corn stick pan with 7 openings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small pan, melt the butter with 1 teaspoon of the oil. Use a pastry brush to brush the pan openings generously with the butter-oil mixture. Heat the pan in the oven for 5 minutes while you mix the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, stir together the flour, cornmeal, sugar, baking powder, baking soda, and salt. Add the buttermilk, egg, and the remaining 1 tbsp oil and use a large spoon to stir the batter slowly just to combine the ingredients. You will see some small lumps; that’s okay. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and spoon about 2 tablespoons of the batter into each opening. The batter will fill to the rim. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the tops are lightly browned and a toothpick inserted in the center of a corn stick comes out clean, about 15 minutes. The bottoms of the corn sticks will be browned. Let cool in the pan on a wire rack for 5 minutes. Use a small, sharp knife and your fingers to loosen the edges of the sticks and carefully remove the sticks from the pan to the rack. Do not turn the pan upside down to release the corn sticks because it could weigh them down and may break them. Serve warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The corn sticks can be baked a day ahead, covered, and left at room temperature. To serve, preheat the oven to 275ºF and reheat the sticks, uncovered, until warm, about 10 minutes.</p>"}]}