{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120529-195206-mud-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "mud pie", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Mud Pie", "link": "https://www.seriouseats.com/recipes/2012/06/chocolate-mud-pie-recipe.html", "description": "This chocolate mud pie is the perfect chocolate dessert for a hot day. A thick crust of chocolate cookie crumbs surrounds a lusciously chilled, dark chocolate pudding. Top it off with a little bit of whipped cream and more chocolate crumbs and you have a perfect contrast of smooth and crunchy chocolate that's impossible to resist.", "totalTime": "9 hours", "recipeYield": "serves 8", "recipeCategory": ["Chocolate", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["12 ounces chocolate wafter cookies (Nabisco brand works well), ground to crumbs in food processor", "4 ounces (1 stick) unsalted butter, melted", "4 ounces (about 2/3 cup) granulated sugar", "3 tablespoons cornstarch", "1/2 teaspoon salt", "4 egg yolks", "16 ounces (about 2 cups) whole milk", "1 tablespoon vanilla extract", "8 ounces semi-sweet chocolate, melted and cooled", "6 ounces chilled heavy cream, whipped to soft peaks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate out 2 ounces of cookie crumbs and set them aside. In a bowl, stir together the remaining cookie crumbs and butter, and firmly press mixture into the bottom and up the sides of a 9-inch pie plate. Freeze crust 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium sized bowl, whisk together the sugar, corn starch, and salt. In a small bowl, beat the egg yolks with a whisk, then add them to the dry ingredients and whisk well, until the yolks are pale and smooth, about 2 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the milk and vanilla and bring to a low boil over medium heat. When the milk begins to boil, turn off the heat and temper the egg mixture by adding a little of the hot liquid to the egg mixture at a time, whisking as you go. Once all of the milk has been added, pour the mixture back into the saucepan and place it over low heat. Cook, whisking constantly until mixture begins to thicken, about 3 minutes. Continue to whisk. Once the mixture bubbles, whisk for 2 additional minutes, then remove from heat. Whisk in the chocolate until fully combined, then pour filling into chilled pie shell. Press plastic wrap over the top, and chill for 8 hours to set. When ready to serve, top with whipped cream and reserved cookie crumbs.</p>"}]}