{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120904-221263-raspberry-mousse-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cream pies", "pie of the week", "pies", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Raspberry Mousse Pie", "link": "https://www.seriouseats.com/recipes/2012/09/raspberry-mousse-pie-recipe.html", "description": "This pie recipe calls for frozen raspberries, delivering the flavor of summer, anytime of year. Unlike many other mousse recipes that call for egg whites, this one relies on whipped cream stabilized with gelatin to give the mousse its lift. It's just sweet enough, and feels deliciously light on the tongue, perfectly complimented by the flaky, all-butter crust.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles", "Raspberry"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "2 1/2 cups (20 ounces) cold heavy cream, divided", "1 ounce confectioner's sugar", "2 teaspoons powdered, unflavored gelatin", "4 ounces granulated sugar", "12 ounces frozen raspberries, thawed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust turns golden brown, about 10 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk the heavy cream with the confectioner's sugar until soft peaks form. Transfer to refrigerator until ready to use. Place 1/4 cup cold water in a small small container and sprinkle with gelatin. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the granulated sugar and thawed berries and bring to a simmer over low heat, stirring occasionally to break up the solid pieces. Allow the berries to simmer until the completely broken up and some of the water has evaporated, thickening the mixture, about 20 minutes. Remove from heat and immediately whisk in the bloomed gelatin. Whisk for one minute, to ensure that the gelatin is completely dissolved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a large bowl filled two thirds of the way to the top with ice and water and set aside. Place the saucepan with berry mixture into the prepared bowl of ice and water and allow it to chill. Stir it regularly to keep the gelatin from setting up until the raspberry mixture feels cold to the touch, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the raspberry mixture to a large bowl. Stir in about 1/4 of the chilled whipped cream, to lighten the raspberry mixture, then use a big rubber spatula to fold in half of the remaining whipped cream. Fold gently until the color is consistent, taking care not to deflate the mousse. Return the rest of the cream to the fridge to be used as topping. Pour the mousse into the cooled pie shell and chill in the fridge for at least 3 hours before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve re-whip the remaining cream just enough to bring it back to soft peaks. Using a piping bag fitted with a large star tip pipe the cream onto the top of the pie. Serve immediately, and refrigerate leftovers.</p>"}]}