{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120825-195206-fig-and-hazelnut-tart-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["figs", "pie of the week", "pies", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fresh Fig and Hazelnut Tart", "link": "https://www.seriouseats.com/recipes/2012/08/fresh-fig-hazelnut-tart-recipe.html", "description": "This tart brings fresh figs and hazelnuts together with a crumbly crust for a delightful combination of flavor and texture. This is the perfect dessert for late summer, when you want a little bit of something sweet to go with an after dinner drink.", "totalTime": "8 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1/2 <a href=\"http://www.seriouseats.com/recipes/2012/03/pate-sucree-tart-shell-recipe.html\">recipe for pate sucree</a>, rolled out, shaped in a tart pan, and chilled", "1 cup blanched hazelnuts, toasted ", "1/2 cup (about 3 1/2 ounces) granulated sugar", "1/4 cup (about 2 1/4 ounces) light brown sugar", "1/2 teaspoon kosher salt", "2 large eggs", "1/2 cup (1 stick) unsalted butter, cold, cut into chunks", "2 tablespoons Frangelico (optional)", "1 tablespoon vanilla extract", "15 to 20 fresh figs, stems trimmed and cut in half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 350&deg;F. When oven is ready, line chilled tart shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 20 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a golden brown, about 10 minutes. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and increase heat to 375&deg;F. In the bowl of a food processor, combine hazelnuts, both sugars, and the salt. Pulse until the mixture is sandy and there are not large pieces of nuts left. Add the eggs, butter, Frangelico, and vanilla and pulse until the eggs are smooth but chunks of butter are still visible, about 15 - 20 short pulses. Scrape the sides of the food processor and pulse an additional 5 times. Scrape the mixture into the cooled tart shell. Arrange the figs cut-side-up on top of the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the tart for 20 minutes at 375&deg;F, then rotate the tart 90 degrees on the rack. Lower the oven temperature to 325&deg;F and bake until the figs begin to bubble and caramelize and the filling turns golden brown all over, about 45 additional minutes, turning again halfway through. Remove from the oven and allow to cool completely before serving.</p>"}]}