{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120423-127677-Sandwiched-Welsh-Rarebit-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["beer", "cheddar cheese", "cheese sauce", "sandwich", "sandwiched", "waffles", "welsh rarebit"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Welsh Rarebit on Beer Waffles with Bacon and Tomatoes", "link": "https://www.seriouseats.com/recipes/2012/04/sandwiched-welsh-rarebit-on-beer-waffles-with.html", "description": "Notes: I have 2-waffle iron, with relatively deep grooves. I pour 1 heaping 1/4 cup of batter into each square. Recipe should yield 8 waffles. Waffle recipe adapted from Bon Appétit Ham and Cheese Waffles. Welsh rarebit must be served...", "totalTime": "1 hour", "recipeYield": "makes 8 open-face sandwiches", "recipeCategory": ["Bacon", "Cheese", "Sandwiches", "Waffle"], "recipeIngredient": ["<strong>For the Waffles</strong>    ", "1 3/4 cups (about 8 1/2 ounces) all-purpose flour", "2 tablespoons sugar", "2 teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "3 large eggs, separated", "1 1/2 sticks unsalted butter (6 ounces), melted", "1 cup buttermilk", "3/4 cup porter ale", "Cooking spray", "   ", "<strong>For the Sauce and Assembly</strong>   ", "16 strips thick-cut bacon", "12 scallions, thinly sliced", "4 tablespoons unsalted butter, cut into 4 pieces", "4 tablespoons all-purpose flour", "2 teaspoons Worcestershire sauce", "2 teaspoons dry mustard", "1/8 teaspoon cayenne pepper", "1/2 cup heavy cream", "1/2 cup porter ale", "2 large egg yolks", "2 cups (8 ounces) shredded extra-sharp yellow cheddar cheese", "Salt and pepper", "16 thick slices tomato from 4 large, ripe tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Waffles:</strong> Adjust oven racks to upper-middle and lower-middle positions and preheat oven to 300&deg;F. Place a baking sheet on lower-middle rack. Heat waffle iron according to manufacturer’s instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, whisk together flour, sugar, baking powder, baking soda, and salt. In medium bowl, whisk together egg yolks, melted butter, buttermilk, and ale.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In clean, dry bowl, beat egg whites on medium speed until firm, but not dry, peaks form. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk beer mixture into flour mixture until incorporated. With rubber spatula, fold in egg whites.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat waffle iron with cooking spray. Cook waffles according to manufacturer’s instructions, until crisp and golden. With tongs, carefully transfer to baking sheet in oven and repeat procedure until you run out of batter (see notes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Cook bacon in 2 to 3 batches in large skillet over medium heat until crisp and golden, 6 to 8 minutes per batch.  Reserve 2 tablespoons fat, and discard any additional rendered fat accumulated between batches. With slotted spoon, transfer cooked bacon paper towel-lined plate. Alternatively, line dinner plate with 2 layers paper towels. Arrange 4 bacon slices on top, then cover with 2 more layers paper towels. Microwave 4 to 6 minutes until crisp. Repeat with remaining bacon and fresh paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook scallions over medium heat in rendered bacon fat (if you microwaved the bacon, cook the scallions in 2 tablespoons butter) until softened, about 3 minutes. Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 4 tablespoons butter in large heavy-bottomed saucepan over medium heat. Add flour and cook, stirring constantly, until pale golden, about 2 minutes. Stir in Worcestershire, dry mustard, and cayenne and cook 30 seconds. In a slow, steady stream add cream and ale, whisking constantly and vigorously to avoid lumps. Whisk in egg yolks. Add cheese and cook, stirring, until completely melted. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Assembly:</strong> Transfer waffles on tray to cooling rack and increase oven heat to broil. Break each bacon strip in half. Top each waffle with 4 pieces bacon and 2 slices tomato, then sprinkle with the cooked scallions. Spoon about 1/4 cup sauce over each and broil on top rack until bubbling and brown at the edges (time will vary according to oven). Serve immediately.</p>"}]}