{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120928-223558-cook-the-book-smores-with-maple-bourbon-marshmallows.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["bourbon", "chocolate ganache", "Cook the Book", "eli sussman", "marshmallows", "max sussman", "s'mores", "this is a cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Max and Eli Sussman's S'mores with Maple-Bourbon Marshmallows", "link": "https://www.seriouseats.com/recipes/2012/09/max-and-eli-sussmans-smores-with-maple-bourbo.html", "description": "Throw some bourbon and maple syrup into homemade marshmallows as <strong>Max and Eli Sussman</strong> suggest in <em><a href=\"http://www.amazon.com/This-Cookbook-Recipes-Real-Life/dp/1616282142?tag=serieats-20\">This is a Cookbook</a></em>, and you've got an excellent adult-style treat. The brothers take their marshmallows one step further by incorporating them into a year-round take on s'mores (with ganache instead of Hershey's). These are no girl-scout dessert--they're boozy, sweet, and the sheer size of the marshmallows will gleefully turn even the most resolute health nut on the path to diabetes--but they're totally worth it.", "totalTime": "5 hours", "recipeYield": "makes 9 s'mores", "recipeCategory": ["Candy", "Chocolate", "Cook the Book"], "recipeIngredient": ["Vegetable oil cooking spray (not olive oil)", "Powdered sugar, for dusting", "2 tablespoons unflavored gelatin", "1/4 cup bourbon, plus 3 tablespoons", "3/4 cup pure maple syrup", "1 1/2 cups granulated sugar", "4 ounces bittersweet chocolate (60% cacao), chopped", "1/2 cup heavy cream", "9 graham crackers, snapped in half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of a 9-inch square baking dish with parchment paper or foil. Coat lightly with cooking spray and dust generously with powdered sugar. Pour 1/2 cup warm water into a small bowl. Sprinkle the gelatin over and stir to dissolve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan over medium-high heat, combine the 1/4 cup bourbon, the maple syrup, and the granulated sugar. Bring to a boil and cook and cook, stirring often, until the mixture registers 240 degrees on a candy or deep-frying thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into the bowl of a stand mixer, if you have one. Add the dissolved gelatin and the remaining 3 tablespoons bourbon. Using the paddle attachment, beat until stiff peaks form when you lift the beaters out 10 to 12 minutes. If you don't have a stand mixer, use a handheld mixer, but be sure to pour the hot syrup into a heatproof bowl for mixing, and be prepared for a little arm fatigue, as the beating time is substantial. Using a rubber spatula, scrape into the prepared dish and spread in an even layer to the edges of the pan. Let cool at room temperature until firm, about 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tip the marshmallow out of the pan and remove the lining. Trim 3/4 inch off each edge, then cut into 9 squares. Sift a scoop of powdered sugar in a bowl, add the marshmallows, and toss to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chocolate in a heatproof bowl. In a small saucepan over medium-high heat, warm the cream until just barely boiling. Meanwhile, arrange 9 of the graham cracker halves, top side down, on a baking sheet and place a marshmallow on top of each. Pour the hot cream over the chocolate and whisk until melted and smooth. Drizzle some of this melted chocolate mixture over each marshmallow, close the s'mores with another graham cracker half, and serve.</p>"}]}