{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120507-204897-knead-the-book-fast-breads-artisinal.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fast Breads' Crusty Artisanal Bread", "link": "https://www.seriouseats.com/recipes/2012/05/crusty-artisanal-bread-recipe.html", "description": "[Photograph: Donna Currie] As always with our Knead the Book feature, we have five (5) copies of Fast Breads to give away this week. Enter the contest here. Every bread baker should have at least one recipe for an artisan-style...", "totalTime": "6 to 8 hours, plus up to 2 days rising in refrigerator", "recipeYield": "makes 1 or 2 loaves (depending on shape chosen)", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["3 cups unbleached all-purpose/plain flour", "1 cup unbleached bread/strong flour", "1/4 cup whole-wheat flour", "1 tbsp kosher salt", "2 1/4 tsp active dry yeast (one 1/4-oz packet) ", "2 cups water, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the flat beater, mix together the 3 flours, salt, and yeast on low speed just until combined. Add 1 3/4 cups of the water and mix until all the ingredients are smoothly combined, then beat for 4 minutes. The dough will be soft and sticky and will not come away from the sides of the bowl. Cover the bowl with a clean kitchen towel and let the dough rest for 15 minutes. The flour will absorb some of the water and the dough will be less sticky. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit the mixer with the dough hook, add the remaining 1/4 cup water, and beat on low speed for 6 minutes. After about 4 minutes, the still-soft dough should begin to come away from the sides of the bowl. If it does not, sprinkle in flour, 1 tsp at a time, adding just enough to allow the dough to come away from the sides of the bowl. On a dry winter day, additional flour will probably not be necessary. On a humid day, a small quantity of flour may be needed. The dough should be soft and very pliable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To knead the dough by hand, transfer it to a floured work surface and knead for about 5 minutes, adding just enough flour to keep the dough from sticking to the work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle a large, clean bowl with flour and transfer the dough to the bowl. Sprinkle the top lightly with flour. Cover the bowl with plastic wrap and refrigerate overnight or up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and punch down the dough to press out the air. Divide the dough in half. For a round loaf, or boule, line a round basket or bowl about 8 in in diameter (at the top) with a clean kitchen towel. Dust the liner generously with flour. To form the boule, on a floured work surface, press half of the dough into an 8-in circle. Bring up 4 opposite edges to the center of the circle, and press firmly with a finger to seal them together. Then bring up the remaining 4 opposite edges of the circle—like gathering the edges of a piece of cloth into a sack—so that all of the edges are at the center, and press with a finger to seal. Carefully place the boule, seam side up, in the lined basket. If making 2 boules, repeat with the remaining dough half and another basket. Sprinkle the top surface each loaf lightly with flour, cover each with a clean kitchen towel, and let the dough rise for 45 minutes. The dough will look puffy and soft, but it will not rise a lot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form 1 or 2 baguettes or long loaves, place a heavy cloth (canvas is good) or clean kitchen towel on a rimless baking sheet/tray and flour it, or flour 1 or 2 single or 1 double baguette pan. (The baking sheet/tray makes it easy to move the risen bread and cloth.) On a floured work surface, pat half of the dough into a 6-by-4-in rectangle. Fold the rectangle in half lengthwise and press the seam to seal. Use your palms to roll the dough back and forth, gently moving your palms along the length of the dough to make a loaf as long as you want. I recommend you make it about 9 in. To taper the ends and leave the middle thicker for a bâtard, increase the pressure as you move toward the ends. Place the loaf, seam side up, on the floured cloth, and roll up the cloth against the long sides of the loaf to support it as it rises. Or, put the loaf, seam side down, in the floured baguette pan. If making 2 long loaves, repeat with the remaining dough half and another baking sheet/tray and cloth or the remaining baguette furrow. Sprinkle the top of each loaf lightly with flour, cover with a clean kitchen towel, and let the dough rise for 45 minutes. The dough will look puffy and soft, but it will not rise a lot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has risen for 35 minutes, position a rack in the middle of the oven and preheat to 475ºF. Have ready a metal pie pan with a clean rock in it or an empty metal pie pan. If not using a baguette pan, sprinkle a baking sheet/tray with flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has risen for 45 minutes, gently tip the dough in 1 of the baskets onto the prepared pan, or unroll both ends of the cloth and lift one end to roll the long loaf onto the prepared pan. Repeat with the second loaf. The loaves should now be seam side down and at least 2 in. Slide them gently to separate them, if necessary. Using a small, sharp knife, and holding it at a roughly 45-degree angle to the top of the bread, cut a long slash or a crisscross in the top of the round loaves, or a series of  4 or 5 evenly spaced, diagonal slashes along the width of the baguettes. Cut firmly to make each slash about 1/4 in. Sprinkle flour lightly on top of each loaf and re-cover with the kitchen towel. Let rise for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pie pan on the lowest rack in the oven 5 minutes before the bread is ready to go into the oven. When the bread is ready, sprinkle about 2 tbsp water over the rock to create steam, or sprinkle the same amount into the empty pan. There should be a burst of steam at the beginning and the steam should last for about the first one-third of the baking time. Put the bread in the oven and bake until browned and crusty, about 25 minutes. The bread will rise 11/2 to 2 in during baking. Remove from the oven, immediately slide onto wire racks, and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You may hear crackling sounds as the bread cools, which is good. The cooled bread will have a firm, but not hard crust. The interior will be moist with holes that vary from tiny to about 1/4-in/6 mm in diameter. Use a serrated knife to slice the bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The bread can be stored in a paper bag at room temperature for up to 3 days. If the bread is cut, wrap a piece of plastic wrap around the cut end before slipping it into the bag. To serve, preheat the oven to 275ºF and heat the loaf, placed directly on the oven rack, until the crust is crisp and feels warm, about 10 minutes.</p>"}]}