{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120224-194459-mushroom-and-farro-burgers-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "farro", "Masala Farm", "mushrooms", "sandwich", "Suvir Saran", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Suvir Saran's Farro and Mushroom Burgers", "link": "https://www.seriouseats.com/recipes/2012/03/suvir-sarans-farro-and-mushroom-burgers-recipe.html", "description": "Nutty, chewy, and good for you to boot, farro is a great grain. It can be slowly simmered and stirred in place of rice for risotto, tossed with veggies and chilled as a salad, or fried into crisp little patties for these <strong>Farro and Mushroom Burgers</strong>.", "totalTime": "45 minutes", "recipeYield": "makes 10 patties", "recipeCategory": ["Burger", "Cook the Book", "Mushrooms", "Sandwiches", "Vegetarian"], "recipeIngredient": ["3/4 cup farro", "1 pound red potatoes (about 3)", "1 sprig fresh rosemary", "1 sprig fresh thyme", "6 tablespoons unsalted butter", "1 teaspoon freshly ground black pepper", "1 pound cremini mushroom caps, finely chopped", "1 1/4 teaspoon kosher salt", "5 to 8 tablespoons extra-virgin olive oil", "3 shallots, finely chopped", "1 tablespoon dry white wine, dry vermouth, or water", "1/2 cup finely grated Parmigiano-Reggiano cheese", "1 cup panko bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 1/4 cups water to a boil in a medium saucepan. Add the farro, return to a boil, cover, and reduce the heat to medium-low, cooking until the farro is tender, about 30 minutes. Turn off the heat, fluff the farro with a fork, cover, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the farro cooks, boil the potatoes. Bring a large saucepan of water to a boil, add the potatoes, return the water to a boil, and cook until a paring knife easily slips into the center of the largest potato, about 20 minutes. Drain and set aside. Once the potatoes are cool, peel them and place them in a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the needles and leaves from the rosemary and thyme sprigs and place them in a large frying pan along with the butter and black pepper. Cook over medium-high heat, stirring occasionally. Once the herbs start cracking, after about 1 1/2 minutes, add the mushrooms and salt. Cook until the mushrooms release their liquid and the pan is dry again, 6 to 7 minutes, stirring often. Transfer the mushrooms to the bowl with the potatoes and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the olive oil in the same frying pan over medium-high heat. Add the shallots and cook until they are soft and just starting to brown, about 2 minutes. Add the wine and stir to work in any browned bits from the bottom of the pan. Turn off the heat and scrape the shallots into the bowl with the mushrooms and potatoes. Add the Parmigiano-Reggiano along with the farro. Use a potato masher or fork to mash the ingredients together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the mixture into ten patties. Place the panko in a shallow dish and press the top and bottom of each patty into the panko to evenly coat. Heat 4 tablespoons of the olive oil in a clean large frying pan over medium-high heat. Add five patties and cook on each side until nicely browned and crusty, 8 to 10 minutes total. Remove the patties from the frying pan and place them on a plate. Repeat with the remaining patties, adding more oil between batches if necessary. Serve hot. </p>"}]}