{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120501-203721-GFTues-ChocStrawTart.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "gluten free tuesdays", "strawberries", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Chocolate Almond Strawberry Cheesecake Tart", "link": "https://www.seriouseats.com/recipes/2012/05/gluten-free-chocolate-almond-strawberry-chees.html", "description": "Notes: There's only a half-cup of almond flour in the tart crust but it's enough to add a mild, nutty note to the crust. If you're allergic to almonds, replace the almond flour with 1/4 cup sweet rice flour and...", "totalTime": "about five hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Chocolate", "Gluten-Free", "Gluten-Free Tuesday", "Pies, Tarts, and Crumbles", "Strawberry"], "recipeIngredient": ["<strong>For the Crust</strong>", "1 cup (about 4 ounces) white rice flour", "1/2 cup (about 1 1/2 ounces)  natural cocoa powder", "1/2 cup (about 1.75 ounces)  ground almond flour", "1/3 cup (about 2.5 ounces) granulated sugar", "1/2 teaspoon salt", "1 stick (4 ounces) unsalted butter, cold, sliced into 8 pieces", "1/4 cup milk", " ", "<strong> For the Filling</strong>", "8 ounces cream cheese, at room temperature", "1/2 cup granulated sugar", "1/4 cup freshly squeezed juice from 3 lemons", "2 large eggs, at room tempeature", "1 pint fresh strawberries, rinsed, hulled, and sliced", "1/4 cup strawberry jam"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust</strong>: In bowl of food processor, combine white rice flour, cocoa powder, almond flour, granulated sugar, and salt. Pulse to combine. Add butter. Pulse until no large pieces of butter remain, about eight 1-second pulses. Add milk. Run food processor until dough comes together, 5 to 10 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly spray an 11-inch tart pan with cooking spray. Pinch off one-tablespoon pieces of dough. Place dough balls, about 1/2 inch apart, around edge of pan. Place remaining dough balls into center of pan, also spaced about 1/2-inch apart. Using your hand, press dough into bottom of pan. Then press dough around edge to form a crust. Use a measuring cup to press dough firmly into pan. Trim excess dough from edges using a sharp knife. Prick bottom of dough with fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly cover pan with plastic wrap and freeze tart for 45 minutes. While tart chills, adjust oven rack to center position and preheat oven to 375°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove plastic wrap from tart shell and bake until aromatic and set, about 25 minutes. Place tart on a wire rack. Reduce oven temperature to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling</strong>: In bowl of stand mixer fitted with paddle attachment, cream together cream cheese and granulated sugar on medium-low speed until smooth, about 1 minute. Stop mixer. Scrape down paddle attachment and bottom and sides of bowl with rubber spatula. Add lemon juice. Mix on medium-low speed, until lemon juice is thoroughly combined, about 30 seconds. Stop mixer. Scrape down paddle attachment and bottom and sides of bowl. Turn mixer to medium-low, add eggs one at a time, waiting until each egg is fully incorporated before adding next. Stop mixer and scrape down paddle and bowl. Turn mixer back on medium-low and blend until smooth and almost shiny, about 30 seconds. Pour batter into prepared tart shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake tart until filling is golden brown, about 30 minutes. FIlling might puff up. This is normal. It will sink down as it cools. Allow tart to cool on a wire rack. Cool tart at least three hours before topping with sliced strawberries. Starting at the outside, arrange the strawberry slices in concentric circles. Warm jam in microwave until liquified but not boiling. Glaze tart with warm jam using a pastry brush. Serve the tart chilled or at room temperature. Store leftover tart in the refrigerator for up to three days. </p>"}]}