{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/051212-206048-Sunday-Supper-Jerk-Chicken-B.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["grilled pineapple", "jerk chicken", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hellfire Jerk Chicken With Rummy Grilled Pineapple", "link": "https://www.seriouseats.com/recipes/2012/05/sunday-supper-hellfire-jerk-chicken-with-rummy-grilled-pineapple-recipe.html", "description": "Jerk chicken has it all: sweetness, spice and come-hither appeal. [Photograph: Jennifer Olvera] Note: Be aware that the chicken is prone to flare-ups, so it needs to be watched and fussed with a bit during the cooking and basting...", "totalTime": "about two days", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the Chicken:</strong>", "2 teaspoons ground allspice", "1/2 teaspoon ground cinnamon", "1/2  teaspoon ground nutmeg", "1 teaspoon ground black pepper", "1 teaspoon kosher salt", "1/2 teaspoon fresh thyme leaves", "1/4 cup plus three tablespoons brown sugar", "2 tablespoons soy sauce", "1/4 cup juice from about 4 limes", "1 tablespoon cider vinegar", "1/2 cup peanut oil or vegetable", "3 scallions, coarsely chopped", "8 medium cloves garlic", "2 tablespoons minced ginger", "2 habanero or Scotch Bonnet peppers, seeded and deveined", "1 whole skin-on chicken, cut into eight pieces (about 4 pounds)", "5 tablespoons rum, divided", "&nbsp", "<strong>For the Pineapple:</strong>", "1 pineapple, peeled, halved, cored and sliced lengthwise into 12 spears"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add allspice, cinnamon, nutmeg, black pepper, salt, thyme, ¼ cup brown sugar, soy sauce, lime juice, vinegar and oil to a blender. Blend well. Add green onions, garlic, ginger and habanero peppers and pur&eacute;e until smooth. Divide jerk sauce in half. Reserve half in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken, two tablespoons rum and remaining half of jerk sauce in a resealable plastic bag. Marinate in the refrigerator overnight or up to two days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least four hours prior to cooking, place pineapple, remaining three tablespoons rum, and remaining three tablespoons brown sugar in a resealable plastic bag. Shake to combine and dissolve sugar. Place in refrigerator to marinate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all charcoal is lit and covered with gray ash, spread coals evenly over the surface of the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grill grate. Place chicken on the grill, skin side down. Cook until skin is crisp and charred, about 4 minutes. Flip chicken and continue to cook, turning and basting occasionally with marinade until a glistening crust forms on the outside of chicken and an instant read thermometer registers 155°F when inserted into the thickest part of the breast (about 20 to 30 minutes). As chicken nears the end of cooking, remove pineapple from the refrigerator and cook, brushing with glaze, until browned and lightly charred on all sides (about 6 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken and pineapple from grill. Allow to rest for a 10 minutes. Serve with remaining jerk sauce.</p>"}]}