{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120131-nasty-bits-salmon-soup-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["fish", "low carb", "salmon", "seafood", "soup", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Salmon Head Soup", "link": "https://www.seriouseats.com/recipes/2012/01/salmon-head-soup-recipe.html", "description": "The procedure for this fish head soup is enough&mdash;sauté some onions or leeks, add the salmon heads and dill and some potatoes or other vegetables, if you like. Simmer, then separate the fish meat from the bones and reintroduce the morsels of tender salmon to the soup, along with more dill and cream. The taste of the stock is fishy without being too overwhelming, especially since it's enriched with cream.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Salmon", "Soups and Stews", "The Nasty Bits"], "recipeIngredient": ["2 salmon heads, or one salmon frame (head, tails, and scraps)", "1 large onion, thinly sliced", "3 tablespoons butter", "8 ounces potatoes, scrubbed and cut into 2 inch cubes", "1 large bunch fresh dill", "2 bay leaves", "1 teaspoon kosher salt, or to taste", "1/2 cup cream, or to taste", "—", "<strong>To garnish:</strong>", "About 1/3 cup chopped fresh dill "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over medium heat, melt the butter in the sauté pan. Add the onions and sauté until softened but not browned, about 7 minutes. Add the salmon parts, the potatoes, bay leaves, salt, and all but a few stalk of the dill. Add enough water to just cover the fish. Bring the water to a steady simmer and cook until fish and potatoes are tender, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, remove the fish parts from the liquid. When the fish is cool enough to handle, separate the meat and other edible parts (eyeballs, cartilage, etc.) from the skeleton. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the fish parts back to the soup. Reheat gently at a low simmer, taking care not to break up the fish flesh. Add the cream and the chopped fresh dill. Add more salt, if needed, and freshly ground black pepper. Serve immediately. Leftovers may be kept in the refrigerator for up to three days and reheated over a low simmer.</p>"}]}