{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20111229-127355-dinner-tonight-brussels-sprouts-tofu-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "Dinner Tonight", "maple syrup", "mushrooms", "Plenty", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet and Spicy Brussels Sprouts with Tofu and Shiitake Mushrooms", "link": "https://www.seriouseats.com/recipes/2012/01/sweet-and-spicy-brussels-sprouts-with-tofu-and-mushrooms-recipe.html", "description": "I've eaten my fair share of Brussels sprouts, but have never had them quite like this. Mixed with marinated tofu and drenched in a sweet and spicy sauce, this recipe from Plenty (one of our 10 favorite cookbooks of 2011)...", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Brussels Sprouts", "Dinner Tonight", "Mushrooms", "Tofu", "Vegetarian"], "recipeIngredient": ["2 tablespoons sweet chile sauce ", "1 1/2 tablespoons soy sauce ", "1 teaspoon rice vinegar ", "1 tablespoon maple syrup ", "3 tablespoons toasted sesame oil, divided ", "5 ounces firm tofu, cut into 1/2-inch cubes ", "1 pound Brussels sprouts", "3/4 cup canola oil ", "salt ", "1 cup sliced scallions ", "1/2 fresh red chile, stemmed, seeded, and diced ", "1 1/2 cups shiitake mushrooms, stemmed and quartered ", "1 cup cilantro leaves, chopped", "1 tablespoon toasted sesame seeds "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine the sweet chile sauce, soy sauce, rice vinegar, maple syrup, and sesame oil. Add the tofu cubes and stir until combined. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the ends off the Brussels sprouts, and then cut each piece into three thick slices. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large nonstick pan, warm four tablespoons of the canola oil over medium-high heat. Add half of the sprouts, or as many as will fit in one layer. Season with a little salt, and let cook until very well browned, about two minutes. (Note: Only cook the sprouts on one side.) Remove the sprouts with a slotted spoon and set aside in a bowl. Add a little more oil, and repeat process with remaining sprouts. Set all the sprouts aside in a bowl when done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two tablespoons of oil into the empty skillet and turn the heat to medium-high. Add the scallions, diced chile, and mushrooms. Cook, stirring occasionally, until mushrooms are tender, one to two minutes. When done, scrap the contents into the bowl with the sprouts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the skillet back over high heat. Using a slotted spoon, remove half of the tofu pieces from the marinade and add to the skillet. Reduce heat to medium, and cook until browned all over, about two minutes a side. Transfer tofu to the bowl with the sprouts. Repeat process with remaining tofu pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the tofu is cooked, add all of the contents from the bowl back into the skillet. Add the marinade and half of the cilantro. Turn off the heat, and stir well. Let cool down for a minute. Season to taste with salt. Sprinkle with toasted sesame seeds and garnish with the remaining cilantro. </p>"}]}