{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120119-188620-bananas-foster-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["bananas", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Bananas Foster Pie", "link": "https://www.seriouseats.com/recipes/2012/01/bananas-foster-pie-recipe-portable-potluck-dessert.html", "description": "Here's the classic New Orleans dessert&mdash;in pie form.", "totalTime": "6 hours", "recipeYield": "Makes 8 servings", "recipeCategory": ["Banana", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "<strong>For the bottom of the pie</strong>", "4 ripe bananas, peeled, 3 cut into 1/8th inch disks, 1 reserved in peel", "3 tablespoons unsalted butter", "4.5 ounces light brown sugar", "4 tablespoons dark rum", "4 tablespoons heavy cream", "Pinch of salt", "&nbsp;", "<strong>For the custard</strong>", "17 ounces whole milk", "1.8 ounces cornstarch", "2 eggs", "4 egg yolks", "100 grams light brown sugar", "2 tablespoons dark rum", "pinch of salt", "3 tablespoons butter", "&nbsp;", "<strong>For the toppings</strong>", "8 ounces heavy cream, whipped with 3 tablespoons confectioner's sugar", "Optional: 3 ounces cajeta (goat's milk caramel, sold in specialty groceries) or caramel sauce", "1 banana cut on the bias into slices", "3 tablespoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. Line the bottom and sides of the pre-shaped, chilled pie crust with foil and fill with pie weights (I re-use dried beans for this). Bake for 15 minutes on the bottom rack of the oven, then remove the weights and liner, rotate, and bake until the bottom is golden brown, approximately 15 minutes. Allow the shell to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the banana filling: Line the bottom of the baked crust with banana slices from 3 bananas. In a medium-sized skillet set over medium heat, melt the butter and stir in the brown sugar. continue stirring until the sugar is melted and begins to caramelize. Turn the heat off, stand back and add the rum (the mixture will steam and pop). Place over low heat and stir until the hardened chunks all become smooth. Stir in the cream and the pinch of salt. Whisk until the mixture is completely smooth and bubbles slightly. Pour over bananas, allow the mixture to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the custard: Place the milk and rum in a medium-sized saucepan. In a large bowl, whisk together the eggs, yolks, brown sugar, cornstarch and salt for two minutes, until the mixture is lightened. Place the milk mixture over medium heat until it begins to bubble on the sides. Use the hot milk mixture to temper the egg mixture, adding the hot liquid to the eggs a little at a time and whisking constantly. Pour the custard mixture back into the saucepan and set over low heat. Whisk continuously. The mixture will begin to thicken after 3-4 minutes. Continue to whisk. When the custard begins to sputter or bubble, whisk non-stop for two minutes, then whisk in the butter and pour the hot custard over the bananas in the crust. Press plastic wrap directly on top and place in the fridge for at least 4 hours to chill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Remove plastic wrap from the top of the pie. Pour cajeta or caramel over the top of the custard and top with cold whipped cream. Sprinkle the granulated sugar over the bananas, coating them on the flat surface, then place the bananas on a metal tray. Brulee the tops of the bananas using a torch or under the broiler of the oven. Place them on top of the pie and serve immediately.</p>"}]}