{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120224-194445-black-eyed-pea-curry.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["black eyed peas", "Cook the Book", "curries", "curry", "Masala Farm", "quick", "Suvir Saran", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Suvir Saran's Black-Eyed Pea Curry", "link": "https://www.seriouseats.com/recipes/2012/02/suvir-sarans-black-eyed-pea-curry-recipe.html", "description": "This Black-Eyed Pea Curry from <a href=\"http://www.suvir.com/About.html\">Suvir Saran</a>'s <em><strong><a href=\"http://www.amazon.com/Masala-Farm-Stories-Recipes-Uncommon/dp/product-description/0811872335/?tag=serieats-20\">Masala Farm</a></strong></em> is the kind of recipe that'll make you realize that your definitely not eating  enough black-eyed peas.  This good-luck-in-the-New-Year legume is makes an absolutely perfect curry candidate when simmered in a deeply spiced tomato broth.", "totalTime": "30 minutes", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["1/4 cup canola or grapeseed oil", "8 whole green cardamom pods", "6 whole cloves", "3 whole dried red chiles", "2 bay leaves", "1-inch cinnamon stick", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon whole cumin seeds", "1 1/2-inch piece fresh ginger, peeled and grated", "1 large red onion, finely chopped", "1 tablespoon kosher salt plus extra if needed", "3 medium tomatoes, quartered ", "2 garlic cloves, finely minced or pressed through a garlic press", "1 tablespoon ground coriander", "1 teaspoon ground cumin", "1 teaspoon ground turmeric", "1/2 teaspoon cayenne pepper", "1/4 cup plain yogurt", "Three 15 1/2-ounce cans black-eyed peas, rinsed and drained", "1/2 tsp Garam Masala ", "1 cup water "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the canola oil with the cardamom, cloves, chiles, bay leaves, cinnamon, pepper, and cumin seeds in a large heavy-bottomed pot over medium-high heat until the spices are fragrant, 1 to 2 minutes. Stir in the ginger and cook until it becomes fragrant and sticky, about 1 minute. Add the onion and salt and cook, stirring often, until the onion turns deeply browned and sticky, 15 to 20 minutes. If the onion begins to stick to the bottom of the pot or begins to burn, reduce the heat to medium and splash the pan with a few tablespoons of water, scraping up the browned bits and stirring them into the onion.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the onion browns, place the tomatoes in a blender or food processor and purée until they are completely smooth. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the garlic into the onion mixture and cook until fragrant, 30 seconds to 1 minute. Add the coriander, ground cumin, and turmeric, cooking until they begin to smell toasty, about 30 seconds. Stir in the cayenne pepper and 2 tbsp of the yogurt. Cook until heated through, about 1 minute, and then add the remaining yogurt. Continue to stir and cook the yogurt and spices until the contents of the pot are thick and sticky and the liquid from the yogurt has evaporated, about 2 minutes. Stir in the tomato purée and bring to a boil. Reduce the heat to medium-low and cook until a film of oil pools on the surface of the sauce, 6 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the black-eyed peas, garam masala, and water into the tomato mixture. Increase the heat to medium and cook, stirring often, until a bubble or two breaks at the surface, 5 to 7 minutes. Season with salt and serve hot.</p>"}]}