{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120919-dt-nigel-slaters-grilled-eggplant-with-creamed-feta.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "eggplant", "Grilled", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Nigel Slater's Grilled Eggplant with Creamed Feta", "link": "https://www.seriouseats.com/recipes/2012/09/nigel-slaters-grilled-eggplant-with-creamed-f.html", "description": "For a long time, I could never get into eggplant. It always seemed mushy and bitter to me, and preparations were often oily, so I tended to avoid it. But then I discovered long, skinny varieties of eggplant from Asia (you often see them at farmers' markets) that come in all different colors, have a thinner skin, and less bitter seeds. Their flavor is more mild and delicate, and they just might convert you, too.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Eggplant", "Mains", "Vegetarian"], "recipeIngredient": ["4-6 long Asian eggplants, or 2 medium-sized European eggplants, sliced lengthwise into 1-inch thick pieces", "7 ounces feta cheese", "3/4 cup thick yogurt (preferably sheep's)", "1 tablespoon each chopped basil, parsley, and mint", "salt and pepper, to taste", "olive oil, as needed", "warm flat bread, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If time allows, sprinkle the eggplant pieces with sea salt and allow to stand for up to an hour. This will help them to absorb less oil later on. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, crumble the feta and mash roughly with a fork. Add the yogurt, 3 tablespoons water, and the herbs. Season with black pepper and mash the whole mixture together until creamy. If necessary, season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, rinse the eggplants and pat them dry. Brush with a little olive oil and grill until tender, 4-6 minutes per side. They should have some color and char.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the eggplant pieces to a serving dish and drizzle with a little olive oil and a sprinkle of flaky salt. Allow them to cool. Serve with the creamed feta and flatbread.</p>"}]}