{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120809-127677-LatAmCuisine-Churros-Cheese-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Latin Cuisine", "keywords": ["appetizers", "fried food", "latin cuisine", "nicaragua", "nicaraguan cuisine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Churros de Queso (Cheese Churros)", "link": "https://www.seriouseats.com/recipes/2012/08/churros-de-queso-cheese-churros-recipe.html", "description": "These index finger-sized pastries are rolled and filled with firm, salty, white cheese that oozes as the churros fry.", "totalTime": "1 hour, 30 minutes", "recipeYield": "Makes 18 to 20 churros", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Deep Frying", "Latin American", "Latin Cuisine"], "recipeIngredient": ["1 1/2 cups (about 7 1/2 ounces) all-purpose flour, plus additional for dusting hands and work surface", "1/2 teaspoon salt", "1/4 teaspoon baking powder", "1 stick (4 ounces) unsalted butter, cut into small pieces and chilled", "Ice water", "6 ounces Latin American white frying cheese (see note), cut into 1/4- by 1 1/2-inch batons ", "2 cups vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, salt, and baking powder on a clean, dry, and cool work surface. With a bench scraper, cut in butter until it resembles wet sand. Alternatively, combine flour, salt, and baking powder in large bowl and cut butter in with two dinner knives until mixture resembles wet sand, then transfer mixture to work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form well in center of flour-butter mixture and add 3 tablespoons ice water. Working quickly, use bench scraper to combine ingredients.  If mixture appears very dry and crumbly, add ice water, 1 teaspoon at a time, until mixture is cohesive but not overly wet.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring dough together with lightly floured hands. Pinch off small pieces of dough and, working quickly, with the heel of your hand extend on work surface to ensure even distribution of butter. Gather dough together, shape dough into a disc, wrap in plastic, and refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe work surface clean and dust with flour. Dust rolling pin with flour. Roll out dough into a rectangle about 11- by 10-inches and 3/8 inch thickness. Cut dough into 5- by 1-inch rectangles. Place a piece of cheese on each strip of dough and roll into a cone. Refrigerate churros 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil over medium-high heat until shimmering in large skillet with high sides. Fry churros until puffed and golden, 4 to 6 minutes, turning occasionally (cheese may ooze out slightly). Transfer to paper towel-lined plate with slotted spoon. Serve warm or at room temperature.</p>"}]}