{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121003-btb-bakedelements-brooksters.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Baked Elements", "brownies", "Cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brooksters", "link": "https://www.seriouseats.com/recipes/2012/10/baked-elements-brooksters-recipe.html", "description": "Not quite a cookie, not quite a brownie, but with the best elements of both. They're called Brooksters, and <strong><em><a href=\"http://www.amazon.com/Baked-Elements-Our-Favorite-Ingredients/dp/1584799854/?tag=serieats-20\" target=\"_blank\">Baked Elements: Our 10 Favorite Ingredients</a></em></strong> show you how to make these crispy, chewy, chocolatey delights.", "totalTime": "6-8 hours, mostly chilling time", "recipeYield": "makes 6 brooksters, or 12 if using a muffin tin", "recipeCategory": ["Bake the Book", "Cookies"], "recipeIngredient": ["<strong>For the Chocolate Chip Cookie Filling</strong>", "2 1/4 cups all-purpose flour", "1 teaspoon salt", "1 teaspoon baking soda", "8 ounces (2 sticks) unsalted butter, softened", "1 cup firmly packed dark brown sugar", "1⁄2 cup granulated sugar", "2 large eggs", "2 teaspoons pure vanilla extract", "12 ounces (about 2 cups) good-quality semisweet chocolate chips", " ", "<strong>For the Brownie Shells</strong>", "3⁄4 cup all-purpose flour", "1 tablespoon dark unsweetened cocoa powder (like Valrhona)", "1⁄2 teaspoon salt", "5 ounces good-quality dark chocolate (60 to 72%), coarsely chopped", "4 ounces (1 stick) unsalted butter, cut into 1-inch cubes", "3⁄4 cup granulated sugar", "1⁄4 cup firmly packed light brown sugar", "3 large eggs, at room temperature", "1 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Making the chocolate chip cookie filling</strong>: In a large mixing bowl, whisk together the flour, salt, and baking soda. Set aside. In the bowl of a standing mixer fitted with the paddle attachment, beat the butter and sugars on medium speed until smooth and creamy. Scrape down the sides and bottom of the bowl and add the eggs, one at a time, beating well after each addition. The mixture will look light and fluffy. Add the vanilla and beat for 5 seconds.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of the flour mixture and beat for 15 seconds. Add the remaining flour mixture and beat until just incorporated.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the mixer and fold in the chocolate chips until evenly combined. Cover the bowl tightly and chill in the refrigerator for 3 hours.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Making the brownie shells</strong>: Butter the bottoms and sides of 6 individual (4-inch) pie plates, or lightly spray with nonstick cooking spray, and place the pie plates on a baking sheet.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the flour, cocoa powder, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate and the butter in the bowl of a double boiler over medium heat and stir occasionally until they are completely melted and combined. Turn off the heat, but keep the bowl over the water of the double boiler and add both sugars, whisking until completely combined. Remove the bowl from the water and let the mixture cool toroom temperature.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one egg at a time to the chocolate mixture, whisking after each addition until just combined. Add the vanilla and stir until combined. Do not overbeat the batter at this stage or your brownies will be cakey.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the flour mixture over the chocolate mixture. Using a spatula (do not use a whisk) fold the dry ingredients into the wet ingredients until there is just a trace amount of the flour mixture visible.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each pie plate with brownie batter until it is just under halfway full. Place the baking sheet in the refrigerator and chill for 3 hours.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembling the Brooksters</strong>: After the cookie dough and brownie batter have chilled for 3 hours, preheat the oven to 375&deg;F.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an ice cream scoop with a release mechanism, scoop the dough into 1⁄4 cup–size balls and use your hands to shape the dough into perfect spheres. Gently flatten each ball into a disk. The disks should be slightly smaller than the tops of the pie plates.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the baking sheet containing the brownie batter from the refrigerator and gently press a cookie dough disk into the batter in each pie plate. (You may have some leftover chocolate chip cookie batter. If so, feel free to scoop it into 2 tablespoon–size balls and bake on a separate cookie sheet for 12 to 14 minutes.)<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 20 to 25 minutes, rotating the sheet halfway through the baking time. The Brooksters are done when the cookie part is golden brown.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool to room temperature or serve warm with ice cream.</p>"}]}