{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120910-grilled-portobello-mushroom-sandwich-primary2.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["grill", "grilling", "light eating", "mushroom", "portobello", "sandwich", "vegetarian", "vegetarian sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Portobello Mushroom Sandwiches with Arugula and White Bean Spread", "link": "https://www.seriouseats.com/recipes/2012/09/vegetarian-grilled-portobello-mushroom-sandwiches-recipe.html", "description": "Once you try this portobello sandwich piled high with creamy white bean spread and peppery arugula, all on a fresh, chewy focaccia roll, you might never let your friends serve you a crappy mushroom burger again.", "totalTime": "25 minutes", "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Mushrooms", "Sandwiches", "Vegetarian"], "recipeIngredient": ["1 (15-ounce) can of white beans (cannellini beans), drained and rinsed", "5 tablespoons lemon juice (from about 3 lemons)", "1 medium clove garlic, smashed and peeled", "2 teaspoons chopped fresh rosemary leaves (optional)", "2 tablespoons water", "7 tablespoons extra virgin olive oil, plus more for grilling", "Kosher salt and freshly ground black pepper", "4 large portobello mushroom caps, stems and gills removed, wiped clean with a damp paper towel", "4 good-quality sandwich rolls, preferably focaccia, sliced", "About 2 cups baby arugula leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine the white beans, 1/4 cup lemon juice, garlic, rosemary, and water. Blend. With machine running, drizzle in 1/4 cup olive oil. Process until completely smooth, about one minute. Season to taste with salt and pepper. Transfer spread to a bowl and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one half chimney full of charcoal</a>. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, preheat one side of a gas grill to medium high, covered, for at least 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean </a>and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil </a>the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry brush, brush both sides of mushroom caps with a generous amount of olive oil, a about 1 tablespoon per mushroom. Season both sides of mushrooms generously with salt and pepper. When grill is hot, add mushrooms to hot side and cook, covered, until mushroom is well-browned on one side, about 4 minutes. Flip mushrooms and cook for an additional 4 minutes. Transfer mushrooms to a plate. Add rolls to grill and toast lightly on both sides, about 2 minutes per side. Remove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together remaining tablespoon lemon juice and 2 tablespoons olive oil and season to taste with salt an pepper. Set dressing aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out sandwich roll bottoms and spread each with a small amount of white bean mixture. Add 1 mushroom to each sandwich and top with a generous amount of white bean spread. Dress arugula with lemon juice and olive oil (you may not need all the dressing). Divide arugula between sandwiches and season with salt and pepper. Add sandwich roll tops and carefully slice sandwiches in half with a sharp serrated knife. Serve immediately.</p>"}]}