{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120207-nasty-bits-pig-parts-salad-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["pork", "salad", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pig Parts Salad with Radicchio and Olives", "link": "https://www.seriouseats.com/recipes/2012/02/pig-parts-salad-with-radicchio-and-olives-recipe.html", "description": "You may think you don't want simmered pork parts in your salad, but think again. This preparation has become a favorite of mine, a clever way to deal with the random meat parts that may be sitting in your freezer. Or, maybe you have a dish that calls for a gelatinous stock you'd like to make with a trotter, but you don't know what to do with the trotter afterwards. Pig parts, served at room temperature, dressed in a basic vinaigrette of olive oil, vinegar, and mustard, is the way to go.", "totalTime": null, "recipeYield": null, "recipeCategory": ["Pork", "Salads"], "recipeIngredient": ["3 trotters, or one trotter, one ear, and a few other spare parts  ", "1 cup canned white beans (lima or cannellini beans)", "1/2 cup olives, pitted and rinsed", "1/2 cup canned artichoke hearts", "2 stalks celery", "1 small head radicchio", "&nbsp;", "<strong>For the vinaigrette: </strong>", "2/3 cup olive oil", "3 tablespoons red wine vinegar", "2 teaspoons Dijon mustard", "1/2 teaspoon kosher salt", "freshly ground black pepper", "1 shallot, finely diced", "&nbsp;", "<strong>To garnish:</strong>", "Chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork parts in a 3 to 4 quart saute pan or pot and cover with water.  Bring to boil, then reduce to heat to steady simmer and skim off the scum that rises to the top. Simmer for 2 to 3 hours, until the flesh is slipping off the trotter bones. Turn off heat and let the meat cool slightly in the broth.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat is cool enough to handle, debone the trotters and whatever other parts you may be using. Add the bones back to the broth and continue to simmer or boil the broth, reserving the stock for another use. Cut the pork parts into 1-inch chunks. If you are using ears, slice into 1/4 inch thick slices. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the vegetables: chop the radicchio and celery into 1/2-inch slices. Roughly chop the olives and artichokes. Make sure beans are drained of excess fluid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large salad bowl, whisk the ingredients for the vinaigrette together.  Toss pig parts, beans, and vegetables together, distributing the dressing evenly. Taste for salt and add more if needed. Garnish with parsley.  Serve at room temperature. Leftovers may be refrigerated for up to 2 days and brought back to room temperature before serving.</p>"}]}