{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120409-tacos-tongue-nasty-bits.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Mexican", "keywords": ["Mexican", "taco", "tacos de lengua", "The Nasty Bits", "tongue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tacos de Lengua", "link": "https://www.seriouseats.com/recipes/2012/04/tacos-de-lengua-recipe.html", "description": "Browning is key to great tongue tacos, adding a bit of crispiness to the meltingly rich meat.", "totalTime": "4 hours 30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Mexican", "Offal", "The Nasty Bits"], "recipeIngredient": ["1 whole cow or veal tongue (see note)", "1 medium onion, split in half ", "2 bay leaves", "1 quart low sodium homemade or store-bought chicken stock", "6 stems cilantro", "1 small carrot, peeled and roughly chopped", "2 cloves garlic", "2 tablespoons duck fat, pork fat, or canola oil ", "Kosher salt and freshly ground black pepper", "16 to 24 corn tortillas (warmed according to <a href=\"http://www.seriouseats.com/2011/10/video-the-right-way-to-warm-corn-tortillas.html\">these instructions</a>)", "<strong>Optional garnishes:</strong>", "Fresh salsa", "Queso fresco or feta", "Chopped onions and cilantro", "Wedges of lime", "Tomatillo sauce ", "Guacamole"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tongue, onion, bay leaves, carrot, and garlic in a saucepan just big enough to hold them. Add chicken broth until mostly covered (you may not need all of it, depending on how big your pot is). Bring to a boil over high heat, reduce to a simmer, cover with a tight-fitting lid, and cook until completely tender, four to six hours depending on the size of the tongue, adding extra water as necessary to keep the tongue mostly submerged.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove tongue to a cutting board. Strain stock and discard solids, reserving liquid for another use. Peel the outer membrane off the tongue and discard. Roughly chop tongue into 1/2-inch pieces. Tongue can be prepared up through this step up to 5 days in advance. Store in an airtight container or zipper-lock bag in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, heat oil or lard in a large non-stick or cast iron skillet set over medium-high heat until shimmering. Add tongue pieces and cook, stirring occasionally, until tongue is well browned on all sides, 5 to 8 minutes total. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, wrap a spoonful or two of tongue in a double layer of corn tortillas. Top as desired.</p>"}]}