{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121022-226986-cook-the-book-kale-chips-lemon-ginger.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cynthia nims", "kale chips", "lemon", "salty snacks", "snacks", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kale Chips with Lemon and Ginger from 'Salty Snacks'", "link": "https://www.seriouseats.com/recipes/2012/10/kale-chips-with-lemon-and-ginger-from-salty-s.html", "description": "Anyone else appalled at the proliferation of mass-produced kale chips? Don't get me wrong, I've eaten more than my fair share of the snack, but there's no reason to pay upwards of $6 for a small bag can be finished in 5 minutes. In <em><a href=\"http://www.amazon.com/Salty-Snacks-Crisps-Crackers-Pretzels/dp/1607741814/?tag=serieats-20\">Salty Snacks</a></em>, <strong><a href=\"http://www.cynthianims.com/aboutcynthia.php\">Cynthia Nims</a></strong> offers an easy intro to making kale chips, no dehydrator necessary. She tops the chips with a bit of olive oil and a lively mixture of lemon zest, grated fresh ginger, and (of course) plenty of salt.", "totalTime": "30 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Ginger", "Gluten-Free", "Lemon", "Sides", "Snacks", "Vegetarian"], "recipeIngredient": ["1 bunch (about 7 ounces) kale, rinsed and well dried", "1 tablespoon olive oil, plus more if needed", "1 teaspoon finely grated lemon zest", "1 teaspoon finely grated fresh ginger", "3/4 teaspoon kosher salt or flaky or coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300°F. Line 2 baking sheets with parchment paper or silicone baking mats. Set 2 oven racks at the centermost positions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the tough stems from the kale leaves. Cut larger leaves crosswise into 3- to 4-inch portions; smaller leaves can be baked as is. Put the kale in a large bowl, drizzle 1 tablespoon of the olive oil over the leaves, and toss well with your hands to evenly coat the leaves with oil. The curlier the leaves, the more you’ll want to use your fingers to rub a bit of oil into the nooks and crannies. Just a light gloss of oil is the goal; drizzle another teaspoon or two over if needed, but avoid excessive oil. Arrange the kale pieces on the prepared baking sheets, the leaves touching each other as little as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the lemon zest, ginger, and salt in a small bowl and use your fingers to rub the ingredients together well. (Be sure to do this at the last minute.) Sprinkle the salt mixture over the kale leaves. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10 minutes. Switch the baking sheets and continue baking until the leaves are dry and rigid but not browned, 10 to 12 minutes longer. If some leaves at the outer edges of the baking sheets are ready earlier, transfer them to a wire rack and continue baking the remaining leaves for a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a metal spatula to transfer the leaves to a wire rack to cool. Serve on a platter or in a broad shallow bowl. The kale chips are best on the day they are made but can be stored for up to 1 day in an airtight container.</p>"}]}