{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120729-195206-ginger-peach-crumble%20pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cobblers", "crisps", "crumbles", "peaches", "pie", "pie of the week", "summer desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peach and Ginger Crisp Pie", "link": "https://www.seriouseats.com/recipes/2012/08/ginger-peach-cobbler-pie-recipe.html", "description": "Fresh summer peaches with candied ginger under a crisp brown sugar crumb topping.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Fruit Desserts", "Peach", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "3 ounces (about 1/2 cup) rolled oats (not instant oatmeal)", "1 ounce (about 2 tablespoons) all purpose flour", "3 ounces (about 1/3 cup) light brown sugar", "1 tablespoon candied ginger, finely diced", "1 big pinch salt", "2 ounces (4 tablespoons) unsalted butter, cold, cut into 1/4-inch pieces", "3 tablespoons tapioca or corn starch", "4 ounces (about 2/3 cup) granulated sugar (adjust to the sweetness of the fruit)", "7 fresh, ripe peaches, cut into sixteenths with the pit removed (if you don't like peach skin in pies, you may blanch the peaches to remove the skin prior to cutting)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust just begins to get color on the top (you'll be baking it more later), about 5 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine the rolled oats, flour, brown sugar, candied ginger, and salt  and whisk together until incorporated. Add the cold butter and rub the dry ingredients into it between your fingers until the dry ingredients and butter form a crumbly dough. Chill for 1 hour or more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 350&deg;F.In a large bowl, whisk together the sugar and starch. Add the peaches and toss to coat the fruit with the dry ingredients. Pour the mixture into the crust. Top with the chilled crisp topping and bake for approximately 30 minutes, until the filling is bubbling all over and the crisp topping is a deep golden brown. Cool completely before serving.</p>"}]}