{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120602-207930-sunday-brunch-spinach-feta-frittata.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["egg", "feta", "frittata", "omelet", "quick", "spinach", "Sunday Brunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spinach and Feta Frittata", "link": "https://www.seriouseats.com/recipes/2012/06/spinach-and-feta-frittata-recipe.html", "description": "Sweet baby spinach and salty brined feta are a classic Greek combination that work together in pretty much any dish&mdash;and the frittata is no exception.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mains", "Omelettes", "Spinach", "Vegetarian"], "recipeIngredient": ["2 tablespoons olive oil", "1 medium shallot, finely chopped (about 2 tablespoons)", "1 medium clove garlic, finely chopped (about 1 teaspoon)", "1 (5-ounce) bag baby spinach", "1 tablespoon finely chopped fresh oregano", "Kosher salt and freshly ground black pepper", "10 eggs, beaten", "1/4 cup milk", "3/4 cup (about 3.5 ounces) crumbled feta", "Sliced scallions (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to highest position and preheat broiler.  Heat olive oil in an 8 inch non-stick skillet over medium high heat, until shimmering. Add shallo and cook until beginning to soften, about 3 minutes. Add garlic and continue to cook until softened, about 2 minutes longer. Add spinach and oregano and cook, tossing often until spinach is fully wilted and any water released by the spinach has cooked off, about 6 minutes total. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat eggs and milk with a whisk until incorporated. Add feta and season with salt and pepper. Pour egg mixture over spinach then gently stir with a spatula to release the spinach from the bottom of the pan so that the eggs are in direct contact with the surface of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook until eggs are almost totally set, about 12 minutes, reducing heat if necessary to prevent burning.  Place pan under the broiler until the top is set as well, keeping a close eye on it so it does not burn, about 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To release the frittata from the pan, loosen edges with a spatula. Place a dinner plate over pan, and holding plate firmly flip the pan over so the frittata releases onto the plate.  Serve warm with toast and sliced scallions.</p>"}]}