{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121210-lee-ann-bourbon-caramel-turtles.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["cookie swap 2012"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bourbon Pecan Turtles with Fleur de Sel", "link": "https://www.seriouseats.com/recipes/2012/12/bourbon-pecan-turtles-with-fleur-de-sel-recipe.html", "description": "Swapped at the SE Cookie Swap by Lee Anne Shaffer", "totalTime": null, "recipeYield": "makes about 20 turtles", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["3/4 cup plus 1 tablespoon granulated sugar", "3/4 cup evaporated milk (unsweetened)", "1/3 cup heavy (whipping) cream", "1/2 vanilla bean, split open and seeds scraped out, pod reserved; or 1/2 tsp pure vanilla extract", "2 tablespoon bourbon (I used Redemption Rye Bourbon)", "80 to 100 toasted pecan halves (a generous cup or about 4 1/2 ounces)", "1/2 cup light corn syrup", "2 tablespoon unsalted butter", "1 1/4 teaspoon coarse sea salt", "2 cup chopped dark chocolate", "Fleur de sel, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the sugar, evaporated milk, heavy cream, and vanilla bean and seeds (if using) in a large (6-to 8-quart) saucepan. Bring to a boil over medium-high heat, uncovered and without stirring.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the caramel mixture is heating up, arrange the nuts on the prepared baking sheet (lined with parchment): place 4 or 5 whole pecans in a star shape for each turtle, about 20 stars in all, leaving at least 1 inch between stars.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the caramel mixture has come to a boil, insert a candy thermometer. Add the light corn syrup, and stir gently with a heatproof spatula until everything is mixed well. Reduce the heat to medium-low and cook, stirring often and making sure to scrape the bottom of the pot to keep the mixture from burning, until the mixture reaches 230F/100C, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the caramel mixture, and fish out the vanilla bean with a slotted spoon. Stirring continuously, cook the caramel until it reaches 241&deg;F/116&deg;C, 15 to 20 minutes; it will be a deep tawny color and have slow, rolling bubbles in the center. Remove it from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the salt, bourbon, and the vanilla extract (if using), making sure to mix well so that they're distributed evenly. Wearing oven mitts, carefully pour the caramel into candy funnels. Allow to cool for about 5 minutes, stirring it a couple times, until it thickens up a little bit and has the consistency of hot fudge. (Alternately, spoon directly from the pot after letting cool for about 5 minutes.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour a couple tablespoons' worth of caramel onto each pecan cluster. Allow them to set up until they are no longer warm, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, temper the 2 cups chocolate in a heat-proof bowl over boiling water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the caramel has set up, pour some prepared chocolate into a clean funnel. Top each turtle with about a tablespoon of chocolate. (Alternately, spoon directly from bowl.) You want enough chocolate so that it covers most of the caramel, but the turtles' heads and tootsies should still be visible. Gently tap the baking sheet on the counter, one end first and then the other, to even out the chocolate. Garnish the center of each turtle with a few flakes of the fleur de sel - but make sure to do it before the chocolate sets up completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the turtles, layered with wax or parchment paper, in an airtight container at cool room temperature for up to 1 week.</p>"}]}