{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120620-kenji-veg-platter-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["dips", "dressing", "greek yogurt", "green goddess"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Green Goddess Dressing", "link": "https://www.seriouseats.com/recipes/2012/06/classic-green-goddess-dressing-recipe.html", "description": "A classic West Coast dressing and dip, it was one of the most popular dressing in the country up until Ranch took over in the late 80's. Flavored with plenty of herbs and anchovies, and highly seasoned, it lies somewhere between a classic Caesar and Ranch, with the best elements of both.", "totalTime": "10 minutes", "recipeYield": "Makes 1 quart", "recipeCategory": ["Christmas", "Condiments and Sauces", "Dressings and Vinaigrettes"], "recipeIngredient": ["1 egg yolk", "1 tablespoon dijon mustard", "1 tablespoon juice from 1 lemon", "1/4 cup water", "2 whole anchovy filets", "2 medium cloves minced garlic (about 2 teaspoons)", "2 cups neutral oil such as vegetable or canola", "1/2 cup picked fresh tarragon leaves", "1/4 cup picked fresh chervil leaves (if not available, add an addition 2 tabelspoons tarragon)", "2 teaspoons worcestershire sauce", "1 teaspoon hot sauce, such as Franks", "1 1/2 cups strained Greek-style yogurt or sour cream", "1/4 cup finely sliced chives", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine egg yolk, mustard, lemon juice, 2 teaspoons water, anchovy filets, and garlic in the bowl of a food processor. With processor running, slowly drizzle in oil until a smooth, tight emulsion forms. If emulsion gets too thick and does not get sucked into processor blades, thin out with a few drops of water and continue with oil. When all oil has been incporporated, add tarragon, chervil, worcestershire, hot sauce, and water. Process until herbs are finely chopped.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dressing to a large bowl. Add yogurt (or sour cream), and chives. Whisk to combine. Season to taste with salt and pepper, adding more worcestershire, hot sauce, or lemon juice as desired. Dressing should be highly seasoned. Serve immediately with vegetables for dipping, or store in a sealed container for up to 1 week.</p>"}]}