{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120312-196962-zeppole-dough.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "italian desserts", "pastry", "zeppole"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Zeppole di San Giuseppe", "link": "https://www.seriouseats.com/recipes/2012/03/chocolate-zeppole-doughnuts-di-san-guiseppe-recipe.html", "description": "Lighter and airier than their street food cousins, these zeppole are a must for St. Joseph's Day celebrations in Italian American communities.", "totalTime": "1 hour and 15 minutes", "recipeYield": "makes approximately 20 mini zeppole", "recipeCategory": ["Doughnuts", "Pastry"], "recipeIngredient": ["<strong>For the Dough:</strong>", "1 cup water", "1 ounce butter ", "1/4 teaspoon salt", "5 ounces all-purpose flour", "1 teaspoon vanilla", "3 tablespoons sugar", "3 eggs", "3 tablespoons extra virgin olive oil", "2 quarts canola oil for frying", "&nbsp;", "<strong>For the Filling:</strong>", "2 egg yolks", "2 ounces sugar", "1 tablespoon all-purpose flour", "1 teaspoon vanilla", "3/4 ounce unsweetened cocoa powder", "1 cup whole milk", "&nbsp;", "<strong>For the Garnish:</strong>", "20 sour cherries for garnish, if desired", "1/4 cup confectioners sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan combine water, butter, and salt. Bring mixture to a boil while stirring constantly with a wooden spoon. When mixture comes to just a boil, add vanilla. While stirring, add the flour and sugar, mixing well until the batter is smooth and well incorporated and comes together in a ball, about 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove mixture from heat and transfer to the bowl of a stand mixer. Let cool for about five minutes. Turn mixer on to low and add one egg at a time, increasing the speed to medium to incorporate fully. Once the batter is light and fully incorporated, cover bowl with plastic wrap and place in refrigerator for at least 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Pastry Cream:</strong> In a medium bowl whisk together egg yolks and sugar until combined. Then whisk in flour, vanilla and cocoa powder until thoroughly combined flour. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add milk to small saucepan and bring to just a boil. Remove milk from heat. While whisking the egg mixture constantly, slowly pour in the milk, whisking to incorporate. Once the milk and egg mixture have been thoroughly combined, return mixture to small saucepan and return to stove. Heat mixture on medium-high until the pastry cream thickens to a pudding-like consistency. Remove from heat and transfer to a medium bowl then cover with a plastic wrap (be sure that the wrap touches the cream directly so a skin doesn’t form on the surface). Set in the refrigerator to cool for at least 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour canola oil into a large dutch oven to a depth of 2 inches. Heat oil to 360&deg;F. While oil is heating prepare the zeppole.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut out twenty 2.5 inch squares of aluminum foil and brush foil with olive oil. Transfer dough to a pastry bag and fit bag with a 1/2\" open star shaped pastry tip. Without lifting the tip, pipe two 2 inch rings of dough on top of each other (this should be a continuous motion) on each foil square.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once oil reaches the proper temperature, carefully place the foil squares with the zeppole in the frying oil. If you have a wide, shallow strainer, you can place the zeppole foil side down in the strainer to transfer to the oil. The foil will separate from the zeppole in the hot oil with little to no effort after a few moments. Use heat resistant tongs to remove the foil. Cook until golden brown then using heat resistant tongs turn the zeppole and cook to the same degree of doneness, about 1 to 1 1/2 minutes per side. Do not cook more than 2 to 3 zeppole at a time, as over crowding will cause the oil's temperature to drop. Use tongs or strainer to remove zeppole from oil, letting any excess oil drain off, then transfer to a wire rack for cooling. Test your first zeppole to make sure that the insides are completely cooked, if not, adjust your cooking time accordingly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When zeppole have cooled completely, pipe a little cream in the middle and up around the inner edges in a swirling pattern. Dust with confectioner’s sugar and top with a cherry. Enjoy immediately.</p>"}]}