{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/201212-209977-knead-book-hamburger-buns.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "buns", "sesame seeds"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "The Bread Bible's Sesame Burger Buns", "link": "https://www.seriouseats.com/recipes/2012/06/sesame-burger-buns.html", "description": "[Photograph: Donna Currie] I love homemade hamburger buns, and they're great for more than just burgers. Just about any sandwich filling will be happy nestled inside this burger bun; they're particularly good for wet or sloppy fillings, or for sandwiches...", "totalTime": "2 hours 30 minutes", "recipeYield": "Makes 12 rolls", "recipeCategory": ["Bread Baking", "Yeast Bread"], "recipeIngredient": ["1 3/4 cups warm water", "1 tablespoon (1 package) active dry yeast", "2 tablespoons plus 1/2 teaspoon sugar", "1/3 cup nonfat dry milk powder", "1 1/2 teaspoons salt", "3 tablespoons unsalted butter, melted", "4 1/2 to 5 cups unbleached all-purpose flour or bread flour", "1 large egg beaten with 2 teaspoons water, for glazing", "1/2 cup sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, pour in 1/2 cup of the warm water. Sprinkle the yeast and 1/2 teaspoon sugar over the water. Stir to dissolve and let stand at room temperature until foamy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl using a whisk or in the work bowl of a heavy-duty electric mixer fitted with the paddle attachment, combine the remaining 1 1/4 cups water, dried milk, the remaining sugar, salt, and butter. Add 2 cups of the flour. Beat hard until creamy, about 1 minute. Add the remaining flour, 1/2 cup at a time, until a soft, shaggy dough that just clears the sides of the bowl is formed. Switch to a wooden spoon when necessary if mixing by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured work surface and knead for about 4 minutes, dusting with flour only 1 tablespoon at a time as needed to make a smooth and soft dough.</p>\r\n\r\n<p>If kneading by machine, switch from the paddle to the dough hook and knead for 3 to 4 minutes, or until the dough is smooth and springy and springs back when pressed. If desired, transfer the dough to a floured surface and knead briefly by hand,<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough in a greased deep container. Turn once to coat the top and cover with plastic wrap. Let rise at room temperature until doubled in bulk, 1 to 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently deflate the dough. Turn the dough out onto a lightly floured work surface. Grease or parchment-line a baking sheet. Divide the dough into 12 equal portions. Shape each into a tight round ball and place each ball seam side down and at least 2 inches apart on the baking sheet. Use a second baking sheet rather than crowd the rolls. Flatten each ball with your palm. Cover loosely with plastic wrap and let rise until puffy, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Twenty minutes before baking, preheat the oven to 350˚F. Brush each roll with the egg glaze and sprinkle the tops with sesame seeds. Place the baking sheet on the rack in the center of the oven and bake 20 to 25 minutes, or until lightly brown and firm to the touch. Transfer the rolls immediately to a cooling rack. Cool completely before splitting.</p>"}]}