{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120225-194099-sugar-cane-soft-serve-prmary.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["frozen desserts", "ice cream", "Scooped", "soft-serve", "sugar cane"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sugar Cane Soft Serve Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/02/sugar-cane-soft-serve-ice-cream-recipe.html", "description": "Skip the cone for serving and top it with some toasted coconut and cacao nibs.", "totalTime": "3 hours, plus time to chill", "recipeYield": "Makes 1 quart", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 foot fresh sugar cane", "3 1/2 cups half and half, divided", "3 tablespoons cornstarch", "2 teaspoons unflavored gelatin", "3/4 cup sugar", "3/4 teaspoon kosher salt", "2 tablespoons cacha&ccedil;a or light rum"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a heavy knife or cleaver, cut sugar cane into 4 3-inch segments. Split each segment into quarters lengthwise, then arrange cut-side up on a baking sheet. Cook under a broiler for five minutes, just until the cut surfaces look slightly dry. Using your heavy knife, peel outer skin away and chop cane into small chunks. Process in food processor until cane is broken up and resembles minced ginger. You should have between 1 1/4 and 1 1/2 cups of minced sugar cane.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1/4 cup half and half into a small bowl and three tablespoons in another. Whisk cornstarch into first bowl until no lumps remain and sprinkle gelatin over second bowl. Heat rest of half and half in a heavy saucepan over medium heat until it comes to a simmer. Remove from heat, stir in sugar cane, and cover to let steep for two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring dairy back to a simmer on medium low heat, adding sugar and salt. Whisk in cornstarch slurry and cook, whisking frequently, until a custard forms and a swiped finger on the back of a spoon leaves a clean line. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold 18 inches of cheesecloth over on itself and place over an airtight container. Strain custard through cloth. Gather up corners of cloth and twist into a tight bundle. Squeeze bundle tight to drain out custard, then discard. Stir in gelatin mixture and cacha&ccedil;a until gelatin dissolves. Set in refrigerator to chill until set, overnight or at least four hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Base will form a wobbly gel when set. Churn in an ice cream maker until ice cream has the texture of soft serve and is not at all runny. Eat immediately, or chill in freezer in an airtight container. To regain soft serve texture, let ice cream thaw to the verge of melting after freezing.</p>"}]}