{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120905-221564-bar-bites-sheperds-pie-slider.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "blue cheese", "burger", "cheeseburgers", "lamb", "shepherds pies", "sliders"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shepherd's Pie Sliders", "link": "https://www.seriouseats.com/recipes/2012/09/bar-bites-shepherds-pie-sliders-recipe.html", "description": "While making a Shepherd's Pie isn't necessarily as difficult as tending sheep, it can be time consuming. Instead, consider the Shepherd's Pie Slider. The same seasoned lamb is at the core of this recipe, but instead of being sauteed, the meat is formed into patties and studded with thyme, rosemary, garlic, shallots, peas, and carrots.", "totalTime": "30 minutes", "recipeYield": "Makes 6 sliders", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Burger", "Cheese", "Lamb", "Sandwiches"], "recipeIngredient": ["2 tablespoons canola oil, divided", "1 small shallot, minced (about 2 tablespoons)", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 small carrot, grated on the large holes of a box grater (about 1/2 cup)", "1/4 cup frozen peas", "1 pound ground lamb", "1 teaspoon chopped fresh thyme leaves", "1 teaspoon chopped fresh rosemary leaves", "1/2 teaspoon freshly ground black pepper", "1 tablespoon Worcestershire sauce", "1 tablespoon ketchup", "Crumbled blue cheese, for topping", "6 potato rolls, or other slider buns", "Mayonnaise, for spreading on rolls"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the canola oil in a large cast iron pan over medium-high heat. Add the shallots, garlic, carrots, and peas to the pan and cook, stirring frequently, until the shallots soften and the garlic just begins to brown, 2 to 3 minutes. Remove from heat and transfer mixture to a large bowl and set aside to cool completely. Meanwhile, wipe out the pan with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the carrot mixture has cooled completely, add the ground lamb, thyme, rosemary, black pepper, Worcestershire sauce, and ketchup to the bowl. Using your hands, or a rubber spatula, gently mix everything in the bowl until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form 6 patties from the lamb mixture that are each about 3 inches in diameter and 1/2-inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the last tablespoon of canola oil in the same cast iron pan over medium high heat. When the oil is shimmering and nearly smoking, place the patties into the pan, working in batches if necessary. Cook the patties on the first side for 4 minutes, then using a metal spatula, flip the patties over. Sprinkle some blue cheese on each of the patties, cover the pan with a lid, and continue to cook for 3-4 minutes more until the lamb is cooked through and the cheese is melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear the potato rolls with mayonnaise, then place the cooked lamb patties on the bottom half of each roll, and top with the top half of each roll. Serve immediately.</p>"}]}