{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111230-185639-orangettes-candy-610x458-22.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["candied orange", "candy", "chocolate", "orange", "orange zest"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orangettes", "link": "https://www.seriouseats.com/recipes/2012/01/orangettes-recipe-how-to-make-chocolate-orange.html", "description": "Orangettes are a perfect, simple homage to the combination of orange and chocolate. This recipe is designed to create candied orange zest that is delightfully chewy on the inside, with chocolate the snaps between the teeth on the outside. Use a high-quality chocolate of no more than 61% cocoa solids; higher percentages can be difficult to use for dipping. I like to simmer a cinnamon stick in the simple syrup to impart a hit of cinnamon. It's not mandatory, but highly recommended.", "totalTime": "14 hours", "recipeYield": "makes approximately 50 pieces", "recipeCategory": ["Candy", "Chocolate", "Desserts", "Orange"], "recipeIngredient": ["2 oranges with thick skin (Sunkist brand are good for this)", "3 cups granulated sugar", "3 cups water", "1/4 cup corn syrup", "optional: cinnamon stick", "6 ounces 61% (or lower) high-quality chocolate, <a href=\"http://sweets.seriouseats.com/2010/03/how-to-temper-chocolate.html\">tempered</a>", "optional: sprinkle of sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a serrated knife, cut off the very top and bottom of the oranges, just exposing the flesh inside the pith. Then, cut wide strips of the peel from the orange, from pole to pole. Scrape any flesh from the inside of the peels using a melon ball scooper. Using a chef's knife, trim the edges of the peel pieces so they are even and rectangular. Cut the rectangles into narrow strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a bowl of ice water and set aside. Combine 3 cups water, the sugar, corn syrup, and cinnamon stick in a 4 quart saucepan. Stir to combine the ingredients. Place 2 quarts of water into another 4 quart (or larger) saucepan. Set both pots over medium heat. Bring the sugar solution to a simmer and stir until all of the sugar has dissolved. Remove from heat and set aside. Once the pot of water has reached a boil, add the orange peels and simmer for one minute. Strain out the zest, place in the ice water bath. Discard the water, rinse the pot, and add fresh water. Bring the fresh pot of water to a boil and blanch the peels a second time, for one minute. Strain out the peels, stir to add them to the pot with the syrup, and bring them to a low simmer, over low heat. Simmer the peels for one hour, stirring frequently. Remove the peels from the syrup, and spread them so they are not touching over a cooling rack. Allow them to dry overnight, turning halfway through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a bowl of tempered chocolate on the workstation, propped at an angle with a towel. Set up a sheet tray lined with parchment and dipping forks. Partially or fully submerge the candied peels in the chocolate, shake and wipe off the excess, and place on the parchment to set up in a cool dry place. The orangettes are best enjoyed within two weeks. Store in a cool, dry place.</p>"}]}