{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121113-229544-cook-the-book-sausage-apple-cranberry-stuffing.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["apple", "Cook the Book", "cranberries", "dressing", "sausage", "stuffing", "the epicurious cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "New England Sausage, Apple, and Dried Cranberry Stuffing from 'The Epicurious Cookbook'", "link": "https://www.seriouseats.com/recipes/2012/11/new-england-sausage-apple-and-dried-cranberry.html", "description": "Stuffing (or dressing, depending on your method and who you talk to) is my favorite part of Thanksgiving dinner. In my opinion, shoveling forkfuls of <strong>fat-soaked bread</strong> doused in gravy and cranberry sauce into my mouth is what Thanksgiving is all about. In <em><a href=\"http://www.amazon.com/The-Epicurious-Cookbook-Best-Loved-Weeknights/dp/0307984850/?tag=serieats-20\">The Epicurious Cookbook</a></em>, editor <strong>Tanya Steel</strong> offers a few variations on dressing/stuffing, but the most vibrant is <strong>New England Sausage, Apple, and Dried Cranberry Stuffing</strong>.", "totalTime": "1 hour and 45 minutes", "recipeYield": "serves 14", "recipeCategory": ["Apple", "Bread", "Cook the Book", "Cranberry", "Sides"], "recipeIngredient": ["14 ounces white bread, cut into 3/4-inch cubes (about 12 cups)", "1 pound sweet Italian sausages, casings removed", "1/4 cup (1/2 stick) butter", "6 cups sliced leeks (white and pale green parts only; about 3 large leeks)", "1 pound tart green apples, peeled, cored, and chopped", "2 cups chopped celery with leaves", "4 teaspoons poultry seasoning", "1 cup dried cranberries (about 4 ounces)", "4 teaspoons chopped fresh rosemary", "2/3 cup chopped fresh parsley", "3 large eggs, beaten to blend", "1 1/3 cups low-sodium chicken broth, or as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Divide the bread cubes between 2 large baking sheets. Bake until slightly dry, about 15 minutes. Cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sauté the sausages in a heavy large skillet over medium-high heat until cooked through, crumbling coarsely with the back of a spoon, about 10 minutes. Using a slotted spoon, transfer the sausage to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off any drippings from the skillet. Melt the butter in the same skillet over medium-high heat. Add the leeks, apples, celery, and poultry seasoning; sauté until leeks soften, about 8 minutes. Mix in the cranberries and rosemary. Add the mixture to the sausage, then mix in the bread and parsley. Season the stuffing to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to stuff the bird, mix the eggs into the stuffing. Fill the main turkey cavity with the stuffing. Mix enough chicken broth into the remaining stuffing to moisten (about ¾ to 1 cup chicken broth, depending on amount of remaining stuffing). Spoon into a buttered baking dish. Cover with buttered aluminum foil and bake alongside the turkey until heated through, about 45 minutes. Uncover stuffing and bake until top is golden brown, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook's Note:</strong> To bake stuffing in pan, butter a 15 by 10-inch baking dish. Mix 1 1/3 cups broth into stuffing and transfer to the prepared dish. Cover with buttered foil and bake at 350°F until heated through, about 45 minutes. Uncover and bake until top is golden brown, about 15 minutes.</p>"}]}