{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/04162012-202122-finished-ramp-pickles-610.jpg", "author": {"@type": "Person", "name": "Marisa McClellan"}, "recipeCuisine": "", "keywords": ["In a Pickle", "ramps", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quick Pickled Ramps with Coriander and Chili Flakes", "link": "https://www.seriouseats.com/recipes/2012/04/quick-pickled-ramps-recipe.html", "description": "Ramps are wild leeks that end up tasting like an earthy cross between green onions and garlic. They make an excellent pickle. This particular combination of pickling spices was heavily influenced by the basic pickling brine recipe in <em>The Wild Table</em>, an excellent book on foraged foods by Connie Green and Sarah Scott. You can pickle the ramp greens as well as the bases, but the greens do not hold up as well and are better kept for sauteeing fresh.", "totalTime": "1 week", "recipeYield": "makes 1 pint", "recipeCategory": ["Pickling", "Vegetarian"], "recipeIngredient": ["3/4 cup unseasoned rice wine vinegar ", "3/4 cup water ", "1/4 cup granulated sugar ", "1 teaspoon pickling salt (or any other fine grain salt) ", "1/2 teaspoon coriander seeds ", "1/2 teaspoon black peppercorns ", "1/8 teaspoon red chili flakes  ", "1 bay leaf", "1 pound ramps, washed, bases trimmed, greens removed, and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine rice wine vinegar, water, sugar and salt in a small saucepan and bring to a boil, whisking until sugar and salt are dissolved. Place coriander, peppercorns, chili flakes, and bay leaves in the bottom of a clean pint jar and pack trimmed ramps into the jar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the vinegar over the ramps, leaving 1/2 inch headspace. Gently tap the jar to loosen any air bubbles and add more pickling liquid, if necessary. Wipe rims and apply a clean lid and ring. Let jar cool for at least an hour and then place in the refrigerator. Give the ramps at least a week in the pickling liquid before eating. </p>"}]}