{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121120-pumpkin-soup-recipe-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brown butter", "fall", "maple", "pumkin soup", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Roasted Pumpkin Soup With Brown Butter and Thyme", "link": "https://www.seriouseats.com/recipes/2012/12/roasted-pumpkin-soup-brown-butter-thyme-recipe.html", "description": "An intensely pumpkin-flavored soup accented with brown butter and thyme.", "totalTime": "2 hours", "recipeYield": "Makes about 3 quarts, serves 6 to 8", "recipeCategory": ["Christmas", "Pumpkin", "Soups and Stews", "Thanksgiving", "The Food Lab", "Vegetarian"], "recipeIngredient": ["1 medium sugar pumpkins or kabocha squash, about 4 1/2 pounds total", "2 tablespoons extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "8 whole stems thyme, plus 1 tablespoon picked thyme leaves", "6 tablespoons (3/4 stick) unsalted butter", "2 large leeks, white and pale green parts only, quartered lengthwise, and finely chopped (about 1 1/2 cups)", "1 small yellow onion, finely sliced (about 3/4 cup)", "1 quart homemade or store-bought low-sodium vegetable or chicken stock", "2 bay leaves", "2 tablespoons maple syrup", "1 tablespoon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 375°F. Split pumpkins in half with a heavy chef's knife or cleaver. Scoop out the seeds and discard or save for another use. Rub pumpkins on all surfaces with oil and season with salt and pepper. Place cut-side-down on a foil-lined rimmed baking sheet and place in oven. Scatter whole thyme stems on top. Roast until completely tender, flipping halfway through cooking, 1 to 1 1/2 hours total. Remove from oven and let rest until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 2 tablespoons butter in a large Dutch oven over medium-high heat. Add leeks and onion and cook, stirring frequently, until softened but not browned, about 4 minutes. Add stock and maple syrup and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large spoon, scoop flesh out of pumpkin and add it to the pot. Discard stem and skins. Let simmer for 15 minutes longer, then remove bay leaves and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree soup in a blender in batches until completely smooth, straining through a fine mesh strainer to catch any particles or fibers. Season soup to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, heat remaining four tablespoons butter in a small skillet over medium heat, swirling constantly, until foam subsides and butter takes on a deep brown color with a nutty aroma, about 1 minute. Remove from heat and add remaining tablespoon thyme leaves (they'll crackle as they hit the hot butter). Add lemon juice and season brown butter to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle soup into serving bowls and drizzle with thyme brown butter. Serve immediately</p>"}]}