{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121121-british-bites-fish-pie.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "fish pie", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Fish Pie", "link": "https://www.seriouseats.com/recipes/2012/11/fish-pie-recipe.html", "description": "A combination of smoked haddock, fresh cod, and a few shrimp, layered with green peas and hardboiled eggs and finally topped with smooth mashed potatoes&mdash;this traditional pie makes for a wonderful fall and winter meal.", "totalTime": "1 hour 10 minutes", "recipeYield": "Serves 4", "recipeCategory": ["British Bites", "Fish", "Mains"], "recipeIngredient": ["2 large russet potatoes, peeled and cut into rough 1 inch cubes ", "Kosher salt and freshly ground black pepper", "5 tablespoons unsalted butter, divided ", "2 1/2 cups milk, divided", "5 eggs ", "3 sprigs thyme ", "2 bay leaves ", "1/2 pound cod fillets, cut into 2 inch pieces ", "1/2 pound smoked haddock, skin removed and flaked into 1 inch pieces ", "1 medium onion, finely chopped (about 1 cup)", "2 tablespoons all-purpose flour ", "1/2 cup heavy cream ", "1/2 pound medium shrimp, peeled and deveined", "1 cup frozen peas, thawed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 375°F. Place potatoes in a saucepan and cover with water. Season well with salt. Bring to a simmer and cook until potatoes are soft, about 15 minutes. Drain and place potatoes back in the saucepan and mash with 1 tablespoon butter and 1/2 cup milk. Season to taste with salt and pepper. Remove from heat and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place eggs in a saucepan and cover with 2 quarts cold water, bring to a simmer then remove from heat and cover with a lid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place remaining 2 cups milk, thyme, and bay leaves in a medium skillet over medium heat. When bubbles begin to form on the surface, place cod and haddock in milk and poach until cod is almost cooked though, about 4 minutes. Drain fish from milk, reserving milk. Discard thyme and bay leaves. Scatter fish along the bottom of the baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons butter in a medium saucepan over medium high heat. Add onion and cook, stirring, until soft, about 5 minutes. Sprinkle with flour and cook, stirring, until flour has just begun to brown, about 4 minutes. Whisking constantly, add reserved milk in thin steady stream. Continue to cook until milk begins to thicken, about 6 minutes, then remove from heat and add cream. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter shrimp over poached fish, followed by peas. Once the eggs are cool enough to handle, peel, then slice. Place sliced egg over peas then pour thickened milk over top. Spread mashed potato mixture over top and dot with remaining 2 tablespoons butter. Bake until fish pie is bubbling and starting to brown, about 30 minutes.</p>"}]}