{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20110131-190579-turnip-gratin.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Edward Behr", "gratins", "recipe newsletter", "The Art of Eating Cookbook", "turnips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Art of Eating's Turnip Gratin ", "link": "https://www.seriouseats.com/recipes/2012/02/the-art-of-eatings-turnip-gratin-recipe.html", "description": "The gratin has the ability to elevate even the most humble of vegetables, even the oft overlooked turnip. This <strong>Turnip Gratin</strong> from <a href=\"http://www.artofeating.com/\">Edward Behr</a>'s <em><strong><a href=\"http://www.amazon.com/Art-Eating-Cookbook-Essential-Recipes/dp/0520270290/?tag=serieats-20\">The Art of Eating Cookbook</a></strong></em> smothers sweet, thinly sliced turnips in a very special béchamel. Instead of the standard that's always rich but often a little bland, this version calls for a slow cooked béchamel that's infused with onion, clove, bay leaf, and ham.", "totalTime": "1 hour 45 minutes", "recipeYield": "serves 4 to 6 as a side dish", "recipeCategory": ["Cook the Book", "Sides"], "recipeIngredient": ["<strong>To make the béchamel:</strong>", "6 tablespoons unsalted butter", "1/2 cup unbleached all-purpose flour", "1 quart cold milk plus more as needed", "1 bay leaf", "1 ounce dry-cured ham, in 1 or 2 slices, optional", "1 or 2 small onions, peeled", "2 cloves", "Salt and black pepper", "Nutmeg", "&nbsp;", "2 1/2 pounds white turnips, peeled and sliced about 1/8 inch thick", "1 cup or more white breadcrumbs", "Unsalted butter  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the béchamel:</strong> Melt the butter in a large, thick-bottomed saucepan, stir in the flour, and cook and stir the mixture for 1 minute. Add the cold milk all at once and immediately whisk the combination smooth, covering the entire bottom of the pan. Stir continuously, switching to a wooden spatula or spoon and still covering the whole bottom, until the mixture thickens and starts to bubble. Lower the heat, and add the bay leaf, ham, and the onion stuck with the cloves. Cook at a steady low bubble for at least 30 minutes, stirring occasionally across the whole bottom of the pan. Place a heat diffuser beneath the pan if necessary to keep the sauce at a bare bubble and prevent sticking and browning. Remove the bay leaf, ham, onion, and cloves. Taste and season well with salt, enough to season the vegetable, too; grind in pepper and add a few gratings of nutmeg, just enough to detect. If necessary, thin the béchamel with milk to an easily pourable consistency, whisking it together—a slightly lumpy consistency will make no difference in the end.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the gratin:</strong> Heat the oven to 350°F. Butter well a baking dish, an 8-by-12-inch oval or equivalent. Arrange half the turnips in one layer and pour half the béchamel over them. Arrange the rest of the turnips in an even layer and add the rest of the béchamel, so as to cover all the turnips. Bake until a knife or fork shows the turnips in the center are soft, about 1 hour. Take the dish from the oven, sprinkle breadcrumbs over the surface, and distribute over them a generous number of thin shavings of butter (more easily shaved from a cold stick). Brown the surface under the broiler, watching and taking care that the dish is far enough from the source that the crumbs don’t blacken.</p>"}]}