{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120921-chichis-chinese-chicken-black-bean-sauce.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "chicken", "Chinese", "fermented black beans", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Chicken with Black Bean Sauce", "link": "https://www.seriouseats.com/recipes/2012/09/braised-chicken-with-black-bean-sauce-recipe.html", "description": "A Cantonese classic: chicken simmered in black bean sauce, with fermented black beans with loads of minced garlic. The beans and the garlic are a snappy pairing, and there is enough sauce in the pot to spoon on top of rice or noodles for a one-dish meal.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chinese", "Mains"], "recipeIngredient": ["6 large cloves garlic, peeled", "1/4 cup dried fermented black beans (see note)", "3 pounds chicken parts (from about one 4-pound chicken), cut into 2-inch segments with a cleaver or heavy knife", "1/4 cup cornstarch", "1 quart vegetable, canola, or peanut oil", "1/2 cup chinese rice wine", "2 cups low-sodium homemade or store-bought chicken broth", "3 jalapeños, sliced, or a few dried red chili peppers", "Kosher salt", "1/4 cup roughly chopped cilantro leaves", "6 scallions, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mince garlic and fermented black beans together, until you have a mashed-up combination of the two.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oil in a wok, Dutch oven, or deep fryer 350°F. Dredge the chicken in the cornstarch. Deep fry chicken until golden brown, about 3 minutes. Remove the chicken with a slotted strainer. Strain and oil and reserve for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of used oil in a large wok or 12-inch skillet over high heat until smoking. Stir-fry the garlic and black bean mixture in the oil until fragrant, about 30 seconds. Add the pieces of chicken and continue to stir-fry until the pieces are all evenly coated, about 30 seconds longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice wine and stock. Add chilies if using. Bring to a boil, reduce to a simmer, then cover and cook until chicken is cooked through, about 30 minutes. Remove chicken and set aside. Increase heat to high and cook without a lid until sauce is reduced to about 1/2 cup. Season sauce to taste with salt, pour sauce over chicken, garnish with scallions or cilantro, and serve immediately.</p>"}]}