{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120415-201863-hanger-steak-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "Eat With Your Hands", "hanger steak", "salad", "steak", "steak salads", "Zakary Pelaccio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Zak Pelaccio's Hanger Steak Salad", "link": "https://www.seriouseats.com/recipes/2012/04/zakary-pelaccios-hanger-steak-salad.html", "description": "This <strong>Hanger Steak Salad</strong> from <a href=\"http://fattycrew.com/the-crew/zak-pelaccio/\">Zakary Pelaccio</a>'s <em><strong><a href=\"http://www.amazon.com/Eat-Your-Hands-Zak-Pelaccio/dp/0061554200/?tag=serieats-20\">Eat with Your Hands</a></strong></em> isn't much of a salad at all.  It's really slices of beefy hanger steak dressed roaring hot with a Southeast Asian dressing and a handful of basil and cilantro.  But there's no need to argue semantics when a steak or salad or whatever you want to call it is this good.  The real story here is steak plus fish sauce and chiles equals awesome.", "totalTime": "20 minutes", "recipeYield": "serves 2", "recipeCategory": ["Beef", "Salads"], "recipeIngredient": ["3 tablespoons palm or brown sugar, or more to taste", "3 to 4 tablespoons fish sauce, or more to taste", "2 to 3 tablespoons fresh lime juice, or more to taste", "Two 1-inch thick hanger steaks (about 7 ounces each)", "Sea salt and freshly ground black pepper", "About 1 tablespoon neutral oil, such as grapeseed or canola", "2 tablespoons Shaoxing wine or dry sherry, or more to taste", "4 garlic cloves, thinly sliced", "1 1/2 inches fresh ginger, peeled and thinly sliced", "6 fresh Thai bird chiles, thinly sliced", "2 fresh long red or green chiles, such as Anaheim or Hungarian Wax, thinly sliced", "1 medium red onion, halved lengthwise and thinly sliced", "1/2 cup fresh Thai basil leaves", "1/2 cup fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the palm sugar, fish sauce, and lime juice.  Taste the mixture.  Do you want it sweeter, saltier, or more acidic?  It's up to you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously season the steaks with salt and pepper.  Heat a cast-iron skillet or sauté pan over medium-high heat until it's smoking.  Add just enough oil to coat the bottom of the pan and add the steaks.  Cook until beautifully brown on one side, about 6 minutes, then flip and cook for 4 more minutes for medium-rare.  Transfer the steaks to a cutting board and let them rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium and add the Shaoxing wine, scrape up any brown bits with a wooden spoon.  Add the garlic, ginger, and chiles, and cook for 30 seconds, remove the skillet from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the steaks against the grain.  Add them to the bowl and top with the pan liquid.  Then add the fish-sauce-lime dressing, the onion, and the herbs.  Toss and serve.</p>"}]}