{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120402-199418-cutdonut-2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cadbury creme eggs", "Cakespy", "pound cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cadbury Creme Scrambled Eggs", "link": "https://www.seriouseats.com/recipes/2012/04/cadbury-creme-scrambled-eggs-recipe.html", "description": "The taste of the eggs is not exceptional on its own (it tastes like a Creme Egg melted in butter and cream), but it's rather good when put on top of \"potatoes\" made from diced day-old doughnuts fried in butter and \"toast with jam\" made of poundcake.", "totalTime": "10 minutes", "recipeYield": "serves 2", "recipeCategory": ["Candy", "Desserts", "Doughnuts"], "recipeIngredient": ["1 day-old plain doughnut (yeast or cake)", "4 tablespoons butter, divided", "2 Cadbury Creme Eggs, unwrapped and diced into pea-sized pieces", "2 tablespoons heavy whipping cream", "1 slice pound cake", "1 tablespoon jam or preserves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice your day-old doughnut into approximately 1/2-inch sized cubes; set aside. Melt 2 tablespoons of butter in a skillet over medium-high heat. Once it is melted and lightly bubbling, place your doughnut cubes into the pan. Fry the first side until lightly browned, about 2 minutes. Flip using a metal spatula, and fry on the second side until lightly browned, about 1 minute longer. Remove from heat and transfer doughnut pieces to a paper towel to blot any excess oil. Wipe out skillet with paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together your diced Cadbury Creme Egg pieces and heavy whipping cream with a fork. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the burner back on, and melt the remaining 2 tablespoons of butter over medium-high heat. Once melted and lightly bubbling, spoon the Creme Egg mixture into the frying pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently \"scramble\" the Egg mixture as it cooks with a rubber spatula, so that all sides will be cooked through. Once it starts to brown (the chocolate will get a little \"char\" on it), remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble your plates. First, cut each slice of pound cake in half and apply jam. Place half of the fried doughnuts next to the pound cake, and add half of the scrambled Creme Eggs to each plate last. Enjoy immediately.</p>"}]}