{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120615-chichis-chinese-pork-belly-dish-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "Chinese", "pork", "pork belly", "sichuan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Twice-Cooked Pork", "link": "https://www.seriouseats.com/recipes/2012/06/twice-cooked-pork-recipe.html", "description": "Twice-cooked pork is a Sichuan dish of fatty pork leg or belly that gets two very different cooking preparations. In the first stage, the belly is simmered just until it is cooked through. Then you stir-fry the slices of belly until the meat is brown, the fat has rendered somewhat, and the layer of skin is a little crispy around the edges. Finally, add to the wok what I think should be some kind of holy trinity of Chinese pastes: black bean, chili bean, and sweet bean.", "totalTime": "1 hour", "recipeYield": "serves 4 as part of a multi-course meal", "recipeCategory": ["Chinese", "Mains", "Pork"], "recipeIngredient": ["about 12 ounces fresh boneless, rind-off pork belly", "6 baby leeks, 12 ramps, or 12 green onions, sliced on a steep bias into 2-inch long segments", "2 tablespoon cooking oil or lard", "1 1/2 to 2 tablespoons chili bean paste", "2 teaspoon sweet bean paste (tian mi jiang)", "2 teaspoons fermented black beans, or 1 tablespoon fermented black bean paste", "1 teaspoon soy sauce", "1 to 2 teaspoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to boil. Add the pork and simmer until it is just cooked through, about 25 minutes. Remove the pork from the water and let cool. (Water can be set aside for use in stock, or discarded.) Place the belly in the refrigerator for an hour or more to firm up the flesh.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat is cool, slice it thinly so you have 1/4-inch thick rectangles of meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil or lard in wok over medium-high heat until shimmering. Add the slices of pork and stir-fry until the fat has rendered somewhat and the skin is brown and somewhat crisp, about 2 minutes. Push the pork to one side of the wok and add the chili bean paste. Stir-fry until the oil is red, then add the sweet bean paste and the black beans and stir-fry for a few seconds longer. Mix everything together and add the soy sauce and the sugar/  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the leeks or ramps and stir-fry until they are just cooked, about 30 seconds. Serve immediately. </p>"}]}