{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120223-194320-pastry-cream-610x458-66.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "chocolate cream", "cream", "pastry cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Pastry Cream", "link": "https://www.seriouseats.com/recipes/2012/02/chocolate-pastry-cream-how-to-make-recipe.html", "description": "This is a delicious chocolate version of pastry cream. Use it whenever recipes call for regular pastry cream for a chocolate treat. If you are using it as a pie filling, be sure to lighten it with whipped cream before using (optional directions below).", "totalTime": "3 hours", "recipeYield": "makes 1 quart", "recipeCategory": ["Desserts"], "recipeIngredient": ["7 ounces bittersweet chocolate, melted", "8.8 ounces granulated sugar, divided", "3.5 ounces corn starch", "2 eggs", "4 egg yolks", "1 quart whole milk", "1/2 teaspoon salt", "3 tablespoons butter", "1 tablespoon vanilla extract", "Optional (for lightening): 5 ounces heavy cream, whipped to soft peaks and chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dampen the surface of a sheet tray and line the bottom and sides with plastic wrap. Keep the roll of plastic wrap handy, and set aside. Melt the chocolate and hold it warm in a bowl set over some hot water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In a medium sized bowl, combine the starch and half the sugar and whisk together until incorporated. Add the eggs and yolks and whisk for 2 minutes without stopping. Set aside. In a medium saucepan, combine half the sugar, milk, salt and stir. Set over medium heat and bring to a simmer. Temper the egg mixture with the hot milk a little at a time, whisking thoroughly between additions. Pour the liquid back into the pot and whisk over low heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to whisk as the mixture thickens. Whisk through the lumps until the pastry cream becomes smooth. When it begins to bubble, whisk for two additional minutes, then remove from heat. Whisk in the butter and vanilla extract until they melt and fully incorporate. With a large rubber spatula, stir in the warm, melted chocolate until it is fully blended. Scrape the pastry cream onto the prepared sheet and press another layer of plastic over the surface. Allow it to cool to room temperature. Transfer to the fridge to chill for at least two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before using, place the pastry cream in the bowl of a stand mixer fitted with a paddle attachment and whip for 1 minute, taking care to scrape down the sides. Stop when the pastry cream is smooth and supple. Use immediately, or, if you'd like to lighten it, fold in the chilled whipped cream. Serve immediately.</p>"}]}