{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120510-205806-salted-caramel-banana-bread-pudding.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "Bake the Book", "bananas", "bread pudding", "caramel", "salted caramel", "Sinfully Easy Delicious Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Salted Caramel Banana Bread Puddings", "link": "https://www.seriouseats.com/recipes/2012/05/alice-medrich-salted-caramel-banana-bread-pudding-recipe.html", "description": "Bread and bananas are two items that seem to fall by the wayside, at my house at least.  A two day old half baguette or a few slices of white and a spotty banana or two are exactly what makes this recipe for <strong>Salted Caramel Banana Bread Puddings</strong> the ideal last minute dessert, that is, if you have the same overages of bread and bananas.", "totalTime": "1 hour", "recipeYield": "serves 8", "recipeCategory": ["Banana", "Bread Pudding", "Fruit Desserts", "Puddings and Custards"], "recipeIngredient": ["Rounded 1/4 teaspoon salt", "1 1/4 cups caramel sauce, store-bought or homemade", "8 thin slices slightly stale or very lightly toasted firm white sandwich bread (such as Pepperidge Farm or Oroweat/Arnold’s Country Buttermilk or Country Potato Bread) ", "2 ripe bananas", " ", "<strong>For the custard:</strong>", "6 large eggs", "2 tablespoons sugar", "1/8 teaspoon salt", "1 teaspoon pure vanilla extract", "2 cups half-and-half", "1/2 cup whole milk", "2 tablespoons (1 ounce) unsalted butter, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the salt into the caramel sauce. Butter the ramekins and spoon a generous tablespoon of the caramel into the bottom of each one. Spread a tablespoon of the remaining sauce on one side of each bread slice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the bananas on a slight angle into 1/4-inch-thick slices. Cut 1 slice of bread lengthwise in half and then crosswise into thirds, to make 6 pieces. Place a slice of banana on each piece of bread. Stack 4 pieces of the banana-topped bread, turn the stack on its side, and place it in a ramekin. Put the 2 remaining pieces of bread, banana side inward, on either side of the stack. Repeat to fill the remaining ramekins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the custard:</strong> Whisk the eggs, 1 tablespoon of the sugar, the salt, and vanilla in a medium bowl just until blended but not foamy. Whisk in the half-and-half and milk. Fill each ramekin with the egg mixture, reserving any left over. Let stand until the bread is saturated, \u202820 to 30 minutes, topping off the puddings with the remaining egg mixture as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the lower third of the oven and preheat the oven to 400°F. Put a kettle of water on to boil. Brush or drizzle the exposed edges of the bread with the melted butter, then sprinkle the buttered edges with the remaining tablespoon of sugar, using a generous teaspoon per pudding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe any smudges off the ramekins and set them in the baking pan. Put the pan in the oven. Pull out the oven rack and pour boiling water into the pan to come halfway up the sides of the ramekins. Bake for 20 to 30 minutes, until the edges of the bread are golden brown and a knife inserted in the puddings comes out mostly clean. Let cool for 10 minutes in the water bath, then remove with tongs. If not serving within 2 hours, cover and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the puddings in their cups, warm, at room temperature, or cold, or reheated individually for a few seconds in the microwave. Or unmold them: slide a thin knife around the inside of each ramekin to detach the pudding, tip the ramekin on a dessert dish, and slide the pudding out, letting the sauce flow around it. Scrape the extra sauce from the cup around it or drizzle on top.</p>"}]}