{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120930-22417-telegraham2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "Cookies", "graham crackers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Tele-Graham Crackers", "link": "https://www.seriouseats.com/recipes/2012/10/tele-graham-crackers-cookies-to-send-recipe.html", "description": "Label these graham cracker cookie sandwiches with a sweet message before sending them to a friend.", "totalTime": "1 hour", "recipeYield": "Makes 12 sandwiches", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["6 graham crackers ", "1/2 pound (2 sticks) butter, softened", "6 to 8 cups confectioners' sugar", "2 teaspoons vanilla", "1 to 2 tablespoons milk or cream", "Writing icing, such as Cake Mate writing Icing Decorator Tubes  (tubes marked “Gel Icing” will not work as they do not harden!)", "Small boxes (jewelry boxes, available at most craft or packaging supply stores, work nicely)", "Padded mailers "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break each graham cracker in half so that you have two square pieces. Set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the frosting filling. In the bowl of a stand mixer fitted with a paddle attachment, cream butter until very smooth, about 3 minutes on high speed. Reduce speed to low and add about 3 cups of confectioners' sugar. Continue beating on low speed until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pause to scrape down the sides of the bowl. Add vanilla. Add remaining confectioners' sugar, bit by bit, until desired spreading consistency has been reached. If the frosting gets too thick, stir in some milk or cream to thin it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread your filling on one side of each pair and adhere the second half on top to form a little sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your writing icing, write your message on the top of the cookie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let dry; once the icing is set, wrap in waxed paper and place in small boxes (I  find that 3 1/2-inch square jewelry boxes work nicely; they’re available at packaging supply stores). Use crinkled paper to fill the top and bottom of the boxes, and all of those in a padded mailer or box. These confections will fare well for 3 to 4 days, so choose your method of shipping accordingly. </p>"}]}