{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120423-195206-tapioca-pudding-610x458-9.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pudding", "Sweet Technique", "tapioca"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Homemade Tapioca Pudding", "link": "https://www.seriouseats.com/recipes/2012/05/homemade-tapioca-pudding-recipe.html", "description": "I love the simplicity of homemade tapioca pudding, the delightful milk-based custard thickened with the excess tapioca starch from hundreds of slightly chewy tapioca pearls. If you're planning to make tapioca, the hardest part is waiting for the tapioca pearls to soak. Plan accordingly.", "totalTime": "14 hours", "recipeYield": "serves 6", "recipeCategory": ["Puddings and Custards"], "recipeIngredient": ["1/2 cup medium pearl tapioca (do not use instant varieties)", "4 cups whole milk", "1 tablespoon pure vanilla extract", "1 cup sugar, divided", "1/2 teaspoon salt", "1 egg", "3 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tapioca in a large bowl with a quart of cold water. Cover and allow the tapioca to soak for at least 12 hours. When ready to use, use a fine mesh strainer to drain off the water and set the soaked pearls aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, combine the milk, vanilla, 1/2 cup sugar, and the salt and set aside. Place the eggs and yolks in a large bowl and whisk them until they are combined. Slowly add the remaining 1/2 cup sugar, a little at a time, whisking constantly, until all of the sugar is added. Whisk until the egg mixture is a very light yellow color, about two minutes, then set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the saucepan with the milk mixture over low heat and bring to a simmer. Once it begins to bubble, remove the pot from heat and temper the eggs with the hot liquid by whisking the eggs constantly as you add the liquid a little at a time. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the two mixtures are completely combined, pour the custard back into the original pot and and add the tapioca. Whisk constantly over low heat. As you whisk, the mixture will begin to thicken. Watch the pearls, they will become translucent, with just a bit of cloudiness in the centers, indicating that the pudding is done. Do not worry that the pudding looks a bit watery, as extra liquid will be absorbed during the cooling process. Scrape the pudding into a bowl and press plastic wrap directly onto the top surface. Chill in the fridge, at least 2 hours.</p>"}]}