{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120924-fiaf-cod-with-leeks-edit.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["cod", "French in a Flash", "leeks", "quick", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "5"}, "name": "Crispy Cod Cooked 'Unilaterally' with Creamed Leeks", "link": "https://www.seriouseats.com/recipes/2012/09/crispy-cod-cooked-unilaterally-with-creamed-leeks-recipe.html", "description": "Simply cook cod on one side until it's crisp and golden and serve it on a bed of delicate creamed leeks for an easy, not too heavy dish.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Fish", "French", "Mains"], "recipeIngredient": ["4 cod filets, about 6 ounces each", "Kosher salt and freshly ground black pepper", "2 tablespoons olive oil", "12 baby leeks, finely sliced (about 2 cups sliced leeks)", "1/2 cup heavy cream", "Lemons for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the cod with salt and pepper. Heat oil over medium heat in a large non-stick skillet until shimmering. Add the cod, presentation side down. Cover and cook without moving until the fish is cooked through, about 15 minutes (meat should flake easily when pulled with a fork). Carefully transfer fish to a large plate, crisp-side up, and tent with foil to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off most of the oil from the pan and return it to medium heat. Add the leeks, season with salt and pepper, and sweat until soft, about 6 minutes, adding up to 1/3 cup water to encourage softening if necessary.  Add 1/3 cup of water to help soften the leeks further. Add cream, increase heat to high, and bring to a boil. Cook until lightly thickened, then season to taste with salt and pepper. To plate, scoop the creamed leeks onto the bottom of a serving dish and top with the cod, golden side up. Serve with lemon wedges.</p>"}]}