{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120717-chichi-shrimp.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "fried shrimp", "shrimp", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese-Style Deep-Fried Salty Shrimp", "link": "https://www.seriouseats.com/recipes/2012/07/deep-fried-shrimp-recipe.html", "description": "Frying shrimp takes five minutes, tops, even for ones that are quite large. Once the shrimp are fried, you toss them with minced garlic, green onions, and red chili pepper flakes, all of which have been browned and crisped with a bit of oil. ", "totalTime": "30 minutes", "recipeYield": "serves 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Deep Frying", "Shrimp", "The Nasty Bits"], "recipeIngredient": ["3 cups peanut, canola, or vegetable oil", "3 large cloves minced garlic (about 3 tablespoons)", "2 scallions, thinly sliced", "1 teaspoon dried red chili pepper flakes (optional)", "12 to 16 whole jumbo shell-on, head-on shrimp, about 1 pound", "1/2 egg, beaten", "1/4 cup cornstarch", "Kosher salt and freshly ground black pepper", "1 teaspoon five spice powder, Old Bay, smoked paprika, Sichuan peppercorns, or a combination (optional, as desired)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat two tablespoons of oil in a wok over medium heat until shimmering. Add the garlic, scallions and let brown, stirring occasionally, 3 to 5 minutes. Add the chili pepper flakes if using and stir until aromatic, about 30 seconds.  Transfer oil and aromatics to a large metal bowl. Wipe wok clean with paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining oil to wok and heat to 375°F over medium heat. Meanwhile, combine egg and cornstarch in a medium bowl. Add shrimp and toss to coat.  When the oil is ready, add half of the shrimp, dropping them into the oil one at a time. Cook, agitating and flipping shrimp frequently until crisp and just cooked through, 2 to 3 minutes total. Transfer shrimp to a paper towel-lined plate and repeat with remaining batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add drained fried shrimp to bowl with browned aromatics. Season to taste with salt, pepper, and optional additional seasonings. Serve immediately. </p>"}]}