{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120703-213207-sunday-gravy-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Italian", "keywords": ["beef", "braciole", "grill", "grilling", "Italian", "meatballs", "rib", "sauces", "sausage", "sunday gravy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Sunday Gravy", "link": "https://www.seriouseats.com/recipes/2012/07/grilled-sunday-gravy-recipe.html", "description": "Four meats, six pounds of tomatoes, and five hours of time well spent results in an incredibly rich and meaty sauce ready to top pasta, followed by a second course of excellent grilled and sauce-simmered meatballs, sausages, and braciole.", "totalTime": "4-5 hours", "recipeYield": "serves 10", "recipeCategory": ["Beef", "Grilling", "Italian", "Mains", "Pasta"], "recipeIngredient": ["<strong>For the Beef Braciole</strong>:", "1/4 cup toasted breadcrumbs ", "2 ounces thinly sliced prosciutto, cut into 1/4-inch-wide matchsticks ", "1 tablespoon grated Parmesan ", "1 tablespoon finely chopped fresh parsley  ", "2 medium cloves garlic, finely minced (about 2 teaspoons)", "2 tablespoon olive oil ", "1 lb flank steak, butterflied ", " ", "<strong>For the Meatballs</strong>:", "3/4 pound ground beef chuck ", "1/4 pound ground pork ", "1/2 cup toasted bread crumbs ", "1 large egg, lightly beaten ", "1/4 cup grated Parmesan ", "1/4 cup grated Pecorino Romano ", "1 tablespoon finely chopped fresh parsley ", "1 medium clove garlic, finely minced (about 1 teaspoon)", "1/8 teaspoon red pepper flakes", " ", "6 pounds roma tomatoes, halved (about 16 medium tomatoes)", "1 rack baby back ribs, peeled and trimmed of excess fat ", "1 pound hot Italian sausage ", "1/4 cup olive oil, plus more for brushing braciole and meatballs ", "2 cups finely chopped yellow onion (about 2 small)", "4 medium cloves finely minced garlic (about 4 teaspons)", "1 tablespoon dried oregano ", "1/2 teaspoon crushed red pepper ", "1/4 cup tomato paste ", "2 cups low sodium store-bought or homemade chicken broth", "1/2 cup dry red wine ", "1/3 cup finely chopped fresh basil leaves ", "Kosher salt and freshly ground black pepper", " ", "<strong>Type of fire: </strong><a href=\"http://www.seriouseats.com/2010/04/grilling-how-to-arrange-place-coals-for-direct-indirect-fire-grilling-cooking.html#direct\">Direct</a> ", "<strong>Grill heat: </strong><a href=\"http://www.seriouseats.com/2010/04/grilling-how-hot-heat-fire-temperature-for-food-meat-burgers-chicken-veggies-fish.html#mediumhigh\">medium-high</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the beef braciole:</strong> in a small bowl, mix together breadcrumbs, prosciutto, Parmesan, parsley, garlic, and olive oil. Open up butterflied flank steak, arranged so the grain of meat is parallel to you, and season exposed side with salt and pepper. Spread bread crumb mixture evenly over the beef, leaving a 1/2-inch border along the side furthest from you; press and gently pack the stuffing mixture onto beef to keep it in place. Starting from the side nearest to you, roll up meat like a jelly roll, pressing any stuffing that falls out of the ends back into roll. Tie beef tightly with twine, spacing ties evenly about every 1 1/2 inches. Season outside with salt and pepper all over, wrap in plastic wrap, and refrigerate until ready to grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the meatballs:</strong> In a large bowl, mix together chuck, pork, bread crumbs, eggs, Parmesan, Pecorino, garlic, parsley, and red pepper flakes until thoroughly combined. Roll out meat mixture into balls 1 1/2 inches in diameter. Season meatballs all over liberally with salt and pepper. Refrigerate until ready to grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, light all the burners of a gas grill to medium-high heat. Cover and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Grill tomatoes, cut side down, until they have grill marks and start to blacken, about 5 minutes. Remove from grill, let cool, then process through a food mill fitted with largest disc set over a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season ribs liberally with salt and pepper. Grill, meat side down, until well browned. 5 to 10 minutes. Slice into individual ribs and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill sausage until well browned all over, 3 to 4 minutes per side. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place large stockpot or dutch oven on grill and add in 1/3 cup olive oil. Heat until shimmering, then add onion. Cook, stirring occasionally, until onions are lightly browned, about 8 minutes. Add garlic, oregano, and crushed red pepper and cook until fragrant, about 30 seconds. Stir in tomato paste and cook for 2 minutes. Stir in reserved tomatoes, chicken stock, and red wine. Bring sauce to a boil, then nestle ribs, and sausage into sauce. Let simmer for 2 to 3 hours, replenishing coals or moving stockpot to stove burner as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Replenish coals on grill. Brush meatballs with olive oil and place on grill and cook until well browned all over and cooked through, about 8 minutes total, 2 minutes per side. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill beef braciole until well browned on all sides, 3 to 4 minutes per side. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle meatballs and braciole in sauce and simmer for 30 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove meats from sauce. Stir in basil and season sauce with salt and pepper to taste. Serve sauce over freshly cooked pasta, serving meats separately.</p>"}]}