{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120127-188620-mixed-berry-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["berries", "blueberries", "pie", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.3333333333333", "ratingCount": "3"}, "name": "Mixed Berry Pie (Made with Frozen Berries)", "link": "https://www.seriouseats.com/recipes/2012/02/mixed-berry-pie-made-with-frozen-berries-recipe.html", "description": "Frozen berries are a great alternative to fresh for winter baking. Many people fret about whether they should thaw the fruit first, but you don't need to. With the exception of a slightly longer baking time, the results are no different from baking with fresh berries, and the crust actually holds its shape well with frozen berries inside. Feel free to adjust the sugar and cornstarch to your tastes for sweetness and texture; less cornstarch will yield a runny pie, more will give the filling a more jammy texture.", "totalTime": "4 hours", "recipeYield": "makes 8 servings", "recipeCategory": ["Blueberry", "Pies, Tarts, and Crumbles", "Raspberry"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "8 ounces granulated sugar", "1 to 2 ounces cornstarch (if you prefer a runny pie, go with 1 or 1.5 ounces. For a firmer filling, use 2 ounces)", "24 ounces frozen mixed berries", "Zest of 1 lemon", "Egg wash (1 egg plus a pinch of salt, beaten)", "Sanding sugar for the top (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. In a small bowl, whisk together sugar and cornstarch and set aside. Remove the berries from the freezer and toss them with the sugar mixture to coat them completely. Pour the berries into the shaped, chilled pie shell. Cover with the rolled, chilled top crust and crimp the edges to seal. Chill the pie for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 20 minutes, remove from the fridge, brush the top with egg wash, sprinkle with sugar if using, and cut a few slits in the top with a sharp knife. Bake the pie centered on the lowest rack of the preheated oven for 20 minutes, rotating halfway through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop the oven temperature to 375&deg;F, and continue baking until the top is golden brown the the filling is bubbling up through the slits. If parts of the crust begin to look too dark, cover these spots with patches of foil to protect them from burning. Cool pie for 30 minutes before serving.</p>"}]}