{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120723-jenis-baked-alaska-pie.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["baked alaska", "ice cream desserts", "jeni britton bauer", "jeni's splendid ice cream", "meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jeni Britton Bauer's Baked Alaska Pie", "link": "https://www.seriouseats.com/recipes/2012/07/jeni-britton-bauers-baked-alaska-pie-recipe.html", "description": "This dessert is versatile. With sweet potato ice cream, it takes on a Thanksgiving personality. With dark chocolate, coconut, banana, or lemon ice cream, it feels like dessert à la Route 66: chocolate silk, coconut cream, banana cream, or lemon meringue pies. With Roasted Strawberry &amp; Buttermilk Ice Cream, made with the addition of a teaspoon of rose water or a drop of essential oil, if you like, it becomes an elegant spring offering.", "totalTime": null, "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For Pie Crust</strong>", "3/4 cup all-purpose flour", "1/4 cup whole wheat flour", "1/2 cup old-fashioned oats", "2 tablespoons light brown sugar", "1/4 teaspoon fine sea salt", "8 tablespoons (1 stick) unsalted butter, cut into 1/2-inch cubes and chilled", "1 large egg yolk", "2 tablespoons half-and-half", "1/4 teaspoon vanilla extract", "&nbsp;", "1 batch ice cream or sorbet of your choice, slightly softened if necessary", "&nbsp;", "<strong>For Italian Meringue</strong>", "4 large egg white", "1 cup granulated sugar", "1/4 cup water", "1 tablespoon light corn syrup", "Pinch of fine sea salt", "Pinch of cream of tartar", "1 vanilla bean, split, seeds scraped out and reserved (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For The Pie Crust</strong>: Combine the all-purpose flour, whole wheat flour, and oats in a food processor and process until the oats are in bits. Add the sugar and salt and pulse to combine. Add the butter and pulse just until the dough begins to come together and looks crumbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the egg yolk and half-and-half together in a small bowl. Add the vanilla and whisk to combine. Add to the flour mixture and pulse until the mixture forms a dough. Turn the dough out onto a lightly floured surface, gather it into a ball, and press into a disk. Wrap in plastic and refrigerate until firm, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and let warm for a few minutes to relax the dough. On a lightly floured surface, roll the dough into a circle just under 14 inch thick.  Gently fold the circle over the rolling pin and lift into a 9-inch pie pan. Press the dough into the pan and trim the edges to a 12-inch overhang. Roll the edge of the dough under itself and tuck and pinch to create a fluted edge; you can also use a fork to create a decorative finish. Refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Prick the bottom of the dough all over with a fork. Line with a square of parchment paper and fill with pie weights or dried beans. Bake for 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift out the liner and weights and bake for another 12 to 15 minutes, or until the shell is lightly browned and cooked through on the bottom. Let cool, then wrap well in plastic wrap and freeze. Fill the shell with the ice cream, cover with plastic wrap, and freeze for at least 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meringue</strong>: Put the egg whites in the bowl of a stand mixer fitted with a whisk attachment. Combine the sugar, water, corn syrup, and salt in a heavy-bottomed saucepan and bring to a boil over medium-high heat, stirring once or twice to dissolve the sugar; once the sugar is dissolved, do not stir the syrup again. Insert a candy thermometer in the pan. When the syrup reaches 215°F, turn the mixer on to medium speed and start whipping the egg whites. (You want to time the whipping of the egg whites so that they reach soft peaks by the time the syrup is ready.) When the egg whites begin to foam, add the cream of tartar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the syrup reaches 238°F, remove it from the heat. With the mixer on medium speed, carefully pour the syrup out in a slow, steady stream down the side of the mixer bowl—be careful not to let the stream of syrup come into contact with the whisk. Once all of the syrup has been added, add the vanilla seeds, if using, turn the speed upto high, and whip until the meringue forms billowy peaks and is cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ice cream pie from the freezer and mound dollops of the meringue on top. Place in the freezer, uncovered, until ready to serve. (The assembled pie can be stored in your freezer for up to a month. Once the meringue has frozen, wrap the entire pie in plastic wrap.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 475°F. Remove the pie from the freezer and bake for about 5 minutes, just enough to brown the meringue on top and slightly melt the edges of the ice cream. Slice and serve.</p>"}]}