{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121101-228501-preserved-strawberry-cranberry-jam.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["cranberries", "frozen fruit", "Preserved", "Preserves", "strawberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Strawberry Jam", "link": "https://www.seriouseats.com/recipes/2012/11/cranberry-strawberry-jam-recipe.html", "description": "Sweet strawberries are always the life of the party, and we've invited tart cranberries as well, making for a bright red taste explosion. This jam is ultra flavorful, and it will cause your sun-starved salivary glands to kick into high gear.", "totalTime": "1 1/2 hours", "recipeYield": "Makes Six (8-ounce) jars of jam", "recipeCategory": ["Condiments and Sauces", "Cranberry", "Preserved", "Strawberry"], "recipeIngredient": ["1 pound frozen cranberries, defrosted", "3 pounds frozen strawberries, defrosted", "1 pound (about 2 1/4 cups) plus 1/4 cup white sugar, divided", "1/4 cup brown sugar", "1/2 teaspoon kosher salt", "3 tablespoons juice from about 2 lemons", "1/2 teaspoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small plate in the freezer so you can test the jam for proper thickness later. Sterilize jars and lids. In a food processor, pulse the cranberries until they are coarsely chopped, about three 1-second pulses. Add the strawberries and pulse two more times. If you prefer a smoother jam, feel free to pulse to a finer texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the fruit into a deep, heavy-bottomed pot and toss with 1/4 cup of white sugar. Cover and allow to sit for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mash the fruit slightly with a potato masher to break up any clumps that have formed. Add remaining sugar, brown sugar, salt, lemon juice, and butter. Cook over medium heat, stirring occasionally, until the fruit begins to bubble and spit. Use a skimmer to skim off any foam that forms. Cook for about 20 minutes, stirring frequently to keep the fruit from sticking to the bottom of the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin testing the jam for doneness. Spread 1/2 teaspoon of cooked fruit on the cold plate and place it back in the freezer. Wait 30 seconds, then run your finger through the fruit. It should be thick enough to maintain a path when you run your finger through it. If you’d like thicker jam, place the plate back in the freezer and cook the fruit for another 4 minutes and test again. Repeat until desired thickness is achieved, but be careful about cooking too long or you will alter the taste of your jam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pot from heat and use a spoon to skim any foam from the surface of the fruit. Ladle jam into sterilized jars, leaving 1/2-inch of headroom, and process them in a hot water bath for 10 minutes. Unopened jars will keep at room temperature for up to 6 months. Opened jam should be refrigerated.</p>"}]}