{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120219-193863-Bar-Snacks-Twice-Baked-2.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["appetizers", "bar bites", "grilled potato", "potato", "snack", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled, Loaded Twice-Baked Potatoes", "link": "https://www.seriouseats.com/recipes/2012/03/grilled-loaded-twice-baked-potatoes.html", "description": "Twice-baked potatoes prepped in the oven and finished on the grill get pilled high and are stippled with fillings: extra-sharp cheddar, peppered bacon and chives. Note: Instead of brushing skins with butter before they're grilled, try using some reserved bacon...", "totalTime": "1 hour, 45 minutes", "recipeYield": "4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Potato", "Snacks"], "recipeIngredient": ["4 medium Idaho baking potatoes, scrubbed", "4 ounces (1/2 block large box) cream cheese, room temperature", "½ cup sour cream", "8 ounces (1 block) extra-sharp cheddar cheese, shredded, divided use", "4 slices peppered bacon, cooked and finely crumbled", "3 tablespoons finely minced, fresh chives", "Kosher salt", "4 tablespoons butter, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust rack to the middle position of oven and preheat to 375&deg;F.  Poke each potato a several times with a fork and place directly on the rack.  Bake until skin just starts to crisp and flesh is soft, about 1 hour. Remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat a gas grill to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cool enough to handle, slice off upper third of potatoes. Scoop out interior into a medium bowl, leaving a ¼-inch layer of flesh. Add cream cheese and sour cream and beat with a hand-held mixer until thoroughly combined and fluffy, about 30 seconds. Fold in all but ¼ cup of the cheddar cheese, bacon and chives with a wooden spoon. Season with salt, to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush outer skins with melted butter. Fill hollowed skins generously with potato mixture and sprinkle tops with reserved cheese. Place in the center of the grill over direct heat and cook until skins are crackly, the interiors are warmed through and the cheese on top is bubbly, 7-10 minutes. Remove from grill and let cool for 3 minutes before serving.</p>"}]}