{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/201200925-223919-dinner-tonight-steamed-walleye-tatsoi-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Dinner Tonight", "fish", "greens", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Steamed Walleye with Tatsoi, Ginger, and Scallions", "link": "https://www.seriouseats.com/recipes/2012/10/steamed-walleye-with-tatsoi-ginger-scallions-recipe.html", "description": "I'm not sure why steaming fish always scares me. Perhaps it's the cleanup, which too often takes longer than I'd like. But what if could find a way to steam that was actually easy, perhaps by cooking everything together on one plate?", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Chinese", "Dinner Tonight", "Fish"], "recipeIngredient": ["2 tablespoons soy sauce", "2 tablespoons rice wine", "2 teaspoons sesame oil ", "2-inch piece of fresh ginger, peeled, half minced and half thinly sliced  ", "8 scallions, ends trimmed, half minced and half cut into 1-inch pieces", "1/2 bunch tatsoi (or other greens), stems removed ", "2 Walleye fish fillets, about 6 ounces each (whitefish, tilapia, or catfish would also work)", "Cooked white rice (for serving)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-sized bowl, whisk together the soy sauce, rice wine, sesame oil, minced ginger, and 1/2 of the minced scallions.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the tatsoi leaves on a 10 1/2-inch heat-proof serving plate, along with the sliced ginger and 1-inch pieces of scallions. On top, add the walleye fillets. Spoon a couple tablespoons of the sauce on top of the fish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 inch of water to the bottom of a 14-inch flat-bottomed wok, bring to a boil over high heat, and then reduce the heat to maintain a strong simmer. Meanwhile, roll a 1- by 3-foot sheet of heavy duty aluminum foil into a 1-foot long rope-like piece, then form it into a ring, while keeping the sides about two inches tall. Place in the wok, then carefully add the plate on top. There should be space around the edge of the plate for the steam to come up. (If not, carefully remove the plate, remove foil with tongs, and reshape until it supports the plate above the liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the wok, and let the fish steam until it is fully cooked and flakes easily with a fork, 8 to 10 minutes. The water shouldn't run out, but if it does, add some more in. When done, carefully remove the plate, divide the contents between two plates. Serve with white rice and more of the sauce. </p>"}]}