{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120301-tonkotsu-ajitsuke-tamago-marinated-egg-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["chashu", "egg", "Japanese", "ramen", "sake", "soft-boiled", "soft-boiled egg", "soy", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.6153846153846", "ratingCount": "13"}, "name": "Japanese Marinated Soft Boiled Egg for Ramen (Ajitsuke Tamago)", "link": "https://www.seriouseats.com/recipes/2012/03/ajitsuke-tamago-japanese-marinated-soft-boiled-egg-recipe.html", "description": "<p>Homemade ramen deserves the very best toppings, like these perfectly soft-boiled eggs marinated in a sweet and salty soy-based sauce. Split in half and resting on the noodles, they're an amazing accompaniment to enrich and flavor the ramen. If you have broth leftover from chashu pork, it can be used to marinate the eggs in place of the other ingredients.</p>\r\n", "totalTime": "At least 4 hours to marinate", "recipeYield": "makes 6 eggs", "recipeCategory": ["Dairy-Free", "Eggs", "Japanese", "The Food Lab"], "recipeIngredient": ["1 cup water (about 8 ounces; 225g)", "1 cup sake (about 8 ounces; 225g)", "1/2 cup soy sauce (about 4 ounces; 115g)", "1/2 cup mirin (about 4 ounces; 115g)", "1/2 cup sugar (about 3 1/2 ounces; 100g)", "6 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water, sake, soy, mirin, and sugar in a medium bowl and whisk until sugar is dissolved, or use an equal amount of <a href=\"https://www.seriouseats.com/recipes/2012/03/chashu-pork-marinated-braised-pork-belly-for-tonkotsu-ramen-recipe.html\">chashu broth</a> instead. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 quarts of water to a boil in a medium saucepan over high heat. Pierce fat end of each egg with a thumbtack to make a tiny hole (this prevents them from cracking and eliminates the air bubble at the end). Carefully lower eggs into water with a wire mesh spider or slotted spoon. Reduce heat to maintain a bare simmer (about 190&deg;F). Cook for exactly 6 minutes. Drain hot water and carefully peel eggs under cold running water (the whites will be quite delicate).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer eggs to a bowl that just barely fits them all. Pour marinade on top until eggs are covered or just floating. Place a double-layer of paper towels on top and press down until completely saturated in liquid to help keep eggs submerged and marinating evenly. Refrigerate and marinate at least four hours and up to 12. Discard marinade after 12 hours. Store eggs in a sealed container in the fridge for up to 3 days. Reheat in ramen soup to serve.</p>"}]}