{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120216-192915-lamb-eggplant-walnut.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["eggplant", "janissary spice", "lamb", "maras chile", "Spice Hunting", "spices", "sumac", "turkish", "walnuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Eggplant with Lamb and Walnut Sauce", "link": "https://www.seriouseats.com/recipes/2012/02/baked-eggplant-with-lamb-and-walnut-sauce-turkish-recipe.html", "description": "A Turkish-inspired dish with a ragu as complex as bolognese that can be made in a fraction of the time. The principal spice blend in the sauce is called janissary spice, the product of Turkish spice blender in Istanbul, but it's easy to replicate at home. Seek out mara&#351; chiles, which are intensely sweet, not that hot, and carry the rich flavors of sun-warmed tomatoes with hints of red bell pepper for the blend. You can find them at Cambridge's <a href=\"http://www.formaggiokitchen.com/shop/product_info.php?products_id=641\">Formaggio Kitchen</a> and Oakland's <a href=\"http://www.markethallfoods.com/products.php?product=Maras-and-Urfa-Pepper\">Market Hall foods</a> (both sell online as well). Easier-to-find <a href=\"http://www.seriouseats.com/2010/07/spice-hunting-aleppo-chile.html\">aleppo</a> makes a good, if not more tart and spicy substitute.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Eggplant", "Lamb", "Mains", "Nuts"], "recipeIngredient": ["<strong>For lamb and walnut sauce</strong>", "3 tablespoons olive oil", "1 medium red onion, finely chopped", "3 long hot peppers (see note), finely chopped", "4 cloves garlic, minced", "2 tablespoons janissary spice (recipe to follow)", "3/4 teaspoon cumin seeds, divided", "1 1/2 cups chopped walnuts", "1 pound ground lamb", "1 28 ounce can of tomatoes", "1 tablespoon pomegranate molasses, or balsamic vinegar", "Fresh chopped mint, for garnish", "&nbsp;", "<strong>For baked eggplant</strong>", "2 medium Italian eggplant", "2 tablespoons olive oil", "&nbsp;", "<strong>For janissary spice</strong>", "6 tablespoons ground mara&#351; or aleppo chile (see note)", "3 tablespoons dried oregano", "2 to 4 teaspoons sumac, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For lamb and walnut sauce:</strong> Heat oil in a large saut&eacute; pan or Dutch oven on medium, then add onions, long hot peppers, and garlic. Cook, stirring frequently, until vegetables soften, about 5 minutes. Increase heat slightly and add janissary spice and 1/2 teaspoon cumin, stir to combine, and cook for 30 seconds. Add walnuts and cook for 1 to 2 minutes, or until they begin to toast and brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat slightly, add some more olive oil if pan looks dry, and add lamb. Lamb should brown but not sear. Season with a couple generous pinches of salt, and break up large clumps with a wooden spoon and cook until lamb is lightly browned. Add tomatoes, stir to combine, and bring to a boil. Reduce to a simmer and cook, covered, for 45 minutes, or until lamb is very tender. Before serving, check for seasoning and stir in pomegranate molasses and remaining 1/4 teaspoon of cumin seed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For baked eggplant:</strong> Heat oven to 375&deg;F. Cut eggplant in half lengthwise, leaving stems intact. Drizzle some olive oil on baking sheet. Season cut sides of eggplant with several pinches of salt, then place cut side down on baking sheet and spread oil to an even film. Season skin sides of eggplant and drizzle with more olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 30 minutes, or until skins are wrinkled and eggplant offers no resistance to a knife. Carefully flip eggplant over with tongs or a long, thin offset spatula, so cut sides point up. Broil until cut sides are well browned, just a couple minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, spread some lamb and walnut sauce on a serving platter. Arrange eggplant cut side up, then top with remaining sauce. Garnish with freshly chopped mint leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For janissary spice:</strong> Combine chile and oregano in an airtight bag or jar. If using whole chiles, remove seeds before grinding. Add sumac in small increments; spice mix should not taste sour or tart, but should have a slight piquancy. Sweeter chiles will require more sumac than spicier varieties. Store tightly sealed in a cool, dark place. Recipe makes about 1/2 cup; use within 3 months.</p>"}]}