{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/111912-230745-SeriousEats-Spinach-Cannelloni-Mascarpone-CreamB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cannelloni", "creme fraiche", "spinach", "Sunday Supper", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Spinach Cannelloni In Tomato And Crème Fraîche Sauces", "link": "https://www.seriouseats.com/recipes/2012/11/baked-spinach-cannelloni-in-tomato-sauce-and-mascarpone-recipe.html", "description": "Spinach and ricotta-stuffed pasta baked in tomato and creamy crème fraîche sauces is the stuff of dreams.", "totalTime": "1 1/2 hours", "recipeYield": "serves 6", "recipeCategory": ["Mains", "Pasta", "Spinach", "Sunday Supper", "Vegetarian"], "recipeIngredient": ["2 tablespoons olive oil, divided", "2 medium cloves garlic, minced (about 2 teaspoons)", "6 ounces fresh spinach leaves (about 2 quarts loosely packed leaves)", "1 small white onion, minced (about 3/4 cup)", "1 (28-ounce) can whole plum tomatoes, preferably San Marzano", "2 tablespoons chopped fresh basil", "1/2 cup dry red wine, such as Chianti", "Pinch of sugar", "Kosher salt and freshly ground black pepper", "2 cups ricotta cheese", "1 large egg, lightly beaten", "1/2 cup plus 2 tablespoons grated parmesan cheese, divided", "1 (8-ounce) package dry cannelloni", "1/2 cup mozzarella", "6 ounces crème fraîche", "1 1/2 tablespoons milk", "1/8 teaspoon grated nutmeg", "1 teaspoon fresh lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust two oven racks to lower-middle and upper positions and preheat oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil in a large skillet over medium heat until shimmering. Add garlic and cook, stirring, until it starts to soften, about 1 minute. Add spinach in stages until it all fits in the pan. Stir and sauté until wilted, about 5 minutes. Transfer spinach to a large bowl to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 1 tablespoon of olive oil in the same skillet over medium-high heat until shimmering. Add onion and cook, stirring frequently, until softened and translucent, about 7 minutes. Add tomatoes to pan, squeezing them through your fingers as you add them to crush. Add basil, wine, and sugar. Reduce heat to low and simmer while you cook and prepare the cannelloni. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add pasta and cook until just al dente, about 6 minutes. Drain and rinse with cold water to stop cooking process and prevent sticking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a 13- by 9- by 2-inch baking dish. Season tomato sauce to taste with salt and pepper, then spread 2/3 of the tomato sauce in the bottom of the baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze excess liquid from spinach. Finely chop spinach and return it to the bowl. Add ricotta, egg and 1/2 cup parmesan. Stir to combine, season to taste with salt and pepper, and place ricotta mixture in a pastry bag or a resealable sandwich bag with the corner snipped off. Squeeze the filling into the cannelloni. Placed filled pasta in baking dish with edges of each cannelloni touching. When all of the tubes have been filled, top with remaining tomato sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine crème fraîche, milk, nutmeg, remaining 2 tablespoons parmesan, and lemon zest in a medium bowl. Season with salt and pepper. Drizzle cannelloni with white sauce and sprinkle mozzarella on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven and bake until bubbly and lightly browned, about 30 minutes. During the last five minutes of cooking, switch broiler to high. Transfer pasta to the top rack and broil until golden brown, about 2 minutes. Remove from oven and cool slightly before serving.</p>"}]}