{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120531-20864-hummingbird-cake.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "cake recipes", "fruit desserts", "Southern desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hummingbird Cake", "link": "https://www.seriouseats.com/recipes/2012/06/southern-hummingbird-banana-pineapple-cake-recipe.html", "description": "Since appearing in <em>Southern Living </em>magazine in February 1978 as the recipe of a Mrs. L.H. Wiggins of Greensboro, North Carolina, Hummingbird Cake has become the magazine's most requested recipe of all time. While this beloved Southern classic is chock full o' goodies like bananas, pineapple, and pecans, it's not a fussy to prepare, making it a favorite for picnics and barbecues.", "totalTime": "1 hour and 30 minutes", "recipeYield": "serves 16", "recipeCategory": ["American Classics", "Cakes"], "recipeIngredient": ["<strong>For the Cake</strong>:", "3 cups (15 ounces) all-purpose flour ", "1 cup dark brown sugar ", "1/2 cup sugar", "2 teaspoons ground cinnamon ", "1 teaspoon baking soda ", "1 teaspoon salt ", "1/2 cup buttermilk, at room temperature", "1/2 cup vegetable oil", "3 large eggs, lightly beaten ", "2 teaspoons vanilla extract ", "2 cups mashed bananas ", "1 (8-ounce) can crushed pineapple, drained ", "1 cup pecans, coarsely chopped ", " ", "<strong>For the Cream Cheese Frosting</strong>:", "2 (8-ounce) packages of cream cheese, at room temperature", "8 tablespoons (1 stick) unsalted butter, at room temperature", "2 cups confectioner's sugar", "1 teaspoon vanilla extract", "1/2 cup pecan halves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to middle position and preheat oven to 350°F. Grease and flour three cake pans and set aside. In a large bowl whisk together flour, sugars, cinnamon, baking soda and salt to thoroughly combine and remove any lumps; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together buttermilk, vegetable oil, eggs and vanilla extract. Stir buttermilk mixture into dry mixture until thoroughly moistened. Stir in bananas, pineapple and chopped pecans until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter equally among 3 cake pans and bake until the surface of the cakes are dry and a cake tester inserted into center comes out clean, about 30-40 minutes. Cool cakes in the pan for 15 minutes then carefully release from the pan onto cooling racks to cool completely. Do not assemble cake until it has completely cooled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting</strong>: Add cream cheese and butter to bowl of stand mixer fitted with a paddle attachment and mix until thoroughly combined.  Add sugar and mix to incorporate, scraping down the sides as needed then mix in vanilla extract. Frost cake adding a thin layer of frosting between the layers to leave enough to cover the top and sides of the cake completely. Decorate top with whole pecans or chopped pecans. For best results, refrigerate for at least an hour to firm up the frosting before attempting to transport. Store covered in the refrigerator until serving.</p>"}]}