{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120123-188528-donutsoup2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "dessert soup", "restaurant desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Doughnut Soup", "link": "https://www.seriouseats.com/recipes/2012/01/doughnut-soup-recipe-moto-chicago.html", "description": "This creamy, dreamy dish is the ultimate in doughnut decadence. It starts by caramelizing glazed doughnut in a buttery bath, then mixing it with milk and heating the mixture until the flavors merge beautifully in a hot, sweet, very creamy broth. It's my easy-to-prepare take on a dessert served at Chicago's MOTO, a restaurant revered in the world of molecular gastronomy.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cakespy", "Desserts", "Doughnuts"], "recipeIngredient": ["2 tablespoons butter ", "2 glazed yeast doughnuts", "1 1/2 cups whole milk", "1/2 cup cream", "4 mini cake doughnuts or doughnut holes, for garnish", "Cinnamon, nutmeg, or espresso powder, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium frying pan, melt the butter over medium heat. When the butter is melted and bubbling lightly, add the two glazed doughnuts, cooking on each side until the glaze becomes caramelized. Transfer to paper towels to blot them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the fried doughnuts along with the milk and cream in a blender, and blend until the doughnuts are completely liquefied into the mixture. Note: You can do this with all milk if you want the broth a little lighter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the doughnut-milk mixture into a saucepan on medium heat, stirring occasionally until the mixture reaches a low simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the \"soup\" into small bowls and directly before serving, garnish with a mini donut and cinnamon, nutmeg, or even espresso powder.</p>"}]}