{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120925-223938-bar-bites-beer-steamed-mussels-with-bacon.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "beer", "mussel", "mussels", "quick", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beer-Steamed Mussels with Bacon", "link": "https://www.seriouseats.com/recipes/2012/10/beer-steamed-mussels-bacon-recipe.html", "description": "Aside from mussels, there are few other seafoods that so easily lend themselves to quick cooking, and even faster eating. After all, to manipulate a mound of mussels into a meal, a simple steam in broth or other flavorful liquid is all that is needed to pop the bivalves open.\r\n\r\nBut fast doesn't have to be bland. In fact, I find the Belgian method of steaming mussels with a white ale (or any beer really) to be of the utmost flavor&mdash;especially when the whole mess is embellished with crunchy bacon.", "totalTime": "30 minutes", "recipeYield": "serves 2 to 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "Bar Bites", "Clams, Mussels, and Oysters"], "recipeIngredient": ["4 strips of bacon, chopped", "1 large shallot, minced (about 1/2 cup)", "4 medium cloves of garlic, minced (about 4 teaspoons)", "3 sprigs fresh thyme", "3/4 cup Belgian-style ale, or witbier", "2 pounds fresh mussels, scrubbed clean and beards removed", "2 teaspoons Dijon mustard", "Salt and freshly ground black pepper", "1/4 cup chopped parsley leaves", "Crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bacon in a large stainless steel skillet set over medium heat and cook, stirring occasionally, until brown and crisp, 5 to 7 minutes. Using a slotted spoon, transfer the cooked bacon to a plate lined with paper towels. Set bacon aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shallots and garlic to the pan and cook, stirring frequently, until the shallots soften and the garlic just begins to brown, 3 to 5 minutes. Add the thyme to the pan and stir in the beer, making sure to scrape up any browned bits from the bottom of the pan. When the beer begins to bubble, reduce the heat to medium-low and add the cleaned mussels to the pan in a single layer. Place a lid on the pan and simmer for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 5 minutes, check the mussels. Using a pair of tongs, remove any mussels that have opened and transfer to a large bowl. Cover the pan again and simmer for another 5 minutes, transferring any opened mussels to the large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all of the mussels are opened and transferred to the bowl, whisk the Dijon mustard into the sauce in the pan. Taste the sauce and season with salt and black pepper. Keep in mind that the bacon, as well as the liquor given up by the mussels, are both salty, so not much additional salt may be needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the finished sauce over the mussels, then sprinkle on the reserved bacon, as well as the chopped parsley. Serve the mussels with crusty bread and cold beer.</p>"}]}