{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120327-199166-shiitake-with-walnut-puree-pizza-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["breads", "Cook the Book", "Jim Lahey", "mushrooms", "My Pizza", "pizza", "recipe newsletter", "vegetarian", "walnut"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Shiitake with Walnut Purée Pizza", "link": "https://www.seriouseats.com/recipes/2012/03/shiitake-with-walnut-puree-pizza-recipe.html", "description": "Instead of relying on cheese for richness, Lahey has created a purée of long cooked, sweet onions and walnuts. It's bitter and sweet, deeply creamy, and bakes up beautifully under handfuls of sliced shiitakes and rosemary. The pizza is topped off with a drizzle of olive oil, which is more than enough for this pie, but if you must, a sprinkling of Parmesan wouldn't hurt.", "totalTime": "1 hour 30 minutes", "recipeYield": "makes one 10- to 12-inch pizza", "recipeCategory": ["Bread", "Dairy-Free", "Mushrooms", "Nuts", "Pizza", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>Walnut Purée</strong>", "100 grams (about 1 cup) Spanish or white onion, sliced 1 centimeter (1/2 inch) thick ", "50 grams (1 1/3 cups) walnuts", "50 grams (scant 1/4 cup) water, plus more as needed", "&nbsp;", "<strong>Pizza</strong>", "1 ball of <a href=\"http://www.seriouseats.com/recipes/2012/03/jim-laheys-no-knead-pizza-dough-recipe.html\">No-Knead Pizza Dough</a>, shaped and waiting on a floured peel", "100 grams (scant 1/2 cup) Walnut Purée", "90 grams (about 9 medium) shiitake mushroom caps, thinly sliced ", "10 fresh rosemary leaves", "Generous pinch of freshly ground black pepper", "4 grams (1/2 teaspoon) fine sea salt", "Extra-virgin olive oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Walnut Purée:</strong> Separate the onion slices into strips with your fingers and place them in a saucepan. Cover and cook over very low heat, stirring every 15 minutes or so, for 45 minutes to 1 hour, until very soft. Uncover and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the onion, walnuts, and water in a blender or food processor and pulse until you have an almost smooth purée, something like the texture of oatmeal. There should still be a touch of the walnut bits remaining but the purée should be easily spreadable. If it is not, add a little water and continue blending until it is.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Pizza:</strong> Place the pizza stone in a gas oven on a rack about 8 inches from the broiler. Preheat the oven on bake at 500°F for 30 minutes. Switch to broil for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the walnut purée over the dough and spread it evenly, leaving about an inch of the rim untouched. Distribute the mushroom slices over the purée, all the way out to the edge. Sprinkle with the rosemary, pepper, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With quick, jerking motions, slide the pie onto the stone. Broil for 3 1/2 minutes under gas (somewhat longer with an electric oven), until the crust is nicely charred. The mushrooms should be dark and thoroughly cooked but not burnt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the peel, transfer the pizza to a tray or serving platter, drizzle it with oil, slice into wedges, and serve.</p>"}]}