{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121017-226668-peanut-butter-cup-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "chocolate desserts", "peanut butter", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "5"}, "name": "Peanut Butter Cup Pie", "link": "https://www.seriouseats.com/recipes/2012/10/halloween-peanut-butter-cup-pie-recipe.html", "description": "This pie is every peanut butter and chocolate lover's dream. A crumbly, chocolate cookie crust cradles smooth and dense peanut butter filling, which is covered with a generous layer of dark chocolate ganache. It's an adult version of the candy classic, and big enough to treat lots of friends.", "totalTime": "3 hours", "recipeYield": "serves 8 or more", "recipeCategory": ["Chocolate", "Halloween", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["9 ounces chocolate wafer cookies", "3 tablespoons butter, melted and cooled", "10 ounces heavy cream, divided", "8 ounces cream cheese, room temperature", "4 ounces confectioner's sugar", "1/2 teaspoon salt", "12 ounces creamy peanut butter (do not use \"natural\" peanut butter that requires mixing before use)", "5 ounces dark chocolate (58 - 66% works best), chopped into fine pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate wafers in the bowl of a food processor and pulse until the cookies are pulverized into uniform crumbs. Add the melted butter and pulse for 15 seconds, scrape down the sides of the bowl, and pulse for an additional 5 seconds, until the crumbs are evenly coated with butter. Pour the mixture into the pie plate and press the crumbs to form an even crust along the bottom and sides of the plate. Chill for at least 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip half of heavy cream to soft peaks and reserve in the refrigerator. In the bowl of a stand mixer fitted with a whisk attachment, add the cream cheese, confectioner's sugar, and salt and whisk until smooth (you will need to scrape down the sides of the bowl a number of times to get out the lumps). Add the peanut butter and whisk until the mixture is completely combined and smooth (it will be very thick). Add 5 ounces of the whipped cream and whisk to completely combine (it will still be thick, just slightly less so). Pour the mixture into the prepared pie crust and smooth the top flat with an offset spatula. Chill for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate in a small heatproof bowl and set aside. In a small saucepan, bring the remaining 5 ounces of cream to a simmer, stirring occasionally. Pour the hot cream over the chocolate and allow it to sit for 2 minutes, then stir the mixture until the chocolate is smooth and shiny. Pour the chocolate over the top of the peanut butter filling and smooth with an offset spatula. Chill until the ganache has set, at least 10 minutes.The pie will keep in the fridge for one day.</p>"}]}