{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120217-192812-knead-the-book-italian-baker-pane-di-como.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "knead the book", "The Italian Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Italian Baker's Pane di Como", "link": "https://www.seriouseats.com/recipes/2012/02/the-italian-bakers-pane-di-como-bread-recipe.html", "description": "This bread from <em>The Italian Baker</em> uses what it calls a \"starter\" but it's not a sourdough starter. It's a pre-ferment using commercial yeast. The long pre-ferment adds a lot of flavor and the method of rising in a basket adds texture to the surface of the bread.", "totalTime": "4 hours 30 minutes (plus 4-10 hours for starter)", "recipeYield": "Makes 2 loaves", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["Starter", "1 teaspoon (0.1 oz / 3 g) active dry yeast ", "1 scant teaspoon (0.2 oz / 6 g) malt syrup or powder", "1/3 cup (2.8 oz / 80 g) warm water ", "2/3 cup (5.7 oz / 163 g) milk, at room temperature", "1 cup minus 1 tablespoon (4.7 oz / 135 g) unbleached all-purpose flour", "Dough", "2 cups (16.8 oz / 480 g) water, at room temperature", "About 6 1/4 cups (1 lb 14 oz / 860 g) unbleached all-purpose flour", "1 tablespoon (0.5 oz / 15 g) salt", "Cornmeal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Starter:</strong> Stir the yeast and malt, if you are using the syrup, into the water; let stand until foamy, about 10 minutes. Stir in the milk and beat in the flour and malt powder, if you are using it, with a rubber spatula or wooden spoon, about 100 strokes or until smooth. Cover with plastic wrap and let stand until bubbly, at least 4 hours but preferably overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By Hand:</strong> Add the water to the starter; mix and squeeze it between your fingers until the starter is fairly well broken up. Mix the flour and salt together and add it, 2 cups at a time, into the starter mixer, stirring after each addition. When the dough is too stiff to mix with a wooden spoon, just plunge in with your hands. Mix until well blended, 4 to 5 minutes. Knead on a well-floured surface until elastic but still moist and tacky. Once it has come together nicely, slap it down vigorously on the work surface to develop the gluten.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By Mixer:</strong> Mix the starter and the water with the paddle until the starter is well broken up. Add the flour and salt and mix for 2 to 3 minutes at low speed. The dough will be smooth but won’t pull away from the sides of the bowl. Change to the dough hook and knead at medium speed, scraping down the sides of the bowl as necessary, until the dough is elastic but still slightly sticky, 3 to 4 minutes. Finish kneading \u2028by hand on a floured work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By Processor:</strong> Refrigerate the starter until cold. Unless you have a large processor, make the dough in two batches. Place the flour and salt in a food processor fitted with the dough blade and process with several pulses to sift. Place the starter on top of the flour mixture. With the machine running, pour the 2 cups of cold water through the feed tube and process until the dough comes together and gathers in a small ball. Process 30 to 45 seconds longer to knead. Finish kneading on a well-floured surface with well-floured hands. The dough will be sticky and moist.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First Rise:</strong> Place the dough in a well-oiled bowl, cover tightly with plastic wrap, and let rise until doubled, about 1 1/2 hours. The dough is ready when it is very bubbly and blistered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shaping and Second Rise: </strong>Cut the dough in half on a floured surface and shape it into two round loaves. Place in oiled and floured 8-inch round bannetons or in baskets lined with generously floured kitchen towels. Cover with towels and let rise until fully doubled and risen to the tops of the bannetons, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Thirty minutes before baking, preheat the oven with a baking stone in it to 400ºF. Just before baking, sprinkle the stone with cornmeal. Very carefully invert the loaves onto the stone and bake until the loaf sounds hollow when the bottom \u2028is tapped, about 1 hour. Cool on racks.</p>"}]}