{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121029-227035-nofunsize.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mega Fun-Size Bar", "link": "https://www.seriouseats.com/recipes/2012/10/mega-fun-size-chocolate-bar-recipe.html", "description": "I had the most incredible idea to make the tiny bars more fun: I'd melt together about 100 of the mini bars to form a monstrous Mega Fun-Size Bar! Now <em>that </em>sounds like fun.", "totalTime": "1 hour, 15 minutes", "recipeYield": "Makes 1 Mega Fun-Size Bar", "recipeCategory": ["Cakespy", "Candy", "Halloween"], "recipeIngredient": ["4 bags (approximately 12 ounces each) Fun-Size candy bars; about 80-90 bars", "2 cups (about 12 ounces) milk chocolate or semisweet morsels "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300&deg;F. Line a 9- by 13-inch pan with aluminum foil. Unwrap all of your fun-size candy bars. This may take a while.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of the pan with your unwrapped candy bars. To keep things interesting, alternate the styles so that the different flavors are mixed up, forming a sweet sort of chocolate patchwork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once you have lined the bottom of the pan with candy bars, make a second row, aligning the candy bars perpendicular to the ones below. This will help things melt fairly evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pan in the oven until things start to get shiny and melty, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and scatter the chocolate morsels evenly on top of the candy bars. Return the pan back to the oven until the morsels have begun to melt, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and place it on a towel or heatproof surface. Very gently, so as not to burn yourself on the sides of the pan, use a butter knife or spatula to evenly smooth and spread the chocolate. You'll want to do this gently but fairly quickly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, garnish with sprinkles. Let cool completely before serving (otherwise it will be very messy). Enjoy!</p>"}]}