{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121205-232087-cook-the-book-grilled-brassica-dandelion-green-vinaigrette.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Adam Roberts", "broccoli", "cauliflower", "Cook the Book", "dandelion greens", "Daniel Patterson", "Secrets of the Best Chefs", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Daniel Patterson's Grilled Brassica with Dandelion-Green Vinaigrette", "link": "https://www.seriouseats.com/recipes/2012/12/daniel-pattersons-grilled-brassica-with-dande.html", "description": "Broccoli and cauliflower are staple vegetables in my kitchen, so I assumed I'd eaten these brassica in just about every way possible. But <strong><a href=\"http://en.wikipedia.org/wiki/Daniel_Patterson_%28chef%29\">Daniel Patterson's</a></strong> recipe for <strong>Grilled Brassica with Dandelion-Green Vinaigrette</strong> in <strong><a href=\"http://www.amateurgourmet.com/about\">Adam Roberts'</a></strong> <em><a href=\"http://www.amazon.com/Secrets-Best-Chefs-Techniques-Americas/dp/1579654398/?tag=serieats-20\">Secrets of the Best Chefs</a></em> proved me wrong. Patterson grills an assortment of brassica--including vibrant romanesco and leafy rape and cicco--until well-charred and tender. He plates the vegetables with plump bulgar wheat, a squeeze of lemon, and (best of all) a verdant, bitter dandelion vinaigrette.", "totalTime": "45 minutes", "recipeYield": "serves 2", "recipeCategory": ["Broccoli", "Cauliflower", "Cook the Book", "Sides", "Vegetarian"], "recipeIngredient": ["1/2 cup dandelion greens, blanched  quickly in salted water, shocked in  ice water, squeezed dry in a towel,  and very finely chopped", "1 shallot, minced", "1 teaspoon champagne vinegar, plus more to taste", "2 lemons", "1 caperberry, chopped", "1/4 cup olive oil, plus more as necessary", "Kosher salt", "Crushed red pepper flakes ", "About 2 cups of florets from different members of the Brassica family, such as broccoli, cauliflower, romanesco broccoli, broccoli di rape, and broccoli di cicco", "1/2 cup cooked bulgur wheat ", "1/4 cup almonds, toasted and chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the dandelion greens, shallot, champagne vinegar, the juice of 1 lemon, the caperberry, the olive oil, a pinch of salt, and a pinch of red pepper flakes. Adjust for seasoning and consistency (it should look like a chunky pesto).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a grill or a cast-iron pan on medium-high heat, add a splash of olive oil, and then add all of the Brassica with a pinch of salt. Spread out the vegetables and don’t move them until they start to color, at least 1 minute. Allow them to brown on all sides, a few minutes more, until thoroughly cooked (a knife should go through them easily), 7 to 8 minutes total. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir the bulgur together with some of the dandelion dressing. Spoon the bulgur onto plates and top with more dressing. Squeeze the second lemon all over the hot Brassica and then spoon the vegetables on top of the bulgur. Drizzle with more dressing, sprinkle with the almonds, and serve immediately.</p>"}]}