{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120327-the-nasty-bits-tripe-chili-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["chili", "soup", "The Nasty Bits", "tripe", "tripe chili"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tripe Chili", "link": "https://www.seriouseats.com/recipes/2012/03/tripe-chili-recipe.html", "description": "[Photograph: Chichi Wang] Adapted from The Best Chili Ever by J. Kenji Alt-Lopez. About the author: Chichi Wang took her degree in philosophy, but decided that writing about food would be much more fun than writing about Plato. She firmly...", "totalTime": "2 1/2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Beef", "Chili", "Mains", "Offal", "The Nasty Bits"], "recipeIngredient": ["2 1/2 pounds honeycomb or rumen tripe, or a combination thereof", "1/2 cup distilled white vinegar", " ", "<strong>For the Chilis:</strong>", "3 whole Ancho, Pasilla, or 2 whole New Mexico red, California, Costeño, or Choricero chiles, seeded, and torn into rough 1-inch pieces (about 1/8 ounce)", "1 whole Cascabel, Arbol, or Pequin chile, seeded, and torn in half", "1 quart meat broth (chicken, pork, or beef)", "2 whole anchovy filets ", "2 teaspoons soy sauce", "2 teaspoons Worcestershire sauce", "1 1/2 tablespoons whole cumin seeds, toasted, then ground ", "1 1/2 teaspoons whole coriander seeds, toasted, then ground ", "2 whole cloves, toasted and ground ", " ", "<strong>To Assemble:</strong>", "1/4 cup vegetable oil", "1 large yellow onion, diced fine (about 1 1/2 cups) ", "3 fresh Thai bird chiles or 1 jalapeño, finely chopped ", "4 small cloves garlic, minced (about 1 tablespoon) ", "1 tablespoon dried oregano leaves ", "1 (28 ounce) can crushed tomatoes ", "2 (28-ounce) cans beans (pinto, kidney, white beans, or a combination)", "2 bay leaves ", "2 tablespoons cider vinegar, plus more to taste ", "2 tablespoons vodka or bourbon ", "1 tablespoon dark brown sugar", " ", "<strong>Garnishes (all suggestions optional): </strong>", "Scallions, sliced fine ", "Cheddar, Jack, or Colby cheese, grated ", "Sour cream ", "Jalapeño or poblano peppers, diced and seeded ", "Onion, diced ", "Avocado, diced ", "Saltines or Fritos"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, combine the tripe and vinegar. Add enough water to cover the tripe by 2 inches. Bring to a boil, then reduce to a simmer and cook until the tripe is tender, about 1 1/2 hours, adding more water as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tripe with a slotted spoon and allow to cool. Slice the tripe into 1-inch strips and set aside. Tripe may be par-cooked in such a way several days beforehand and refrigerated until ready to use.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 1 cup of broth to a boil over high heat in a medium saucepan. Reduce to a simmer and add toasted chiles and cook until chiles have softened and liquid is reduced by half, 5 to 8 minutes. Transfer chiles and liquid to blender, add anchovy, soy sauce, Worcestershire, cumin, coriander, and cloves, and blend at high speed, scraping down sides as necessary, until completely smooth puree is formed, about 2 minutes. Set chile pur&eacute;e aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in large Dutch oven or heavy-bottomed stock pot over medium heat until shimmering. Add onions and cook, stirring frequently, until softened but not browned, 6 to 8 minutes. Add fresh chiles, garlic, and oregano and cook, stirring frequently, until fragrant, about 1 minute. Add chile pur&eacute;e and cook, stirring frequently and scraping bottom of pot until chile mixture begins to fry and leaves a coating on bottom of pan, 2 to 4 minutes. Add remaining meat stock, sliced tripe, crushed tomatoes, beans along with their liquid, and bay leaves. Bring to a simmer.  Reduce heat to lowest possible setting, and cook, with cover slightly ajar, for about 1 1/2 hours, adding water if necessary to keep beans and tripe mostly submerged (a little protrusion is ok).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vodka (or bourbon) and brown sugar, and stir to combine. Season to taste with kosher salt, ground black pepper, and additional vinegar.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, or for best flavor, allow to cool and refrigerate overnight, or up to 1 week in sealed container. Reheat, and serve with desired garnishes.</p>"}]}