{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120827-127677-Grilled-Chili-Cheese-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cheese", "cheese sandwiches", "grilled cheese sandwiches", "peppers", "pimento cheese", "sandwich", "sandwiched", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Chili-Cheese Spread Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/08/grilled-chili-cheese-sandwiches-recipe.html", "description": "If you love pimento cheese, try this spiced up jalapeño and poblano pepper version.", "totalTime": "30 minutes", "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Cheese", "Sandwiches", "Vegetarian"], "recipeIngredient": ["1 tablespoon vegetable oil", "2 jalapeño peppers, split in half, stems, seeds, and ribs removed", "2 poblano peppers, split in half, stems, seeds, and ribs removed", "6 tablespoons mayonnaise", "2 tablespoons finely grated yellow or white onion", "2 medium cloves garlic, minced (about 2 teaspoons)", "2 teaspoons dry mustard", "1/2 teaspoon ground cumin", "2 cups (8 ounces) grated extra-sharp white cheddar cheese", "4 ounces cream cheese, softened", "1/3  cup drained jarred or canned piquillo peppers, finely chopped ", "2 teaspoons Worcestershire sauce", "Kosher salt and freshly ground black pepper", "8 (1/2-inch thick) slices country-style bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in large skillet over medium-high heat until shimmering. Add chilies and cook, covered and turning once halfway through cooking, reducing heat if threatening to burn, until spotty black and softened, about 10 minutes. Transfer to cutting board. When cool enough to handle, finely chop chilies and place in large bowl. Wipe out skillet with paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons mayonnaise in now empty skillet over medium heat. Add onion and cook, stirring, until onion is softened, about 2 minutes. Add garlic, dry mustard, and cumin and cook until fragrant, about 30 seconds. Transfer to bowl with chilies and let cool to room temperature, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir cheddar, cream cheese, piquillo peppers, Worcestershire, and additional 2 tablespoons mayonnaise into chili mixture. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush one side of each slice of bread with remaining 2 tablespoons mayonnaise, then flip. Spread a heaping 1/4 cup chili cheese on 4 slices bread and cover with remaining 4 slices, mayonnaise-spread sides facing up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat now empty skillet over medium heat. Cook sandwiches (in batches if necessary) until golden and beginning to ooze cheese, 2 to 3 minutes per side. Transfer sandwiches to cooling rack and allow to rest 2 minutes before cutting. Cut in half and serve.</p>"}]}