{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120824-gluten-free-sugar-free-baking-vanilla-cream-pie.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cream pie", "gluten free", "sugar-free", "the joy of gluten free sugar free baking", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Vanilla Cream Pie", "link": "https://www.seriouseats.com/recipes/2012/08/the-joy-of-gluten-free-sugar-free-baking-vanilla-cream-pie-recipe.html", "description": "This gluten-free, sugar-free pie has all the creamy vanilla flavor of the classic version.", "totalTime": "3 hours", "recipeYield": "makes one 9-inch pie", "recipeCategory": ["Bake the Book", "Desserts", "Gluten-Free", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Almond-Pecan Crust</strong>", "1 cup (113g) almond flour", "1 cup (113g) pecan flour", "1/4 cup Splenda/Stevia Extract in the Raw", "1/2 teaspoon baking powder", "1/2 cup (57g) salted butter or margarine, melted", "3 tablespoons unsweetened soy milk or other milk", "&nbsp;", "<strong>For the Vanilla Cream</strong>", "2 cups (454g) unsweetened soy milk or other milk", "1/2 cup Splenda or Stevia Extract in the Raw, or 1/4 cup New Roots Stevia Sugar", "3 eggs", "1/4 cup (28g) almond flour", "1/4 cup (57g) salted butter or margarine", "1 tablespoon vanilla extract", "1/4 teaspoon liquid stevia", "1 1/2 packets or 3 1/4 teaspoons unflavored powdered gelatin, or 3 1/4 teaspoons agar powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Preheat the oven to 325F. Lightly mist a 9- or 10-inch pie pan with spray oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the almond flour, pecan flour, sweetener, and baking powder and whisk until well mixed. Add the butter, milk and vanilla and stir with a large spoon for 1 to 2 minutes. The dough will be stiff and playdough-like. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the dough in the prepared pan and lightly mist the top of the dough with spray oil. Spread the dough with your fingers, pressing it in an even layer to line the pan. Prick the bottom and sides with a fork to help prevent bubbles and air pockets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the edges with aluminum foil, then bake for 10 minutes. Rotate the pan and bake for 7 minutes, then remove the foil and bake an additional 3 to 5 minutes, until the dough is firm to the touch and just starting to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Have the piecrust ready. In a heavy sauce pan, combine the milk and half of the Splenda and cook over medium-high heat until almost simmering.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the eggs, the remaining Splenda, and the almond flour and whisk until thoroughly blended. Ladle about one-fourth of the hot milk mixture into the egg mixture and whisk to combine. Then, ladle in another one-fourth of the hot milk and whisk to combine; this will gradually heat the eggs without curdling them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the heat to medium, pour in the egg mixture, and whisk until thoroughly blended. Switch to a wooden spoon and cook, stirring slowly and constantly to prevent burning and keep the eggs from curdling. As soon as the mixture is nearly simmering, with steady but gentle bubbling throughout, remove from the heat. The mixture will thicken slightly, but not as much as a traditional pastry cream; it will be more like gravy. Add the butter, vanilla, and liquid stevia and whisk gently until the butter melts and disappears into the mixture. If the mixture seems grainy or lumpy, whisk until smooth. If it curdles, don’t worry, just whisk out the lumps as best you can.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the mixture cool until you can touch the outside of the pot for more than 5 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle in the gelatin and whisk to distribute it evenly. It won’t dissolve completely at first, but as the custard cools the gelatin will soften and begin to firm up the custard. Place a piece of plastic wrap tightly over the top of the saucepan to prevent the custard from forming a skin. After about 30 minutes, when the custard is just slightly warm to the touch, put it in the refrigerator until completely cooled. Remove it from the refrigerator and whisk or use an electric hand mixer to whip the filling until it becomes fluffy, about 1 to 2 minutes. Pour it into the prebaked pie shell, spreading it in an even layer. Mist the surface with spray oil, then cover with plastic wrap and refrigerate until thoroughly chilled, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation: Coconut Cream Pie</strong> Lightly toast 3/4 cup (2.25 oz / 64 g) of unsweetened shredded dried coconut (see Tip, page 150). Reserve 2 tablespoons of the coconut and whisk the rest into the custard after it cools; in addition to providing texture, flavor, and fiber, this will fluff up the custard nicely. Proceed as directed in the recipe. After you garnish the pie with whipped cream, sprinkle the reserved coconut evenly over the top.</p>"}]}