{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/227315-20121030-british-bites-soda-bread-port-soaked%20raisins.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["baking", "bread", "british bites", "raisins", "soda bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Soda Bread with Port-Soaked Raisins", "link": "https://www.seriouseats.com/recipes/2012/11/soda-bread-port-soaked-raising-recipe.html", "description": "If you're looking for a quick bread to go with your afternoon tea, or your morning fry up, look no further than the humble soda bread. Raisins or currants are an expected addition, but soaking the raisins in port before adding them to the dry ingredients gives them an extra boozy sweetness that really livens up this simple bread.", "totalTime": "40 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Breakfast and Brunch", "British Bites"], "recipeIngredient": ["1/2 cup ruby port ", "1/2 cup raisins ", "4 cups (about 20 ounces) all-purpose flour ", "2 tablespoons sugar ", "1 teaspoon salt ", "1 teaspoon baking soda ", "6 tablespoons (3/4 stick) cold butter, cut into small cubes, divided ", "1 egg ", "1 1/2 cups (12 ounces) buttermilk "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 400°F.  Place port and raisins in a microwavable dish and microwave on high for 1 minute; remove from microwave and mix, then microwave until steaming hot, about 1 minute longer.  Remove from microwave and let rest on the counter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl whisk together flour, sugar, salt, and baking soda. Using your fingers, mix 5 tablespoons of butter into flour mixture until mixture resembles a coarse meal. In a medium bowl, whisk egg and buttermilk together until homogenous. Make a well in the center of the flour mixture and add buttermilk mixture. Drain raisins and add to well. Using a wooden spoon, mix until a wet dough forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out dough onto a floured surface and knead for two minutes. Form dough into a 10-inch round. Grease a baking sheet using remaining butter. Place round on the baking sheet and dust with flour, then using a sharp knife or serrated bread knife, make an ‘X’ over the top of the loaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until soda bread is brown and cooked through, about 25 minutes. Allow to rest at least 5 minutes before slicing and serving.</p>"}]}