{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120604-squash-soup-primary.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["light eating", "soup", "squash", "summer squash", "vegetable", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Chilled Summer Squash Soup With Yogurt, Mint, and Sourdough Croutons", "link": "https://www.seriouseats.com/recipes/2012/06/vegetarian-chilled-summer-squash-soup-recipe.html", "description": "Summer squash is the season's most bounteous crop. Take advantage of its abundance with this simple but flavorful chilled soup: yogurt adds smoothness and acidity, fresh mint contributes both flavor and a lovely light green color, and sourdough croutons lend an irresistible crunch.", "totalTime": "2 hours (for chilling soup)", "recipeYield": "makes 2 quarts, serving 4 to 6", "recipeCategory": ["Soups and Stews", "Squash", "Vegetarian", "Zucchini"], "recipeIngredient": ["<strong>For the Soup</strong>:", "3 tablespoons butter (see note)", "1 medium bunch green onions, white and green parts, chopped", "3 medium garlic cloves, chopped (about 1 tablespoon)", "Kosher salt and freshly ground black pepper", "3 pounds mixed summer squash (green or yellow zucchini, crookneck, pattypan), chopped into medium pieces", "About 3 cups water", "1 cup plain yogurt, low fat or full fat", "1/4 cup chopped fresh mint leaves plus additional, for serving", "&nbsp;", "<strong>For the Croutons</strong>", "Half a medium loaf of sourdough bread, cut into a 1/2\" dice (about 3 cups bread cubes)", "1 tablespoon extra virgin olive oil", "Kosher salt and freshly ground black pepper", "1/2 teaspoon dried herbs, such as herbes de provence (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375&deg;F (see note). Heat butter in a large heavy-bottomed saucepan or Dutch oven over medium heat until melted. Add green onions and garlic and season to taste with salt and pepper. Cook, stirring occasionally, until onions and garlic begin to sweat but do not brown, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add summer squash and season to taste with additional salt and pepper. Cook, stirring occasionally, until squash begins to sweat but does not brown, about 7-10 minutes. Add enough water so that squash is almost, but not fully, covered, about 3 cups. Cover saucepan partially and lower heat to medium-low. Simmer until squash is just tender, about 12 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While soup is simmering, prepare the croutons. In a large bowl, toss cubed bread with olive oil, salt and pepper to taste, and dried herbs, if using. Turn out onto a rimmed baking sheet and bake, stirring occasionally, until well-browned and crisp, 10 to 12 minutes. Remove from oven and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a hand blender to blend soup until mostly smooth. Alternatively, blend soup in a blender in two batches. Add yogurt and mint and blend until totally smooth (again, working in batches if using standard blender), about 1 minute. Strain soup through fine mesh strainer if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let soup cool at room temperature for one hour, stirring occasionally. Transfer to refrigerator and let cool, stirring occasionally, until well chilled, about 45 minutes. Check soup for seasoning, adding more salt, pepper, yogurt or mint to taste. Serve in bowls, garnished with additional chopped mint and a handful of croutons.</p>"}]}