{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120727-wake-and-bake-phyllo-fig-breakfast-stacks.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["breakfast sweets", "figs", "honey", "phyllo", "quick", "wake and bake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fig Phyllo Breakfast Stacks", "link": "https://www.seriouseats.com/recipes/2012/07/fig-phyllo-honey-breakfast-stacks-recipe.html", "description": "These breakfast stacks are inspired by the classic Greek combination of figs, yogurt, and honey, and they're a great choice for summer brunch.", "totalTime": "30 minutes", "recipeYield": "serves 6", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Wake and Bake"], "recipeIngredient": ["Twelve 9- by 13-inch sheets phyllo dough", "1 stick (8 tablespoons) unsalted butter, melted", "3 teaspoons sugar", "6 tablespoons sliced almonds", "24 ounces Greek yogurt", "12 large misson figs (or 18 medium), stemmed and sliced", "6 teaspoons honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to middle and lower positions and preheat oven to 400&deg;F. Lightly grease 2 baking sheets with butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On the first baking sheet, lay down one piece phyllo dough. Brush dough all over with butter and top with another sheet of phyllo. Brush this sheet all over with butter and sprinkle with 1/2 teaspoon sugar and 1 tablespoon sliced almonds. Cover with a sheet of phyllo, brush with butter. Add a sheet of phyllo, brush with butter, sprinkle with 1/2 teaspoon sugar and 1 tablespoon of almonds. Top with another piece of phyllo, brush all over with butter. Top with a final sheet of phyllo, brush it with butter, and sprinkle with 1/2 teaspoon sugar and 1 tablespoon sliced almonds. Stack should be 6 sheets deep, with every other layer sprinkled with sugar and almonds. Repeat this process on second baking sheet. Bake phyllo until golden, about 6 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let phyllo stacks cool. Cut each stack into 6 squares. Place one stack on each of six plates. Spread each stack with 4 ounces of yogurt. Divide figs among stacks. Top each plate with another stack of phyllo. Drizzle each stack with 1 teaspoon of honey. Serve immediately. </p>"}]}