{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120409-195206-creme-brulee-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["Crème Brûlée", "custard", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crème Brûlée Pie", "link": "https://www.seriouseats.com/recipes/2012/04/creme-brulee-pie-recipe.html", "description": "Creamy, rich crème brûlée makes an outstanding pie filling.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "1 egg", "7 egg yolks", "5 ounces (About 3/4 cup) granulated sugar, plus 1/2 ounce for sprinkling", "1 vanilla bean, cut in half with the seeds scraped from the inside", "5 ounces heavy cream", "5 ounces milk", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a light golden brown, about 10 minutes more. Remove pie shell from oven and allow to cool completely. Turn down the oven to 300&deg;F</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk together eggs and yolks for about 30 seconds. Combine the sugar and the seeds scraped from inside the vanilla bean and rub the sugar into the vanilla, which will help break up clumps. Continue whisking the egg mixture as you slowly stream the sugar mixture into the eggs. Whisk without stopping as you add the sugar, then whisk for an additional minute once all of the sugar has been added, until the eggs are a very light shade of yellow. Whisk in the cream, milk and salt until they are completely blended. Pour the custard through a fine strainer, then pour into the cooled pie shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the filling is set but still jiggles, about 45 minutes. Remove the pie from the oven and allow it to cool to room temperature, then put it in the fridge for at least 2 hours to chill and set. When you are ready to serve, sprinkle remaining 1/2 ounce of sugar over the surface of the pie and tilt the pie around for an even coat of sugar. Use the edge of a metal bench scraper or a ring mold that fits inside the pie crust as a shield to protect the crust as you bring a lit culinary torch just close enough to the surface of the pie that the sugar begins to melt and caramelize. Move the torch around the pie to prevent scorching the custard, the goal is to melt and caramelize the sugar without burning the custard beneath. Allow the pie to sit for a few minutes, then gently crack the caramel surface with a spoon all over. Slice and serve immediately.</p>"}]}