{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/071112-214322-Sunday-Supper-Chicken-EscabecheB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Mexican", "keywords": ["carrot", "chicken", "jalapenos", "Mexican", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken En Escabeche With Purple Mashed Potatoes", "link": "https://www.seriouseats.com/recipes/2012/07/chicken-en-escabeche-with-purple-mashed-potatoes-recipe.html", "description": "Tangy, spicy chicken with caramelized onions, pickled jalapenos and carrots sees a shock of color when accompanied by creamy, purple mashed potatoes.", "totalTime": "About 1 hour", "recipeYield": "serves 6", "recipeCategory": ["Chicken", "Mains", "Mexican", "Sunday Supper"], "recipeIngredient": ["<strong>For the Chicken:</strong>", "1 teaspoon freshly ground black pepper", "1/2 teaspoon ground allspice", "2 teaspoons dried Mexican oregano", "Kosher salt", "2 tablespoons olive oil", "6 skin-on, bone-in chicken thighs", "3 large carrots, peeled and sliced on the bias at 1/4\" intervals (about 4 cups)", "1 1/2 large white onions, slivered (about 2 cups)", "4 medium cloves garlic, peeled and sliced", "1/4 cup dry white wine ", "1/4 cup apple cider vinegar", " 3/4 cup chicken broth", "6 canned, whole, pickled jalapenos, stemmed and chopped, divided use", "&nbsp", "<strong>For the Potatoes:</strong>", "1 1/2 pounds small, skin-on purple potatoes", "3 tablespoons butter", "1/2 cup sour cream", "1/3 cup whole milk", "2 ounces cream cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. Combine black pepper, allspice, oregano, and 1 teaspoon of salt in a small bowl. Season chicken liberally on all sides, using about half of the spice mixture and reserving the rest for later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil over medium-high heat in an oven-safe Dutch oven until shimmering. Place chicken in pan, skin-side down. Cook without moving until golden brown, about 8 minutes. Turn with spatulas and brown second side, about 4 minutes longer. Remove chicken from pan transfer to large plate. Add carrots and onions to the pan, scraping the bottom to dislodge browned bits. Cook, stirring occasionally, until lightly softened, about 7 minutes. Reduce heat to medium. Add garlic and cook, stirring constantly, until softened, about 2 minutes longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and scrape bottom of pan to dislodge any more browned bits. Bring to a boil, reduce to a simmer, and add cider vinegar, chicken broth and four jalapenos. Stir in remaining spice mixture. Return chicken to the pan, nestling thighs skin-side up in vegetables. Transfer to oven and cook uncovered until chicken is cooked through and liquid is mostly reduced, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken is cooking, cover potatoes in a large saucepan with cold water. Season generously with salt. Bring to a boil over high heat. Reduce to a simmer and cook until fork tender, about 15 minutes after boil has been reached. Drain potatoes and return to pan. Add remaining two jalapenos, butter, sour cream, whole milk, and cream cheese. Mash with a potato masher or whip with a handheld mixer. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve chicken, vegetables and mashed potatoes family-style, or plate individually.</p>"}]}