{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/201211014-230103-dinner-tonight-thanksgiving-salad-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "couscous", "cranberries", "Dinner Tonight", "salad", "sweet potatoes", "thanksgiving", "thanksgiving leftovers", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thanksgiving Leftovers Salad with Sweet Potatoes and Brussels Sprouts", "link": "https://www.seriouseats.com/recipes/2012/11/thanksgiving-salad-sweet-potatoes-brussels-sprouts-recipe.html", "description": "If Thanksgiving can be recreated completely in <a href=\"http://www.seriouseats.com/2011/11/my-all-pie-thanksgiving-fantasy.html\">pie form</a>, can't the holiday's many familiar flavors be translated into a satisfying salad?", "totalTime": "1 hour", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cranberry", "Dinner Tonight", "Salads", "Sweet Potatoes and Yams", "Turkey"], "recipeIngredient": ["1 pound of leftover turkey meat or 1 1/2 pounds turkey thighs", "Kosher salt and freshly ground black pepper", "1 pound Brussels sprouts (or leftover roasted brussels sprouts), ends trimmed, halved", "1 pound sweet potatoes (or leftover roasted sweet potatoes), cut into 1/2-inch cubes ", "1 tablespoon canola oil ", "1 1/2 cups Israeli couscous", "3 to 4 tablespoons softened butter, divided ", "1/2 cup dried cranberries, chopped", "1/2 cup sliced almonds", "2 to 3 tablespoons fresh juice from about 2 lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to the middle position and preheat the oven to 450&deg;F. If using leftover turkey, move on to the next step. To cook the turkey thighs, sprinkle each with a generous amount of salt and pepper. Place thighs in a baking dish and transfer to the oven. Cook until the internal temperature of the turkey is 170&deg;F, about 45 minutes. Remove the thighs from the oven and let cool. Remove the skin and pull the meat off the bone. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using pre-cooked leftover brussels sprouts and sweet potatoes, skip to the next step. Place the Brussels sprouts and sweet potato pieces in a large baking pan. Pour the canola oil on top and sprinkle with salt and pepper. Toss the pieces until well coated. Transfer to the oven and cook until both vegetables are tender and lightly browned, about 25 minutes. Remove the pan when done. Turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 3 1/3 cups of water into a medium-sized saucepan and bring to a boil over medium-high heat. Add the couscous and a pinch of salt. Cook, adjusting the heat if water thinks about boiling over, until tender, 5 to 6 minutes. Drain in a colander when done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add two tablespoons of the butter to a skillet set over medium-high heat. Add the dried cranberries, almonds, and a pinch of salt, and stir well. Cook until almonds are lightly toasted. Add the drained couscous and stir well. Turn off the heat and add 2 tablespoons of the lemon juice as well as brussels sprouts and sweet potatoes. Stir to combine. Taste, and add more butter or lemon juice if needed. Season with more salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the couscous mixture between three large bowls, and top with some pulled turkey. Serve immediately. </p>"}]}