{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121026-226994-cook-the-book-mustard-soft-pretzels.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cynthia nims", "mustard", "salty snacks", "soft pretzels"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mustard Soft Pretzels from 'Salty Snacks'", "link": "https://www.seriouseats.com/recipes/2012/10/mustard-soft-pretzels-from-salty-snacks.html", "description": "Soft pretzels are one of the most ideal game-day snacks. They're finger-friendly, slightly savory, salty, and extra bready to soak up all that beer. Making them at home looks complicated, but it's not much more difficult than making any other yeast bread.", "totalTime": "2 1/2 hours", "recipeYield": "makes 12 pretzels", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bread", "Cook the Book", "Sides"], "recipeIngredient": ["3 cups all-purpose flour, plus more if needed", "3 tablespoons malt powder", "1 1/2 teaspoons kosher salt or flaky or coarse sea salt, plus more for sprinkling", "1 cup warm water (105° to 110°F)", "2 teaspoons (1 envelope) active dry yeast", "3 tablespoons grainy mustard", "1 tablespoon baking soda", "1 large egg yolk", "1 1/2 teaspoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, malt powder, and kosher salt in the bowl of a stand mixer fitted with the paddle attachment and blend for a few moments to mix. Form a well in the center of the flour, pour in the warm water, and scatter the yeast over, stirring it in gently. Let sit until the yeast is frothy, about 5 minutes. Add the mustard to the bowl and blend the wet and dry ingredients together at medium-low speed until a cohesive dough forms. Turn the dough out onto a lightly floured work surface and knead it for 2 to 3 minutes, until smooth. (Different types of mustard have varying levels of moisture; you may need to add a bit more flour if the dough is sticky.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a lightly oiled bowl, turning the dough so it is evenly coated. Cover the bowl with a kitchen towel and set aside in a warm place until doubled in bulk, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Line a rimmed baking sheet with parchment paper or a silicone baking mat. Fill a large, broad saucepan about two-thirds full with water and set it over medium heat to warm while forming the pretzels. (If the water comes to a boil before needed, reduce the heat to low.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the risen dough out onto the counter and punch it down. Cut the dough into quarters, then cut each quarter into thirds, for <br />\r\n12 pieces of relatively even size. Cover the dough pieces with a kitchen towel until needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll one of the dough portions into a rope about 18 inches long. With the rope horizontal on the counter in front of you, lift up one end in each hand and draw the ends downward toward you, forming a broad loop with the ends overlapping at the bottom by about 2 inches. Cross your hands in front of you and pick up the two ends of dough, lifting them a couple inches above the counter. Cross your hands back to the left and right sides, twisting the dough as you do. Lay the dough ends up over the top of the loop, so that the twist sits in the center of the pretzel. Gently pinch the dough ends down into the loop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pretzel aside, covered with a kitchen towel, while forming the remaining pretzels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the pretzels have been formed, adjust the heat under the water to maintain a gentle simmer. Stir in the baking soda. Gently add 3 of the pretzels and simmer for 2 minutes, turning them halfway through. Lift the pretzels with a slotted spoon or spatula and drain for a few moments over the pan, then transfer to the prepared baking sheet. Simmer the remaining pretzels in the same fashion.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg yolk with the 11/2 teaspoons water in a small dish. Brush the pretzels with the yolk mixture and sprinkle with coarse salt. Bake until golden brown, 20 to 25 minutes. Transfer the pretzels to a wire rack to cool. Arrange the pretzels in a bowl or on a platter and serve. The pretzels will be at their best the day they are made. Should you have leftovers, they can be stored in an airtight container for a day or two, then warmed gently in the oven, wrapped in foil, to soften them up a bit.</p>"}]}