{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120718-215109-dinner-tonight-pork-chops-and-peaches-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "peaches", "pork", "pork chops", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Chops with Peaches, Bourbon, and Basil", "link": "https://www.seriouseats.com/recipes/2012/07/pork-chops-with-peaches-bourbon-and-basil-recipe.html", "description": "Most people understand that pairing pork chops and apples is a foolproof dinner, so why is it such a stretch to pair the meat with some in-season peaches straight from the farmers' market?", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Mains", "Peach", "Pork"], "recipeIngredient": ["4 thick-cut pork chops (approximately 1 1/2-inches thick) ", "Kosher salt and freshly ground pepper ", "2 tablespoons canola oil   ", "2 tablespoon butter  ", "2 peaches, pits removed, each cut into 8 wedges ", "Sugar to taste (optional)", "2 tablespoons bourbon (such as Maker's Mark) ", "16 fresh basil leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400&deg;F. Season the pork chops with salt and pepper on both sides. Heat oil in a 12-inch skillet over medium high heat until shimmering. Add the chops and cook until browned on both sides, three to four minutes per side. Remove from heat and transfer chops to a large plate. Set aside. Discard excess grease from skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the skillet and heat over medium heat until butter is melted. Add the peach wedges, tossing to coat them in the melted butter. Cook, stirring often with a wooden spoon, until the peaches are warm and soft, 1 to 3 minutes depending on ripeness of peaches. If peaches are very under-ripe, add sugar to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove skillet from heat and add bourbon. Light a long match and carefully wave it by the skillet to ingnite the whiskey. Allow flame to die naturally, then use a wooden spoon to scrape up any browned bits from bottom of pan. Season sauce to taste with salt, black pepper, and sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pork chops back to the skillet and top each with four basil leaves. Position the peaches on top of the chops. Transfer the skillet to the oven, and cook until chops achieve desired doneness, about 4 minutes for medium. Carefully remove the pan and divide the chops and peaches between four plates. Spoon some of the drippings from the pan on top of the meat and serve.   </p>"}]}