{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120404-200342-spicy-sweet-fried-tofu-buns.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Asian", "keywords": ["Andrea Nguyen", "Asian", "bao", "buns", "Cook the Book", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andrea Nguyen's Spicy-Sweet Fried Tofu Buns", "link": "https://www.seriouseats.com/recipes/2012/04/andrea-nguyens-spicy-sweet-fried-tofu-buns.html", "description": "<a href=\"http://www.vietworldkitchen.com/blog/about_andrea_nguyen.html\">Andrea Nguyen</a>, author of <em><strong><a href=\"http://www.amazon.com/Asian-Tofu-Discover-Best-Make/dp/1607740257/?tag=serieats-20\">Asian Tofu</a></strong></em> is partial to the Uncle Jesse, a soft bun filled with fried tofu, crushed peanuts, cilantro, and a more sweet than spicy chile sauce.", "totalTime": "45 minutes", "recipeYield": "makes 12 buns, to serve 4 to 6 as a snack or an appetizer", "recipeCategory": ["Asian", "Cook the Book", "Tofu", "Vegetarian"], "recipeIngredient": ["14 to 16 ounces firm tofu", "2 cups very hot or just-boiled water", "1/2 cup Thai Sweet Chile Sauce (recipe follows)", "1 tablespoon plus 1 teaspoon light (regular) soy sauce", "2 tablespoons unsalted roasted peanuts, chopped", "1 1/2 teaspoons dark brown sugar", "12 Chinese folded buns, fresh or thawed", "Canola oil for deep-frying", "About 1/3 cup potato starch", "1 generous tablespoon chopped cilantro, leafy tops only", " ", "<strong>Thai Sweet Chile Sauce</strong>", "1/3 cup coarsely chopped cilantro stems", "2 cups water", "3 to 4 tablespoons coarsely chopped garlic", "4 ounces medium-hot red chiles, such as Fresno, mostly seeded (according to taste) and coarsely chopped ", "1/8 teaspoon salt", "About 1 3/4 cups distilled white vinegar", "1 1/3 cups sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chile Sauce:</strong> Put the cilantro stems and water into a saucepan. Bring to a simmer and cook for 5 minutes. Remove from the heat and cover. Let steep for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, use a small food processor to grind the garlic, chiles, and salt to a coarse texture. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the cilantro liquid through a mesh strainer. Measure the liquid. You should have about 1 3/4 cups. Transfer to a saucepan, preferably a shallow, wide one. Pour in the same quantity of vinegar as you have of cilantro liquid. Stir in the sugar and mixture of chile and garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil over medium-high heat, then lower the heat and simmer until the volume has reduced by half; the amount of time this takes depends on the size of your saucepan. The resulting sauce should be slightly thick. Coat the back of a spoon and run your finger through it; the line should hold for only a few seconds. The sauce will thicken more and concentrate in flavor during cooling.</p>\r\n\r\n<p>Remove from the heat and set aside, uncovered, to cool completely. Use immediately or transfer to a jar and refrigerate. Bring to room temperature before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> <strong>For the Buns:</strong> Cut the tofu crosswise into 2 blocks, then cut each block crosswise into 6 chunky matchbooks, each about 1 1/2 inches by 2 inches by 1/2 inch. Put all 12 pieces of tofu in a bowl. Dissolve 1 1/2 of teaspoons salt in the hot water, then pour over the tofu to cover. Set aside for 15 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Meanwhile, in a small bowl, combine the Thai sweet chile sauce with the soy sauce. Reserve 2 to 3 tablespoons of it in a saucer or small dish that you can later dunk the tofu into. Set aside.</p>\r\n\r\n<p>In a small food processor, grind the peanuts, brown sugar, and a pinch of salt to the texture of coarse cornmeal. (Or, use a mortar and pestle.)  Transfer to a small bowl and set near the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before frying the tofu, bring a pot of water to a boil to reheat the buns. Line 2 steamer trays with parchment paper and add the buns. Steam the buns over gently boiling water until soft, fluffy, and hot to the touch, about 5 minutes. Turn off the heat but keep the lid on to ensure that the buns remain soft and warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off the water from the tofu, then transfer the pieces to a non-terry dishtowel or double layer of paper towels placed atop a plate. Let drain for about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 1 inch of oil in a wok or saucepan over high heat to between 360° and 370°F. As the oil heats up, blot excess moisture from the tofu. Because the starch can turn gummy if it sits too long on the tofu, wait until the oil temperature approaches 340°F before dredging each piece of tofu in the potato starch to coat well. Shake off excess starch, then set aside on a plate near the stove.</p>\r\n\r\n<p>When the oil is ready, fry the tofu in 2 or 3 batches, sliding the pieces into the oil, then gently stirring with chopsticks or a skimmer to fry evenly and prevent them from sticking. They should be very crisp after 2 to 3 minutes. It’s okay if they get just slightly golden. Drain the fried tofu on a paper towel. Return the oil to temperature before frying another batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each bun, press one side of a piece of tofu into the saucer of sweet chile sauce, then put the tofu into the bun, sauced side down. Spoon about 1 teaspoon of sauce on top of the tofu, then add a sprinkling of cilantro, then about 3/4 teaspoon of peanuts.</p>\r\n\r\n<p>Serve the buns immediately, while the tofu is still warm and chewy-crisp. Let guests add extra sauce to their buns as they wish.</p>"}]}