{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/02012-185998-shaker-lemon-pie-500x375-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["citrus", "lemons", "meyer lemon", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shaker Lemon Pie", "link": "https://www.seriouseats.com/recipes/2012/01/shaker-lemon-pie-meyer-lemon-recipe.html", "description": "I like Meyer lemons in this classic Shaker pie.", "totalTime": "6 hours", "recipeYield": "makes 8 servings", "recipeCategory": ["Desserts", "Lemon", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "3 Meyer lemons, cut into very thin rounds (using a slicer or mandolin is advised)", "2 cups sugar", "1/2 teaspoon salt", "2 eggs", "2 egg yolks", "3 tablespoons all purpose flour", "egg wash (made from 1 egg beaten with a pinch of salt)", "Sanding sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the lemon slices with the 2 cups of sugar until the slices are all evenly coated and macerate (allow them to sit so the sugar can draw the liquid out) for two hours at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. Beat the eggs and yolks together with the salt. Add flour a little at a time, whisking continuously to avoid flour lumps. Add egg mixture to the lemons and mix well with a big rubber spatula. Pour the mixture into the chilled bottom crust. Cover with the chilled top crust and trim the edges, then shape the edges as desired, creating a seal. Cut slits in the top to vent the pie, then place in the fridge for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Right before baking, brush the top of the pie with egg wash and sprinkle with sanding sugar. Bake at 425&deg;F for 20 minutes on the bottom rack, turning halfway through. Turn the oven down to 350&deg;F and bake until the filling puffs the crust up a bit, about 15 to 20 minutes. Remove from the oven and allow to cool completely, then chill for at least one hour before serving.</p>"}]}