{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120122-189325-one-pot-coconut-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "coconut milk", "Cook the Book", "Cree LaFavour", "Poulet"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Poulet's One-Pot Coconut Chicken over Jasmine Rice", "link": "https://www.seriouseats.com/recipes/2012/01/poulets-one-pot-coconut-chicken-over-jasmine-rice.html", "description": "This <strong>One-Pot Coconut Chicken over Jasmine Rice</strong> from <em><strong><a href=\"http://www.amazon.com/Poulet-Cree-LeFavour/dp/0811879690/?tag=serieats-20\">Poulet</a></strong></em> simmers a whole chicken in a coconut milk with a host of veggies that cook with the chicken, soaking up all of its wonderfully savory flavors. Truly a one-pot meal (if you're not counting the rice), the chicken emerges from the pot incredibly tender.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["One 2- to 4 1/2 pound chicken", "1 tablespoon peanut oil", "1 13.5 ounce can unsweetened coconut milk  ", "1/2 head garlic, cloves chopped ", "1 6-inch piece fresh ginger, peeled and chopped ", "3 cups chopped bok choy", "1/2 red or orange bell pepper, cut into bite-size chunks", "1/2 pound shiitake mushrooms, brushed clean, trimmed and coarsely chopped (about 5 cups)", "1/2 teaspoon ground tumeric ", "1 tablespoon Thai fish sauce (substitute soy sauce if necessary)", "2 cups water ", "1/4 cup chopped fresh mint ", "1/4 cup chopped cilantro leaves ", "Flaky salt for finishing", "<strong>Jasmine Rice</strong>", "1 1/2 cups jasmine rice", "3 cups water "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and preheat to 450°F. Set the chicken on the countertop for 30 minutes or so to take the chill off before cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the peanut oil in a 12-inch or larger cast-iron frying pan or a 5 quart or larger Dutch oven. Set the chicken in the pan and cook over medium heat until nicely browned on the sides and bottom, about 10 minutes. No need to brown the top. Transfer the chicken to a plate and pour off any excess fat in the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skim the fat from the top of the can of coconut milk and add the fat to the pan along with the garlic, ginger, bok choy, bell pepper, mushrooms, and turmeric. Cook over medium heat, stirring often, for 5 to 8 minutes, or until the bell pepper and mushrooms are soft and the garlic is fragrant. Stir in the fish sauce, coconut milk, and water. Return the chicken to the pot, breast-side up. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chicken in the oven and braise, uncovered, for 30 minutes before either inserting an instant-read thermometer into the thickest part of a thigh or cutting into the thigh with a paring knife. The thermometer should register 175°F. If using a knife, look for clear, not red or pink, juices running from the spot where you pierce the meat and opaque, barely pink flesh at the joint. If the chicken isn’t done, cook for 5 to 10 minutes longer and check it again. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken is done, remove the pan from the oven and let the chicken rest for 5 minutes before you carve it. (Do this right in the pan, if you can manage.) Pour the liquid from the pan into a fat separator. (You can also use a heatproof jar and use a spoon to skim off as much of the fat as possible.) Serve with plenty of the sauce, the mint and cilantro, and a pinch of flaky salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Jasmine Rice:</strong> Rinse the rice in a colander under cold running water until the water runs clear. Drain off any remaining water and transfer the rice to a saucepan with a tight-fitting lid. Add the 3 cups water, place over medium heat, cover, and cook until the rice is tender and the water has evaporated, 12 to 15 minutes. Fluff with a fork before serving.</p>"}]}