{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/201200503-204660-chicken-cutlets-with-quick-pan-sauce.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "How to Cook Everything The Basics", "Mark Bittman", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Mark Bittman's Chicken Cutlets with Quick Pan Sauce", "link": "https://www.seriouseats.com/recipes/2012/05/mark-bittmans-chicken-cutlets-with-quick-pan-sauce.html", "description": "Quick weeknight chicken dinner is one of those recipe topics that never gets old.  And a recipe that goes from chicken in the fridge to satisfying dinner on the table in under thirty minutes, well even better.  This is exactly why these <strong>Chicken Cutlets with Quick Pan Sauce</strong> from <a href=\"http://markbittman.com/\">Mark Bittman</a>'s <em><strong><a href=\"http://www.amazon.com/How-Cook-Everything-The-Basics/dp/0470528060/?tag=serieats-20\">How to Cook Everything The Basics</a></strong></em> are such a keeper.", "totalTime": "20 to 30 minutes", "recipeYield": "4 servings", "recipeCategory": ["Chicken", "Cook the Book", "Mains"], "recipeIngredient": ["1 cup all-purpose flour", "1 1/2 pounds boneless, skinless chicken breasts, thighs, or tenders ", "Salt and freshly ground black pepper", "2 tablespoons olive oil", "3 tablespoons butter", "1/2 cup dry white wine", "1/2 cup water, chicken stock, or vegetable stock", "1/4 cup chopped fresh parsley leaves, plus 2 tablespoons for garnish", "1 lemon, quartered, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 200°F. Put the flour on a plate or in a shallow bowl next to the stove. If necessary, put each cutlet between 2 sheets of sheet of plastic wrap and pound to uniform thickness; blot the chicken dry with a paper towel and sprinkle with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the oil and 2 tablespoons of the butter in a large skillet over medium-high heat. When the butter has melted, turn a piece of the chicken in the flour to coat it on all sides; shake off any excess. Add the floured chicken to the pan, then repeat with the next piece; work in batches if necessary to avoid crowding the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, adjusting the heat as needed so that the fat is always bubbling but the chicken doesn’t burn. After 2 minutes, rotate the chicken so that the outside edges are moved toward the center and vice versa (don’t flip them; you want the same side in contact with the fat). When the bottom of each piece is brown, after 3 to 4 minutes, turn them over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook on the second side, adjusting the heat as described in Step 3, until the chicken is firm to the touch but still a bit pink inside, another 3 to 4 minutes. To check for doneness, cut into a piece with a thin-bladed knife and take a peek. Transfer the chicken to an ovenproof platter and put it in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine to the skillet, keeping the heat at medium-high. Let it bubble away as you stir and scrape the bottom of the pan, until about half the wine has evaporated, a minute or two. Pour in the water and continue to stir until the liquid has thickened slightly and reduced to 1/4 cup, another 2 or 3 minutes. Add the remaining tablespoon of butter to the skillet and swirl the pan around until the butter melts; turn off the heat.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the oven, and if any juices have accumulated on the platter, add them to the skillet along with the  1/4 cup parsley. Stir, taste the sauce, and adjust the seasoning. Spoon the sauce over the chicken, garnish with the remaining 2 tablespoons parsley, and serve with the lemon quarters.<br />\r\n</p>"}]}