{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120108-186270-preserved-grapefruit-marmalade-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["citrus", "grapefruit", "Jam", "Marmalade", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grapefruit Marmalade", "link": "https://www.seriouseats.com/recipes/2012/01/fresh-grapefruit-marmalade-recipe.html", "description": "This grapefruit marmalade embodies everything I love about freshly squeezed juice: the tiny bits of pulp; the citrusy aroma; and the clean, bright flavor. I kept this recipe as simple as possible, but feel free to play with the flavors. Substitute two oranges for one of the grapefruit, or toss half a split vanilla bean into the pot along with the chopped fruit.", "totalTime": "2 hours", "recipeYield": "Makes about 7 1/2 cups, or 7 half-pints plus a little extra", "recipeCategory": ["Condiments and Sauces", "Fruit Desserts", "Grapefruit"], "recipeIngredient": ["6 1/2 cups sugar", "4 medium or 3 large pink grapefruit", "1/8 teaspoon baking soda", "One (1.75-ounce) package regular powdered fruit pectin", "1/4 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the sugar into a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the grapefruit and remove the rinds in quarters. Discard 4 of the quarters (the rind of 1 grapefruit). Thinly slice the remaining quarters lengthwise, then roughly chop them crosswise into smaller pieces. Transfer the rinds to a large pot and add 2 cups of water and the baking soda. Bring to a boil over medium-high heat, cover, lower the heat, and simmer until the rinds are soft and beginning to turn translucent, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, roughly chop the grapefruit and remove any seeds. Transfer the grapefruit to a food processor and pulse until coarsely chopped. Add the fruit to the pot with the rind and return the mixture to a simmer. Simmer, covered, until the fruit has softened a bit, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure 5 cups of the fruit mixture, making sure to get a good combination of rind, fruit, and juice. Discard the remaining fruit mixture. Return the reserved 5 cups of the fruit mixture to the pot. Stir in the pectin and the butter and bring to a boil over high heat, stirring constantly. Add the sugar all at once and return the mixture to a full rolling boil, stirring constantly. Boil hard for one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and skim any foam from the surface of the marmalade with a cold metal spoon. Ladle the marmalade into hot, sterilized jars and process them in a hot water bath for 10 minutes. </p>"}]}