{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121002-hocks-trotters-bo-ssam-overhead.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Korean", "keywords": ["bo ssam", "David Chang", "Korean", "pork", "The Nasty Bits", "trotters"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Trotters and Hocks Bo Ssam", "link": "https://www.seriouseats.com/recipes/2012/10/trotter-and-hocks-bo-ssam-recipe.html", "description": "Crispy roasted pork trotters with two sauces in fresh Korean-style lettuce wraps.", "totalTime": "about 12 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Korean", "Mains", "Offal", "Pork", "The Nasty Bits"], "recipeIngredient": ["2 whole pork trotters with lower hocks still attached (3 pounds each, about 6 pounds total)  ", "1/2 cup white sugar  ", "1/2 cup plus 1 tablespoon kosher salt  ", " ", "<strong>For the Ginger-Scallion Sauce: </strong>", "1 cup thinly sliced scallions, green and white parts  ", "1 tablespoon ginger, minced or grated with a microplane grater ", "2 tablespoon neutral-tasting oil such as canola or grapeseed", "1 teaspoon light soy sauce  ", "1/4 teaspoon sherry or red wine vinegar", "Kosher salt", " ", "<strong>For the Ssam Sauce: </strong>", "1 tablespoon fermented bean-and- chili paste (ssamjang, available in many Asian markets, and online)  ", "1-2 teaspoons chili paste (kochujang, available in many Asian markets, and online)  ", "1/4 cup sherry vinegar  ", "3 to 4 tablespoons neutral-tasting oil such as canola or grapeseed", " ", "<strong>To Serve: </strong>", "3 tablespoons brown sugar", "2 cups plain white rice, cooked  ", "1 to 2 heads bibb lettuce, leaves separated, washed and dried  ", "Kimchi (available in many Asian markets, and online).  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the hock/trotters on a large plate or a tray. In a small mixing bowl, mix the white sugar and 1/2 cup of the salt.  Rub the mixture over the hocks and trotter, both skin as well as meat. Transfer to a baking dish, cover with plastic wrap and place in the refrigerator for at least 6 hours, or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, adjust an oven rack to the lower-middle position and preheat oven to 300°F. Remove the hocks/trotters from the refrigerator and discard any pork liquids that have pooled at the bottom of the dish. Place the hocks/trotters in a V-rack set in a roasting pan and roast until very tender, about 4 hours, basting with pan juices every 30 minutes after the first hour. Allow meat to cool for at least 2 hours, or refrigerate for up to 3 days before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the ginger scallion sauce:</strong> Combine the scallions ginger, oil, soy sauce, and vinegar in a small mixing bowl. Season to taste with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the ssam sauce</strong>: combine the chili pastes with the vinegar and oil in a small mixing bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, preheat oven to 500°F. \u0010Combine remaining tablespoon salt with brown sugar. Rub the mixture over the cooked trotters/hocks. Roast in the oven until the skin is very dark and crispy, about 15 minutes. Serve immediately with sauces, rice, lettuce, and kimchi</p>"}]}