{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/Ozark%20Pudding%20Cake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "easy", "pears", "skillet", "Vintage Cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Ozark Pudding Cake", "link": "https://www.seriouseats.com/recipes/2012/11/ozark-pudding-cake-recipe-easy-pear-cake.html", "description": "If you have a cast-iron skillet and a couple of pears, you're quite close to cake. WIth a crisp bottom and sides and soft center, it's the perfect breakfast or dessert.", "totalTime": "60 to 80 minutes", "recipeYield": "serves 8", "recipeCategory": ["Bake the Book", "Cakes", "Pear"], "recipeIngredient": ["2 large but firm pears, peeled, quartered, and cored", "1 cup (5 ounces) all-purpose flour", "1 teaspoon baking powder", "1 teaspoon ground ginger", "1/4 teaspoon fine sea salt", "4 tablespoons (2 ounces) unsalted butter, at room temperature", "1 cup (7 ounces), plus one teaspoon sugar", "1 egg, at room temperature", "1 teaspoon pure vanilla extract", "1/2 cup sliced natural almonds, toasted", "1/2 cup dried cranberries (optional)", "Vanilla ice cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center an oven rack and preheat the oven to 350ºF. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop one of the pears and thinly slice the other. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, baking powder, ginger and salt in a bowl, and then whisk the mixture by hand to ensure that the ingredients are well mixed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a stand mixer fitted with the paddle attachment, blend the butter and sugar together on medium speed until the mixture resembles wet sand. Add the egg and vanilla and blend on medium-high speed until fluffy, about 5 minutes. Scrape down the bowl occasionally as needed. Turn the mixer to low speed and add the flour mixture all at once. Mix until just blended. The batter will be stiff. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula, fold in the chopped pear (setting aside the sliced pear for the top), half the almonds, and the cranberries, and stir just until blended. Dump the batter into the prepared skillet and spread it in an even layer. Arrange the pear slices on top of the batter and sprinkle with the remaining almonds and the remaining teaspoon of sugar. Place the skillet in the middle of the oven and bake until the cake is golden in color and the center springs back when lightly touched, 38 to 40 minutes. (The heat from the pan will continue to bake the cake after it is removed from the oven, so take care to remove it when it is just barely done). Serve warm from the skillet with a scoop of vanilla ice cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This cake is best the day it is baked. Well covered, it keeps in the skillet for up to 2 days at room temperature. </p>"}]}