{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121112-btb-vintage-cakes-gingerbread-icebox.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "Christmas", "gingerbread", "icebox cake", "Vintage Cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Gingerbread Icebox Cake with Mascarpone Mousse", "link": "https://www.seriouseats.com/recipes/2012/11/gingerbread-icebox-cake-with-mascarpone-mousse-recipe.html", "description": "The term \"cake\" is used loosely here, but we doubt you'll mind. Part elegant holiday centerpiece, part little-kid fantasy, this towering cake of cream and cookies is as delicious as it is stunning.", "totalTime": "3 hours, including baking, cooling and assembly", "recipeYield": "serves 8", "recipeCategory": ["Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["<strong>Wafers</strong>", "4 3/4 cups (23 3/4 ounces) all-purpose flour", "1 tablespoon ground ginger", "1 tablespoon ground cinnamon ", "1 teaspoon ground cloves ", "3/4 teaspoon baking soda", "1/4 teaspoon baking powder", "1/2 teaspoon fine sea salt ", "3/4 cup (6 ounces) unsalted butter, \u2028at room temperature", "3/4 cup (5 2/3 ounces) firmly packed brown sugar", "2 eggs", "3/4 cup (9 ounces) unsulfured blackstrap molasses", "&nbsp;", "<strong>Mousse</strong>", "1 pound mascarpone, cold ", "1 1/2 cups heavy cream, cold", "1/3 cup (2 1/3 ounces) sugar ", "2 tablespoons pure vanilla extract, or 1/4 cup brandy "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the wafers, center an oven rack and preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, ginger, cinnamon, cloves, baking soda, baking powder, and salt into a bowl, then whisk the mixture by hand to ensure that the ingredients are well mixed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>n the bowl of a stand mixer fitted with the paddle attachment, mix the butter and brown sugar on medium speed until well combined. Add the eggs one at a time, scraping down the sides and bottom of the bowl between additions. Blend in the molasses. Add the dry ingredients all at once and combine on low speed, scraping down the bowl as needed to create a unified dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in four quarters and shape each piece into a rough rectangle about 1 inch thick. Wrap each piece tightly in plastic wrap and refrigerate the dough until it is firm enough to roll out, about \u20282 hours.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll out the dough with a rolling pin to \u20281/8 inch thick or even a bit thinner (use a ruler; you can never go too thin, but you will need to reduce your baking time if you roll the dough thinner than 1/8 inch). Using a 21/2-inch round cookie cutter, cut out disks and place them 1 inch apart on the prepared baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather up the scraps and reroll. If the dough gets too warm and hard to handle, pop \u2028it back in the refrigerator to firm up before continuing. You will need \u202870 wafers to assemble the cake. If you have extra dough, use it to cut some festive cookies to embellish the top of the cake, or chill it to make more gingerbread wafers later; the dough will keep in the refrigerator for up to \u20285 days or in the freezer for 2 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the wafers until golden around the edges and firm on top, 12 to 14 minutes. Let the wafers cool on their baking sheet until cool enough to handle, then remove them to a wire rack to cool completely.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the wafers are baked, make the mascarpone mousse. Place a mixing bowl or the bowl of a stand mixer and its whisk attachment in the freezer for 5 minutes to chill. Blend the mascarpone, cream, and sugar in the cold bowl on low speed until combined. Increase the speed to medium high and whip just until the cream becomes thick and fluffy and holds a stiff peak (warning: overmixing will cause the contents to curdle.) Blend in the vanilla or brandy on low speed until just incorporated.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cake, spread about 2 tablespoons of the cream on a flat serving plate. Arrange 6 wafers touching side by side in a circle plus 1 wafer in the middle. Spread a heaping 1/2 cup of mousse atop the wafers, almost covering them but leaving a smidge of room at the edge of the circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with another 7 wafers and more mousse, offsetting the wafers from the previous layer so they do not stack right on top of each other. Repeat until you have ten layers of wafers staggered with ten layers of mousse (not counting your initial dollop on the plate), topping the last layer of wafers with all the mousse that is left in the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover loosely with plastic wrap and refrigerate for at least 12 hours. Serve chilled, and if you made any decorative cookies, arrange them on the top.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This cake keeps for up to 3 days refrigerated in an airtight container.</p>"}]}