{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121013-veg-shepherds-pie-slice-primary.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["mushroom", "potato", "shepherd's pie", "squash", "thanksgiving", "Thanksgiving turkey alternatives", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mushroom and Root Vegetable Shepherd's Pie", "link": "https://www.seriouseats.com/recipes/2012/11/mushroom-and-root-vegetable-shepherds-pie-recipe.html", "description": "Shepherd's pie is a natural fit for Thanksgiving ingredients like squash and root vegetables. They get roasted to intensify their flavor, combined with mushrooms for some added flavor and heft, stirred into a rich, creamy, comforting sauce, and topped with smooth mashed potatoes, which get brown and crisp when the dish goes back into a hot oven. The end result is decadent enough to satisfy a holiday-sized appetite, and might even turn the heads of a few of your meat-eating friends and relatives.", "totalTime": "2 hours 30 minutes", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Mains", "Mushrooms", "Potato", "Squash", "Vegetarian"], "recipeIngredient": ["2 (10-ounce) packages of brown button mushrooms, wiped clean with a damp paper towel and halved or quartered, depending on size", "7 tablespoons extra virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "1 large sprig fresh thyme", "1/2 medium butternut squash, peeled and cut into a medium dice (about 2 cups)", "3 large carrots, peeled and cut into a medium dice (about 2 cups)", "2 large parsnips, peeled and cut into a medium dice (about 2 cups)", "2 medium turnips, peeled and cut into a medium dice (about 1 1/2 cups)", "2 medium, waxy-type potatoes, peeled and cut into a medium dice (about 1 1/2 cups)", "2 small sweet potatoes, peeled and cut into a medium dice (about 1 1/2 cups)", "1 stick unsalted butter, divided", "3 large leeks, sliced into half-moons, rinsed clean of any grit (about 2 cups)", "4 ribs of celery, wiped clean and finely chopped (about 2 cups)", "1 teaspoon chopped fresh rosemary leaves", "1 teaspoon chopped fresh sage leaves", "4 tablespoons all-purpose flour", "1/2 cup sherry, vermouth or dry white wine", "3 cups low-sodium vegetable stock ", "6 large baking potatoes, peeled and cut into large pieces (about 3 cups)", "1 cup whole milk", "Nonstick cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle positions and preheat oven to 425&deg;F. In a medium bowl, toss mushrooms with 3 tablespoons extra virgin olive oil and season to taste with salt and pepper. Turn onto a large rimmed sheet tray lined with tin foil. Add thyme. In a large mixing bowl, combine squash, carrots, parsnips, turnips, waxy potatoes and sweet potatoes. Toss with remaining 4 tablespoons olive oil and season to taste with salt and pepper. Turn onto a large rimmed sheet tray lined with aluminum. Transfer trays to oven and roast until vegetables are tender and mushrooms are browned, about 30 minutes for mushrooms and 40 minutes for vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, prepare the sauce for the filling: heat 5 tablespoons butter in a large, heavy-bottomed Dutch oven set over medium heat. Add leeks and celery and cook, stirring occasionally, until vegetables are softened but not browned, about 7 minutes. Add rosemary and sage and cook, stirring, for 1 minute. Add flour and cook, stirring and scraping bottom of pot, until butter is pale golden brown, about 2 minutes. Deglaze pan with sherry, vermouth, or wine and cook, stirring and scraping bottom of pot. Add stock, bring to a boil, reduce to a simmer, and cook until sauce is thick enough to coat back of a spoon, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When mushrooms and vegetables are roasted, remove from oven and lower oven temperature to 375&deg;F. Discard thyme and combine mushrooms and vegetables with sauce on top of the stove, stirring well. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place baking potatoes in a large saucepan and cover with water. Season with salt. Cover pot, place over high heat and bring to boil, then uncover and drop to a simmer. Cook until potatoes are fully tender, about 10 minutes. Drain well and return to pot. Add 2 tablespoons of butter and 1 cup of milk, or more as needed. Mash potatoes until completely smooth, and season to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray baking dish with nonstick cooking spray and add mushroom and vegetable mixture, spreading in pan to distribute evenly. Top with mashed potatoes, spreading over vegetables to distribute evenly. Dot potatoes with remaining 1 tablespoon of butter cut into small pieces and bake in oven until potatoes have browned, about 45 minutes. Let rest about 15 minutes, then serve.</p>"}]}