{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121221-233989-cook-the-book-short-rib-ragu.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Amanda Hesser", "Cook the Book", "food52", "gremolata", "Merrill Stubbs", "short rib ragu", "The Food52 Cookbook Volume 2"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Food52's Short Rib Ragu", "link": "https://www.seriouseats.com/recipes/2012/12/food52s-short-rib-ragu.html", "description": "Short rib ragu may not be the first thing you think of when planning your holiday cooking; humble braises often take a backseat to large elegant roasts. But not much can beat the decadent richness of a properly braised pot of short ribs. Add a thick, mushroomy sauce as <a href=\"http://www.food52.com/users/9997_minimally_invasive\">Minimally Invasive</a>'s winning recipe in the new <a href=\"http://www.amazon.com/The-Food52-Cookbook-Volume-Seasonal/dp/0061887293/?tag=serieats-20\">Food52 Cookbook</a> suggests, and you'll be on your way to making holiday meal history.", "totalTime": "24 hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Beef", "Cook the Book", "Mains"], "recipeIngredient": ["<strong>Ragu</strong>", "1 ounce dried porcini mushrooms", "5 to 6 pounds short ribs", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil, bacon fat, or lard", "1 large onion, chopped", "2 medium carrots, peeled and chopped", "2 celery stalks, chopped", "2 large garlic cloves, finely chopped", "2 tablespoons tomato paste", "1 tablespoon anchovy paste", "Half a 750-ml bottle red wine", "1 (14-ounce) can fire-roasted tomatoes, with their juices", "1 tablespoon Dijon mustard", "3 to 4 dashes Worcestershire sauce", "1 teaspoon dried thyme", "1 teaspoon dried oregano", "1 large rosemary sprig, leaves removed and chopped", "2 bay leaves", "4 to 5 cups chicken stock, low-sodium broth, or water", "&nbsp", "<strong>Gremolata</strong>", "1 large garlic clove, minced", "Grated zest of 1 large lemon", "1/4 cup finely chopped fresh flat-leaf parsley", "1/2 teaspoon salt", "1 teaspoon olive oil", "Hot polenta, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the ragu:</strong> (Note: This is best prepared one day before serving). Heat the oven to 350°F. Soak the dried mushrooms in 2 cups boiling water for at least 10 minutes, until soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, season the ribs well with salt and pepper. Heat the oil in a large ovenproof heavy pot (such as a 5-quart enameled cast iron Dutch oven) over medium heat until shimmering. Brown the ribs in batches for 2 to 3 minutes per side; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour out all but 1 tablespoon of the fat from the pot, then sauté the onion, carrots, and celery until soft. Add the garlic and stir until fragrant. Create a hot spot in the pot by moving the vegetables aside, leaving about a 3-inch circle bare. Add the tomato paste and anchovy paste to the hot spot and stir vigorously until caramelized, then stir this mixture into the vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the red wine to deglaze the pot and cook until the liquid is reduced by half. Add the tomatoes, mustard, and Worcestershire sauce. Lift the mushrooms from the soaking liquid and add to the pot, then add the soaking liquid, minus the last 1/4 inch to keep sediment out of your dish, and the herbs. Add the ribs back to the pot, then add enough chicken stock so the ribs are nearly covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the liquid to a boil, then cover tightly and braise in the oven for at least 3 hours, or until the ribs are fall-apart tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ribs from the braising liquid and set aside until cool enough to handle. Meanwhile, remove the bay leaves from the braising liquid and discard. Puree the braising liquid with an immersion blender (or in batches in a regular blender, then return to the pot). Set the pot over medium-low heat to reduce if the sauce seems thin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the ribs have cooled, remove and discard the bones and any large pieces of fat. Shred the beef and return it to the pot. Let cool to room temperature, skimming any large pools of fat from the surface, and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The next day, make the gremolata:</strong> Mix all the ingredients in a small bowl and let sit at room temperature for an hour before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove any solidified fat from the surface of the ragu and reheat. Serve over polenta, sprinkled with the gremolata.</p>"}]}