{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120516-fiaf-piperade-salmon-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French in a Flash", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stoplight Piperade with Spicy Broiled Salmon", "link": "https://www.seriouseats.com/recipes/2012/05/stoplight-piperade-with-spicy-broiled-salmon-recipe.html", "description": "Simple everyday salmon is broiled on a bed of piperade, a Basque bell pepper stew flavored with spicy, earthy piment d'Espelette. Light, but it packs a punch.", "totalTime": "2 hours and 20 minutes", "recipeYield": "serves 2", "recipeCategory": ["French", "Mains", "Salmon"], "recipeIngredient": ["1 tablespoon olive oil, plus 2 teaspoons", "1 medium yellow onion, diced (about 1 cup)", "3 medium cloves garlic, chopped (about 1 tablespoon)", "1 yellow bell pepper, diced (about 3/4 cup)", "1 red bell pepper, diced (about 2/4 cup)", "1 green bell pepper, diced (about 3/4 cup)", "1/2 teaspoon piment d’Espelette (or red pepper flakes), plus a pinch", "1 (14.5-ounce) can of diced tomatoes", "Kosher salt and freshly ground black pepper", "2 boneless, skinless salmon fillets (about 12 ounces total)", "A few mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the piperade, heat 1 tablespoon olive oil in a sautépan over medium-low heat. When the oil shimmers, add onion. Cook, stirring frequently until translucent, about 5 minutes. Add the garlic, bell peppers, and piment d’Espelette. Cook, stirring frequently until fragrant, about 1 minute. Add the tomatoes and their juice, and season well with salt and pepper. Bring the mixture to a boil, then lower the heat all the way down, cover, and cook slowly for 2 hours, stirring every half hour or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust a rack to 6 inches below broiler element and preheat broiler to high. Remove lid from piperade pot, increase heat to high, and let it boil until the pan is nearly dry and the tomato broth has evaporated. Transfer the piperade to a food processor, and pulse until roughly chopped, about 6 one-second pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the piperade to a broiler-safe baking dish. Rub the salmon fillets with 2 teaspoons of olive oil, and season with salt and piment d’Espelette.  Place the salmon on the piperade, and broil for 10 minutes, until the top is golden brown, and the salmon is cooked through. Tear some mint over the salmon. Serve with warm bread.</p>"}]}