{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120410-195206-eclair-610x458-15.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["eclaires", "french pastry", "pastry", "pastry cream", "pate a choux"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cream-Filled Chocolate-Covered Eclairs", "link": "https://www.seriouseats.com/recipes/2012/04/chocolate-covered-vanilla-pastry-cream-eclair-pastry-recipe.html", "description": "This classic French pastry is filled with a vanilla scented cream and covered in a smooth chocolate glaze.", "totalTime": "5 hours", "recipeYield": "makes approximately 2 dozen, 4-inch eclairs", "recipeCategory": ["Desserts", "Pastry"], "recipeIngredient": ["One recipe <a href=\"http://www.seriouseats.com/recipes/2011/08/pastry-cream-recipe-for-cakes-eclairs-pastries.html\">Vanilla Bean Pastry Cream</a>, chilled", "One recipe <a href=\"http://www.seriouseats.com/recipes/2011/06/filled-pate-a-choux-puffs-aka-cream-puffs.html\">pâte à choux dough</a>", "8 ounces dark chocolate, chopped into small pieces", "Egg wash made from 1 egg beaten with 1 pinch of salt", "4 ounces heavy cream, warmed", "3 tablespoons butter, melted", "2 ounces light corn syrup", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust two oven racks to the upper and lower-middle positions and preheat oven to 425&deg;F. Cut two sheets of parchment paper to fit two sheet pans. Fold each sheet of parchment paper into thirds the long way, or, draw two horizontal lines the length of the paper to divide it evenly into thirds. The lines on the parchment will be a useful guide as you are piping out the dough later on. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a piping bag fitted with a medium-sized round tip (#8 is recommended, nothing larger) halfway with the pâte à choux. Pipe a tiny amount of the dough onto each of the four corners of two sheet pans, then adhere the prepared parchment (with drawn lines face down) to the pans using the dabs of dough as glue. Pipe the pâte à choux into cylinders approximately 3 - 3 1/2 inches in length leaving approximately 1 1/2 inches of space between each. You should aim to pie about twelve per standard 13x18 inch pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush each of the cylinders with egg wash, ensuring that the top and sides have been coated. Gently drag a fork along the top and sides of the cylinder the long way, making slight indentations with the tines. Bake the pâte à choux for 20 minutes, then rotate the pans and drop the oven to 350&deg;F and bake until the shells are a uniform golden brown (even in the cracks and crevices), approximately 20 additional minutes. Allow the shells to cool completely on the parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the chilled pastry cream until it is smooth and creamy. Fill a piping bag fitted with a small, round tip (recommended #3) halfway with pastry cream and set aside. Using a paring knife, bore two small holes into the bottom of each of the shells, one at each end. Pipe the pastry cream into each of the holes, stopping when the cream surges back out of the incision. Wipe off any excess cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt chocolate in a bowl set over a pot of water, taking care not to allow the water to touch the chocolate. Warm cream, butter, and salt (microwaves are great for this) until butter is melting and cream feels warm to the touch. Pour cream mixture over chocolate in the double boiler and stir until chocolate is completely melted. Stir in corn syrup until glaze is smooth and shiny, with no visible lumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hold each eclair face down and dip the top directly into the glaze, submerging it only enough to coat the top. Pull the eclair up and away from the bowl, shaking off the excess. Place the eclairs in the fridge for a few minutes to help them set up, but do not leave them there too long, or they will start to become soggy and rubbery. They are best served soon after filling and glazing.</p>"}]}