{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120124-chow-fun-bok-choy-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "bok choy", "Chinese", "chow fun", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bok Choy With Chives, Black Bean Sauce, and Chow Fun", "link": "https://www.seriouseats.com/recipes/2012/01/vegan-bok-choy-with-chives-black-bean-sauce-chow-fun.html", "description": "Instead of noodles, the base of the dish is stir-fried bok choy (cooked in a super-heated cast iron wok to get some nice, smoky wok hei into it) along with flowering chives, Chinese chives, and leeks in a savory fermented black bean and soy-based sauce. The noodles are still great&mdash;perfect for adding a bit of textural and flavor contrast&mdash;but now their ratio is more akin to the marshmallows in the Rice Krispies.", "totalTime": "15 minutes", "recipeYield": "makes 4 servings", "recipeCategory": ["Chinese", "Dairy-Free", "Pasta", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 cup Shaoxing wine or dry sherry", "3 tablespoons dark soy sauce", "2 tablespoons fermented black bean sauce (or 3 tablepoons whole fermented black beans, mashed with the back of a fork)", "1/2 pound fresh chow fun noodles", "2 tablespoons vegetable oil", "1 1/2 pounds bok choy (about 1 medium head), cut into rough 2-inch lengths (about 4 quarts packed pieces)", "1/4 pound Chinese chives or scallions, cut into 2-inch lengths", "1 large leek, quartered lengthwise and cut into 1-inch lengths", "2 cups mung bean sprouts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine Shaoxing wine, soy sauce, and black beans in a small bowl and stir. Set aside. If noodles are cold, transfer to a microwave-safe bowl and microwave under high power for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil over high heat in a large wok until smoking heavily. Add bok choy and toss to coat in oil. Cook, stirring and tossing occasionally, until bok choy is charred in spots, bright green, and tender-crisp, about 2 minutes total. Transfer cooked bok choy to a bowl and wipe out wok with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining tablespoon oil to wok and heat over high heat until heavily smoking. Add chives and leeks and cook, stirring and tossing occasionally, until charred in spots, about 1 minute. Add bean sprouts, noodles, bok choy, and sauce. Cook, carefully flipping and turning until noodles and vegetables are evenly coated in sauce. Transfer to a large serving platter and serve immediately.</p>"}]}