{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120102-knead-the-book-kaiser-rolls-steps.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "kaiser rolls", "rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Fundamental Techniques of Classic Bread Baking's Kaiser Rolls", "link": "https://www.seriouseats.com/recipes/2012/01/kaiser-rolls-bread-baking-recipe.html", "description": "Choosing which \"classic\" bread recipes to make this week from <strong><em><a href=\"http://www.amazon.com/dp/158479934X/?tag=serieats-20\">The Fundamental Techniques of Classic Bread Baking</a></em></strong> was difficult. There were just too many possibilities. I decided on Kaiser rolls because I was intrigued (and slightly confused) by the folding technique.", "totalTime": "3 hours 45 minutes", "recipeYield": "Makes 12 rolls", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["812 grams /1 pound 12 2/3 ounces bread flour", "430 grams / 15 1/8 ounces water", "41 grams / 1 1/2 ounces eggs", "29 grams / 1 ounce fresh yeast", "19 grams / 2/3 ounce vegetable oil", "16 grams / 1/2 ounce malt syrup", "19 grams 2/3 ounce salt", "18 grams / 2/3 ounce sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the mise en place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the bread flour with the water, eggs, yeast, vegetable oil, and malt syrup in the bowl of a standing electric mixer fitted with the hook. Mix on low speed for about 4 minutes, or until blended.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt and sugar, increase the mixer speed tp medium, and mix for about 8 minutes, or until the dough begins to pull away from the sides of the bowl, feels elastic, and gives some resistance when tugged.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a large bowl or container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough into the prepared bowl. Cover the bowl with plastic film and set aside to ferment for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a clean, flat work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the dough and divide it into 12 115-gram / 4-ounce rounds on the floured surface. Cover with plastic film and bench rest for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two sheet pans with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the dough and, if necessary, lightly flour the work surface. If you have a kaiser roll stamp, press the center of the roll with it. If you don’t have a stamp, lightly press on the dough to degas and carefully shape each round into a baguette about 12 inches long. Working with one piece at a time, form each baguette into a loop, crossing the ends with the right end being on the bottom. Pull the right end up and over the center of the loop and the push it under in the same direction. The left loop should now be pointing right. Take the left end and pull it up and under the center hole and then connect it to the other end. You should now have a roll that is rather like a rosette. Place 6 rolls, seam side down, onto each of the prepared pans. Cover with plastic film and proof for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About an hour before you are ready to bake the rolls, preheat the oven to 400 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the dough and transfer the rolls to the preheated oven. Bake for 22 minutes, or until the rolls are golden brown and crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and transfer to wire racks to cool.</p>"}]}