{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120610-210038-blueberry-monshine-pops.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "blueberries", "David Carrell", "Joel Horowitz", "moonshine", "Nathalie Jordi", "People's Pops", "popsicles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry Moonshine Pops", "link": "https://www.seriouseats.com/recipes/2012/06/peoples-pops-blueberry-moonshine-popsicles-recipe.html", "description": "Pairing sweet blueberries with punchy moonshine and a hit of lemon juice is a genius move, making these <strong>Blueberry Moonshine Pops</strong> one hell of a summer afternoon treat.", "totalTime": "10 minutes plus 4 to 5 hours freezing time", "recipeYield": "makes 10 pops", "recipeCategory": ["Blueberry", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 pound 6 ounces (4 3/4 cups) blueberries", "3/4 cup (6 fluid ounces) simple syrup (recipe follows)", "2 tablespoons (1 fluid ounce) freshly squeezed lemon juice", "1/3 cup (3 fluid ounces) moonshine", "&nbsp;", "<strong>Simple Syrup</strong>", "2/3 cup (5 ounces) organic cane sugar ", "2/3 cup (5 fluid ounces) water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Simple Syrup:</strong> Combine the sugar and water in a small saucepan and bring to a simmer over medium-high heat, stirring until the sugar dissolves and the mixture is transparent. Turn off the heat and let cool. Add any spices before the mixture starts to simmer; add any herbs only after you’ve turned off the heat. Store plain and infused syrups in sealed containers in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Pops:</strong> Pick out any stems or leaves from the blueberries and purée them in a food processor. You should have about 21/4 cups (18 ounces) of purée.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the puréed blueberries, simple syrup, and lemon juice in a bowl or measuring pitcher with a pouring spout. Taste; the precise amount of simple syrup and lemon juice needed will depend on how sweet the berries were to begin with. Be aware that blueberries are one of the rare fruits that you don’t want to oversweeten because they tend to get sweeter as they freeze. Stir in the moonshine.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you wish, now is the time to strain out the skins by pressing the gloppy blueberry mixture though a colander or sieve using a wooden spoon, a rubber spatula, or your fist (blueberries stain skin, so those choosing the third route might want to wear gloves). Or don’t, and leave them in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into your ice pop molds, leaving a little bit of room at the top for the mixture to expand. Insert sticks and freeze until solid, 4 to 5 hours. Unmold and transfer to plastic bags for storage or serve at once.<br />\n</p>"}]}