{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/2012101-224686-cranberry-apple-slab-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["apple pies", "cranberries", "pie of the week", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Cranberry Apple Slab Pie", "link": "https://www.seriouseats.com/recipes/2012/10/cranberry-apple-slab-pie-recipe.html", "description": "If you're baking for a crowd, slab pies are a delicious and practical way to go. For this fall-forward recipe, apples and cranberries simmer in their own juices beneath a sweet and savory oatmeal crumble.", "totalTime": "4 hours (not including pie crust dough)", "recipeYield": "serves 16", "recipeCategory": ["Christmas", "Cranberry", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles", "Thanksgiving"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">2 recipes Easy Pie Dough</a> shaped in a rectangular block and chilled for at least two hours, ideally overnight", "4 ounces (about 3/4 cup) rolled oats", "1 ounce (about 3 tablespoons) all purpose flour", "4 ounces (about 7 tablespoons) light brown sugar", "Big pinch of salt", "3 ounces (6 tablespoons) unsalted butter, cold and cut into 1/4 inch pieces", "10 to 12 medium fresh apples (such as golden delicious or Granny Smith), peeled and cored", "6 ounces fresh cranberries", "8 ounces granulated sugar", "1 teaspoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shape the dough</strong>: Line a 12- by 17-inch rimmed baking sheet with a 12- x 22-inch piece of parchment paper, creasing the paper along the bottom edges and allowing excess paper to hang over the ends of the baking sheet. Lightly flour a rolling pin and your work surface and roll the dough into a rectangle large enough to completely line the bottom and sides of the baking sheet. Press the dough over the parchment and crimp the edges along the walls. Chill the shaped dough on the sheet for one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the crumble</strong>: In a large bowl, combine the oats, flour, brown sugar, and salt and whisk to combine. Add the cold butter. Use your fingers to rub the dry ingredients into the butter until it is well combined. Chill the crumble at least one hour before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the pie</strong>: Adjust oven rack to lower middle position and preheat oven to 425&deg;F. Cut the cored and peeled apples in half down the axis (from top to bottom). Place the flat side of the apples down on the cutting board and slice the apples into 1/4-inch thick pieces. In a small bowl, whisk together sugar and cinnamon. Sprinkle approximately half the sugar mixture over the bottom the chilled, shaped pie shell. Sprinkle half (approximately 3 ounces) of the fresh cranberries over the bottom, then roughly chop the remaining cranberries, just enough to puncture each one. Pack the apple slices into the shell so they are resting on their flat sides. Toss the chopped cranberries with the sugar, then sprinkle cranberries and the rest of the sugar evenly over the top. Break up the chilled crumble into small pieces and sprinkle over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bake the pie:</strong> Bake the pie at 425&deg;F for 20 minutes, then rotate, cover the filling loosely with foil, and turn the heat down to 375&deg;F. Bake until the filling is bubbling in the center and the crumble and crust are a golden brown, 50 to 55 minutes longer. Allow the pie to cool completely in the pan before serving.</p>"}]}