{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/18641520120107-sunday-supper-pork-loin-milk-cream-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cream", "milk", "pork", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Braised in Milk and Cream", "link": "https://www.seriouseats.com/recipes/2012/01/pork-braised-in-milk-and-cream.html", "description": "When searching in my kitchen for things to toss into my braising dish, milk and cream are not the first to jump out.  But after a few conversations with a dear friend I was inspired to look into recipes for pork braised in milk and cream.  The final product is moist and tender, and the milk and cream create a thick, curdled, porky sauce that is unlike anything I have ever tasted before.", "totalTime": "4 hours 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Pork", "Sunday Supper"], "recipeIngredient": ["2 tablespoon butter, divided", "1 tablespoon olive oil", "1 2-3 pound boneless pork loin roast", "10 sage leaves, thinly sliced", "zest from 1/2 lemon", "1 cup cream", "1/2 cup milk", "kosher salt and cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1 tablespoon butter and olive oil over medium high heat and season pork loin on all sides with salt.  When butter foam has subsided, add pork loin and brown on all sides, about 3 minutes per side.  Remove pork and pour out excess butter.  Place pan back on heat and add remaining butter and sage leaves; cook for about 4 minutes, or until sage is fragrant.  Add lemon zest and return pork loin to pot.  Pour milk and cream over pork and bring to a simmer; once pork has simmered, turn heat down to medium low and cover loosely with lid.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer partially covered over low heat for 4 hours, turning roast every 30 minutes.  At the end of 4 hours remove lid; the remaining sauce should be thick, and beginning to look curdled.  Cook an additional 30 minutes, uncovered, keeping a close eye on the sauce; it will begin to take on a beige color.  Once sauce has thickened, remove roast and let sit for 10 minutes. Season the sauce to taste with salt and pepper and serve with spätzle, or egg noodles and some sautéed leeks.</p>"}]}