{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120826-chichi-nasty-bits-pork-neck.JPG", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Thai", "keywords": ["chichi's chinese", "moo yang", "pork", "pork neck", "tamarind sauce", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai Style Grilled Pork Neck", "link": "https://www.seriouseats.com/recipes/2012/09/grilled-pork-neck-thai-style-recipe.html", "description": "This marinated grilled pork neck with a tart and spicy tamarind dipping sauce is a easy way to bring some powerful Thai flavor to the table, and it's perfect for a summer cookout!", "totalTime": "30 minutes, plus overnight marination", "recipeYield": "four to six", "recipeCategory": ["Mains", "Pork", "Thai", "The Nasty Bits"], "recipeIngredient": ["1/4 cup plus 1 teaspoon fish sauce, divided", "2 tablespoons soy sauce", "4 tablespoons brown sugar, divided", "1 tablespoon juice from one lime", "3 pounds pork neck, belly, or shoulder, cut into 2-inch chunks", "4 ounces dried tamarind (see note)", "1 teaspoon fish sauce", "1 bird's eye chili, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small mixing bowl, combine 1/4 cup fish sauce, soy sauce, 3 tablespoons brown sugar, and lime juice. Place pork neck in a nonreactive container, then pour in all the marinade and mix to distribute evenly. Cover, refrigerate, and allow to marinate at least overnight and up to 2 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice tamarind into a few pieces. Place the pieces in a small bowl and add 1 cup boiling water. Let soak for 20 minutes, then mash the tamarind with your fingers. Pour the mash and its liquid into a strainer placed over an empty bowl. Press down on the tamarind pulp with your fingers until only the seeds and fiber are left in the strainer. Discard the contents of the strainer. Add remaining fish sauce and sugar along with sliced chilis and mix to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork from marinade and pat dry with a paper towel. Grill the pieces of pork over indirect heat in a covered grill, until meat is tender and the surface is charred, about 45 minutes. Alternatively, place pork on a foil-lined rimmed baking sheet, cover with foil, and roast in a pre-heated 350°F oven until tender and charred, about 45 minutes. Let rest 20 minutes, then slice and serve with tamarind sauce.</p>"}]}