{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120301-195206-pate-sucree-610x458-19.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pastry", "pate sucree", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pâte Sucrée (Sweet Tart Dough)", "link": "https://www.seriouseats.com/recipes/2012/03/pate-sucree-tart-shell-recipe.html", "description": "Pâte sucrée is the sweet, crumbly French tart dough used for baking the bases of sweet tarts. The dough is chilled twice, once after mixing and again once it has been shaped in a tart pan. This recipe makes enough dough for two tarts. Make one now, and freeze the rest of the dough for next time.", "totalTime": "4 hours", "recipeYield": "makes 2 tart shells", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["8 ounces (2 sticks) butter", "6 ounces granulated sugar", "2 teaspoons salt", "16 ounces (about 3 1/4 cups) all purpose flour", "1 egg", "1 egg yolk", "1.2 ounces heavy cream", "1 tablespoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift flour and set aside. In the bowl of a stand mixer fitted with a paddle attachment, cream the butter and sugar on high speed until light and fluffy, stopping regularly to scrape down the sides, bottom and paddle, about 8 minutes. Add the egg and yolk one at a time, and beat well between additions. Scrape one more time, then give it a good final mix on high speed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the mixer. Add the flour, salt, cream and vanilla. Mix on low until the dough comes together. Finish mixing by hand with a large rubber spatula. Divide the dough into two flat, round disks. Double wrap tightly in plastic wrap and chill for at least two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 hour before baking, roll out the dough on a heavily floured surface, until it is just shy of 1/4-inch thick. Roll the dough back onto the rolling pin, then gently roll it out over the tart pan. Press the dough into the pan to shape it, then cut off the excess, leaving 1/4-inch of overhang. Chill for one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat the oven to 350&deg;F. Remove the tart shell from the fridge, trim the overhang off of the edge of the tart, patch any thin parts or cracks with excess dough. Line the tart shell with foil and fill with weights or beans. Place the tart in the center of the bottom rack of the preheated oven. Bake for 20 minutes, rotating halfway through. Remove the weights and foil, and continue to bake until the bottom is golden brown, about 15-20 additional minutes. Cool the shell completely before removing from the pan or filling.</p>"}]}