{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121128-231780-bar-bites-slit-chestnuts.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "chestnuts", "quick", "snacks", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oven Roasted Chestnuts with Spiced Melted Butter", "link": "https://www.seriouseats.com/recipes/2012/12/oven-roasted-chestnuts-with-spiced-melted-butter-recipe.html", "description": "Served as is, or dipped in melted butter, warm roasted chestnuts are indeed creamy, nutty, and sweet. And when paired with a snifter of brandy, or even a shot of whiskey, roasted chestnuts can make for a wonderfully warming winter snack.", "totalTime": "45 minutes", "recipeYield": "Serves 2 to 4 as a snack", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Christmas", "Nuts", "Snacks", "Vegetarian"], "recipeIngredient": ["8 cups water", "1 pound fresh chestnuts, rinsed and dried", "4 tablespoons unsalted butter (1/2 stick)", "1 cinnamon stick", "1/8 teaspoon salt", "1/8 teaspoon sugar", "Pinch of freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large cast iron pan in the oven and pre-heat the oven to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a boil in a large saucepan over high heat. While the water is heating, carve an \"X\" into the rounded side of each chestnut with a serrated knife. Cut through the shell only, being careful not to cut too deep into the nut itself.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water reaches a boil, quickly blanch the slit chestnuts for 30 seconds. Drain and dry the chestnuts, then transfer them, \"X\" side up, to the heated skillet in the oven. Roast the chestnuts for 25-30 minutes, just until the shell starts to curl away from the nut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the nuts to a large cutting board and cover loosely with a kitchen towel. Set aside just until the nuts are cool enough to handle&mdash;the nuts will be easier to peel while they are still warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the skillet on the stovetop and add the butter, cinnamon stick, salt, sugar, and nutmeg. The skillet should still be hot enough to melt the butter. Stir everything until the butter is completely melted, then transfer the butter mixture to a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your fingers, peel away the shells and brown skins of the chestnuts. If any brown skin clings to the nuts, a paring knife can be used to peel them away. You can choose to toss the peeled chestnuts in the melted butter, or serve the butter on the side. Serve the chestnuts while still warm.</p>"}]}