{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121017-dt-salties-late-summer-roasted-tomato-soup-with-fregola-and-kale.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "saltie", "soup", "tomato", "tomato soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Saltie Sandwich Shop's Late-Summer Roasted Tomato Soup with Fregola and Kale", "link": "https://www.seriouseats.com/recipes/2012/10/saltie-sandwich-shops-late-summer-roasted-tom.html", "description": "While October might be pushing it for \"late summer,\" farmers' markets can still be counted on for inexpensive, past-their-prime tomatoes. And those are perfectly suited for the treatment they get in this wonderful soup, from the Saltie cookbook: a slow roast with olive oil to concentrate their acidity and sweetness. Along with garlic, sage, and rosemary, they're the heart of this spare and satisfying soup.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Soups and Stews", "Tomato", "Vegetarian"], "recipeIngredient": ["12 Roma tomatoes, cored and cut in half lengthwise", "Extra-virgin olive oil, as needed", "Salt to taste", "2 cups fregola (or substitute Israeli cous cous, farro, or another grain)", "12 cloves garlic, sliced", "6 sprigs rosemary", "6 leaves fresh sage", "1 bunch kale"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 degrees Fahrenheit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the tomatoes skin-side down on a baking sheet and drizzle evenly with olive oil (leave plenty of room to allow them to caramelize). Season generously with salt and roast until concentrated and charring a little on the edges, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, boil the fregola (or substitute) in salted water until al dente, then drain and toss with a little more oil to keep it from sticking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bottom of a large heavy soup pot, heat 3 tablespoons of olive oil over medium heat until shimming. Add the garlic and cook until golden, about 3 minutes, then add the rosemary and sage (they will sizzle) and cook until fragrant, about a minute longer. Stir in the roasted tomatoes along with 4 cups of water and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the kale and season to taste with salt. Simmer until the kale is tender, about 10 minutes, then add the cooked fregola. Laddle into bowls, sprinkle with sea salt, and serve with a drizzle of olive oil.</p>"}]}