{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/02012-185998-banana-cream-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["banana", "cream pie", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "5"}, "name": "Banana Cream Pie", "link": "https://www.seriouseats.com/recipes/2012/01/best-ever-banana-cream-pie-classic-recipe.html", "description": "This is my go-to recipe for banana cream pie. I promise that you won't be sorry that you took the time to make the pudding by hand&mdash;it blows boxed pudding away, there is simply no comparison. I like to blind bake the crust to a crispy golden brown, then remove it from the pie plate for a freestanding pie that is easy to slice or give away.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Banana", "Desserts", "Pies, Tarts, and Crumbles", "Puddings and Custards"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "16 ounces whole milk", "1 vanilla bean (split and scraped) or 1 tablespoon vanilla", "5 ounces sugar, divided evenly", "2 eggs", "3 egg yolks", "2.5 ounces cornstarch", "1 teaspoon salt", "4 tablespoons butter, cut into half inch pieces", "4 bananas, sliced into 1/8 thick rounds", "6 ounces heavy cream, whipped to soft peaks and chilled", "Topping: 1 cup heavy cream whipped with 2 tablespoons confectioner's sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape and chill the pie crust. Wet the surface of a sheet tray with sides and line it with plastic wrap, with additional plastic wrap close at hand. In a large saucepan, whisk together the milk, vanilla (pod and seeds if using the vanilla bean), and half the sugar. Set aside. In a large bowl, whisk together eggs, yolks, and salt until lightened. In a separate bowl, whisk together remaining sugar and cornstarch, then add to the eggs, whisking constantly. Whisk for two minutes, until egg mixture is pale and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the milk mixture over medium heat and bring it just to a boil. Turn off the heat, and temper the egg mixture with the hot milk mixture in four additions, whisking constantly as you add the hot liquid to the egg mixture. Return the mixture to the pot and whisk constantly over medium-low heat until it begins to thicken and sputter. Once it begins to sputter, whisk two additional minutes, then turn off the heat and continue whisking as you add the butter. Whisk until the butter is completely melted and combined, then pour the pudding into the lined sheet tray. Spread it evenly to cool, then cover the surface directly with plastic wrap. Allow it to come to room temperature, then transfer to a sealed container and refrigerate for at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. Line the chilled pie crust with parchment or foil and fill with weights (I reuse dried beans for this purpose). Bake the pie for 15 minutes, rotating halfway through, then remove the weights and lining and bake on the lower rack until the bottom of the crust is a golden brown. Remove from the oven and allow the shell to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to assemble, whisk the pudding until it becomes smooth and supple. Fold in the cold whipped cream. Spread a third of the pudding over the bottom of the crust, then top with a layer of bananas, then repeat, reserving bananas for garnish (do not make the top layer bananas, they will become brown and unsightly). Top with additional whipped cream and bananas, sliced right before serving.</p>"}]}