{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120816-fiaf-petits-pois-a-la-francaise.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French in a Flash", "peas", "quick", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Seared Cod with Peas, Pancetta, and Wilted Lettuce", "link": "https://www.seriouseats.com/recipes/2012/08/seared-cod-with-peas-pancetta-and-wilted-lettuce-petits-pois-a-la-francaise-recipe.html", "description": "A crispy, flaky piece of cod sits on a mountain of French-style peas, cooked with pancetta, parsley, crème fraîche, and lettuce.", "totalTime": "15 minutes", "recipeYield": "4 servings", "recipeCategory": ["Fish", "French", "Legumes", "Mains"], "recipeIngredient": ["2 tablespoons olive oil", "4 cod or hake filets (about 6 ounces each)", "Kosher salt and freshly ground black pepper", "4 ounces diced pancetta", "4 cups thawed frozen peas", "1 head of baby gem or romaine lettuce, finely sliced (about 2 cups)", "2 tablespoons of chopped flat leaf parsley, plus extra for garnish", "4 tablespoons crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large nonstick skillet, heat the olive oil over high heat until shimmering. Season the cod with salt and pepper and place presentation-side-down in the hot skillet.  Cook without moving until the fish takes on a nice golden crust and lifts easily from the spatula, about 4 minutes. Carefully flip fish with a thin metal spatula and cook on second side until cooked through, about 1 minute longer. Remove skillet from heat and transfer cod to a paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pancetta to the same skillet, and return to medium-high heat.  Cook, stirring frequently, until pancetta starts to become crisp, 2 to 3 minutes. Add the peas and warm through, stirring often. Add 2 tablespoon of water, lettuce, parsley, and crème fraîche. Stir over the heat until the crème fraîche has melted and the lettuce is just beginning to wilt. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To plate, make a bed of the peas. Top with the cod. Garnish with more parsley.</p>"}]}