{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120223-pieoftheweek-smorespie-primary.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "marshmallow", "pie", "s'mores"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "S'mores Pie", "link": "https://www.seriouseats.com/recipes/2012/03/smores-chocolate-marshmallow-pie-recipe.html", "description": "This s'mores pie can't recreate the experience of hanging out around the campfire with your friends, but it does come close. From the graham cracker crust to the luscious chocolate filling and the bruleed marshmallow topping, it's the next best thing to an actual s'more.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Chocolate", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For The Crust:</strong>", "15 graham crackers, finely ground to crumbs in the food processor", "1/2 teaspoon salt", "3 tablespoons sugar", "2 ounces melted butter", "&nbsp;", "<strong>For The Filling:</strong>", "4 ounces bittersweet chocolate, melted", "17 ounces whole milk", "5 ounces granulated sugar, divided", "1/2 teaspoon salt", "1.4 ounces cornstarch", "1 egg", "3 egg yolks", "&nbsp;", "<strong>For The Topping:</strong>", "1 egg white", "1 pinch cream of tartar", "1 pinch salt", "2 teaspoons gelatin powder", "1/4 cup cold water", "7 ounces granulated sugar", "2.6 ounces light corn syrup", "2.6 ounces water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the crust:</strong> Combine all ingredients for crust in the food processor. Pulse until completely combined. Pour contents into a spring form pan and press with your fingers to form a crust that comes up 2 inches around the edge. Chill in refrigerator until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the filling:</strong> Melt chocolate and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together half of the sugar and the cornstarch. In a separate bowl, whisk together eggs and yolks. Combine the two mixtures and whisk until the egg mixture is smooth and light, about one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the milk, the other half of the sugar, and the salt in a medium saucepan. Bring the milk to a simmer and temper the eggs with the hot milk mixture in small additions, whisking constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the mixture back to the saucepan and set over medium heat, whisking constantly. The mixture will begin to thicken; continue to whisk. When it begins bubbling, whisk for an additional 2 minutes, then remove from heat. Whisk in the chocolate, then pour the mixture into the prepared crust and press plastic wrap directly on top. Chill for 3 hours, until set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the topping:</strong> When you are ready to serve, combine the egg white, salt and cream of tartar in the bowl of a stand mixer fitted with a whisk attachment and whisk until frothy. Bloom the gelatin in the 1/4 cup of water and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sugar, corn syrup, and water in a medium sized saucepan over medium heat. Bring the mixture to 240&deg;F. Immediately whisk in the bloomed gelatin (careful, it will sputter), then turn the mixer up to high speed and slowly pour the hot mixture down the side of the bowl. Whisk on high until the mixture becomes light, gooey, and thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pipe or spoon over the chilled pie. Brulee the top with a culinary torch or under the broiler in the oven. Serve immediately.</p>"}]}