{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/224882-20121010-british-bites-cottage-pie-sherry-shallots.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["beef", "british", "british bites", "cottage pie", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cottage Pie with Shallots and Sherry", "link": "https://www.seriouseats.com/recipes/2012/10/cottage-pie-with-shallots-and-sherry-recipe.html", "description": "When the leaves begin to turn brown and the evenings get darker, simple, hearty casseroles like cottage pie start to grace supper tables.  Originally a way to use up scraps of meat leftover from a previous meal, cottage pie is now more commonly made with ground meat, but sometimes made with something braised.", "totalTime": "1 hour 10 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "British Bites", "Mains", "Potato"], "recipeIngredient": ["1 1/2 pounds russet potatoes (about 3 large) peeled and cut into rough 1-inch cubes", "1/2 cup milk ", "3 tablespoons butter ", "Kosher salt ", "3 medium shallots, finely chopped (about 3/4 cup)", "2 bay leaves ", "2 teaspoons picked fresh thyme leaves", "2 ribs celery, finely chopped (about 1 cup)", "2 medium carrots, finely chopped (about 1 cup)", "1 tablespoon tomato poaste ", "1/2 cup sherry ", "2 pounds ground beef  ", "1 cup low sodium homemade or store-bought chicken or beef broth", "Freshly ground black pepper", "1 cup frozen peas, thawed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 375°F. Cover potatoes with cold water and bring to a simmer; cook until potatoes are soft, about 10 minutes. Drain potatoes and place back in the pot. Add milk and butter and mash with a potato masher. Season to taste with salt and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a large stainless steel skillet over medium high heat. Add shallots, bay leaves, and thyme, and cook, stirring, until shallots begin to soften, about 5 minutes. Add celery and carrots and continue to cook, stirring, until carrots begin to soften, about 4 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomato paste and cook, stirring, until vegetables are evenly coated with paste, then add sherry and cook until sherry is reduced by half, about 6 minutes. Add beef and mix with a wooden spoon until vegetables and meat are evenly incorporated and beef has begun to brown, about 5 minutes. Add broth and bring to a simmer, stirring often to break up the meat.  Simmer meat mixture until liquid has thickened and reduced by half and meat has cooked through, about 20 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer meat mixture to bottom of 8- by 11-inch baking dish. Spread peas over meat mixture, then spread mashed potatoes over top of peas and meat. Smooth potatoes and decorate with the tines of a fork.  Bake until top of potatoes begins to brown, about 35 minutes. Let rest 5 minutes, then serve.</p>"}]}