{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120823-127677-LatAmCuisine-Salpicon-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Latin Cuisine", "keywords": ["beef", "latin cuisine", "nicaraguan cuisine", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salpicón (Nicaraguan Minced Meat)", "link": "https://www.seriouseats.com/recipes/2012/08/salpicon-nicaraguan-minced-meat-recipe.html", "description": "<em>Salpicón</em> is a traditional dish in Nicaragua, simply made by simmering cubes of lean beef in water with onions, green bell peppers, garlic, salt, and black peppercorns. Once cooked through, the vegetables are tossed out with the broth and the beef is finely chopped with fresh onions and bell peppers, then finished off with a squeeze of lime juice. It's a rather healthy dish, especially when compared to many of our other national favorites that just love being submerged in sizzling lard or oil.", "totalTime": "1 hour", "recipeYield": "serves 6", "recipeCategory": ["Beef", "Latin American", "Latin Cuisine", "Mains"], "recipeIngredient": ["2 pounds beef round, cut into 1 1/2 inch cubes", "1 large green bell pepper, cored, seeded, and cut into 1 inch pieces", "1 large white or yellow onion, peeled and cut into 1 inch pieces", "Kosher salt", "2 teaspoons black peppercorns", "4 medium garlic cloves, peeled and smashed", "Cold water", "1 lime", "4 tablespoons unsalted butter (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beef, 1/2 bell pepper, 1/2 onion, 2 teaspoons salt, peppercorns, and garlic in large pot. Add enough cold water to cover ingredients by 2 inches. Bring mixture to boil over medium-high heat, then, immediately reduce heat to medium-low and simmer until beef is cooked through, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain beef in sink, and remove and discard bell pepper pieces, onion pieces, peppercorns, and garlic. Cool 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half of beef, half of remaining bell pepper, and half of remaining onion in food processor and pulse until mixture is finely chopped. Transfer to large mixing bowl and repeat with remaining beef, bell pepper, and onion. Season squeeze lime over beef and toss to combine. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Salpicón may be served immediately (see note for serving suggestions) or toasted slightly in skillet: Melt butter in large skillet over medium-high heat. Add beef and cook, stirring, until beginning to crisp and dry out, about 15 minutes. Serve.</p>"}]}