{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120625-fiaf-spinach-boursin-dip-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["dip", "French in a Flash", "spinach artichoke dip", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Boursin and Gruyère Spinach and Artichoke Gratin Dip", "link": "https://www.seriouseats.com/recipes/2012/06/boursin-and-gruyere-spinach-and-artichoke-gratin-dip-recipe.html", "description": "A ton of spinach and artichokes get stuffed into a dippable gratin full of nutty Gruyère and ever-flavorful garlic and herb Boursin. Served with baguette chips, it's a French-American crowd pleaser.", "totalTime": "20 minutes", "recipeYield": "serves 6 to 8 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "French", "Vegetarian"], "recipeIngredient": ["2 baguettes, thinly sliced", "A drizzle of olive oil", "1 pound frozen chopped spinach, thawed with the liquid pressed out", "1 (14-ounce) can artichoke hearts, drained and finely chopped", "2 tablespoons dry white wine", "5 1/2 ounces garlic and herb Boursin, room temperature", "8 ounces cream cheese, room temperature", "2 cups coarsely grated Gruyère, divided", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F.  Arrange baguette slices in an even layer on a baking sheet (you will need at least two baking sheets).  Drizzle very lightly with olive oil, and toast until crisp and golden around the edges, about 10 to 12 minutes.  Repeat with any remaining baguette slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase oven temperature to 400°F. In a large bowl, stir together spinach, artichokes, wine, Boursin, cream cheese, and 1 cup of Gruyère.  Season with salt and pepper, and mix until thoroughly combined. Spread mixture in a baking or gratin dish large enough to hold everything. Top with the remaining cup of Gruyère. Bake for 15 minutes. Then, turn on the broiler, and broil just until the top is golden brown. Serve hot and bubbling with baguette chips.</p>"}]}