{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120925-223546-cook-the-book-pork-chops-with-apple-chutney.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["apple", "chutneys", "Cook the Book", "eli sussman", "max sussman", "pork chops", "this is a cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Max and Eli Sussman's Pork Chops with Apple Chutney", "link": "https://www.seriouseats.com/recipes/2012/09/max-and-eli-sussmans-pork-chops-with-apple-ch.html", "description": "Anyone who thinks a pork chop is \"a flavorless hunk of chewy meat\" (as <strong>Max and Eli Sussman</strong> put it) have yet to try a double-cut chop prepared steakhouse-style. Seriously, the double-cut chop could change just about anyone's mind when it comes to leaner cuts of pork. The width of the chop and presence of the bone allows it to be cooked long enough to develop a crust while staying juicy and tender on the inside. In <em><a href=\"http://www.amazon.com/This-Cookbook-Recipes-Real-Life/dp/1616282142?tag=serieats-20\">This is a Cookbook</a></em>, the Sussman brothers add extra insurance by brining these extra-large chops overnight before searing them off while basting in herb butter.", "totalTime": "24 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Apple", "Cook the Book", "Gluten-Free", "Mains", "Pork"], "recipeIngredient": ["<strong>For the Brine</strong>", "2/3 cup sugar", "2/3 cup salt", "1 fresh thyme sprig", "1 fresh rosemary sprig", "1 teaspoon whole black peppercorns", "1 teaspoon coriander seeds", "Ice cubes", "&nbsp", "3 bone-in, double-cut pork chops, about 4 pounds total weight", "1 tablespoon canola oil", "2 tablespoons unsalted butter", "1 fresh rosemary sprig", "1 fresh thyme sprig", "1 garlic clove, peeled and crushed", "<a href=\"http://www.seriouseats.com/recipes/2012/09/max-and-eli-sussmans-apple-chutney.html\">Apple Chutney</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the brine, in a large saucepan, bring 2 quarts water to a boil over high heat. Add the sugar and salt and stir until dissolved. Stir in the herb sprigs, peppercorns, and coriander  seeds and remove from<br />\r\nthe heat. Add about 2 quarts ice and stir to melt. Refrigerate until completely cooled, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pork chops to the brine and weight down with plates or heavy canned goods. Let brine in the fridge for 24 hours. Remove the chops<br />\r\nand pat dry with paper  towels. Let come to room temperature for at least<br />\r\n1 hour before cooking (this will help the chops cook evenly throughout).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large frying pan, heat the oil over medium  heat. When the oil is hot, sear the chops until they are nicely browned on both sides, about<br />\r\n4 minutes per side. Add the butter to the pan, reduce the heat to medium-low,  and let the butter melt. Using a large spoon, baste the chops with butter constantly for about 5 minutes, tilting the pan as needed, and using tongs to flip the chops about every 2 minutes. Add the herb sprigs and garlic clove during the last 2 or 3 minutes of cooking to infuse the pan juices with their flavors. Cook until an instant-read thermometer inserted into the thickest part of each chop away from bone registers 125 degrees. Transfer the chops to a platter, cover loosely with foil, and let rest for 10 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, carve the meat off the bone into thick slices. Arrange the slices on dinner plates. Stir any juices left on the platter into the pan<br />\r\nsauce and drizzle over the top. Spoon some chutney on top or alongside<br />\r\nand serve right away.</p>"}]}