{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120123-189558-sumo-wrestler-stew.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "Cree LaFavour", "Poulet", "soup", "udon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Poulet's Sumo Wrestler Stew (Chankonabe)", "link": "https://www.seriouseats.com/recipes/2012/01/poulets-sumo-wrestler-stew-chankonabe.html", "description": "This <strong>Sumo Wrestler Stew</strong> or <em><strong>Chankonabe</strong></em> from <em><strong><a href=\"http://www.amazon.com/Poulet-Cree-LeFavour/dp/0811879690/?tag=serieats-20\">Poulet</a></strong></em> is a traditional method of carbo-loading for Japan's massive wrestlers.  It's a hearty, bursting bowl of soup filled with rice, udon noodles, chicken thighs, tofu, and a load of good-for-your veggies.  But even if you're not about enter the <em>dohyō</em> (that's a sumo ring), it's a fantastically filling bowl of soup and perfect for winter.", "totalTime": "1 hour 15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Soups and Stews"], "recipeIngredient": ["2 burdock roots, peeled and thinly sliced (optional)", "8 ounces udon noodles ", "2 tablespoons peanut oil", "1 leek, white and light green parts only, cut into thin rounds", "3 ounces shiitake mushrooms, brushed clean, stemmed and sliced ", "4 bone-in chicken thighs, skin removed", "8 cups chicken stock ", "1 sheet kombu seaweed", "One 6-inch piece daikon or 6 radishes, thinly sliced", "1 tablespoon white miso paste", "1 tablespoon red miso paste", "1 tablespoon mirin", "1 tablespoon soy sauce, plus more if needed", "2 carrots, peeled and cut into 1/2-inch rounds", "6 small red potatoes, scrubbed and cut into 1/2-inch rounds", "2 cups coarsely chopped napa cabbage ", "2 heads baby bok choy, trimmed and cut lengthwise into ribbons", "1/2 red bell pepper, cut lengthwise into pinkie-width strips", "1/2 orange bell pepper, cut lengthwise into pinkie-width strips", "4 eggs ", "Jasmine Rice  ", "7 ounces firm tofu, cut into 1-inch cubes", "1/4 cup fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using the burdock, rinse under cold water. Put in a large bowl, cover with cold water, and soak for 20 minutes, changing the water once about halfway through. Cook the noodles according to the package directions, rinse, and set aside. They need not be kept hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of the oil in a 12-inch or larger cast-iron sauté pan or 5-quart or larger Dutch oven over medium heat. Add the leek and cook until soft and just beginning to color on the edges, about 5 minutes. Transfer to a plate and add the mushrooms to the same pan. This time, turn the heat up high to get some of the moisture out of the mushrooms. After 5 minutes or so, when you can really smell them cooking, transfer the mushrooms to the plate with the leek.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 1 tbsp oil to the pan over medium heat. Working in batches, lay the chicken pieces skin-side down in the hot oil. Cook for 10 minutes, or until the chicken is browned on both sides, turning the pieces frequently to prevent sticking. Set the chicken aside on a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan or stockpot over medium heat, combine the stock, kombu, and daikon. Bring to a gentle simmer, cover, and cook for 20 minutes. Turn off the heat and remove the kombu. Add the red and white miso paste along with the mirin and soy sauce, stirring to thoroughly dissolve the miso pastes. Taste the broth. It should be potent and a little salty. If you think it might need salt, it probably does. Add more soy sauce a little at a time until it tastes just the way you like it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the browned chicken thighs, the carrots, the potatoes, and the cabbage to the pan. Cover and simmer over low heat for 15 minutes, or until the potatoes are tender. Add the bok choy and bell peppers. Keeping the heat low, cook for 5 more minutes, then carefully crack the eggs onto the surface of the barely-simmering broth. Poach the eggs for 3 to 5 minutes, or until the whites set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide rice among 4 large bowls. Add a handful of udon noodles to each and arrange the noodles to make a nest. Using a slotted spoon, place a poached egg carefully in each nest. Scatter one-fourth of the tofu cubes into each bowl. Next, ladle the simmering broth, along with plenty of vegetables and a chicken thigh, around the egg in each bowl. Finish by sprinkling on the chives. The bowls should be beautiful, plentiful, and memorable.</p>"}]}