{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121212-233601-candyc-cane-cream-puff.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["candy canes", "cream puffs", "holiday desserts", "pate a choux"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Candy Cane Cream Puffs", "link": "https://www.seriouseats.com/recipes/2012/12/candy-cane-cream-puffs-recipe.html", "description": "Cream puffs? For Christmas? These once-dainty treats are super-sized and mint-ified for the holidays, making for a perfect addition to your seasonal table.", "totalTime": "90 minutes", "recipeYield": "6 to 8 monster cream puffs", "recipeCategory": ["Desserts", "Pastry"], "recipeIngredient": ["<strong>For the Pastry</strong>", "1/2 cup butter, cut into 1-inch slices", "1 cup water", "2 teaspoons sugar", "1/4 teaspoon salt", "1 (5 ounces) cup flour", "4 large eggs", "&nbsp", "<strong>For the Pastry Cream</strong>", "2 cups whole milk", "4 egg yolks", "2 tablespoons flour", "2 tablespoons cornstarch", "6 tablespoons sugar", "1/4 teaspoon salt", "1 tablespoon unsalted butter, softened, cut into chunks", "1/2 teaspoon vanilla", "1/2 teaspoon mint extract", "1/4 cup crushed candy cane pieces - about 8 large candy canes", "1/4 cup powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pastry</strong>: Center two racks in the middle of the oven and preheat to 425°F. Line 2 baking sheets with parchment paper. Prepare a pastry bag with a large, round tip. If you don't have a pastry bag, use a zipper-lock bag with the corner cut off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter, water, sugar, and salt in a pot and bring to boil over medium heat. Sprinkle in the flour and stir quickly with a wooden spoon. Stirring constantly, cook until the dough forms a ball and pulls away from the sides of the pan and there is no more water pooled at the bottom, about 2 minutes. Remove from heat and let sit for 2 minutes, stirring four or five times to keep the dough from sticking to the bottom of the hot pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a large bowl. Using an electric mixer, beat in the eggs one at a time. After all eggs are added, keep beating until the dough is a uniform consistency; it should be sticky and form soft peaks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the dough into a pastry bag or large zip-top bag with a big corner snipped off. Pipe the dough onto the prepared baking sheet in 3-inch round mounds, standing about 2-inches tall. Make sure to leave 2-inchs of space between the pastries. You should have enough dough for 6 to 8 puffs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the baking sheet into the oven and bake for 15 minutes, then reduce the heat to 375°F and bake until pastries puff up and are golden brown, about 30 minutes longer. Remove from oven and let cool completely on the baking sheet. Once completely cool, cut the puffs in half length-wise using a serrated bread knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pastry Cream</strong>: In a heavy-bottomed 3-quart pot, whisk the milk and egg yolks together. Set aside. In a small bowl, sift together the flour, cornstarch, sugar, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook milk and egg mixture over medium heat, stirring constantly, just until bubbles form around the edges and the surface starts to steam. Sprinkle in the flour mixture, whisking quickly to break up any lumps. Bring the pastry cream just to a boil, stirring constantly and scraping bottom to ensure it is not burning. Reduce heat to low. Cook until the cream thickens and heavily coats the back of a spoon, about 2 minutes. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the butter, vanilla, and mint extract, mixing until fully incorporated. Let pastry cream cool completely before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Constructing the Cream Puffs</strong>: Remove the top half of the pastries and spoon pastry cream into the bottom portion of the puff pastry, filling it up as much as you can without it spilling over the sides. You can also use a pastry bag fitted with a very large star tip to pipe the cream into the pastry in a tall, spiraling tower. Sprinkle the top and sides of the pastry cream with candy cane bits. Replace the top of the cream puff and dust the top with powdered sugar. Serve immediately, or store in the refrigerator, covered, for up to 3 hours.</p>"}]}