{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120208-192302-dinner-tonight-creamy-braised-greens-chicken-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "Dinner Tonight", "Mexican", "poblano peppers", "Rick Bayless"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Creamy Chicken and Greens with Roasted Poblano and Caramelized Onion", "link": "https://www.seriouseats.com/recipes/2012/02/creamy-chicken-and-greens-with-roasted-poblano-caramelized-onions-recipe.html", "description": "...", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains", "Mexican"], "recipeIngredient": ["2 fresh poblano chiles ", "3 tablespoons olive oil ", "3 medium boneless, skinless, chicken breast halves (about 1 1/4 pounds total) ", "Salt", "1 medium white onion, sliced 1/4-inch thick ", "3 garlic cloves, minced", "5 cups stemmed and coarsely chopped greens (Swiss chard and spinach work well) ", "1 cup chicken broth ", "1 cup Mexican crema (or creme fraiche)", "12 corn tortillas, warmed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Char the poblanos over an open flame on the stovetop or 4 inches underneath the broiler, flipping occasionally until blackened all over (about five minutes for the burner, 10 minutes for the broiler). Transfer to a bag and let steam until cool. Peel off the blackened skin, and then remove the stems and seeds. Cut the poblanos into 1/4-inch thick slices. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken breasts with salt on both sides. Pour the oil into a large cast-iron skillet set over medium-high heat. When oil starts to shimmer, add the chicken breasts. Cook until browned on the bottom, about four minutes, and then flip. Reduce the heat to medium, and cook until browned on the other side, five to six minutes. Set aside on a plate. (Note: The chicken might not be completely cooked inside, but you are going to cook it more.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the skillet still over medium heat, add the sliced onions. Cook, stirring occasionally, until the onions are browned, about nine minutes. Add the garlic and sliced poblanos. Stir well, and cook until very fragrant, about one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat up to medium-high, and add the greens and broth. Stir occasionally, and cook until the liquid has almost evaporated, about five minutes. Reduce heat to medium, stir in the crema, and cook until it has reduced down to a rich sauce, about five minutes. Continue to stir occasionally. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the chicken breasts into 1/2-inch cubes, and add them in. Stir well, and cook until all the chicken is completely done, one to two minutes. Season the mixture with salt to taste. Serve with warm corn tortillas.  </p>"}]}