{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121106CoqAuVinIngredients.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["braise", "French in a Flash", "mains", "mushrooms", "poultry", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Turkey Au Vin", "link": "https://www.seriouseats.com/recipes/2012/11/turkey-au-vin-recipe.html", "description": "Turkey legs get slow cooked in a classic French sauce of mushrooms, shallots, thyme, Cognac, red wine, and stock. The resulting stew is perfect over creamy mashed potatoes or buttered gnocchi.", "totalTime": "Up to 4 hours", "recipeYield": "serves 4", "recipeCategory": ["Braising and Stewing", "French", "Mains", "Mushrooms", "Turkey"], "recipeIngredient": ["2 turkey legs (about 3 pounds total)", "Kosher salt and freshly ground black pepper", "2 tablespoons olive oil ", "3 1/2 ounces pancetta, cut into 1/4-inch cubes (about 1 cup)", "9 ounces portobello mushrooms (about 3 large caps)", "6 medium shallots, peeled and left whole", "2 medium cloves of garlic, sliced", "1 tablespoon all-purpose flour", "1/4 cup Cognac", "2 cups dry red wine", "1 cup low-sodium homemade or store-bought chicken broth", "10 sprigs of thyme, tied together with kitchen twine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the turkey legs with salt and pepper. Heat the oil over medium-high heat heat in a very wide nonstick skillet or Dutch oven until shimmering. Add turkey legs and brown on all sides, about 8 minutes total. Transfer to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pancetta to the hot oil, and cook, stirring, until just crisp, about 5 minutes.  Remove the pancetta with a slotted spoon, and place next to the turkey on the plate off to the side. Add the mushrooms to the hot oil and cook, stirring, until they just stop exuding liquid, 2 to 3 minutes.  Add the garlic and shallots and cook, stirring constantly, until fragrant, about 15 seconds. Add the flour, and stir to coat everything in the pan. Add the Cognac, and stir it into the vegetables and flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the turkey and pancetta back to the pot followed by the red wine, chicken broth, and thyme. Bring the liquid to a boil, reduce to low, cover, and cook until turkey is falling-off-the-bone tender, 3 to 4 hours total. Remove lid, increase heat to medium, and simmer until the sauce coats the back of a spoon. Season to taste with salt and pepper. Serve with mashed potatoes, or buttered gnocchi or egg noodles.</p>"}]}