{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120320-chicken-noodle-soup-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "chicken soup", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Spicy Chicken Noodle Soup With Lime and Ginger", "link": "https://www.seriouseats.com/recipes/2012/03/spicy-chicken-noodle-soup-with-lime-and-ginger-recipe.html", "description": "The end result is a soup that's as fortifying as the best chicken noodle, but with a bit of kick from its sour/sweet/pungent flavor profile. With nothing but a single burner, a chicken, and a few vegetables, you can pull together a good soup in about an hour. The first key is to make extracting flavor and gelatin from the chicken bones as easy as possible. This means chopping the carcass into very fine pieces.", "totalTime": "1 hour", "recipeYield": "makes about 2 quarts, serving 4", "recipeCategory": ["Chicken", "Soups and Stews"], "recipeIngredient": ["1 whole small chicken, 2 1/2 to 3 pounds", "3 quarts water", "4 ounces of smoked ham, ham hock, or bacon", "1 three-inch knob of ginger, roughly chopped", "4 whole garlic cloves, smashed", "1 stalk of fresh lemongrass, dry outer leaves, pale yellow/green section only, chopped fine", "1 small bunch cilantro, leaves and stems reserved separately", "1 small bunch mint, leaves and stems reserved separately", "6 scallions, greens and whites reserved separately, greens sliced thin", "1 medium yellow onion, finely sliced (about 1 cup)", "2 medium carrots, finely sliced (about 1 cup)", "1 small head of napa cabbage, finely sliced (about 2 cups)", "1 Thai bird chili, very finely sliced (see note)", "1 cup dried egg noodles or rice noodles or 8 ounces fresh ramen-style Japanese or Chinese wheat noodles", "3 tablespoons fish sauce", "1/4 cup juice from 2 to 3 limes", "1 tablespoon soy sauce", "Kosher salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife and following the bone, remove the breasts from the chicken carcass. Discard skin and set breasts aside. Remove legs from chicken and set aside. Using a heavy knife or cleaver, roughly chop the body into fine pieces. Transfer the chicken body and legs to a large saucepan. Add ham, ginger, garlic, lemongrass, cilantro stems, mint stems, and scallion whites. Cover with water and bring to a simmer over high heat. Reduce to low and simmer, skimming scum from surface and topping up with hot water as necessary, until rich and flavorful, about 45 minutes total. Add chicken breasts to pot for last 10 minutes of cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain broth through a fine mesh strainer into a 2 quart liquid measuring cup. Remove cooked chicken legs and breasts to a plate and set aside. Discard remaining solids. Add enough hot water to broth to equal two quarts. Rinse pot and return broth to it. Add onion, carrots, cabbage, and Thai chilis and bring to a simmer. Cook until vegetables are tender, about 15 minutes longer, adding noodles in for last 5 minutes of cooking time (or according to package directions).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, when chicken is cool enough to handle, roughly shred breast and leg meat into bite-sized pieces, discarding skin and bones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When noodles and vegetables are soft, add fish sauce, lime juice, soy sauce, and shredded chicken to pot. Season to taste with salt (if necessary). Serve immediately, garnishing each bowl with picked mint leaves, cilantro leaves, and scallion greens.</p>"}]}