{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120724-fiaf-seared-tuna-nicoise-vegetables-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["fish", "French", "French in a Flash", "niçoise salads", "salad", "seafood", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Seared Tuna with Niçoise Vegetables and Garlic Butter", "link": "https://www.seriouseats.com/recipes/2012/07/seared-tuna-with-nicoise-vegetables-and-garlic-butter-recipe.html", "description": "For a light, bright summer dinner, try Niçoise salad remade as a warm main course: seared tuna, fresh herbs, potatoes, haricots verts, roasted cherry tomatoes, and butter infused with garlic, lemon, and olive oil.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Fish", "French", "Mains", "Salads"], "recipeIngredient": ["1/4 pound cherry tomatoes (preferably on the vine)", "4 tablespoons extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "1/2 pound baby new potatoes", "1/4 pound haricots verts (or green beans), trimmed", "2 cloves garlic, smashed and peeled", "The zest of half a lemon, in strips (made by a vegetable peeler)", "1 tablespoon unsalted butter, room temperature", "12 fresh basil leaves, sliced", "1 tablespoon chopped flat leaf parsley", "2 five-ounce fillets of fresh tuna", "1 teaspoon dried herbes de Provence"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust rack 6 inches from broiler element and preheat broiler to high.  Preheat the broiler.  Drizzle the tomatoes with about 1 teaspoon olive oil, season with salt and pepper, and place on a parchment-lined rimmed baking sheet. Broil for 8 minutes, or until just bursting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes in a stockpot and cover by at least 1 inch cold salted water. Bring to a boil then add haricôts verts. Cook beans for three minutes, then remove with strainer and transfer to an ice bath. Continue to cook potatoes until tender, about 20 minutes total. Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place 3 tablespoons of olive oil, the garlic, and lemon zest in a small saucepot over medium low heat. Cook until bubbles start to form around zest. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the infused oil, stir to combine, and discard the garlic cloves and lemon zest. Toss the haricots verts and potatoes with the garlic oil-butter, the basil, and the parsley. Season with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small nonstick skillet, heat remaining 2 teaspoons of olive oil until shimmering. Season the tuna with herbes de Provence, salt, and pepper on both sides. Sear for 1 1/2 to 2 minutes on each side for medium to medium well. Plate the potatoes and haricots verts, place the tuna on top, and pile the roasted cherry tomatoes on top of that. Serve with a lemon wedge if you like.</p>"}]}