{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120417-201705-GFTuesTart-Recipes.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["asparagus", "custard", "gluten free", "gluten free tuesdays", "quiche", "spring", "tarts", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Roasted Asparagus Tart", "link": "https://www.seriouseats.com/recipes/2012/04/gluten-free-roasted-asparagus-tart.html", "description": "[Photographs: Elizabeth Barbone] For this tart, I add Parmesan cheese to the crust and filling. If you're dairy-free, the tart works well without the cheese. For the filling, replace the half and half with either dairy-free cream or add an...", "totalTime": "2 hours", "recipeYield": "makes 1 tart, serving 4 to 6", "recipeCategory": ["Asparagus", "Gluten-Free", "Gluten-Free Tuesday", "Mains", "Quiche", "Vegetarian"], "recipeIngredient": ["<strong>For the Crust:</strong>", "1 cup (about 5 ounces) white rice flour", "3/4 cup (about 1 1/2 ounces) freshly grated Parmesan cheese (omit if dairy-free)", " 1/4 cup (about 1 1/4 ounces) sweet rice flour", "1/4 cup (about 1 ounce) tapioca starch", "1/2 teaspoon salt (increase salt to 3/4 teaspoons if dairy-free)", "2 ounces (1/2 stick) butter, chilled and cut into small pieces ", "1 large egg", "1/4 cup (2 ounces) ice water", " ", "<strong>For the Filling</strong>", "1 pound asparagus, trimmed and cut into 1-inch pieces, about 3 cups", "2 teaspoons olive oil", "5 large eggs", "1/2 cup half and half", "freshly ground black pepper", "1/2 cup (about 1 ounce) freshly grated Parmesan cheese (omit if dairy-free)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the crust</strong>: In bowl of food processor, combine white rice flour, cheese, tapioca starch, sweet rice flour, and salt. Pulse to combine. Stop food processor.  Add butter. Pulse until no large pieces remain. Whisk together water and egg. Add egg mixture.  Run food processor until a dough ball forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly spray a 11-inch tart pan with cooking spray. Pinch off one-tablespoon pieces of dough.  Place dough balls, about 1/2 inch apart, around edge of pan. Place remaining dough balls into center of pan, also spaced about 1/2-inch apart.  Using your hand, press dough into bottom of pan. Then press dough around edge to form a crust. Use a measuring cup to press dough firmly into pan. Trim excess dough from edges using a sharp knife. Prick bottom of dough with fork. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly cover pan with plastic wrap and freeze tart for 45 minutes. While tart chills, adjust oven rack to center position and preheat oven to 400&deg;F.  On a rimmed baking sheet, toss asparagus together with olive oil. When oven has preheated, roast for until bright green, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove asparagus from oven and allow to cool. Remove plastic wrap from tart shell and bake until golden brown, about 25 minutes.  In medium bowl, whisk together eggs, half and half, and black pepper. Place baked tart shell on rimmed baking sheet. Evenly sprinkle roasted asparagus in bottom of pan. Top with remaining cheese. Pour egg mixture into pan. Bake until filling sets, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and allow tart to cook for five minutes before serving. Store leftover tart in refrigerator. </p>"}]}