{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120112-187462-caramel-cream-layer-cake.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cake", "caramel", "Kurt Gutenbrunner", "Neue Cuisine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Caramel Cream Layer Cake", "link": "https://www.seriouseats.com/recipes/2012/01/caramel-cream-layer-cake.html", "description": "This Caramel Cream Layer Cake from <em><strong><a href=\"http://www.amazon.com/Neue-Cuisine-Elegant-Recipes-Sabarsky/dp/0847835626/?tag=serieats-20\" target=\"_blank\">Neue Cuisine</a></strong></em> is a riff on the Hungarian <a href=\"http://en.wikipedia.org/wiki/Dobos_torte\" target=\"_blank\">dobos torte</a> customized by Kurt Gutenbrunner for caramel lovers.", "totalTime": "", "recipeYield": "makes 12 servings", "recipeCategory": ["Bake the Book", "Cakes"], "recipeIngredient": ["<strong>Cake</strong>", "1 pound plus 2 tablespoons unsalted butter, softened", "3/4 cup confectioners’ sugar", "Pinch of grated lemon zest ", "16 large eggs, separated", "1 3/4 cups granulated sugar ", "2 1/2 cups all-purpose flour, sifted", " ", "<strong>Caramel Cream</strong>", "3/4 cup sugar", "1/4 cup water", "3 1/3 cups heavy cream", " ", "<strong>Caramel Crown</strong>", "2 cups granulated sugar", "2 tablespoons water", "2 tablespoons unsalted butter", "Cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 325&deg;F. Line four 12-by-17-inch rimmed baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the cake:</strong> In a large bowl, using an electric mixer, beat the butter with the confectioners’ sugar and lemon zest until creamy. Add the egg yolks, one at a time, beating after each addition until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another large bowl, using clean beaters, beat the egg whites at medium speed until slightly thickened and foamy, about 2 minutes. Gradually add the granulated sugar, and beat until the whites hold a soft peak. Using a rubber spatula, stir one-third of the beaten egg whites into the yolk mixture to lighten it. Gently fold this mixture into the remaining egg whites just until smooth. Fold in the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an offset spatula, spread one-quarter  of the batter in each prepared baking pan. Transfer to the oven and bake until the cake is very light brown, about 8 minutes. Remove to racks to cool completely. Using a plate or pot lid as a guide, cut each cake into two 8-inch rounds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the caramel cream: In a medium saucepan, heat the sugar and water over high heat until the sugar dissolves, then cook, swirling the pan from time to time, until the caramel is dark brown and starts to bubble and smoke, 4 to 5 minutes. Remove the pan from the heat and slowly and carefully whisk in 1 1/3 cups of the cream. Pour the hot caramel into a heatproof bowl and let cool, then refrigerate overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, using an electric mixer, beat the remaining 2 cups of cream with the cold caramel until the cream holds a medium peak.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of a 9-inch springform pan with a round of parchment paper; line the sides with a long strip of parchment. Set one of the cake rounds in the prepared pan. Using an offset spatula, spread about 3/4 cup of the caramel cream on top. Set another round on top and continue layering with the remaining caramel cream and 5 of the cake rounds, finishing with a layer of cream. Refrigerate the cake until set, 1 to 1 1/2 hours, or freeze for about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the caramel crown: Set the remaining cake round on a sheet of parchment paper. In a small saucepan, heat the sugar and water over high heat until the sugar dissolves, then cook, swirling the pan from time to time, until the caramel is golden brown, 4 to 5 minutes. Remove the pan from the heat and whisk in the butter. Pour over the cake and spread evenly.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly, spray a 10- to 12-inch chef’s knife with cooking spray, and cut the caramel disk into 12 wedges; spray the knife again each time you make a cut. Let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the sides of the cake pan and discard the parchment. Transfer the cake to a cake plate. Arrange the caramel wedges on top to make a flat round, and serve.</p>"}]}