{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/buns%20(4).JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "pizza", "pizza bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "'Pizza' Bread", "link": "https://www.seriouseats.com/recipes/2012/06/pizza-bread-recipe.html", "description": "These soft, olive oil-y buns are scented with tomato and oregano and coated with parmesan cheese. Tear into them to get at the oozy core of melted provolone.", "totalTime": "2 hours 30 minutes", "recipeYield": "makes 16 buns", "recipeCategory": ["Bread", "Bread Baking", "Pizza"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons instant yeast", "2 tablespoons sugar", " 3 cups bread flour", "2 tablespoons tomato paste", "1 tablespoon oregano", "1/4 teaspoon red pepper flakes", "1 teaspoon salt", "2 tablespoons olive oil", "4 ounces provolone cheese, cut into 16 cubes", "1/4 cup grated parmesan cheese (more as needed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast, and sugar in bowl of stand mixer fitted with dough hoook attachment. Mix until just combined, then let rest 10 minute. Add bread flour, tomato paste, oregano, pepper flakes, and salt. Knead until the dough is smooth and elastic, about 10 minutes. Add the olive oil and continue kneading until the oil is completely incorporated and dough is smooth, shiny, and elastic, about 2 minutes. Cover the bowl with plastic wrap and set aside until doubled in size, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, flour work surface and turn out dough. Knead dough briefly, then divide into 16 equal pieces. Wrap each piece of dough around one of the cubes of cheese and form the dough into a smooth ball. Sprinkle the parmesan cheese over the dough balls and roll them around to coat them with the parmesan. Place the dough balls in a 9-inch square pan and sprinkle any remaining cheese over the top. Cover the pan with plastic wrap and set aside until the dough doubles in size, about 30 minutes. Meanwhile, preheat the oven to 325&deg;F with a rack in the center of the oven..</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, uncover it, and if you like, grate additional cheese over the top. Bake at 325&deg;F until nicely browned, about 30 minutes. Remove the buns from the pan and let them cool on a rack.</p>"}]}