{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121207-232091-cook-the-book-sauteed-trout-mandarin-salad-watercress-puree.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Adam Roberts", "Cook the Book", "fish", "Linton Hopkins", "mandarin salad", "Secrets of the Best Chefs", "trout", "watercress"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Linton Hopkins' Sauteed Georgia Trout with Watercress Puree and Mandarin Salad", "link": "https://www.seriouseats.com/recipes/2012/12/linton-hopkins-sauteed-georgia-trout-with-watercress-puree.html", "description": "Despite its restaurant-quality presentation, <strong><a href=\"http://www.foodandwine.com/articles/best-new-chefs-2009-linton-hopkins\">Linton Hopkins'</a></strong> <strong>Sauteed Georgia Trout with Watercress Puree and Mandarin Salad</strong> featured in <a href=\"http://www.amateurgourmet.com/about\">Adam Roberts'</a> <em><a href=\"http://www.amazon.com/Secrets-Best-Chefs-Techniques-Americas/dp/1579654398/?tag=serieats-20\">Secrets of the Best Chefs</a></em>, is a relative breeze to prepare (for a chef-y dish) and worth any extra minute of effort. The trout is simply salted and seared, skin-side down for a crisp crust and barely-cooked flesh. A puree of watercress, leeks, and cream forms the base of the dish, and the whole kaboodle gets topped with a bright, bracing salad of mandarin oranges, fennel, dill, radish, and parsley. It's a beautiful plate of food, and tastes even better than it looks.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Fish", "Mains"], "recipeIngredient": ["<strong>For the Watercress Puree</strong>", "4 tablespoons (1/2 stick) unsalted butter ", "1 bay leaf", "1 large leek, cleaned and cut into rings", "1/2 cup heavy cream, plus more if necessary", "Kosher salt", "1 head of watercress, cleaned, roots chopped off", "Juice of 1 lemon", "&nbsp", "<strong>For the Mandarin Salad</strong>", "2 small mandarin oranges, cut into supremes ", "1/4 cup whole parsley leaves", "1/4 cup chopped dill", "1/4 fennel bulb, cored and thinly sliced", "1 radish, thinly sliced", "A pinch of salt", "&nbsp", "<strong>For the Trout</strong>", "4 trout fillets, skin on, bones removed", "Kosher salt", "Canola, vegetable, or other neutral oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the watercress puree,</strong> melt the butter in a pan along with the bay leaf and when the butter’s thoroughly melted, add the leeks. Cook them gently on medium-low heat for 5 minutes or so. When the leeks are nice and soft, add the cream and season with salt. Bring the cream to a boil and remove the bay leaf. Add the watercress and stir to coat. If it’s not coated, add more cream while the pan is still on the boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the watercress has wilted slightly after just a minute or two, add the watercress and most of the liquid to a blender. Carefully blend (cover the hole in the lid with a towel) and adjust the consistency: it should be almost soupy. If it’s not, add more of the remaining liquid. Add the lemon juice, blend one more time, then taste for seasoning. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the mandarin salad,</strong> simply toss all the ingredients together in a large bowl, adjust for salt, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finally, run your finger along the length of the trout to check for bones. If you find bones, use pliers or your fingers to remove them carefully.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the fish on both sides with salt. Heat 2 cast-iron skillets on high heat until very hot. Add a splash of oil and then 2 trout fillets per pan, skin side down, and press the fish into the pan with your hands or a spatula. <br />\r\nCook until the trout is almost completely opaque and the skin is crisp, 3 to 4 minutes. To finish, carefully flip the fish over and cook for a few seconds on the flesh side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the watercress puree onto 4 plates. Top with the trout and then pile the salad over it. Serve immediately.</p>"}]}