{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120423-203134-devils-on-horseback.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Girl and Her Pig", "appetizers", "April Bloomfield", "Cook the Book", "easy", "prunes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "April Bloomfield's Devils on Horseback", "link": "https://www.seriouseats.com/recipes/2012/04/april-bloomfields-devils-on-horseback.html", "description": "This week we're going to be sharing what we consider to be <a href=\"http://thespottedpig.com/info.php\">April Bloomfield</a>'s greatest hits, many taken straight from the menu at <a href=\"http://thespottedpig.com/\">The Spotted Pig</a>.  At The Spotted Pig, Bloomfield does drinking snacks right, and these <strong>Devils on Horseback</strong> are the ideal way to soak up whatever you're sipping.\n\nBacon wrapped prunes would be wonderful on their own but in typical Bloomfield fashion, she takes it a step further by plumping the prunes in tea and Armagnac, and stuffing them with tiny bits of tender poached pear.  These are the kind of snacks that go fast, doubling the recipe might be a good plan.", "totalTime": null, "recipeYield": "makes 10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon"], "recipeIngredient": ["<strong>For the Pears:</strong>", "2 cups dry white wine, such as Sauvignon Blanc ", "1 cup white wine vinegar ", "1 cup superfine sugar  ", "1 tablespoon sliced skin-on fresh ginger ", "10 black peppercorns", "4 whole allspice berries ", "About 4 dried pequin chilies or pinches of red pepper flakes ", "1 large cinnamon stick ", "3 large perfectly ripe Bartlett pears ", "<strong>For the Prunes</strong>", "1 English Breakfast tea bag, preferably PG Tips brand ", "3 tablespoons Armagnac or Cognac ", "10 large pitted prunes ", "10 thin slices bacon  ", "Maldon or another flaky sea salt ", "2 or 3 dried pequin chilies or pinches of red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pears:</strong> Combine the first eight ingredients in a pot just big enough for the pears to be submerged in the liquid in a snug fit. one at a time, peel the pears and halve them lengthwise. Use a small spoon to scoop out the tough core from each pear half, then trim off the hard bit at the base of each one. as you finish prepping each one, add it to the liquid so it doesn’t brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the liquid to a boil over medium-high heat, then turn down the heat so it simmers gently (don’t rush it, or the pears will disintegrate). Cook just until the pears are tender but not very soft or mushy, 15 to 20 minutes, depending on the firmness of the pears. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat and let the pears cool in the liquid. they’ll continue to cook <br />\na bit as they cool. once cool, they’ll still have a touch of snap to them, a soft crunch. They’ll keep happily in their liquid in an airtight container in the fridge for up to 2 weeks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>for the prunes: Bring 1 cup of water to a boil in a small pan. add the tea bag and <br />\nlet steep for 5 minutes, off the heat. discard the tea bag and let the tea cool completely. <br />\nCombine the tea, armagnac, and prunes in a small bowl. the prunes should be completely submerged in the liquid; if they’re not, use a different container. Cover the bowl with plastic wrap and pop it into the fridge. let the prunes soak just until they’re plump and soft, overnight or longer if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the prunes are ready, remove them from the liquid. Reserve 2 tablespoons of the liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut half of one of the spiced pears into 10 oblique pieces that will fit inside the prunes but are not so small that the prune envelops it completely. You want an inch or so of the pear to peek out at one end of the prune. Stuff each prune with a pear piece. You might have to pop your little finger into the prune first. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a slice of bacon on a cutting board, put a prune at one end, and roll up so the prune is wrapped in the bacon. if you feel there’s too much bacon, cut a little off—you want a nice balance between bacon and prune. repeat with the remaining prunes and bacon. Covered with plastic wrap, they keep overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and preheat the broiler (if you don’t <br />\nhave a broiler, heat the oven to 500°F). <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the prunes seam side down in a shallow baking pan, leaving some room between them. add 3 tablespoons of the pear liquid to the pan, along with the reserved prune liquor, then add a generous pinch of salt and crumble in the chilies. Baste, then cook the prunes under the broiler, basting them with the liquid every few minutes or so, until the bacon is golden and slightly crispy, about 15 minutes. transfer the prunes to a plate or tray and drizzle with some of the liquid. if your bacon is on the sweet side, sprinkle on salt to taste. let cool slightly before you dig in.</p>"}]}