{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/02042012-191026-sunday-supper-lobster-boil-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["clams", "lobster", "sausage", "seafood", "stews", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lobster Boil", "link": "https://www.seriouseats.com/recipes/2012/02/lobster-boil-indoor-clambake-clams-sausage-recipe.html", "description": "Quite simply, this is the indoor version of a clambake (without the hot rocks and seaweed).  If you can't gain access to a beach and are craving a simple, but special treat, this lobster boil can evoke memories of evening by the ocean in a downtown apartment.  The secret to getting everything to cook at the same time is to layer the seafood on top of the potato, corn and sausage.  This version uses kielbasa, but a chorizo or even andouille could be a delicious addition to this recipe.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Lobster and Crab", "Mains", "Sunday Supper"], "recipeIngredient": ["1 tablespoon butter", "1 onion, finely chopped", "8 small potatoes", "13 ounces kielbasa, cut on the bias into 2-inch pieces", "2 ears corn, cut into thirds", "3 pounds clams", "12 ounces beer", "2 1 1/2 pound lobsters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large stockpot, melt butter over medium high heat.  Add chopped onion and sweat until translucent, about 6 minutes.  Add potatoes and kielbasa and stir to combine.  Add corn, clams and beer and bring to a simmer.  Once beer is simmering, add lobsters to pot and cover tightly with a lid.  Cook until clams are open and lobster is bright red, about 18 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lobster from pot, crack claw and slice in half.  Place potatoes, kielbasa, corn and clams in a large serving dish.  Taste cooking liquid and season to taste with salt and pepper.  Serve with cornbread, green salad and lemon wedges and drawn butter for dipping.<br />\r\n</p>"}]}