{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120119-188620-doughnuts-500x375-2.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["breakfast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Yeast-Raised Doughnuts", "link": "https://www.seriouseats.com/recipes/2012/01/yeast-raised-doughnuts-make-at-home-glazed-recipe.html", "description": "Brush up on your doughnut technique over at <a href=\"http://sweets.seriouseats.com/2012/01/sweet-technique-how-to-make-doughnuts-donuts-at-home-instructions.html\">this Sweet Technique post.</a>", "totalTime": "14 hours", "recipeYield": "makes 15 doughnuts", "recipeCategory": ["Breakfast Sweets", "Desserts", "Doughnuts", "Mother's Day"], "recipeIngredient": ["1 1/8 cup whole milk, warmed to 90&deg;F", "1/2 cup sugar", "2 1/4 teaspoons (one package) active dry yeast", "2 whole eggs, beaten, at room temperature", "3/4 cup butter, melted and cooled", "4 cups bread flour", "1 teaspoon salt", "2 quarts frying fat (lard, crisco, or neutral oil)", "1/4 cup whole milk", "2 1/2 cups confectioner's sugar", "1 teaspoon vanilla", "1 pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir to combine the warm milk and sugar. Add the yeast, stir, and allow the mixture to sit for five minutes. It will begin to foam on top. In a separate bowl, stir together the egg and melted butter and set aside. In the bowl of the stand mixer, combine the flour and salt. Add the milk mixture and mix on low speed until the flour is hydrated, then increase the speed to form a dry-looking dough. Lower the speed, add the egg mixture and mix until it is integrated. Then mix the dough on medium-high speed for approximately 10 minutes, stopping to scrape the dough off the hook and edges of the bowl. As it mixes, the dough should make a slapping sound against the edge of the bowl. Once the dough is smooth and very stretchy, you are done mixing. Oil a large bowl with a little vegetable oil and place the dough inside. Cover the bowl with plastic wrap and place in the fridge overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, flour a work surface and turn the cold dough out onto it. Flour the top of the dough and press it flat, then use a rolling pin to flatten the dough to a uniform 1/2 inch thickness. Flour round cutters and 2 sheet trays lined with plastic or silicone mats. If you do not live in a hot, moist place, preheat the oven to its lowest setting to warm it for proofing, then turn it off. Using the floured cutters or a doughnut cutter, cut out the doughnuts and place them on the prepared tray. Be sure to give them space, as they will expand when proofing. Place them in the warm, moist environment to proof for 45 minutes to 1 hour, or until they are very puffy and fragile to touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your frying oil and glaze setup. Place a large, heavy pot on the stove and rest the thermometer inside. Pour in the oil and set the pot over medium heat. The goal is to get the oil to reach 375&deg;F and it is important to watch the pot at all times to maintain that temperature (and for safety). Set up a cooling rack covered with paper towels next to the stove and get tongs, spiders, chopsticks, or strainers ready (whatever you prefer to turn the doughnuts and remove them from the hot oil). On another burner, warm the milk in a small saucepan set over low heat until the milk begins to steam. Remove it from heat and add the confectioner's sugar, pinch of salt, and vanilla, and whisk until they are smooth. Pour the glaze into a bowl and set the bowl over a small saucepan of water and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the oil has reached 375&deg;F, begin to add the doughnuts, one at a time, until there are three in the pot. Fry the doughnuts for approximately 2 minutes before turning them, and fry for an additional 2 minutes on the other side (if you feel like they are getting too dark, it's okay to turn them earlier). Place the doughnuts on the prepared cooling rack. Break one open to ensure that it is cooked, and if additional time is needed, add the doughnuts back to the oil to finish and add a bit more cooking time for the rest. Fry the rest in similar fashion, and allow all of the doughnuts to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Glazing:</strong> Place the pot of water with the bowl of glaze set over it over low heat and stir to bring it back to a gooey liquid. Remove from heat and use your fingers to carefully submerge each of the doughnuts in the glaze. Place the glazed doughnuts on a clean cooling rack to dry. The glaze will become more translucent as it dries. For best flavor, serve immediately.</p>"}]}