{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120620-211564-dinner-tonight-eric-ripet-steak-salad-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beef", "Eric Ripert", "quick", "salad", "skirt steak", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eric Ripert's Seared Skirt Steak and Spinach Salad with Red Wine-Shallot Vinaigrette", "link": "https://www.seriouseats.com/recipes/2012/06/eric-riperts-seared-skirt-steak-and-spinach-salad-recipe.html", "description": "Whenever I think of having steak for dinner, it's usually with gluttonous intentions in mind. But steak <em>and</em> salad? Well, that's a totally different story. Though I could be eating the exact same amount of steak as before, now there are vegetables involved, and everything starts sounding far more reasonable.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Dinner Tonight", "Salads"], "recipeIngredient": ["2 cups dry red wine", "2 shallots, finely diced", "2 sprigs Italian parsley ", "2 thyme sprigs ", "1 teaspoon cracked black peppercorns ", "sea salt and freshly ground black pepper", "2 tablespoons red wine vinegar ", "1/2 cup extra virgin olive oil ", "2 tablespoons canola oil ", "1 1/2 pounds skirt steak, trimmed to four 6-inch wide steaks ", "3 cups fresh baby spinach ", "4 large white button mushrooms, cleaned and thinly sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine the red wine, shallots, parsley, and thyme. Bring to a simmer over medium-high heat, and cook until reduced by half. Turn off the heat and discard the parsley and thyme sprigs. Add the cracked pepper and season with salt to taste. Whisk in the red wine vinegar and olive oil, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the canola into a large cast-iron skillet set over high heat. Season the steaks with salt and pepper on both sides. When the oil starts to smoke, add the steaks. For medium-rare, cook for two to three minutes a side. When done, set steaks aside on a cutting board and let them rest for at least five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the steaks are resting, warm the vinaigrette back up in the saucepan over low heat. Combine the spinach and mushrooms in a large bowl, and then stir in just enough of the warm vinaigrette to lightly dress the greens. Start with a few tablespoons and go from there. Season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the salad mixture between four plates. Slice the steaks against the grain into 1/4-inch pieces, and then divide the slices up between the plates. Drizzle a little more of the vinaigrette on top of the slices. Serve immediately.  </p>"}]}