{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121210-233223-dinner-tonight-saffron-risotto-shrimp-pistachios-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "risotto", "saffron", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Saffron Risotto with Shrimp and Pistachios", "link": "https://www.seriouseats.com/recipes/2012/12/saffron-risotto-with-shrimp-and-pistachios-recipe.html", "description": "Could I whip up a batch of saffron stained risotto quickly and easily for a weeknight dinner, while avoiding the temptation to screw it up by adding a bunch of extraneous ingredients to the pot?", "totalTime": "45 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Dinner Tonight", "Mains", "Rice", "Shrimp"], "recipeIngredient": ["6 to 8 cups homemade or store-bought low sodium chicken broth", "1/4 teaspoon saffron threads", "1/2 cup pistachios, shells removed ", "2 tablespoons extra-virgin olive oil", "1 medium onion, chopped (about 1 cup)", "1 1/2 teaspoons kosher salt", "2 cups Carnaroli or Arborio rice", "1 cup dry white wine", "1 pound medium shrimp, peeled and deviened ", "1 tablespoon butter ", "½ cup grated Grana Padano or Parmigiano-Reggiano (about 1 ounce)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the chicken stock up in a medium-sized saucepan over medium heat. When it starts to bubble, reduce heat to maintain a bare simmer. Transfer 1/2 cup of stock to a small bowl and stir in the saffron threads. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a skillet over medium heat and add the shelled pistachios. Toast briefly until warm, 15 to 30 seconds (watch them carefully, as they may burn). Remove pistachios and set aside. When cool enough to handle, roughly chop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large pot over medium-high heat until shimmering. Add the onion and salt. Cook, stirring often with a wooden spoon, until the onion pieces are soft but not browned, about 4 minutes. Add rice and cook, stirring often, until each piece turns from translucent to milky white. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine. Cook, stirring occasionally, until rice absorbs most of the liquid. Using a ladle, transfer 1 cup of stock to the pot. Stir occasionally until most of the liquid has been absorbed. Repeat process until five cups have been added. Then pour in the saffron stock and stir well until this has been mostly absorbed. If the rice is tender but still with a slight bite in the center, you're done. If it has more of a crunch, keep adding an additional 1/2 cup of stock until rice is done. The risotto should be saucy, not too clumpy, so add additional broth if you need to thin it out once the rice is done.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in shrimp, butter, half the parmesan, and half the pistachios. Cover the pot and turn off the heat. Let it rest until the residual heat completely cooks shrimp, 2 to 3 minutes. Season with a few cracks of black pepper and, if needed, more salt. Thin out until the risotto is saucy enough to form a flat layer on a plate without clumping up. Serve in hot bowls or plates with an additional sprinkle of cheese and pistachios.</p>"}]}