{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120417ChipotleSteakTacos.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Mexican", "keywords": ["avocado", "carne asada", "chipotle", "Dinner for Two", "Mexican", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dinner for Two: Chipotle Steak Tacos", "link": "https://www.seriouseats.com/recipes/2012/04/chipotle-steak-tacos.html", "description": "If you thought you couldn't justify taco night for just two people, try this version that has all of the flavor, none of the labor.", "totalTime": "40 minutes (including 25 minutes of marination and resting time)", "recipeYield": "serves 2, with leftovers", "recipeCategory": ["Avocado", "Beef", "Dinner for Two", "Mexican"], "recipeIngredient": ["1 (7-ounce) can of chipotle peppers packed in adobo sauce", "1 whole flank steak (about 1 1/2 pounds)", "Kosher salt", "1 avocado, roughly chopped", "1/4 cup sour cream", "1 tablespoon vegetable or olive oil", "1 bunch of scallions", "1 lime, quartered", "2 cups thinly shredded cabbage", "1 cup roughly torn cilantro leaves", "Corn tortillas for serving (see <a href=\"http://www.seriouseats.com/2011/10/video-the-right-way-to-warm-corn-tortillas.html\">here</a> for warming instructions)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a food processor, hand blender, or blender, puree chipotle peppers with sauce until smooth. Season the flank steak with salt, and place it in a large plastic baggie with the chipotle purée.  Rub the marinade all over the steak.  Set aside to marinate for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse out food processor or blender bowl. Place avocado and sour cream in food processor or blender and puree until smooth. Season to taste with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To use a grill:</strong> Remove steaks from marinade and wipe off excess with a paper towel. Ignite a large chimney full of coals and wait until they're covered in grey ash. Spread evenly over 1/2 of grate, leaving the other half empty. Put the cooking grate in place, cover, and allow grill to preheat for 5 minutes. Scrape cooking grates clean, then place flank steak over hot side of grill. cook until well charred, about 3 minutes. Flip steak and continue to cook until second side is well charred, about 3 minutes longer. Transfer steak to cooler side of grill, cover, and cook until the center of the steak registers 125°F on an intant-read thermometer for medium-rare, or 135° for medium, about 5 minutes longer. Transfer to a cutting board, tent with foil, and allow steak to rest for at least 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To use a grill pan:</strong> Remove steaks from marinade and wipe off excess with a paper towel. Preheat a lightly oiled grill pan over high heat until lightly smoking. Place flank steak on grill. cook until well charred, about 3 minutes. Flip steak and continue to cook until second side is well charred, about 3 minutes longer. Reduce heat to medium and continue to cook, flipping steak every minute until the center of the steak registers 125°F on an intant-read thermometer for medium-rare, or 135° for medium, about 5 minutes longer. Transfer to a cutting board, tent with foil, and allow steak to rest for at least 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place scallions on grill and cook until charred and softened, 2 to 3 minutes total. Set aside and roughly chop. Slice the flank steak thinly <a href=\"http://www.seriouseats.com/2010/03/why-should-you-cut-meat-steak-against-the-grain.html\">against the grain</a>. Serve with warm tortillas, avocado puree, cabbage, limes, grilled scallions, and cilantro.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble the tacos as you like: a warm tortilla, a handful of cabbage, some steak, scallions, and cilantro, topped with a spoonful of avocado cream and a spritz of lime juice.</p>"}]}