{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/091812-223109-Peanut-butter-banana-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["banana", "peanut butter", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Peanut Butter and Banana Pie", "link": "https://www.seriouseats.com/recipes/2012/10/peanut-butter-and-banana-pie-recipe.html", "description": "This pie pays homage to the humble peanut butter and banana sandwich in that it is both delicious and simple to make. The oat crust, made from Cracklin' Oat Bran cereal, is the perfect crumbly contrast to the filling; layers of peanut butter mousse and fresh, ripe bananas.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Banana", "Desserts", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["8 ounces Cracklin' Oat Bran cereal crumbs (pulverized in food processor or crushed by hand)", "1 teaspoon salt", "3 tablespoons granulated sugar", "3 tablespoons butter, melted and cooled", "1 teaspoon powdered gelatin", "2 ounces Frangelico or other nut flavored liquor", "9 ounces creamy peanut butter (do not use a \"natural\" brand as the oils will separate)", "16 ounces heavy cream", "2 ounces confectioner's sugar", "4 average-sized ripe bananas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine cereal crumbs, salt, and sugar and stir to combine. Add the melted butter and mix until the butter evenly coats the crumbs. Pour the mixture into the 9-inch pie plate and press the crumbs evenly along the sides and bottom to form a shell. Chill the pie shell for half an hour or until it firms up a bit. It will be delicate and crumbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the Frangelico in a small heatproof bowl or coffee mug, and slowly sprinkle the gelatin over the top a little at a time, to avoid clumping. Set aside for five minutes to allow the gelatin to hydrate. Place the peanut butter in a medium-sized heatproof bowl and warm it in the microwave in thirty second increments, stopping each time to stir. Do this until the peanut butter feels hot to the touch and has a liquid consistency. Set the liquid peanut butter aside and place the bloomed gelatin in the microwave. Heat in fifteen second increments, stopping to stir each time, until the gelatin is completely melted. Combine the melted gelatin and the liquid peanut butter and stir vigorously. The mixture will become very thick and gooey. Continue to stir until the mixture is homogeneous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a whisk attachment, combine the heavy cream with the powdered sugar and whip to soft peaks. Remove 3 ounces of the whipped cream and place in the fridge to chill. To the remaining cream, add the peanut butter mixture and whisk on high speed for 30 seconds to incorporate. Scrape the sides and bottom of the bowl and then whisk until the peanut butter mixture is combined with the whipped cream with no visible clumps, another 15 to 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice three bananas into 1/8th-inch-thick slices. In the chilled pie shell, alternate layers of bananas and peanut butter mousse, finishing with a layer of mousse on top. Chill the pie for at least four hours. When ready to serve, pipe or spoon the reserved whipped cream (it may need to be re-whipped a bit before using) onto the top and decorate with slices from the remaining banana. Serve immediately after decorating.</p>"}]}