{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120822-219748-bourbon-old-fashioned-glazed-pecans.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bourbon", "nuts", "spiced nuts", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Bourbon Old Fashioned Glazed Pecans", "link": "https://www.seriouseats.com/recipes/2012/08/bourbon-old-fashioned-glazed-pecans-recipe.html", "description": "A toss in melted butter and a mix of brown sugar, salt, black pepper, and a touch of cayenne would seem to be all these pecans need. But to echo their boozy inspiration, the nuts are then doused with bourbon and dotted with old-fashioned accoutrements of orange zest and cherries (dried cherries made plump by a soak in more bourbon).\n\nThe result is a spicy-sweet snack of glazed pecans worthy of a perfectly made Old Fashioned cocktail, or any cool beverage you happen to be nursing.", "totalTime": "45 minutes", "recipeYield": "makes 2 cups of glazed pecans", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Christmas", "Vegetarian"], "recipeIngredient": ["1/4 cup bourbon whiskey", "1/4 cup dried cherries", "2 tablespoons brown sugar", "1 teaspoon kosher salt", "1/ 4 teaspoon freshly ground black pepper", "1/8 to 1/4 teaspoon cayenne pepper", "2 cups raw pecan halves", "2 tablespoons unsalted butter", "1 tablespoon zest from 1 small orange"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the bourbon and the dried cherries in a small bowl and set aside to soak for 30 minutes. In another small bowl, combine the brown sugar, salt, black pepper, and cayenne pepper and stir until well-combined. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pecans in a large non-stick skillet over medium heat. Cook, stirring frequently, until they just start to brown and smell toasted, 3 to 4 minutes. Add the butter to the pan and stir until the butter is completely melted and the pecans are coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar and spice mixture to the pan and stir to combine. Turn off the heat and immediately pour in the cherries and bourbon. Stir for 1-2 minutes more, off heat, until everything is well incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to medium heat and continue to stir everything in the pan until the liquid thickens and a glaze forms on the pecans, 1 to 2 minutes longer. Transfer the pecans to a parchment-lined rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spatula or wooden spoon, separate the pecans and spread them into an even layer on the parchment paper. Allow the pecans to cool completely. Once the pecans have cooled, zest the orange over the pecans. Transfer the pecans to a large bowl and serve.</p>"}]}