{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/04022012-200745-Sunday-Suppers-Spanish-Roast-Chicken-RomescoB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Spanish", "keywords": ["pimentón", "roast chicken", "romesco", "scallions", "smoked paprika", "spanish", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Spanish Roast Chicken with Romesco and Grilled Onions", "link": "https://www.seriouseats.com/recipes/2012/04/spanish-roast-chicken-with-romesco-and-grille.html", "description": "Few things in life are more satisfying than roast chicken. And when your bird is slathered with spicy, citrusy pimentón rub and served with tangy romesco? Resistance is futile.", "totalTime": "2 1/2 hours", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Mains", "Spanish", "Sunday Supper"], "recipeIngredient": ["<strong>For the Chicken:</strong>", "1 large chicken (4 to 5 pounds)", "2 teaspoons hot smoked paprika (see note)", "Kosher salt and freshly ground black pepper", "2 tablespoons olive oil", "1/4 cup juice from 1 orange", "8 medium cloves garlic", "&nbsp;", "<strong>For the Romesco:</strong>", "3 tablespoons slivered almonds, toasted", "7 hazelnuts, toasted, with loose skins removed while warm", "1 slice stale bread, roughly torn", "1/2 cup roasted red peppers, drained", "1 1/4 cup fire-roasted tomatoes (from a 14-ounce can), drained", "1/4 cup sherry vinegar", "1/4 tsp red pepper flakes", "1/2 cup extra virgin olive oil", "&nbsp;", "<strong>For the Onions:</strong>", "12 gree onions or scallions, trimmed.", "2 teaspoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 375&deg;F. Pat chicken dry with paper towels and place on a v-rack in a roasting pan, tucking wing tips behind shoulder of the bird.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix smoked paprika, 2 teaspoons kosher salt and 1/2 teaspoon pepper in small bowl. Drizzle olive oil and orange juice over chicken, sprinkle with spice mixture and massage evenly over the bird until it’s an even, burnished red hue. Place garlic cloves in the bottom of the roasting pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken in oven to cook. Using tongs, remove garlic cloves and transfer to a small plate when tender, about 30 minutes. Continue to cook chicken basting with pan juices every 30 minutes after the first half-hour of cooking, until thermometer inserted into thickest part of thigh registers 175&deg;F and the breast registers at least 145°F, 1 1/2 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the Romesco. Combine roasted garlic, almonds, hazelnuts, bread, peppers, tomatoes, sherry vinegar, and pepper flakes, in a blender. Prepare romesco by adding all ingredients, except olive oil, to a blender. Pulse a few times to break up large chunks, then puree, adding olive oil in a slow, steady stream, about 30 seconds total. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken from oven, tent it lightly with foil and allow it to rest. Meanwhile, preheat a grill or grill pan on high. Toss onions with olive oil then grill until charred on first side, 2 to 3 minutes. Flip and cook until charred on second side and tender, another 2 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve chicken or transfer to platter to carve tableside. Drizzle with pan drippings, scatter platter with grilled onions and serve with romesco sauce for passing.</p>"}]}