{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120326CoconutMussels1.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["cilantro", "coconut milk", "Dinner for Two", "lemongrass", "mains", "mussel", "mussels"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Dinner for Two: Coconutty Mussels with Ginger, Lemongrass, Chili, and Cilantro on Rice Noodles", "link": "https://www.seriouseats.com/recipes/2012/04/dinner-for-two-coconutty-mussels-with-ginger.html", "description": "Seashore mussels are stewed in a simple but exotic broth of coconut milk, lime, cilantro, lemongrass, and chilies.  Spooned over rice noodles, there is nothing better than this easy, exotic one-pot classic.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner for Two", "Mains"], "recipeIngredient": ["1 can coconut milk", "1/3 cup water", "1 inch of fresh ginger, peeled", "1 stalk of fresh lemongrass, bottom 6 inches only", "A small bunch of fresh cilantro", "1 tablespoon juice from 1 lime", "1 jalapeno or Fresno chili, thinly sliced", "2 pounds of mussels (buy them de-bearded and scrubbed: usually that’s how they come)", "Kosher salt", "1 (10-ounce) package of precooked rice noodles, or a two large handfuls of dried rice noodles soaked in hot water for 10 minutes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the coconut milk and water into a large stockpot over low heat.  Meanwhile, slice the ginger into rounds.  Halve the lemongrass, and beat it with the dull side of the knife to release its flavor.  Tear the leaves from the cilantro stalks.  Peel three strips of zest from the lime with a vegetable peeler.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the ginger, lemongrass, cilantro stalks (reserve the leaves for later), and lime zest to the coconut milk.  Raise the heat to high, bring the coconut milk mixture to a boil, then lower the heat all the way down to the lowest setting.  Cover the pot and steep the broth for 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise the heat to high and add the chilies and mussels. Cover and cook, stirring occasionally, until all the mussels open 3 to 5 minutes. Season to taste with salt and stir in the roughly chopped cilantro leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the noodles between two serving bowls, then divide the mussels and broth over the noodles.  Serve immediately with lime wedges</p>"}]}