{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120529-the-food-lab-chicken-tikka-masala-17.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Indian", "keywords": ["chicken", "chicken tikka masala", "Indian", "low carb", "masala", "poultry", "tandoor", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "16"}, "name": "The Best Chicken Tikka Masala", "link": "https://www.seriouseats.com/recipes/2012/06/chicken-tikka-masala-for-the-grill-recipe.html", "description": "The secret to our Chicken Tikka Masala is a salty yogurt-based marinade followed by intense charring on a hot grill. We purposely undercook our chicken so it can simmer in a creamy spiced tomato and cream sauce before serving.\r\n\r\nWhen done right, the sauce should be a multifaceted affair; a balanced blend of intense spice flavors with a gingery kick rounded off by the richness of cream and butter, with a splash of freshness and acid from tomatoes and citrus. As you bite into a chunk of chicken, the smokey char should work its way though to the forefront, to be slowly replaced by a new layer of spicing, this time intensified by its time on the grill. The chicken chunks should be juicy, moist, and tender.", "totalTime": "5 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Chicken", "Indian", "The Food Lab"], "recipeIngredient": ["5 pounds bone-in chicken pieces (breasts, legs, or a mix), skin removed", "3 tablespoons toasted ground cumin", "3 tablespoons toasted paprika", "2 tablespoon toasted ground coriander seed", "2 teaspoon ground turmeric", "1 teaspoon cayenne pepper", "12 cloves garlic, grated on the medium holes of a box grater, divided", "3 tablespoons fresh ginger, grated on the medium holes of a box grater, divided", "2 cups yogurt", "3/4 cup fresh juice from 4 to 6 lemons, divided", "Diamond Crystal kosher salt; for table salt, use about half as much by volume", "4 tablespoons butter or ghee", "1 large onion, thinly sliced", "1 (28-ounce) can whole peeled tomatoes, roughly mashed", "1/2 cup roughly chopped cilantro leaves and tender stems", "1 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken pieces on a cutting board with the flesh-side up. Score deeply at 1-inch intervals with a sharp knife. Place in a large rimmed baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cumin, paprika, coriander, turmeric, and cayenne in a small bowl and mix well. Set aside 3 tablespoons of spice mixture. Combine remaining 6 tablespoons spice mixture, 8 cloves garlic garlic, 2 tablespoons ginger, yogurt, 1/2 cup lemon juice, and 1/4 cup salt in a large bowl and whisk to combine. Pour marinade all over chicken pieces, using hands to coat every surface. cover loosely and refrigerate. Refrigerate and allow to marinate for at least 4 hours and up to 8, turning occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat butter or ghee in a large Dutch oven over medium-high heat until melted and foaming subsides. Add onions, remaining 4 tablespoons grated garlic, and remaining 2 tablespoons ginger. Cook, stirring frequently, until dark and beginning to char in spots, about 10 minutes. Add reserved spice mixture and cook, stirring frequently, until fragrant, about 30 seconds. Add tomatoes and half of cilantro, scraping up any browned bits from bottom of pan with a spoon. Simmer for 15 minutes, then puree using a hand blender or by transferring to a tabletop blender in batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in cream and remaining quarter cup lemon juice. Season to taste with salt, then set aside until chicken is cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>TO COOK ON THE GRILL</STRONG>: <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Wipe excess marinade off chicken and place over hot side of grill, flesh-side-down. Grill without moving until well charred, 5 to 7 minutes. Flip chicken and cook until second side is charred, another 4 to 5 minutes. (Chicken will not be completely cooked through&mdash;this is ok). Transfer to cutting board and allow to rest 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>TO COOK UNDER THE BROILER</strong>: Line a broiler pan with heavy duty aluminum foil and preheat the broiler to high with the rack set 6 inches below broiler element. Wipe excess marinade off chicken and place on foil-lined pan, flesh side up. Broil until charred and blackened on surface, about 8 minutes (chicken will not be completely cooked through&mdash;this is ok). Transfer to cutting board and allow to rest 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken from bone using a sharp knife and cut into rough bite-sized chunks. Transfer chicken chunks to pot of sauce. Bring to a simmer over medium heat and cook, stirring frequently, until chicken is just cooked through, about 10 minutes. Sprinkle with remaining cilantro, then serve immediately with rice or <a href=\"http://www.seriouseats.com/recipes/2011/08/grilled-naan-recipe.html\">Grilled Naan</a></p>"}]}