{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120208-191883-Pączki.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["breakfast pastries", "pączki"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Paczki", "link": "https://www.seriouseats.com/recipes/2012/02/paczki-jelly-doughnuts-recipe.html", "description": "Crisp on the outside, yet soft and yielding on the inside, pączki may look like ordinary jelly doughnuts, but these rich and dense pastries are far from run-of-the-mill.", "totalTime": "4 hours", "recipeYield": "Makes about 18 doughnuts", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Doughnuts", "Pastry"], "recipeIngredient": ["2 cups whole milk", "4 1/2 teaspoons instant yeast (2 standard sized envelopes)", "1/2 cup plus 1 tablespoon sugar", "5 cups (22.5 ounces) all purpose flour", "4 eggs yolks plus one whole egg", "1 teaspoon salt", "1 teaspoon vanilla extract", "1/4 cup unsalted butter, melted", "2 quarts canola oil for frying", "1 1/2 cups of your favorite preserves", "1 cup powdered sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan heat milk to between 110&deg an 115&deg;F. Pour warmed milk into a large bowl or the bowl of a stand mixer. Dissolve yeast in milk. Add one Tablespoon sugar and two cups of flour. Mix until consistency of pancake batter then cover with plastic wrap and place in a warm spot to allow yeast to activate. Let rest for 30 minutes or until starter is very bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl combine egg and yolks. Whisk until light and frothy, about 4 minutes. Whisk in 1/2 cup sugar, salt and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly stir cooled melted butter into yeast starter until combined. Then slowly incorporate egg mixture until just combined. Fit mixer with dough hook. Stir in flour, working 1/2 a cup in at a time until a soft dough comes together. Note: this dough is very sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a large bowl with cooking spray and transfer dough to bowl. Cover tightly with plastic wrap and set in a warm place to rise until double in size. About an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out dough on a very generously floured surface. Dust surface of dough with flour then punch down dough to about half an inch high. Using a floured two- or three-inch biscuit cutter, cut out doughnuts. Carefully transfer doughnut rounds to parchment lined baking sheets. Cover sheets with a clean dish towel and set in a warm place to rise until doubled in size, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour canola oil into a large dutch oven to a depth of 2 inches. Heat oil to 360&degF. Once oil reaches the proper temperature use a heat resistant spatula or shallow strainer to carefully drop doughnuts in, one at a time, cooking a maximum of 3 at once. Cook doughnuts until a warm, deep brown on one side, then using heat resistance tongs turn the doughnut and cook the other side until it reaches the same degree of doneness. Remove from oil letting any excess oil drain off then transfer to a wire rack for cooling. Test your first doughnut to make sure that the insides are completely cooked, if not adjust your cooking time accordingly. Let doughnut cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a wide and shallow bowl with powdered sugar. Fill your pastry bag with your favorite preserves and fit the bag with a filling tip. Pipe filling into pączki then dip each side in powdered sugar until covered.</p>"}]}