{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120805-food-lab-grilled-chicken-09.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue chicken", "chicken", "grill", "grilled chicken", "grilling", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Grilled Butterflied Chicken", "link": "https://www.seriouseats.com/recipes/2012/08/grilled-butterflied-chicken-recipe.html", "description": "For the best grilled chicken, start it off with a slow cook over the cooler side of a two-level grill to allow the skin to dry and get ready to crisp. Finish it off directly over the hot coals to crisp up the skin until crackly and charred.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Gluten-Free", "Grilled Chicken", "Grilling, Smoking, and Barbecue", "July 4th", "Labor Day", "Mains", "Memorial Day", "Summer", "The Food Lab"], "recipeIngredient": ["1 whole chicken, 3 1/2 to 4 pounds (1.6 to 1.8kg)", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken dry with paper towels and place on a large cutting board, breast side down. Using sharp kitchen shears, remove backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten chicken. For added stability, run a metal or wooden skewer through chicken horizontally, entering through one thigh, going through both breast halves, and exiting through other thigh. Tuck wing tips behind back. Season generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken, skin side up, on cooler side of grill, with legs facing toward hotter side. Cover grill with vents on lid open and aligned over chicken. Open bottom vents of grill if using a charcoal grill. Cook until an instant-read thermometer inserted into thickest part of breast registers 110&deg;F (43&deg;C). Carefully flip chicken and place on hotter side of grill, skin side down, with breasts pointed toward cooler side. If using a gas grill, reduce heat to medium-low. Press down firmly with a wide, stiff spatula to ensure good contact between bird and grill grates. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of breast registers 145 to 150&deg;F (63 to 66&deg;C), about 10 minutes longer. If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to a cutting board and allow to rest for 5 to 10 minutes. Carve and serve.</p>"}]}