{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121005-225041-autumn-jam-with-pears-mission-figs-and-cinnamon.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["cinnamon", "figs", "Jam", "pears", "Preserved", "Preserves"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Autumn Jam with Pears, Mission Figs, and Cinnamon", "link": "https://www.seriouseats.com/recipes/2012/10/autumn-jam-with-pears-figs-cinnamon-recipe.html", "description": "Highlighting the sweet freshness of autumn figs and pears, this jam is a fall favorite. Tart orange provides a touch of zip, while just a hint of cinnamon adds warmth for those shorter, cooler evenings.", "totalTime": "2 hours", "recipeYield": "makes about six 8-ounce jars of jam", "recipeCategory": ["Condiments and Sauces", "Pear", "Preserved"], "recipeIngredient": ["1 1/2 pounds Bartlett pears, peeled, deseeded, and cut into 1/2 inch chunks", "1 1/2 pounds fresh mission figs, quartered", "3 1/2 cups sugar", "1 teaspoon cinnamon", "3 tablespoons orange juice, from 1 large orange", "1 1/2 teaspoons orange zest, from 1 large orange", "1/2 teaspoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pears, figs, and sugar in a large non-reactive bowl. Stir well and allow to sit covered, at room temperature, for one hour. At this point, place a small plate in the freezer so you can test the jam for proper thickness later.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the fruit and sugar into a large, deep, heavy-bottomed pot. Add cinnamon, orange juice, orange zest, and butter, stirring well to combine. Cook over medium heat, strring frequently, until the fruit begins to bubble and spit. Cook for 20 minutes, stirring frequently to keep the fruit from sticking to the bottom of the pot, and lowering heat if necessary.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 20 minutes, begin testing the jam for doneness: Spread a 1/2 teaspoon of cooked jam on the cold plate and place it back in the freezer. Wait 30 seconds, then run your finger through the jam. It should be thick enough to maintain a path when you run your finger through it. If you’d like thicker jam, cook for another 4 minutes and test again. Repeat until desired thickness is achieved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pot from heat and use a spoon to skim any foam from the surface of the jam. Ladle jam into sterilized jars and process them in a hot water bath for 10 minutes. Unopened jars will keep at room temperature for up to 6 months. Opened jam should be refrigerated.</p>"}]}