{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/2012-03-27-asparagus-salad-chopped-egg-2.jpg", "author": {"@type": "Person", "name": "Jennifer Segal"}, "recipeCuisine": "", "keywords": ["asparagus", "salad", "serious salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Salads: Asparagus with Dijon Mustard Sauce and Chopped Hard Boiled Egg", "link": "https://www.seriouseats.com/recipes/2012/03/serious-salads-asparagus-with-dijon-mustard-s.html", "description": "This springy salad of bright green asparagus spears and chopped hard boiled eggs in a creamy Dijon mustard sauce is perfect for Easter brunch. You can serve it as a first course&mdash;a welcome change from leafy greens&mdash;or side to poached salmon or honey baked ham.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Salads"], "recipeIngredient": ["<strong>For the Salad</strong>:", "3 large eggs", "2 bunches thick asparagus spears, bottom ends trimmed (about 1 pound)", "1 tablespoon minced fresh chives, for garnish", " ", "<strong>For the Sauce</strong>:", "1/2 cup mayonnaise", "2 tablespoons Dijon mustard", "2 tablespoons water", "1 tablespoon red wine vinegar", "Pinch salt", "A few grinds freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the eggs in a small saucepan and cover with cold water by one inch. Heat over high heat until the water comes to a rapid boil. Remove the saucepan from the heat, cover with a lid and let stand for 14 minutes. Using a slotted spoon, transfer the eggs to a bowl of ice water to chill. Peel and roughly chop the eggs and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium bowl with ice water and set aside. Bring 6 cups water and 4 teaspoons salt to a boil in a large shallow pot. Add the asparagus and cook until tender-crisp, 3 to 4 minutes. Transfer the cooked asparagus to the ice bath. When cool, remove the asparagus from the ice bath and set on a clean dish towel to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, mix mayonnaise, mustard, water, and vinegar in a small bowl and whisk to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, arrange the asparagus spears on individual plates or a platter and spoon the sauce generously over the middle of the spears. Sprinkle the chopped eggs and chives over the sauce.</p>"}]}