{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120408-200610-preserved-carrot-orange-marmalade-1.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["carrots", "Jam", "orange", "Preserved", "raisins"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Carrot Orange Marmalade with Cinnamon and Golden Raisins", "link": "https://www.seriouseats.com/recipes/2012/04/carrot-orange-marmalade-with-cinnamon-and-golden-raisins-recipe.html", "description": "Think of this recipe as a mash-up of carrot cake jam and orange marmalade. Try it on carrot or zucchini bread, whole wheat toast, or as a topping for crostini with ricotta. If you can't find Pomona's Pectin, use regular no- or low-sugar powdered pectin.", "totalTime": "2 hours", "recipeYield": "makes about 6 cups, or 6 half-pint jars", "recipeCategory": ["Condiments and Sauces", "Orange"], "recipeIngredient": ["3 cups sugar", "4 1/2 teaspoons Pomona's Universal Pectin", "3 medium navel oranges", "1/8 teaspoon baking soda", "2 cups finely shredded carrots", "1/2 cup golden raisins, coarsely chopped ", "3 tablespoons lemon juice", "3 teaspoons calcium water (included in the Pomona's packet)", "3/4 teaspoon cinnamon", "1/4 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar and pectin in a medium bowl. Wash the oranges and remove rind in quarters. Scrape away as much of the white pith as possible. Thinly slice rind lengthwise, then roughly chop crosswise into smaller pieces. Transfer rind to a large pot and add baking soda, and 2 1/2 cups of water. Bring to a boil, then reduce heat, cover, and simmer gently for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, coarsely chop oranges and remove any seeds. Transfer oranges to a food processor and pulse until orange pieces are broken up but still chunky, about 8 pulses. Add oranges and carrots to pot with the rind and bring to a simmer. Simmer, covered, 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the mixture. You should have about 6 cups. If you have less, add a bit more water. If you have more, discard the extra.) Stir in raisins, lemon juice, calcium water, cinnamon, and butter, and return to a boil. Stir in sugar-pectin mixture and return mixture to a full rolling boil, stirring constantly. Boil hard for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pot from heat and skim any foam from the surface of the marmalade with a cold metal spoon. Ladle marmalade into hot sterilized jars and process them in a hot water bath for 10 minutes. </p>"}]}