{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121120-127677-Pastel-Ruso-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cake", "layer cake", "Let them eat cake", "meringue", "spanish desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Meringue and Sweet Butter Cake", "link": "https://www.seriouseats.com/recipes/2012/11/meringue-and-sweet-butter-cake-pastel-russo-recipe.html", "description": "Crisp-shelled, marshmallow-chewy meringues are layered with lightly sweetened butter into a cloudy white cake that's an unexpected surprise.", "totalTime": "2 hours, 40 minutes", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Cakes", "Let Them Eat..."], "recipeIngredient": ["<strong>For the Meringue Layers</strong>:  ", "2 tablespoons unsalted butter", "1/2 cup confectioners’ sugar", "2 cups (about 14 ounces) granulated sugar", "4 teaspoons cornstarch", "6 large egg whites, at room temperature", "2 teaspoons white vinegar", "1/4 teaspoon salt", "2 teaspoons pure vanilla extract", "   ", "<strong>For the Sweet Butter and Assembly</strong>:", "8 tablespoons (4 ounces) unsalted butter, at room temperature", "1/2 cup plus 2 tablespoons confectioners’ sugar", "1 large egg yolk", "1 teaspoon pure vanilla extract", "1/8 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meringue Layers:</strong> Adjust oven rack to upper-middle and lower-middle positions and preheat oven to 275&deg;F. Grease 3 (9-inch) round cake pans with 2 tablespoons butter. Dust with confectioners’ sugar and tap out excess. Line bottoms of pans with parchment paper rounds.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar and cornstarch in small bowl. Beat egg whites, vinegar, and salt on medium low speed until frothy, about 30 seconds. Increase speed to medium high, and, with mixer running, slowly add the sugar-cornstarch mixture 1 tablespoon at a time. When finished, continue mixing until stiff, glossy peaks form, about 2 minutes longer.  Add vanilla and beat just until combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread an equal amount of meringue in prepared cake pans. Bake until dry and crisp, about 1 hour, rotating and alternating pans halfway through baking. Shut off oven, prop open with wooden cooking spoon, and allow meringues to sit in oven for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sweet Butter and Assembly:</strong> Meanwhile, prepare the butter spread. Beat the butter, 1/2 cup confectioners’ sugar, egg yolk, vanilla, and salt in a large bowl with mixer on low speed, about 1 minute. Once confectioners’ sugar is combined with butter, increase speed to medium and beat until mixture is light and fluffy, about 3 minutes.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully invert 1 meringue onto a plate and remove and discard parchment. Place the meringue, top side up, on a serving plate or cake stand. Spread with half of butter mixture. Repeat inversion method with second meringue, arrange on top of butter mixture, spread with the remaining butter mixture, and top with third meringue. Sift remaining 2 tablespoons confectioners’ sugar over meringue. Serve.</p>"}]}