{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120910-221887-cook-the-book-chicken-soup.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chicken", "chicken soup", "Cook the Book", "crackers", "noah and are bernamoff", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mile End's Chicken Soup with Soup Mandel", "link": "https://www.seriouseats.com/recipes/2012/09/mile-ends-chicken-soup-with-soup-mandel.html", "description": "Once the calendar flips to September, my mind begins drifting to fall. It matters little what the thermometer reads, the post-Labor Day season is a time for apples, hearty greens, and, of course, <strong>chicken soup</strong>. For me, the magical elixir cures not only cold symptoms, but back-to-school (or work) jitters as well. In <em><a href=\"http://www.amazon.com/The-Mile-End-Cookbook-Hamantaschen/dp/030795448X?tag=serieats-20\">The Mile End Cookbook</a></em>, <strong><a href=\"http://www.mileenddeli.com/about/our-story/\">Noah and Rae Bernamoff</a></strong> present a simple yet full-bodied and rich take on the classic.", "totalTime": "4 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Chicken", "Cook the Book", "Mains", "Soups and Stews"], "recipeIngredient": ["3 small chickens (about 2 1/2 pounds each), each cut into 8 pieces", "10 black peppercorns", "2 teaspoons Diamond Crystal kosher salt, plus more to taste", "4 medium parsnips, peeled, 2 left whole and 2 cut into 2- to 3-inch batons", "4 medium carrots, peeled, 2 left whole and 2 cut into 2- to 3-inch batons", "4 stalks of celery, trimmed, 2 left whole and 2 cut into 2- to 3-inch batons", "3 large onions, peeled, 2 cut in half and 1 coarsely chopped", "3 sprigs of dill", "3 sprigs of flat-leaf parsley", "3 sprigs of thyme", "2 fresh bay leaves", "<a href=\"http://www.seriouseats.com/recipes/2012/09/mile-ends-soup-mandel.html\">Soup Mandel</a>, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken pieces in a large stockpot along with the peppercorns, salt, and enough water to cover the ingredients by about 2 inches. Heat the pot over medium heat until the content of the pot start to simmer. Adjust the heat to maintain a low simmer and continue cooking, uncovered, for about 1 1/2 hours, occasionally skimming off any foam and fat that rise to the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon or tongs, remove the bread and thigh sections and reserve them for the soup (or another use, like chicken salad), leaving the drumsticks and wings in the pot. Add the 2 whole parsnips, 2 whole carrots, 2 whole celery stalks, and 2 halved onions to the pot and continue to simmer for another 1 1/2 hours, stirring and skimming occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and add the dill, parsley, thyme, and bay leaves. Allow the herbs to steep for 30 minutes. Then strain the stock through a fine mesh sieve, discarding the solids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the strained soup to the pot and bring it to a low simmer. Add the parsnip, carrot, and celery batons; and chopped onions. Simmer for another 15 minutes, then add the reserved breast and thigh meat, if you like. Simmer for 5 minutes more and season to taste. Serve with soup mandel.</p>"}]}