{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/201202-194684-bread-baking-peanut-butter-sweet-rolls.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peanut Butter Butter Sweet Rolls", "link": "https://www.seriouseats.com/recipes/2012/02/bread-baking-peanut-butter-sweet-rolls.html", "description": "[Photograph: Donna Currie] These rolls are great for breakfast or as an afternoon snack. They're not as sweet as typical cinnamon rolls, which was perfect for me. If you've got a sweet tooth, a simple powdered sugar glaze or a...", "totalTime": "2 hours, 30 minutes", "recipeYield": "Makes 9 rolls", "recipeCategory": ["Bread", "Bread Baking", "Breakfast and Brunch", "Nuts"], "recipeIngredient": ["1 cup lukewarm water", "2 tablespoons sugar", "2 1/4 teaspoons active dry yeast", "2 cups (9 ounces) bread flour", "1/2 cup (3 ounces) semolina flour", "1 teaspoon salt", "1 stick unsalted butter, divided", "1 1/4 cups crunchy peanut butter", "1/4 cup brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, sugar, and yeast in the bowl of your stand mixer. Let it stand until it for 10 minutes. Add the bread flour and semolina and knead with the dough hook until the mixture begins to become elastic. Cover the bowl with plastic wrap and set aside for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt and 6 tablespoons of the butter, cut into small pieces. Knead with the dough hook until the butter is completely incorporated and the mixture becomes smooth and elastic. Cover with plastic wrap and set aside for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and spray an 8-inch square baking pan with baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough onto your floured surface and knead it briefly. Shape it into a rectangle, then roll it to a rectangle about 12x16 inches. Position it with one of the long sides facing you. Spread the peanut butter on the dough thinly covering the entire surface except about an inch on the edge farthest from you. Sprinkle the brown sugar on top of the peanut butter. It doesn't have to be completely even, but try not to have huge clumps of it. If you like, sprinkle a pinch or two of coarse salt on top, as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beginning with the side closest to you, being rolling up the dough, jellyroll style. Don't roll it tightly - you want it to be a bit loose. When you reach the far end, pinch the dough to seal the seam.</p>\r\n\r\n<p>Cut the dough into 3 even pieces, then cut each of those into 3 pieces for a total of 9. Arrange the rolls, cut side down, in the pan in 3 rows. Flatten the rolls a bit so they are all the same height and they just barely touch each other in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the remaining 2 tablespoons of butter into pieces and place a bit on top of each roll. Cover the dough with plastic wrap and let it rise until doubles, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325 degrees. When the dough has risen, remove the plastic wrap and bake until the rolls are nicely browned, about 35 minutes. Removed the rolls from the pan and let them cool if you aren't serving them immediately. For a soft top, cover the rolls with a clean kitchen towel as they cool.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you like you can top these with a sprinkle of powdered sugar or drizzle them with drizzle of your favorite glaze. Personally, I like them plain.</p>"}]}