{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120801ShrimpChorizoPaella.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Dinner for Two"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shrimp and Chorizo Lazy Paella", "link": "https://www.seriouseats.com/recipes/2012/08/shrimp-and-chorizo-lazy-paella.html", "description": "A no-effort, fifteen-minute chorizo and shrimp paella with saffron, sweet shallots, and bright fresh peas.  The perfect lazy weeknight dinner for two.", "totalTime": "15 minutes", "recipeYield": "2 servings", "recipeCategory": ["Dinner for Two", "Mains", "Shrimp"], "recipeIngredient": ["1/4 teaspoon (not packed) saffron", "8 1/2 ounces parboiled white rice (preferably cook-in-the-bag rice)", "Kosher salt and freshly ground black pepper", "2 teaspoons olive oil", "2 ounces Spanish chorizo, sliced into thin coins", "1 large shallot, sliced", "20 medium shrimp, peeled and deveined", "1/2 cup frozen peas", "3 tablespoons chopped fresh flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the saffron in a small bowl and cover with 2 tablespoons of boiling water.  Set aside to steep.  Meanwhile, cook the rice according to package instructions.  Then drain, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the rice is cooking, heat the olive oil in a wide skillet over medium heat until shimmering. Add the chorizo and cook, stirring frequently, until it releases red oil, about 1 minute. Add the shallot and cook, stirring frequently, until fragrant, about 45 seconds.  Add the shrimp, and cook until almost completely pink, about 2 minutes. Add the peas, and cook until the shrimp are pink and opaque and the peas thawed, 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push the shrimp and chorizo to the side of the pan and add the drained rice in the center. Add the saffron and its water.  Stir the saffron into the rice and cook until the pan is dry. Then, stir in the shrimp and chorizo and peas from the corners of the pan.  Stir in the parsley and serve</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Optional step: place the paella in an 8-inch by 8-inch baking dish, and drizzle the top with 1 teaspoon of olive oil.  Place under a hot broiler just until the rice turns slightly crisp.</p>"}]}