{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/225718-20121017-british-bites-bangers-mash-onion-gravy.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "British", "keywords": ["bangers and mash", "british bites", "gravy", "mashed potatoes", "onion gravy", "potatoes", "sausages"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "English Bangers and Mash with Onion Gravy", "link": "https://www.seriouseats.com/recipes/2012/10/bangers-and-mash-with-onion-gravy-recipe.html", "description": "Bangers and mash are a public house classic, some fatty sausages with buttery potatoes perfect for soaking up an afternoon's worth of ale", "totalTime": "35 minutes", "recipeYield": "serves 4", "recipeCategory": ["British", "British Bites", "Mains", "Mashed Potatoes", "Other Meats", "Pork", "Potato", "Recipes", "Stovetop"], "recipeIngredient": ["4 russet potatoes, peeled and cut into 2 inch chunks ", "Kosher salt", "6 tablespoons butter ", "1 cup milk ", "Freshly ground black pepper", "3 medium onions, thinly sliced (about 3 cups sliced onions)", "1 bay leaf ", "2 1/2 tablespoons flour ", "2 1/2 cups store-bought or homemade low-sodium beef or chicken broth", "2 tablespoons vegetable oil ", "8 bangers (about 2 pounds, see note) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a saucepan and cover with cold water. Season well with salt. Bring to a boil over high heat, reduce to a simmer, and cook until potatoes are soft, about 10 minutes. Drain and place back in saucepan, add 3 tablespoons butter and 2/3 cup milk, and mash with a potato masher, adding more milk if a looser consistency is desired. Season to taste with salt and pepper. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 3 tablespoons butter in a large non-stick skillet over medium-high heat until melted. Add onions and bay leaf and cook, stirring often, until onions are brown, about 15 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle with flour and mix until flour is evenly incorporated with onions. Stirring constantly, slowly pour stock over onion mixture. Bring to a simmer over high heat, stirring often, then lower heat to medium and cook until thickened, about 6 minutes. Remove and discard bay leaf. Season to taste with salt and pepper, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a large stainless steel skillet over medium high heat until shimmering.  Reduce heat to medium-low. Place bangers in the skillet and cook until browned on one side, about 5 minutes; flip bangers and cover.  Cook until bangers are fully cooked, about 6 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide mash between 4 plates, place 2 bangers on each pile of mash, and top with onion gravy.  Serve with brown ale and extra gravy and strong mustard passed alongside.</p>"}]}