{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120121-fried-eggplant-sandwich-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["eggplant", "pizza bianca", "sandwich", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Fried Eggplant Sandwich With Eggplant Mayo", "link": "https://www.seriouseats.com/recipes/2012/01/fried-eggplant-sandwich-with-eggplant-mayo.html", "description": "after discovering how delicious eggplant-based mayonnaise is (or more accurately, after my wife confirmed it to me), I put two and two together and decided to make a fried eggplant sandwich smothered in rich tomato sauce, and drizzled with a mayonnaise made out of itself. Whoa, meta.", "totalTime": "1 hour 45 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Dairy-Free", "Eggplant", "Pizza", "Sandwiches", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Eggplant Mayo</strong>:", "2 medium eggplants, about 1 1/2 pounds total", "1 cup canola oil", "1 clove garlic, grated on a microplane grater", "2 teaspoons juice from 1 lemon", "2 teaspoons dijon or whole grain mustard", "&nbsp;", "Kosher salt", "<strong>For the Tomato Sauce</strong>", "2 tablespoons extra virgin olive oil", "1 clove garlic, grated on a microplane grater", "1/4 teaspoon red pepper flakes", "1/2 teaspoon dried oregano leaves", "1 (28-ounce) can whole peeled tomatoes", "&nbsp;", "<strong>For the Eggplant</strong>", "1/2 cup all-purpose flour", "1/2 cup water", "2 cups vegan bread crumbs", "1 quart vegetable oil for frying", "4 slices pizza bianca or other sandwich bread, lightly toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Eggplant Mayonnaise</strong>: Preheat oven to 400°F. Cut one eggplant in half lengthwise. Coat one half with 1 teaspoon oil, wrap tightly in foil, and roast until completely tender, about 1 hour (set remainint 1 1/2 eggplants aside). Once tender, scrape flesh from roasted eggplant and discard skin. Place flesh in cup that just fits around the head of an immersion blender. Add garlic, lemon juice, and mustard. Carefully add remaining oil so that it floats on top of the eggplant. Place head of immersion blender against bottom of cup and turn it on. Slowly pull it out of the jar forming a thick, creamy emulsion as you go. Season to taste with salt and set eggplant mayonnaise aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce</strong>: While the eggplant is roasting, heat olive oil in a medium saucepan over medium-high heat until shimmering. Add garlic, red pepper, and oregano and cook, stirring constantly, until fragrant, about 30 seconds. Add tomatoes and their juice. Crush tomatoes with a potato masher, a stiff whisk, or a hand blender. Bring to a boil, reduce to a simmer, and cook until thick and rich, about 45 minutes. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fried Eggplant</strong>: Slice remaining 1 1/2 eggplants thinly lengthwise into about 16 slices. Season with salt and allow to rest for 20 minutes. Blot firmly with paper towels to compress and remove excess moisture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and water, adding more flour or water as necessary to achieve a mixture about the consistency of thick pancake batter. Season to taste with salt. Add breadcrumbs to a shallow pie plate. Bread the eggplant slices one at a time by dipping in flour mixture, wiping off excess against side of bowl, and transferring to the crumbs. Press the crumbs firmly onto the eggplant so they adhere.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large wok or Dutch oven to 400°F as measured on an instant read thermometer. Fry eggplant slices in two to three batches, turning occasionally until golden brown and crisp on both sides. Transfer cooked slices to a large plate lined with paper towels and season with salt as soon as they emerge from the fryer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Slice bread in half. Spread some eggplant mayo on bottom half of each sandwich and top with eggplant slices (use half of the slices divided evenly between the four sandwiches). Top with half of the tomato sauce, using a spoon to spread evenly. Top with more eggplant mayo. Add a second layer of fried eggplant and a second layer of tomato sauce. Finish with more eggplant mayo and close sandwiches. Serve hot.</p>"}]}