{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120328-199085-dinner-tonight-rainbow-trout-honey-chile-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "fish", "pecans", "quick", "trout"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Rainbow Trout with Red Chili and Pecans", "link": "https://www.seriouseats.com/recipes/2012/03/rainbow-trout-with-red-chili-and-pecans-recipe.html", "description": "The same thing that originally attracted me to this recipe from the <em><a href=\"http://www.amazon.com/Colorado-Farmers-Market-Cookbook-Delicious/dp/1889593001\">Colorado Farmers Market Cookbook</a></em>, also gave me pause. I couldn't wait to see how the sweet heat of the honey and red chile glaze would pair with the fish fillets and the chopped pecans. This is even though I feared the honey would burn and the nuts would fall off, which is exactly what happened on the first round. Luckily, a little tinkering fixes everything.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Fish", "Nuts"], "recipeIngredient": ["1/2 cup pecans ", "1/2 cup honey ", "1 tablespoon red chili powder (ancho or guajillo work well) ", "4 rainbow trout fillets, with skin still attached", "Kosher salt and freshly ground black pepper ", "1 tablespoon vegetable oil  ", "1 lemon, cut into wedges "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse pecans in a food processor until finely chopped. Transfer pecans to a large plate. Heat the honey into a small saucepan set over medium-low heat. When warm, turn off the heat and stir in the red chili powder. Alternatively, microwave honey in a small bowl for 15 seconds until warm and stir in the chili powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the trout with paper towels. Season both sides with salt and pepper, and then brush the non-skin sides with the honey mixture. One at a time, roll the honey-side of each fillet in the pecans until well coated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the vegetable in a large non-stick skillet over medium heat. When shimmering, add as many of the fillets skin-side down as will comfortably fit. Cook until the skins are browned but not burnt, three to five minutes. Flip the fillets and cook until the other side is golden, about two minutes. Reduce the heat, if necessary. The honey will burn if the temperature is too high. Repeat process until all of the fillets are cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season to taste with salt and pepper, and serve with lemon wedges.  </p>"}]}