{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120529-207937-GFTues-FlourTortilla.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["bread", "gluten free", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Flour Tortillas", "link": "https://www.seriouseats.com/recipes/2012/05/gluten-free-flour-tortillas.html", "description": "The recipe makes a gluten-free flour tortilla that's chewy, bendable, and a perfect starting point for any toppings.", "totalTime": "about 40 minutes", "recipeYield": "about 12 tortillas", "recipeCategory": ["Bread", "Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["1 1/2 cups (about 6 ounces) white rice flour, plus additional for kneading and rolling tortillas", "1/2 cup (about 2 ounces) tapioca starch", "2 teaspoons granulated sugar", "1 teaspoon xanthan gum", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "2 tablespoons lard or vegetable shortening", "3/4 cup cold water, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together white rice flour, tapioca starch, granulated sugar, xanthan gum, baking powder, and salt. Using your hands, cut shortening into flour with a motion that's similar to snapping. No large pieces of shortening should remain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1/2 cup water. Stir into dough using a wooden spoon. Dough will be dry. Add additional 1/4 cup water. Stir. If dough begins to hold together, stop. If dough remains dry, add water, 2 tablespoons at a time, until it beings to hold together but isn't wet. It's a good idea to feel the dough as you add the water. It should feel damp, not wet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough onto generously white rice floured countertop. Begin to knead dough until it's smooth. It should not stick to your hands nor should it be wet. If the dough seems dry, add a tablespoon of water. If the dough is too wet, knead in additional flour. To test the consistency, pinch off a generous tablespoon and roll it between your palms. The dough should form a ball easily and not stick to your hands.  Cover dough with plastic wrap. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 10-inch cast iron skillet over medium heat. Line a tortilla press with a plastic bag that you've cut open on two sides. Flour the plastic bag with white rice flour. Pinch off about two tablespoons of dough. Roll into a ball and place in tortilla press. Flatten dough in the press. Remove. If dough seems thick, peel back the plastic bag from the tortilla, dust with a little additional white rice flour, cover and roll out slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase skillet heat to high. Heat until skillet begins to smoke lightly. Remove tortilla from plastic bag. Place in hot skillet. Cook for about three minutes. Tortilla should be lightly brown. (As your first tortilla cooks, begin pressing out the next tortilla.) Flip and cook an additional minute or two. Second side won't get as brown. Immediately transfer hot tortilla to a plate. Cover with a towel. Repeat process until all dough is used. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tortillas are best served right away. However, they can be stored overnight in a sealed plastic bag. Heat before serving to soften. </p>"}]}