{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120209-tomato-soup-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["soup", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8666666666667", "ratingCount": "15"}, "name": "15-Minute Creamy Tomato Soup (Vegan)", "link": "https://www.seriouseats.com/recipes/2012/02/15-minute-creamy-tomato-soup-vegan-recipe.html", "description": "Making excellent tomato soup from scratch at home is almost as easy as simply opening a can, and the return on your minor time investment is significant.", "totalTime": "15 minutes", "recipeYield": "makes 2 1/2 quarts, serving 4 to 6", "recipeCategory": ["Christmas", "Dairy-Free", "Soups and Stews", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 cup extra-virgin olive oil, divided", "2 cloves garlic, grated on a microplane grater", "1 small onion, finely sliced (about 1 cup)", "1 teaspoon dried oregano", "1/2 teaspoon red pepper flakes", "2 slices white bread, crusts removed, torn into rough 1/2-inch pieces", "2 (28-ounce) cans whole peeled tomatoes packed in juice", "Kosher salt and freshly ground black pepper", "Minced chives, basil, or parsley as garnish", "Toasted bread or grilled cheese for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a large saucepan over medium high heat until shimmering. Add garlic, onions, oregano, and red pepper flakes. Cook, stirring frequently until onions are softened but not browned, about 4 minutes. Add bread and tomatoes. Roughly mash tomatoes with a whisk or a potato masher. Add 2 cups water. Bring to a boil over high heat, then reduce to a simmer. Cook for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer half of soup to the jar of a blender. Blend soup, starting at low speed and gradually increasing to high (be careful starting up, it can shoot out the top of the blender&mdash;open the vent and hold a kitchen towel over the lid to prevent blowout). With blender running on high, gradually trickle in half of remaining olive oil. Season soup to taste with salt and pepper. Transfer to a large bowl and repeat with remaining half of soup and olive oil. Ladle into individual serving bowls, top with minced herbs, drizzle with more olive oil, and serve with toast or grilled cheese.</p>"}]}