{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121107-229201-homemade-cranberry-newtons3.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "Cookies", "cranberries", "diy", "newtons", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Cranberry Newtons", "link": "https://www.seriouseats.com/recipes/2012/11/homemade-cranberry-newtons-recipe.html", "description": "DIY cranberry-raspberry newtons with a sweet-tart filling and that signature cookie-cake texture.", "totalTime": "5 hours", "recipeYield": "Makes about 2 dozen", "recipeCategory": ["Breakfast Sweets", "Cookies", "Cranberry", "Desserts", "Fruit Desserts", "Raspberry"], "recipeIngredient": ["<strong>For the Dough:</strong>", "8 ounces (about 1 2/3 cup) all-purpose flour ", "1/4 teaspoon baking soda", "1/4 teaspoon salt", "1/8 teaspoon cinnamon", "4 ounces (1 stick) unsalted butter, room temperature", "2 ounces (About 1/4 cup) sugar", "2 ounces (about 3 tablespoons) light brown sugar", "1 ounce (about 2 tablespoons) honey", "2 1/2 teaspoons vanilla extract, divided", "2 teaspoons orange zest, divided", "3 egg yolks", "2 ounces (about 1/4 cup) orange juice, divided", "7 ounces (about 1 cup) dried sweetened cranberries", "5 ounces (about 1 cup) raspberries, fresh or frozen"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together flour, baking soda, salt, and cinnamon then set aside. In the bowl of a stand mixer fitted with the paddle attachment, cream together butter with the sugars, honey, 2 teaspoons vanilla, and 1 teaspoon orange zest on medium speed, scraping the bowl down as needed, until the mixture is light and fluffy, 3 to 5 minutes. Turn the mixer to low and add the egg yolks one at a time, scraping down the sides and mixing thoroughly with each addition. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour mixer, mixing until just combined then add 2 tablespoons orange juice, again mixing until just combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out a large sheet of plastic wrap and using a rubber spatula transfer the dough to the center of the plastic wrap. Fold to cover the dough then flatten into a large disc Wrap with additional plastic and refrigerate for four hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor add the cranberries, raspberries, remaining 2 tablespoons orange juice, and remaining 1/2 teaspoon vanilla extract. Process until you have a smooth paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move the oven rack to the center and preheat the oven to 325°F. Line a a cookie sheet with parchment paper or a silicone mat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously flour a large work surface then unwrap the dough. Dust the top of the dough before rolling it out to about a 1/4\" thickness. The dough will be sticky so don't be shy about lifting and moving the dough redusting both the work surface and the dough itself to make sure it doesn't stick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a sharp knife to cut the dough into 6 inch long strips that are about 3 1/2 inches wide. Carefully spoon a 1-inch wide and 1/4-inch tall line of filling down center of each strip, lengthwise. Carefully lift one of the sides of dough and bring it to the center then repeat for the other side of dough so that the dough overlaps to form a bar. Flip the bar over for the seam side is down then cut into 1 inch cookies and transfer to prepared cookie sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the tops of the cookies are firm and the cookies themselves are a light golden brown, 12 to 14 minutes. Transfer to a wire rack to cool for 5 minutes, then, while the cookies are still warm, transfer to a large zipper-lock bag and seal. The bag will help steam the cookies slightly to give them their signature cakey texture. Store leftovers in an airtight container for up to 1 week.</p>"}]}