{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121111-apple-pie-ice-cream-browning.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["apple", "ice cream", "pie", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Apple Pie Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/11/apple-pie-ice-cream-recipe.html", "description": "All the flavor of an apple pie without the hassle of making a crust or turning on the oven.", "totalTime": "1 1/2 hours, plus an overnight chill", "recipeYield": "makes about 6 cups", "recipeCategory": ["Apple", "Ice Cream and Frozen Treats", "Scooped", "Thanksgiving"], "recipeIngredient": ["3 tablespoons unsalted butter", "1 pound apples, such as Fuji or Cortland, chopped (about 4 cups)", "3/4 teaspoon Kosher salt, divided", "3/4 cup sugar, divided", "1 (12-ounce) can evaporated milk", "7 egg yolks", "2 cups cream", "1/8 teaspoon cinnamon", "1 cup roughly chopped tea biscuits"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy saucepan, melt butter on medium heat until foam subsides, then raise heat to high and stir in apples and 1/4 teaspoon salt. Cook, stirring frequently, until apples begin to breakdown into something like applesauce, about 15 minutes. Reduce heat to medium and continue to cook until apples become a relatively smooth sauce that can be dragged across the bottom of the pan with a wooden spoon. Add 1/4 cup sugar, increase heat to high, and cook until apples turn a dark caramel color, 2 to 3 minutes. Stir frequently to avoid burning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer apples to blender and add evaporated milk. Purée for 30 seconds until very smooth. Set saucepan aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together egg yolks and 1/2 cup sugar in saucepan until well combined, then whisk in apple purée, cream, cinnamon, and remaining 1/2 teaspoon salt. Cook on medium heat, whisking frequently to dissolve browned pits in bottom of pan, until a custard forms on the back of a spoon but a swiped finger leaves a clean line, 10 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour custard through a strainer into an airtight container, cover, and chill overnight or at least six hours. The next day, churn according to manufacturer's instructions. Transfer back to airtight container, quickly stir in tea biscuits, and chill in freezer for at least three hours before serving.</p>"}]}