{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120430-203624-thai-shortbread-cookies-khanom-kleeb-lamduan-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "Thai", "keywords": ["Cookies", "easy", "my thai cooking", "shortbread", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai Shortbread Cookies (Khanom Kleeb Lamduan)", "link": "https://www.seriouseats.com/recipes/2012/05/thai-shortbread-cookies-khanom-kleeb-lamduan.html", "description": "[Photograph: Leela Punyaratabandhu] The most difficult thing about this recipe is to gauge just the right consistency of the dough; if it's too dry, you can't roll it into balls and if it's too wet, the flowers won't hold their...", "totalTime": "40 minutes", "recipeYield": "makes approximately 60 one-inch flower-shaped cookies", "recipeCategory": ["Cookies", "Desserts", "Thai"], "recipeIngredient": ["5 ounces (1 cup) cake or all-purpose flour", "2 1/2 ounces (1/2 cup plus 2 tablespoons) powdered sugar", "1/2 teaspoon salt", "1 teaspoon vanilla extract or 1/2 teaspoon rose water (optional)", "Approximately 3/4 cup mild-flavored vegetable oil", "One Thai scented candle (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour, powdered sugar, salt, and vanilla (if used) in a medium mixing bowl; mix them together with your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With your the tips of your fingers, mix about 1/4 cup of the oil into the flour mixture. Continue to add more oil, 1/2 tablespoon at a time, to the flour until you have a dough that looks somewhat shaggy but is no longer crumbly and does not stick to the sides of the bowl. To check whether the dough is ready, pick up about a tablespoon and squeeze it hard in your fist. If the dough doesn't fall apart, stop adding more oil at that point. (When in doubt, always err on the side of adding too little oil.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pinch off a small piece of dough at a time, squeeze it tightly in your fist, then roll it into a 1/2-inch ball; arrange the balls on a large tray. Repeat until the dough is all gone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the dough balls, about one inch apart (these cookies don't spread much at all), on two large cookie sheets which have been lined with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quarter each dough ball with a sharp paring knife. Separate out one piece of dough and form it into a little ball; set aside. Rearrange the other three pieces of dough to even out the space between the \"petals.\" Join the tips of the petals together and press lightly with the tip of your paring knife just to secure them together. Then place the ball in the center where the petals meet and, with the dull side of your knife, make three shallow grooves on the ball that point in the same directions as the three petals.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once you're almost done with forming flowers out of the dough, preheat the oven to 350°F and position oven rack in the center position.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies until they are set but still pale in color, 10 to 12 minutes (these cookies shouldn't be golden brown). Remove the cookies from the oven and allow them to cool completely on the baking sheets.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you have opted to perfume the cookies with a Thai scented candle, arrange the cooled cookies in a glass or ceramic jar/bowl, leaving some space in the middle. Place a small glass or ceramic dish in the center. Light the scented candle on both ends and gently place it in the dish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Close the jar lid tightly (if you use a bowl, find a plate that is wider than the bowl's opening and cover the bowl with it). Leave the cookies in the jar to allow them soak up the candle scent for about 30 minutes before serving.</p>"}]}