{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121210-232966-cook-the-book-spinach-gorgozola-flank-steak.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Bruce Aidells", "Cook the Book", "flank steak", "Gorgonzola", "holiday", "spinach", "The Great Meat Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bruce Aidells' Spinach and Gorgonzola-Stuffed Flank Steak", "link": "https://www.seriouseats.com/recipes/2012/12/bruce-aidells-spinach-and-gorgonzola-stuffed.html", "description": "For a big, rollicking holiday meal, a large beef or pork roast serves as an excellent centerpiece. But for those with a smaller holiday table, a more diminutive entree is warranted. <strong><a href=\"http://www.aidells.com/our-way/aidells-story\">Bruce Aidell's</a></strong> <strong>Spinach and Gorgonzola-Stuffed Flank Steak</strong> from <em><a href=\"http://www.amazon.com/The-Great-Meat-Cookbook-Everything/dp/0547241410/?tag=serieats-20\">The Great Meat Cookbook</a></em> is just the ticket. The stuffing is a snap to throw together but full of funky blue cheese and earthy spinach. Since the cheese makes the filling sticky, it stays put when rolled up into a pounded (or butterflied) flank steak. A quick sear and 25 minutes of roasting later, and the elegant, yet reasonably-sized holiday roast can be on the table.", "totalTime": "1 hour and 15 minutes", "recipeYield": "serves 6", "recipeCategory": ["Beef", "Cook the Book", "Mains", "Spinach"], "recipeIngredient": ["1 1 1/2- to 2 1/2-pound flank steak, trimmed", "3 tablespoons olive oil", "1 shallot, finely chopped", "1 pound spinach, washed, stemmed, and chopped", "1 cup fresh bread crumbs", "1/2 pound Gorgonzola or other blue cheese, crumbled", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To butterfly the steak: Using a long sharp knife, holding it parallel to the work surface, cut through one long side of the steak, stopping about 1/2 inch from the opposite side. Open up the steak as you would a book. (Don’t worry if you made a hole or two in the meat, because it will be concealed when you roll up the steak.) Or, if the steak is already thin, don’t butterfly it; just pound it with a meat mallet to 1/4 to 1/2 inch thick. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet over medium heat and add 1 tablespoon of the olive oil. Add the shallot and sauté until soft, about 3 minutes. Add the spinach and cook until just wilted, about 3 minutes. Transfer to a strainer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When it is cool enough to handle, squeeze out all of the moisture from the spinach. You should have about 1 cup of spinach. Transfer to a medium bowl and stir in the bread crumbs and cheese. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the steak on a sheet of plastic wrap with a long side of the steak facing you. Smear the spinach mixture evenly over the steak, leaving a 1-inch border along the edge farthest from you. Beginning with the side nearest you and using the plastic wrap as an aid, roll up the steak, gently pressing on the filling, then tie the rolled steak with butcher’s twine at 2- to 3-inch intervals. Season the outside with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 2 tablespoons olive oil in a large roasting pan or ovenproof skillet over medium-high heat. Sear the roast on all sides, about 3 minutes per side. Place in the oven and roast for 25 minutes, or until an instant-read thermometer inserted into the center of the roast reads 120°F to 125°F for medium-rare. Transfer to a cutting board, tent with aluminum foil, and allow to rest for 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, remove the string from the steak and cut into 1/2- to 3/4-inch-thick slices.</p>"}]}