{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120912-cookie-monster-grape-thyme-bars.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["bar cookies", "cookie monster", "Cookies", "grapes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Concord Grape-Thyme Bars", "link": "https://www.seriouseats.com/recipes/2012/09/concord-grape-thyme-bars-recipe.html", "description": "Concord grapes are cooked down with thyme to make a sweet jam, then used as the filling for these buttery bar cookies.", "totalTime": "", "recipeYield": "makes 12 large squares", "recipeCategory": ["Cookie Monster", "Cookies", "Grapes"], "recipeIngredient": ["1 pound concord grapes, stemmed", "1 tablespoon fresh juice from about 1 lemon", "2 cups (about 14 ounces) sugar", "2 teaspoons chopped fresh thyme", "3 cups (about 15 ounces) all purpose flour", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 large egg", "16 tablespoons (8 ounces) unsalted butter, chilled and cut into 1/4-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze grapes between your fingers to separate the skins from the pulp. Place skins in bowl of food processor and pulse until roughly chopped, about 5 pulses. Place pulp in medium saucepan. Bring to boil over medium-high heat, then reduce heat to medium-low and simmer until the grapes lose their shape, about 10 minutes. Pour pulp through a fine mesh sieve into a large bowl. Use a paddle or large spoon to push pulp through sieve. Discard seeds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine grape skins, pulp, lemon juice, and 1 cup sugar in now empty saucepan. Bring to boil over medium-high heat, then reduce heat to medium low and simmer for 30 minutes. Add thyme and continue simmering, stirring frequently, until mixture is reduced and has thickened to a jam-like consistency, about 15 minutes more. Remove saucepan from heat and transfer to a bowl to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375&deg;F. Butter a 13- by 9-inch baking dish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of food processor, combine flour, baking powder, remaining 1 cup sugar, and salt; pulse to combine, about 5 pulses. Add egg and butter and pulse until mixture is cohesive but still crumbly, 8 to 12 pulses. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press 2/3 of dough into bottom of prepared baking dish. Spread grape jam evenly over dough. Sprinkle remaining dough over jam, leaving pockets of jam visible. Bake until golden and set, about 45 minutes. Transfer to cooling rack and cool completely, about 1 hour. Cut into 12 squares and serve. </p>"}]}