{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120308-dt-salmon-sandwich-with-sweet-mustard-sauce-primary.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "salmon", "sandwich", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Open-Faced Salmon Sandwich with Sweet Mustard Sauce", "link": "https://www.seriouseats.com/recipes/2012/03/open-faced-salmon-sandwich-with-sweet-mustard-sauce-recipe.html", "description": "The Scandinavians value the open-faced sandwich highly, the kind eaten at a table in a proper way; leave it to Samuelsson to take that idea and run with it. This sandwich features some familiar flavors and some new ones (especially Samuelsson's genius mustard sauce of Dijon, honey, olive oil, and lime juice), and an inventiveness with how the ingredients are prepared.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Salmon", "Sandwiches"], "recipeIngredient": ["2 tablespoons Dijon mustard", "1 tablespoon honey", "3 tablespoons olive oil, plus more for brushing salmon and bread", "2 limes", "Kosher salt and freshly ground black pepper to taste", "1 pound salmon fillets", "1 red onion, sliced into half moons", "1 tomato, cut into 1/2 inch thick wedges", "4 thick slices rye or multigrain bread, brushed with olive oil", "4 leaves romaine lettuce or a handful of smaller greens", "1 egg, hard boiled and sliced", "1 avocado, cut into slices", "1 1/2 teaspoons capers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the Dijon, honey, olive oil, and the juice of one of the limes.  Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a grill or broiler. Brush the salmon fillets on each side with olive oil, and season liberally with salt and pepper. Grill until just cooked through, 3-4 minutes per side (or broil, skin-side down, until just cooked through, 6-8 minutes).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the salmon is cooking, toss the onions and tomato in the sweet mustard sauce to coat, and spread them in a grilling basket (or a small broiler-proof dish).  Grill (or broil) until they are just tender. Grill (or broil) the bread along with the vegetables until golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the lettuce on the bread, then top with the salmon, onions, tomato, avocado, hard boiled egg, capers, and the juice of the second lime. Serve immediately with more of the sauce for drizzling.</p>"}]}