{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120522-ctb-tofu.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["banana leaves", "Cook the Book", "Herbivoracious", "Michael Natkin", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Michael Natkin's Aromatic Tofu Packets", "link": "https://www.seriouseats.com/recipes/2012/05/michael-natkins-aromatic-tofu-packets.html", "description": "These <strong>Aromatic Tofu Packets</strong> from <a href=\"http://herbivoracious.com/about\">Michael Natkin</a>'s <a href=\"http://www.amazon.com/Herbivoracious-Revolution-Vibrant-Original-Vegetarian/dp/1558327452/?tag=serieats-20\">Herbivoracious</a> are a prime example of why banana leaves have a permanent place in my freezer.  Natkin combines a Asian veggies with soy sauced blocks of tofu and wraps them in banana leaves to steam and let all of the flavors meld.", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Mains", "Tofu", "Vegetarian"], "recipeIngredient": ["1 1⁄4 pounds firm or extra-firm tofu", "1⁄4 cup soy sauce (use a wheat-free version for gluten-free)", "1 tablespoon mirin", "1 teaspoon vegetable broth powder (gluten-free if needed; optional)", "1⁄4 cup water", "1-inch piece fresh ginger, peeled and grated", "1 stalk lemongrass, trimmed, pounded, and minced", "2 jalapeño or other chile peppers (heat to your taste), seeded and thinly sliced", "2 scallions, white and light green parts only, thinly sliced lengthwise", "Half an orange or yellow bell pepper, finely diced", "Freshly ground black pepper", "2 pieces long pepper, crushed in a mortar and pestle", "1 lime, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using banana leaves, you must make them pliable first. Cut out any thick ribs and either boil them for 20 minutes or use tongs to run them over a hot flame.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the tofu into 8 evenly sized slabs about 1⁄2 inch thick. Holding your knife at an angle to the surface of your cutting board, score each slice in two perpendicular directions, being careful not to cut all the way through, with cuts about 1⁄4 inch apart. (Making angled cuts, rather than straight up-and-down ones, exposes even more surface area to the sauce.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the soy sauce, mirin, broth powder (if using), and water. Place two pieces of tofu in the center of each piece of parchment paper or banana leaf, and spoon a tablespoon or two of the sauce over each one, gently working it into the score lines.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Evenly divide the ginger, lemongrass, jalapeño pepper, scallions, and bell pepper among the packets. Season each with several grinds of black pepper and a big pinch of long pepper.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the top half of the parchment paper or banana leaf down over the tofu, then fold the bottom half up over the top; crimp the top and bottom halves together. Fold the open sides under twice to make a firm seal, moderately tight around the ingredients, but leave a bit of room for steam. Secure the sides with toothpicks. Place the packets on a baking sheet and bake for 20 minutes. If you are using parchment paper, it will turn quite brown; don’t be concerned.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, place each packet on an individual plate. Tell the diners to open them carefully and enjoy the aromatic steam. Pass the lime wedges.</p>"}]}