{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121130-231829-Chicken-Egg-Foo-Young-primary.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "Chinese", "keywords": ["chicken", "chicken dinners", "egg foo young", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Chicken Egg Foo Yung and Garlic Bok Choy", "link": "https://www.seriouseats.com/recipes/2012/12/chicken-egg-foo-young-recipe.html", "description": "Learn how to make this classic Chinese-American restaurant style dish at home. Succulent chicken omelettes with crunchy wood ear mushrooms, bean sprouts, smothered in an oyster and rice wine sauce. Served with garlic bok choy and steamed rice.", "totalTime": "1 hour", "recipeYield": "serves 3 to 4", "recipeCategory": ["Chicken", "Chicken Dinners", "Chinese", "Mains"], "recipeIngredient": ["10 ounces boneless skinless chicken breast or thigh (see note), cut into 1-inch cubes", "4 tablespoons Shaoxing wine or dry sherry, divided", "Kosher salt and freshly ground black pepper", "1 1/2 cups homemade or store-bought low-sodium chicken stock", "2 tablespoons plus 1 teaspoon cornstarch", "3 tablespoons oyster sauce", "1 1/2 tablespoons soy sauce", "1/2 teaspoon white pepper, divided", "6 large eggs", "1 cup bean sprouts", "1 1/2 cup re-hydrated wood ear mushrooms, rinsed and sliced into 1/2-inch ribbons (see note), divided", "1 small onion, diced (about 3/4 cup)", "2 large scallions, chopped (1/2 cup), plus extra for garnishing plate", "1 1/4 cups plus 3 tablespoons vegetable oil", "8 cloves garlic, sliced thin", "1 pound baby bok choy, washed but not dried, halved vertically", "4 cups cooked rice to serve on side"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, toss chicken pieces with 2 tablespoons rice wine and 1/2 teaspoon salt; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>in small bowl, whisk 1/2 cup chicken broth with cornstarch; set aside. In small saucepan over medium heat, whisk remaining cup chicken broth, oyster sauce, remaining 2 tablespoons rice wine, soy sauce, and 1/4 teaspoon white pepper. Bring to simmer and whisk in cornstarch mixture. Bring to boil, gently whisking, until sauce comes to boil and thickens. Season to taste with salt and pepper. Remove from heat and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, whisk eggs with 1/2 teaspoon salt and remaining 1/4 teaspoon white pepper. Toss in bean sprouts, 1/2 cup mushrooms, onions, and scallions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In wok or 10-inch nonstick skillet (see note), heat 2 tablespoons oil over medium heat until shimmering. Add chicken and cook, stirring, until just cooked through, about 5 minutes. Remove chicken with slotted spoon and place on paper towel-lined plate. Add chicken to egg mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons oil to wok. When shimmering, ladle approximately a tablespoon of egg mixture liquid into oil (see note). Immediately ladle in about 1/2 cup of egg mixture, including all solids, on top. Fry until the bottom is golden brown, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly but carefully, flip omelette and cook until golden, about 30 seconds more. Using slotted spoon, transfer omelette to large serving plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat steps 5 and 6 to form remaining omelets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When omelets are done, cook bok choy. Heat 3 tablespoons oil in wok over high heat until shimmering. Add garlic and cook until pale golden, about 1 minute. Add bok choy, toss to combine, then cover and cook until tender-crisp, about 5 minutes. Stir in wood ear mushrooms and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve bok choy and omelets with prepared gravy and white rice on the side.</p>"}]}