{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120608-chichi-chinese-sweet-and-sour-ribs.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "Chinese", "pork", "spare ribs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese Takeout-Style Sweet and Sour Spare Ribs", "link": "https://www.seriouseats.com/recipes/2012/06/sweet-and-sour-spare-ribs-recipe.html", "description": "Spare-ribs, deep-fried so they are golden brown and a little crisp, are simmered in soy sauce and sugar.  The mixture reduces into a syrupy glaze. At the last moment, spoonfuls of Chinkiang Vinegar are mixed in, imparting a subtle degree of sourness.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Mains", "Pork"], "recipeIngredient": ["1 pound spare ribs, preferably cut into 2-inch sections", "1 quart cooking oil", "One 2-inch piece of ginger, sliced into a couple of slabs", "2 scallions, roughly chopped", "3 tablespoons Shaoxing rice wine", "Kosher salt", "2 teaspoons soy sauce", "4 tablespoons white sugar", "1 to 1 1/2 tablespoons Chinkiang vinegar", "1/2 teaspoon sesame oil, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a wok over high heat until it reaches 350°F.  Carefully dry ribs with paper towels, then add to oil and fry until golden brown, about 5 minutes, turning and agitating occasionally as they cook. Using a slotted spoon or chopsticks, transfer ribs to a paper towel-lined plate. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour all but 3 tablespoons of the oil in the wok.  Return wok to medium heat and heat oil until shimmering. Add the scallions and ginger and stir-fry until fragrant, about 30 seconds. Add the ribs and stir-fry for a minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefuly add enough water to cover the ribs at least ¾ of the way, about 1 cup.  Add the soy sauce, sugar, and salt.  Simmer over low heat until the ribs are tender, 30 to 40 minutes.  As the liquid reduces, turn the ribs and spoon the liquid over them.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sauce has reduced to syrupy consistency, add the vinegar and cook for a few minutes longer.  Turn off the heat, drizzle in the sesame oil if using, and serve warm or at room temperature.    </p>"}]}