{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20120102-knead-the-book-poolish-baguettes.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baguette", "bread baking", "breads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Fundamental Techniques of Classic Bread Baking's Poolish Baguettes", "link": "https://www.seriouseats.com/recipes/2012/01/bread-baking-poolish-baguette-recipe.html", "description": "What bread is more classic and more French than the baguette? This recipe from <em><a href=\"http://www.amazon.com/Fundamental-Techniques-Classic-Bread-Baking/dp/158479934X\">The Fundamental Techniques of Classic Bread Baking</a></em> is simple, really. Just flour, water, yeast, and salt. But with bread baking, ingredients are sometimes less important than technique. Take the same ingredients, even in the same quantities, and if you handle them in a different way, you'll end up with a completely different bread.", "totalTime": "18 hours", "recipeYield": "Makes 4 loaves", "recipeCategory": ["Bread Baking", "Yeast Bread"], "recipeIngredient": ["<strong>For the poolish:</strong>", "56 grams / 2 ounces bread flour", "56 grams / 2 ounces cool water", "1 gram / pinch fresh yeast", "For the final dough:", "754 grams / 1 pound 10 2/3 ounces bread flour", "511 grams / 1 pound 2 ounces water", "16 grams / 1/2 ounce salt", "6 grams / 1/4 ounce fresh yeast", "Poolish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the mise en place for the poolish, taking care that the water is about 75 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the poolish, combine the bread flour and water with the yeast in a large mixing bowl, stirring with a wooden spoon to blend. When blended, scrape down the edge of the bowl, cover with plastic film, and set aside to ferment at 70 degrees for 12 to 14 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to make the final dough, prepare the mise en place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the bread flour with the water in the bowl of a standing electric mixer fitted with the hook. Mix on low speed until blended. Stop the mixer and autolyse for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt along with the yeast and poolish and mix on low for 5 minutes. Increase the mixer speed to medium and mix for about 8 minutes, or until the dough has come together but remains slightly sticky. Check the gluten development by pulling a window.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a large bowl or container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough into the prepared bowl. Cover the bowl with plastic film and set aside to ferment for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover and fold the dough.Again, cover with plastic film and set aside to ferment for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About an hour before you are ready to bake the loaves, place the baking stone or tiles into the oven and preheat to 470 degrees. If using a pan to create steam, place it in the oven now.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a clean, flat work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the dough and divide it into four 350-gram / 12 1/2 ounce logs on the floured surface. Cover with plastic film and bench rest for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the dough and, if necessary, lightly flour the work surface. Gently press on the dough to degas and carefully shape each log into a baguette. Place each baguette, seam-side down, into a baguette pan. Cover with plastic film and proof for 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the dough and, using a lame or razor, immediately score the loaves. To make the required steam, add 1 cup of ice to the hot pan in the oven. Immediately transfer the bread pans to the hot baking stone in the preheated oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, with steam, for 25 minutes, or until the crust is a deep golden-brown color and the sides are firm to the touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and transfer to wire racks to cool.</p>"}]}