{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120910-220002-salmon-fennel-curry-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "Thai", "keywords": ["curry", "my thai", "quick", "salmon", "seafood", "soup", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Salmon-Fennel Red Curry", "link": "https://www.seriouseats.com/recipes/2012/09/salmon-fennel-red-curry-recipe.html", "description": "A quick red coconut curry with tender salmon and crisp fennel, flavored with peppers and basil.", "totalTime": "", "recipeYield": "serves 4 to 6", "recipeCategory": ["Mains", "Salmon", "Soups and Stews", "Thai"], "recipeIngredient": ["1 (14-ounce) can full-fat coconut milk ", "1/4 cup Thai red curry paste (more or less to taste)", "2 pounds skinless salmon fillets, cut into 2-inch cubes ", "1 large bulb fennel, trimmed, cored, and sliced thinly lengthwise (about 1 1/2 quarts)", "1 teaspoon granulated sugar (more or less to taste)", "2 tablespoons fish sauce (more or less to taste)", "2 to 3 jalapeño or serrano peppers, sliced (optional) ", "1/2 cup Thai basil leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open caned coconut milk without shaking and scoop out three quarters of the solid coconut cream at the top nto a 4-quart saucepan and set it over medium-high heat. Add curry paste to coconut cream and cook, stirring occasionally, until fat separates from the cream and mixture begins to fry, about 4 minutes. Add the remaining coconut milk to the pot along with fennel; bring to a gentle boil, and reduce to a simmer. Cook, stirring occasionally, until fennel is tender-crisp, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add salmon, sugar, and fish sauce. Adjust the sauce to desired consistency with water. Continue simmering until salmon is just cooked through. Adjust seasoning with more sugar or fish sauce if desired. Stir in peppers and basil leaves. Serve immediately with steamed jasmine rice.</p>"}]}