{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120806-127677-Steak-and-Avocado-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["30-minute recipes", "avocado", "guacamole", "quick", "sandwich", "sandwiched", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Grilled Steak, Avocado, and Spicy Crema Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/08/grilled-steak-avocado-and-spicy-crema-sandwiches.html", "description": "Toasted bread, grilled steak, velvety avocado, and cool spicy crema make this an incredibly satisfying sandwich.", "totalTime": "30 minutes", "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Avocado", "Quick Dinners", "Sandwiches"], "recipeIngredient": ["3 tablespoons olive oil", "1 1/2 pounds hanger or skirt steak (see note)", "Kosher salt and freshly ground black pepper", "8 (1/2-inch-thick) slices boule or rustic bread", "2 ripe avocados", "1/2 cup chopped fresh cilantro leaves", "2 tablespoons juice and 1/2 teaspoon finely grated zest from 2 limes", "2 scallions, finely chopped", "2 medium cloves garli, minced (about 2 teaspoons)", "1/4 cup crema or sour cream", "1 tablespoon (or more to taste) hot sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Steak and Bread:</strong> Heat 1 tablespoon oil in large grill pan over medium-high heat until just smoking, or, heat grill according to manufacturer’s instructions. Pat steak dry with paper towels and season with salt and pepper. Cook, turning frequently until well-charred and an instant read thermometer inserted into the thickest part of each steak registers 125°F for medium rare or 130°F for medium, about 8 minutes total. Transfer to a cutting board, tent with foil, and allow to rest for 5 minutes. Proceed to step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Alternatively, to finish indoors:</strong> Pat steak dry with paper towels and season with salt and pepper. Heat 1 tablespoon vegetable or canola oil in a large stainless steel or cast iron skillet over high heat until shimmering. Add steak and cook, turning frequently, until an instant-read thermometer registers 120 to 125°F for medium-rare, reducing heat as necessary if steak smokes excessively or starts to burn. Transfer to a wire rack set in a rimmed baking sheet and allow to rest 5 to 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, wipe out grill pan, if using, or pan. Brush one side of each bread slice with remaining 2 tablespoons oil and cook over medium heat, 2 slices at a time, oiled side down, until golden and toasted, about 2 minutes. Transfer to cooling rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Avocado Spread and Crema:</strong> Remove and discard avocado pits, then scoop flesh out into large bowl. Coarsely mash with fork.  Stir in cilantro, lime juice, lime zest, scallions, and garlic. Season to taste with salt and pepper. In small bowl, stir together crema and and hot sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Cut steak into 1/2-inch-thick slices. Spread 4 bread slices with avocado spread, then top with sliced steak. Spread remaining 4 bread slices with crema and press down on sandwich. Cut sandwiches in half and serve immediately.</p>"}]}