{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121017-226668-smooth-pumpkin-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["essential", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.9285714285714", "ratingCount": "14"}, "name": "Extra-Smooth Pumpkin Pie", "link": "https://www.seriouseats.com/recipes/2012/11/extra-smooth-pumpkin-pie-recipe.html", "description": "An extra-smooth and creamy pumpkin pie. The secret ingredient is cream cheese, which gives it a smooth, rich texture, and a mild tang.", "totalTime": "4 hours", "recipeYield": "Serves 8", "recipeCategory": ["Christmas", "Pies, Tarts, and Crumbles", "Pumpkin", "Thanksgiving"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>", "6 ounces granulated sugar", "1/2 teaspoon kosher salt", "1 teaspoon ground cinnamon", "1 teaspoon ground ginger", "1/2 teaspoon freshly grated nutmeg", "8 ounces cream cheese, at room temperature", "1 (15-ounce) can pumpkin puree, or 15 ounces homemade pumpkin puree", "4 tablespoons unsalted butter, melted and cooled", "3 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position. Place a heavy duty rimmed baking sheet on the rack and preheat oven to 425&deg;F. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll pie dough into a circle roughly 12-inches in diameter. Transfer to a 9-inch pie plate. Using a pair of kitchen shears, trim the edges of the pie dough until it overhangs the edge of the pie plate by 1/2 an inch all the way around. Fold edges of pie dough down, tucking it under itself, working your way all the way around the pie plate until everything is well tucked. Use the forefinger on your left hand and the thumb and forefinger on your right hand to crimp the edges. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (you can use reuse dried beans for this), transfer pie to the preheated baking sheet, and bake for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a golden brown, about 10 minutes. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to 350&deg;F. In the bowl of a food processor, combine sugar, salt, cinnamon, ginger, and nutmeg, and pulse 3 times to mix. Add the cream cheese and pulse until a homogeneous paste forms. Add the pumpkin and butter and process for 30 seconds. Stop to scrape down the sides of the bowl, then process until the mixture is completely smooth, about 30 seconds longer. Add the eggs and process until completely smooth, scraping down sides as necessary. For extra-smooth pumpkin pie, press the mixture through a fine-mesh strainer or a chinois using the back of a ladle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into prepared pie shell and smooth over the top with a rubber spatula. Rap the shell firmly against the counter a few times in order to release any air bubbles. Transfer pumpkin pie to the baking sheet in the oven and bake for until the filling puffs slightly and the center only moves slightly when jiggled, 30 to 35 minutes, rotating the pumpkin pie half way through baking. Allow the pumpkin pie to cool for at least one hour before serving. The pumpkin pie may be chilled for up to two days.</p>"}]}