{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121109-payard-Pumpkin-macarons.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["Cookies", "fall desserts", "francois payard", "macarons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Francois Payard's Pumpkin Macarons", "link": "https://www.seriouseats.com/recipes/2012/11/francois-payards-pumpkin-macaron-recipe.html", "description": "In this autumn recipe from Francois Payard, classic macaron shells are filled with a spiced pumpkin ganache.", "totalTime": null, "recipeYield": "Makes about 50 macarons", "recipeCategory": ["Cookies", "Desserts", "Pumpkin"], "recipeIngredient": ["<strong>For Shells</strong>", "3 1/2 cups (450 grams) confectioners’ sugar", "4 cups (400 grams) \talmond flour or finely ground blanched almonds", "9 large egg whites, at room temperature", "2 cups (400 grams) sugar", "1 teaspoon allspice", "5 drops orange food coloring", "&nbsp;", "<strong>For Pumpkin Ganache Filling</strong>", "2/3 cup plus 1 tablespoon (80 grams) sugar", "12 teaspoons (180 grams) cream", "4 teaspoons (16 grams) cornstarch", "7 tablespoons (100 grams) butter", "3.2 ounces (90 grams) white chocolate", "6 tablespoons pumpkin puree", "2 teaspoons allspice", "2 teaspoons cinnamon", "Pinch ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the macarons:</strong> Place a rack each in the upper and bottom thirds of the oven and preheat the oven to 400°F. Line 2 baking sheets with silicone baking mats. If you have enough baking sheets, double them up (this will prevent the macarons from baking too fast). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the confectioners’ sugar and almond flour over a large bowl. Stir in 4 egg whites, until the mixture is smooth and lump-free.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a candy thermometer handy, combine the sugar and 1/2 cup (125 grams) water in a medium saucepan over medium-high heat. If sugar sticks to the sides of the pot, dip a pastry brush in water and brush the sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sugar is cooking, put the remaining 5 egg whites in the bowl of an electric mixer fitted with the whisk attachment. Once the sugar reaches 221°F on the candy thermometer, start beating the eggs on high speed. When the sugar reaches 250°F, pour it into the eggs in a slow stream, with the mixer running, down the inside of the bowl. Continue beating until the meringue is thick and the bottom of the bowl is cool to the touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a silicone spatula, gently fold the meringue into the dry ingredients and food coloring, in 4 increments. Fold until everything is well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the batter in a pastry bag or resealable plastic bag, and cut a ½-inch opening in the tip or corner of the bag. Pipe the batter into quarter-size circles onto the prepared baking sheet, leaving about 1 inch in between each macaron. The macarons should have a uniform size. Let them sit out at room temperature for 15 minutes, until a skin forms. This will transform into a beautiful crust on the finished macarons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the macarons in the oven, and turn the oven off for 5 minutes. After that time, turn it back on to 400°F, and continue baking for 8 minutes, until a crust forms and they are soft inside. Remove from the oven, and let the macarons cool in the pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the ganache:</strong> Start by bring the cream to a boil. Mix the cornstarch and sugar together in a separate bowl. Temper the cream into the sugar and cornstarch mixture, and then pour back into the pan. Let the mixture cook and when it comes to a boil, add the pumpkin puree and spices. Mix well. Pour the mixture over the white chocolate, and whisk until the chocolate is melted and the mixture is smooth. Let the ganache cool, stirring occasionally with a silicone spatula until it reaches about 40°F and then add the butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the ganache onto a sheet pan, cover with plastic wrap and let the ganache cool at room temperature for at least 3 hours or overnight. (Note: it is best to prepare the ganache the day before to get the smoothest consistency).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the macarons:</strong> Turn the silicone baking mat over, and carefully pull it away from the macarons, to free them up. Turn half of the macarons over, so that their flat side is facing up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the ganache into a pastry bag or resealable plastic bag, and cut a ½-inch opening in the tip or corner of the bag. Pipe a nickel-size amount of ganache in the center of the macarons that are facing up. Gently press the remaining macarons over the ganache, to make small sandwiches. Try to match the size of the two halves as much as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the macarons in an airtight container in the refrigerator for up to 1 week, or in the freezer for up to 2 months.</p>"}]}