{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120430MustardlySalmon.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Dinner for Two", "fish", "mains", "mustard", "quick", "salmon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Easy Crunchy Mustard-Baked Salmon", "link": "https://www.seriouseats.com/recipes/2012/05/dinner-for-two-easy-crumbly-mustardly-salmon.html", "description": "Crispy-bottomed salmon topped with a mountain of buttery, two-mustard crumbs and fresh herbs. Made with six ingredients and in only ten minutes!  The perfect glammed-up, easy dinner for two.", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner for Two", "Mains", "Salmon"], "recipeIngredient": ["2 slices high quality white sandwich bread, crusts removed, torn into rough chunks.", "2 boneless skinless salmon filets, about 6 ounces each", "Kosher salt and freshly ground black pepper", "1 tablespoon unsalted butter, softened, plus extra for the salmon", "1/2 tablespoon Dijon mustard", "1 teaspoon whole grain mustard", "1 teaspoon fresh thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler to high and adjust rack to 6 inches below the element. Pulse bread in the bowl of a food processor until coarse crumbs are created, about 10 to 12 one-second pulses. Season the salmon with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, mix together the breadcrumbs, 1 tablespoon butter, both mustards, and thyme, pinching the mixture together so the butter is incorporated and the mixture sticks together.  Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the bottom of each fillet of salmon with a thin layer of butter.  Preheat a medium skillet over medium-high heat for 2 minutes. Add salmon buttered-side down and cook without moving until a nice crust has formed, about 2 minutes. Pile the crumbs on the salmon, then transfer to the broiler. Broil until the crumbs are crunchy and browned, 4 to 5 minutes. Serve immediately.</p>"}]}