{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120131-190586-carbonade-a-la-gueze-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beer", "Cook the Book", "Edward Behr", "lambic", "The Art of Eating Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Art of Eating's Carbonade à la Gueuze", "link": "https://www.seriouseats.com/recipes/2012/02/the-art-of-eatings-sauteed-carbonade-a-la-gueuze-recipe.html", "description": "There are countless liquids to braise in, but never before have we come across one that uses sour beer.  This <strong>Carbonade à la Gueuze</strong> from <a href=\"http://www.artofeating.com/\">Edward Behr</a>'s <em><strong><a href=\"http://www.amazon.com/Art-Eating-Cookbook-Essential-Recipes/dp/0520270290/?tag=serieats-20\">The Art of Eating Cookbook</a></strong></em> is a traditional Belgian beef dish that employs tart, bracing geuze or young lambic.  If you're familiar with sipping these tart, puckery brews you can probably imagine the complexity that they lend to a beef stew, an intriguing background of sourness that's offset by the addition of a bit of sugar just before serving.", "totalTime": "3 hours 45 minutes", "recipeYield": "serves 6", "recipeCategory": ["Beef", "Beef Stew", "Cook the Book"], "recipeIngredient": ["3 1/2 pounds beef chuck (shoulder)", "Lard or excellent, fresh-tasting olive oil or another good, light cooking oil", "4 or more large onions, totaling as much as 2 1/4 pounds", "1/4 cup all-purpose flour", "1 quart excellent gueuze or other lambic beer, such as from the Cantillon brewery", "A bundle of herbs: 1 bay leaf, half a dozen parsley branches or roots, and a couple of branches of fresh thyme, tied together (or use dried thyme, loose)", "Salt and black pepper", "Brown or white sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the beef with a paper towel, and cut it into roughly 2-by-2-inch pieces, following as much as possible the breaks between muscles. In a large, heavy pot with a lid, brown the meat well in fat, working in batches so as not to cool the pan by crowding—for 30 minutes or more. While the meat is browning, chop the onions coarsely. Remove the browned meat to a warm dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over medium heat, brown the onions in the pot, adding more fat as needed, about 12 minutes. Add the flour, mixing it with the fat and cooking it for 1 minute. Add the beer while stirring. Return the meat to the pot, and add the herb bundle, 1 teaspoon of salt, and grindings of pepper, mixing all together. The meat should be almost fully immersed; if not, add more beer (or water, broth, or stock). Cook at a very low bubble, placing a heat diffuser under the pot if necessary and setting the lid either more or less ajar to help control the temperature. Cook the meat until a skewer slides easily in and, especially, out—about 3 hours. Remove the meat and about half the onions with a slotted spoon; discard the herb bundle. Carefully skim the fat from the liquid. Boil it, if necessary, to reduce it to the consistency of rich but runny cream. Return the meat and onions to the pot, and heat them thoroughly. Taste, and add salt and a little sugar, as needed.</p>"}]}