{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121128-231802-black-bottom-peppermint-600x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "frozen desserts", "peppermint", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Frozen Black Bottom Peppermint Pie", "link": "https://www.seriouseats.com/recipes/2012/12/frozen-black-bottom-peppermint-pie-recipe.html", "description": "With a chewy mint-chocolate brownie on the bottom and a disk of vanilla ice cream on top, if you like brownie sundaes, you're bound to love this pie. This is the perfect make-ahead dessert for the holidays; with the brownie and ice cream disks made in advance, all you'll need to do is combine them, top with whipped cream, crushed candy canes, and serve.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Chocolate", "Christmas", "Desserts", "Ice Cream and Frozen Treats", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["6 ounces semi sweet chocolate, chopped into small peices", "4 ounces butter", "4 ounces granulated sugar", "2 eggs", "1 teaspoon kosher salt", "1 tablespoon peppermint extract", "3 ounces all purpose flour", "1 quart vanilla ice cream", "3 ounces heavy cream, chilled", "1 tablespoon confectioner's sugar", "3 peppermint candy canes, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to the middle position and preheat oven to 325&deg;F. While the oven is preheating, line the bottom of a springform pan with a round of parchment. Fill one third of a medium saucepan with water and set a large, heatproof bowl over the top. Combine chocolate and butter in the bowl, and set the saucepan with the bowl on top over medium heat. As the water begins to steam, it will melt the chocolate and butter. Stir the mixture until it is smooth and shiny, with no lumps. Whisk in the sugar and remove the bowl from the top of the saucepan. Allow it to cool until it is just warm to the touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the eggs, extract, and salt into the cooled mixture. Fold in the flour. Pour the batter into the prepared pan and smooth the top with a spatula. Bake for 15 minutes, then turn the pan and bake for an additional 10 -15 minutes, until a tester stuck into the center comes out clean. Allow the brownie to cool for 20 minutes, then run a knife along the edges and gently release the springform sides. Invert the brownie onto a cooling rack and remove the parchment. Allow the brownie to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the ice cream out of the freezer and allow it to soften for 10 minutes. Wash out the springform pan, dry it completely, and line the bottom and sides with plastic wrap. Spread the ice cream evenly in the pan, and place it in the freezer to solidify for at least 30 minutes (if you're making this ahead of time, wrap the cooled brownie in plastic and hold the disk of ice cream in the freezer until you are ready to serve).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve: In a large bowl, combine the chilled heavy cream and confectioners sugar, and whisk until the cream holds soft peaks. Place the brownie bottom on a serving plate. remove the ice cream top from the freezer, release the springform pan, and pull the plastic wrap around the edges to release from the pan. Invert the ice cream disk on top of the brownie and peel away the plastic wrap. Smooth the top and sides with a spatula. Top with the whipped cream and the crushed candy canes. Slice with a warm knife (hold in a container filled with hot water) to serve.</p>"}]}