{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120402-199989-white-tofu-vegetable-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Andrea Nguyen", "Cook the Book", "green beans", "salad", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andrea Nguyen's White Tofu, Sesame, and Vegetable Salad", "link": "https://www.seriouseats.com/recipes/2012/04/andrea-nguyens-white-tofu-sesame-and-vegetable-salad-recipe.html", "description": "Known as <em>Shira-ae</em> in Japan, this salad of crisp blanched green beans is dressed with a purée of firm tofu, toasted sesame seeds, umami-packed soy and dashi, and enough sugar to give it a pleasant underlying sweetness.", "totalTime": "30 minutes", "recipeYield": "serves 4 to 6 as a side dish", "recipeCategory": ["Cook the Book", "Legumes", "Salads", "Tofu", "Vegetarian"], "recipeIngredient": ["4 ounces medium-firm or firm tofu", "1 tablespoon white sesame seeds", "About 1/8 teaspoon salt", "1 1/2 teaspoons sugar", "About 1 teaspoon light-colored soy sauce, such as Japanese usukuchi shoyu or light (regular) soy sauce ", "2 tablespoons <a href=\"http://www.seriouseats.com/recipes/2009/10/how-to-make-dashi-asian-miso-soup-bonito-flakes-kelp-kombu.html\">Dashi Stock</a> or water", "12 ounces tender green beans", "1/4 teaspoon toasted black sesame seeds, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the dressing, break up the tofu into large chunks and put them in a non-terry dishtowel or piece of muslin. Gather it up and, standing over a sink, gently squeeze 2 or 3 times. Unwrap, transfer to a small bowl, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, toast the white sesame seeds, shaking and stirring frequently, for 2 to 3 minutes, until light golden and fragrant. Let cool for 1 minute, then transfer the warm seeds to a small food processor. Add the salt and sugar and grind to a coarse texture. Add the tofu, soy sauce, and dashi. Process to a creamy mixture that is still somewhat coarse. (Or, use a mortar and pestle to pound the sesame seeds with the salt and sugar. Add the tofu and lightly pound and stir to combine. Stir in liquid ingredients.)</p>\r\n\r\n<p>Regardless of the method, transfer the tofu to a small bowl and let stand for 5 minutes to develop its flavor. Season with salt or soy sauce, aiming for a pronounced savory and sweet finish. Resist thinning the mixture with dashi because it may dilute the flavors. The dressing may be made 2 days ahead and refrigerated. Return it to room temperature before using; if there is lots of pooled liquid in the container, pour it off. Makes about 1/2 cup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of salted water to a boil. Meanwhile, trim the stem ends from the green beans. Blanch the beans for 1 to 2 minutes, until bright green and still crisp. Drain but do not rinse. Let the beans naturally cool, during which they will finish cooking. Like the dressing, the beans may be prepped up to 2 days ahead. Bring to room temperature before tossing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, you have two options. Short and dainty beans can be presented whole on a serving plate or individual dishes with the dressing spooned across their midline like a big creamy belt; invite guests to mix the ingredients themselves. Or, cut the beans into 2-inch-long pieces and toss in the tofu dressing, coating well; divide among small dishes or offer on a communal plate. Regardless of presentation, garnish with the black sesame seeds.</p>"}]}