{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121212-232973-cook-the-book-stinco.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Bruce Aidells", "Cook the Book", "The Great Meat Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bruce Aidells' Stinco (Braised and Roasted Pork Shanks)", "link": "https://www.seriouseats.com/recipes/2012/12/bruce-aidells-stinco-braised-and-roasted-pork.html", "description": "Shanks are often overlooked when it comes to choosing a meat for braising, especially in the home kitchen. Sure, intrepid cooks may simmer osso bucco once in a lifetime, but it's rare to see a shank or two appear on the table. In <em><a href=\"http://www.amazon.com/The-Great-Meat-Cookbook-Everything/dp/0547241410/?tag=serieats-20\">The Great Meat Cookbook</a></em>, <strong><a href=\"http://www.aidells.com/our-way/aidells-story\">Bruce Aidells</a></strong> presents a great case for bringing pork shanks to the holiday table with his recipe for <strong>Stinco</strong>. For this Italian-style pot roast, Aidells braises a couple of meaty shanks in a sumptuous sauce of white wine, porcinis, and prosciutto until quiveringly tender. The shanks then get a quick blast in a hot oven to brown and are then served on a soft bed of mashed potatoes, perfect for sopping up all of the potent sauce. The shanks make for an unconventional, yet dignified centerpiece for just about any holiday table.", "totalTime": "3 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Braising and Stewing", "Cook the Book", "Mains", "Pork", "Roasting"], "recipeIngredient": ["1 ounce dried porcini mushrooms", "1 1/2 cups boiling water", "2 large or 4 small pork shanks (4 to 5 pounds total), trimmed of any skin or hair", "Salt and freshly ground black pepper", "3 tablespoons olive oil", "2 ounces prosciutto or dried coppa, chopped", "2 cups chopped onions", "1 cup finely chopped peeled carrots", "1/2 cup chopped celery", "1 cup chopped leeks (white and pale green parts)", "2 tablespoons chopped garlic", "1 cup dry white wine", "1 cup homemade pork stock or canned low-sodium chicken broth, plus more if needed", "1 tablespoon chopped fresh sage", "2 teaspoons chopped fresh rosemary"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the mushrooms in a small bowl and cover with the boiling water. Soak for at least 45 minutes, or up to several hours. Remove the mushrooms from the liquid with a slotted spoon. Chop and set aside. Strain the soaking liquid, leaving behind any grit in the bottom of the bowl, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Tie each shank with 3 loops of butcher’s twine. Generously season the shanks with salt and pepper. Heat 2 tablespoons of the oil in a large Dutch oven over medium-high heat. Add the shanks (you may have to brown them in batches) and sear until nicely browned on all sides, about 10 minutes. Set aside the shanks and pour off all but 2 tablespoons of the fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium and add the prosciutto, onions, carrots, celery, and leeks. Cover and cook until soft, stirring occasionally, about 10 minutes. Scrape up any browned bits from the bottom of the pot. Add the garlic, reserved mushrooms, and white wine and bring to a boil, scraping up any remaining browned bits from the bottom. Add the reserved mushroom liquid, the stock, 1 teaspoon of the sage, 1 teaspoon of the rosemary, and the shanks. Bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and bake for 30 minutes, then turn the shanks, re-cover the pot, and bake for another 30 minutes. Remove the lid and, after another 30 minutes, begin checking the shanks, adding more stock or water if the liquid evaporates. The shanks are done when the meat is almost falling off the bone and is quite tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pot to the top of the stove and transfer the shanks to a shallow roasting pan. Increase the oven temperature to 425ºF. Brush the shanks with the remaining 1 tablespoon olive oil and sprinkle with some pepper and the remaining 2 teaspoons sage and 1 teaspoon rosemary. Roast the shanks in the oven for 15 to 20 minutes, or until slightly browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, degrease the braising liquid in the pot and, if necessary, boil it down until it just turns syrupy. Season to taste with salt and pepper. To serve, remove and discard the twine, cut chunks of meat from the shanks, transfer to plates, and ladle on some of the sauce. Pass the extra sauce at the table.</p>"}]}