{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120530-dt-jamie-olivers-summer-parsley-pasta.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["Dinner Tonight", "Italian", "Jamie Oliver", "pasta", "tagliatelle", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jamie Oliver's Summer Tagliatelle with Parsley and Pine Nuts", "link": "https://www.seriouseats.com/recipes/2012/05/jamie-olivers-summer-tagliatelle-with-parsley-recipe.html", "description": "Rather than blending all the ingredients into something homogenous, Jamie calls for mincing the parsley by hand and bashing only half the pine nuts to a paste, then loosening it all with good olive oil.", "totalTime": "15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Italian", "Pasta", "Vegetarian"], "recipeIngredient": ["4 ounces pine nuts", "juice and zest of 2 lemons", "1 large bunch fresh flat-leaf parsley, minced (reserve some leaves for topping the pasta)", "1 cup good quality extra virgin olive oil", "2 1/2 ounces Parmesan cheese, grated", "1 ounce Pecorinio cheese, grated", "Kosher salt and freshly ground black pepper", "1 pound taglietelle pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, smash half the pine nuts to a paste. Add the remaining pine nuts whole, along with the lemon zest, parsley, olive oil, and cheeses. Add in lemon juice to taste, aiming for a tarter-than-you'd think flavor (the lemon will be muted once it's mixed with the pasta).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of salted water to boil. Cook the pasta until al dente, reserving at least a cup of cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pasta to the pot and scrape the sauce into the pot.  Add in a splash of pasta cooking water and toss the noodles well with tongs to coat them in the sauce. Aim for a luxurious consistency wetter than you'd think; as much as a cup of cooking water might be required. Season to taste with salt and pepper while still in the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta amongst 4 plates and top with the whole parsley leaves. Serve immediately.</p>"}]}