{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120426-127677-Arroz-con-Pollo-Nica-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["arroz con pollo", "chicken", "Latin American cuisine", "nicaragua", "nicaraguan cuisine", "paella", "poultry", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Nicaraguan Arroz con Pollo", "link": "https://www.seriouseats.com/recipes/2012/04/nicaraguan-arroz-con-pollo-recipe.html", "description": "Notes: This recipe can be cut in half. Chicken may be poached 2 days in advance. To store, place chicken and 3 cups strained broth in airtight container and refrigerate. Rice may be prepared up to 2 days in advance....", "totalTime": "2 hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Chicken", "Rice"], "recipeIngredient": ["<strong>For the Chicken</strong>    ", "1 whole large chicken (about 4 to 5 pounds), cut into 8 pieces, skin removed ", "1 medium yellow or white onion, peeled and cut into 6 wedges", "1 medium green bell pepper, seeded and quartered", "6 garlic cloves, peeled and smashed", "1 tablespoon salt", "2 teaspoons black peppercorns", "8 cups cold water", "1 lime, halved", "   ", "<strong>For the Rice</strong>    ", "2 tablespoons unsalted butter", "1 tablespoon olive oil", "1 medium yellow or white onion, finely chopped (about 1 cup)", "1 medium garlic clove, minced (about 1 teaspoon)", "2 teaspoons salt", "2 tablespoons tomato paste", "2 cups long-grain white rice", "2 medium carrots, peeled and cut into small dice (about 1 cups)", "4 cups chicken broth", "   ", "<strong>For the Arroz con Pollo</strong>    ", "3 tablespoons unsalted butter", "8 ounces smoked sausage (such as Lil’ Smokies) or Kielbasa sausage, cut into 1/4-inch-thick rounds", "1/4 pound sliced deli ham, coarsely chopped", "1 medium yellow or white onion, finely chopped (about 1 cup)", "3/4 cup drained canned or jarred piquillo peppers, finely chopped", "2 tablespoons tomato paste", "6 tablespoons ketchup", "3/4 cup pimento-stuffed olives, sliced", "1/3 cup capers, drained", "1 1/2 cups frozen peas", "Salt", "1 cup (2 ounces) finely grated Parmesan cheese (optional)", "Buttered white toast (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the chicken:</strong> Place chicken, onion, bell pepper, garlic, salt, peppercorns, and water (chicken should be submerged 2 inches; add more water if necessary). Squeeze lime juice into pot and add spent lime halves to pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to boil over medium heat, then immediately reduce heat to medium-low and simmer until chicken is cooked through (chicken’s temperature should read 160&deg;FF), about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With tongs, transfer chicken to large bowl. When cool enough to handle, shred chicken into bite-sized pieces, removing and discarding bones. You should have 4 cups shredded chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain broth and discard solids. Reserve 4 cups and store the rest for different use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the rice:</strong> Melt 2 tablespoons butter in large heavy-bottomed saucepan over medium heat. Add oil, onion, garlic, and salt and cook, stirring, until softened, about 5 minutes. Stir in tomato paste and cook until darkened, about 1 minute.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in rice and carrots and cook, stirring, until rice is completely coated with onion mixture, about 1 minute. Add broth and bring to a boil over medium-high heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to boil until most of the liquid has evaporated and you can see small bubbles on the surface of the rice. Reduce heat to the lowest setting, cover, and cook for 20 minutes until rice is done. Remove from heat and fluff rice with chopsticks or fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the arroz con pollo:</strong> Melt 2 tablespoons butter in a large skillet with high sides. Add sausage and ham and cook over medium heat until lightly browned, about 3 minutes. Transfer to plate.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining 1 tablespoon butter in now empty skillet. Add onion and piquillo peppers and cook until softened, about 5 minutes. Stir in tomato paste and cook until darkened, about 1 minute. Add ketchup and chicken and cook, stirring, until chicken is completely coated in mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in rice, then reserved sausage mixture. Stir in olives, capers, and frozen peas. Cook, stirring occasionally to allow flavors to meld, 10 to 15 minutes.  Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with grated Parmesan cheese and buttered white toast.</p>"}]}