{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120301-195206-madelines-610x458-2.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["Cookies", "madeleines", "Sweet Technique", "vanilla bean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vanilla Bean Madeleines", "link": "https://www.seriouseats.com/recipes/2012/03/vanilla-bean-madeleine-recipe.html", "description": "These classic french cookies are actually small sponge cakes shaped like a seashell.", "totalTime": "4 hours", "recipeYield": "makes 12 madeleines or 24 mini madeleines", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["2/3 cup all purpose flour", "3/4 teaspoon baking powder", "1/2 teaspoon salt", "1/2 cup sugar", "Seeds scraped from 1/2 a vanilla bean or 1 tablespoon vanilla extract", "2 large eggs. at room temperature", "3/4 stick (6 tablespoons) unsalted butter, melted and cooled plus more for the pan", "Confectioners sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the flour, baking powder, and salt. Working in a mixer bowl, rub the sugar and vanilla bean together between your fingertips until the sugar is moist and fragrant. Add the eggs to the bowl. Working with the whisk attachment, beat the sugar and eggs together on medium high speed until pale, thick and light, 2 to 3 minutes. Beat in the vanilla. With a rubber spatula, very gently fold in the dry ingredients, followed by the melted butter. Press a piece of plastic wrap against the surface of the batter and refrigerate it for at least 3 hours, or for up to 2 days. (You can also spoon the batter into the greased and floured madeleine molds, cover and refrigerate, then bake the madeleines directly from the fridge.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 400&deg;F. Butter and flour the madeleine mold and place the pan on a baking sheet. Spoon the batter into the molds, filling each one almost to the top. Don’t worry about spreading the batter evenly, the oven’s heat will take care of that. Bake the madeleines for until they are golden and the tops spring back when touched, 11 to 13 minutes. Remove the pan from the oven and release the madeleines from the mold by rapping the edge of the pan using your fingers or a butter knife. Transfer the madeleines to a rack to cool to just warm or to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are making minis and have more batter, bake the next batch, making certain that you cool then properly prepare the pan before baking. Just before serving, dust the madeleines with confectioners’ sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: Although the batter can be kept in the refrigerator for up to 2 days, the madeleines should be eaten soon after they are made. You can keep them overnight in a sealed container, but they are better the day they are baked. If you must store them, wrap them airtight and freeze them; they will keep for 2 months.</p>"}]}