{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120508-204894-bread-baking-birdie1.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["baking", "bread", "bread baking", "fun with kids", "rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Birdie Bread Rolls", "link": "https://www.seriouseats.com/recipes/2012/05/birdie-bread-baking-with-kids.html", "description": "[Photographs: Donna Currie] I wanted to use completely edible items for the whole birdie, so I used slivered almonds for the beaks and chocolate pearls for the eyes. I was a little concerned the eyes might melt and make a...", "totalTime": "2 hours 40 minutes", "recipeYield": "makes 8 rolls", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1/2 cup water, at room temperature", "1/2 cup orange juice, at room temperature", "2 tablespoons sugar", "2 1/4 teaspoons instant yeast ", "11 1/4 ounces (about 2 1/4 cups) bread flour", "1 teaspoon salt", "2 tablespoons olive oil", "Chocolate pearls (for eyes)", "Slivered almonds (for beaks)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water, orange juice, sugar, yeast, and bread flour in bowl of stand mixer fitted with dough hook. Knead on low speed until dough is smooth and elastic, about 5 minutes. Add salt and olive oil, and continue kneading until they are completely incorporated and dough is smooth, silky, shiny and elastic, about 5 minutes longer. Cover bowl with plastic wrap and set aside until doubled in size, about 1 hour.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat the oven to 350&deg;F. Line baking sheet with parchment paper. Sprinkle work surface with flour and turn the dough out. Knead briefly, then divide into 8 even pieces. Take one of the pieces and cut off about 1/4 of the dough. Form that smaller piece into a ball. Form the other piece into a teardrop shape.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a divot in the fat part of the teardrop-shaped piece, but not too close to the edge as shown in the photo.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ball on top of the teardrop shaped piece on top of that divot you just made.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place this on the baking sheet, with the pointy end facing the center of the sheet. This will make it easier to work in the face later. Continue until all the birds are shaped. Cover the birds with plastic wrap and set aside until nearly doubled in size, about 20 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a toothpick or skewer, poke holes in the first bird's head where you want the eyes and beak. Insert the eyes and beak, pushing them well into the dough. Keep in mind that they don't all need to be facing straight forward - you can position the faces so they're looking up, down, or to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue with the rest of the birds, until all of them have eyes and beaks. Cover them with plastic wrap and let them continue rising until doubled&mdash;another 5 to 10 minutes, depending on how long it took to get the faces finished. Uncover the birds again, and if the eyes and beaks have started protruding, push them back in again.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the birds are nicely browned, about 30 minutes. Remove the birds from the baking sheet and put them on a rack to cool. If the eyes and beaks need to be pushed back in again, do so while the buns are still warm. Let them cool completely on the rack if you're not serving them right away.<br />\r\n</p>"}]}