{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/021012-192092-sunday-brunch-kugelis-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "Kugelis", "potatoes", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Kugelis", "link": "https://www.seriouseats.com/recipes/2012/02/kugelis-lithuanian-potato-casserole-recipe.html", "description": "Anyone who grew up the Lithuanian parents or grandparents is probably familiar with this potato casserole.  Similar to German kugel or potato babka from Belarus, it is a simple dish of grated potato, onions and bacon baked with eggs until crisp.", "totalTime": "1 hour 30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Pork", "Potato"], "recipeIngredient": ["1 tablespoon butter", "4 large russet potatoes", "1/2 pound bacon", "1 medium onion, finely chopped", "4 eggs beaten", "1/2 cup milk", "Kosher salt and cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F.  Butter an 8 x 8 inch baking pan.  Grate the potatoes on the large holes of a box grater, and place grated potatoes in a bowl of cold water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook bacon over medium high heat until bacon is crisp and fat is rendered, about 7 minutes.  Remove bacon and drain on paper towels.  Once bacon is cool enough to handle, coarsely chop.  Pour off all but 2 tablespoons of bacon fat, return pan to medium heat, and add chopped onion.  Cook until onions are soft and brown, about 10 minutes.  Remove from heat and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beaten eggs and milk and season with salt and pepper.  Remove a handful of grated potatoes from water and place in center of clean dishtowel. Close towel around potato and twist towel to ring out water.  Add drained potatoes to egg/milk mixture and repeat with remaining potatoes.  Add chopped bacon and onions to potato mixture and, using a wooden spoon, mix until all ingredients are well combined; then pour into prepared baking pan.  Place in preheated oven and bake until potatoes are soft and brown and beginning to crisp, about 1 hour.  Serve with sour cream and sliced scallions.</p>"}]}