{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120103-186041-knead-the-book-carta-di-musica.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "flatbreads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Fundamental Techniques of Classic Bread Baking's Carta di Musica", "link": "https://www.seriouseats.com/recipes/2012/01/carta-di-musica-bread-baking-recipe.html", "description": "I fell in love with the idea of Carta di Musica the first time I heard the name. It refers to the thinness of these crisp flatbreads, and the idea that you should be able to see though them when they're rolled thin enough. There's also something appealing about breaking a big crisp flatbread into pieces.", "totalTime": "2 hours, or up to 26", "recipeYield": "Makes 1 dozen flatbreads", "recipeCategory": ["Bread", "Bread Baking", "Cook the Book"], "recipeIngredient": ["533 grams / 1 pound 2 3/4 ounces durum flour", "357 grams / 12 1/2 ounces water", "5 grams / 1/5 ounce fresh yeast", "5 grams / 1/5 ounce salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the mise en place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a 12 x 18-inch sheet pan with parchment paper or flour a bagel board. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour with the water, yeast, and salt in the bowl of a standing electric mixer fitted with the hook. Mix on low speed until blended. Increase the mixer speed to medium mix for about 8 minutes, or until the dough has come together but remains slightly sticky. Check the gluten development by pulling a window.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a bowl scraper, immediately scrape the dough from the bowl onto a clean, lightly floured work surface and form it into 12 75-gram / 2 3/4 ounce rounds. Place the rounds on the prepared sheet pan or bagel board, cover with plastic film, and bench rest for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to the refrigerator for at least 30 minutes, but more more than 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About an hour before you are ready to bake the flatbreads, place the baking stone or tiles into the oven and preheat to 500 degrees. If you are using a pan to create steam, place it in the oven now.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a clean, flat work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator. Uncover and, working with one piece at a time, place the dough on the floured work surface. Using a rolling pin, roll out each piece to a 9-inch circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a peel, immediately transfer the flatbreads to the hot baking stone in the preheated oven and bake for 4 minutes, or until crisp and dry. The breads will puff while baking and collapse once they are removed from the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and transfer to wire racks to cool.</p>"}]}