{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120217-188620-orange-meringue-610x458-2.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["citrus desserts", "meringue desserts", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Orange Meringue Pie", "link": "https://www.seriouseats.com/recipes/2012/02/orange-meringue-pie-recipe.html", "description": "This pie is a twist on the classic lemon meringue pie&mdash;a light alternative to more traditional orange and vanilla cream versions. The buttery, flaky crust provides just enough crunch and is crisp all over from being blind baked before filling.", "totalTime": "4 hours", "recipeYield": "Serves 8", "recipeCategory": ["Orange", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "16 ounces fresh orange juice", "Zest of two oranges", "1.8 ounces cornstarch", "5 ounces granulated sugar (divided into 4 and 1 ounces)", "3 egg yolks", "3 tablespoons butter, cut into small pieces", " ", "<strong>For the meringue:</strong>", "3 egg whites", "9 ounces sugar", "Pinch salt", "Pinch cream of tartar", "1 tablespoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F. When the oven is ready, line the chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove the weights and the liner, turn the pie, and bake until the bottom crust is a light golden brown, about 10 minutes more. Remove the pie shell from the oven and allow it to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the orange juice and zest. Whisk together the cornstarch and all but 1 ounce of the sugar, then add to the juice. In a separate bowl, whisk egg yolks and the remaining 1 ounce of sugar until they are pale and light, about one minute. Place the orange juice mixture over low heat and whisk constantly. It will begin to thicken to a gooey consistency. Turn off the heat, and temper the egg mixture with the orange mixture. Combine the two in the saucepan and whisk constantly over low heat. Once the mixture begins to bubble, it should be whisked for two additional minutes. Turn off the heat and add the butter. Whisk until and butter solids disappear. Pour the mixture into the cooled pie shell and press plastic wrap on the surface (avoid covering the crust with the wrap). Allow the pie to cool on the counter for 15 minutes, then transfer it to the fridge to cool and set up completely, at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving:  Fill a medium saucepan one quarter full with water. Set the saucepan over medium heat, and bring water to a simmer. Combine egg whites, cream of tartar, sugar, and salt in the heatproof bowl of electric mixer, and place over saucepan. Whisk constantly until sugar is dissolved and whites are warm to the touch, 3 to 3 1/2 minutes. Test by rubbing between your fingers, you should feel no grit. Transfer bowl to electric mixer fitted with the whisk attachment, and whip, starting on low speed, gradually increasing to high until stiff, glossy peaks form, about 8 minutes. Add vanilla, and mix until combined. Remove the plastic from the top of the chilled pie and top with the meringue (you may choose to pipe the meringue using a star tip for a different look). Place the pie under the broiler and watch it carefully, the top should brown but not burn, and it changes quickly. Chill for 10 minutes, then serve.</p>"}]}