{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120221-nasty-bits-sweetbreads-dish-overhead-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["offal", "sweetbreads", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweetbreads Sauté", "link": "https://www.seriouseats.com/recipes/2012/02/sweetbreads-saute-recipe.html", "description": "You can sauté or pan-fry the sweetbreads with whatever flavors you like. This time, I used mustard seed and turmeric, sautéed with plenty of onions and chili peppers, for a vaguely Indian preparation that tasted nice with fragrant basmati on the side.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mains", "Offal", "The Nasty Bits"], "recipeIngredient": ["10 ounces sweetbreads", "1 medium onion, thinly sliced", "3 to 4 tablespoons butter", "2 to 3 dried red chili peppers, or to taste", "1/2 teaspoon mustard seeds", "1/4 teaspoon turmeric", "1/2 teaspoon kosher salt", "Chopped parsley, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove membranes and sinew from sweetbreads. Cut into 1-inch cubes.  <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a skillet over high heat and add 2 tablespoons butter, swirling it around the pan. Add the sweetbreads and let the cubes brown on one side before turning. Sprinkle with about 3/4 teaspoon salt. Brown the sweetbreads in this way, turning only once per side until the cubes are browned on most surfaces, about 5 minutes total. Remove from the skillet and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add more butter, the onions, and the rest of the salt. Sauté until browned, about 10 to 15 minutes. Move the onions to one side of your skillet and add the chilies, mustard seed, and red peppers. The mustard seeds will pop. Add the sweetbreads back into the pan. Add the turmeric, sprinkling it over the contents of the pan, and stir everything around. Sauté for one more minute to let the ingredients mix together. Serve hot, garnishing with cilantro or parsley.</p>"}]}