{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/2252012-194189-sunday-brunch-cheese-bacon-souffle.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cheese", "souffles", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cheese and Bacon Soufflé", "link": "https://www.seriouseats.com/recipes/2012/02/cheese-and-bacon-souffle-recipe.html", "description": "Whether it's on a burger or in a soufflé, cheese and bacon are a combination that is hard to tire of.  Many people find soufflé daunting, but as long as whipping egg whites isn't a problem for you, then soufflé should be simple as well.", "totalTime": "1 hour 20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Cheese", "Pork"], "recipeIngredient": ["1/2 pound bacon", "2 tablespoons butter, divided", "1 small onion, finely chopped", "1 tablespoon all-purpose flour", "1 1/3 cups milk", "8 ounces (2 cups) grated sharp cheddar cheese", "Dash Worcestershire sauce", "1 teaspoon Dijon mustard", "Kosher salt and cracked black pepper", "1 tablespoon grated Parmesan cheese", "4 egg yolk", "6 egg whites"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F.  Cook bacon until crisp, drain on paper towels, then coarsely chop.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, melt 1 tablespoon butter, then add chopped onion.  Cook until onions are soft and beginning to brown, about 10 minutes.  Sprinkle onions with flour and stir until onions are well coated.  Add milk and whisk constantly until milk begins to thicken and there are no lumps of flour or onion, then add cheddar in small additions, whisking constantly until cheese is melted.  Once cheese is melted, add onion and Worcestershire sauce and season to taste with salt and pepper.  Remove from heat and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use remaining butter to grease soufflé dish, then dust with grated Parmesan cheese.  Once cheese mixture has cooled (enough that your finger won't burn if you dip it in the sauce), whisk in egg yolk and chopped bacon.  Using a whisk, hand mixer, or standing mixer, whisk eggs until stiff peaks form.  Fold 1/4 of the egg whites into cheese mixture, then gently fold in remaining whites.  Place soufflé batter in prepared dish and gently place in the oven until puffy and brown, about 40 minutes.  Serve immediately with green salad and light white wine.</p>"}]}