{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120924-223320-doughnutpie.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "fried desserts", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Doughnut Pies", "link": "https://www.seriouseats.com/recipes/2012/09/doughnut-pie-recipe.html", "description": "Don't let the photo fool you: while these holey treats may resemble doughnuts, they're actually pies! They are made up of morsels of pie crust which are then filled, rolled up and pinched to ensure the filling stays inside, then fried. While they're certainly not health food, they certainly are delicious: crispy, not too-sweet, easy to make, and completely open to improvisation with flavor.", "totalTime": "1 hour", "recipeYield": "Makes 15 to 20 doughnut pies", "recipeCategory": ["Cakespy", "Deep Frying", "Doughnuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 unbaked 9-inch pie crust", "1 1/2 cups (about 12 ounces) jam, preserves, or filling of your choice", "1 large egg, well beaten", "1 cup (about 8 ounces) vanilla or chocolate frosting", "sprinkles, to garnish", "oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the piecrust, then cut it into strips about 2 1/2 inches wide, and anywhere from 4 to 6 inches long, depending on what size doughnuts you'd like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon a small amount of filling lengthwise in the center of each strip. Be sure to leave a small gap of uncovered dough along the long, narrow edges, and at both the top and bottom of the strip of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the egg in a small bowl with one tablespoon of water until smooth. Using a small pastry brush, lightly brush one of the long, narrow edges of dough with this egg wash mixture. Gently fold the unbrushed side of the crust over the filling lengthwise, pinching it lightly with your fingers or the tines of a fork on top of the side with the egg wash, so that you have a long, narrow \"tube\" of filled crust. Don't worry about the look of the \"seam\"--later on, you'll frost the tops of the doughnuts and it will cover it quite nicely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the tubes into circles (like an inner tube!), pinching ends together to form a seam. If you need help adhering the ends, use a little bit of the egg wash.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a large skillet with about 1 inch of oil covering the bottom, set to high heat. Once the temperature has reached 375&deg;F, gently place the doughnuts in the pan a few at a time, frying each side 1 to 2 minutes, or until golden. Take care when flipping the pies, as they will be fairly delicate at this point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, gently remove the pies from the pan and place on paper towels to blot excess oil as they cool. I'm not going to lie: the just-fried doughnut pies will NOT be attractive. I'll remind you again: we're putting frosting and sprinkles on them to make them cute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cooled, spread each doughnut pie with frosting on the top, and garnish with sprinkles or decorating icing. Serve at room temperature.</p>"}]}