{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/201205220-207167-bread-baking-hint-of-rye2.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "rye bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hint of Rye Bread", "link": "https://www.seriouseats.com/recipes/2012/05/hint-of-rye-bread-recipe.html", "description": "[Photograph: Donna Currie] If you don't have a clay baker, you can bake this loaf in a cast iron dutch oven. It won't release steam, but it will retain the moisture from the bread as it bakes. One thing to...", "totalTime": "3 hours", "recipeYield": "makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons instant yeast", "1 tablespoon sugar", "1/4 cup buttermilk", "2 1/4 ounces (about 1/2 cup) rye flour", "9 ounces (about 1 3/4 cups) bread flour", "3 ounces (1/2 cup) semolina flour", "1 teaspoon salt", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of your stand mixer, combine the water, yeast, sugar, buttermilk, and flours. Knead with dough hook on low speed until dough begins to get elastic, about 5 minutes. Add salt and olive oil and continue kneading until dough is smooth, shiny, and elastic, about 5 minutes longer. Cover bowl with plastic wrap and set aside until doubled in size, about 1 hour. Meanwhile, soak clay baker (if using) and its cover in water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When dough has risen, flour work surface and turn the dough out. Knead briefly, then form into a log if you're using an oblong baker, or into a round if you're using a round baker or a cast iron dutch oven.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using clay baker:</strong> Remove baker from water and drain any extra water out of it. Sprinkle cornmeal in the bottom of baker and a little bit up the sides. Put the dough into the baker, seam side down, and put the cover on. Set aside to rise until slightly less than doubled&mdash;about 20 minutes. Open the baker and slash the dough as desired, then put the cover back on. Place your rack in the center of the oven, put the baker on the rack, and turn the heat to 400&deg;F. Bake for 60 minutes. Remove the cover (carefully - it's hot and there could still be some steam.) If the bread isn't as browned as you like, let it bake another 5 minutes. Remove the baker from the oven and remove the bread and let it cool on a rack on a rack before slicing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using Dutch oven</strong>: Set round of dough on a well-floured surface and cover loosely with plastic wrap or a floured lint-free dish towel. Let rise until slightly less than doubled&mdash;about 20 minutes. Slash top as desired then transfer to Dutch oven sprinkled with corn meal. Cover and transfer to center rack of oven and turn the heat to 400°F. Bake for 60 minutes. Remove the cover (carefully - it's hot and there could still be some steam.) If the bread isn't as browned as you like, let it bake another 5 minutes. Remove the baker from the oven and remove the bread and let it cool on a rack on a rack before slicing.</p>"}]}