{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120805-food-lab-grilled-chicken-20.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "cornish hen", "grilled chicken", "grilled cornish hen", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Cornish Hens with Lemon and Rosemary", "link": "https://www.seriouseats.com/recipes/2012/08/grilled-cornish-hens-with-lemon-and-rosemary-recipe.html", "description": "Perfectly juicy, crisp, and smoky grilled cornish hens rubbed with rosemary and lemon zest.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chicken", "Mains", "The Food Lab"], "recipeIngredient": ["4 Cornish hens, about 1 pound each", "1 tablespoons kosher salt", "1 teaspoon freshly ground black pepper", "2 tablespoons finely chopped fresh rosemary leaves", "1 tablespoon juice and 1 tablespoon zest from 1 lemon", "3 medium cloves garlic, minced on a microplane grater", "2 tablespoons extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat hens dry with paper towels and place breast-side-down on a large cutting board. Using sharp kitchen shears, remove the backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten the chicken. For added stability, run a metal or wooden skewer horizontally, entering through one thigh, going through both breast halves, and exiting through the other thigh. Tuck wing tips behind back of breasts. Repeat with remaining hens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine salt, pepper, rosemary, lemon juice, lemon zest, garlic, and olive oil in a small bowl and stir with fingers until homogenous. Rub mixture evenly over all surfaces of hens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one half chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place hens skin-side-up directly over the coals. Cover and cook until lightly charred on bottom, about 5 minutes. Carefully flip birds skin-side-down. Cover and continue to cook until golden brown, crisp, charred in spots, and center of breasts registers 145 to 150°F on an instant read thermometer, about 15 minutes longer. If birds threaten to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and cook until done. Remove from grill, let rest 5 minutes, and serve.</p>"}]}