{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120825-220083-cook-the-book-pork-belly-and-peach-salsa.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Nigel Slater", "peaches", "pork", "pork belly"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Nigel Slater's Crisp Pork Belly, Sweet Peach Salsa", "link": "https://www.seriouseats.com/recipes/2012/08/nigel-slaters-crisp-pork-belly-sweet-peach-sa.html", "description": "Nigel Slater's Crisp pork belly, sweet peach salsa from Ripe is a fabulous surprise of a recipe. The warm, vaguely Asian spice blend rubbed into the belly may not seem an obvious complement to a Southwestern-style peach salsa, but a quick glance through the ingredients reveals commonalities: cilantro, lime, and chile all play their parts in both cuisines, and peaches themselves are one of America's favorite imports from China. Not to mention, that once the peach salsa is piled on top of thinly sliced, quiveringly rich belly, it's hard to imagine doubting Slater's genius.", "totalTime": "12 hours", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Mains", "Peach", "Pork"], "recipeIngredient": ["2 to 3 pounds pork belly, boned, skin intact and finely scored", " ", "<strong>For the Rub</strong>", "3 cloves garlic", "2 tablespoons light soy sauce", "1 tablespoon peanut oil", "2 teaspoons salt", "1/2 teaspoon dried chile flakes", "1 slightly heaping teaspoon Chinese five-spice powder", " ", "<strong>For the Peach Salsa</strong>", "2 green onions", "1 small red chile", "3 peaches", "8 cherry tomatoes", "1 small bunch cilantro", "Juice of 2 limes", "3 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pork in a china or glass dish. Peel and crush the garlic to a paste, stirring in the soy, oil, salt, chile flakes, and five-spice powder. Spread this paste over the skin and underside of the pork and leave it to marinate for a good four hours, if not overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F (220°C). Place the pork in a roasting pan, then cook, skin-side up, for about twenty minutes. Lower the heat to 400°F (200°C) and continue cooking for a further forty to fifty minutes, until the skin is dark and crisp. Leave to rest for ten minutes before carving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the salsa. Trim and finely chop the green onions. Finely chop the chile. Peel, pit, and finely chop the peaches and tomatoes and chop the cilantro. Toss gently, then dress with the lime juice and olive oil. Serve the pork with the salsa.</p>"}]}