{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120914-222542-belgian-pie-edit.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "desserts", "pie", "prunes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Belgian Pie", "link": "https://www.seriouseats.com/recipes/2012/09/belgian-pie-prune-filling-recipe.html", "description": "Most of the pies I've encountered have had a butter, shortening, lard or cookie crust, but the Belgian Pie consists of a yeast-raised crust and can be filled with any of a number of fillings. Fruit fillings like apple, prune and raisin are popular as is rice. Known in Dutch as <em>Rijsttaart</em>, the filling is akin to rice pudding.", "totalTime": "5 1/2 hours", "recipeYield": "Serves 8", "recipeCategory": ["American Classics", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Prune Filling</strong>", "3/4 cup pitted prunes", "1/4 cup golden raisins", "1/4 cup, plus 1 tablespoon brandy", "1/4 cup sugar", "2 tablespoons water", " ", "<strong>For the Rice Filling</strong>", "1/2 teaspoon salt", "1/2 cup arborio rice", "4 cups whole milk", "1/3 cup light brown sugar", "1/3 cup granulated sugar", "1/2 teaspoon cinnamon", "2 1/2 teaspoons vanilla extract", "4 large eggs", " ", "<strong>For the Crust</strong>", "1/4 cup warm water", "2 teaspoons instant yeast", "1/4 cup sugar, plus 1 teaspoon ", "2 cups all-purpose flour, plus more for dusting surface", " 1/4 teaspoon salt", "2 large Eggs, separated into whites and yolks", "3 tablespoons unsalted butter, melted", "Non-stick cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan combine prunes, raisins, 1/4 cup brandy, sugar and water, stirring to dissolve sugar then bring the mixture to a simmer over medium-low heat. Reduce to a bare simmer and cook, stirring occasionally until a thick syrup forms, about 20 minutes. Remove from heat and transfer to a food processor. Add remaining brandy and process until you have a thick paste. Transfer to a small bowl and refrigerate covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan combine 1 1/2 cups of water with the salt. Bring to a boil then add the rice. Cover then reduce heat to medium low. Cook, stirring occasionally, until rice is soft and water has evaporated, about 20 minutes. Stir in milk, sugars, cinnamon, and vanilla. Simmer stirring frequently until rice is very soft, about 45 minutes. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together eggs until smooth, then, while whisking constantly, add the hot milk mixture to the eggs, 1 tablespoon at a time until half of it has been incorporated. Whisking constantly, slowly incorporate the egg/milk mixture back into the pot.  Return mixture to heat and cook until the pudding thickens, 3 to 4 more minutes, then remove from heat, transfer to a medium bowl, cover and refrigerate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While filling is chilling prepare the dough. In a medium bowl add warm water (about 110 to 115&deg;F) and yeast. Sprinkle with 1 teaspoon of sugar and cover the bowl with plastic wrap. Set aside in a warm place warm for 5 minutes to activate the yeast. At the end of this time the yeast should be foamy. In a medium bowl whisk together flour and salt and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric stand mixer beat the egg whites on high until stiff peaks form. Add yolks and continue beating until mixture is a pale yellow then add remaining sugar and butter beating until thoroughly combined. Stir in activated yeast mixture until just incorporated then stir in flour mixture. The dough will be soft and sticky. Turn out onto a generously floured surface and sprinkle with flour then knead lightly for about a minute. Transfer to a large bowl coated in cooking spray or a neutral oil. Cover with plastic wrap and set in a warm place to rise until dough has doubled, about 1 hour. While dough rises, set oven rack to middle position and preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dough has risen, remove from bowl, punch it down and roll it out into a large circle (about 13' in diameter) and place into a 9 inch pie dish. Cover with a clean dish towel and let rise for 10 minutes, then spread prune filling on the bottom. Stir chilled rice pudding to get rid of any skin, then pour into the pie shell and layer on top of prune filling. Bake until crust is golden and center is set, 40 to 45 minutes. Ff crust begins to brown too much you can <a href=\"http://www.thekitchn.com/perfect-pie-crust-a-fussfree-w-152662\">carefully cover with aluminum foil</a> or use a pie shield. Cool on a wire rack for 15 minutes then transfer to the refrigerator to cool completely. Chill at least 2 hours or up to overnight. Serve cold.</p>"}]}