{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/201200403-dt-mussels-with-tomatoes-and-israeli-cous-cous.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "Israeli couscous", "mussel", "mussels", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mussels with Israeli Couscous and Tomatoes", "link": "https://www.seriouseats.com/recipes/2012/04/mussels-with-israeli-couscous-and-tomatoes.html", "description": "[Photograph: Blake Royer] Adapted from Lucid Food. About the author: Blake Royer is a food writer, photographer, and filmmaker based in Chicago; he has been writing for Serious Eats since 2007. You can follow him on Twitter @blakeroyer....", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner Tonight"], "recipeIngredient": ["2 tablespoons olive oil", "1 large yellow onion, diced (about 1 1/2 cups)", "4 medium cloves garlic, minced (about 4 teaspoons)", "5 sprigs fresh oregano, leaves picked off and chopped", "1 (28 ounces) can whole peeled tomatoes, broken up into 1/2- to 1/4-inch pieces", "1/2 cup white wine", "Kosher salt and freshly ground black pepper", "2 cups Israeli couscous", "2 pounds mussels, scrubbed and debearded (discard any that do not close when tapped)", "1/2 cup chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large saucepan over medium heat until shimmering.  Add the onion and cook, stirring often, until softened and just starting to brown, four to five minutes. Add the garlic and oregano and cook, stirring constantly, until fragrant, about 30 seconds. Add the tomatoes and white wine. Bring to a boil, reduce to a simmer, and cook, uncovered, for 15 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 2 1/2 cups water and 1 teaspoon salt in a medium saucepan over high heat until boiling. Add cous cous, reduce to a simmer, cover, and cook, stirring occasionally, until cous cous is softened, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cooked couscous to the tomatoes and stir well to combine. Nestle the mussels in and amongst the couscous, cover the pan, and increase heat to high. Cover and cook, stirring occasionally, until the mussels are all completely open, 1 to 3 minutes (discard and mussels that do not open).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half the parsley and stir to combine. Divide the mussels and cous cous amongst four serving bowls top with remaining parsley and serve.</p>"}]}