{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120301-tonkotsu-chashu-cha-siu-pork-belly-ramen-12.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["appetizers", "buns", "pork", "quick", "sandwich", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Belly Buns with Spicy Mayo, Scallions, and Pickled Bean Sprouts", "link": "https://www.seriouseats.com/recipes/2012/03/pork-belly-buns-with-spicy-mayo-recipe.html", "description": "These buns combine spicy mayo, scallions, and pickled bean sprouts. They'd also be great with some hoisin sauce and sliced scallions or sweet Japanese mayo and shredded lettuce.", "totalTime": "15 minutes (once you have the leftover chashu)", "recipeYield": "makes 12 pork buns, serving 6 to 12 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Pork", "Sandwiches", "The Food Lab"], "recipeIngredient": ["<strong>For the Pickled Bean Sprouts</strong>", "1 cup rice vinegar", "1 cup water", "1 cup sugar", "1 tablespoon salt", "3 cups picked mung bean sprouts", "&nbsp;", "<strong>For the Spicy Mayonnaise</strong>:", "1/2 cup mayonnaise", "2 tablespoons chili paste, such as sriracha, gochujang, or sambal oelek", "&nbsp;", "<strong>To assemble</strong>", "12 quarter-inch-thick slices chashu pork (see recipe <a href=\"http://www.seriouseats.com/recipes/2012/03/chashu-pork-marinated-braised-pork-belly-for-tonkotsu-ramen-recipe.html\">here</a>.)", "1 cup reserved broth from chashu pork recipe", "6 scallions, finely sliced at a heavy bias", "Shredded iceberg lettuce (if desired)", "12 Chinese folded steamed buns (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the pickled bean sprouts:</strong> Combine water, vinegar, sugar, and salt in a small saucepan. Bring to a boil over high heat, stirring until sugar and salt are dissolved. Place bean sprouts in a small bowl. Pour hot pickling liquid over them. Cover with a paper towel, pressing the towel down into the liquid to make sure sprouts are completely submerged. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the spicy mayo:</strong> Combine mayonnaise and chili paste in a small bowl. Stir with a fork until combined. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Char the pork:</strong> Place pork slices in a medium skillet and pour broth on top. Heat over medium-high heat until simmering and pork slices are heated through. Transfer with a slotted metal spatula to a foil-lined rimmed baking sheet. Using a blowtorch or kitchen torch, char top of each slice by running the flame rapidly back and forth over each slice until evenly crisped. Flip and repeat on second side. Alternatively, use the broiler (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the buns:</strong> Heat buns (see note). Spread mayonnaise mixture evenly over insides of each bun. If using, spread some shredded iceberg lettuce on bottom half of bun. Lay a slice of pork in each and top with pickled bean sprouts and sliced scallions. Close buns and serve.</p>"}]}