{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120402-199810-dinner-tonight-midnight-asparagus-creamy-eggs-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["asparagus", "Dinner Tonight", "egg", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Midnight Asparagus with Creamy Eggs", "link": "https://www.seriouseats.com/recipes/2012/04/midnight-asparagus-with-creamy-eggs-recipe.html", "description": "One of the easiest and most satisfying ways to enjoy fresh asparagus is to pair it with an egg, which is exactly what I've written about numerous times before. But I've never combined the two in quite the way prescribed as in <em><a href=\"http://www.amazon.com/The-Splendid-Tables-Supper-Award-Winning/dp/0307346714/?tag=serieats-20\">The Splendid Table's How to Eat Supper</a></em>, which aims to make an easy dish even easier. How does one do that? Well, by making it a one skillet dinner, that's how.", "totalTime": "20 minutes", "recipeYield": "serves 2 to 3", "recipeCategory": ["Asparagus", "Dinner Tonight", "Eggs", "Mains", "Vegetarian"], "recipeIngredient": ["1 1/4 pounds asparagus, tough ends removed, chopped into 1 1/2-inch pieces ", "2 tablespoons extra-virgin olive oil ", "1/4 medium onion, diced", "1/2 teaspoon kosher salt", "1/4 teaspoon fresh-ground black pepper", "4 large eggs", "1 tablespoon juice from 1 lemon", "4 slices crusty bread "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack so that it is about 5 inches below the broiler. Turn on the broiler, and let it preheat for a couple minutes. Add the oil to a 12-inch oven-proof skillet and place the pan under the broiler for two minutes. The oil and pan should be hot, but not smoking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove the pan and add the asparagus and onion. Stir well to coat the pieces in the oil.  Replace the skillet and close the door. Cook until the asparagus and onion are lightly browned, but not mushy, three to four minutes, making sure to stir halfway through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skillet and push the onions and asparagus to the sides of the skillet so that the center is empty. Crack the eggs carefully into the center of the skillet. Return the skillet to the broiler and close the door. Cook until the whites are set, but the yolks are still runny, about one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When done, turn off the broiler, and remove the pan. Drizzle the lemon juice on top, and season to taste with salt and pepper. You can eat straight from the pan, or divide the contents between to plates. Serve with the slices of crusty bread. </p>"}]}