{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120703-212839-bread-baking-hamburger-buns.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "buns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hamburger or Sandwich Buns", "link": "https://www.seriouseats.com/recipes/2012/07/bread-baking-buns-for-sandwiches-hamburgers.html", "description": "Soft white and rye buns for hamburgers, sandwiches, or dinner rolls.", "totalTime": "2 hours, 30 minutes", "recipeYield": "Makes 12 buns", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["<strong>For the White Dough:</strong>", "1 cup lukewarm water", "2 1/4 teaspoons instant yeast", "1 tablespoon sugar", "11 1/4 ounces (about 2 1/4 cups) bread flour", "1 teaspoon salt", "1 tablespoon olive oil", " ", "<strong>For the Rye Dough:</strong>", "1/2 cup lukewarm water", "1 teaspoon yeast", "1 tablespoon sugar", "1/2 cup bread flour", "1 cup rye flour", "1/2 teaspoon salt", "1 teaspoon cocoa powder", "1 teaspoon balsamic vinegar", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the white dough:</strong> Combine water, yeast, sugar, bread flour, and salt in bowl of stand mixer fitted with dough hook attachment. Knead on low speed until smooth, elastic dough is formed, about 10 minutes. Add the olive oil and  continue kneading until the oil is incorporated and the dough is smooth, shiny, and elastic, about 3 minute slonger. Transfer to a separate bowl, cover tightly with plastic wrap and set aside until doubled in volume, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While white dough rises, make rye dough. Combine water, yeast, sugar, bread flour, rye flour, salt, cocoa powder, and balsamic vinegar in bowl of your stand mixer fitted with paddle attachment. Mix on medium-low speed until dough forms a ball that cleans the sides of the bowl, about 5 minutes. Add the olive oil and continue kneading until the oil is completely incorporated, about 3 minutes longer. Set aside while the white dough rises.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper. Adjust oven rack to center position and preheat oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the white dough has risen, turn it out, knead it briefly on a lightly floured surface, then roll it out to a square about 13- by 13-inches. Using a 3-inch biscuit cutter, cut 16 circles from the dough. Reroll the scraps so the dough is the same thickness as before, and cut another 8 circles so you have 24 circles. Arrange 12 of those circles on the prepared parchment-lined baking sheet. The circles will shrink in diameter a bit after you cut them. Discard scraps or save for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface again and turn out the rye dough. It won't have risen much, but it will feel airy and spongy. Roll it into a 9- by 12-inch rectangle. Using a 2 1/2-inch biscuit cutter, cut 12 circles from the dough. Discard scraps or save for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the rye circles neatly on top of the white circles on the baking sheet. You don't need to do anything to make them stick, they will adhere to each other without any help. Place the reserved 12 white circles on top of the rye circles. Cover the dough with plastic wrap and set aside until the white dough has doubled in size, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the buns have doubled, remove the plastic wrap and bake until browned, rotating half way through baking, about 25 minutes total. Place the buns on a rack to cool.</p>"}]}