{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120204patdough.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "Middle Eastern", "keywords": ["chicken", "chickpeas", "Iranian", "israeli", "Jewish", "matzoh balls", "Persian", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Einat Admony's Chicken Soup With Gondi (Iranian Chicken and Chickpea Dumplings)", "link": "https://www.seriouseats.com/recipes/2012/04/einat-admony-gondi-chicken-and-chickpea-dumplings-passover-matzo-ball-soup-persian-israeli-recipehtml.html", "description": "[Photograph: Maggie Hoffman] Note: Serve these as an alternative to matzo balls for your Passover Seder. At Balaboosta, Einat plans to cook the gondi in one broth, but serve them in a fresh batch, so the finished broth isn't cloudy....", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Kosher", "Legumes", "Middle Eastern", "Passover", "Soups and Stews"], "recipeIngredient": ["2 quarts canned or homemade low-sodium chicken broth", "1 medium carrot, chopped into 1/2-inch dice (about 1 cup)", "1 medium leek, white parts only, split lengthwise in quarters, chopped into 1/4-inch segments (about 1 cup)", "1 large celery stalk, chopped into 1/4-inch segments (about 1 cup)", "1 medium potato, peeled and cut into 1/4-inch dice (about 1 cup)", "1 (15-ounce) can chickpeas, drained", "1 small onion, grated on the large holes of a box grater (about 1/2 cup)", "3/4 pound ground chicken legs and thighs", "1/2 cup matzo meal", "1 tablespoon olive oil", "1 teaspoon ground turmeric", "1 teaspoon ground cumin", "1/2 teaspoon ground cardamom pods (2 pods)", "3 to 4 tablespoons water, as needed", "Kosher sald and freshly ground black pepper", "1 small bunch chives, cut into 1/2-inch segments (about 1/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring chicken broth to a boil over high heat in a large saucepan. Reduce to a bare simmer and add carrots, leeks, celery, and potato. Cover and cook until vegetables are completely tender, about 20 minutes. Meanwhile, make the gondi.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the gondi:</strong> Place chickpeas in a large mixing bowl and mash with a potato masher until no whole chickpeas remain but mixture is still somewhat chunky. Add chicken, onions, matzo meal, olive oil, turmeric, cumin, and cardamom. Lightly mix with hands until mixture is well combined, then add water, one tablespoon at a time, until mixture comes together easily and can be rolled into balls that keep their shape but don't stick to your hands. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 3/4 teaspoon salt and 1/4 teaspoon black pepper and mix well. Place a 1/2-teaspoons worth of mixture on a microwave-proof plate and microwave on high power for 10 seconds until cooked through. Taste and add more salt or pepper if desired. Repeat microwaving, tasting, and seasoning until desired seasoning level is achieved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form gondi by rolling a couple tablespoons of the mixture between your hands. Each gondi should measure 1 1/2 inches in diameter. You'll be able to make about 20 gondi. Transfer to a large plate as you form them. Drop the gondi one at a time in the broth. When all the gondi are in, bring the soup back up to a simmer and simmer until the gondi lighten in color slightly, puff up, and are cooked through completely, about 10 minutes. Adjust seasoning of the broth with salt and pepper. Serve, garnished with snipped chives.</p>"}]}