{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120108-186813-spinach-saag-with-potato-balls.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "creamed spinach", "Elaine Louie", "fried", "poatoes", "spinach", "The Occasional Vegetarian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "The Occasional Vegetarian's Spinach Saag with Spiced Potato Balls", "link": "https://www.seriouseats.com/recipes/2012/01/spinach-saag-with-spiced-potato-balls-recipe.html", "description": "This recipe elevates an already great <em>saag</em> by adding \r\n<em>alu kofta</em>, little deep-fried balls of mashed potatoes tinged yellow with turmeric and spiced with chiles, ginger, and garlic.  Crisp on the outside and creamy within, these potato balls have the same just-can't-stop-eating-'em goodness as another deep-fried potato-y treat: Tater Tots.  Indian-inspired Tater Tots over Indian-accented creamed spinach?  Yes, please.", "totalTime": "35 minutes", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Deep Frying", "Spinach", "Vegetarian"], "recipeIngredient": ["2 pounds large-leaf spinach", "1/4 cup olive oil ", "1 cup finely chopped onion", "1 tablespoon finely chopped garlic ", "1 tablespoon finely chopped fresh ginger", "3 to 4 Thai bird chiles, each about 1 1/2 inches long, seeded and finely chopped", "1 pound baby spinach", "1 teaspoon turmeric", "Salt", "1/4 cup dried fenugreek leaves (<em>kasuri methi</em>) ", "1 tablespoon butter", "1/4 teaspoon freshly grated nutmeg", "1/2 cup heavy cream (optional)", "Spiced Potato Balls (recipe follows)", " ", "<strong>Spiced Potato Balls</strong>", "2 medium potatoes, peeled (to yield 2 cups cooked and mashed)", "1 tablespoon vegetable oil, plus 3 cups or as needed for deep-frying", "1 teaspoon finely chopped ginger", "1 teaspoon finely chopped garlic", "1 teaspoon finely chopped seeded Thai bird chile (optional)", "1/4 teaspoon chile flakes", "1/4 teaspoon turmeric", "3 tablespoons cornstarch", "1 tablespoon lemon juice", "1/2 cup chopped cilantro (optional)", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a large bowl of ice water and set aside. Place a large pot of water over high heat and bring to a boil. Add the large-leaf spinach, and blanch until bright green and tender, 1 to 2 minutes. Drain, immediately plunge into ice water until cooled, and drain again. Squeeze out the excess moisture, chop finely, and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In a large sauté pan over medium heat, heat the olive oil until shimmering. Add the onion, and cook until soft and golden, 7 to 8 minutes. Add the garlic, ginger, and chiles, and sauté until the garlic and ginger are light brown, 2 to 3 minutes. Add the baby spinach and cook 1 minute. Add the turmeric and sauté 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the blanched chopped spinach. Season with salt to taste. Cook 5 to 10 minutes, stirring often. Add the fenugreek, butter, nutmeg, and, heavy cream, if desired. Simmer 5 minutes more, stirring occasionally. If necessary, lower the heat to medium-low. Serve hot, topped with Spiced Potato Balls, if desired.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spiced Potato Balls:</strong> Place potatoes in a medium saucepan and add cold water to cover by an inch.  Bring to a boil, lower the heat, and simmer until the potatoes are fork-tender, about 15 minutes.  Drain and mash with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In skillet over medium heat, combine 1 tablespoon oil, the ginger, garlic, chile, and chile flakes.   Sauté until the ginger and garlic are golden brown.  Add the mashed potatoes, turmeric, cornstarch, lemon juice, and cilantro, if using.  Reduce the heat to low and cook for 5 minutes, stirring often.  Season with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the potatoes from the heat and allow to cool to room temperature.  Meanwhile, heat 3 cups of vegetable oil in a deep fryer or wok to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make 16 round balls, about 1 1/2 inches in diameter, from the potato mixture.  Working in batches if necessary, fry the balls until golden brown, about 6 to 8 minutes.  Drain on paper towels and serve hot.</p>"}]}