{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121107-turkey-steam-bun-chichi-chinese-3.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "chinese turkey", "steamed buns", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese-style Roast Turkey Steamed Buns", "link": "https://www.seriouseats.com/recipes/2012/11/chinese-style-roast-turkey-steamed-buns-recipe.html", "description": "Roast turkey seasoned with five spice, vinegar, and soy sauce, stuffed into steamed buns, Peking duck-style.", "totalTime": "1 hour, plus time allotted for prepping and cooking turkey", "recipeYield": "serves 8 to 10", "recipeCategory": ["Chinese", "Mains", "Turkey"], "recipeIngredient": ["1 whole turkey (12 to 14 pounds total), butterflied <a href=\"http://www.seriouseats.com/2012/11/how-to-spatchcock-cook-turkey-thanksgiving-fast-easy-way-spatchcocked-slideshow.html\">according to this slideshow</a>, backbone, neck, and giblets reserved", "1 tablespoon vegetable oil", "Kosher salt", "1 tablespoon five spice powder", "12 whole scallions", "1 large section of ginger root, cut into 2 inch segments", "8 medium cloves garlic, smashed", "1/4 cup Shaoxing rice wine", "2 teaspoons soy sauce", "1 tablespoon oyster or hoisin sauce", "2 tablespoons sugar", "2 tablespoons Chinkiang or other rice vinegar", "1 tablespoon sesame oil", "1 tablespoon roasted chili oil", "1/4 teaspoon ground white pepper", "1 tablespoon fermented chili bean paste, or other chili paste, optional", "1/2 teaspoon toasted and ground Sichuan peppercorns, optional", " ", "<strong>To Serve:</strong>", "36 frozen steamed chinese buns", "3 scallions, finely sliced", "2 large cucumbers, julienned", "Picked cilantro leaves and tender stems", "Spicy mayonnaise (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spatchcock turkey according to <a href=\"http://www.seriouseats.com/2012/11/how-to-spatchcock-cook-turkey-thanksgiving-fast-easy-way-spatchcocked-slideshow.html#show-283133\">first 8 slides in this slideshow</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 450°F. Line a rimmed baking sheet or broiler pan with aluminum foil. Place half of scallions, ginger, and garlic in bottom of pan. Place slotted broiler rack or wire rack directly on top of vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat turkey dry with paper towels and rub on all surfaces with 1 tablespoon oil. Season liberally on all surfaces with salt and five spice powder. Tuck wing tips behind back. Place turkey on top of rack, arranging so that it does not overlap the edges, pressing down on the breast bone to flatten the breasts slightly. Transfer turkey to oven and roast, rotating occasionally, until an instant read thermometer inserted into the deepest part of the breast registers 150°F, and the thighs register at least 165°F, about 80 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the neck, giblets, and turkey back in a sauté pan and add water to cover, about 1 1/2 quarts. Add remaining ginger, scallions, and garlic, and Shaoxing wine. Bring to boil, then reduce heat to low and simmer for until the broth is rich and reduced significantly, about 1 hour. You should have about 2 cups of broth. Strain through a fine mesh strainer into a medium bowl.  Add soy sauce, hoisin, sugar, vinegar, sesame oil, roasted chili oil, white pepper, chili bean paste (if desired), and Sichuan peppercorn (if desired).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When roasted turkey is cool enough to handle, remove skin and cut into strips.  Lay out all the strips of crispy skin onto a serving platter. Pick meat into large bite-sized chunks and transfer to a large bowl. Set aside carcass for another use.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sauce to turkey and toss to mix. Taste meat and adjust seasoning with more salt, soy sauce, sugar, or vinegar as desired. Transfer all the turkey meat onto a serving platter or bowl, pouring residual sauce onto the meat. Cover with foil to keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat steamed buns according to package directions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place vegetables, garnishes, and sauces (such as additional soy sauce and sesame oil, hoisin sauce, or spicy mayo, see note) onto plates and bowls for serving.  Have your guests assemble their own turkey buns, with meat, vegetables, sauce, and a piece of crispy skin.    </p>"}]}