{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120517-206864-chicken-fried-steak2.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken fried steak", "Cook the Book", "Robb Walsh", "steak", "Texas Eats"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Robb Walsh's Southern-Style Chicken-Fried Steak", "link": "https://www.seriouseats.com/recipes/2012/05/robb-walshs-southern-style-chicken-fried-stea.html", "description": "While researching <em><strong><a href=\"http://www.amazon.com/Texas-Eats-Heritage-Cookbook-Recipes/dp/076792150X/?tag=serieats-20\">Texas Eats</a></strong></em> <a href=\"http://robbwalsh.com/about/\">Robb Walsh</a> set out on a journey of <strong>Chicken-Fried Steak </strong>discovery.  He ate his way around rural Texas, seeking out the best versions of this big Texan standard.  Some where memorable, and some not so much, but if you've ever experienced the weighty dish known as the CFS, you've got to hand it to Walsh, his search for the best steak was a stomach stretching exercise to say the least.", "totalTime": "45 minutes", "recipeYield": "serves 6 to 12", "recipeCategory": ["Beef", "Cook the Book", "Deep Frying"], "recipeIngredient": ["Peanut oil, for frying", "2 cups seasoned flour (recipe follows)", "1 cup buttermilk, evaporated milk, or milk", "1 egg, lightly beaten", "12 tenderized eye-of-round steaks (about \u20283 pounds total)", "Black Pepper Gravy (recipe follows), or your favorite gravy, for serving", " ", "<strong>Seasoned Flour</strong>", "2½ cups all-purpose flour", "2 tablespoons chili powder; New Mexico chile powder; or hot paprika ", "1 tablespoon salt", "1 tablespoon pepper", "1 tablespoon onion powder", "1 tablespoon garlic powder", " ", "<strong>Black Pepper Gravy</strong>", "¼ cup unsalted butter", "5 tablespoons all-purpose flour ", "2½ cups milk", "2 teaspoons kosher salt", "4 teaspoons coarsely ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Seasoned Flour:</strong> In a bowl, stir together all of the ingredients, mixing well. You will have more seasoned flour than you need for most recipes. Set aside the balance for making gravy, or store in a tightly capped jar in a cupboard for another time. Discard any flour in which you have dipped raw meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Black Pepper Gravy:</strong> In a heavy saucepan, melt the butter over medium-low heat. Whisk the flour into the butter and continue to whisk for about 5 minutes, until the mixture is ivory-colored and smooth. Slowly add the milk while stirring constantly, then continue to stir until free of lumps. Add the salt and pepper and simmer, stirring often, for about 10 minutes, until the gravy has thickened and reduced. Serve hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken-Fried Steak:</strong>Pour the oil to a depth of 1 inch into a deep cast-iron skillet and heat to 370°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oil is heating, put the flour in a large, shallow bowl. In a separate shallow bowl, whisk together the buttermilk and egg. Dredge each steak in the flour, shaking off the excess; dip it into the buttermilk mixture, allowing the excess to drip off; and then dredge again in the flour, evenly coating the batter so it is dry on the outside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide 2 or 3 steaks into the hot oil, being careful not to crowd them. The temperature of the oil will fall the moment the meat is added, so you will need to adjust the heat. As the steaks cook, try to keep the oil at around 350°F. If it gets too hot, the steaks will burn before they are cooked through. If it is not hot enough, the batter will be soggy. Cook the steaks for 3 to 5 minutes, until the batter is crisp and brown and the meat is cooked through. Using a wire skimmer, transfer the steaks to paper towels to drain and keep in a warm oven until all of the batches are done.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the steaks with the gravy. Plan on 2 steaks for a typical serving; children and dainty eaters will probably want only 1 steak.<br />\r\n</p>"}]}