{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121029-228063-pumpkin-doughnuts.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "breakfast sweets", "fried desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Spice Doughnuts", "link": "https://www.seriouseats.com/recipes/2012/11/pumkin-spice-doughnuts-recipe.html", "description": "Light, fluffy, and soft, these spiced pumpkin doughnuts make a perfect fall breakfast or even a non-traditional Turkey Day dessert.", "totalTime": "3 1/2 hours", "recipeYield": "Makes 20 doughnuts", "recipeCategory": ["American Classics", "Breakfast and Brunch", "Breakfast Sweets", "Deep Frying", "Doughnuts", "Pumpkin"], "recipeIngredient": ["5 1/2 cups (20 ounces) all-purpose flour", "2 1/2 teaspoons baking powder ", "1/2 teaspoon baking soda", "1 teaspoon salt", "2 1/2 teaspoons pumpkin pie spice", "2 large eggs ", "2 cups (14 ounces) sugar, divided", "1/2 cup (4 1/2 ounces) light brown sugar, firmly packed", "1/2 (4 ounces) buttermilk", "2 tablespoons melted butter", "1 tablespoon vanilla extract ", "1 cup (8 ounces) canned pumpkin puree", "1/2 teaspoon cinnamon", "2 quarts canola oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl whisk together flour, baking powder, baking soda, salt, and pumpkin pie spice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl with an electric mixer, or the bowl of a stand mixer, combine eggs,1 cup sugar, and brown sugar beating until combined and slightly foamy. Add buttermilk, melted butter, vanilla, and pumpkin puree. Stir until smooth. Slowly add flour mixture and stir until just incorporated. Lay out two large sheets of plastic wrap. Spritz plastic wrap with canola oil. Divide dough into two balls. Wrap in plastic wrap then flatten into discs. Refrigerate for at least two hours or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously flour a large work surface. Take one of the discs and turn out the dough to coat with flour, sprinkling the surface of the dough with flour to lessen stickiness. (Note the dough is EXTREMELY sticky, don't be shy about adding flour until it's workable). Gently pat the dough to about 1/2 an inch thick. Use a floured 3 inch doughnut cutter to cut out doughnuts and place cut doughnuts on a well floured sheet of parchment paper. Collect any scraps and roll out dough to cut more doughnuts until all the dough is gone.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a Dutch oven or deep fryer with 2 inches of oil. Heat oil over medium high heat to 360°F. Using a shallow, heat resistant strainer, drop doughnuts in the oil and fry until a deep golden brown on both sides (about 2 minutes per side, use the color as your guide as the oil temperature can very with time). Use wooden chopsticks to turn the doughnuts. Be careful not to crowd the doughnuts in the pan (no more than 2 to 3 doughnuts at a time). Remove doughnuts immediately from the pan using a heat resistant strainer or tongs. Set on paper towel lined baking racks to cool. Once cooled slightly, toss in a paper bag with remaining sugar and cinnamon.</p>"}]}