{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120627-212491-dinner-tonight-susan-spicer-pan-roasted-chicken-breast-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "chicken breast", "Dinner Tonight", "quick", "Susan Spicer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Susan Spicer's Pan-Roasted Chicken Breast with Vinegar, Mustard, and Tarragon", "link": "https://www.seriouseats.com/recipes/2012/07/susan-spicers-pan-roasted-chicken-breast-with-vinegar-mustard-and-tarragon.html", "description": "The process of sautéing chicken and then making a sauce out of the browned bits is one of those tricks that is undeniably delicious, but what's left to write about it? Well, for what it's worth, Spicer's version is an especially good example of the method, and that's good enough for me.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["4 boneless chicken breasts (about 6 ounces each), with skin still attached ", "Salt and pepper", "2 tablespoons canola oil or olive oil ", "1 cup chicken stock ", "6 tablespoons apple cider vinegar ", "2 tablespoons butter, softened", "2 teaspoons Dijon mustard", "2 teaspoons coarsely chopped tarragon leaves", "2 teaspoons chopped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to the bottom third position, and preheat to 325&deg;F. Season the chicken breasts with salt and pepper on both sides. Pour the olive oil into a skillet set over medium-high heat, and when just about to smoke, add the chicken breasts skin side down. Immediately reduce heat to medium, and cook until well browned on the bottom, about six to seven minutes. Move them occasionally to prevent them from sticking. Flip them, and cook until completely cooked through, about five to seven minutes. When done, transfer the chicken to an oven safe dish, and place in the warm oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour out any grease in the skillet. With the heat still on medium, pour in the stock and vinegar, and use a wooden spoon to scrape up any browned bits. Let the liquid reduce to about 1/2 cup, and then stir in the butter, mustard, and tarragon. Stir until the sauce is \"slightly creamy,\" and then turn off the heat. If needed, add more salt and pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the chicken breasts between four plates, and spoon over the sauce. Sprinkle the chives on top. I served these with a side of roasted asparagus.  </p>"}]}