{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120123-189564-gai-yang.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Thai", "keywords": ["chicken", "Cook the Book", "Cree", "Poulet", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Poulet's Gai Yang with Bird Chile Dipping Sauce", "link": "https://www.seriouseats.com/recipes/2012/01/poulets-gai-yang-with-bird-chile-dipping-sauc.html", "description": "This Thai <em>Gai Yang</em> from <em><strong><a href=\"http://www.amazon.com/Poulet-Cree-LeFavour/dp/0811879690/?tag=serieats-20\">Poulet</a></strong></em> trumps pretty much any plain ol' grilled chicken you've had. Do you see all those tasty looking charred bits?", "totalTime": "2 hours", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Thai"], "recipeIngredient": ["<strong>Gai Yang</strong>", "1 head of garlic, cloves peeled and minced", "20 peppercorns ", "5 fresh cilantro roots or 1 large bunch cilantro with stems, chopped", "1 tablespoon fish sauce", "2 teaspoon raw sugar", "One 3- to 4-pound chicken", "Jasmine rice", " ", "<strong>Bird Chile Dipping Sauce</strong>", "3 to 5 bird’s-eye chiles, minced ", "2 garlic cloves, minced", "1/3 cup raw or palm sugar", "1/4 cup rice vinegar", "1/4 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Gai Yang:</strong> Combine the garlic, peppercorns, cilantro, fish sauce, and sugar together in a mortar. Using a pestle, pound into a paste. (If you don’t have a mortar and pestle, crush the garlic and peppercorns with the side of knife, chop the coriander and garlic as finely as you can, and stir well in a bowl. You won’t have a paste, but it’ll be just fine.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken on a baking sheet/tray or in a roasting pan and slash across the breast, thighs, and legs. Rub the spice paste all over the chicken and into the cuts you’ve made. Cover and let marinate at room temperature for at least 1 hour and for to 2 hours, or refrigerate for up to 24 hours. (If refrigerating, return the chicken to room temperature for 30 minutes or so to take the chill off before you cook it.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Build a medium fire in a charcoal or wood grill/barbecue or preheat a gas grill to medium. Use well-cured grate and scrub it clean with a wire brush. If you are using charcoal or wood, you want hot embers, not flames. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butterfly the chicken.  Put the chicken skin-side down on the grate, laying it flat. Let cook for 5 minutes or so before you move it. After that, I like to flip the chicken every 5 minutes or so to keep it from sticking and to keep from burning the skin. Because you have a whole butterflied chicken, most of the time on the grill will be spent skin-side down. Nonetheless, plan on generally worrying the chicken for 30 to 40 minutes. A few black spots in this case are in the spirit of the meal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the fat is igniting flames, turn the heat down or move the chicken to a cooler spot on the grill. (You can also douse the flames with a squirt bottle if there’s no room to move the chicken out of the way.) The meat should be firm but with a little give when you poke it with your finger. Look for a reading of 175°F on an instant-read thermometer inserted into the thigh. If you’re unsure, cut into a thigh and take a peek. Clear juices running from the spot where you pierce the meat and just beyond pink but opaque flesh through to the joint is what you want.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cooked chicken from the grill to a cutting board. Using a cleaver—or your biggest, sharpest knife—chop the whole chicken into a dozen pieces or so. You will be chopping right through the bones. This is a fun but messy job—don an apron and go at it without hesitation. Serve the chopped chicken on a platter with plenty of rice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bird Chile Dipping Sauce:</strong>Make sure your ingredients are properly minced. Give them a few pounds in a mortar and pestle if you have one, or lay a large chopping knife across the peppers and garlic and press down hard to crush them. Heat the sugar and water in a small saucepan over low heat until the sugar dissolves. Add the vinegar, chiles, and garlic and bring the mixture to a simmer. Cook until fragrant, 1 or 2 minutes, then transfer the sauce to dipping bowls to cool before serving. <br />\r\n</p>"}]}