{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120822-the-seasonal-baker-fig-tart.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "fids", "seasonal baker", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fig Tart", "link": "https://www.seriouseats.com/recipes/2012/08/the-seasonal-baker-fig-tart-recipe.html", "description": "Fresh figs are a thing of beauty. This fig tart from <strong><em><a href=\"http://www.amazon.com/The-Seasonal-Baker-Recipes-Year-Round/dp/0307951871/?tag=serieats-20\" target=\"_blank\">The Seasonal Baker</a></em></strong> shows them off well.", "totalTime": "4 hours 40 minutes", "recipeYield": "Makes one 9-inch tart", "recipeCategory": ["Bake the Book", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Pastry Cream</strong>", "2 large egg yolks", "1/4 cup sugar", "1/8 cup cornstarch", "1 cup whole milk", "grated zest of 1/2 orange", "1/2 teaspoon vanilla paste or vanilla extract", "1/16 teaspoon coarse salt", "1 tablespoon cold unsalted butter, cut into small pieces", "&nbsp;", "<strong>For the Crust</strong>", "1 cup all-purpose flour", "1 stick butter", "1/8 cup sugar, or 2 tablespoons", "1/2 teaspoon coarse salt", "1 egg", "1 egg yolk", "&nbsp;", "<strong>For the Fruit Topping</strong>", "18 to 20 fresh figs, halved through the stem ends ", "1 whole fig", "2 tablespoons unsalted butter, melted", "2 tablespoons sanding sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the crust:</strong> In a bowl, whisk the flour to aerate it; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing mixer fitted with the paddle attachment, beat the butter, sugar, and salt on medium-high speed until light and fluffy, about 3 minutes, scraping down the sides of the bowl halfway through. Add the whole egg and the yolk, and mix to combine. Add the flour and beat until it has been absorbed. There will still be streaks of butter visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the dough onto a sheet of plastic wrap, shape into a flattened disk, and wrap in the plastic. Refrigerate until firm, at least 2 hours.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pastry cream:</strong>In a medium, heat-proof bowl, whisk together the egg yolks, 1/8 cup of the sugar, all of the cornstarch, and 1/4 cup of the milk; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the remaining 3/4 cup milk, the remaining sugar, the vanilla paste (or vanilla extract), the orange zest, and the salt. Bring to a simmer. Whisking constantly, gradually pour the hot milk into the egg mixture to temper it. Set a strainer over the saucepan. Strain the custard mixture back into the saucepan and bring to a boil over medium heat, whisking constantly. Boil for 10 seconds, whisking. (Make sure the custard boils for 10 seconds in the center of the pan, not just around the sides.) The mixture should thicken to a pudding-like consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pastry cream to a bowl and whisk in the butter. Whisk in the vanilla extract, if using. Cover with plastic wrap, pressing it directly on the surface of the cream to prevent a skin from forming. Refrigerate until chilled, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Putting it all together:</strong> On a lightly floured work surface, roll the dough to a 12-inch round, about 1⁄8 inch thick. Fit the dough into a 9-inch fluted tart pan with a removable bottom and trim the dough so that it comes slightly above the rim of the tart pan. Press the excess dough against the sharp edge of the rim of the pan with the heel of your hand to cut it level with the pan. Chill until firm, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the oven rack in the lower third of the oven. Preheat the oven to 425°F. Line a baking sheet with parchment paper or a nonstick silicone baking mat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the pastry cream over the bottom of the pie shell. Arrange the fig halves on top, rounded edges down, shingled tightly and in concentric circles. Quarter the remaining whole fig, leaving the quarters connected at the base. Place in the center of the tart so that the quarters open like the petals of a flower. Brush the figs with the butter and sanding sugar evenly over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, rotating the baking sheet about two-thirds of the way through the baking time, until the pastry is cooked through and the figs are tender and caramelized, about 40 minutes. Transfer to a wire rack to cool.<br />\n </p>"}]}