{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120919CrunchRigatoni.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["breadcrumbs", "Dinner for Two", "garlic", "pasta", "quick", "rigatoni", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rigatoni with Breadcrumbs, Rosemary, Garlic, and Parmigiano Reggiano", "link": "https://www.seriouseats.com/recipes/2012/09/rigatoni-with-rosemary-garlic-pamirgianao-reggiano-recipe.html", "description": "Rigatoni in a simple sauce of pasta water and cold sweet butter, topped with a crown of nutty breadcrumbs, almonds, garlic, rosemary, and Parmesan.  Simple, but good.", "totalTime": "20 minutes", "recipeYield": "serves 2 to 4", "recipeCategory": ["Dinner for Two", "Garlic", "Mains", "Pasta", "Vegetarian"], "recipeIngredient": ["1 cup breadcrumbs, preferably fresh", "1 medium clove garlic", "1 tablespoon fresh rosemary leaves", "3 tablespoons sliced almonds", "1/4 cup grated Parmigiano Reggiano", "Kosher salt and freshly ground black pepper", "4 tablespoons unsatled butter (divided)", "1 pound dry rigatoni rigate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the food processor, combine breadcrumbs, garlic, rosemary, almonds, and Parmigiano Reggiano. Season to taste with salt and pepper and pulse until just combined, about 5 one-second pulses.  Add 1 tablespoon of butter, and pulse until the butter is evenly distributed into the crumbs, about 5 more pulses. Place the mixture in a sauté pan over medium heat, and toast, stirring often, until the crumbs are golden brown, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook the rigatoni according to package directions in a pot of salted water.  Reserve 1 cup of cooking water before draining the pasta.  Add the water back to the empty pasta pot, and bring to a simmer.  Cube the remaining cold butter, and whisk it in a little at a time, to create a milky emulsion. Remove from heat and stir in the rigatoni. Season to taste with salt and pepper. Pour into a serving bowl, and top with the breadcrumb mixture, extra Parmigiano Reggiano, and torn rosemary leaves.</p>"}]}