{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120530-207642-british-bites-chelsea-buns.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "chelsea buns", "cinnamon rolls", "sticky buns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "2"}, "name": "Chelsea Buns (British Cinnamon Rolls with Raisins)", "link": "https://www.seriouseats.com/recipes/2012/05/chelsea-buns-cinnamon-roll-with-raisins-recipe.html", "description": "These sweet, British-style glazed buns are similar to a cinnamon roll with a heartier bready texture, a sweet icing, and raisins sprinkled in for good measure.", "totalTime": "2 hours 30 minutes", "recipeYield": "makes 8 buns", "recipeCategory": ["Breakfast Sweets", "British Bites", "Cakes", "Pastry"], "recipeIngredient": ["<strong>For the Dough</strong>:", "2 cups all-purpose flour", "pinch of salt ", "2 1/4 teaspoons (1 envelope) yeast", "1/4 teaspoon sugar", "5 tablespoons butter, divided", "1 3/4 cups milk, divided", "1 egg, beaten", "Vegetable oil", " ", "<strong>For the Filling</strong>:", "1 cup raisins", "1/2 cup brown sugar", "1/4 teaspoon cinnamon", " ", "<strong>For the Icing</strong>:", "4 tablespoons confectioners sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl combine the flour and salt, then make a well in the center.  Sprinkle the yeast and sugar into the center of the well.  In a small saucepan heat 2 tablespoons butter and 1 1/2 cups milk over medium heat until the butter has melted and the milk is just warm. Allow to cool for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk into the center of the flour well.  Mix gently with a wooden spoon then add beaten egg.  Mix until a dough forms. Knead with hands for 5 minutes then place in a clean bowl, and coat with thin layer of vegetable oil.  Leave to rise in a warm place, covered with a clean dish towel, until roughly doubled in size, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press down dough, then turn out onto a floured work surface. Roll dough with a rolling pin into a rough 8- by 13-inch rectangle with the large edge running parallel to the counter's edge. Melt 2 more tablespoons butter in a small bowl in the microwave. Brush dough with butter, making sure to leave a 1-inch border along the top edge. Add raisins and brown sugar on top of butter.  Sprinkle with cinnamon. Gently roll away from you to form a 13 inch-wide tube. Use a thin, sharp knife to cut the tube into 8 equal pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter an 8- by 11-inch baking dish with remaining tablespoon of butter, then place rolls in buttered dish. Adjust oven rack to middle position and preheat oven to 375°F. Let the buns rise in a warm place until doubled again, about 30 minutes. Bake until golden brown, about 20 minutes. Remove from oven and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the remaining 1/4 cup milk and the confectioner's sugar in a saucepan and whisk until smooth.  Bring to a simmer and cook for 2 minutes. Pour over Chelsea buns while still warm.  Serve warm.</p>"}]}