{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120613-kenjis-larb-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["larb", "pork", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Pork Larb (Thai Salad with Pork, Herbs, Chili, and Toasted Rice Powder)", "link": "https://www.seriouseats.com/recipes/2012/06/pork-larb-thai-salad-with-pork-herbs-chili-an.html", "description": "A classic Northern Thai dish, larb is a meat-based salad that exemplifies the hot, sour, pungent, and sweet flavor balance typical of many Thai dishes. Our version uses fried shallots for extra flavor along with toasted rice powder, giving it an intense nuttiness. We found that grinding the meat yourself in a food processor results in a more interesting and varied texture.", "totalTime": "30 minutes", "recipeYield": "serves 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Pork", "Salads", "Thai"], "recipeIngredient": ["3/4 pound lean pork or chicken, trimmed of connective tissue and cut into 1-inch cubes", "1/2 cup dry glutinous rice (See note)", "1/2 cup thinly sliced shallots", "1/2 cup vegetable oil", "1/4 cup fish sauce", "2 scallions, thinly sliced", "1/2 cup roughly chopped fresh basil leaves (preferably Thai)", "1/2 cup roughly chopped fresh cilantro leaves and tender stems", "1/4 cup roughly chopped fresh mint leaves", "2 tablespoons ground dry Thai chilis (more or less to taste)", "1/4 cup lime juice from about 4 limes", "2 tablespoons palm sugar (see note)", "Crumbled pork rinds (optional)", "Thinly sliced fresh red chili (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place meat on a tray leaving a one inch space between each cube and place in freezer until firm but not frozen, about fifteen minutes. Transfer half of meat to bowl of food processor and pulse until meat is roughly ground and no pieces larger than 1/4-inch remain, about 10 one-second pulses. Transfer meat to a bowl. Repeat with remaining meat. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While meat chills, place rice in an empty 12-inch skillet and heat over medium-high heat shaking constantly until rice is golden brown and a nutty popcorn-like aroma emerges, about 6 minutes. Transfer to mortar and pestle and grind until it has the texture of cracked black pepper. Alternatively, grind in a spice grinder. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add oil and shallots to now-empty skillet and cook over medium-low heat, stirring constantly until shallots are golden brown, about 5 minutes. Drain shallots and discard oil but do not wipe out pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pork, 1 tablespoon fish sauce, and 2 tablespoons water to pan. Cook, stirring frequently until pork is just cooked through but not browned at all, about 6 minutes. Transfer to a large bowl and allow to cool five minutes. Add remaining fish sauce, scallions, basil, cilantro, mint, half of chili, lime juice, sugar, and toasted rice powder. Toss with hands and taste for seasoning, adding more chili if higher heat is desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, add fried shallots and toss again. Granish with pork rinds and chili. Serve immediately with cabbage or lettuce on the side.</p>"}]}