{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120510-fiaf-coq-au-vin-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["chicken", "coq au vin", "French in a Flash", "grill", "grilling", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Coq au Vin", "link": "https://www.seriouseats.com/recipes/2012/05/grilled-coq-au-vin-recipe.html", "description": "A barbecue sauce made from all the flavors of coq au vin: deep Burgundy wine, earthy mushrooms, sweet onions, and woodsy herbs, caramelized and grilled onto juicy, bone-in chicken. Stew hits summer!", "totalTime": "55 minutes, plus overnight marinate", "recipeYield": "serves 2 to 4", "recipeCategory": ["Chicken", "French", "Grilling", "Mains"], "recipeIngredient": ["2 bone-in, skin-on whole chicken legs (about 1 pound)", "2 bone-in skin-on chicken breast halves (about 1 pound)", "2 cups red Burgundy wine", "1 3/4 ounces cubed pancetta (about 1/3 cup)", "1 very large shallot, finely diced (about 1/2 cup)", "3 medium cloves garlic, finely chopped (about 1 tablespoon)", "1/8 ounce dried wild mushrooms", "1/4 cup ketchup", "1 teaspoon Dijon mustard", "3 tablespoons light brown sugar", "1 tablespoon white wine vinegar", "1 tablespoon fresh thyme leaves", "1 bay leaf", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken and wine in a large baggie and refrigerate over night.  Remove the chicken, and pat dry. Reserve the wine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, cook pancetta over medium heat until just starting to crisp, about 5 minutes. Add the shallots reduce heat to low, and cook, stirring occasionally until shallots are soft, about 2 1/2 minutes. Add garlic and continue to cook, stirring constantly, until fragrant, about 30 seconds longer. Add the reserved wine and porcinis, and bring to a boil.  Add the ketchup, mustard, sugar, vinegar, thyme, and bay leaf. Cook over low heat until the mixture is thick and coats a spoon, about 20 minutes. Remove the bay leaf, and pur&eacute;e mixture in the blender until smooth, about 30 seconds. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a cast iron grill pan or a grill to medium heat. Season the chicken with salt and pepper, and toss in about 1/3 of the barbecue sauce. Lightly oil the hot grill and cook chicken turning once, until breasts register 155°F on an instant-read thermometer and legs register 165°F, about 30 minutes. If chicken skin begins to burn, reduce heat and continue cooking. Remove chicken from grill as it reaches temperature and tent with foil to keep warm. Allow chicken to rest for 5 minutes, then serve.</p>"}]}