{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121012SpicedBeanCakes.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Mexican", "keywords": ["beans", "cinco de mayo", "Dinner for Two", "Mexican", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Spicy, Smoky Bean Cakes with Lime Slaw and Charred Avocado", "link": "https://www.seriouseats.com/recipes/2012/12/spicy-smoky-bean-cakes-with-lime-slaw-and-charred-avocado-recipe.html", "description": "These hearty vegan black and kidney bean cakes are spiked with chipotle and handfuls of sharp vegetables, cilantro, and lime, baked until crisp, and served on a bed of slaw. Charred avocado on top adds a bit of smoky, creamy flavor.", "totalTime": "40 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dairy-Free", "Dinner for Two", "Mains", "Mexican", "Vegan", "Vegetarian"], "recipeIngredient": ["3 cups shredded green or white cabbage", "1/4 cup fresh cilantro leaves, chopped, divided", "5 scallions, chopped, finely sliced, divided", "1 jalapeno, seeded and finely chopped, divided", "3 limes, divided", "1 tablespoon mayonnaise (or Vegenaise to keep it vegan)", "2 medium cloves garlic, chopped", "1/2 red bell pepper, roughly chopped", "1 (15-ounce) can of kidney beans or pinto beans, drained and rinsed", "1 (15-ounce) can of black beans, drained and rinsed", "1 whole chipotle in adobo, finely chopped, plus 1 tablespoon sauce (2 to 3 tablespoons total)", "1/2 cup flour", "Olive oil, for drizzling", "1 avocado (optional)", "Crumbled mature cheddar, Monterey Jack, or queso fresco (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 475°F.  In large bowl, stir together the cabbage, half the cilantro, half the scallions, half the jalapeno, the juice and zest of 2 limes, mayonnaise, and salt to taste.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the food processor, combine the remaining cilantro, scallions, jalapeno, garlic, and bell pepper and pulse until finely chopped, about 8 to 10 short pulses.  Add the juice and zest of the remaining lime and season with salt.  Pulse in the beans and chipotle until you have a homogenous mixture.  Add the flour and pulse to combine. Divide mixture into 6 even portions and form into 4-inch patties.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with parchment, and lightly drizzle the bottom with olive oil.  Place patties on the baking sheet, and lightly flatten.  Drizzle lightly with olive oil.  Bake until crisp and golden brown, about 25 minutes. Serve with the slaw, and some sliced ripe avocado and/or crumbled cheese and cilantro over the top.</p>"}]}