{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120901-corn-cakes-veg-recipe.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["corn", "corn pancakes", "dill", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Spicy Corn Pancakes with Dill Yogurt", "link": "https://www.seriouseats.com/recipes/2012/09/spicy-corn-pancakes-with-dill-yogurt-recipe.html", "description": "Lacy and crispy when they come out of the frying pan, these pancakes get a cooling dose of lemon and dill flavored yogurt.", "totalTime": "25 minutes", "recipeYield": "Makes 12 - 15 pancakes (serves 4-6)", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Corn", "Mains", "Pancake", "Sides", "Vegetarian"], "recipeIngredient": ["1 1/2 cups Greek yogurt (see note)", "2 tablespoons chopped fresh dill", "About 3 tablespoons juice from about 2 lemons", "Kosher salt and freshly ground black pepper", "2 tablespoons extra virgin olive oil", "3 medium to large ears corn, cut off the cob (about 3 cups corn kernels)", "2 medium jalapeños, finely chopped, seeds and ribs left in for spicy, or removed for less spicy", "3 medium green onions, finely chopped ", "1/2 cup cornmeal", "1/4 cup all-purpose flour", "1/2 teaspoon baking powder", "2 eggs, lightly beaten", "1/2 cup buttermilk", "Vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine yogurt with dill and lemon juice; season to taste with salt and pepper and stir to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large cast iron skillet over medium heat until shimmering. Add corn kernels, jalapeño and green onions and season to taste with salt and pepper. Cook, stirring occasionally, until vegetables soften and begin to brown, about 5 minutes. Transfer vegetables to a large mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together cornmeal, flour, baking powder, and 1 teaspoon salt in a medium bowl. Whisk together eggs and buttermilk in a second medium bowl. Add flour mixture to bowl with corn, then add buttermilk mixture and fold with a spatula to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet and add 3 tablespoons vegetable oil. Heat pan over medium heat until oil is just starting to smoke. Use a 1/4 cup measure to scoop pancake batter into pan, forming 3 pancakes at a time. Fry until edges of pancakes brown, about 4 minutes, adjusting heat as necessary to prevent burning. Flip carefully&mdash;pancakes are very delicate. Cook until other side is browned, about 4 minutes. Transfer pancakes to a paper towel-lined baking sheet. Keep warm in a 200°F oven if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking pancakes, working in batches of three. Between batches, remove any stray corn kernels so that they do not burn, and add additional frying oil as necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pancakes to serving platter and top with dill yogurt and additional fresh dill, if desired. Serve immediately.</p>"}]}