{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120228-bakethebook-marshmallowmadness-seasaltcaramelmarshmallows.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Marshmallow Madness", "marshmallows", "salted caramel", "Shauna Sever"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sea Salt Caramel Swirl Marshmallows", "link": "https://www.seriouseats.com/recipes/2012/02/sea-salt-caramel-swirl-marshmallows-recipe.html", "description": "Mastering the art of marshmallow making gives candy makers the opportunity to play with all sorts of exciting flavors because, after all, the marshmallow really is just a squishy blank canvas.  We have to tip our hats to <strong><a href=\"http://shaunasever.com/about\">Shauna Sever</a></strong>, author of <em><strong><a href=\"http://www.amazon.com/Marshmallow-Madness-Dozens-Puffalicious-Recipes/dp/1594745722/?tag=serieats-20\">Marshmallow Madness</a></strong></em> for having the foresight and vision to bring together two of our favorite confections in these <strong>Sea Salt Caramel Swirl Marshmallows</strong>.  And if you're wondering, they're just as great as they sound.  Tender, bouncy vanilla marshmallows run through with ribbons of sweet and salty caramel.", "totalTime": "9 hours", "recipeYield": "makes about 2 dozen 1 Â½-inch mallows", "recipeCategory": ["Bake the Book", "Candy"], "recipeIngredient": ["<strong>The Swirl</strong>", "1/3 cup sugar", "2 tablespoons water", "1 teaspoon light corn syrup", "3 tablespoons cream", "1/8 teaspoon sea salt", " ", "<strong>The Mallowing</strong> ", "1 batch Classic Vanilla marshmallow batter (recipe follows)", "1/2 cup Classic Coating, plus more for dusting (recipe follows)", " ", "<strong>Classic Vanilla Marshmallows</strong>", "<strong>The Bloom</strong>", "4 1/2 teaspoons unflavored powdered gelatin ", "1/2 cup cold water", " ", "<strong>The Syrup</strong>", "3/4 cup sugar ", "1/2 cup light corn syrup, divided", "1/4 cup water", "1/4 teaspoon salt", " ", "<strong>The Mallowing</strong>", "2 teaspoons pure vanilla extract ", "1/2 cup Classic Coating plus more for dusting (recipe follows)", " ", "<strong>Classic Coating</strong>", "1 1/2 cups confectioners’ sugar", "1 cup cornstarch or potato starch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Classic Coating:</strong> Sift the ingredients together in a large bowl or combine them in a food processor. I tend to make several cups’ worth at a time and store it in an airtight container; it keeps forever.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Classic Vanilla Marshmallows:</strong> Lightly coat an 8-by-8-inch baking pan with cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the gelatin and cold water in a small bowl and let soften for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the sugar, 1/4 cup of the corn syrup, water, and salt in a medium saucepan over high heat. Boil, stirring occasionally, until the temperature reaches 240°F. Meanwhile, pour remaining 1/4 cup corn syrup into the bowl of an electric mixer fitted with the whisk attachment. Microwave gelatin on high until completely melted, about 30 seconds. Pour it into the mixer bowl. Set the mixer speed to low and keep it running. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the syrup reaches 240°F, slowly pour it into the mixer bowl. Increase the speed to medium and beat for 5 minutes. Increase to medium-high and beat for 5 more minutes. Beat on the highest setting for 1 to 2 minutes more and beat in the vanilla; the finished marshmallow will be opaque white, fluffy, and tripled in volume. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Sea Salt Caramel Swirl Marshmallows:</strong> Stir together the sugar, water, and corn syrup in a small saucepan over high heat. Stir until the sugar is dissolved and the syrup comes to a bubble. From this point on, don’t stir the syrup; just occasionally swirl the pan gently. When the caramel reaches a light amber color, remove the pan from the heat and quickly whisk in the cream. The caramel will bubble violently, so be careful. Whisk in the salt. Transfer the caramel to a medium bowl.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip up a batch of Classic Vanilla batter. Working quickly, scoop about a quarter of the finished batter into the bowl with the caramel. Whisk the mixture together until well blended. Scrape the caramel marshmallow back into the bowl with the vanilla batter and, using a large spatula and a figure-eight motion, fold and swirl the two together. Pour the marshmallow into the prepared pan, using an offset spatula to smooth it into the corners and flatten the top. Sift coating evenly and generously over the top. Let it set for 8 hours in a cool, dry place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a knife to loosen the marshmallow from the edges of the pan. Invert the slab onto a coating-dusted work surface and dust it with more coating. Cut it into pieces and dip the sticky edges in more coating, patting off the excess. After a day or two of storage, these mallows may need to be redusted with coating.</p>"}]}