{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/4182012-201398-bubble-and-squeak-new2.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british", "british bites", "brussels sprouts", "bubble and squeak", "potato cakes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bubble and Squeak, Without the Leftovers", "link": "https://www.seriouseats.com/recipes/2012/04/bubble-squeak-without-the-leftovers-brussels-sprouts-potatoes-recipe.html", "description": "Times of need call for resourcefulness and creativity, and it is out of that need that bubble and squeak was born. Bubble and squeak became popular during the Second World War when rationing was in effect throughout Britain and the need to stretch every morsel of food was a necessity.  Taking whatever was left after a roast and frying into a cake (or sometimes hash) made those leftovers into an entirely new meal without wasting anything from the previous dinner.", "totalTime": "30 minutes", "recipeYield": "serves 4 (makes 8 cakes)", "recipeCategory": ["Vegetarian"], "recipeIngredient": ["4 medium russet potatoes, peeled and cut into 2-inch chunks", "2 tablespoons unsalted butter, divided", "1/4 cup milk", "Kosher salt and freshly ground black pepper", "1/2 medium onion, finely chopped (about 1/2 cup)", "10 ounces (about 18) Brussels sprouts", "1/2 cup all-purpose flour", "1 to 2 cups vegetable oil for frying", "8 eggs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a small pot and cover with cold water, bring to a boil, and cook until potatoes are soft and mashable, about 8 minutes.  Drain and place back in the pot; add 1 tablespoon butter and all of milk to the potatoes and mash. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve brussel sprouts, then using a small knife, make a V-shaped cut around the core of each halved sprout to remove the core. Discard the cores.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining butter in a sauté pan over medium heat and add chopped onion. Cook, stirring frequently, until soft and beginning to brown, about 6 minutes. Add brussels sprouts and 2 tablespoons water, cover, and steam stirring often until the leaves begin to separate and sprouts begin to soften (about 6 minutes).  Add sprouts and onion to potatoes and mix until well combined; season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place flour in a shallow bowl. Divide potato mixture into 8 evenly sized cakes and dredge in flour.  Pour 1/4 inch vegetable oil into a skillet and heat over medium high heat until shimmering.  Fry cakes on each side until brown (about 3 minutes per side) and serve immediately, topping with fried eggs if you’d like.</p>"}]}