{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121211-btb-classic-european-nougat.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "candy", "nougat", "the liddabit sweets cookbook", "torrone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Classic European Nougat", "link": "https://www.seriouseats.com/recipes/2012/12/classic-european-nougat-recipe.html", "description": "At this time of year, store shelves are full of <em>torrone</em> and its varieties. I spotted coffee, cranberry and pistachio versions on my last trip - I also noted the hefty price tag. Make your own, fresh, giant batch of soft, chewy (or firm!) nougat, and flavor it however you like.", "totalTime": "2 hours", "recipeYield": "makes about 100 one-inch bites or 30 one- by three-inch bars", "recipeCategory": ["Bake the Book", "Candy", "Desserts"], "recipeIngredient": ["Wafer paper (see note in Step 1), or about 1 teaspoon butter and 1 tablespoon cornstarch, for coating the baking sheet ", "Cooking spray or vegetable oil ", "2 large egg whites, at room temperature ", "1/4 teaspoon (1 gram) cream of tartar", "3 cups (575 grams) granulated sugar, divided  into ½ cup and 2½ cups", "2 cups (675 grams) honey", "3/4 cup (275 grams) light corn syrup ", "1/4 cup (60 grams) water", "1/2 teaspoon (3 grams) salt", "2 cups (285 grams) toasted whole almonds, preferably Marcona", "2 cups (285 grams) toasted whole hazelnuts", "1 cup (125 grams) shelled roasted pistachios", "1 vanilla bean, split open and seeds scraped out, pod reserved", "About 1 cup (120 grams) confectioners’ sugar, sifted, for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the baking sheet: If you’re using wafer paper*, place a single sheet on the bottom of the pan and trim pieces from another sheet to fill in any gaps. Otherwise, grease the bottom and sides of the baking sheet with the butter and sprinkle the cornstarch over that, tilting and tapping the pan (over the sink or a trash can) to coat all the surfaces evenly. Set it aside. Coat your heatproof spatula generously with cooking spray and set it aside, too.</p>\n\n<p>note: Wafer paper is an edible paper available from Sugarcraft, and from Amazon; it is sold in 8 × 11-inch sheets and often in bulk, though you will only need a few. Using it in this recipe is completely optional; as long as you grease the pan very well, you should be able to remove the nougat with no problem.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the egg whites in the bowl of the stand mixer. Add the cream of tartar and whip on medium speed until the whites are frothy, about 1 minute. Increase the speed to medium-high and slowly stream in the ½ cup sugar. Once it is all mixed in, continue to whip on medium-high speed until soft peaks form (if you lift the whisk out of the whites, they will form a point that flops over onto its side), 3 to 5 minutes. Set this mixture—it’s now meringue—aside, but keep it in the mixer bowl, with the mixer ready to go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the remaining 2½ cups sugar with the honey, corn syrup, water, and salt in a medium-size (4-quart) saucepan. Bring to a boil, uncovered and without stirring, over high heat. Reduce the heat to medium-high, insert the candy thermometer, and cook the syrup until it reaches 295°F/146°C (soft-to-hard crack stage), about 15 minutes (see Jen Says on next page—later. For now, stay focused!). Remove it from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start whipping the meringue on medium speed; then put on your oven mitts and slowly pour the hot syrup in a stream down the inside of the mixer bowl (careful, careful, careful: If you pour the syrup directly on the whisk, it will splatter). Once all the syrup is incorporated, increase the mixer speed to high and whip until the meringue gets very stiff and sticky, 3 to 5 minutes. When your mixer starts complaining, you’ll know it’s ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the mixer and immediately and quickly stir in all the nuts and the vanilla seeds with the spatula. Pour the nougat onto the prepared baking sheet and either cover it with a layer of wafer paper or sift a generous amount of confectioners’ sugar on top. If you need to spread it out into a more even layer, place a piece of parchment or a silicone mat on top of the wafer- or sugar-covered nougat and gently press down with flat hands until it’s even. Allow the nougat to cool to room temperature, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover a cutting board with parchment or a generous dusting of confectioners’ sugar. Generously coat a sharp chef’s knife and a paring knife with cooking spray. Run the paring knife around the edge of the nougat to loosen it, and then gently turn it out onto the cutting board. (If the nougat is being stubborn, oil the bench scraper and use it to help loosen it around the edges.) Using the chef’s knife, trim the edges of the nougat and then slice it into bars or little bites. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the nougat, layered with parchment or wrapped in wax paper wrappers, in an airtight container at cool room temperature for up to 2 weeks.</p>"}]}