{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121211-duck-fat-potatoes-garlic-parsley-parmesan.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["fingerling potatoes", "garlic", "potatoes", "The Food Lab", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Crispy Potatoes With Garlic-Parmesan Butter", "link": "https://www.seriouseats.com/recipes/2012/12/crispy-potatoes-garlic-parmesan-butter-recipe.html", "description": "Crispy fingerling potatoes tossed in garlic-parmesan butter. A perfect side dish for a roast dinner.", "totalTime": "45 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Garlic", "Potato", "Sides", "Thanksgiving", "The Food Lab", "Vegetarian"], "recipeIngredient": ["3 pounds new or fingerling potatoes, scrubbed clean", "Kosher salt", "5 tablespoons unsalted butter", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 teaspoon red pepper flakes", "3 tablespoons finely minced fresh parsley leaves", "2 ounces finely grated Parmigiano-Reggiano (about 1 cup)", "6 tablespoons duck fat or olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a large saucepan and cover with cold water. Season heavily with salt. Bring to a boil over high heat, reduce to a simmer, and cook until potatoes are completely tender and a cake tester or paring knife inserted into potato shows little resistance, about 5 minutes after it starts boiling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt butter in a small saucepan over medium heat. Add garlic and pepper flakes and cook, stirring consantly, until softened and fragrant but not browned, about 1 minute. Transfer to a large bowl. Add parsley and grated cheese. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain potatoes and allow to cool slightly. When cool enough to handle, split each potato in half lengthwise. Heat 3 tablespoons  duck fat (or olive oil, if using) in a large non-stick or cast iron skillet over medium-high heat until shimmering. Add as many potatoes as you can fit in a single layer, cut-side down (you should be able to fit about half the potatoes). Cook, shaking pan occasionally, until potatoes are golden brown and crisp, about 10 minutes. Transfer to bowl with garlic butter. Repeat with remaining duck fat (or olive oil) and potatoes, transferring to same bowl. Toss potatoes to coat evenly in garlic-butter mixture, and season to taste with salt. Serve immediately.</p>"}]}