{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120320-cookiemonster-chocolatecrinklecookies-primary.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["chocolate", "cookie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.5", "ratingCount": "2"}, "name": "Chocolate Crinkle Cookies", "link": "https://www.seriouseats.com/recipes/2012/03/chocolate-crinkle-cookie-recipe.html", "description": "I hate fudge, but I <em>love</em> fudgy things. They're soft, verging on gooey; indulgent and chocolaty. These classic crinkle cookies are a prime example. Made with unsweetened cocoa powder and instant espresso powder, they have a deep chocolaty richness with a slightly bitter backbone that stands up to the powdered-sugar coating.", "totalTime": "1 hour 45 minutes", "recipeYield": "Makes about 3 dozen cookies", "recipeCategory": ["Christmas", "Cookies", "Desserts"], "recipeIngredient": ["2 1/4 cups all-purpose flour (11.25 ounces; 320g)", "2 1/4 teaspoons (9g) baking powder", "3/4 teaspoon (4g) instant espresso powder", "3/4 teaspoon (3g) kosher salt ", "2 1/4 cups granulated sugar (15 1/2 ounces; 425g)", "1 1/2 cups unsweetened cocoa powder (6 ounces; 150g)", "1 stick plus 1 tablespoon unsalted butter (4 1/2 ounces; 130g), melted and cooled slightly", "4 large eggs", "1 teaspoon (5ml) vanilla extract", "About 1 1/2 cups confectioners' sugar (6 ounces; 170g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together flour, baking powder, instant espresso powder, and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl or the bowl of a stand mixer fitted with the paddle, beat together granulated sugar, cocoa powder, and melted butter, starting at low speed and increasing to medium speed, until crumbly. Add eggs, one at a time, beating well between additions. Add vanilla. Reduce mixer speed to low and add dry ingredients. Beat until combined, scraping bottom and sides of bowl with a rubber spatula as needed. Dough will be crumbly. Cover bowl with plastic wrap and refrigerate for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper- and lower-middle positions and preheat oven to 350&deg;F. Line 2 baking sheets with parchment paper. Pour confectioners' sugar into a shallow bowl. Scoop dough into 1-tablespoon balls and roll in confectioners' sugar to coat. Make sure dough balls are heavily coated. Transfer dough balls to the prepared baking sheets, leaving at least 2 inches of space between each ball. You should be able to fit about 18 balls on each sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cookies until cracked on top but still slightly soft in the middle, 13 to 15 minutes, rotating baking sheets top to bottom and front to back halfway through baking. Let cool on baking sheets for 5 minutes, then transfer cookies to a wire rack to cool completely. Be careful when handling to avoid ruining the sugar coating.</p>"}]}