{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120620-dt-scott-conants-cavatelli-with-wilted-greens-pancetta-and-chickpeas.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chickpeas", "pasta", "Scott Conant"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Scott Conant's Cavatelli with Wilted Greens, Pancetta, and Chickpeas", "link": "https://www.seriouseats.com/recipes/2012/06/scott-conants-cavatelli-with-wilted-greens-pa.html", "description": "I loved the idea of chickpeas in a pasta dish&mdash;a simple and inexpensive way of adding protein&mdash;which drew me to the recipe. I stayed for the relatively unusual remaining ingredients: pancetta, shallots, and mustard greens.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Legumes", "Mains", "Pasta"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "4 ounces pancetta, diced", "2 medium shallots, thinly sliced", "1 15-oz can chickpeas", "1 bunch mustard greens or other bitter greens, trimmed of tough stems, well washed, and coarsely chopped (about 2 cups)", "1 pound cavatelli or other small shaped pasta", "1/4 cup grated Parmigiano-Reggiano, or more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) skillet, heat the olive oil over medium heat until shimmering. Add the pancetta and cook, stirring occassionally, until crisp. Remove with a slotted spoon and pour off all but about 3 tablespoons of fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shallots to the skillet and cook until soft and beginning to caramelize, then add the chickpeas and greens. Tosss well and cook until the greens are wilted. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook the pasta in salted water until al dente. Reserve 1 cup of the pasta cooking water before draining. Return the pasta to its cooking pot and add the contents of the skillet along with the reserved pancetta, some of the cooking water, and most of the Parmesan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss well to combine over low heat, adding pasta cooking water as needed, to create a silky sauce around the pasta. Season to taste with salt. Serve immediately with more Parmesan.</p>"}]}