{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121031-227805-cook-the-book-holy-hoecakes.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["alan ball", "Cook the Book", "gianna sobol", "hoecakes", "Marcelle Bienvenu", "true blood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "'True Blood's' Holy Hoecakes", "link": "https://www.seriouseats.com/recipes/2012/10/true-bloods-holy-hoecakes.html", "description": "<strong>Hoecakes</strong>--aka corn pone, johnny cakes, or cornmeal pancakes--are a fairly common sight at brunch tables in the South, but are perhaps less known above the Mason-Dixon line. In their most basic form, a hoecake is simply a mixture of batter of cornmeal, water, and salt fried in lard or rendered bacon fat. (Other more modern recipes add flour, eggs, or whole corn to the batter.) The <strong>Holy Hoecakes</strong> in the <em><a href=\"http://www.amazon.com/True-Blood-Drinks-Bites-Temps/dp/1452110867/?tag=serieats-20\">True Blood</a></em> cookbook fully embrace the simplicity of the original, adorning the cakes only with a (generous) drizzle of maple syrup. While as basic as you get, the crisp, porky outsides and soft, creamy insides make for hoecakes more than the sum of their parts.", "totalTime": "20 minutes", "recipeYield": "serves 2 to 4", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Cook the Book", "Gluten-Free", "Halloween", "Pork", "Sides"], "recipeIngredient": ["1 cup white cornmeal", "1/2 teaspoon salt", "3/4 cup boiling water", "2 tablespoons bacon fat (rendered from about 4 slices bacon), plus more as needed", "Maple syrup or cane syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cornmeal and salt in medium bowl. While stirring constantly with a wooden spoon, pour in the boiling water in a steady stream. Beat until smooth. Let stand a few minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the bacon fat in a large, heavy skillet over medium-high heat. When very hot (but not smoking), reduce the heat to medium-low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each hoecake, drop about 2 tablespoons of the cornmeal mixture into the skillet and pat gently into a flat circle, about 4 inches in diameter. Cook several hoecakes at a time until golden brown, about 2 minutes on each side, turning with a wide spatula. Transfer to a plate. If needed, add more bacon fat to the skillet to make the remaining hoecakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle with maple syrup and serve.</p>"}]}