{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120502-204557-mark-bittman-grilled-steak-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "How to Cook Everything The Basics", "mains", "Mark Bittman", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mark Bittman's Grilled or Broiled Steak", "link": "https://www.seriouseats.com/recipes/2012/05/mark-bittmans-grilled-or-broiled-steak-recipe.html", "description": "Here's a scenario that we're sure at least a few of you are familiar with. A big, beautiful steak catches your eye at the market, perhaps a dry aged ribeye or a well marbled locally raised T-bone.  After a bit of inner dialogue (those things aren't cheap), you take the plug and take the steak home.  Then a moment of panic hits.  How am I going to cook this thing?  What if I overcook it and all of its beefy deliciousness is for naught?  \r\n\r\nTo resolve this beef related quandary, we present <strong>Mark Bittman's Grilled or Broiled Steak</strong> from <em><strong><a href=\"http://www.amazon.com/How-Cook-Everything-The-Basics/dp/0470528060/?tag=serieats-20\">How to Cook Everything The Basics</a></strong></em>.  Meat plus salt and pepper plus heat equals a great steak, no fancy stuff, no elaborate technique, just a broiler or a grill, and knife to test the steak's doneness, and done.", "totalTime": "20 to 25 minutes", "recipeYield": "2 to 4 servings", "recipeCategory": ["Beef", "Cook the Book", "Mains"], "recipeIngredient": ["2 strip, rib-eye, or other steaks (about 1 inch thick and 1/2 pound each), at room temperature", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a grill or turn on the broiler; the heat should be medium-high and the rack about 4 inches from the heat source. If you’re broiling, put a large ovenproof skillet on the rack 10 minutes before you’re ready to cook.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blot the steaks dry with a paper towel and sprinkle the top with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the steaks—seasoned side down—on the hot grill or under the broiler and sprinkle the top with salt and pepper. Cook, undisturbed, until they release easily, about 3 minutes. Turn and cook the other side, checking for doneness by peeking inside with a sharp knife and checking the same spot frequently. For medium-rare, figure about 3 more minutes (if they’re over an inch thick, you’ll need a little more time; if they’re under an inch, you’ll need a little less).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the steaks are still a little bit redder than you want them, remove them from the heat and let them rest for at least 5 minutes. Sprinkle the steaks with more salt and pepper if you like and cut them in half crosswise or leave whole and serve.</p>"}]}