{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/diyvsbuy-raspberryliqueur.jpg", "author": {"@type": "Person", "name": "Marcia Simmons"}, "recipeCuisine": "", "keywords": ["cocktail ingredients", "DIY vs Buy", "liqueur", "raspberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "DIY Raspberry Liqueur", "link": "https://www.seriouseats.com/recipes/2012/05/make-your-own-framboise-recipe-raspberry-liqueur.html", "description": "Raspberry liqueur isn't hard to find, but the bottles you can buy are all over the map. Some options are candy sweet, while others are cough syrup-strong. Making your own liqueur gives you control over how sweet and boozy the end result is&mdash;you're likely to end up with something that better suits your sugar tolerance.", "totalTime": "4 days", "recipeYield": "makes about 3 cups", "recipeCategory": ["Cocktails", "Raspberry"], "recipeIngredient": ["12 ounces raspberries (about 2 1/2 cups)", "2 cups dry red wine", "1/2 cup brandy", "1 whole vanilla bean, split and scraped, seeds and pod reserved", "1 tablespoon zest from 1 lemon", "1 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the raspberries in a sealable glass jar and mash them with a spoon or muddler until just broken up enough to release juice. Add wine, seal, and shake the jar. Let steep for 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour brandy in pint-sized sealable glass jar along with the vanilla bean, split and scraped, and the lemon zest. Seal and shake the jar, then let steep for 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the raspberry-wine mixture through strainer lined with cheesecloth. Reserve the raspberries for another use, if desired. Set aside one cup of infused wine and pour remainder into small saucepan. Add sugar. Heat over medium heat until sugar is dissolved and mixture is syrupy, 5 to 7 minutes. Let syrup cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain brandy through fine mesh strainer lined with cheesecloth. Combine infused brandy with raspberry syrup in quart-sized sealable jar. Add reserved cup raspberry wine. Seal and shake, then let rest at room temperature for 2 days. Refrigerate and store for up to 1 month.</p>"}]}