{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111218-184325-tea-smoked-duck-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["duck", "grill", "grilling"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tea Smoked Rotisserie Duck", "link": "https://www.seriouseats.com/recipes/2012/01/tea-smoked-rotisserie-duck.html", "description": "I started with a duck sauce recipe, but I realize now that was really just fodder to get me to this incredibly flavorful and moist tea-smoked duck.", "totalTime": "3 1/2 - 9 1/2 hours", "recipeYield": "Serves 2-3", "recipeCategory": ["Duck", "Grilling", "Other Meats"], "recipeIngredient": ["<strong>For the Brine</strong>", "2 quarts ice-cold water ", "2 cups soy sauce ", "3 tablespoons salt ", "1/4 cup honey ", "6 clove garlic, smashed ", "1 1-inch piece of ginger, thinly sliced ", "1 medium orange, quartered ", " ", "1 whole duck ", "2 quarts boiling water ", " ", "<strong>For the Tea Packet</strong>", "1/4 cup tea leaves ", "1/4 cup brown sugar ", "1/4 cup rice ", "2 whole star anise pods ", "1 3-inch long cinnamon sticks ", "2 teaspoons orange zest "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the brine, place water, soy sauce, salt, honey, garlic, and ginger in a large bowl. Squeeze orange quarters into bowl, then drop in peel. Stir to combine. Place duck in brine, breast side down, and weight down with plate to keep fully submerged. Place in refrigerator and brine for at least 2 hours, up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove duck from brine; pat dry with paper towels. Using the point of a skewer or paring knife, prick holes all over duck breasts, being careful not to pierce the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place duck on a wire rack in the sink. Pour 1 quart of boiling water over duck. Flip and pour remaining quart of water over other side. Allow duck to dry while preparing the grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the tea packet, place tea leaves, brown sugar, rice, star anise, cinnamon sticks, and orange zest in a double layer of heavy-duty aluminum foil and fold into a packet. Cut slits at top of foil packet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on either side of the charcoal grate and place a foil pan between the two piles of coals. Cover gill and allow to preheat for 5 minutes. Place tea packet directly on top of the coals. Run spit of the rotisserie through middle of duck and secure ends with rotisserie forks. Place on the grill, cover, and cook at medium-high heat until duck registers 160 degrees when an instant read thermometer is inserted into the thickest part of the breast. Remove from grill, let rest for 15 minutes, then remove spit and serve.</p>"}]}