{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121105-228886-Tequila-Sunrise-Marmalade-with-Orange%20and-Pomegranates.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["Marmalade", "orange", "pomegranate", "Preserved", "Preserves", "tequila"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tequila Sunrise Marmalade with Orange and Pomegranate", "link": "https://www.seriouseats.com/recipes/2012/11/tequila-sunrise-marmalade-orange-pomegranate-recipe.html", "description": "I like sweet-tart jams, and this marmalade is one of the best I've tried. Tart orange accepts a sweet hug from bright-red pomegranate, and the whole thing is given a nice, boozy kiss from the addition of a touch of tequila.", "totalTime": "90 minutes", "recipeYield": "Six (8-ounce) jars of jam", "recipeCategory": ["Condiments and Sauces", "Orange", "Pomegranate", "Preserved"], "recipeIngredient": ["4 pounds navel oranges, scrubbed clean", "1 1/2 cup freshly squeezed or store-bought pomegranate juice, strained of seeds", "1 1/2 cups water", "1/4 cup high quality tequila", "4 cups sugar", "1/2 teaspoon butter", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small plate in the freezer so you can test the jam for proper thickness later. Make sure your jars and lids are sterilized and ready to go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a zester to remove the zest from the oranges. Add the zest to a large, deep, heavy-bottomed pot. Remove the remaining peels from the oranges. Wrap the peels in cheesecloth, secure with butcher's twine, and add to pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a sharp knife to cut the oranges in between the pith into clean segments, making sure to work over a bowl to catch any escaping juice. Squeeze remaining pith and discard. (See <a href=\"http://www.seriouseats.com/2010/06/knife-skills-how-to-cut-citrus-segments.html\">video instructions here</a>). Pulse the oranges in a food to chop the segments into coarse chunks that are about 1/2-inch across, 2 to 3 short pulses. Add the oranges to the pot with the zest and peels. Strain the juice you saved while segmenting the oranges and add it to the pot, along with the pomegranate juice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 1/2 cups of water to the pot and bring to a boil over medium heat. Once boiling, lower heat to low and simmer for 20 minutes. Remove from heat and allow to cool. Once cool, remove the bag of peels from the pot and gently squeeze the juice from the bag. Do not wring it completely, which will make the marmalade bitter&mdash;-just release any loose, excess juice absorbed by the peels and then discard the bag. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tequila, sugar, butter, and salt to the pot, stirring well to combine. Cook over medium heat, stirring frequently, until the fruit begins to bubble and spit. Cook for 30 minutes longer, stirring frequently to keep the fruit from burning. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin testing the marmalade for doneness: Spread 1/2 teaspoon of cooked fruit on the cold plate and place it back in the freezer. Wait 30 seconds, then run your finger through the fruit. It should be thick enough to maintain a path when you run your finger through it. If you’d like thicker marmalade, place the plate back in the freezer and cook the fruit for another 4 minutes and test again. Repeat until desired thickness is achieved, but be careful about cooking too long or you will alter the taste of your marmalade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pot from heat and use a spoon to skim any foam from the surface of the fruit. Ladle marmalade into sterilized jars and process them in a hot water bath for 10 minutes. Unopened jars will keep at room temperature for up to 6 months. Opened marmalade should be refrigerated.</p>"}]}