{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120127-188620-chocolate-oatmeal-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate dessert", "four and twenty blackbirds", "oatmeal", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Oatmeal Pie", "link": "https://www.seriouseats.com/recipes/2012/02/chocolate-oatmeal-pie-four-twenty-blackbirds-recipe.html", "description": "This recipe is my attempt to re-create the original version of this pie from the Brooklyn pie shop, Four and Twenty Blackbirds. It comes pretty darn close to replicating the original, which features a flaky all-butter crust, a layer of rich ganache, and a layer of gooey oatmeal that gets all caramelized and crisp on top.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Christmas", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "5 ounces dark chocolate", "5 ounces heavy cream", "Pinch of salt", "6 ounces Lyle's Golden Syrup (or dark corn syrup)", "2 ounces molassas", "3 ounces light brown sugar", "1 tablespoon vanilla extract", "1 egg", "2 yolks", "Pinch of nutmeg", "Pinch of salt", "9 ounces Old Fashioned oats (not quick-cooking)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the crust: Preheat the oven to 425&deg;F. Line the bottom of the chilled pie crust with foil or parchment paper and fill it with pie weights (I reuse dried beans for this purpose) and bake for 15 minutes on the bottom rack of the oven, rotating halfway through. Remove the weights and liner and bake for an additional 15 minutes, until the bottom of the pie begins to brown. Remove the shell from the oven and allow it to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the ganache: Finely chop the chocolate and place in a bowl with the salt. In a medium-sized saucepan, set over medium heat, bring the heavy cream just to a boil. Remove from the stove and immediately pour the cream over the chocolate. Allow the chocolate to sit for 2 minutes, then stir until the ganache is completely smooth. Pour the ganache into the bottom of the cooled pie shell and place in the fridge until the ganache has hardened, at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the oatmeal topping and bake: Preheat the oven to 350&deg;F. In a large bowl, whisk together the syrup, molasses, brown sugar, vanilla, salt, and nutmeg. In a separate bowl, whisk the egg and yolks, then add to the ingredients in the large bowl, and whisk to combine. Add the oatmeal stir well. Pour oatmeal mixture over the top of chilled ganache and spread it evenly. Bake until the top of the pie is a golden brown, 15-20 minutes. If the crust becomes too dark, place patches of foil around the edges to protect it from the heat. Allow the pie to cool completely before serving.</p>"}]}