{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/01282012-189850-sunday-supper-liver-onions-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["liver", "potatoes", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Calves Liver with Onions, Bacon and Potatoes", "link": "https://www.seriouseats.com/recipes/2012/01/calves-liver-with-onions-bacon-and-potatoes-recipe.html", "description": "Some people soak their liver in milk before cooking it.  It's my opinion that if you get good quality fresh liver, that process is simply a waste of milk.  Both the onions and the potatoes are cooked in leftover bacon fat and because of that, make sure you get very good quality bacon.  If you can't locate good quality bacon that you trust, cook the bacon separately and cook the onions and potatoes in a few tablespoons of butter.  Meals as simple as this are totally reliant on the quality of the ingredients that you use.   It's especially important when cooking offal that you make the extra effort to get the best ingredients you can find.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Beef", "Mains", "Offal", "Potato", "Sunday Supper"], "recipeIngredient": ["6-8 small potatoes", "8 strips bacon", "4 onions, thinly sliced", "2 sprigs thyme, leaves picked off", "Kosher salt and cracked black pepper", "1/2 cup all-purpose flour", "2 tablespoons butter", "2 pounds calves liver divided into 4 even pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a pot and cover with water. Bring to a boil and cook until potatoes are soft, about 15 minutes.  Drain and when cool enough to handle, slice into 3/4 inch thick slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 200°F and place a roasting pan or large baking sheet inside.  Cook bacon in a large skillet; once fat has rendered and bacon is crisp, remove and drain on paper towels and place in oven.  Pour off all but 1 tablespoon bacon fat and reserve the rest.  Return pan to medium heat, add onion and thyme, and cook until onions are soft and brown, about 10 minutes. Season to taste with salt and pepper; remove from pan and place in oven along with cooked bacon.  Return pan to medium-high heat; add 1 tablespoon of bacon fat back to the pan, then add half the sliced potatoes and cook until crisp. Repeat with remaining potatoes, adding additional bacon fat if needed. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat liver dry, then dredge in flour. Clean out skillet, then place back on medium heat and add butter.  Once foam has subsided, add liver and cook until exterior has formed a light crust, but inside is still soft, about 4 minutes per side (depending on thickness).  Divide potatoes, onion, bacon and liver evenly between four plates, and serve hot with an IPA.</p>"}]}