{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/032212-198321-grasshopper-parfait.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "grasshopper pie", "parfaits", "Thin Mints"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grasshopper Parfaits", "link": "https://www.seriouseats.com/recipes/2012/03/grasshopper-pie-thin-mint-parfait-recipe.html", "description": "Minty Grasshopper pie filling layered with whipped cream and a Thin Mint cookie crust.", "totalTime": "3 hours", "recipeYield": "serves 6", "recipeCategory": ["Desserts", "Puddings and Custards"], "recipeIngredient": ["20 Thin Mint Cookies", "1/2 cup cold water ", "1/2 cup sugar", "1/4 teaspoon salt", "2 envelopes plain gelatin (1 1/2 tablespoons)", "3 egg yolks", "1/4 cup green crème de menthe", "2 tablespoons crème de cacao", "1 teaspoon vanilla extract", "1 pint heavy cream", "2/3 cup egg whites (or pasteurized egg whites), at room temperature", "1/2 teaspoon cream of tarter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 14 Thin Mint Cookies (one sleeve's worth) to the food processor. Pulse until you have fine crumbs. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the top of a double boiler combine water, 1/4 cup sugar and salt. Stir until dissolved. Sprinkle mixture with gelatin and let soften for 1 to 2 minutes.  Whisk in the egg yolks one at a time until combined. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place double boiler over boiling water and heat mixture, whisking constantly, until gelatin is completely dissolved and the mixture begins to thicken slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and whisk in crème de menthe, crème de cacao and vanilla. Refrigerate mixture, stirring occasionally, until mixture becomes the consistency of unbeaten egg whites, about 20 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the gelatin mixture is chilling, whip heavy cream until stiff peaks form and set aside. Next beat the egg whites and cream of tarter until egg whites begin to stiffen slightly. Lightly sprinkle in remaining sugar, one tablespoon at a time. Continue beating egg whites until soft peaks form. Fold egg whites into the gelatin mixture, then fold in half of the whipped cream, reserving the rest to top the parfaits.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide half of the grasshopper filling among the six glasses, spooning it in carefully so as not to smudge the sides. Next spoon in the cookie crumbs, dividing them evenly among the glasses. Repeat with remaining grasshopper filling. Refrigerate to set, about two hours or overnight. Just before serving, top with remaining whipped cream (you may want to rewhip the cream slightly to incorporate more air). Garnish with a whole Thin Mint and serve immediately.</p>"}]}