{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120625-burger-lab-lamb-burger-22.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["burger", "cheeseburger", "lamb", "lamb burgers", "The Burger Lab", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Best Lamb Burgers", "link": "https://www.seriouseats.com/recipes/2012/06/the-best-lamb-burgers-recipe.html", "description": "Lamb burgers are like the <em>Super Mario Bros. 2</em> of the burger world. They're kind of strange and funky and it's not entirely clear how they fit into the canon of their brethren, but they're awesome in their own way, and a great change from the norm. I wouldn't eat a lamb burger every day, but when I do, I want it to be the best damned lamb burger it can be. After grinding and grilling my way through nearly 32 pounds of the stuff, there's a thing or two I learned about the process.", "totalTime": "1 hour", "recipeYield": "makes four 8-ounce burgers", "recipeCategory": ["Burger", "Lamb", "Mains", "The Burger Lab", "The Food Lab"], "recipeIngredient": ["2 pounds lamb shoulder (chuck), trimmed of connective tissue, cut into 1 to 2-inch cubes", "Kosher salt and freshly ground black pepper", "4 hearty burger buns", "Condiments as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>TO GRIND WITH A MEAT GRINDER:</strong> Place feed shaft, blade, and 1/4-inch die of meat grinder in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece and place in freezer for 10 minutes until meat is firm, but not frozen. Transfer meat to a large bowl and toss to combine. Grind meat and refrigerate immediately until ready for use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>TO GRIND WITH A FOOD PROCESSOR:</strong> Place bowl and blade of food processor in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece, and place in freezer for 10 minutes until meat is firm, but not frozen. Transfer meat to a large bowl and toss to combine. Working in two batches, place meat cubes in food processor and pulse until medium-fine grind is achieved, about 8 to 10 one-second pulses, scraping down processor bowl as necessary. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer meat mixture to a large tray and divide into four piles. Press each pile into a patty about 1/2 an inch wider on all sides than your burger buns, pressing gently until they hold together, but taking care not to overwork them. Form a slight dimple in the center of each patty. Season the top sides will with salt and pepper. Flip patties using a thin flexible spatula and season second side well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer burgers to hot side of grill and cook, flipping frequently (if burgers are threatening to break or fall apart, reduce the frequency of flipping, even down to a single flip if necessary) and transferring to cooler side if flare-ups occur, until they register 125°F on an instant read thermometer for medium-rare, or 135°F for medium. Transfer to a large plate. And let rest for 2 to 3 minutes. Meanwhile, toast buns over grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place burgers on buns, top as desired, and serve.</p>"}]}