{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120815-dt-thomas-kellers-chicken-breasts-with-tarragon.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "Thomas Keller"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Thomas Keller's Chicken Breasts with Tarragon", "link": "https://www.seriouseats.com/recipes/2012/08/thomas-kellers-chicken-breasts-with-tarragon.html", "description": "As tough as chicken breasts can be to cook&mdash;there's no fat or bone to help mitigate dryness&mdash;a pounded chicken \"paillard\" is as easy. It's a technique that becomes a no-brainer once you learn it, whenever sauteeing the old boneless, skinless standby. By pounding the breast into uniform thickness and watching carefully, you can turn out a surprisingly moist cutlet with plenty of caramelized surface area. Add a delicious pan sauce&mdash;this time, by one Thomas Keller&mdash;and it's a solid dinner, indeed.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Dinner Tonight"], "recipeIngredient": ["1 teaspoon sweet paprika", "1 teaspoon yellow curry powder", "4 large (about 8 ounces each) boneless, skinless chicken breasts", "Kosher salt", "Canola oil", "3 tablespoons unsalted butter", "1 tablespoon minced shallot", "1/4 cup dry white wine", "1 cup chicken stock", "1 tablespoon chopped fresh tarragon", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the paprika and curry powder. Sprinkle the mixture over both sides of the chicken breasts. If time permits, cover and refrigerate for a couple hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the chicken breasts between two large pieces of plastic wrap and gently pound them until they are uniformly of 1/4-inch thickness. Season both sides liberally with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat an over to 200F, and place a baking sheet with a cooling rack set over it in the center. In a large (14-inch) skillet, heat a film of canola oil over high heat until almost smoking. Lay two of the chicken breasts presentation (smooth) side down into the pan and cook until golden, 1-2 minutes. Flip the breasts and cook the other side until golden, being careful not to overcook the thin breasts. Transfer to the rack, add a little more oil to the pan if needed, and repeat with the other breasts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour out any remaining oil in the pan and add 1 tablespoon of butter. Add the shallot and cook until just soft, about 3 seconds, then add the wine and cook until reduced by half. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken stock, bring to a boil, and reduce until thickened to a sauce consistency. Stir in the chopped tarragon and remove from the heat. Add the remaining butter and swirl the pan until just melted into a glossy sauce. Pour in any accumulated juices on the baking sheet and swirl to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the chicken on a platter, pour the sauce over it, and serve immediately.</p>"}]}