{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120417-202135-asparagus-kerabu.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["asparagus", "coconut", "Cook the Book", "Eat With Your Hands", "fish sauce", "salad", "spring salads", "Zakary Pelaccio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zak Pelaccio's Asparagus Kerabu", "link": "https://www.seriouseats.com/recipes/2012/04/zakary-pelaccios-asparagus-kerabu-salad-recipe.html", "description": "Spring is here and with it come many stalks of wonderfully green asparagus, and while we love them simply steamed, drowned with hollandaise or topped off with a wobbly poached egg, we're thinking this <strong>Asparagus Kerabu</strong> from <a href=\"http://fattycrew.com/the-crew/zak-pelaccio/\">Zak Pelaccio</a>'s <em><strong><a href=\"http://www.amazon.com/Eat-Your-Hands-Zak-Pelaccio/dp/0061554200/?tag=serieats-20\">Eat with Your Hands</a></strong></em> might just be our asparagus go to for the season.", "totalTime": "45 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Asparagus", "Coconut", "Salads"], "recipeIngredient": ["28 green asparagus stalks, trimmed ", "Juice of 1 lime, or more to taste", "2 tablespoons fish sauce, or more to taste ", "½ cup roughly chopped fresh ", "Vietnamese mint (rau ram) leaves ", "1 cup bean sprouts ", "1 small red onion, very thinly sliced ", "2 fresh thai bird chilies, julienned ", "1 tablespoon julienned peeled young fresh ginger ", "1 cup Kerisik (recipe follows) ", "1 cup fresh cilantro leaves ", " ", "<strong>Kerisik</strong>", "1 cup shredded fresh coconut, from about 1 mature coconut (you might need  another to reach 1 cup), or store-bought unsweetened shredded coconut "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Kerisik:</strong>  If you’re shredding your own coconut, use an old cleaver, machete, hammer, or  other instrument of destruction to crack open the fruit. then use a paring knife  to cut and pry the white flesh away from the hard shell. Remove the thin brown skin left on the meat with a vegetable peeler or paring knife. Use the large holes of a box grater to grate the fresh coconut flesh. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the grated coconut in no more than a ½-inch-deep layer (work in <br />\r\nbatches if necessary) in a large pan over medium heat. toss the coconut every 30 seconds. once the coconut starts to color lightly, start tossing more often. When most flakes have turned a golden brown color, give the pan a few shakes over the heat, then a couple more tosses and a few shakes again, like some superstitious ritual that keeps the coconut-burning gods at bay while stealing a few more precious moments of cooking time. Pull the pan from the heat and toss it nervously just to prevent those burning gods from following you out of the fire.  Spread the toasted coconut on a platter or cookie sheet to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Asparagus Kerabu:</strong> Cut off the tops of the asparagus approximately ½ inch below the tip and set the tips aside. Using a mandoline or vegetable peeler, slice the asparagus stems  lengthwise into long, thin ribbons. toss them in a bowl with the lime juice and fish sauce and set the mixture aside for at least 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a dry cast-iron pan or griddle over high heat and char the asparagus tips on all sides, stirring, 2 to 3 minutes. then transfer them to a large mixing bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the tips have cooled, add the mint, bean sprouts, onion, chilies, and ginger and toss well. then add the asparagus stems with their liquid and the kerisik, toss well, and season to taste with more lime juice and fish sauce. transfer the salad to a bowl and sprinkle on the cilantro leaves.</p>"}]}