{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120904-221270-chicken-rice-a-roni-edit.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["chicken dinner", "chicken thighs", "pasta", "rice", "rice-a-roni"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Skillet Chicken with Homemade Rice-A-Roni and Green Beans", "link": "https://www.seriouseats.com/recipes/2012/09/skillet-chicken-with-homemade-rice-a-roni-and-green-beans-recipe.html", "description": "Skip the box, add chicken, and get ready for this spot on homemade recipe for that famous San Francisco treat.", "totalTime": "1 hour", "recipeYield": "serves 4 to 6", "recipeCategory": ["Chicken", "Chicken Dinners", "Mains", "Rice"], "recipeIngredient": ["<strong>For the Chicken Rice-a-Roni:</strong>", "8 pieces chicken thighs and/or drumsticks (about 2 pounds)", "2 1/2 tablespoons olive oil, divided", "2 1/2 ounces (about 1/3 of a box) uncooked thin spaghetti, broken into 1/2-inch pieces", "1 3/4 cups long grain rice", "1 large bay leaf", "4 cups low-sodium store-bought or homemade chicken broth", "1/8 teaspoon saffron threads", "1/4 teaspoon ground turmeric", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Green Beans:</strong>", "4 medium cloves garlic, minced (about 4 teaspoons)", "1 pound green beans, trimmed and halved crosswise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken dry with paper towels and season both sides with salt and pepper. Heat 1 tablespoon oil in 12-inch skillet over medium heat until shimmering. Working in batches, add half of the chicken skin side down. Cook until well browned, about 8 minutes per side. Transfer chicken to plate, leave oil in pan, and repeat with second batch of chicken.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off all but 1 teaspoon fat in pan. Add pasta pieces to pan and toast until dark golden brown, stirring frequently. Add rice, bay leaf, half tablespoon oil, and cook, stirring, for 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in chicken broth, saffron, turmeric, and 3/4 teaspoon salt. Bring to simmer, cover, reduce heat to low, and cook, without stirring, for 12 minutes. Adjust heat as necessary to keep mixture at low simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid and nestle chicken pieces into rice. Cover and continue to cook until rice is cooked through and chicken registers between 170&deg;F to 175&deg;F on instant read thermometer, about 10 to 15 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the chicken and rice is cooking, make the green beans. In 10-inch skillet, heat remaining tablespoon oil over medium heat until shimmering. Add garlic and cook until fragrant, about 30 seconds. Add green beans and 1/2 teaspoon salt, and cook until just tender, stirring frequently, about 5 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season rice-a-roni to taste with more salt and pepper and serve.</p>"}]}