{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120117-vegan-kimchi-6.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Korean", "keywords": ["kimchi", "Korean", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Homemade Vegan Kimchi", "link": "https://www.seriouseats.com/recipes/2012/01/homemade-vegan-kimchi-recipe.html", "description": "This kimchi will get more and more sour as it ages. It can be eaten immediately, but is optimal at around 3 weeks. For a more traditional kimchi, replace the miso paste with 1/4 cup fish sauce.", "totalTime": "3 weeks", "recipeYield": "makes about 1 1/2 quarts kimchi", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "Korean", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1 large head napa cabbage, cored and separated into individual leaves, about 1 pound total", "1 small daikon radish (about 4 ounces)", "8 scallions, greens roughly chopped, whites reserved separately", "Kosher salt", "8 cloves garlic", "One 2-inch knob ginger, peeled", "1/2 cup Korean chili powder (<em>kochukaru</em>)", "2 tablespoons white or red miso paste", "1 tablespoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cabbage leaves, daikon, and scallion greens in a large bowl and sprinkle with 2 tablespoons kosher salt. Toss to combine, cover, then let sit at room temperature until cabbage is wilted, at least 1 hour and up to 12. It should release about 1/4 to 1/2 cup liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine scallion whites, garlic, ginger, chili powder, miso paste, and sugar in the bowl of a food processor or blender. Process until rough paste is formed, about 30 seconds total, scraping down sides as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cabbage is wilted, add chili mixture and turn to coat. Add 1 cup water to mixture. Taste liquid and add more salt as necessary (it should have the saltiness of sea water). Pack kimchi into mason jars, pressing down firmly to pack tightly and using a chopstick to release any air bubbles trapped in the bottom of the jar. Cover the kimchi with its liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Seal the jars tightly and allow them to sit at cool room temperature for 24 hours, then transfer to the refrigerator. Allow to ferment at least 1 week before eating (see note). Kimchi will last for up to 1 month after opening. Alternatively, place directly in fridge after parking and taste daily starting after the first week until it's as sour as you like it. Consume within 1 month.</p>"}]}