{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120904-221263-peach-and-plum-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["peaches", "pie of the week", "pies", "plums", "summer desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peach and Plum Pie", "link": "https://www.seriouseats.com/recipes/2012/09/peach-and-plum-pie-recipe.html", "description": "As peaches recede at the end of the summer season and plums come on strong as we inch towards fall, this pie was designed to bridge the seasonal gap. The two flavors compliment each other perfectly, and make the most of the last of the peaches.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Fruit Desserts", "Peach", "Pies, Tarts, and Crumbles", "Plum"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "5 large black plums cut into 1/2-inch pieces", "3 peaches, blanched, with the skins removed and cut into 1/2-inch", "6 ounces granulated sugar", "4 tablespoons corn, tapioca, or potato starch ", "1 egg", "Pinch of salt", "Optional: turbinado sugar for sprinkling on top"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 425°F.  Place plums and peaches in large bowl. Whisk together sugar and starch in a small bowl to combine, then gently toss with the fruit until the pieces are evenly coated. Allow mixture to sit for five minutes, then add to chilled pie shell. Cover with top crust. Crimp sides, cut a few slits in the top, and chill the pie for 15 to 20 minutes. Whisk together egg and a pinch of salt. When ready to bake, remove pie from oven, brush with egg wash, and sprinkle with turbinado sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pie in oven and bake for 20 minutes at 425°F, turning halfway through. Reduce heat to 350°F and bake until filling bubbles all over inside and crust is golden brown, 20 to 30 minutes longer. Be prepared to line the bottom of the oven with tin foil to catch any juices that leak from the pie. Remove from oven and place pie on rack to cool completely before serving.</p>"}]}