{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121106TurkeyPieVegetables.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Dinner for Two", "pies", "pot pies", "savory pies", "thanksgiving", "Thanksgiving turkey alternatives", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Rustic Turkey and Vegetable Pie", "link": "https://www.seriouseats.com/recipes/2012/11/rustic-turkey-and-vegetable-pie-recipe.html", "description": "A hot and hearty pie full of dark meat turkey, aromatic vegetables, fresh thyme, mushrooms, and wine, topped with crispy, perfect pastry.  You'll never believe what a cinch it is to make.", "totalTime": "45 minutes", "recipeYield": "serves 2 to 4", "recipeCategory": ["Dinner for Two", "Mains", "Turkey"], "recipeIngredient": ["2 tablespoons olive oil", "1 large carrot, peeled and sliced  (about 1 cup)", "3 celery stalks, sliced (about 1 cup)", "1 medium yellow onion, sliced (about 1 cup)", "2 cloves garlic, finely sliced", "Kosher salt and freshly ground black pepper", "1 pound ground dark meat turkey", "8 to 9 ounces cremini mushrooms, sliced", "1 1/2 tablespoons all-purpose flour", "1/4 cup dry white wine", "2 cups low-sodium homemade or store-bought chicken broth", "2 teaspoon Worcestershire sauce", "The leaves from 4 stems of thyme", "1 sheet of frozen puff pastry, thawed but cold", "Milk for brushing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat the oven to 400°F. Heat 1 tablespoon olive oil in a large sauté pan over medium-high heat until shimmering. Add carrots, celery, onions, and garlic. Season with salt and pepper .Cook, stirring occasionally, until vegetables are softened but not browned, about 6 minutes total. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablespoon olive oil in now-empty skillet over medium high heat until shimmering. Add turkey, season with salt and pepper and cook, stirring occasionally, until the pan is dry and the turkey begins to brown, about 8 minutes. Add the raw mushrooms and return vegetables to the pan the cooked vegetables. Stir in the flour to coat everything in the pan.  Add the white wine, chicken stock, Worcestershire sauce, and thyme. Cook, stirring occasionally, until thickened, about 5 minutes. Transfer to a casserole dish that just fits it, about 1 1/2 quarts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the sides of the dish with milk, and drape the pastry tightly across, pressing gently into the milked sides (this will help the pastry stick).  Cut a slit for the steam to escape in the center of the pastry, and then brush all the pastry lightly with milk.  Place the pie on a rimmed baking dish to catch any spills, and bake until the pastry is puffed and golden, 20 to 25 minutes. Serve immediately.</p>"}]}