{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120329-dt-yotam-ottolenghis-skillet-baked-eggs-with-spinach-yogurt-and-spiced-butter.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["egg", "vegetarian", "Yotam Ottolenghi"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Yotam Ottolenghi's Skillet-Baked Eggs with Spinach, Yogurt, and Spiced Butter", "link": "https://www.seriouseats.com/recipes/2012/03/yotam-ottolenghis-skillet-baked-eggs-with-spinach-yogurt-and-spiced-butter-recipe.html", "description": "[Photograph: Blake Royer] Adapted from Bon Appetit. About the author: Blake Royer is a food writer, photographer, and filmmaker based in Chicago; he has been writing for Serious Eats since 2007. You can follow him on Twitter @blakeroyer....", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Eggs", "Vegetarian"], "recipeIngredient": ["2/3 cup plain Greek-style yogurt", "1 medium garlic clove, minced or pressed through a garlic press (about 1 teaspoon)", "Kosher salt", "2 tablespoons unsalted butter, divided", "2 tablespoons olive oil", "1 large leek, chopped (white and pale-green parts only, about 1 cup)", "4 scallions, chopped (white and pale-green parts only)", "1 pound fresh curly spinach", "1 teaspoon juice from 1 lemon", "4 large eggs", "1/4 teaspoon kirmizi biber (Turkish chili powder), or 1/4 teaspoon crushed red pepper flakes and a pinch of paprika", "1 teaspoon chopped fresh oregano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the yogurt, garlic, and a pinch of salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven to center rack and preheat oven to 300°F. In a 12-inch skillet, heat 1 tablespoon of butter over medium heat until the foam subsides.  Lower the heat to low, then add the leek and scallion and cook until completely soft and golden, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add as much spinach as will fit and lemon juice to the skillet, along with a pinch of salt. Increase the heat to medium-high and cook, stirring frequently and adding spinach a handful at a time as it wilts until all the spinach is just wilted, 4 to 5 minutes. Taste and season with salt or more lemon juice as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, remove the spinach to a second 10-inch oven-proof skillet, leaving any excess liquid behind.  Make 4 indentations in the spinach and crack the eggs into them, taking care to keep the yolks intact. Sprinkle each egg with a pinch of salt, then transfer to the oven and cook until the whites are just set, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt the last tablespoon of butter in a small skillet over medium-low heat. Add the chili powder and/or paprika and continue cooking until the butter just begins to brown. Add the oregano and cook for 30 seconds longer, then remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the baked eggs with the yogurt mixture, and top with the spiced butter.</p>"}]}