{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121214-232980-cook-the-book-turkish-lamb-chops-pomegranate-glaze.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Bruce Aidells", "carrot", "Cook the Book", "lamb blade chops", "pomegranate molasses", "The Great Meat Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bruce Aidells' Turkish Pomegranate-Glazed Lamb Shoulder Chops and Carrots", "link": "https://www.seriouseats.com/recipes/2012/12/bruce-aidells-turkish-pomegranate-glazed-lamb.html", "description": "At the same time sour and sticky-sweet, pomegranate molasses is a great secret ingredient to stash. It brightens many a rich dish, especially those made with fatty, gamy cuts like lamb blade chops. In <strong><a href=\"http://www.aidells.com/our-way/aidells-story\">Bruce Aidells'</a></strong> <em><a href=\"http://www.amazon.com/The-Great-Meat-Cookbook-Everything/dp/0547241410/?tag=serieats-20\">The Great Meat Cookbook</a></em>, pomegranate molasses is used as a base for a <strong>braised-and-glazed lamb blade chop</strong> recipe. The dish as a whole is inspired by Turkish cuisine, with a spicy floral rub for the lamb, and a bright finishing sprinkle of fresh herbs (basil and mint), pomegranate seeds, and pine nuts. Aidells' lamb chops would be welcome on any winter time table, but would make an equally dashing holiday meal (as long as you're feeding open-minded diners).", "totalTime": "2 1/2 hours to 24 hours", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Lamb", "Mains"], "recipeIngredient": ["6 lamb blade shoulder chops (about ½ pound each)", "&nbsp", "<strong>Turkish Spice Rub</strong>", "1 teaspoon Aleppo pepper, crushed red pepper flakes, or cayenne pepper", "1 teaspoon salt", "1 teaspoon ground cumin", "3/4 teaspoon freshly ground black pepper", "1/2 teaspoon ground cardamom", "1/4 teaspoon freshly grated nutmeg", "&nbsp", "2 tablespoons olive oil", "1 tablespoon butter", "2 tablespoons grated fresh ginger", "1/2 cup finely chopped shallots", "1 cup finely chopped onions", "1 cup homemade lamb stock or canned low-sodium chicken broth", "1 cup pomegranate molasses or syrup", "2 pounds medium carrots of various colors, peeled and halved lengthwise", "1/2 pound parsnips, peeled and halved lengthwise", "Salt and freshly ground black pepper", "&nbsp", "<strong>Garnish</strong>", "1/2 cup fresh pomegranate seeds ", "1/4 cup toasted pine nuts ", "2 tablespoons shredded fresh basil leaves ", "2 tablespoons shredded fresh mint leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each chop into 2 pieces by cutting between the flat side of the blade bone and the meat. Combine all the rub ingredients in a small bowl. Sprinkle the rub over the chops. Let sit for at least 30 minutes at room temperature, or wrap in plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil and butter in a large deep skillet or Dutch oven over medium-high heat. Add the chops (you may need to do this in batches) and brown for 2 to 3 minutes per side. Set the chops aside. Add the ginger, shallots, and onions to the pan, reduce the heat to medium, and cook until soft, about 5 minutes. Add the stock and bring to a boil, scraping up the browned bits from the bottom of the pan. Add the pomegranate molasses and the chops. Reduce the heat to a simmer, cover, and cook for 40 minutes, until the chops are tender. If not yet tender, continue cooking, checking every 15 minutes. Remove the chops and set aside. Degrease the liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the carrots and parsips to the pan, cover, and cook for 10 minutes, or until tender. Remove the carrots and parsnips and set aside. Bring the liquid to a boil and reduce until it thickens and becomes very syrupy, 5 to 10 minutes. Return the carrots and parsnips to the pan and reheat over very low heat, turning frequently. When the sauce forms a glaze, add the chops and turn them until they are reheated and coated in the glaze. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chops on a platter and arrange the vegetables over them. Spoon over any remaining glaze, scatter on the pomegranate seeds and pine nuts, sprinkle over the basil and mint, and serve.</p>"}]}