{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120903-221815-dinner-tonight-italian-sausage-roasted-grapes-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "grapes", "quick", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Italian Sausages with Roasted Grapes and Sheep's Milk Cheese", "link": "https://www.seriouseats.com/recipes/2012/09/grilled-italian-sausages-with-roasted-grapes-recipe.html", "description": "Unleashing my inner Hot Doug, I combined roasted grapes, Italian sausage, and a funky sheep's milk cheese into one bun.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Grapes", "Mains", "Pork", "Sandwiches"], "recipeIngredient": ["1 tablespoon unsalted butter", "3 cups seedless grapes", "4 fresh mild Italian sausages (hot Italian sausages aren't recommended) ", "4 rolls (larger than hot dog buns) ", "1 tablespoon canola oil ", "2 tablespoons red wine vinegar", "2 ounces sheep's milk cheese, crumbled (about 1/2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat to 450&deg;F. Melt the butter in an oven safe 12-inch stainless steel skillet set over medium-low heat. Add the grapes and toss until coated in the butter. Transfer the skillet to the oven. Cook, stirring every five minutes or so, until grapes have burst and there is a decent amount of liquid, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to a boil, then reduce heat to a bare simmer. Add the sausages and poach until a meat thermometer measures 140&deg;F, about 10 minutes. Remove sausages from the liquid and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When grapes are done, carefully remove the skillet and set it on a burner. Turn off the oven. Wrap the buns in aluminum foil and add to the oven, so that they can warm from the residual heat. Using a strainer, remove the grapes and set aside in a bowl, leaving as much of the liquid behind as possible. Add vinegar to the skillet. Stir with a wooden spoon and simmer over medium heat until the liquid reduces by half and becomes lightly syrupy, about 5 minutes. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush a grill pan with canola oil and heat over high heat until just starting to smoke. Add the sausages and cook until browned on both sides, one to two minutes per side. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the buns from the oven, discard the aluminum foil, and set each on a different plate. Top each bun with a grilled sausage, a few spoonfuls of the roasted grapes, a drizzle of the reduced grape glaze, and 1/2 ounce crumbled cheese. Serve immediately. </p>"}]}