{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/226617-20121024-british-bites-lamb-phall.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "Indian", "keywords": ["british", "british bites", "chilies", "Indian", "lamb", "lamb phall"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Lamb Phall", "link": "https://www.seriouseats.com/recipes/2012/10/lamb-phall-british-indian-curry-recipe.html", "description": "Those familiar with this Anglo-Indian curry dish will immediately associate it with heat.  Phall is widely touted as the hottest of the British curries, although its actual connection to India is limited at best.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["British Bites", "Indian", "Lamb", "Mains"], "recipeIngredient": ["2 tablespoons vegetables oil ", "2 pounds lamb stew meat ", "1 medium onion, finely chopped (about 1 cup)", "1-inch piece ginger finely grated ", "10 medium cloves garlic, finely chopped (about 3 tablespoons)", "1/2 teaspoon cumin ", "3 teaspoons curry powder ", "1 teaspoon garam masala ", "1/2 teaspoon turmeric ", "1 teaspoon cayenne ", "1 teaspoon red chili flakes ", "10 dried bird chilies ", "1 scotch bonnet (or other very hot chili), quartered with seeds removed ", "1 (28-ounce) can diced tomatoes ", "1 cup homemade or store-bought low-sodium chicken broth ", "Kosher salt and freshly ground black pepper", "Handful fresh cilantro leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a large Dutch oven over high heat until shimmering.  Add half of lamb and cook until well browned on all sides, about 8 minutes, reducing heat if oil starts to smoke heavily. Transfer to a large plate. Repeat with second batch of lamb.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium-high and add onion. Cook, scraping bits of lamb off the bottom of the pan, until onions are translucent, about 4 minutes. Add ginger and garlic and cook until fragrant, about 3 minutes. Add cumin, curry powder, garam masala, turmeric, and cayenne, and cook, stirring, until spices are very fragrant and start to take on a nutty aroma, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chili flakes, dried bird chilies, and scotch bonnet and stir to combine.  Return lamb to pot and stir until lamb is coated with spice mixture.  Pour diced tomatoes and chicken stock over lamb and bring to a simmer.  Reduce heat to low and simmer until lamb is fully cooked and tender, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When lamb is tender and sauce is reduced, season to taste with salt and pepper. Serve with cilantro and steamed rice.</p>"}]}