{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121030MushroomBolognese.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Italian", "keywords": ["Dinner for Two", "Italian", "mozzarella", "mushrooms", "pasta", "ragu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Rigatoni with Mushroom Ragu, Fresh Mozzarella, and Truffle", "link": "https://www.seriouseats.com/recipes/2012/11/rigatoni-with-mushroom-ragu-fresh-mozzarella-truffle-recipe.html", "description": "This perfect easy mix of fresh and store-bought combines a chunky vegetarian double-mushroom \"bolognese\" with rigatoni, torn fresh mozzarella, and truffle oil.", "totalTime": "30 minutes", "recipeYield": "serves 2 to 4", "recipeCategory": ["Dinner for Two", "Italian", "Mains", "Mushrooms", "Pasta", "Vegetarian"], "recipeIngredient": ["1 ounce dried porcini mushrooms", "1/2 pound Portobello mushrooms, roughly chopped", "2 1/2 tablespoons olive oil, divided", "Kosher salt and freshly ground black pepper", "1 medium carrot, roughly chopped (about 1 cup)", "1 small yellow onion, roughly chopped (about 1 cup)", "3 medium cloves garlic, smashed", "2 cups tomato basil sauce", "1 pound dry rigatoni", "5 ounce ball of fresh mozzarella", "Truffle oil for drizzling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Place dried porcini in a 1-cup liquid measuring cup and add 1 cup of hot water. Set aside to rehydrate. Place portobello in bowl of food processor and pulse until no pieces larger than 1/2 inch remain, about 8 to 10 short pulses. Drain porcini, reserving the mushrooms and the soaking liquid separately. Roughly chop the rehydrated porcini.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 1/2 tablespoons olive in a large nonstick skillet over high heat until shimmering. Add portobellos and porcini and cook, stirring frequently, until all of their liquid has evaporated and they start to sizzle, about  8 minutes. Season to taste with salt and pepper, then transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place carrot, onion, and garlic in bowl of food processor and pulse until no pieces larger than 1/2 inch remain, about 8 to 10 short pulses. Wipe out now-empty skillet and heat remaining tablespoon oil over medium heat until shimmering. Add carrot/onion mixture, season with salt and pepper, and cook, stirring often, until completely soft, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the mushrooms to the skillet and add the tomato sauce along with the porcini soaking liquid. Bring to a boil, reduce to a simmer, cover, and cook for 15 minutes, making sure that the sauce doesn't completely dry out (Add water as necessary while simmering). Meanwhile, cook the pasta according to package directions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta, reserving 1 cup of pasta water.  Add the pasta to the sauce, and toss to coat, adding reserved pasta water as necessary to adjust consistency. Season to taste with salt and pepper. Serve immediately, topping each portion with torn mozzarella and a drizzle of truffle oil</p>"}]}