{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121106-226668-salted-chocolate-pecan-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "pecan", "pecan pie", "pie", "pie of the week", "thanksgiving alternative pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "6"}, "name": "Salted Chocolate Pecan Pie", "link": "https://www.seriouseats.com/recipes/2012/11/salted-chocolate-pecan-pie-recipe.html", "description": "This pie ups the ante in the pecan pie game. It's full of a rich caramel custard and chock-full of pecans, with a healthy dose of chocolate to send it over the edge. With just a tiny hit of salt to balance out the sweet richness of the filling, this pie will be the one they talk about long after Thanksgiving.", "totalTime": "4 hours, not including time prep time for crust dough", "recipeYield": "serves 8", "recipeCategory": ["Chocolate", "Nuts", "Pies, Tarts, and Crumbles", "Thanksgiving"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "4 eggs, lightly beaten", "14 ounces (about 1 2/3 cups) light corn syrup", "3 1/2 ounces (about 1/3 cup) dark brown sugar", "1/2 teaspoon salt", "2 teaspoons vanilla", "8 ounces pecan pieces (or whole pecans, roughly chopped, about 2 cups)", "4 ounces semisweet chocolate, roughly chopped into 1/4 inch pieces, (about 1 cup) divided", "Sprinkle of Maldon sea salt crystals or other coarse salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake for 15 minutes. Remove weights and liner, rotate pie, and bake until the bottom crust is a golden brown (or slightly lighter, if you prefer that style), about 10 minutes. Remove pie shell from oven and allow to cool completely. Meanwhile, adjust the over rack to the lowest position and reduce heat to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium sized bowl, gently whisk the eggs enough to beat them up without making them frothy. Add the corn syrup and whisk immediately to combine. Add the sugar, salt, and vanilla to whisk to combine. Using a rubber spatula, stir in the pecans and half the chocolate. Pour the mixture into the cooled pie shell and sprinkle the remaining chocolate over the top. Bake until the filling puffs from the edges to the center, about 45 minutes (don't worry, it will deflate when cooling). Cool completely on a wire rack before serving. This pie can be made up to two days in advance and held in the fridge, but is really best when baked the day you'll serve it. Sprinkle with sea salt before serving.</p>"}]}