{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120718-215002-raspberry-ice-cream-cake-full-cake.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["cakes", "ice cream", "ice cream cakes", "ice cream desserts", "ice cream month"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Raspberry Ice Cream Cake With Chocolate Crumb Crust", "link": "https://www.seriouseats.com/recipes/2012/07/raspberry-ice-cream-cake-recipe.html", "description": "This ice cream cake marries an easy raspberry ice cream with lots of home made cookie crunchies. It's ice cream cake as you've always wanted it to be.", "totalTime": "4 1/2 hours plus overnight chilling", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>For the Ice Cream</strong>:", "6 egg yolks", "1/2 cup sugar", "2 cups heavy cream", "1 cup whole milk", "1/4 teaspoon of salt", "2 cups frozen raspberries, defrosted", "2 teaspoons vanilla extract", " ", "<strong>For the Chocolate Cookie Crunchies</strong>:", "1 1/2 cups (about 7.5 ounces) all-purpose flour", "3/4 cup best quality unsweetened cocoa powder", "1/4 teaspoon salt", "1/4 teaspoon baking soda", "14 tablespoons (1 3/4 sticks) unsalted butter, slightly softened, plus 3 tablespoons, melted", "3/4 cup (about 5 ounces) sugar", "3 tablespoons whole milk", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl lightly beat egg yolks with a 1/4 cup of sugar and set aside. In a medium saucepan add cream, milk, salt, and remaining sugar. Heat mixture over medium low heat, whisking occasionally, until bubbles begin to form along the edges of the pan. Remove from heat and add heated cream mixture to eggs one tablespoon at a time while whisking constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cream mixture and eggs have been combined return to the saucepan and heat on medium low until mixture coats back of a spoon or spatula and line drawn with a finger leaves a distinct trail. Mixture should register 170° to 175° F on an instant read thermometer. Do not allow mixture to overheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour custard into a medium bowl and whisk in raspberries and vanilla extract. Set bowl over an ice bath. Let cool at room temperature for 1 hour, stirring occasionally, then cover and refrigerate for 2 more hours or until completely chilled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the custard is chilling, prepare your cookies. In a medium bowl whisk together, flour, cocoa powder, salt and baking soda. Set aside. In the bowl of a stand mixer fitted with a paddle attachment, add 14 tablespoons softened butter and sugar and beat on medium high speed until light and creamy about 3 minutes. Add flour mixture and beat on medium speed until just combined, then add milk and vanilla and beat until dough comes together.  Remove dough from bowl and shape into two logs that are approximately 1 1/2  inches in diameter. Wrap dough logs with plastic wrap or waxed paper and chill in the refrigerator for at least an hour or place in freezer for about 30 minutes or until logs are firm enough to slice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350° F. Slice thin wafers (about 1/8 inch thick) from the cookie log and place at least 1 ½ inches apart on a parchment lined baking sheet. Bake cookies for 5 minutes, rotate pan and continue baking until edges of cookies are slightly crisp, about 5 to 8 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow cookies to cool for 2 minutes on the pan then transfer to a wire rack to cool completely. Once cookies are completely cooled place in a large zipper lock bag and coarsely crush them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl combine 2 cups of cookie crumbs with remaining melted butter until crumbs are thoroughly moistened. Press crumb mixture into the bottom of a springform pan. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Churn chilled custard according to your ice cream maker's instructions. Transfer half of the ice cream to the prepared springform pan, spreading it with a spatula to completely cover the crumbs. Cover ice cream evenly with half of the remaining crumbs then repeat, covering  those crumbs with remaining ice cream and topping off the cake with crumbs. Cover pan with plastic wrap and freeze overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Release sides of pan to serve cake and allow cake to thaw for several minutes before cutting and plating. </p>"}]}