{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120130-189906-connanaimface.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bar cookies", "Cakespy", "candies", "conversation hearts", "nanaimo bars", "Valentine's Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Conversation Heart Nanaimo Bars", "link": "https://www.seriouseats.com/recipes/2012/01/conversation-heart-nanaimo-bars-valentines-day-recipe.html", "description": "This seasonal variation on the <a href=\"http://www.seriouseats.com/recipes/2009/10/cakespy-nanaimo-bars-recipe.html\">classic Canadian treat</a> is easy to execute, and the cute upgrade is pretty immense, with a Neapolitan-hued (if not flavored) treats that are as adorable to behold as they are rich, decadent, and satisfying to eat. But don't forget to keep a toothbrush nearby, because these treats are <em>extremely</em> sugary.", "totalTime": "3 hours (includes cooling time)", "recipeYield": "makes 36 small bars", "recipeCategory": ["Cakespy", "Candy", "Cookies"], "recipeIngredient": ["<strong>For the bottom layer:</strong>", "1/2 cup (1 stick) butter", "1/4 cup sugar", "5 tablespoons cocoa powder", "1 large egg, beaten", "1 cup shredded sweetened coconut", "1 1/2 cups finely crumbled graham crackers", "1/2 cup finely chopped nuts (walnuts, almonds, or pecans)", " ", "<strong>For the middle layer:</strong>", "1/2 cup (1 stick) butter, softened", "2 tablespoons heavy cream", "2 tablespoons Custard powder (Birds brand suggested; stovetop vanilla pudding powder will also work)", "2 cups confectioners' sugar, sifted", "several drops red food coloring (optional)", " ", "<strong>For the top layer:</strong>", "4 ounces white chocolate, coarsely chopped", "1/2 cup Conversation Hearts candies"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare bottom layer. Melt the butter, sugar, and cocoa in a double boiler until fully incorporated, but do not let the mixture come to a boil. Add the beaten egg and stir constantly until the mixture begins to thicken. Remove from heat and stir in the graham cracker crumbs, coconut, and nuts. Press down firmly into an ungreased 8 x 8-inch pan; try to make the mixture as flat as possible in the pan. Let this cool for about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the middle layer: in a stand mixer fitted with the paddle attachment, cream the butter, cream, custard powder, and confectioners' sugar together until very light and fluffy. If desired, stir in several drops of red food coloring and mix until the filling has reached a pretty pink hue. Spread over the bottom layer, taking care to spread it as flat and evenly as possible. Return the pan to the refrigerator while you prepare the topping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the top layer: in a medium saucepan or double boiler, melt the white chocolate over low-medium heat, stirring often to ensure that the mixture doesn't scorch. Remove from heat. Let sit until the mixture is still liquid but very thick, then pour it over the second (middle) layer and gently spread it with a spatula to ensure even coverage (but work carefully, because the still-warm chocolate will get messy if you press too hard while spreading it and tear up the buttery layer below). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently place the conversation hearts on top of the white chocolate layer directly after spreading (this will ensure that they adhere to the layer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the bars cool for at least one hour in the refrigerator before serving.</p>"}]}