{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121107-cookiemonster-carrothalwa.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["carrot", "cookie monster", "indian desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Indian-Style Spiced Carrot Bars (Gajar Ka Halwa)", "link": "https://www.seriouseats.com/recipes/2012/11/carrot-halwa-gajar-ka-halwa-recipe.html", "description": "This Indian sweet is made by cooking down grated carrots with milk, then slowly stir-frying them in oil. It's usually eaten garnished with chopped almonds, and raisins and clotted cream are also a nice accompaniment.", "totalTime": "1 hour 10 minutes", "recipeYield": "serves 6-8", "recipeCategory": ["Cookies", "Diwali"], "recipeIngredient": ["1 tablespoon plus 1 1/4 cups vegetable oil, divided", "1/4 cup almonds (optional)", "4 pounds carrots, peeled then grated through the largest holes of a box grater", "8 cups whole milk", "4 green cardamom pods", "6 tablespoons sugar", "Sliced almonds, clotted cream, fried raisins, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using almonds (not just for garnish), heat 1 tablespoon vegetable oil over medium heat until shimmering. Add 1/4 cup almonds and cook, stirring and tossing frequently, until lightly golden brown, about 3 minutes. Transfer to a paper towel-lined plate to drain. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine grated carrots, milk, and cardamom pods in a large, heavy bottomed pot. Bring to a boil, then reduce heat to a simmer and cook, stirring occasionally, until all milk has evaporated, about 40 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When liquid has evaporated, add oil. Fry carrot mixture in oil, stirring constantly, until darkened to dark orange/brown in color, about 30 minutes. Add sugar and fried almonds if using. Cook, stirring, for 2 minutes. Take off heat and let come to room temperature. Spread in a 8 x 8 -inch square pan or other pan of your choice, and cut into squares. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If not eating right away, store, covered, in refrigerator and bring back to room temperature before serving. </p>"}]}