{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120614-lamb-with-cumin-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cumin", "grill", "grilling", "lamb", "quick", "stir fry", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Mongolian Stir-Fried Lamb with Cumin", "link": "https://www.seriouseats.com/recipes/2012/06/mongolian-sichuan-style-lamb-with-cumin-chilis-and-cilantro-recipe.html", "description": "Dry-style stir-fried lamb is a Northern Chinese dish originating in Mongolia. It's primary flavor comes from cumin, soy sauce, and Sichuan peppercorns. It's musky, hot, and well, awesome. That it doesn't have a sauce makes it once of the quickest, easiest stir-fries to prepare at home. It works equally well with beef.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Lamb", "Mains", "Stir Frying", "The Food Lab"], "recipeIngredient": ["3 tablespoons whole cumin seeds", "2 teaspoons whole sichuan peppercorn ", "12 dried Chinese red chilis", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 1/2 pounds lamb leg (or beef, see note), trimmed of gristle, sliced into 1/4-inch thick pieces, approximately 1-inch by 2-inches", "1 tablespoon soy sauce", "1/4 cup vegetable oil", "1 medium onion, cut pole to pole into 1/2-inch slices", "3 stalks celery, ends and tops trimmed, sliced lengthwise into thirds and crosswise into 2-inch segments", "Kosher salt", "1 bunch cliantro, leaves and tender stems only"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat cumin seed, peppercorns, and chilis in a large skillet over medium-high heat, tossing constantly until fragrant, about 2 minutes. Transfer to a bowl and transfer chilis into separate small bowl. Transfer cumin and sichuan peppercorns into a mortar and pestle or spice grinder and grind until roughly crushed but large pieces still remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cumin and peppercorns into a medium bowl and add garlic. Mix with fingers. Add lamb and soy sauce and mix with hands until thoroughly coated. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Grill With a Wok Insert</strong>: <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals in a pile on center of cooking grate. Place  <a href=\"http://www.amazon.com/gp/product/B0044EQM9Q/?tag=serieats-20\">Weber 8835 Gourmet BBQ System Hinged Cooking Grate</a> on grill and set wok in center. Add oil and heat until smoking. Add lamb and cook, stirring and tossing constantly until lightly charred on edges, about 1 minute. Push lamb up sides of wok and add onions and celery. Cook, stirring and tossing constantly until celery and onions are tender and charred and lamb has developed a mild crust, about 2 minutes longer. Add chilis and cook, tossing constantly, for thirty seconds. Season to taste with salt. Transfer to a plate and top with cilantro. Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook On A Burner</strong>: When ready to cook, heat 1 tablespoon oil in a wok over high heat until smoking. Add onion and celery and cook, stirring and tossing occasionally until lightly charred and tender, about 2 minutes. Transfer to a bowl. Heat 2 more tablespoon oil until smoking. Add half of lamb and cook without moving for 1 minute. Continue cooking while stirring and tossing until lightly cooked but still pink in spots, about 1 minute. Transfer to a large bowl. Repeat with 1 more tablespoon of oil and remaining lamb, adding cooked lamb to same bowl. Return wok to high heat until smoking. Return vegetables and lamb to wok and cook, stirring and tossing occasionally until lamb develops a mild crust, about 2 minutes longer. Add chilis and cook, tossing constantly, for thirty seconds. Season to taste with salt. Transfer to a plate and top with cilantro. Serve immediately.</p>"}]}