{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120227-194264-samoasrec.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cookie crust", "cream pies", "Girl Scout Cookies", "pies", "Samoas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Pudding Pie in a Samoas Cookie Crust", "link": "https://www.seriouseats.com/recipes/2012/02/chocolate-pudding-pie-in-a-samoas-cookie-crust-recipe.html", "description": "To truly maximize how many Samoas you can stuff into your mouth in one serving, you've simply got to crush them up and form them into a cookie pie crust. Using the same method as making a graham cracker crust, the Samoas cookie crust is the definition of decadence: sticky, crispy, and caramelly, it gets even crazier when you fill it with a rich, creamy chocolate pudding filling studded with extra coconut, and top it off with a billowy cloud of whipped cream.", "totalTime": "3 hours, 20 minutes", "recipeYield": "serves 16", "recipeCategory": ["Cakespy", "Pies, Tarts, and Crumbles", "Puddings and Custards"], "recipeIngredient": ["<strong>For the crust: </strong>", "2 boxes Samoas cookies", "6 tablespoons butter, melted", " ", "<strong>For the filling: </strong> ", "1 box (3.9 ounce) instant chocolate pudding", "2 cups cold milk", "1/2 cup toasted coconut (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cookies from their packaging. Reserve 4-6 of them to garnish the top of your pie later. Crush the rest into fairly fine crumbs (this WILL be messy and sticky because of the caramel).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the cookie crumbs and melted butter until well blended . Press mixture into a 9-inch greased pie plate (you need more butter or shortening to grease it because the caramel from the cookies will make them stick to the pan!). You might want to flour or wet your hands first, because this business gets sticky. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 375&deg;F for 5-7 minutes. Cool for at least an hour, or until the shell is at room temperature. You can put it in the fridge to chill more rapidly, too.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the pudding with the cold milk according to the package instructions (you can also use half and half for an even more decadent end result). When combined, fold in the toasted coconut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spatula, spread the filling into the pie crust. This amount should easily fill the pie shell; if you have any extra, use it as a cake filling or to make a couple of pudding cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the filling set in the refrigerator for at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, top with whipped cream directly before serving. Garnish with the remaining Samoas cookies.</p>"}]}