{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120213Knead-the-book-italian-baker-grissini.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "Italian", "keywords": ["bread", "bread baking", "breadsticks", "Italian", "The Italian Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Italian Baker's Grissini Torinesi", "link": "https://www.seriouseats.com/recipes/2012/02/the-italian-bakers-grissini-torinesi.html", "description": "Grissini Torinesi, or breadsticks from Turin, are not thin, delicate breadsticks. These are country-style thick and possibly knobby sticks, perfect for the new baker who hasn't mastered perfect shaping skills. And even if your skills are good, these sticks from <em><a href=\"http://www.amazon.com/dp/1607741067/?tag=serieats-20\">The Italian Baker</a></em> stretch when you lift them, making it nearly impossible to shape them perfectly, which is just fine.", "totalTime": "2 hours", "recipeYield": "Makes 20 to 22 breadsticks", "recipeCategory": ["Bread", "Bread Baking", "Italian"], "recipeIngredient": ["1 3/4 teaspoons (0.2 oz / 5 g) active dry yeast", "1 tablespoon (0.7 oz / 21 g) malt syrup", "1 1/4 cups (10.5 oz / 300 g) warm water (or 1/4 cup / \u20282 oz / 60 g warm water plus 1 cup / 8.4 oz / \u2028240 g cold water if using a processor)", "2 tablespoons (1 oz / 30 g) olive oil, plus more \u2028for brushing", "3 3/4 cups (17.5 oz / 500 g) unbleached all-purpose flour", "11/2 teaspoons (0.3 oz / 7.5 g) salt", "1/2 cup (3 oz / 85 g) semolina flour "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By Hand<br />\nStir the yeast and malt into the warm water in a large mixing bowl; let stand until foamy, about 10 minutes. Stir in the oil. Add the flour and salt and stir until the dough comes together. Knead on a lightly floured surface until smooth, soft, velvety, and elastic, 8 to 10 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By Mixer<br />\nStir the yeast and malt into the water in a mixer bowl; let stand until foamy, about \u202810 minutes. Mix in the oil with the paddle. Add the flour and salt and mix until the dough comes together. Change to the dough hook and knead at low speed about 3 minutes. Finish kneading briefly by hand on a lightly floured surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Food Processor:</strong> Stir the yeast and malt into the 1/4 cup of warm water in a small bowl; let stand until foamy, about 10 minutes. Place the flour and salt in a standard food processor fitted with the dough blade or a large (over 7-cup capacity) processor fitted with the steel blade and process with several pulses to sift. Mix the 1 cup of cold water and the oil. With the machine running, pour the water mixed with oil and the dissolved yeast through the feed tube and process until the dough comes together. Process 45 seconds longer to knead. Finish kneading by hand on a lightly floured surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First Rise:</strong> Pat the dough with your hand into a 14 by 4-inch rectangle on a well-floured surface. Lightly brush the top with oil. Cover with plastic wrap and let rise until doubled, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shaping:</strong> Sprinkle the dough with semolina flour before cutting and stretching. The baker’s method of shaping breadsticks is ingenious, simple, and quick, for he certainly doesn’t have time to roll out individual grissini. Cut the dough crosswise into four equal sections and then cut each section crosswise again into five strips, each about the width of a fat finger. The dough is so elastic that you can simply pick up each piece, hold each end with your fingers, and pull and stretch to fit the width (or length) of a baking sheet. Place the breadsticks several inches apart on lightly oiled baking sheets (I find it easier to use the backs of the baking sheets, unless you have rimless sheets). There is no need to let them rise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Preheat the oven to 450ºF. If you are using a baking stone, turn the oven on 30 minutes before baking. Bake the breadsticks for 20 minutes. If you like crunchy breadsticks, bake directly on the baking stone, which has been sprinkled with cornmeal or coarse semolina, for the last 5 minutes. Cool on racks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variations:</strong> For grissini siciliani, sprinkle the dough with 1/2 cup (2 oz / 60 g) of sesame seeds instead of semolina flour before cutting and shaping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For grissini al papavera, sprinkle the dough with 1/2 cup (1 oz / 28 g) of poppy seeds instead of semolina flour before cutting and shaping.</p>"}]}