{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120729LambBrochette3.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French in a Flash", "lamb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tender Lamb Brochettes with Thyme and Haricots Verts", "link": "https://www.seriouseats.com/recipes/2012/08/tender-lamb-brochettes-with-thyme-and-haricot-verts-recipe.html", "description": "Tender and crisp seared lamb skewers in thyme jus with light and crisp haricots verts makes for the perfect plat du jour.", "totalTime": "10 minutes", "recipeYield": "serves 2 to 3", "recipeCategory": ["French", "Lamb", "Mains"], "recipeIngredient": ["1 pound of lamb loin, cut into 1-inch discs", "Kosher salt and freshly ground black pepper", "1 tablespoon olive oil", "1 cup low sodium homemade or store-bought beef broth", "2 tablespoons fresh thyme leaves", "4 teaspoons cold unsalted butter", "11 ounces of haricots verts, trimmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a stockpot of water to a boil. Skewer the lamb onto the bamboo skewers, leaving a little space between each piece of lamb, and season with salt and pepper. Heat olive oil in a large skillet over high heat until shimmering. Add lamb and cook, turning occasionally, until center of largest pieces register 125 to 130°F on an instant read thermometer and lamb is well browned on all sides, about 3 minutes total. Transfer to a large plate and tent with aluminum foil. Let rest for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add beef stock and thyme to hot skillet, using a wooden spoon to scrape browned bits off bottom of pan. Allow to come to a boil, then remove from heat and whisk in 1 tablespoon of cold butter. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add beans to boiling water and cook until tender but still bright green, about 3 minutes. Drain. Return to the pot with the remaining teaspoon of butter, and stir to coat. Serve with the lamb and thyme sauce.</p>"}]}