{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120405-200496-son-in-law-eggs-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "", "keywords": ["egg", "fish sauce", "hard boiled eggs", "palm sugar", "tamarind"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Son-in-Law Eggs: Thai Fried Hard-Boiled Eggs in Tamarind Sauce", "link": "https://www.seriouseats.com/recipes/2012/04/thai-son-in-law-eggs-fried-hard-boiled-eggs-in-tamarind-sauce.html", "description": "[Photograph: Leela Punyaratabandhu] Sour, sweet, and salty, this dish represents what people love about Thai cuisine. It may look complicated to make but it's quite easy. If you have hard-boiled eggs on hand, these son-in-law eggs will be ready in...", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Eggs", "Sides"], "recipeIngredient": ["3 large shallots, peeled and sliced thinly lengthwise", "1/4 cup vegetable oil, plus more for deep frying", "8 large eggs, hard-boiled and peeled", "½ cup of very finely-chopped palm sugar, packed or ¼ cup brown sugar", "¼ cup Thai fish sauce", "2 tablespoons <a href=\"http://www.shesimmers.com/2010/05/how-to-prepare-tamarind-pulp-for-thai.html\">prepared tamarind pulp</a>", "3 tablespoons water", "2 red jalapeño peppers or half a red bell pepper, deseeded and cut into slivers, for garnish", "Fresh cilantro leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sliced shallots and 1/4 cup of vegetable oil to a small skillet set on low heat (it is imperative that you add the shallots to cold oil lest they burn before crisping up). Stirring constantly, cook the shallots until they are golden brown and crispy. With a slotted spoon, transfer the fried shallots to a paper towel-lined plate; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough oil to a medium saucepan so that it comes up to about 2 inches high. Place the pot on medium-high heat. Once the oil is hot, gently drop the hard-boiled eggs into it. Stir the eggs around to ensure even browning. Once the egg exteriors are thoroughly browned, fish them out with a slotted spoon, slice them in half with a serrated knife, and arrange the halved eggs on a serving platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard the oil in the same skillet in which you’ve fried the shallots and set the skillet on medium heat. Add the brown sugar, fish sauce, tamarind, and water to it; bring the mixture to a gentle boil, stirring constantly. Once the sugar has fully dissolved, check for consistency. The sauce should have the consistency of maple syrup. If at this point the sauce is still too thin, reduce it down a bit more. If it is too thick, add a little more water to thin it out. Once you have the desired consistency, remove the skillet from heat and pour the sauce over the prepared eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the fried shallots over the top of the eggs. Garnish with red pepper slivers and cilantro leaves. Serve son-in-law eggs with steamed jasmine rice.</p>"}]}