{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120817-knead-book-art-of-baking-bread-recipe.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["breads", "knead the book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Straight Bread Dough", "link": "https://www.seriouseats.com/recipes/2012/08/straight-bread-dough-recipe.html", "description": "This is a good, solid, basic recipe, and a perfect one to use to practice all of the techniques in <em><a href=\"http://www.amazon.com/The-Art-Baking-Bread-Really/dp/1616085371/?tag=serieats-20\">The Art of Baking Bread</a></em>.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Bread Baking", "Yeast Bread"], "recipeIngredient": ["For White Dough", "567 grams bread flour", "5 grams yeast", "385 grams water", "14 grams salt", "For Whole Wheat Dough", "340 grams bread flour", "227 grams whole wheat flour", "5 grams yeast", "397 grams water", "14 grams salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Select which recipe from above that you are going to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the ingredients according to the instruction in the “Mixing” portion of section 2.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Knead according to the instruction contained in the “Kneading” portion of section 2 (See the post on Monday). Because this dough has a relatively low hydration, I recommend using the convention kneading technique, although you may need to use the French method a few times just to get the dough into a more workable consistency. Knead until the gluten has fully developed and the dough can pass the window test. Note: The whole wheat dough recipe will never pass the window test because the hulls in the flour cut the gluten strands, just make sure that the dough is nice and elastic before moving on to the next step. This may take from 10 to 15 minutes of kneading depending on how fast and deliberate you are. (One side effect of kneading is that you get a workout in, too!)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bulk ferment the dough according to the instructions in “Bulk Fermentation” portion of section 2. Bulk ferment for 30-45 minutes, or until the dough has just about doubled; fold the dough using one of the two techniques described in the “Bulk Fermentation” section (See the post on Tuesday), then ferment for an additional 30 minutes. Fold again and ferment for another 15 minutes. Note: For the whole wheat dough, use the second folding technique. It will work much better due to the stiffer nature of the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Following the instruction set forth in the “Preshaping” portion of section 2 (See the post on Wednesday), shape the dough into an oblong (if you’d like the final shape to be a batard) or a round (if you’d like the final shape to be a boule). Remember, you can always make smaller loaves or rolls as well. Just divide the dough accordingly (i.e. in half for one-pound loaves and into 60 gram pieces for rolls).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After preshaping, let the dough rest for 15-20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the instructions outlined in the “Final Shaping” portion of section 2, form your dough into its final shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Proof the dough according to the instructions ser forth in the “Proofing: portion of the section 2. The dough should be covered, and proofing should take approximately 45-60 minutes, or until the dough springs back to the touch. If the dough remains dented after touching, continue proofing the dough until it springs back. (A perfect example where patience pays off!)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Score the dough according to the instructions set forth in the “Scoring” portion of section 2.</p>"}]}