{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/092712-224202-SeriousEats-Roasted-Pork-Drunken-AppleB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["apple", "pork", "pork chops", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Pork Chops With Drunken Honeycrisp Apples", "link": "https://www.seriouseats.com/recipes/2012/09/roasted-pork-chops-with-drunken-honeycrisp-apples-recipe.html", "description": "Pan-roasted thyme-scented pork chops pair with sweet, boozy Honeycrisp apples.", "totalTime": "35 minutes", "recipeYield": "serves 4", "recipeCategory": ["Apple", "Pork", "Sunday Supper"], "recipeIngredient": ["Kosher salt and freshly ground black pepper", "1/4 teaspoon fresh thyme leaves", "1/4 teaspoon garlic powder", "1/4 teaspoon onion powder", "4 double-cut pork chops, 1 1/4- to 1 1/2-inch thick, about 8 ounces each", "1 1/2 tablespoons olive oil ", "4 tablespoons unsalted butter", "5 large Honeycrisp apples, peeled, cored and sliced", "1/4 cup sugar", "1 tablespoon brown sugar", "1 teaspoon cinnamon", "1/8 teaspoon nutmeg", "2 tablespoons rum", "1/4 cup water", "1 teaspoon cornstarch", "1 tablespoon fresh juice from 1 lemon", "1/2 cup dry white wine", "1 cup low-sodium store-bought or homemade chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 400&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1/2 teaspoon salt, 1/2 teaspoon pepper, thyme, garlic powder, and onion powder in a small bowl and stir to combine. Pat pork chops dry with a paper towel and season both sides with seasoning mixture. Heat oil in a large skillet over medium-high heat until lightly smoking. Add pork to pan and cook without moving until well browned on first side, about 4 minutes. Flip and transfer skillet to oven. Continue to cook until instant-read thermometer inserted into center of thickest section of chop registers 145°F, about 10 minutes. Transfer to a large plate, tent with foil, and allow to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pork cooks, melt 2 tablespoons butter in a medium saucepan over medium heat. Add apples, a pinch of salt salt, sugar, brown sugar, cinnamon, nutmeg, rum, and water to pan, stirring to combine. Bring to a boil, reduce heat to medium-low, and simmer until apples are almost tender, about 5 minutes. In a small bowl, dissolve cornstarch lemon juice and add to simmering apple mixture. Simmer until thickened, about 2 minutes longer. Set aside and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When pork is cooked, return skillet to a burner set over high heat. Add wine and cook, scraping up browned bits from bottom of pan. Add chicken broth and cook, simmering until sauce is reduced by half, about 7 minutes. Off heat, swirl in remaining 2 tablespoons butter. Serve pork with sauce and apples.</p>"}]}