{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120610-stir-fry-grill-wok-13.1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Chinese American", "quick", "stir fry", "The Food Lab", "velvet chicken", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Stir-Fried Velvet Chicken with Snap Peas and Lemon-Ginger Sauce", "link": "https://www.seriouseats.com/recipes/2012/06/stir-fried-velvet-chicken-with-snap-peas-and-lemon-ginger-sauce-recipe.html", "description": "A classic Chinese-American dish of chicken and vegetables coated in a mild gingery, lemony sauce. Marinating the chicken in a mixture of cornstarch and egg whites gives it a silky, smooth, moist texture. For best results, use a wok set in an outdoor coal-fired grill for extra high heat cooking.", "totalTime": "35 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chinese", "Mains", "Stir Frying", "The Food Lab"], "recipeIngredient": ["1 egg white", "2 tablespoons soy sauce (divided)", "1/2 cup xiaoshing wine or dry sherry (divided)", "3 tablespoons corn starch, divided", "2 large boneless skinless chicken breasts (about 1 pound), sliced into 1/4-inch slices", "1/2 cup low-sodium homemade or storebought chicken stock", "1/4 cup juice from 2 to 3 lemons", "4 strips lemon zest, removed with a vegetable peeler, about 2 inches long and 1 inch wide", "2 teaspoons sesame oil", "1 tablespoon sugar", "2 tablespoons grated ginger, divided", "1 pound sugar snap or snow peas, trimmed", "2 medium cloves garlic, finely minced (about 2 teaspoons)", "3 scallions, whites only, finely minced", "1/2 cup vegetable, peanut, or canola oil, divided", "Kosher salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine egg white, 1 tablespoon soy sauce, 2 tablespoons xiaoshing wine, and 1 tablespoon corn starch in a medium bowl and whisk until homogenous. Add chicken and toss to coat. Let marinate at room temperature for at least 20 minutes and up to three hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine remaining soy sauce, wine, and cornstarch in a small bowl and whisk to break up any clumps of cornstarch. Add chicken broth, lemon juice, lemon zest, sesame oil, sugar, and 1 tablespoon ginger. Whisk to combine. Set aside. Combine remaining ginger, garlic, and scallions in s amall bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Grill With a Wok Insert</strong>: <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals in a pile on center of cooking grate. Place  <a href=\"http://www.amazon.com/gp/product/B0044EQM9Q/?tag=serieats-20\">Weber 8835 Gourmet BBQ System Hinged Cooking Grate</a> on grill and set wok in center. Add all but 1 tablespoon oil and heat until shimmering. Add marinated chicken and cook, stirring and tossing until barely white, about 1 minute. Remove from wok with a slotted spoon and transfer to a bowl. Wipe out wok. Add remaining oil and heat until smoking. Add snow peas and cook, stirring until lightly charred, about 30 seconds. Return chicken to wok and toss to combine. Add garlic/ginger/scallion mixture to center of wok and cook, tossing and stirring until chicken is cooked through and vegetables are just barely tender, about 30 seconds longer. Stir sauce and pour into wok (it should immediately start to boil). Toss all ingredients to coat in sauce and cook until lightly thickened, about 30 seconds. Season to taste with salt. Carefully transfer to a serving platter and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook On A Burner</strong>: When ready to cook, add all but 1 tablespoon oil to wok and heat over high until shimmering. Add half of marinated chicken and cook, stirring and tossing until barely white, about 1 minute. Remove from wok with a slotted spoon and transfer to a bowl. Repeat with second half of chicken. Wipe out wok. Add half of remaining oil and heat until smoking. Add half of snap peas and cook, stirring until lightly charred, about 30 seconds. Transfer to bowl with chicken. Repeat with remaining oil and snap peas. Return chicken to wok and toss to combine. Add garlic/ginger/scallion mixture to center of wok and cook, tossing and stirring until chicken is cooked through and vegetables are just barely tender, about 30 seconds longer. Stir sauce and pour into wok (it should immediately start to boil). Toss all ingredients to coat in sauce and cook until lightly thickened, about 30 seconds. Season to taste with salt. Carefully transfer to a serving platter and serve.</p>"}]}