{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120418-202430-lamb-burgers.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Eat With Your Hands", "hollandaise", "lamb", "Zakary Pelaccio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zakary Pelaccio's Lamb Burgers", "link": "https://www.seriouseats.com/recipes/2012/04/zakary-pelaccios-lamb-burgers-recipe.html", "description": "Serving burgers with Hollandaise is one of those ideas that borders on mad scientist territory. Kind of insane but pure genius. These Lamb Burgers from <a href=\"http://fattycrew.com/the-crew/zak-pelaccio/\">Zakary Pelaccio</a>'s <em><strong><a href=\"http://www.amazon.com/Eat-Your-Hands-Zak-Pelaccio/dp/0061554200/?tag=serieats-20\">Eat with Your Hands</a></strong></em> take it a step further, using super fatty lamb to make the patties and serving them up with a duck egg Hollandaise and charred scallions dressed with salt and vinegar on fat English muffins.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Burger", "Grilling", "Lamb", "Sandwiches"], "recipeIngredient": ["2 pounds freshly ground lamb, ideally fatty ", "Sea salt and freshly ground black pepper ", "2 duck egg yolks ", "1 teaspoon dijon mustard ", "1/2 pound (2 sticks) cold unsalted butter, cut into 1/4-inch cubes", "1/2 lemon ", "12 scallions, trimmed ", "1 teaspoon neutral oil, such as  grapeseed or canola ", "Splash of your favorite vinegar ", "4 English muffins, split "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start a hardwood charcoal fire (or, fine, use a gas grill). Let it get nice and hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the ground lamb well with salt and pepper, using your hands to lightly work in the seasonings. Don’t overmix. Divide the meat into four balls and form each ball into a patty about 1 inch thick. Season them again on both sides with salt and pepper. If you’re going to grill within 30 minutes, leave the patties out. If not, cover and refrigerate them, then let them come to room temperature before you grill them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring water to a simmer in a pot that will accommodate a double boiler or metal mixing bowl. Put the egg yolks in the double boiler or metal mixing bowl, whisk them to incorporate some air until they go from rich, deep yellow to a pale yellow and they’ve increased in volume. Add the mustard and a teaspoon of cold water and keep whisking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the double boiler or bowl over the simmering water and start adding the butter, one piece at a time, whisking to incorporate completely before adding the next one. Once you’ve added all the butter, finish the sauce with a squeeze or three of the lemon and gradually add salt and pepper until it tastes really good. It should be rich, salty, and slightly acidic. If it is, congratulations, you just made Hollandaise. Cover with plastic wrap and put the double boiler or mixing bowl in a large bowl of warm water until you’re ready to use it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill the burgers, flipping once, until medium-rare, about 8 minutes total. If the flame flares high around the burgers while you’re grilling, move them around a bit. You don’t want them to get too much color too quickly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the scallions in the oil and season with salt and pepper. Grill them until they’re slightly charred and tender, about 2 minutes a side. When they’re nicely charred and you’ve pulled them off the grill, chop them into big pieces and sprinkle them with some of your favorite vinegar and some more salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the English muffins on the grill. Bun, burger, scallion. Big bowl o’ Mr. Holland’s daze (the egg sauce) on the side for dipping. Get excited, slap  someone’s buns—anyone, no matter. Now you’re ready to eat. </p>"}]}