{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121215-bakethebook-snackerbars.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "candy", "chocolate", "diy", "peanuts", "the liddabit sweets cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snacker Bars", "link": "https://www.seriouseats.com/recipes/2012/12/snacker-homemade-diy-snickers-bars-chocolate-peanut-butter-candy-recipe.html", "description": "These bars are a serious undertaking. But lucky for them, they are seriously delicious. Based on a bar with a similar name (and I'm sure you can figure out which), the combination of nougat, caramel and chocolate is as classic as it is crave-able.", "totalTime": "4 hours, including setting and cooling time", "recipeYield": "makes 35 1-x-4 inch bars or 160 1-inch squares", "recipeCategory": ["Bake the Book", "Candy", "Chocolate", "Desserts", "Nuts"], "recipeIngredient": ["<strong>For The Caramel</strong>", "Cooking spray or vegetable oil ", "1 3/4 cups (340 grams) granulated sugar ", "1 1/2 cups (12 ounces/375 grams) evaporated milk ", "2/3 cup (160 grams) heavy (whipping) cream ", "1 vanilla bean, split open and seeds scraped out, pod reserved; ½ teaspoon vanilla paste; or 1 teaspoon pure vanilla extract ", "3/4 cup plus 2 tablespoons (300 grams) light corn syrup ", "3 tablespoons plus 2 teaspoons (scant 1/2 stick/50 grams) unsalted butter ", "1 tablespoon (18 grams) coarse sea salt ", "2 cups (300 grams) roasted and salted peanuts ", "&nbsp;", "<strong>For The Nougat</strong>", "3 tablespoons (3/4 ounce/20 grams) unflavored powdered gelatin ", "1/2 cup (120 grams) cold water ", "4 large egg whites ", "3 3/4 cups (1.3 kgrams) light corn syrup ", " 2 1/3 cups (435 grams) granulated sugar ", "1 cup (235 grams) water ", "12 ounces (340 grams) dark chocolate, melted (see page 24) and cooled slightly to lukewarm (about 1½ cups) ", "1 tablespoon (45 grams) pure vanilla extract ", "&nbsp;", "<strong>For Enrobing The Bars</strong>", "13 cups chopped dark chocolate (about 5 pounds/2.25 kgrams), or 13 cups chopped dark chocolate (about 5 pounds/2.25 kg) and 2 cups (450 g) mild vegetable oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the caramel:</strong> Coat the baking sheet with cooking spray, and set it aside on a heatproof surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sugar, evaporated milk, heavy cream, and vanilla bean and seeds (if using) in a large (6- to 8-quart) saucepan. Bring the mixture to a boil over medium-high heat, uncovered and without stirring. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Insert the candy thermometer. Add the light corn syrup, and stir gently with the heatproof spatula until everything is mixed well. Reduce the heat to medium-low and cook, stirring often and making sure to scrape the bottom of the pot to keep the mixture from burning, until it reaches 230°F/110°C (thread stage), about 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter and the vanilla paste or extract (if using). If you used a vanilla bean, fish it out with a slotted spoon. Stirring continuously, continue to cook the caramel until it reaches 241°F/116°C (low firm ball stage), 15 to 20 minutes. The caramel will be a deep golden brown, smell nice and toasty, and have rolling bubbles in the middle. Remove the caramel from the heat and stir in the salt and peanuts, making sure to mix well so that they’re distributed evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pour the caramel onto the prepared baking sheet, and spread it into an even layer with the spatula. Allow it to set up until it is cool to the touch, about 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the nougat:</strong> Mix the gelatin and the cold water together in a small bowl and let it set until softened, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the egg whites in the mixer bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the light corn syrup, sugar, and water in a medium-size (4-quart) saucepan and bring to a boil over high heat. Insert the candy thermometer, reduce the heat to medium-high, and cook the syrup, uncovered and without stirring, until the syrup reaches 250°F/120°C (firm ball stage).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start whipping the egg whites on medium speed until they become foamy and soft peaks form, 5 to 7 minutes. At this point, the syrup should have reached 265°F/130°C (hard ball stage); if it hasn’t reached the proper temperature, just stop the mixer until the syrup catches up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the syrup comes to temperature, remove it from the heat. With the mixer on low speed, slowly and carefully pour the hot syrup down the inside of the mixing bowl (if the syrup is poured directly onto the moving whisk, it will splatter, which could mean severe pain for you). Once all the syrup has been added, add the softened gelatin and increase the speed to medium-high and whip until the mixture is very thick and looks like a skin has developed on top, 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the melted chocolate and the vanilla extract, and mix for another 10 to 15 seconds to incorporate. Remove the bowl from the mixer and scrape the bottom with the spatula, folding the mixture to evenly distribute the chocolate. Once the chocolate is fully incorporated, pour the nougat onto the caramel. Spread it into an even layer with the spatula and allow it to set up until it is cool to the touch, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the bars:</strong> Temper the 13 cups chopped dark chocolate (instructions follow) or use the 13 cups chopped dark chocolate and 2 cups oil to make the Cheater’s Chocolate Coating (instructions follow). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Enrobe and cut the bars (instructions follow).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the bars, layered with parchment or wax paper, in an airtight container at cool room temperature for up to 8 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Tempering Chocolate:</strong> You'll need 5 pounds of your chocolate of choice for this. Fill a large (6-quart) saucepan with water to a depth of about 1 inch. Bring it to a boil, uncovered, over high heat. Meanwhile, if using a block of chocolate, chop it with a serrated knife. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the water has come to a boil, turn off the heat and set a medium-size heatproof bowl on top. Add about two-thirds of the chopped chocolate and allow to sit for 5 to 10 minutes, stirring only occasionally with a heatproof spatula (you want to make sure the chocolate on the bottom of the bowl doesn't get too hot, but if you stir the whole time, the heat will disperse too much and the chocolate won't melt all the way).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all the pieces have melted completely, insert the tempering thermometer (recommended but optional; if you don't have one, try using the Cheater's Chocolate Coating, explained next) and check the temperature; for dark chocolate you want it to be around 108&deg;F; milk, 106&deg;F; white, 104&deg;F. If you go a little bit under these temperatures, that's fine; too much under, though, and you won't melt all the \"bad\" crystals in the cocoa butter (the ones that keep your chocolate from getting glossy). No thermometer? No problem. Dab a bit of the chocolate on your lip instead. At the melted stage, the chocolate should feel distinctly warm, not just lukewarm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once your chocolate has reached the desired temperature, CAREFULLY lift the bowl off the pot, and place it on top of a folded dish towel. You'll want to wipe the moisture off the bottom and side of the bowl; this will lessen the risk of accidentally getting some in the chocolate, which is not okay. (Water will cause the chocolate to \"seize\", or get lumpy and unworkable, and you'll have to make it into chocolate sauce instead.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now add some of the reserved chocolate, about 1/4 cup at a time, stirring constantly until the addition has been incorporated completely and there are no more lumps. You'll want to stir like your life depends on it here, both to agitate the chocolate (the more it is agitated, the nice-n-shinier it'll be) and to reduce its temperature. You want to get it down to about 90&deg;F for dark, 88&deg;F for milk, 86&deg;F for white. (Starting to notice a pattern here? More cocoa solids require working at higher heat.) If you're doing the lip test, you'll want it to feel distinctly cool. Agitating not only encourages the right crystals to form, it also helps cool the chocolate more rapidly. This will take you about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the chocolate is close to the desired temperature (a degree or two above is fine), test it: Dip a teaspoon in the chocolate, then stick the dipped spoon on a piece of wax paper and allow it to set up for a few minutes. (If your kitchen is warm, you can put it in the fridge for a bit - 2 minutes for dark, more like 5 for milk and white.) If the test sets up completely; a little glossy, not tacky to the touch, not streaky or blotchy, then huzzah and kudos to you! You just tempered chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cheater's Chocolate Coating:</strong> If tempering seems like too much fuss to you, try this. You'll need 19 ounces of chopped milk or dark chocolate, and 1/2 cup (100g) neutral-flavored vegetable oil, like sunflower or safflower.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the chocolate: Place it in a medium-size microwave-safe bowl and heat it in the microwave on high for 20 seconds. Stir the chocolate with a whisk or heatproof spatula, then continue heating it on high in 20-second increments, stirring after each increment, until the chocolate is completely melted.<br />\nAlternatively, fill a small (2-quart) saucepan about one-third full with hot water, and place it over medium-low heat. When the water simmers, place the chocolate in a slightly larger metal bowl and set it over the simmering water (make sure the bowl is large enough for you to easily grasp it for removal). Allow the chocolate to melt, stirring it occasionally, until it's completely liquid and there are no lumps left, 15 to 20 minutes. Remove it from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly stir the oil into the melted chocolate until it is completely incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keep the coating warm by setting the bowl over a saucepan of simmering water until you're almost ready to use it; then remove it from the heat and allow it to cool until it has the consistency of warm fudge sauce, 15 to 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the chocolate coating in an airtight container in the fridge for up to 1 month. Reheat it as many times as you need to. To reheat, cut the cooled coating into chunks and microwave on high for 20 second intervals, then 5 to 10 second intervals, stirring after each, until it's melted. Or, place the block on top of a double boiler set over low heat and stir occasionally until melted. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Enrobing Candy Bars: The Pour-Over Method</strong> You'll need two large (13\" x 18\") rimmed baking sheets, lined with parchment paper, large and small metal offset spatulas, a ruler, cutting board and wire cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a sheet of parchment on top of the candy slab. Grasp the parchment and baking sheet on both ends, holding everything together like a giant sandwich. Keeping the parchment as taut as possible, turn \"the sandwich\" over with one swift, smooth motion onto the cutting board. Remove the baking sheet and peel off any lining. The slab should be upside down; you'll first be coating what will end up as the bottom of the bars. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour about 3/4 cup of the prepared chocolate on top of the slab, and use the large offset spatula to spread it over the surface in an even layer, adding more if needed to cover the entire surface (it's okay if some drips down the sides; you'll be trimming them anyhow). Allow the chocolate to set until it is no longer wet but it is still soft, about 5 minutes. Meanwhile, set aside the bowl of chocolate; you'll retemper/reheat it soon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the chocolate layer is still slightly soft, flip the slab of candy so it is chocolate side down, and trim the edges with a sharp chef's knife so that they're more or less straight (if the slab contains sticky layers, oil the knife first). Using the ruler and the knife, measure and score 1 by 4-inch bars or 1- by 1-inch bite-size pieces; then press down with a firm hand to cut along the score lines. Set the cut bars, chocolate side up, on a lined baking sheet, and let the chocolate set completely, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, retemper the chocolate, or warm the chocolate coating over a pan of simmering water until it's body temperature (test it on your lip). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the wire cooling rack over the second lined baking sheet, and arrange the bars, chocolate side down on the rack, about 1/2 inch apart. Ladle the warmed chocolate over each bar, pouring long-ways while making small side-to-side motions; coat as much of each bar as possible (if there are a few small gaps that remain uncoated, you can fix them later). Tap the tray against the counter to even out the chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately run a small offset spatula or butter knife underneath each bar to loosen it from the rack. Don't be afraid to scrape along the wires of the rack; you can't do any damage to it, and you want to keep as much chocolate on the bars as possible. Use the spatula to transfer the loosened bars to the first lined baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape off any excess chocolate on the rack into the pool of chocolate in the baking sheet. Gently pour the chocolate on the baking sheet back into the bowl, and stir it a little to even out the consistency. Using the small offset spatula, cover with chocolate any holes that may be left in the coated bars. Allow the bars to set completely, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coated candy bars will keep, stores in an airtight container, for 3 to 8 weeks (bars with ganache and/or a cookie base will last 3 to 4 weeks; nougat and caramel, 6 to 8). </p>"}]}