{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120508-204980-knead-book-fast-breads-cinnamon-pinwheels.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fast Breads' Bottoms-Up Cinnamon-Caramel Pinwheels", "link": "https://www.seriouseats.com/recipes/2012/05/fast-breads-bottoms-up-cinnamon-caramel-pinwh.html", "description": "[Photograph: Donna Currie] As always with our Knead the Book feature, we have five (5) copies of Fast Breads to give away this week. Enter the contest here. The problem with cinnamon rolls is that you usually want them hot...", "totalTime": "40 minutes", "recipeYield": "Makes 9 rolls", "recipeCategory": ["Bread Baking", "Breakfast Sweets", "Quick Bread"], "recipeIngredient": ["Glaze:", "4 tbsp unsalted butter", "2 tbsp honey", "1/2 cup packed light brown sugar", "Biscuit Dough:", "1 1/2 cups unbleached all-purpose flour", "1/2 cup cake flour", "1 tbsp granulated sugar", "1 tsp baking powder", "1/2 tsp baking soda", "3/4 tsp kosher salt", "6 tbsp unsalted butter, melted", "1 cup sour cream", "1/4 cup buttermilk, any fat content ", "Topping:", "1/4 cup granulated sugar", "1 tsp ground cinnamon", "1 tbsp unsalted butter, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Method: Position a rack in the middle of the oven and preheat to 350ºF. Line a 9-in round pan or baking dish with 2-in high sides with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the glaze. In a medium saucepan, combine the butter, honey, and brown sugar over medium heat and cook, stirring often, until the butter and sugar melt and the glaze is smooth. Pour the glaze into the prepared pan, tilting the pan to spread it evenly over the bottom. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the biscuit dough. Sift together both flours, the sugar, baking powder, baking soda, and salt into a medium bowl. Put about half of the flour mixture into a large bowl. Add the butter, sour cream, and buttermilk to the flour mixture in the large bowl and stir with a large spoon until blended. Add the remaining flour mixture to the large bowl and stir until it is incorporated and a soft, ragged dough forms. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With floured hands, gather up the dough and put it on a lightly floured work surface. Knead the dough about 10 strokes: push down and away with the heel of your hand against the surface, then fold the dough in half toward you, and rotate it a quarter turn, flouring the surface as necessary to prevent sticking. The dough is ready when it looks fairly smooth, feels very soft, and there is no loose flour. Pat the dough into a rectangle about 12 by 7 in by and 3/8 in thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the topping. In a small bowl, stir together the sugar and cinnamon. Using a pastry brush, spread the butter evenly over the dough, leaving a 1-in border uncovered on all sides. Sprinkle the cinnamon sugar evenly over the butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a thin, metal spatula to help lift the dough, and starting from a long side, roll up the dough, jelly-roll style, pressing the seam to seal. If any dough sticks to the surface, use the spatula to spread the dough back onto the dough cylinder. Pinch the ends to seal. The roll will be about 11 in long. Using a sharp knife, cut the cylinder crosswise into 9 rolls each about 11/4 in thick. Place them, with a cut side up, in the prepared pan, arranging 7 rolls around the edge of the pan and 2 rolls in the middle. Pinch together any edges that separate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the tops feel firm and the edges just start to brown, about 25 minutes. Let cool in the pan on a wire rack for 5 minutes. Turn out onto a serving plate and peel away the parchment. Serve warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pinwheels can be baked 1 day ahead, unmolded as directed, covered, and left at room temperature. To serve, preheat the oven to 275ºF and reheat the pinwheels, sticky side up, until warm, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Choices: Sprinkle 1/3 cup raisins or dried cranberries over the cinnamon sugar.</p>"}]}