{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/011112-187247-diyvsbuy-orangebitters.jpg", "author": {"@type": "Person", "name": "Marcia Simmons"}, "recipeCuisine": "", "keywords": ["bitters", "cocktail ingredients", "DIY vs Buy", "orange", "oranges"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "DIY Orange Bitters", "link": "https://www.seriouseats.com/recipes/2012/01/how-to-make-your-own-orange-bitters-recipe.html", "description": "Just a drop or two of orange bitters can add the right depth to your cocktail or bridge together ingredients that aren't quite living up to their mixological potential. Deep, citrusy, spicy, complex orange bitters are an essential part of so many balanced cocktails. The beauty of DIY bitters is unleashing your creativity and crafting bitters that you can't find anywhere else. I emphasized anise, but you could just as easily play up the cloves or add cardamom, cinnamon, coriander, or ginger for a whole new flavor profile.", "totalTime": "3 weeks", "recipeYield": "Makes about 1 1/2 cups", "recipeCategory": ["Cocktails", "Orange", "Other Drinks"], "recipeIngredient": ["4 oranges (zest only)", "1 cup 151-proof neutral grain spirit, divided", "1 teaspoon gentian root", "1 teaspoon quassia chips", "1 1/2 cups 101-proof bourbon", "1/2 teaspoon caraway seeds", "1/2 teaspoon cloves", "1 star anise pod", "1/2 teaspoon anise seed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Zest the oranges using a vegetable peeler and place the peel on the cookie sheet. Bake at 100 degrees until dried but not burned, about 40 minutes. Check regularly to ensure peels have not burned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the zests are cool, place them in a sealable glass jar with 1/2 cup of the 151 neutral grain spirit. Be sure this jar is large enough to later hold an additional 1 cup of liquid. Shake. This is your orange flavoring.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the caraway seeds, cloves, star anise, and anise seed in a different sealable glass jar with 1/2 cup of the 151 neutral grain spirit. Shake. This is your spice mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gentian root and quassia chips in a sealable glass jar with the bourbon. Shake. This is your bittering mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 10 days, strain the spice mix and bittering mix through a fine-mesh sieve to remove the solids. Strain again through a coffee filter into the orange flavoring jar. Do not remove the orange zest. Shake. You now have one jar that contains the strained spice mix and bittering mix along with the steeping orange zest and alcohol. Let this steep for an additional 11 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain out the orange zest through a fine-mesh sieve, and then strain the rest through a coffee filter into your desired container. </p>"}]}