{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121010-225636-pear-grape-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["grapes", "pears", "pie of the week", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pear and Concord Grape Pie", "link": "https://www.seriouseats.com/recipes/2012/10/pear-and-concord-grape-pie-recipe.html", "description": "Tart Concord grapes and mild, sweet pears (Bosc or Bartlett are good varieties to use) work well together in this classic, deep dish style pie. Try your hand at lattice weaving, or go with a traditional double-crust version, either way, the results will be delicious.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Fruit Desserts", "Grapes", "Pear", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "24 ounces peeled, cored, and sliced pears (approximately 7 pears)", "3 ounces seedless Concord grapes, removed from the stems", "6 ounces granulated sugar", "1 ounce tapioca or potato starch", "1 egg", "Big pinch salt", "2 tablespoons sanding or demerrara sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 425°F. Line pie plate with bottom crust. Place prepared fruit in a large bowl.  Whisk together sugar and starch to combine, then gently toss with the fruit, until the pieces are evenly coated. Pour the fruit into pie shell. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For a lattice top, cut the rolled, chilled dough into 18 strips and <a href=\"http://sweets.seriouseats.com/2011/07/sweet-technique-shaping-pie-crust-how-to-make-lattice-topped-pie-woven-crust.html\">weave into a top crust</a> (you may also use the sheet of dough to make a traditional top crust, just be sure to cut slits in the top). Crimp sides, and chill the pie for 30 minutes. Whisk together egg and a pinch of salt. When ready to bake, remove pie from fridge, brush with egg wash, and sprinkle with raw sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pie in oven and bake for 20 minutes at 425°F, turning halfway through. Reduce heat to 375°F and bake until filling bubbles all over inside and crust is golden brown, 45 - 50 minutes longer. Remove from oven and place pie on rack to cool completely before serving.</p>"}]}