{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120221-193833-spaghetti-in-parchment-with-clams-2.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["clam", "clams", "Cook the Book", "Marc Vetri", "pasta", "Rustic Italian Food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Marc Vetri's Spaghetti in Parchment with Clams and Scallions", "link": "https://www.seriouseats.com/recipes/2012/02/marc-vertris-spaghetti-in-parchment-with-clams-and-scallions-recipe.html", "description": "There's a certain drama that surrounds cooking <em>en papillote</em>.  Unwrapping the parchment paper that holds your meal adds an air of excitement, something not too dissimilar to opening a gift.  And that's precisely what's so appealing about <a href=\"http://www.vetriristorante.com/index.php?a=biography\">Marc Vetri</a>'s <strong>Spaghetti in Parchment with Clams and Scallions</strong> from <em><strong><a href=\"http://www.amazon.com/Rustic-Italian-Food-Marc-Vetri/dp/158008589X/?tag=serieats-20\">Rustic Italian Food</a></strong></em>.", "totalTime": "45 minutes", "recipeYield": "makes 4 servings", "recipeCategory": ["Clams, Mussels, and Oysters", "Cook the Book", "Pasta"], "recipeIngredient": ["1 pound refrigerated extruded \u2028spaghetti, or 12 ounces boxed dried spaghetti", "8 tablespoons olive oil", "4 scallions, trimmed and top quarter removed, sliced crosswise", "4 cloves garlic, smashed", "50 to 60 small clams, scrubbed", "1/4 cup dry white wine", "1/4 teaspoon red pepper flakes", "1/4 cup water", "1/2 cup finely chopped fresh flat-leaf parsley", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425ºF. Bring a large pot of salted water to a boil. Drop in the pasta, quickly return to a boil, and cook until slightly underdone and chewy, 1 to 6 minutes, depending on how long it has been refrigerated (or 7 to 8 minutes for the boxed stuff). Drain the pasta, reserving the pasta water.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 2 tablespoons of the oil in a large sauté pan over medium heat. Add the scallions and garlic and cook until soft but not browned, about 3 minutes. Add the clams, wine, pepper flakes, and water. Cover and simmer until the liquid reduces in volume by about half, 5 minutes. When the clams have opened, discard the garlic and any empty clam shells.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the drained pasta to the pan along with the remaining 6 tablespoons olive oil and the parsley. Cook over medium heat, tossing until the sauce gets a little creamy.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Tear 4 sheets of parchment paper, each about 2 feet long. Place one-fourth of the pasta mixture in the center of each sheet of parchment. Bring the long sides of the parchment up above the pasta so the edges meet. Fold the edges together and keep folding down until tight over the pasta. Flip over and pull each side of parchment over the center to make a tight packet. Flip back over so the folded seam side is up.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the packets to a baking sheet and bake until the paper browns lightly, \u20285 to 7 minutes. If you have convection, turn it on to help the paper brown. Transfer to plates and allow guests to slit open the packets lengthwise with a knife.<br />\r\n</p>"}]}