{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120127-188620-chocolate-pudding-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "chocolate desserts", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Pudding Pie", "link": "https://www.seriouseats.com/recipes/2012/02/chocolate-pudding-pie-recipe.html", "description": "This is the perfect comfort-food dessert. I love the pure flavor and creamy decadence of the homemade chocolate pudding filling. The crisp all-butter crust provides the perfect amount of flaky crunch. It's my go-to dessert for special occasions at home.", "totalTime": "4 hours", "recipeYield": "makes 8 servings", "recipeCategory": ["Chocolate", "Pies, Tarts, and Crumbles", "Puddings and Custards"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "27 ounces whole milk", "1.4 ounces cornstarch", ".75 ounce cocoa powder", "2.6 ounces granulated sugar", "1/4 teaspoon salt", "2 ounces butter", "4 ounces chocolate, chopped finely", "1 cup heavy cream, cold", "2 tablespoons confectioner's sugar", "Optional: chocolate shavings or sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the crust: Preheat the oven to 425&deg;F. Line the bottom of the chilled pie crust with foil or parchment paper and fill it with pie weights (I reuse dried beans for this purpose) and bake for 15 minutes on the bottom rack of the oven, rotating halfway through. Remove the weights and liner and bake for an additional 15 minutes, until the bottom of the pie is a golden brown. Remove the shell from the oven and allow it to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk into a medium saucepan with a heavy bottom. In a small bowl, whisk together sugar, cornstarch, cocoa, and salt. Place the milk over medium heat and whisk in the dry ingredients a little at a time. Continue to whisk without stopping, the mixture will start to thicken after about 5 minutes. Whisk vigorously until it bubbles. Turn the heat to low, add the butter, and whisk until it has melted. Add the finely chopped chocolate and whisk until it is completely melted. Pour the pudding into the baked pie shell. Press a layer of plastic wrap against the surface of the pudding (unless you like pudding skin, in which case, skip the plastic wrap) and place the pie in the fridge for 3-4 hours to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve: Combine the cold, heavy cream and confectioner's sugar in a large bowl and whisk until the cream holds a medium peak. Remove the plastic wrap from the surface of the pie, and top the pie with the whipped cream. Sprinkle chocolate shavings or sprinkles if desired. Serve immediately.</p>"}]}