{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120112-187396-sachertorte.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chocolate", "chocolate cake", "Kurt Gutenbrunner", "Neue Cuisine", "sachertorte"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sachertorte", "link": "https://www.seriouseats.com/recipes/2012/01/sachertorte-viennese-chocolate-cake-apricot-recipe.html", "description": "With its layers of deeply chocolaty cake spiked with cinnamon and rum and a bright stripe of apricot jam running through the center, the <strong>Sachertorte</strong> is the most widely recognized Viennese pastry for good reason; this elegant cake is decadent and absolutely delicious.", "totalTime": "1 hour 30 minutes plus overnight chilling time", "recipeYield": "makes 12 servings", "recipeCategory": ["Bake the Book", "Cakes"], "recipeIngredient": ["1/2 cup semisweet chocolate chips", "6 tablespoons unsalted butter, softened, plus more for brushing", "All-purpose flour, for dusting ", "1/4 cup confectioners’ sugar", "1/8 teaspoon ground cinnamon", "4 large eggs, separated", "1 large egg yolk", "1/2 cup granulated sugar", "3/4 cup cake flour, sifted ", " ", "<strong>Rum syrup and jam</strong>", "1/2 cup sugar", "1/2 cup water", "2 tablespoons dark rum", "1 1/2 cups smooth apricot jam (not preserves)", " ", "<strong>Glaze</strong>", "6 ounces bittersweet chocolate, chopped (1 cup)", "8 tablespoons (1 stick) unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 325&deg;F. Brush a 9-inch round cake pan with butter and dust with flour. Line a baking sheet with parchment paper. In a double boiler or a medium bowl set over a saucepan of simmering water, or in a microwave, heat the chocolate chips until just melted. Remove from the heat and stir until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, using a hand-held mixer, beat the butter with the confectioners’ sugar and cinnamon until pale and creamy, about 2 minutes. Add the egg yolks, one at a time, beating after each addition until smooth. Add the melted chocolate and beat until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another large bowl, using clean beaters, beat the egg whites at medium speed until slightly thickened and foamy, about 2 minutes. Gradually add the granulated sugar, and beat until the whites hold a soft peak. Using a rubber spatula, stir one-third of the beaten egg whites into the yolk mixture to lighten it. Gently fold this mixture into the remaining egg whites just until smooth. Fold in the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an offset spatula, spread the batter in the prepared pan. Transfer to the oven and bake until a toothpick inserted into the middle comes out clean, 35 to 45 minutes. Remove the cake from the oven and carefully flip it onto the prepared baking sheet. Let the cake cool for about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the rum syrup: In a small saucepan, combine the sugar with the water and cook over medium heat, stirring occasionally, until the sugar dissolves. Stir in the rum, remove from the heat, and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously brush the cake all over with some of the rum syrup; reserve the remaining syrup. Cover the cake with plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the cake horizontally in half. Brush each cut side generously with the rum syrup. Spread 1/2 cup of the jam evenly over the bottom of the cake. Set the other half on top. Spread the remaining 1 cup of jam evenly over the top and sides of the cake. Refrigerate until set, about 2 hours.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the glaze: In a double boiler or a medium bowl set over a saucepan of simmering water, or in a microwave, heat the chocolate with the butter until just melted. Remove from the heat, stir until smooth, and let cool slightly. Remove the cake from the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the glaze over the top and sides of the cake, then spread it evenly all over the cake. Refrigerate the cake until the glaze is set, 5 to 10 minutes, before serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cake to a cake plate, and serve.</p>"}]}