{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120214-192604-knead-the-book-italian-baker-semelle.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "knead the book", "rolls", "The Italian Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Italian Baker's Semelle Rolls", "link": "https://www.seriouseats.com/recipes/2012/02/the-italian-bakers-semelle-bread-recipe.html", "description": "Semelle are little rolls from Florence where the dough is used to make several different buns including some that require special cutters. This recipe from <em>The Italian Baker</em> is astonishingly easy (you don't need the special cutters) and the results are pretty darned good.", "totalTime": "3 hours", "recipeYield": "Makes 10 buns", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["2 1/4 teaspoons (1 package / 0.2 oz / 7 g) active dry yeast", "1 1/4 cups (10.5 oz / 300 g) warm water ", "3 3/4 cups (17.5 oz / 500 g) unbleached all-purpose flour", "2 teaspoons (0.4 oz / 10 g) salt", "Olive oil for brushing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By Hand<br />\nStir the yeast into the water in a mixing bowl; let stand until creamy, about \u202810 minutes. Stir in the flour, 1 cup at a time, and the salt. When the dough is too stiff to stir, plunge in with your hands. Knead on a lightly floured work surface until solid and elastic, 8 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By Mixer<br />\nStir the yeast into the water in a mixer bowl; let stand until creamy, about 10 minutes. Add the flour and salt and mix with the paddle until the dough pulls away from the sides of the bowl. Change to the dough hook and knead until solid and elastic, 3 to 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First Rise. Place the dough in a lightly oiled bowl, cover tightly with plastic wrap, and let rise until doubled, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shaping and Second Rise. Cut the dough into ten equal pieces and shape each piece into a ball. Brush a little oil over each and let rest 10 minutes under a towel. With the edge of your hand, make a deep indentation down the center of each ball; be sure to press down firmly. Place the rolls, cleft side down, on floured parchment or brown paper. Cover with a towel and let rise until doubled, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Baking. Preheat the oven to 425ºF. Just before baking, turn each roll over and reemphasize the cleft. Place the rolls, cleft side up, on an oiled baking sheet. Bake 15 to 18 minutes, spraying the oven three times with water in the first 10 minutes. Cool on a rack.</p>"}]}