{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120401-195206-mqngo-mousse-pie-610x458-2.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["mango", "mousse", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mango Mousse Pie", "link": "https://www.seriouseats.com/recipes/2012/04/mango-mousse-pie-recipe.html", "description": "This is a light and refreshing mousse pie made with mango puree, which you can make using fresh or frozen mangoes pureed in a blender, or with puree purchased from the store. Unlike many mousses, this one contains no egg whites and relies on whipped cream to give it volume and gelatin to stabilize it. I love serving this pie in the springtime, when mangoes are at their peak.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Mango", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "2 1/2 teaspoons powdered gelatin, bloomed in 1 ounce cold water", "13 ounces strained mango puree (made from fresh or frozen blended mangoes or store-bought puree)", "5 ounces granulated sugar", "16 ounces heavy cream, whipped to soft peaks and chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a light golden brown, about 10 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up an ice bath large enough to accommodate a small saucepan. Bloom gelatin in cold water by stirring it together and allowing to sit for 5 minutes. In a small saucepan, combine 1/2 mango puree and sugar and stir over low heat until the sugar dissolves completely and mixture is hot to the touch. Add gelatin and stir well, making sure that it has completely dissolved into the mixture. Remove from heat, stir in other half of the mango puree. Place mixture over the ice bath and stir frequently. The goal is to cool the mixture, but avoid the gelatin setting up unevenly, creating lumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once mixture is cool, fold in 12 ounces of whipped cream, taking care not to deflate the mousse, until it is of uniform consistency. Pour mousse into cooled pie shell and smooth out the top. Place pie in the fridge for at least two hours (overnight is ideal) to set up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pipe remaining 4 ounces of cool whipped cream onto top of the pie. Serve immediately.</p>"}]}