{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120731-nasty-bits-bone-marrow-shallot-confit-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["bone marrow", "Nasty Bits", "roasting", "shallots"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Bone Marrow with Shallot and Currant Confit", "link": "https://www.seriouseats.com/recipes/2012/07/roasted-bone-marrow-with-shallot-and-currant-confit-recipe.html", "description": "The sweet richness of shallots and onions makes a great foil for roasted marrow.", "totalTime": "1 hour", "recipeYield": "4 as an appetizer", "recipeCategory": ["Beef", "The Nasty Bits"], "recipeIngredient": ["1 pound shallots, minced", "1/2 cup olive oil", "1/4 cup currants", "6 to 8 sections of bone marrow, cut the long way", "salt and freshly ground black pepper", "a good loaf of bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the shallots in a sauté pan with the olive oil and currents.  Cook over medium low heat for 30 minutes, or until the shallots begin to brown.  Stir occasionally to prevent the bottom from sticking. Reduce the heat to low and continue to cook, stirring often, until the shallots are dark golden, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour all but one tablespoon of olive oil from the pan.  The olive oil will be perfumed with shallots, and can be reserved for use in salad.  Let the confit cool, then store in a non-reactive container for up to a week.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, preheat the oven to 450 F.  Place the bones in a roasting pan and roast for 15 to 20 minutes, until the surface of the marrow is lightly browned.  During the last few minutes of roasting, place the rounds of bread in the pan to toast.  Remove the marrow and bread from the oven.  There will be beef fat in the pan.  </p>\r\n\r\n<p>Sprinkle the marrow with salt and pepper.  Serve with shallot confit. </p>"}]}