{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120629-pho-food-lab-19.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Vietnamese", "keywords": ["Asian cuisine", "beef", "noodle soup", "phở", "soup", "The Food Lab", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7142857142857", "ratingCount": "7"}, "name": "Quick and Easy 1-Hour Pho", "link": "https://www.seriouseats.com/recipes/2012/10/quick-and-easy-1-hour-pho.html", "description": "A full-flavored pho broth in less than a quarter of the time a traditional pho takes.", "totalTime": "1 hour", "recipeYield": "makes 2 quarts broth, serving 4", "recipeCategory": ["Beef", "Mains", "Soups and Stews", "The Food Lab", "Vietnamese"], "recipeIngredient": ["3 whole star anise pods", "1 cinnamon stick", "1 teaspoon fennel seeds", "4 cloves", "1 teaspoon coriander seeds", "1 pound beef chuck, cut into rough 1-inch chunks, very cold", "1 1/2 pounds chicken backs or wing tips, roughly chopped with a cleaver or cut with kitchen shears into 1-inch pieces, very cold", "1 egg white", "2 quarts low-sodium homemade or store-bought chicken broth", "1 ounce (four packets) powdered gelatin", "1 tablespoon vegetable oil", "1 (4-inch) hand ginger, split in half lengthwise", "2 medium onions, split in half", "2 tablespoons sugar", "1/4 cup fish sauce, plus more to taste", "3/4 pound flank steak, divided into two pieces", "&nbsp;", "<strong>To Serve</strong>:", "4 servings pho noodles, prepared according to package directions", "2 cups mixed herbs (cilantro, basil, and mint)", "2 cups trimmed bean sprouts", "1/2 cup sliced scallions", "Thinly sliced onions", "Thinly sliced Thai chilis", "2 limes, each cut into 4 wedges", "Hoisin sauce and Sriracha"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place star anise, cinnamon, fennel, cloves, and coriander seeds in the center of a 6- by 6-inch double-layered square of cheesecloth. Tie into a pouch with butcher's twine. Set aside. Combine beef chuck, chicken, and egg white in a large bowl and toss to combine. Transfer 1/4 of mixture to the bowl of a food processor and pulse until a very rough puree is formed, about 15 one-second pulses. Transfer to another bowl. Repeat with remaining beef/chicken mixture until it is all processed. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 2 cups chicken broth in a small bowl and sprinkle with gelatin. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large stockpot or Dutch oven over high heat until smoking. Add onions and ginger, cut side down. Cook without moving, reducing heat if smoking excessively, until onion and ginger are well charred, about 5 minutes. Flip over and cook until second side is charred in spots, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 6 cups chicken broth and scrape up any browned bits from bottom of pan. Add bundled aromatics, fish sauce, sugar, 1 pieces of flank steak, and chicken broth/gelatin mixture. Bring to a boil, then reduce to a simmer. Pour ground beef/chicken mixture into broth and whisk vigorously to break up. Allow broth to simmer, uncovered, until intensely flavored and aromatic, 30 to 45 minutes. Beef and chicken mixture should rise to surface and form a distinct layer. Do not break this layer up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon or wire mesh spider, carefully remove ground beef mixture from surface of broth (it should form a relatively solid mass), along with onions, ginger, and spice packet and discard (or save any pieces of beef you'd like for the finished soup). Remove cooked flank steak, rinse thoroughly under cold running water, and transfer to a cutting board. Season broth to taste with more fish sauce, salt, and sugar. Strain through a fine mesh strainer into a clean pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice cooked flank steak and raw flank steak agains the grain with a sharp knife. To serve, place re-hydrated pho noodles in individual noodle bowls. Top with cooked flank steak (and any reserved chuck), and slices of raw flank steak. Pour hot broth over beef and noodles. Serve immediately, allowing guests to add herbs, aromatics, lime, and sauce as they wish.</p>"}]}