{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121027-crispy-duck-fried-potatoes-smashed-6.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["duck fat", "fried", "fried potatoes", "potatoes", "smashed potatoes", "The Food Lab", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Crispy Smashed Potatoes", "link": "https://www.seriouseats.com/recipes/2012/11/crispy-smashed-potatoes-recipe.html", "description": "My favorite way to cook potatoes: boiled, smashed, then shallow-fried until golden brown and crisp. They get unbelievably crispy with a great creamy center.", "totalTime": "1 hour", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Christmas", "Deep Frying", "Potato", "Sides", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["4 pounds small red or Yukon gold potatoes", "Kosher salt", "1 cup vegetable oil (see note)", "Freshly ground black pepper", "1/4 cup sliced chives, parsley, or tarragon (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a large pot and cover with cold water. Season heavily with salt. Bring to a boil over high heat and cook until potatoes are completely tender, about 10 minutes after a boil is achieved (poke a potato with a sharp knife or cake tester to test for doneness).Drain in a colander set in the sink and let rest for 10 minutes to dry and cool slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one potato at a time, place potato on cutting board and smash firmly with the bottom of a heavy skillet to a thickness of about 1/2-inch thick. Transfer to a large plate or tray as you work.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/2 cup oil in a large non-stick or cast iron skillet over medium heat until shimmering. Add as many potatoes as will fit in a single layer. Cook, shaking pan occasionally, until bottom side is deep golden brown, about 6 minutes. Carefully flip with a thin metal spatula and cook until second side is golden brown and crisp, about five minutes longer. Transfer to a paper towel-lined plate and allow to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking potatoes in batches, adding more oil or fat as necessary, until all potatoes are cooked. Potatoes can then be left aside until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, adjust oven racks to upper- and lower-middle positions and preheat oven to 400°F. Spread potatoes over to large rimmed baking sheets. Transfer to oven and cook until heated through, about 6 minutes. Transfer to a large bowl, season to taste with salt and pepper, add herbs (if using), toss to distribute, transfer to a serving platter, and serve.</p>"}]}