{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121106-veg-chilaquiles-plated-primary.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "Mexican", "keywords": ["black beans", "chilaquiles", "cinco de mayo", "Mexican", "sweet potatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sweet Potato and Black Bean Chilaquiles", "link": "https://www.seriouseats.com/recipes/2012/11/sweet-potato-and-black-bean-chilaquiles-recipe.html", "description": "This Mexican \"lasagna\" has a mix of roasted sweet potatoes, black beans and green onions that is sweet and subtly spicy.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves  6 to 8", "recipeCategory": ["Beans and Pulses", "Mains", "Mexican", "Sweet Potatoes and Yams", "Vegetarian"], "recipeIngredient": ["2 large or 3 medium tomatoes, cut into large pieces (about 3 cups)", "1 large onion, peeled and cut into quarters (about 1 1/2 cups)", "2 jalapeño peppers, stem removed, cut in half lengthwise", "6 tablespoons vegetable oil, divided", "Kosher salt", "2 large or 3 medium sweet potatoes, peeled and cut into a small dice (about 3 cups)", "1 teaspoon ground cumin", "1 teaspoon chili powder", "1/2 teaspoon ground coriander ", "2 medium garlic cloves, crushed", "1 canned chile en adobo, finely chopped (about 1 tablespoon chili and sauce)", "1 tablespoon red wine vinegar", "15 small corn tortillas", "2 (15 ounce) cans black beans, rinsed and drained", "4 green onions, white and green parts, thinly sliced", "1 cup shredded cheddar cheese", "1 cup shredded Monterey Jack cheese", "1 avocado, pit removed, sliced", "1 lime, cut into wedges", "Sour cream, for serving", "Chopped cilantro, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle positions and preheat oven to 425&deg;F. Combine tomatoes, onion, and jalapeños in a large bowl. Drizzle with 2 tablespoons vegetable oil and sprinkle with salt to taste. Toss to coat, then turn into an oven-safe dish. Roast on upper rack until tomatoes are soft and juicy and onions and peppers begin to brown, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, use the same large bowl to toss the sweet potatoes with 2 tablespoons oil, cumin, chile powder, coriander, and salt to taste. Turn potatoes onto a rimmed baking sheet and roast on lower rack, stirring occasionally, until soft and well-browned, about 20 minutes. Remove all vegetables from oven and lower heat to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, blend roasted tomatoes, onions, and jalapeños and their liquid, garlic cloves until smooth. Add chipotle, vinegar and salt to taste and blend again. Check for seasoning, adding more vinegar or salt as needed. Set salsa aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread tortillas out in a single layer over several large baking sheets. Brush both sides with vegetable oil and transfer to two rimmed baking sheets. Bake, turning once, until crisp and slightly browned, about 15 minutes. Remove from oven and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble the chilaquiles: in the bottom of a large glass lasagna pan, spread a thin layer of salsa. Break 5 tortillas into large pieces and distribute over salsa. Sprinkle half the sweet potatoes, half the black beans and half the green onions over tortillas. Pour half of remaining salsa over vegetables, then sprinkle with one third of the cheese. Repeat with 5 more tortillas, rest of vegetables, rest of salsa, and one more third of cheese. Finish with a top layer of 5 more tortillas and the rest of the shredded cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a large rectangular piece of aluminum foil with nonstick cooking spray and cover baking dish tightly. Place dish in oven and bake until chilaquiles are hot and cheese has melted, about 25 minutes. Remove foil and bake until top layer of cheese is nicely browned, about 15 minutes longer. Remove from oven and let rest 15 minutes before cutting into 6 to 8 pieces. Serve with sour cream, avocado, cilantro and lime.</p>"}]}