{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120430-127677-Sandwiched-Pork-Romesco-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Spanish", "keywords": ["piquillo peppers", "pork", "pork sandwiches", "romesco", "sandwich", "sandwiched", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Sandwich with Romesco Sauce", "link": "https://www.seriouseats.com/recipes/2012/04/pork-and-romesco-sauce-sandwiched.html", "description": "About the author: María del Mar Sacasa is a recipe developer, food stylist, and author of the food blog High Heels &amp; Frijoles. Behind her girly façade lurks a truck driver's appetite. Read about her cravings and suffer through her...", "totalTime": "1 hour, 45 minutes", "recipeYield": "makes 4 sandwiches", "recipeCategory": ["Pork", "Sandwiches", "Spanish"], "recipeIngredient": ["<strong>For the Romesco</strong>    ", "1 dry ancho chili", "3 strips thick-cut bacon, chopped", "3/4 cup drained canned or jarred piquillo peppers ", "3/4 cup drained and crushed canned plum tomatoes", "1 medium yellow onion, peeled and thinly sliced (about 1 cup)", "4 large garlic cloves, peeled and smashed", "6 tablespoons olive oil", "1/2 teaspoon smoked paprika", "Kosher salt and freshly ground black pepper", "1 slice hearty white bread, torn into pieces", "1/3 cup toasted slivered almonds or toasted skinned hazelnuts", "2 tablespoons sherry vinegar", "&nbsp", "<strong>For the Pork</strong> ", "2 tablespoons olive oil", "1 (1 1/2 -pound) pork tenderloin, cut crosswise into 1 inch-thick medallions", "Kosher salt and freshly ground black pepper", "1 1/2 teaspoons smoked paprika", "2 cups packed arugula", "&nbsp", "<strong>For the Assembly</strong> ", "4 (6-inch long) crusty rolls, such as ciabatta", "1/4 cup mayonnaise (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Romesco:</strong> Place the chili in a bowl and add enough boiling water to cover. If necessary, weigh the chili down with a second bowl or other object to keep it submerged. Soak chili for 30 minutes, then pat dry, remove stem and seeds, and coarsely chop.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper-middle position and preheat oven to 425&deg;F. Line a large rimmed baking sheet with foil. Toss chili, bacon, peppers, tomatoes, onion, garlic, 1/4 cup olive oil, and smoked paprika together in prepared baking sheet; season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast until onions are softened and slightly charred, 30 to 40 minutes, tossing mixture halfway through cooking. Transfer to cooling rack and cool 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse bread in food processor until it breaks down into crumbs. Add pepper mixture, nuts, vinegar, and remaining 2 tablespoons olive oil. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Romesco may be made 1 week in advance and refrigerated in an airtight container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pork:</strong> Heat 1 tablespoon oil in large skillet over medium-high heat until just beginning to smoke. Pat pork dry with paper towels and season with salt and pepper. Rub all over with smoked paprika.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pork until browned on both sides, 3 to 4 minutes per side. Transfer to large bowl. Using 2 fork, shred pork into bite-sized pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 1 tablespoon oil in now empty skillet over medium-high heat. Add pork and cook until crisp and golden, stirring occasionally, about 5 minutes. Stir in arugula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Assembly:</strong> Slice rolls in half and spread the inside of the top piece with 1 tablespoon mayonnaise. Spread a heaping 1/4 cup romesco on bottom half of each roll. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Distribute pork evenly among romesco-spread bread pieces, top with mayo-spread bread pieces and serve.</p>"}]}