{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120326-fiaf-lamb-meatball-tagine-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Moroccan/North African", "keywords": ["French in a Flash", "lamb", "meatballs", "Moroccan", "stews", "tagine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Moroccan Lamb Meatball Tagine", "link": "https://www.seriouseats.com/recipes/2012/03/moroccan-lamb-meatball-tagine-recipe.html", "description": "Tender lamb meatballs are stewed with shallots, cilantro, mint, carrots, golden raisins, and ras-el-hanout, full of spicy, hot, smoky, sweet Moroccan flavor. Comforting, but unfamiliar and delicious.", "totalTime": "50 minutes", "recipeYield": "serves 4", "recipeCategory": ["French", "Lamb", "Mains", "Moroccan/North African"], "recipeIngredient": ["1/2 cup fresh breadcrumbs", "1/4 cup milk", "1/2 egg (beat one whole egg and use half)", "1 shallot, finely minced (about 2 tablespoons), and 4 shallots, sliced (about 1/2 cup)", "1 tablespoon chopped fresh mint, plus 10 leaves, roughly chopped", "2 tablespoons chopped fresh cilantro, plus 1/4 cup, roughly chopped", "3 teaspoons ras el hanout, divided", "1/4 teaspoon piment d’Espelette or cayenne", "Sea salt", "Freshly cracked black pepper", "1 pound ground lamb", "2 tablespoons flour", "2 tablespoons olive oil, divided", "2 medium cloves garlic, chopped (about 2 teasopons)", "1 medium carrot, peeled and thinly sliced on a bias (about 1/2 cup)", "1 tablespoons tomato paste", "1 (28-ounce) can whole tomatoes, drained", "1 1/2 cups canned or homemade low-sodium beef broth", "2 tablespoons golden raisins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. In a large bowl, stir together the breadcrumbs and milk until the milk is absorbed into the bread. Add the egg. Add 1 shallot, finely minced, 1 tablespoon chopped mint, 2 tablespoons chopped cilantro, 1 1/2 teaspoons ras el hanout, the piment d’Espelette, and season with salt and pepper. Stir together until combined. Add the lamb, and gently toss together until evenly mixed. Divide the mixture into 8 meatballs. Place the meatballs on a plate with the flour, and dust on all sides. Reserve the excess flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saute pan, heat 1 tablespoon olive oil over medium to medium-high heat until the oil shimmers. Add the floured meatballs into the hot oil and brown on all sides, about 5 minutes total. Set the meatballs aside, and lower the heat. Add the shallots, season with salt and pepper, and sauté on medium-low for until soft, about 10 minutes, stirring frequently. Add the garlic and carrot, and stir in the hot pan until you smell the garlic, about 30 seconds. Add the reserved flour, and toss to coat the vegetables in the flour. Add the tomato paste, the drained tomatoes, the beef broth, the remaining 1 1/2 teaspoons of ras el hanout, and the raisins. Stir to combine, breaking up the whole tomatoes. Bring the liquid to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the meatballs back into the stew, and top with the remaining mint, cilantro, and olive oil. Place a lid on the pot, and bake in the oven for 30 minutes. After half an hour, place the pot over medium heat, and boil until the sauce is very thick, 2 to 5 minutes. Serve with couscous tossed in Meyer lemon olive oil, or just serve with baguette.</p>"}]}