{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121015RoastedBeetSoup-edit.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["beets", "creme fraiche", "French in a Flash", "soup", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Beet Soup with Thyme, Lemon, and Crème Fraîche", "link": "https://www.seriouseats.com/recipes/2012/10/roasted-beet-soup-thyme-lemon-creme-fraiche-french-in-a-flash-recipe.html", "description": "This simple, hearty, healthy, and delicious soup is made from roasted beets, sweet leeks, woodsy thyme, vegetable broth, and a squirt of lemon. Thick, hot, and autumnal, it's best topped with a creamy dollop of crème fraîche.", "totalTime": "50 minutes", "recipeYield": "serves 4", "recipeCategory": ["French", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["5 medium beets (about 2 pounds), peeled and cut into 1 1/2-inch dice", "3 teaspoons olive oil, divided", "Kosher salt and freshly ground black pepper", "1 small leek, white and light green parts sliced (about 1 cup)", "2 teaspoons picked fresh thyme leaves, plus more for garnish", "4 cups low sodium home-made or store-bought vegetable or chicken broth", "1 tablespoon juice from 1 lemon", "1/4 cup crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat the oven to 400&deg;F.  In a large bowl, toss beets with 1 tablespoon olive oil and season with salt and pepper. Transfer to a parchment-lined rimmed baking sheet. Roast until tender to the point of a knife, 30 to 45 minutes. Set aside 1/2 cup beets and cut into 1/2-inch dice for garnish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 2 tablespoons olive oil to a large saucepan. Add the sliced leeks and thyme, and season with salt and pepper. Set heat to medium-low and cook, stirring frequently, until leeks are tender but not browned, about 5 minutes. Add the roasted beets and broth and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Purée soup using an immersion blender or a standing blender, then stir in lemon juice. Season to taste with more salt and pepper as necessary. Serve immediately with a dollop of crème fraîche, garnished with cubed beet and extra thyme leaves.</p>"}]}