{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120522-fiaf-scallops-mornay-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French in a Flash", "gratins", "mornay", "mushrooms", "quick", "scallops", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Creamy Broiled Scallops Mornay", "link": "https://www.seriouseats.com/recipes/2012/05/creamy-broiled-scallops-mornay-recipe.html", "description": "Sweet, tender bay scallops and baby Paris mushrooms get broiled under a simple, homey blanket of Gruyère-infused béchamel. Decadent!", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["French", "Mains", "Mushrooms", "Other Seafood"], "recipeIngredient": ["1 teaspoon olive oil", "6 ounces white button mushrooms", "1 tablespoon unsalted butter", "1 tablespoon unbleached all purpose flour", "1 cup whole milk", "Small pinch piment d’Espelette or cayenne pepper", "Small pinch freshly grated nutmeg", "5 tablespoons grated Gruyère, divided", "12 ounces bay scallops", "Kosher salt and freshly ground black pepper", "2 tablespoons chopped fresh parsley leaves", "Lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange rack 6 inches from broiler element and preheat broiler to high. Heat olive oil in a small nonstick skillet over medium-high heat until shimmering. Add mushrooms. Cook, stirring often, until the mushrooms are golden brown but not quite cooked through, about 5 minutes. Transfer mushrooms to a small plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter to now-empty skillet and melt over low heat. Whisk in the flour, and cook until pale golden brown, about one minute. Add the milk in a thin steady stream while whisking. Continue whisking with the pan over medium heat until the mixture is thick enough to coat the back of a spoon, and when you run your finger down the back of that spoon, the mixture stays separated, about 5 minutes. Remove from heat, add piment d'Espelette or cayenne, nutmeg, and 3 tablespoons Gruyère and whisk to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil two small but wide ovensafe dishes. Mix the scallops and the mushrooms together, half of each in each dish, and season with salt and pepper. Spread in an even layer across each dish. Pour half of the Mornay sauce over each dish, and top with a tablespoon or so of extra grated Gruyère. Broil for until browned and bubbling and scallops are cooked through, 8 to 10 minutes. Remove from oven, allow to cool slightly, sprinkle with parsley, and serve with lemon wedges.</p>"}]}