{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120127-188620-bonbons-610x458-18.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["bonbons", "candy", "chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Boozy Caramel Bonbons", "link": "https://www.seriouseats.com/recipes/2012/02/caramel-bonbon-chocolate-candy-recipe.html", "description": "These bonbons are made with 58% couverture chocolate and filled with a boozy, vanilla caramel that runs when you bite into it. A tiny pinch of sea salt makes all of the flavors sing.", "totalTime": "4 hours", "recipeYield": "Makes 20 bonbons", "recipeCategory": ["Candy", "Chocolate", "Desserts"], "recipeIngredient": ["6.9 ounces granulated sugar", "2 ounces water", "2 ounces light corn syrup", "5 ounces heavy cream", "2 tablespoons butter", "seeds scraped from 1/2 vanilla bean", "1/2 teaspoon salt", "2 tablespoons rum, whiskey, or bourbon", "colored cocoa butter (optional)", "16 ounces 58% couverture chocolate", "sea salt for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan with a heavy bottom, combine the sugar, water, and corn syrup and stir. Wash down the sides with a pastry brush dipped in clean water, then place over medium-high heat for 7-10 minutes, at which point the mixture will begin to darken. Swirl the pot to even out the caramelization, and allow the caramel to turn deep amber. Then, stand back and slowly add the cream (the mixture will sputter, rise in the pot, and spit; be very careful) and turn off the heat. Once it is safe, whisk in the heavy cream, until smooth. Whisk in the butter until it melts completely. Whisk in the vanilla seeds, booze, and salt and allow the mixture to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the chocolate into very small pieces and divide the chocolate evenly into one very large bowl and one small bowl (the large bowl is the bowl that you will melt the chocolate in, the small one contains the \"seed\" chocolate for tempering). Set a pot of water to boil on the stove. When the water is boiling, turn off the heat and place the large bowl of chocolate over the water. Temper the chocolate (for a full tutorial, click <a href=\"http://sweets.seriouseats.com/2010/03/how-to-temper-chocolate.html\">here</a>) by stirring to bring to chocolate to 115&deg;F. Then, begin adding the reserved chocolate a little at a time and vigorously stirring the mixture, without stopping. Continue to add the reserved seed chocolate and agitating until the chocolate comes down to 90&deg;F. The chocolate is now tempered. Check to be sure that there are no solid pieces of chocolate left in the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wave the mold over a flame on the stove or place it in a warm oven for just a moment to warm it up slightly (this will help the chocolate flow over it, rather than seizing up immediately when it hits the mold, which prevents air bubbles from forming). Then pour the chocolate into each of the cavities in the mold. Allow it to stand for 10 seconds, then invert the mold over the bowl, allowing the excess chocolate to run off. Tap the mold to shake out additional excess, then turn the mold back over. With a flexible metal scraper, scrape over the top, cleaning off any excess chocolate on the sides. Place the mold in the fridge for 2-3 minutes, then remove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle a pinch of sea salt into each of the shells.  Using a piping bag fitted with a small tip or a cone of parchment, pipe the cooled caramel into the shells, stopping a 3-4 millimeters below the edge (it's very important to leave room, otherwise the chocolates will not seal). Ensure that the chocolate is still tempered (if it is not, you will need to bring it back to 115°F once again, then down to 90°F, otherwise, your bonbons will be streaky on the bottom). Pipe or pour chocolate over the tops of each bonbon. Scrape the top clean to create a seal, then place the mold in the fridge for 2-3 minutes and remove. Twist the mold to release the chocolates, then turn it upside down and tap them out of the mold. Clear the work surface of bonbons, and pound the mold against the counter to release any stragglers. Store the chocolates in a cool, dry place.</p>"}]}