{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121206-232089-cook-the-book-duck-breast-garam-masala-grapes.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Adam Roberts", "Cook the Book", "duck", "grapes", "melissa clark", "poultry", "Secrets of the Best Chefs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Melissa Clark's Seared Duck Breast with Garam Masala and Grapes", "link": "https://www.seriouseats.com/recipes/2012/12/melissa-clarks-seared-duck-breast-with-garam-masala-and-grapes-recipe.html", "description": "It'd be a shame to pass over a described as a \"masterpiece.\" Full stop. In <em><a href=\"http://www.amazon.com/Secrets-Best-Chefs-Techniques-Americas/dp/1579654398/?tag=serieats-20\">Secrets of the Best Chefs</a></em>, <strong><a href=\"http://www.amateurgourmet.com/about\">Adam Roberts</a></strong> is totally enamored of <strong><a href=\"http://www.melissaclark.net/\">Melissa Clark's</a></strong> recipe development process. And his adoration is most evident in his headnote to Clark's recipe for <strong>Seared Duck Breast with Garam Masala and Grapes</strong>. It's a relatively simple recipe (duck breast gets an hour-long rest with garam masala and salt before being seared, finished in the oven, and topped with a pan sauce of grapes, cinnamon, and balsamic vinegar) with show-stopping results.", "totalTime": "1 1/2 hours", "recipeYield": "serves 2 to 4", "recipeCategory": ["Cook the Book", "Duck", "Grapes", "Mains", "Other Meats"], "recipeIngredient": ["1 whole duck breast (approximately 2 pounds)", "3/4 tablespoon kosher salt", "1 teaspoon pepper", "1 teaspoon garam masala", "2 tablespoons unsalted butter", "1 cup red seedless grapes, sliced in half", "1 teaspoon ground cinnamon", "1/4 cup balsamic vinegar ", "1 teaspoon honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a paring knife, score the duck breast by cutting a crosshatch pattern into the fat. Make sure you cut all the way through the fat but not through the meat itself. The point is to expose as much of the fat’s surface area to the heat as possible so it renders quickly. Season the duck on both sides with the salt, pepper, and garam masala. Let sit, at room temperature, for 45 to 60 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350˚F. Heat an ovenproof skillet (do not use nonstick) on medium-high heat for a minute or two.  Place the duck in the skillet, fat side down (it should immediately sizzle), and don’t touch it. Let it cook like this for 4 minutes. Lots of fat will melt out—that’s a good thing. Use tongs to turn the meat over. The skin should be a deep, chestnut brown and the fat should almost all be melted away. If you still see white, continue cooking on the fat side until it’s gone (but without letting the skin burn).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the skillet in the oven. Cook for 3 to 4 minutes and then take the temperature of the duck breast. It should be 120˚F for rare and 130˚F for medium rare (shoot for 125°F). Remove the duck to a cutting board to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off the duck fat for another use (it’s great for frying potatoes). In that same skillet, melt the butter on medium heat. Add the grapes and cinnamon and stir for a minute. Deglaze with the balsamic vinegar and honey, stirring and cooking until the sauce is syrupy, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice the duck, on the bias, and fan it out on a platter. Spoon the grape sauce on top and serve.</p>"}]}