{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120506-asparagus-pasta-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "pasta", "quick", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemony Pasta With Asparagus and Bacon", "link": "https://www.seriouseats.com/recipes/2012/05/lemony-pasta-with-asparagus-and-bacon-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science of home cooking in his weekly column The Food Lab. You can follow him at...", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Mains", "Pasta", "The Food Lab"], "recipeIngredient": ["1 1/2 pounds asparagus, ends trimmed, stalks and tips cut into 1-inch segments", "Kosher salt", "1/4 pound bacon, finely sliced", "8 scallions, finely sliced, whites and greens reserved separately", "1 pound fettucine or other noodle-shaped pasta", "1 tablespoon juice and 1 teaspoon zest from 1 lemon", "1 jalapeño pepper, seeded and cored, finely minced", "3 tablespoons unsalted butter", "3 tablespoons finely minced fresh parsley leaves", "Freshly ground black pepper", "1/2 cup finely grated Parmigiano Reggiano or Pecorino Romano, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add asparagus and cook until just tender but still bright green, about 2 minutes. Transfer to an ice bath to chill. Dry carefully and set aside. Keep water on stove for pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon to a large saucepan or dutch oven and set over medium-high heat. Cook, stirring frequently, until bacon is crisp and rendered, about 5 minutes. Add asparagus, increase heat to high, and cook, tossing and stirring frequently until lightly browned, about 2 minutes. Add scallion whites and cook, stirring constantly, until fragrant, about 30 seconds. Remove from heat and add 1 cup asparagus cooking water to the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the asparagus water to a boil and add the pasta. Cook according to package instructions until al dente. Drain, reserving 1 cup pasta water, and add to pot with bacon and asparagus. Do not return pot to heat. Add lemon juice and zest, jalapeño, butter, parsley, scallion greens, and plenty of black pepper. Stir until butter is melted. Add grated cheese and extra pasta water, stirring untili desired consistency is reached. Season to taste with salt and more pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, garnishing with shaved Parmigiano Reggiano.</p>"}]}