{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121017-226089-cook-the-book-kachin-pounded-beef.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Asian", "keywords": ["beef", "burma: rivers of flavor", "Burmese", "chiles", "Cook the Book", "Naomi Duguid", "sichuan peppercorns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.3333333333333", "ratingCount": "3"}, "name": "Naomi Duguid's Kachin Pounded Beef with Herbs", "link": "https://www.seriouseats.com/recipes/2012/10/naomi-duguids-kachin-pounded-beef-with-herbs.html", "description": "She doesn't mention it in the recipe headnote, but <strong><a href=\"http://naomiduguid.com/#_\">Naomi Duguid's</a></strong> <strong>Kachin Pounded Beef with Herbs</strong> in her <em><a href=\"http://www.amazon.com/Burma-Rivers-Flavor-Naomi-Duguid/dp/1579654134/?tag=serieats-20\">Burma</a></em> must be a kissing cousin to Laos and Thailand's <a href=\"http://en.wikipedia.org/wiki/Larb\">laab</a>. Instead of hand-chopped meat that is tossed with spices, however, this Burmese version is pounded in a mortar and pestle, grinding the aromatics into gently simmered beef. The result is a meltingly tender bowl of fragrant beef with a texture akin to rillettes but with the taste of Southeast Asia.", "totalTime": "40 to 50 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asian", "Beef", "Cook the Book", "Gluten-Free", "Mains", "Sides"], "recipeIngredient": ["<strong>Beef</strong>", "About 1 cup water", "1 to 1 1/4 pounds stewing beef or boneless beef shoulder, trimmed of fat and cut into approximately 1-inch cubes", "1 teaspoon ground Sichuan pepper ", "1 scant tablespoon peanut oil or vegetable oil", " ", "<strong>Flavor Paste</strong>", "1 tablespoon chopped ginger", "2 teaspoons chopped garlic ", "2 dried red chiles, stemmed", "1 teaspoon lightly toasted Sichuan peppercorns ", "1 1/2 teaspoons salt", "1/2 cup loosely packed Vietnamese coriander, coarsely torn or chopped, or substitute coriander leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the beef:</strong> Pour 1/2 inch of water into a wok or wide pot, add the beef and Sichuan pepper, and bring to a boil. Cook at a low boil until the meat is tender, 20 to 30 minutes, decreasing the heat gradually as the water evaporates. There should be very little liquid left. Remove from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a heavy skillet or a wok over medium heat, add the oil, and tilt the pan to coat the cooking surface. Add the meat and cook, turning occasionally, until all surfaces have changed color a little, about 6 minutes. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the flavor paste:</strong> If you have a large mortar, combine the ginger, garlic, dried chiles, Sichuan peppercorns, and salt and pound and grind to a paste. Add the coriander and pound to incorporate it. Add the meat and pound to blend the flavor paste thoroughly into the meat. (If your mortar is too small to accommodate all the meat at once, remove half the paste and then work with half the meat and half the flavor paste at a time.) The meat will soften and break down but should not be completely pulverized. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternatively, mince the ginger and garlic very fine and set aside in a small bowl. Use a spice grinder or coffee grinder to reduce the dried chiles and Sichuan peppercorns to a powder. Stir the powder into the garlic and ginger, then add the salt and use the back of the spoon to blend them together. Chop the coriander fine and blend into the flavor paste. Place the meat in a wide bowl, add the flavor paste, and use a wooden mallet or a wide wooden spatula to press and pound the flavoring into the meat. Serve at room temperature.</p>"}]}