{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/201203018-196105-knead-the-book-county-fair-white-primary.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads", "Kneadlessly Simple", "white breads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kneadlessly Simple's County Fair White Bread", "link": "https://www.seriouseats.com/recipes/2012/03/kneadlessly-simples-county-fair-white-bread.html", "description": "[Photograph: Donna Currie] Adapted from Kneadlessly Simple by Nancy Baggett. Copyright © 2009. Published by Wiley. Available wherever books are sold. All Rights Reserved...", "totalTime": "up to 3 days, depending in rising method", "recipeYield": "Makes 1 large loaf, 12 to 14 slices", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["3 cups (15 ounces) unbleached white bread flour, plus 2⁄3 cup (3.33 ounces) or as needed", "2 1⁄2 tablespoons granulated sugar", "1 1⁄2 teaspoons table salt", "3⁄4 teaspoon instant, fast-rising, or bread machine yeast", "3⁄4 cups ice water, plus more if needed", "3 tablespoons unsalted butter, melted and slightly cooled, plus extra for coating dough top and baking pan", "1⁄4 cup good-quality instant nonfat dry milk (don’t use a generic brand)", "1 large egg, at room temperature and beaten with a fork"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>FIRST RISE: In a large bowl, thoroughly stir together 3 cups of the flour, the sugar, salt, and yeast. Thoroughly stir the water into the bowl, scraping down the sides and mixing just until the ingredients are thoroughly blended. If the mixture is too dry to incorporate all the flour, a bit at a time, stir in enough more water to blend the ingredients and produce a fairly soft dough. Brush the top with butter. Cover the bowl with plastic wrap. If desired, for best flavor or for convenience, you can refrigerate the dough for 3 to 10 hours. Then, let rise at cool room temperature for 16 to 20 hours; if convenient, vigorously stir the dough about halfway through the rise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>SECOND RISE: In a medium bowl, stir together the butter, milk powder, and 2 tablespoons of the beaten egg until thoroughly blended; reserve the remaining egg for glazing the loaf top. Vigorously stir (or beat on low speed with a heavy-duty mixer with a dough hook) the butter mixture into the dough until smoothly and evenly incorporated; this may take several minutes. Gradually mix in O cup or enough more flour to yield a very hard-to-stir dough. Using a well-oiled rubber spatula, fold the dough in towards the center, working all the way around the bowl; this helps organize the gluten for shaping into a loaf.</p>\n\n<p>Invert the dough into a well-greased 9x5-inch loaf pan. Smooth out the top and press evenly into the pan using a well-buttered rubber spatula or fingertips. Evenly brush the loaf top with the reserved beaten egg; don’t allow the egg to pool around the pan edges, as it will cause sticking. Using well-buttered kitchen shears or a serrated knife, make a H-inch-deep slash lengthwise down the center of the loaf. Cover the pan with nonstick spray–coated plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>LET RISE USING ANY OF THESE METHODS: For a 1 1/2- to 2 1/2-hour regular rise, let stand at warm room temperature; for a 1- to 2-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water; or for an extended rise, refrigerate for 4 to 48 hours, then set out at room temperature. Continue the rise until the dough nears the plastic. Remove it and continue until the dough extends slightly above the pan rim.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>BAKING PRELIMINARIES: 15 minutes before baking time, place a rack in the lower third of the oven; preheat to 375ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>BAKING: Bake on the lower rack for 40 to 50 minutes, or until the top is nicely browned. Cover the top with foil and continue baking for 10 to 15 minutes longer, until a skewer inserted in the thickest part comes out with just a few particles clinging to the bottom (or until the center registers 208º to 210ºF on an instant-read thermometer). Then bake for 5 to 10 minutes more to be sure the center is done. Cool in the pan on a wire rack for 10 minutes. Turn out the loaf onto the rack; cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>SERVING AND STORING: Cool thoroughly before slicing or storing. Store airtight in plastic or aluminum foil. The bread will keep at room temperature for 2 to 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}