{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120219oyakodonlow610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "Japanese", "keywords": ["chicken", "egg", "Japanese", "rice", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oyakodon", "link": "https://www.seriouseats.com/recipes/2012/02/oyakodon-japanese-egg-dish-recipe.html", "description": "This isn't the most traditional recipe for oyakodon in that I just can't resist slightly caramelizing the onions. I also use leftover chicken, the small scraggly bits of dark meat pulled off a chicken carcass are my favorites. Upgrade the water to homemade dashi or chicken stock if you're feeling fancy, but I proudly endorse powdered kombu dashi.", "totalTime": null, "recipeYield": "serves 1", "recipeCategory": ["Breakfast and Brunch", "Chicken", "Eggs", "Japanese", "Rice"], "recipeIngredient": ["1 tablespoon neutral flavored oil", "1 small onion, sliced thinly ", "1 tablespoon sugar", "2 tablespoons soy sauce", "5 grams (one packet) kombu dashi powder", "3/4 cup water", "1/2 cup cooked chicken, shredded", "2 eggs", "Optional: toasted nori", "1 cup cooked Japanese rice, hot"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, add the oil and saute the onions over medium low heat until they wilt and begin to take on a pale golden color, about ten minutes. You do not want any significant browning or charred bits, just a touch of color.</p>\n\n<p>Add in the sugar, soy sauce, dashi powder and water. Turn the heat up to medium and wait for it to bubble vigorously. Meanwhile, crack the eggs together in a small bowl and beat with a fork until homogenous. </p>\n\n<p>When the mixture begins to bubble hard, add the shredded chicken to the coolest section of the pan (usually in the center) and pour the eggs all at once into the hottest section (around the edges). Let the eggs cook, without stirring, until fully set; about 45 seconds. Shut off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the rice into the bottom of an oversized bowl and use a slotted spoon to top it with the eggy, onion chicken mixture. Carefully pour the remaining broth into the bottom of the bowl, but not over the rice. (Pouring the broth over the top soaks the rice and prevents it from clumping together, leaving you with a bowl rebellious, individual grains.)</p>\n\n<p>Top with torn bits of toasted nori, if you like. Eat with a spoon.</p>"}]}