{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120726-216194-dinner-tonight-squash-blossom-and-bacon-quesadilla-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["Dinner Tonight", "Mexican", "quesadilla", "squash blossoms"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Squash Blossom Quesadillas with Bacon and Tomatoes", "link": "https://www.seriouseats.com/recipes/2012/07/squash-blossom-quesadillas.html", "description": "Squash blossoms are the only flowers I genuinely love cooking, probably because they can take the abuse. But while they don't have to be treated like dainty little treats, you also wouldn't want to completely cover up their flavor. Making a squash blossom quesadilla requires some restraint.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dinner Tonight", "Mains", "Mexican", "Sandwiches"], "recipeIngredient": ["4 slices thick-cut bacon, cut into 1-inch pieces", "1/2 medium white onion, diced (about 3/4 cups)", "1 jalapeño, stemmed, seeded, and diced ", "Kosher salt ", "1 medium clove garlic, minced (about 1 teaspoon)", "20 squash blossoms, stems and stamens removed, rinsed under cold water, roughly chopped", "8 ounces cherry tomatoes, chopped", "Handful of cilantro leaves, chopped  ", "4 (10-inch) flour tortillas", "3/4 cup grated Oaxacan or Monterrey Jack cheese ", "1 lime, cut into 4 wedges "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the bacon in a large 12-inch cast-iron skillet over medium heat, stirring occasionally, until crispy, about 6 minutes. Remove the bacon with a slotted spoon and drain on paper towels. Transfer bacon fat to a small bowl and return 1 tablespoon to the skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the heat still on medium, add the onion, jalapeño, and a pinch of salt. Cook, stirring occasionally, until the onion is translucent, about four minutes. Add the garlic, stir well, and cook until fragrant, about 30 seconds. Add squash blossoms and tomatoes to skillet. Cook, stirring occasionally, until the flowers are tender, five to eight minutes. When done, turn off the heat, stir in the cilantro, and crumble in bacon. If necessary, season with more salt. Scrape the mixture into a medium-sized bowl and wipe out skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a quarter of the filling on each of the flour tortillas, spreading it out so it is evenly distributed. Sprinkle a quarter of the cheese on each. Heat 1/2 tablespoon bacon fat in skillet over medium heat until shimmering. Add one tortilla, with the topping facing up. Cook for until tortilla is soft and cheese is just starting to melt, about 30 seconds fold the tortilla in half to form a half circle-shaped sandwiche. Continue to cook, turning occasionally, until cheese is melted and both sides are browned and crisp. Transfer to a cutting board and repeat with remaining quesadillas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each quesadilla into four wedges, and serve at once with lime wedges. </p>"}]}