{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120529-208396-toasted-coconut-panna-cotta.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "chocolate sauce", "coconut", "Kir Jensen", "panna cotta", "The Sugar Cube"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Toasted-Coconut Panna Cotta with Aunti Shirley's Chocolate Sauce", "link": "https://www.seriouseats.com/recipes/2012/06/kir-jensen-toasted-coconut-panna-cotta-recipe.html", "description": "These little treats are creamy, coconutty, and out of control tasty.", "totalTime": "30 minutes plus 3 hours chilling time", "recipeYield": "makes 8 servings", "recipeCategory": ["Bake the Book", "Coconut", "Desserts", "Puddings and Custards"], "recipeIngredient": ["1 heaping cup sweetened, shredded coconut (preferably Angel Flake)", "1/2 cup almonds", "3 cups unsweetened coconut milk (I use Chaokoh brand.)", "1 cup heavy cream ", "Scant 1/2 cup granulated sugar ", "1/4 teaspoon sea salt", "1 vanilla bean", "3 tablespoons cold water ", "2 teaspoons powdered unflavored gelatin ", "1/2 to 1 cup Aunti Shirley’s Chocolate Sauce (recipe follows)", "Fresh Whoop (recipe follows) ", "&nbsp;", "<strong>Aunti Shirley’s Chocolate Sauce</strong>", "3 tablespoons packed dark brown sugar", "1/4 teaspoon sea salt", "3 tablespoons Dutch process cocoa powder ", "1/2 cup heavy cream", "1/4 cup light corn syrup", "1 teaspoon unsalted butter", "&nbsp;", "<strong>Fresh Whoop</strong>", "1 cup cold heavy cream (preferably 40 percent fat)", "1 to 2 tablespoons granulated sugar or dark brown sugar", "1/2 teaspoon pure vanilla extract, or seeds scraped from 1/4 to 1/2 vanilla bean"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Panna Cotta:</strong> Preheat the oven to 350°F. Spread the coconut in an even layer on a rimmed baking sheet and toast, stirring occasionally, until most of the shreds are dark golden brown, 5 to 8 minutes. Transfer to a small bowl and let cool. Spread the almonds in an even layer on the baking sheet and toast until fragrant and beginning to color, 5 to 8 minutes. Remove from the oven and turn off the heat. Place eight 4-ounce ramekins or small serving glasses in the fridge. (Chilling the cups helps the panna cotta set faster.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the coconut milk, cream, sugar, salt, and 1 cup of the toasted coconut (reserve the rest for garnish). Split the piece of vanilla bean lengthwise and scrape the seeds with the back of a knife directly into the pan. Add the pod and gently bring to a slight simmer over medium heat, stirring occasionally (do not boil). <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cream is heating, pour the cold water into a small bowl and sprinkle the gelatin evenly over the top. Let stand (don’t stir) until the gelatin has absorbed the water, at least 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cream has begun to simmer, remove it from the heat and strain it through a fine-mesh sieve into a large measuring cup or bowl with a spout. Use a spatula to gently press the coconut against the sieve to force out all the liquid. Discard the solids and vanilla bean pod (or rinse,  dry, and save the pod for another use). Add the softened gelatin and whisk until incorporated. (You shouldn’t see any bits of solid gelatin.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the mixture equally among the chilled cups (do not cover with plastic wrap) and refrigerate until set, least 3 hours. (It should have the texture of a soft pudding.) Serve with 1 1/2 to 2 tablespoons chocolate sauce, a dollop of whoop and a sprinkling of toasted, chopped almonds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Sauce:</strong> In a small saucepan, combine the dark brown sugar, salt, and cocoa powder. Stir in enough heavy cream, a little at a time, to make a paste, and then stir in the remainder. Add the corn syrup and bring to a boil over medium-high heat, making sure to whisk continuously. Reduce the heat to a simmer and continue to cook, whisking continuously, for another 3 to 4 minutes to help cook out the bitter flavor from the cocoa and thicken the sauce. The sauce will be very glossy and take on a very dark hue (almost black).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To test if the sauce is thick enough, place a small dab of sauce on a clean plate and let stand for 1 minute. If the sauce spreads, keep simmering. You should be able to tip the plate without spilling the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once done, remove from heat and stir in the butter. Serve immediately over ice cream or let cool slightly before using. The sauce will keep in an airtight container in the refrigerator for up to 2 weeks. To reheat: Microwave at 50 percent power for about 30 seconds, or warm in a saucepan on low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fresh Whoop:</strong> In the bowl of a stand mixer fitted with a whisk attachment, combine the cream, sugar, and vanilla and beat on medium-high speed until medium-soft peaks form. (Alternatively you can whip the cream with a handheld mixer or by hand with a whisk, though it’ll take a longer.) If you want the peaks softer, whip less. If you want them sturdier, whip longer, but don’t overwhip or the cream will curdle and eventually turn into butter!<br />\n</p>"}]}