{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120904-220481-GFTues-HandPie-Recipes.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["apple", "desserts", "gluten free", "gluten free tuesdays", "hand pies", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Apple Hand Pies", "link": "https://www.seriouseats.com/recipes/2012/09/gluten-free-apple-hand-pie-recipe.html", "description": "Gluten-free apple hand pies with a tender, flaky crust.", "totalTime": "four hours", "recipeYield": "makes 12 pies", "recipeCategory": ["Apple", "Gluten-Free", "Gluten-Free Tuesday", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<em>For the Crust</em>", "2 cups (about 8 ounces) white rice flour", "3/4 cup (about 3 ounces) tapioca starch", "3 tablespoons granulated sugar", "1/2 teaspoon salt", "1/2 teaspoon xanthan gum", "2 sticks (4 ounces) cold, unsalted butter, cut into tablespoon-size pieces", "4 to 6 tablespoons water", " ", "<em>For the Filling</em>", "2 large apples, peeled, cored, and cut into 1/2-inch cubes", "3 tablespoons dark brown sugar", "2 tablespoons juice from 1 lemon", "1 teaspoon ground cinnamon", "2 tablespoons white rice flour", " ", "<em>For the Topping</em>", "1 large egg, beaten", "2 tablespoons granulated or coarse sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of food processor, combine white rice flour, tapioca starch, granulated sugar, salt, and xanthan gum. Pulse to combine. Add butter. Pulse until no large pieces of butter remain. Add 4 tablespoons water. Pulse until dough forms. If dough does not form, add two additional tablespoons water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly white rice flour your counter. Divide dough into two even balls and shape each into a disk. Wrap and chill dough for at least two hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375 &deg;F. While oven preheats, prepare filling. Toss together apple pieces, dark brown sugar, lemon juice, and cinnamon. If desired, add more sugar to taste. Toss apple mixture with white rice flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove one dough round from the refrigerator. Allow to stand for about five minutes. Lightly white rice flour countertop. Roll dough out to approximately 1/8-inch. While rolling, occasionally run a long, thin metal spatula under the dough to prevent it from sticking to the counter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the 3-inch cutter, cut dough into 6 pieces. (These will be the pie bases.) Gather dough and gently gather into a ball. Reroll. Now use the 3 1/3-inch cutter and cut out another 6 pieces. (These will be the pie tops.) Place the six 3-inch dough cut-outs on parchment-lined baking sheet. Top with approximately one tablespoon of apple filling. Brush edges with beaten egg. Cover filling with 3 1/2-inch dough round. If dough tears, lightly pinch it back together. Crimp edges together with fork. (To keep dough from sticking to the fork, dust it with white rice flour before crimping.) Chill pies for five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush pies with beaten egg and generously sprinkle with granulated or coarse sugar. Pierce top twice with fork to allow steam from the filling to escape. Bake until filling bubbles and crust is golden brown, about 25 minutes. While one pan of pies bakes, form second pan. Bake second pan of pies in the same manner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow pies to cool on baking sheet. Store, covered, at room temperature for up to three days. </p>"}]}