{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/191116-turkish-sigara-burek.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["burek", "cheese", "potato", "turkish", "turnovers", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato and Cheese Sigara Burek", "link": "https://www.seriouseats.com/recipes/2012/02/how-to-make-potato-and-cheese-sigara-recipe.html", "description": "[Photograph: Max Falkowitz] Consider this a template recipe for making Turkish burek, which come in all shape and filling combinations. Use high-starch russet potatoes for a creamy mash, and, if you can find it, young kasseri cheese (you can substitute...", "totalTime": "1 1/2 hours", "recipeYield": "Makes about 30 burek", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Potato", "Vegetarian"], "recipeIngredient": ["1/2 pound (2 sticks) butter", "1 1/2 pound russet potatoes (about 2 medium-large), peeled and diced into 1/2-inch cubes", "2 cloves garlic, peeled", "2 tablespoons sour cream", "8 ounces (2 cups) kasseri cheese, grated (see note)", "Salt to taste", "1 egg", "1 pound (about 30 sheets) triangular yufka (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Clarify butter</strong><br />\nIn a saucepan on low heat, slowly melt butter. Keep flame on low and cook until bubbling subsides, the butter darkens slightly in color, and browned milk solids sit on the bottom of the pot, about half an hour. You can refrigerate clarified butter for months, if not longer, or use it right away.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the filling</strong><br />\nPut potatoes and garlic in a large pot and add water to cover by 1 inch. Cover, bring to a boil, then uncover and reduce heat to medium. Cook until potatoes are very tender and fall apart when prodded with a paring knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain potatoes and transfer to a large mixing bowl. Add sour cream and half of the cheese, then mash until no large lumps remain. Stir in remaining cheese and add salt to taste. Fold in egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembly</strong><br />\nWarm clarified butter if it has begun to solidify. Brush a thin film on a sheet of yufka, then place 2 tablespoons of filling 1 inch away from the wide edge, spread out in a thin log to leave 1/2 inch space on either side. Fold over outer corners like a burrito, then roll burek up toward the point. Set on an aluminum baking sheet (not non-stick; the darker sheets heat up too quickly and scorch the bottoms).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all burek are rolled, brush with a thin film of more clarified butter. Reserve remaining butter for another use. Heat oven to 400&deg;F, with racks in upper and lower thirds. Bake burek for 10 to 15 minutes, then flip to a new side and swap baking sheet position in oven. Bake for an additional 10 to 15 minutes, or until burek are golden brown and flaky. Let cool 5 minutes before serving.</p>"}]}