{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120927-roasted-tomato-soup.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["soup", "tomato", "tomato soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Brown Sugar-Roasted Tomato Soup with Cheddar Croutons", "link": "https://www.seriouseats.com/recipes/2012/10/brown-sugar-roasted-tomato-soup-recipe.html", "description": "For this simple autumn soup, canned tomatoes get drained of their liquid, spread out on a roasting pan, and baked with brown sugar until they're bubbly, browned, and intensified in flavor. Rather than making the soup taste sweet, the brown sugar simply vanishes into the background, making the soup's flavor a lot more full and rounded. Taking a cue from the classic tomato-soup-and-grilled-cheese combo, the final product gets topped with crusty, cheesy cheddar croutons.", "totalTime": "1 hour 35 minutes", "recipeYield": "makes 2 quarts, serving 6", "recipeCategory": ["Soups and Stews", "Tomato", "Vegetarian"], "recipeIngredient": ["Nonstick cooking spray", "2 (28 ounce) cans whole peeled tomatoes, drained, liquid reserved", "Kosher salt and freshly ground black pepper", "3 tablespoons dark or light brown sugar", "Half a medium loaf of focaccia bread, cut into a 1/2\" dice (about 3 cups bread cubes)", "1 tablespoon extra virgin olive oil", "1/2 cup finely grated sharp cheddar cheese (use a Microplane grater)", "2 tablespoons unsalted butter (see note)", "4 large shallots, peeled and roughly chopped", "1 large or 2 medium garlic cloves, peeled and chopped (about 2 teaspoons)", "1 teaspoon chopped fresh thyme leaves (optional)", "1 tablespoon tomato paste", "About 3 cups water", "1/2 cup half and half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to middle positions and preheat oven to 375&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the tomatoes: spray a large rimmed sheet tray with an even coating of cooking spray. Add drained tomatoes and space evenly. Season tomatoes to taste with salt and pepper, then divide brown sugar over tops of tomatoes. Roast tomatoes in oven until sugar is browned and tomatoes have shrunken slightly, about 45 minutes. Remove tomatoes from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the croutons. In a large bowl, toss cubed bread with olive oil, salt and pepper to taste, and grated cheddar cheese. Massage bread so cheese adheres well. Turn out onto a rimmed baking sheet and bake, stirring occasionally, until well-browned and crisp, 10 to 12 minutes. Remove from oven and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the soup: Heat butter in a large, heavy-bottomed Dutch oven set over medium heat. Add shallots, garlic, and thyme (if using), and season with salt and pepper. Cook, stirring occasionally, until shallots are translucent but not browned, about 6 minutes. Add tomato paste and cook, stirring, until it browns, about 2 minutes. Add roasted tomatoes, reserved tomato liquid, and enough water to cover, about 3 cups. Bring soup to a boil, reduce to a simmer and cook, stirring occasionally, until some liquid has evaporated, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let soup cool slightly, about 10 minutes. Add half and half and use a hand blender to blend soup until smooth. Alternatively, blend soup in a blender in two batches. Check soup for seasoning, adding more salt and pepper to taste. Serve in bowls, garnished with a handful of croutons.</p>"}]}