{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120805-food-lab-grilled-chicken-24.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue", "barbecue chicken", "chicken", "grill", "grilled chicken", "grilling", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "The Best Barbecue Chicken", "link": "https://www.seriouseats.com/recipes/2012/08/the-best-barbecue-chicken-recipe.html", "description": "Smoky barbecue chicken with perfectly juicy meat and a sweet, sticky glaze.", "totalTime": "1 hour 15 minutes", "recipeYield": "serves about 6", "recipeCategory": ["Grilled Chicken", "Mains", "The Food Lab"], "recipeIngredient": ["1 whole large chicken, about 6 to 8 pounds", "1 tablespoon kosher salt", "1 tablespoon brown sugar", "1 teaspoon black pepper", "1 teaspoon chili powder", "1 teaspoon ground coriander seed", "2 medium cloves garlic, minced on a microplane grater", "2 cups <a href=\"http://www.seriouseats.com/recipes/2011/05/sauced-kansas-city-style-barbecue-sauce-recipe.html?ref=search\">Kansas City-style Barbecue Sauce</a>, or your favorite barbecue sauce", "2 chunks hardwood, soaked in water for 30 minutes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken dry with paper towels and place breast-side-down on a large cutting board. Using sharp kitchen shears, remove the backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten the chicken. For added stability, run a metal or wooden skewer horizontally, entering through one thigh, going through both breast halves, and exiting through the other thigh. Tuck wing tips behind back. Season generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine salt, brown sugar, black pepper, chili powder, coriander seed, and garlic in a small bowl and massage with fingertips until homogenous. Spread mixture evenly over all surfaces of chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. If using charcoal, place hardwood chunks directly on coal. If using gas, place on grate above lit burners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken skin side up over cooler side of grill with legs pointed towards hotter side. Close grill and cook until center of thickest part of chicken registers 120°F on an instant read thermometer, 35 to 45 minutes. Brush top of chicken with barbecue sauce. Cover and continue cooking for 5 minutes until sauce is beginning to dry. Brush with more sauce, cover, and continue to cook for until thickest part of breast registers 135°F on an instant read thermometer, about 5 minutes longer. Using tongs and a flexible metal spatula, carefully flip the bird and place it skin side-down directly over the coals. Brush back of chicken with more sauce. Continue to cook, covered, until brown, crisp, charred in spots, and thickest part of breast registers 150°F on an instant read thermometer, 7 to 10 minutes longer. If bird threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and cook until done. Remove from grill, let rest 10 minutes, carve, and serve.</p>"}]}