{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/201200907-223472-dinner-tonight-mushroms-tofu-fermented-black-beans-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Dinner Tonight", "quick", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Home-Style Tofu with Mushrooms, Spinach, and Fermented Black Beans", "link": "https://www.seriouseats.com/recipes/2012/09/home-style-tofu-mushrooms-spinach-fermented-black-bean-recipe.html", "description": "Home-style bean curd is one of those humble recipes that has as many variations as cooks. That's probably because it takes a bunch of simple ingredients and makes them taste robust, meaty, and much more filling than they have any right to be. We have fermented black beans to thank for this.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Dinner Tonight", "Mains", "Tofu", "Vegetarian"], "recipeIngredient": ["1 block firm tofu (about 1 1/4 pounds), drained", "3 tablespoons vegetable or canola oil ", "4 ounces button mushrooms, stems discarded, thickly sliced (about 2 cups)", "3 medium cloves garlic, minced (about 1 tablespoon)", "2 fresh red chilies (such as Thai bird), stemmed, thinly sliced ", "1/4 teaspoon salt ", "3 scallions, chopped (about 1/4 cup)", "3 tablespoons fermented black beans ", "1 cup low-sodium canned or homemade vegetable or chicken broth", "1/4 teaspoon dark soy sauce ", "2 ounces baby spinach, chopped (about 1 1/2 cups)", "3/4 teaspoon cornstarch mixed with 1 tablespoon of water in a small bowl", "2 teaspoons chili oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the tofu slices with paper towels, and then cut into 1/2-inch thick rectangular slabs. Heat = oil in a large wok over high heat until just starting to smoke. Add the tofu slices tongs. Cook until golden, flipping occasionally, about 3 minutes. Transfer tofu to paper towel-lined plate to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the wok to high heat and add the mushrooms. Cook, stirring and tossing occasionally, until mushrooms release their liquid and start to brown, about 4 minutes. Add the garlic and chiles and cook, stirring constantly, until fragrant, about fifteen seconds. Add the fermented black beans, and stir-fry until they are hot, about 30 seconds. Add the broth and soy sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When mixture comes to a simmer, reduce heat to medium, add the spinach, and cook until it wilts, about 15 seconds. Season to taste with salt, if necessary. Stir in the cornstarch and water mixture, and cook until the liquid thickens. Add the scallions, stir well, and then remove from heat. Add the chili oil. Serve immediately with rice.</p>"}]}