{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/201201010-225778-dinner-tonight-tom-kha-gai-mushrooms-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Thai", "keywords": ["coconut", "Dinner Tonight", "soup", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Thai Coconut Chicken Soup (Tom Kha Gai) with Mushrooms", "link": "https://www.seriouseats.com/recipes/2012/10/tom-kha-gai-with-mushrooms-recipe.html", "description": "A simple and satisfying bowl of <strong>Tom Kha Gai</strong> requires only a handful of ingredients and less than thirty minutes to get right.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Coconut", "Dinner Tonight", "Soups and Stews", "Thai"], "recipeIngredient": ["20 ounces chicken stock ", "2-inch piece of galangal, peeled, half cut into slices, half cut into matchsticks  (see note)", "2 stalks lemongrass, ends trimmed, tough outer leaves removed, cut into 1-inch pieces ", "4 Kaffir lime leaves, crumpled by hand (see note)", "1 (13.5 ounce) can coconut milk ", "1 pound boneless, skinless chicken breasts, sliced thinly against the grain ", "1/2 pound mushrooms (straw mushrooms if possible, but otherwise cremini or button), ends removed, sliced", "1 tablespoon fish sauce, plus more for serving ", "1 tablespoon juice from 1 lime, plus more for serving", "4 hot red chilis (such as Thai bird) ends trimmed, smashed with a knife ", "Handful fresh cilantro leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine stock, galangal, lemongrass, and lime leaf in a medium saucepan. Bring to a simmer over medium heat, and then reduce heat to maintain a simmer for 10 minutes. Discard the galangal and lemongrass. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the coconut milk and increase heat to medium. Add chicken, mushrooms, galangal matchsticks, and Kaffir lime leaves, and cook until the chicken is completely cooked and the mushrooms are tender, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the fish sauce, lime juice, and red chiles. Remove from heat. Divide the soup between four bowls, making sure each has a red chile. Garnish with cilantro. Adjust flavor with more lime juice and fish sauce as necessary. </p>"}]}