{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120525-natkin-soup.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Japanese", "keywords": ["Cook the Book", "Herbivoracious", "Japanese", "Michael Natkin", "soba", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Michael Natkin's Soba Noodles in Shiitake-Shoyu Broth with Spring Vegetables", "link": "https://www.seriouseats.com/recipes/2012/05/soba-noodles-in-shiitake-shoyu-broth-with-spr.html", "description": "This vegetarian stock uses kombu, dried shiitakes, leeks, ginger, garlic, and soy to recreate the deep flavors of the decidedly un-veggie friendly inspiration.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Japanese", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["2 cups dried shiitake mushrooms", "1 piece kombu seaweed (6 to 8 inches long)", "1⁄2-inch piece fresh ginger, peeled", "4 garlic cloves, coarsely chopped", "8 cups water", "4 medium leeks, white parts only, tough outer layer discarded, halved lengthwise, and carefully cleaned", "3 tablespoons shoyu (Japanese soy sauce; see headnote), plus additional as needed", "4 large eggs", "1 bunch thick asparagus, tough ends removed and lightly peeled ", "1 tablespoon vegetable oil", "Kosher salt ", "9 ounces soba noodles", "12 ounces soft tofu, cut into 1⁄2-inch cubes", "2 scallions, white and light green parts only, thinly sliced on the diagonal", "Toasted sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Briefly rinse the dried shiitakes. Place them in a saucepan with the kombu, ginger, garlic, and water. Simmer over low heat for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the leeks and simmer until they are tender, about 10 minutes more. Remove the leeks with a slotted spoon and reserve. Remove and discard the kombu. Strain the broth through a fine-mesh sieve, squeezing out as much broth from the mushrooms as possible. Discard the shiitake stems. Slice enough of the shiitake caps thinly to yield 1 cup for serving, and save the rest for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shoyu to the broth. Taste and add more if needed.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the eggs in a small saucepan and cover with cold water by 1⁄2 inch. Bring to a boil over high heat, then cover and remove from the heat. Set a timer for 8 minutes; when the timer rings, transfer the eggs to a bowl of cold water. Peel the cooled eggs and cut them in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a grill pan or large, heavy skillet over medium-high heat. Brush the asparagus with the vegetable oil and cook in a single layer, turning from time to time, until spears are tender and charred spots are appearing on all sides, about 8 minutes. Remove and season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the soba noodles according to the package directions and drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the broth back to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm four large soup bowls in a low (200°F) oven. To serve, put about 1 cup of noodles in each of the warmed bowls. Top the noodles with the leeks, eggs, asparagus, sliced shiitake caps, tofu, and scallions. Take your time to make an attractive arrangement. Ladle in about 11⁄2 cups of the broth. Drizzle in a few drops of sesame oil and serve it forth.</p>"}]}