{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121211-very-small-anna-animal-crackers-primary.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["animal crackers", "Cookies", "very small anna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Animal Crackers", "link": "https://www.seriouseats.com/recipes/2012/12/homemade-animal-crackers-cookies-recipe.html", "description": "Uniquely snacky treats with a wholesome homemade spin.", "totalTime": "20 minutes to over an hour depending on how many sheets you bake", "recipeYield": "makes hundreds of tiny ones or a few dozen big ones", "recipeCategory": ["Cookies", "Very Small Anna"], "recipeIngredient": ["7 ounces (about 2 cups) whole rolled oats", "14 ounces (2 cups) granulated sugar", "1 ounce (1/4 cup) graham or whole wheat flour", "1 teaspoon ground cinnamon", "1/2 teaspoon ground mace", "1 teaspoon baking soda", "1/2 teaspoon salt", "4 ounces (1 stick) unsalted butter, cut in 1/4 inch cubes and thoroughly chilled", "1/2 cup hot water", "1 teaspoon vanilla", "8 3/4 ounces (about 1 3/4 cup) all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine oats, sugar, graham/whole wheat flour, cinnamon, mace, salt, and baking soda. Process until oats are powdered and mixture is homogenous, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Distribute butter cubes evenly over surface and pulse until mixture is mealy with no large chunks of butter remaining, about 10 quick pulses. Add hot water and vanilla. Pulse until fully incorporated, about 10 quick pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out dough into a medium mixing bowl. Add flour and knead in with a flexible dough scraper or by hand until fully incorporated. Wrape dough tightly in plastic, form into a disk, and transfer to refrigerator for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from refrigerator and unwrap. Place on a lightly floured work surface. Using rolling pin, roll dough out until roughly 1/8-inch thick, flouring as necessary.  Use cutters or a knife to cut into desired shape. Gather scraps, re-roll, and cut more shapes. At this point you can freeze your cut crackers for later, layering with parchment paper in between and wrapping tightly with plastic. Crackers baked from frozen will puff up less and keep their shape better which is good for smaller, more detailed shapes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, adjust oven racks to upper and lower middle positions and preheat oven to 350&deg;F. Line two baking sheets with parchment or silicone mats, space crackers an inch apart. Bake for 8 minutes, then rotate sheet(s) and bake for additional 2 minutes. Cookies should be firm to the touch and lightly golden brown. Allow to cool and harden fully before removing from baking sheets. Store in airtight containers for up to 1 month.</p>"}]}