{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120108-186806-cabbage-and-mushroom-lasagna-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["cabbage", "Cook the Book", "Elaine Louie", "mushrooms", "recipe newsletter", "The Occasional Vegetarian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Occasional Vegetarian's Cabbage and Mushroom 'Lasagna'", "link": "https://www.seriouseats.com/recipes/2012/01/the-occasional-vegetarians-cabbage-and-mushroom-lasagna-recipe.html", "description": "The following recipe is from the January 11 edition of our weekly recipe newsletter. To receive this newsletter in your inbox, sign up here! [Photograph: Caroline Russock] Béchamel and cheese are an incredible duo, a pair of ingredients with the...", "totalTime": "2 hours", "recipeYield": "serves 6", "recipeCategory": ["Cabbage", "Cook the Book", "Mushrooms", "Vegetarian"], "recipeIngredient": ["9 tablespoons unsalted butter", "3 tablespoons plus 1 teaspoon unbleached all-purpose flour", "2 2/3 cups whole milk", "1/4 teaspoon freshly grated nutmeg", "Salt and freshly ground black pepper", "1 medium onion, chopped", "1 garlic clove, minced", "1 pound assorted fresh mushrooms (shiitake, oyster, porcini, chanterelles, cremini), thinly sliced", "1 tablespoon finely chopped fresh sage", "2 pounds napa cabbage, 12 large leaves removed from the head and reserved, the remainder chopped into rough dice", "1/2 cup dry white wine", "1 1/2 pounds (about 4) Yukon Gold potatoes, sliced 1/8 inch thick", "1 cup grated Västerbotten or Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. In a large saucepan over medium heat, melt 6 tablespoons of the butter. Add the flour, stir for 3 minutes (do not allow to brown), then gradually whisk in the milk, stirring until thickened, 5 to 8 minutes. Stir in the nutmeg and season with salt and pepper to taste. Remove from the heat, allow to cool, and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 14-inch sauté pan over medium heat, melt 2 tablespoons of the remaining butter. Add the onion and garlic, and sauté until the onion is translucent. Add the mushrooms, sage, and chopped cabbage, and sauté until fragrant and the cabbage is tender, 10 to 12 minutes. Add the wine and sauté until it has evaporated. Add the reserved sauce and simmer for 10 minutes. The mixture should be very thick but slightly fluid; if necessary, add a little milk or water. Season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the mushroom and cabbage mixture is simmering, pour 6 cups of water into a stockpot and bring to a boil. Add the whole cabbage leaves and blanch for 2 minutes. Drain under cold water and pat dry.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the remaining 1 tablespoon butter, grease a 9 by 9-inch glass baking dish. To assemble the lasagna, line the bottom of the dish with half the cabbage leaves, and top with half the potatoes and half the creamed mushrooms. Repeat the layering of cabbage, potatoes, and mushrooms, and top with the grated cheese. Cover snugly with foil and bake for 30 minutes. Uncover and bake until the top is golden brown, about 20 minutes. Allow to cool for 10 minutes, then serve.</p>"}]}