{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120404-200330-tofu-with-kimchi-and-pork-belly.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Korean", "keywords": ["Andrea Nguyen", "Cook the Book", "kimchi", "Korean", "pork", "recipe newsletter", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andrea Nguyen's Tofu with Kimchi and Pork Belly", "link": "https://www.seriouseats.com/recipes/2012/04/andrea-nguyens-tofu-with-kimchi-and-pork-belly-recipe.html", "description": "Tofu and pork are good friends, especially in Korean cuisine. <strong>Tofu with Kimchi and Pork Belly,</strong> or <em>dubu kimchi,</em> is an amazing match up of mild tofu, fatty pork belly, and spicy-sour kimchi. Doctored up with a few chiles&mdash;powdered and fresh&mdash;and a drizzle of sesame oil, this is Korean drinking food at its finest.  \n\nBut you don't have to be knocking back the soju to enjoy <a href=\"http://www.vietworldkitchen.com/blog/about_andrea_nguyen.html\">Andrea Nguyen</a>'s Tofu with Kimchi and Pork Belly from <em><strong><a href=\"http://www.amazon.com/Asian-Tofu-Discover-Best-Make/dp/1607740257/?tag=serieats-20\">Asian Tofu</a></strong></em>.  It makes for a great anytime meal, quick to assemble, easy to love, and full of a very satisfying array of textures and big tastes.", "totalTime": "20 minutes", "recipeYield": "serves 4 as a side, 2 as a main course", "recipeCategory": ["Cook the Book", "Korean", "Pork", "Tofu"], "recipeIngredient": ["8 to 10 ounces firm tofu", "3/4 teaspoon salt, plus more as needed", "1 cup very hot or just-boiled water", "8 ounces drained mature napa cabbage kimchi (1 cup packed)", "About 1/2 teaspoon sugar", "1 to 1 1/2 teaspoons Korean red pepper powder (gochu garu)", "4 ounces pork belly, with or without skin, cut into 1 1/2-inch-long pieces, each about 1/8 inch thick ", "1 clove garlic, finely chopped", "1 jalapeño chile, cut into 1/8-inch-thick rings, optional", "1 to 2 tablespoons kimchi pickling liquid", "1 large or extra-large green onion, white and green parts, cut into 1/4-inch-thick rings", "1/2 teaspoon sesame oil", "1 teaspoon toasted black sesame seeds, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the tofu into super chunky matchbooks, each about 1 1/2 inches by 2 inches by a generous 1/2 inch. Put the pieces in a shallow bowl. Dissolve the 3/4 teaspoon salt in the water, then pour over the tofu; it should be just covered. Set aside to warm and season the tofu while you make the stir-fry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the kimchi into 1- to 1 1/2-inch pieces and transfer to a bowl. Season it with the sugar and red pepper powder to slightly offset the kimchi’s tartness and to brighten up its color and heat. I usually add the sugar by the \u20281/4 teaspoon and the pepper powder by the 1/2 teaspoon. The quantity needed depends on the kimchi’s flavor and your preferences. The kimchi should taste pleasantly sour-sweet with a light spicy kick. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a wok or skillet over high heat. There is no need to add oil because the pork will render its fat. Scatter in the pork, spreading out the pieces to allow them to fry flat. Let them cook for about 1 minute, undisturbed, until the pork has browned a bit. Use a spatula to flip the pork, spreading it out again, and cook undisturbed for another minute. Transition to stir-frying the pork, moving it constantly. If there is more than a tablespoon of fat in the pan, use a spoon to remove it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the garlic and chile and give these a few turns. Then add the seasoned kimchi. Cook, stirring frequently, for about 4 minutes to allow the pork to absorb the flavors of the kimchi; test by tasting the pork. Splash in the kimchi pickling liquid to inject extra flavor. When you are satisfied, add the green onion. Continue stir-frying for about 30 seconds, until the green onion has softened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat. Taste the kimchi and add sugar and salt, as needed. Add the sesame oil for a fragrant, rich finish. Transfer the kimchi to a plate, mounding it in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off the water from the tofu. Arrange the warm tofu pieces around the kimchi. Sprinkle a little black sesame seed atop each piece of tofu before serving.</p>\n\n<p>Invite guests to put a piece of tofu on their plate, then add a copious quantity of the kimchi and pork on top. If the tofu pieces are unwieldy, use chopsticks or a fork to cut them in half before topping with kimchi and pork.</p>"}]}