{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121112-btb-vintage-cakes-lemon-almond.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "lemon", "Vintage Cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon and Almond Streamliner Cake", "link": "https://www.seriouseats.com/recipes/2012/11/emon-and-almond-streamliner-cake-recipe.html", "description": "If you like your dessert more custard than cake, look no further than this Lemon and Almond Streamliner cake. Named for the pan it was originally baked in, it's velvety soft and lemony-rich.", "totalTime": "4 hours, including baking and cooling", "recipeYield": "makes 1 9-inch cake", "recipeCategory": ["Bake the Book", "Cakes", "Lemon", "Puddings and Custards"], "recipeIngredient": ["<strong>Custard</strong>", "Grated zest of 2 lemons", "3/4 cup whole milk", "1/2 cup (3 1/2 ounces) sugar ", "4 egg yolks", "1/2 teaspoon fine sea salt ", "2 tablespoons cornstarch", "1/2 cup lemon juice (from approximately 3 lemons) ", "1/2 cup (4 ounces) unsalted butter, cut into small cubes", " ", "<strong>Cake</strong>", "1 1/4 cups (5 ounces) sifted cake flour ", "1 1/2 teaspoons baking powder", "1/2 teaspoon sea salt", "3/4 cup (6 ounces) almond paste, \u2028at room temperature", "10 tablespoons (5 ounces) unsalted butter, at room temperature", "2/3 cup (4 2/3 ounces) sugar ", "3 tablespoons canola oil ", "2 teaspoons pure vanilla extract ", "3 eggs, at room temperature ", "2/3 cup buttermilk, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the lemon custard, combine the lemon zest, milk, and 1/4 cup of the sugar in a medium saucepan and heat over medium-low heat until just hot. Meanwhile, in a bowl, thoroughly whisk together the egg yolks, the remaining 1/4 cup of sugar, and the salt until well combined, then whisk in the cornstarch, then the lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly whisk a third of the hot liquid into the yolk mixture. Pour the mixture back into the saucepan with the hot milk and cook over medium-low heat, whisking steadily, until the custard begins to thicken and bubble for 1 minute (you will need to stop whisking for a moment to check if it is bubbling). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the custard through a fine mesh sieve into a clean bowl and whisk in the butter until it has melted. Place a piece of plastic wrap directly upon the surface of the custard and place in the refrigerator to cool for about 2 hours. The custard is easiest to work with once it has set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center an oven rack and preheat the oven to 350°F.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cake, sift together the flour, baking powder, and salt in a bowl, then whisk the mixture to ensure that the ingredients are well mixed.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a stand mixer with the paddle attachment, combine the almond paste, butter, sugar, canola oil, and vanilla on low speed until blended; gradually increase the speed to high and cream until very light and fluffy, 5 to 7 minutes, stopping the mixer frequently to scrape the paddle and the sides of the bowl with a rubber spatula. Blend in the eggs one at a time, adding the next one as soon as the previous one has disappeared into the batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer on low speed, add the flour mixture in three parts, alternating with the buttermilk in two parts, beginning and ending with the flour. After each addition, mix until just barely blended and stop and scrape the bowl. Stop the mixer before the last of the flour has been incorporated and complete the blending by hand with a rubber spatula to ensure you do not overbeat the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan and spread it evenly. Rap the pan firmly on the counter to release any air bubbles. Place the pan in the center of the oven and bake until the cake is a deep golden color and a wooden skewer poked in the middle comes out just barely clean, 42 to 45 minutes. The cake might crack on the surface as it bakes; don’t worry, this simply provides a way for the cake to soak up more of the lemon custard.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the cake in its pan on a wire rack for 30 minutes. Gently invert the cake onto the rack, leaving on the parchment paper until you assemble the cake. Flip the cake right side up and continue to cool the cake on the rack until it reaches room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish the cake, remove the parchment paper and place the cake right side up on a flat plate. Using a metal spatula, spread a thin layer of the lemon custard on the sides of the cake to seal the cake and give it a light shine. Put the rest of the lemon custard on top of the cake, spreading it just barely out to the edge. Use your spatula to make a swirly design in the custard on the top of the cake. Allow the assembled cake (or really, the lemon custard) to set in the refrigerator for 30 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the cake to room temperature before serving (this will take about an hour). Any leftover cake keeps in an airtight container in the refrigerator for up to 3 days.<br />\r\n</p>"}]}