{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120615-210271-Knead-book-seeded-dill-rye.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "dill", "knead the book", "rye", "rye bread", "the bread bible"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Bread Bible's Seeded Dill Rye", "link": "https://www.seriouseats.com/recipes/2012/06/the-bread-bibles-seeded-dill-rye.html", "description": "As rye breads go, this one is fairly light and soft, but it still has good rye flavor and would make a great sandwich bread.", "totalTime": "4 hours", "recipeYield": "Makes 2 loaves", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["2 cups warm water (105˚ to 115˚F)", "1 1/2 tablespoons (1 1/2 packages) active dry yeast", "3 tablespoons light brown sugar", "1 1/2 cups rye flour", "1/2 cup instant nonfat dried milk", "1 tablespoon dill weed", "1 tablespoon dill seed", "1 tablespoon caraway seeds", "2 1/2 teaspoons salt", "3 tablespoons unsalted butter, melted", "3 1/2 to 4 cups unbleached all-purpose flour or bread flour", "Rich Egg Glaze (optional): 1 large egg yolk or 1 large egg, at room temperature beaten with 1 tablespoon milk or cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1/2 cup of the warm water in a small bowl. Sprinkle the yeast and a pinch of brown sugar over the surface of the water. Stir to dissolve and let stand at room temperature until foamy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl using a whisk, combine the rye flour, dried milk, remaining brown sugar, dill weed, dill seeds, caraway seeds, and salt. Add the remaining water, butter, and yeast mixture. Beat hard until smooth, about 3 minutes. Add the flour, 1/2 cup at a time, with a wooden spoon until a shaggy dough is formed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured work surface and knead until smooth and silky, about 5 minutes, dusting with flour only 1 tablespoon at a time as needed to prevent sticking.</p>\r\n\r\n<p>If kneading by machine, switch from the paddle to the dough hook and knead for 3 to 4 minutes, or until the dough is smooth and springy and springs back when pressed. If desired, transfer the dough to a floured surface and knead briefly by hand.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough in a greased bowl. Turn once to grease the top and cover with plastic wrap. Let rise at room temperature until doubled in bulk, 1 to 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently deflate the dough. Turn the dough out onto a lightly floured work surface. Grease two 9-by-5-inch loaf pans. Divide the dough into 2 equal portions. Shape each portion into loaves and put in the pans. Cover loosely with plastic wrap and let sire to 1 inch above the rim of the pans, about 40 minutes. Brush with the egg glaze, if desired, for a dark and glossy crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Twenty minutes before baking, preheat the oven to 375˚F. Place the pans on the rack in the center of the oven and bake for 40 to 45 minutes, or until golden brown and the loaves sound hollow when tapped with your finger. Transfer the loaves to a cooling rack. Cool before slicing.</p>"}]}