{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/228180-10-30-12-chicken%20thighs-squash-skillet%20suppers.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["butternut squash", "chicken", "One Pot Wonder", "quick", "skillet suppers", "squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Pan-Cooked Chicken Thighs with Butternut Squash", "link": "https://www.seriouseats.com/recipes/2012/11/pan-cooked-chicken-thighs-butternut-squash-recipe.html", "description": "Flavorful and easy to cook, these chicken thighs make for a tasty dinner with a healthy side of butternut squash.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Mains", "One-Pot Wonders", "Squash", "Stovetop"], "recipeIngredient": ["1 tablespoon olive oil", "4 bone-in, skin-on chicken legs (about 2 pounds total)", "4 cups cubed butternut squash", "Kosher salt and freshly ground black pepper", "1 small yellow onion, diced (about 1/2 cup)", "2 tablespoons chopped fresh sage leaves (see note)", "1 1/2 cups low-sodium homemade or store-bought chicken broth", "1 tablespoon cold butter", "2 tablespoons fresh lemon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 12-inch skillet over medium-high heat until shimmering. Add the chicken legs, skin-side down and cook without moving until golden brown and crisp, 8 to 10 minutes. Flip, and cook for 3 to 4 minutes on the other side. Transfer to a large plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cubed squash to the fat in the pan and cook over medium-high heat, stirring and tossing occasionally, until it begins to brown and soften, about 4 minutes (reduce heat if anything starts to burn). Add the onion and cook, stirring frequently, until slightly softened, about 2 minutes. Add the sage and cook, stirring constantly, until fragrant, about 30 seconds. Add chicken broth and deglaze the pan, scraping up any brown bits on the bottom. Push the squash to the sides, and add the chicken back in, skin side up. Bring to a boil, reduce to a simmer, and cook, uncovered, until chicken thighs are cooked through (thighs should register at least 170°F on an instant read thermometer) and the stock is reduced to about a half cup, 15 to 20 minutes. Transfer chicken to a serving platter. Serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Off heat, whisk in butter and lemon juice to sauce, swirling to combine. Season to taste with salt and pepper and pour around the chicken. Serve immediately.</p>"}]}