{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120516GingerPork.JPG", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Dinner for Two", "pork", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gingery Roast Pork with Thyme", "link": "https://www.seriouseats.com/recipes/2012/05/dinner-for-two-gingerly-roast-pork-with.html", "description": "Pork tenderloin with a crust of earthy fresh thyme and zingy-sweet ginger preserves, all cooked as a one-pot oven meal with whole baby zucchinis.  A one-pot roast dinner wonder.", "totalTime": "25 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner for Two", "Pork", "Zucchini"], "recipeIngredient": ["1 pork tenderloin", "Kosher salt and freshly ground black pepper", "1 tablespoon chopped fresh thyme", "3 tablespoons ginger preserves", "A drizzle of olive oil", "6 baby zucchini"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the oven rack in the center of the oven, and preheat the oven to 450°F.  Season the pork with salt and pepper, and roll in the fresh thyme so it’s seasoned all over.  Rub the ginger preserves all over the meat.  Lightly grease a ceramic baking dish with olive oil, and place the pork in the dish.  If any ginger preserves have fallen off the meat, pile them up on top of the pork, and drizzle lightly with olive oil.  Toss the zucchini with a light drizzle of olive and a pinch of salt, and scatter around the baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the center of the pork reaches 140 degrees F, about 15 to 18 minutes.  Turn on the broiler (leave the meat where it is), and broil until the preserves on top of the pork caramelize, a minute or two.  The pork should now be 145 degrees in its center. Take the dish out of the oven, tent with foil, and let rest for 10 minutes.  Slice the pork, spoon some of the ginger juice from the pan over the top, and serve with the roasted zucchini and some lightly dressed salad and bread.  </p>"}]}