{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120307-fiaf-olive-oil-palmiers-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["appetizers", "French in a Flash", "puff pastry", "snacks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fresh Olive Oil and Sea Salt Palmiers", "link": "https://www.seriouseats.com/recipes/2012/03/fresh-olive-oil-and-sea-salt-palmiers-recipe.html", "description": "Frozen puff pastry gets a simple coat of fruity extra virgin olive oil and flaky sea salt before getting rolled and baked into the simplest, most delicious savory palmiers.", "totalTime": "55 minutes", "recipeYield": "approximately 22 palmiers", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "French", "Snacks"], "recipeIngredient": ["1 sheet of puff pastry, rolled out to 12 inches by 12 inches, very cold", "2 tablespoons extra virgin olive oil", "1 teaspoon of flaked sea salt, like Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the pastry sheet out to a 12-inch square. Pour the olive oil on top of the square, and use a pastry brush to distribute evenly. Scatter the salt evenly over the top of the pastry. Starting at one side of the square, roll the pastry in to the center of the square. Repeat with the opposite side of the pastry so the two rolls meet in the center. Wrap the pastry log in plastic wrap and refrigerate for 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. Use a very sharp serrated knife to slice the cold pastry log into 1/4-inch coins (you may want to cut off the ragged ends of the log). Lay them in a well-spaced single layer on a baking sheet.  You may need to do this in two batches. Bake for 10 to 15 minutes, until golden and puffed. When they come out, carefully flip them over, brush them lightly with olive oil and sprinkle with coarse sea salt. Allow to cool on the baking tray, then pile high on a plate and serve with chilled white wine.</p>"}]}