{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20111214-arepas-2-03.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["arepas", "cheese", "Colombia", "corn", "Latin American cuisine", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cheese-Stuffed Colombian-style Arepas", "link": "https://www.seriouseats.com/recipes/2012/04/cheese-stuffed-colombian-style-arepas-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] Notes: Masarepa is dehydrated cooked corn meal. It is available in the Latin section of most supermarkets in wither white or yellow varieties. This recipe calls for white, but they can be freely substituted. Popular brands...", "totalTime": "30 minutes", "recipeYield": "makes 4 arepas", "recipeCategory": ["Cheese", "Corn", "Vegetarian"], "recipeIngredient": ["2 cups masarepa (see note)", "2 ounces (about 1/2 cup) finely crumbled queso fresco (optional, see note #2 above)", "2 cups water, plus more as necessary", "2 teaspoons vegetable oil", "Kosher salt", "1/2 pound mozzarella or other good melting cheese, sliced or grated", "2 teaspoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat toaster oven or oven with rack in the center to 325°F. Combine masarepa, grated cheese (if using), 1 cup water, and 1 teaspoon vegetable oil in a medium bowl and knead with hands until a dough is formed. Take a small amount and flatten it between your palms If the edges crack, knead in more water a tablespoon at a time until dough is supple and smooth but not sticky. Season dough to taste with salt, then cover and set aside for five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into eight even pieces and roll into balls. Working on a wooden cutting board or a regular cutting board with a sheet of plastic wrap or parchment paper on top of it, flatten each ball down to a disk about 5-inches in diameter and 1/4-inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/4 of cheese into center of one disk, leaving a 1/2-inch gap all around.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a second disk on top and carefully seal the edges all around, trying to remove as much air from the center as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use one hand to shape the edges of the arepa so that it is an even round disk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a 12-inch cast iron or non-stick skillet over medium-low heat (see note #3 above). Add arepas and cook, moving them around the pan and rotating them occasionally, until first side is charred in spots and a dry crust has formed, about five minutes. Flip arepas and cook on second side until a dry crust has formed, about five minutes longer. Transfer to a baking sheet and place in oven until heated through and cheese is melted, about 10 minutes. Serve immediately.</p>"}]}