{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121104-228751-myers-and-chang-lemon-mousse-primary.jpg", "author": {"@type": "Person", "name": "Liz Bomze"}, "recipeCuisine": "", "keywords": ["joanne chang", "lemon curd", "mousse"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Joanne Chang's Lemon-Ginger Mousse Coupe", "link": "https://www.seriouseats.com/recipes/2012/11/joanne-changs-lemon-ginger-mousse.html", "description": "This gingery, citrusy mousse is served at Meyers and Chang in Boston.", "totalTime": null, "recipeYield": "serves 6", "recipeCategory": ["Desserts", "Ginger", "Puddings and Custards"], "recipeIngredient": ["<strong>For Mousse </strong>", "2 1⁄2 cups/600 milliliters heavy cream ", "3-inch/7.5-centimeter piece fresh ginger, unpeeled and roughly chopped ", "1⁄2 teaspoon ground ginger ", "2 1⁄2 cups/600 mililiters Lemon Curd (recip efollows) ", "1⁄2 cup/80 grams chopped crystallized ginger for garnish ", "&nbsp;", "<strong>For Lemon Curd</strong>", "1 cup/240 mililiters freshly squeezed lemon juice ", "4 tablespoons/55 grams unsalted butter, cut into small pieces ", "4 large eggs ", "2 egg yolks ", "1 cup/200 grams granulated sugar ", "1⁄4 teaspoon vanilla extract ", "1⁄8 teaspoon kosher salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Lemon Curd</strong>:In a medium, non-reactive saucepan, combine the lemon juice and butter, place over medium-high heat, and heat to just under a boil. Meanwhile, in a medium, heatproof bowl, whisk together the eggs and egg yolks until blended, then slowly whisk in the sugar until well combined. Remove the lemon juice mixture from the heat and gradually whisk a little of it into the sugar-egg mixture. Continue whisking the hot liquid into the sugar-egg mixture, a little at a time, until all of it has been incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the contents of the bowl to the saucepan and cook over medium heat, stirring continuously with a wooden spoon and making sure to scrape the bottom of the pan frequently to prevent the eggs from scrambling, for 5 to 8 minutes, or until the mixture thickens and coats the spoon thickly. To test, draw your finger along the back of the spoon; the curd should hold the trail for a second or two before it fills. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the curd from the heat and strain through the sieve into a medium, heatproof bowl. Whisk in the vanilla and salt. Place a piece of plastic wrap directly on top of the curd to prevent a skin from forming. Cover tightly and refrigerate for 1 to 2 hours, or until cold before using. The curd can be stored for up to 5 days in an airtight container in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Mousse</strong>: In a medium saucepan, combine the cream and fresh and ground ginger and bring to just under a boil over high heat. Remove from the heat and let the cream sit for about 1 hour to infuse with the ginger. Transfer to an airtight container and refrigerate for at least overnight or up to 4 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve the mousse, strain the chilled cream into the bowl of the stand mixer or into a large bowl if using a handheld mixer. Whip the cream on medium speed until it holds a stiff peak. Then, using a rubber spatula, fold the lemon curd into the whipped cream just until fully incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the mousse equally among serving bowls and top with the candied ginger. Serve immediately. </p>"}]}