{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120907-sunday-supper-beef-rouladen.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["beef", "German", "pickles", "rouladen", "spaetzle", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Beef Rouladen With Dill Spaetzle", "link": "https://www.seriouseats.com/recipes/2012/09/beef-rouladen-dill-spaetzle-german-recipe.html", "description": "Mustard-slathered beef rolls stuffed with veg, briny pickles and smoky bacon don't skimp on flavor. Meanwhile, comforting, lightly crisped spaetzle is a vehicle for sopping up savory pan sauce.", "totalTime": "1 hour 45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the Beef:</strong>", "4 beef round steaks (about 1 1/2 pounds total), trimmed and sliced 1/4” thick ", "Kosher salt and freshly ground black pepper", "2 tablespoons stone-ground mustard", "4 slices bacon", "4 green onions, trimmed", "1 large carrot, peeled and cut lengthwise into six long spears", "4 dill pickle spears", "2 tablespoons olive oil, divided", "2 medium cloves garlic, minced (about 2 teaspoons)", "2 cups low-sodium chicken broth", "1/4 cup red wine", "&nbsp;", "<strong>For the Spaetzle:</strong>", "1 1/3 cup all-purpose flour, divided", "1 large egg, lightly beaten", "1/4 cup milk", "1 teaspoon minced fresh dill (or 1/2 teaspoon dried)", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To tenderize the beef steaks, place them between two sheets of wax paper and pound with a meat mallet. Season both sides with salt and pepper. Dividing mustard evenly between each steak, spread on the surface of one side of meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bacon in a medium skillet over medium heat and cook until fat has started to render and bacon is lightly browned, about 4 minutes, flipping once. Lay one slice of lightly browned bacon on each piece of slathered steak, followed by an onion, carrot spear, and pickle spear. Trim vegetables to fit the length of each steak. Starting at the short end, roll the meat up like a jellyroll and secure with kitchen twine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil in a large skillet over medium-high heat. When oil is shimmering, add beef and cook until well browned on all sides, about 6 minutes total. Reduce heat to medium and add garlic. Cook, stirring constantly, until softened and fragrant, about 30 seconds. Add broth and wine and scrape any browned bits off of bottom with wooden spoon. Bring liquid to a boil, reduce to a simmer, cover, and cook until meat is tender, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to a boil over high heat. Mix 1 cup flour, egg, milk, dill, 1/2 teaspoon salt and 1/2 teaspoon black pepper in a medium bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches while using a sturdy spoon, force spaetzle through holes of a spaetzle maker or large-holed colander into the boiling water. Cook 3 to 4 minutes or until noodles float to the surface. Drain well into a colander, and quickly shock spaetzle with cold water.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When beef is cooked, heat butter and remaining 1 tablespoon olive oil in a large skillet over medium-high heat until foaming subsides. Add spaetzle, shake once to distribute evenly, and cook without moving until lightly browned, about 2 minutes. Season to taste with salt and pepper and transfer to a serving platter and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove meat from pan, discard twine and keep warm. Combine remaining 1/3 cup flour and 3/4 cup water, whisking until smooth and lump-free. Slowly stir into broth. Whisking constantly, bring to a boil, and simmer until gravy is thickened and starchiness of flour has disappeared. Season to taste with salt and pepper. Pour gravy into a gravy boat, straining through a fine-mesh strainer, if necessary. Transfer beef to serving platter. Serve beef and spaetzle with gravy on the side.</p>"}]}