{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120528--207593-hotdogcookie.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "Cookies", "memorial day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hot Dog Cookies", "link": "https://www.seriouseats.com/recipes/2012/05/hot-dog-cookies-cakespy-recipe.html", "description": "Hot dog look aside, taste-wise, these treats are totally sweet. Starting with a simple and lightly sweet butter cookie dough, you simply tint a portion, shape appropriately and add a squiggle of decorating icing to attain an adorable dessert trompe l'oeil morsel.", "totalTime": "1 hour, 45 minutes", "recipeYield": "makes 16 cookies", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["2 sticks (16 tablespoons) unsalted butter, softened", "1/2 cup (about 2 ounces) confectioners' sugar", "1 teaspoon vanilla extract", "2 3/4 cups (about 14 ounces) flour", "6 to 7 drops red food coloring", "Flaked coconut", "Yellow or red decorating icing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and confectioners' sugar on high until smooth, about 3 minutes. Beat in the flour and vanilla on low speed until incorporated, about 1 minute. Remove all but one cup of the dough and set aside. Add red food coloring to the 1 cup left in mixer and knead until well combined. Cover both the tinted and untinted dough in separate bowls; place both in the refrigerator to chill for an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Near the end of your cooling period, position a rack in the middle position and preheat the oven to 350&deg;F. Line a baking sheet with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For hot dogs, divide red dough into 16 portions. Shape into approximately 2-inch logs; round the ends, and set aside. Divide the untinted dough into 16 portions. Shape into approximately 3-inch logs; make a length-wise groove in each cookie (I did this by pressing my finger into it). Smooth any cracked edges with your fingers. These will be the \"buns\". </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place each \"bun\" cookie two inches apart on your prepared baking sheet. Place the red \"hot dog\" cookie dough logs into the \"bun\" cookies. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the edges are golden brown, 12 to 15 minutes. Let cool on the sheet before transferring to a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, sprinkle with a garnish of flaked coconut for \"saurkraut\"; for ketchup or mustard, pipe a stripe of red or yellow frosting down the center of each finished cookie. </p>"}]}