{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120904-221010-cook-the-book-tomato-and-herb-gratin.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "gratin", "James Peterson", "vegetables revised", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "James Peterson's Tomato and Herb Gratin", "link": "https://www.seriouseats.com/recipes/2012/09/james-petersons-tomato-and-herb-gratin.html", "description": "Hear the word gratin, and my mind often drifts towards rich, cheesy potato casseroles served up in the cold depths of winter. I was pleasantly surprised, then, to hear <strong>James Peterson</strong> wax poetic on a simple <strong>Tomato and Herb Gratin</strong> in his <em>Vegetables</em>. Made only with ripe summer tomatoes, parmesan cheese, olive oil, and herbs, the dish is the simplest (and lightest) in a long line of more recognizable baked tomato dishes like lasagna and eggplant parmesan.", "totalTime": "2 1/2 hours", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Gluten-Free", "Sides", "Vegetarian"], "recipeIngredient": ["6 ripe tomatoes, peeled", "1 teaspoon coarse salt", "30 fresh basil leaves", "3 tablespoons extra-virgin olive oil", "1/4 cup finely grated Parmigiano-Reggiano cheese", "&nbsp", "<strong>Optional Ingredients</strong>", "8 anchovy fillets, soaked for 5 minutes in cold water and drained on paper towels (soaking optional)", "1/4 cup pitted and chopped olives (don't use canned olives)", "2 red or green bell peppers, charred, peeled, seeded, and cut into 1/4-inch strips", "2 tablespoons capers, drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the tomatoes in half from top to bottom and cut each of the halves into 4 wedges. Use your thumb and forefinger to push the seeds out of each of the wedges. Toss the tomato wedges with the coarse salt and drain in a colander for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the basil leaves with 2 teaspoons of the olive oil and coarsely chop. (The oil helps keep the leaves from turning black.) Immediately combine the basil with the remaining olive oil in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread and third of the basil mixture in an oval gratin dish or square baking dish just large enough to hold the tomatoes in a single layer. Arrange the tomatoes in the dish, overlapping them slightly if necessary. Spoon a second third of the basil mixture over the tomatoes and sprinkle over the Parmesan cheese. If you're using any of the other toppings, arrange them on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 1 to 1 1/2 hours, until there is no liquid left in the baking dish and a light crust has formed on top. If the cheese or toppings start to become too brown before the liquid has evaporated, turn down the oven and bake somewhat longer. Brush with remaining basil mixture and serve immediately.</p>"}]}