{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121210-127677-Hot-Chocolate-cake-roll-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cake", "chilled desserts", "chocolate desserts", "holiday desserts", "Let them eat cake", "marshmallow"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hot Chocolate and Marshmallow Cake Roll", "link": "https://www.seriouseats.com/recipes/2012/12/hot-chocolate-and-marshmallow-cake-roll-recipe.html", "description": "Hot chocolate becomes cake in this recipe that incorporates moist chocolate cake, marshmallow whipped cream, and hot chocolate sauce.", "totalTime": "2 1/2 hours", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Cakes", "Chocolate", "Christmas", "Let Them Eat..."], "recipeIngredient": ["<strong>For the Cake</strong>:", "Baking spray", "1 cup unsweetened cocoa powder", "1/2 cup plus 2 tablespoons (about 3 ounces) sifted cake flour (see note)", "3/4 cup (about 5 1/4 ounces) sugar", "1 1/2 teaspoons baking powder", "3 large egg yolks, at room temperature ", "2 teaspoons pure vanilla extract", "1/4 cup hot water", "4 large egg whites, at room temperature", "1/2 teaspoon salt", "   ", "<strong>For the Filling</strong>:", "1 tablespoon water", "1 teaspoon unflavored gelatin", "2 ounces cream cheese, softened", "1 cup confectioners’ sugar", "2 teaspoons pure vanilla extract", "1/4 teaspoon salt", "2 cups heavy cream, chilled", "2 cups mini-marshmallows", "   ", "<strong>For the Hot Chocolate Sauce</strong>:", "1 cup heavy cream", "6 ounces bittersweet chocolate, chopped", "1 teaspoon pure vanilla extract", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to middle position and preheat oven to 325&deg;F. Lightly coat jelly roll pan (See notes) with baking spray. Line with parchment paper and once again lightly coat with baking spray. Dust with 1/4 cup cocoa powder and tap to evenly distribute; knock out excess.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift sifted cake flour, 1/2 cup cocoa powder, 1/2 cup sugar, and baking powder. Sift mixture once again, then, place in large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whisk egg yolks, oil, and vanilla with an electric mixer on medium speed until smooth. Add to flour mixture and whisk together until combined (mixture will be thick). Whisk in hot water and mix until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In separate clean, dry mixing bowl, whip egg whites and salt with whisk attachment on medium speed until soft peaks form, about 2 minutes. Increase speed to medium-high and gradually add remaining 1/4 cup sugar; continue whipping until stiff peaks form, 1 to 2 minutes longer. Stir 1/3 of egg whites into cake batter until thoroughly combined. With rubber spatula, gently fold in remaining egg whites.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan and spread out evenly. Bake until top of cake is pale golden and lightly springs back when you press down on it, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While cake bakes, dust clean, dry kitchen towel with remaining 1/4 cup cocoa powder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a knife around edges of just-baked cake. Turn cake over onto prepared towel. Starting at the short end, roll cake in towel and place seam-side down on cooling rack. Cool completely, about 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Once the cake is cooled, combine water and gelatin in small bowl. Microwave until gelatin dissolves, about 20 seconds. Cool to room temperature, about 5 minutes. Beat cream cheese, confectioners’ sugar, vanilla, salt, and dissolved gelatin in large bowl and medium speed with whisk attachment until light and fluffy, about 2 minutes. Reduce speed to low, add cream, and beat until incorporated. Increase speed to medium and beat to soft peaks, about 2 minutes. Fold in marshmallows.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Unroll cake, leaving it on towel. Spread cake with marshmallow cream filling, leaving a 1/2-inch border on all sides. Slowly and gently roll the cake, this time without the towel, starting at the short end. Peel off parchment. Place the cake, seam-side down on a baking sheet and refrigerate until filling is firm, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong>  Bring cream and salt to simmer in small saucepan over medium-low heat. Alternatively, microwave cream in microwave-safe container. Place chocolate in medium bowl. Pour hot cream over chocolate and stir until completely melted. Stir in vanilla and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice roll and serve with chocolate sauce.</p>"}]}