{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120126-190013-orange-marmelade-mascarpone-pop-tarts.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["mascarpone", "orange marmalade", "pop-tarts", "Rachel Wharton", "Sarah Billingsley"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange Marmalade-Mascarpone Pop-Tarts", "link": "https://www.seriouseats.com/recipes/2012/01/orange-marmalade-mascarpone-pop-tarts-pastry-breakfast-recipe.html", "description": "Encased in a buttery pâte brisée crust and filled with creamy mascarpone and bitter-sweet marmalade, these \"Pop-Tarts\" are more on par with croissants than rainbow sprinkle-topped breakfast pastries.", "totalTime": "3 hours", "recipeYield": "makes 16 Pop-Tarts", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Desserts"], "recipeIngredient": ["1 recipe Flaky Butter Crust (recipe follows)", "1 egg", "1 tablespoon cold water", "All-purpose flour for dusting", "1 cup mascarpone or cream cheese", "3/4 cup orange marmalade", "&nbsp;", "<strong>Flaky Butter Crust</strong>", "1 cup cold unsalted butter ", "\u20282 cups all-purpose/plain flour, plus more for dusting", "1 teaspoon sugar", "1 teaspoon kosher salt", "1 cup cold unsalted butter, cut into 1/2-inch cubes", "3 to 5 tablebspoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Flaky Butter Crust:</strong> Cut the butter into 1/2-inch pieces, and freeze them while you measure and mix the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dough in a food processor:</strong> Combine the flour, sugar, and salt in the processor and pulse three or four times to mix. Retrieve the butter cubes from the freezer, scatter them over the flour mixture, and pulse until the mixture forms pea-size clumps. Add the ice water, 1 tablespoon at a time, and pulse to mix, adding just enough water for the dough to come together. </p>\n\n<p><strong>To make the dough by hand:</strong> In a large bowl, whisk together flour, sugar, and salt. Retrieve the butter cubes from the freezer and distribute them evenly in the flour mixture, coating them with the flour mixture. Sink your fingers into the mixture and begin pinching the butter and flour together, making thin, floury disks of the butter. Continue working the mixture until the butter is broken down first into floury pea-sized beads and then into a loose mixture that resembles wet sand. Drizzle in 3 tablespoons of the ice water and use your hand like a comb to mix in the liquid just until the dough holds together. If necessary, add additional water, 1 tablespoon at a time, until the dough comes together in a crumbly mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a clean, floured work surface or sheet of parchment paper. Gather the dough together in a mound, then knead it a few times to smooth it out. Divide it in half, and gently pat and press each half into a rough rectangle, circle, or square about 1 inch thick. The shape you choose depends on what shape you will be rolling out the dough. If you don’t know how you will be using the dough at this point, opt for a circle. Wrap in plastic wrap or in the parchment paper and refrigerate for at least 2 hours or up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pop-Tarts:</strong> Preheat the oven to 375°F. Line two rimmed baking sheets with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the egg and water. Lightly flour a clean work surface. Remove half of the dough from the refrigerator, unwrap it, place it on the floured work surface, and flour the top lightly. Roll out the dough into a rectangle that measures roughly 9 by 12 inches. It should be about 1/8 inch thick.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a plain or fluted pastry wheel, trim off the ragged edges. Then cut the dough into neat 3-by-2-inch rectangles, saving the trimmings. (If you’re like me, your pieces won’t be identical, so when you go to fill the tarts, you’ll want to eyeball the rectangles and match up those closest to the same size.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer half of the rectangles to a prepared baking sheet, spacing them about 1 inch apart. These are the “bottoms.” Gently brush each rectangle with 1 tablespoon of the mascarpone, starting from the center and stopping within 1/4 inch of the edge on all sides. Top the cheese with 2 teaspoons of the marmalade. Using a brush or your finger, dampen the edge of the rectangle with the egg wash. Carefully place a second rectangle on top of the first, and press to seal the edges together. Repeat with remaining rectangles, then crimp the edges with the tines of a fork. Using the fork tines, puncture the top layer of the pastry a few times. Refrigerate, uncovered, for at least 15 minutes or up to 2 hours. Repeat the rolling, cutting, filling, and crimping with the second half of the dough. Gather the dough scraps from both halves, form into a ball, and roll out to make a few more pastries. (Reroll the dough only once or it will bake up tough.) You should have about 16 Pop-Tarts total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the second baking sheet of Pop-Tarts is ready, place the first pan in the oven and the second in the refrigerator, and then place a baking rack over a sheet of parchment on your table or counter. (This saves the surface from sticky drips!) Bake the pastries until they are golden brown on top (the sides will brown first), about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and immediately (and carefully) move the pastries onto the baking rack, then slip the second baking sheet into the oven. Let the pastries cool for at least 30 minutes before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The fully cooled baked pies can be kept in an airtight container at room temperature for up to 24 hours or frozen for up to 3 months. Reheat in a 375°F oven for about 12 minutes.<br />\n</p>"}]}