{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120514-206344-shrimp-and-grits.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grit", "Robb Walsh", "shrimp", "Texas Eats"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Robb Walsh's Shrimp and Grits", "link": "https://www.seriouseats.com/recipes/2012/05/robb-walshs-shrimp-and-grits.html", "description": "<em>Texas Eats</em> is full of plenty of wonderful recipes for the seasonal specialty that are Texas shrimp, and one of our perennial favorites is <strong>Shrimp and Grits</strong>, otherwise known as breakfast shrimp.  You can't really go wrong with sweet shrimp served over smooth grits, but Walsh steps up the recipe by sautéing the shrimp in bacon fat along with mushrooms, scallions, and garlic, creating a pan sauce that's pretty over the top.  And those grits?  Well, let's just say that those are the grits of Southern breakfast dreams.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Shrimp"], "recipeIngredient": ["1 pound heads-on shrimp", "Cheese Grits (recipe follows)", "Shrimp Stock (recipe follows)", "6 slices bacon, diced ", "Peanut oil, for frying", "2 cups sliced white button mushrooms ", "1 cup minced green onions (white and green parts)", "1 large clove garlic, minced", "2 tablespoons chopped fresh parsley ", "4 teaspoons freshly squeezed lemon juice", "1 or 2 dashes of Tabasco sauce", "Salt and pepper", " ", "<strong>Shrimp Stock</strong>", "1 cup water", "Heads and tails from raw shrimp", "Vegetable trimming such as onions, carrots, celery, and parsley", " ", "<strong>Cheese Grits</strong>", "2 cups chicken broth", "1 cup water", "1 cup Shrimp Stock", "1 cup Anson Mills quick-cooking organic \u2028yellow grits or other quick-cooking grits \u2028(not instant) ", "1 cup shredded Cheddar cheese", "¼ cup grated Parmesan cheese ", "¼ cup unsalted butter", "½ teaspoon salt", "¼ teaspoon black pepper", "Pinch of cayenne pepper", "Tabasco sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Shrimp Stock:</strong> In a stockpot, combine the water, heads, shells and vegetable trimmings and bring to a boil over high heat.  Lower the heat to a simmer.  Cook for 20 to 30 minutes to extract flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat and strain through a fine-mesh sieve several times to remove any tiny shell or other bits.   Use immediately, or let cool, cover, and refrigerate for a week or freeze for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cheese Grits:</strong> In a saucepan, combine the broth and water and bring to a boil over high heat. Slowly add the grits while whisking constantly. When all of the grits are incorporated, decrease the heat to low and cook, stirring occasionally, for 20 to 30 minutes, until soft and creamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat and stir in the Cheddar and Parmesan cheeses, butter, salt, black pepper, and cayenne and stir just until mixed. Serve hot with Tabasco sauce on the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Shrimp and Grits:</strong> Peel and devein the shrimp, then make the stock from the heads and shells as directed, using only 1 cup water. Set the stock aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the grits as directed, substituting the 1 cup shrimp stock for 1 cup of the water. Set the grits aside in a warm place, or keep them warm over hot water in a double boiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet, sauté the bacon over medium heat until crisp, about 8 minutes. Using a slotted spoon, transfer the bacon to paper towels to drain, then crumble.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the skillet to medium heat and add enough oil to the bacon drippings so the fat is about ⅛ inch deep. When the fat is hot but not smoking, add the shrimp in a single layer. Turn the shrimp as they color. Add the mushrooms and sauté, stirring, for about 4 minutes, until the mushrooms are cooked through.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the green onions and garlic and cook, stirring, for about 1 minute more. Stir in the parsley and season with the lemon juice, Tabasco, salt, and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the grits among 4 bowls. Spoon the shrimp on top, sprinkle with the bacon, and serve immediately.<br />\r\n</p>"}]}