{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120614-210263-knead-book-olive%20loaf.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "the bread bible"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Bread Bible's Olive Bread", "link": "https://www.seriouseats.com/recipes/2012/06/the-bread-bibles-olive-bread-recipe.html", "description": "A loaf of bread studded with olives sounded like an interesting choice when I was browsing through this book, looking for something different. Having two different types of olives in the loaf made it even more appealing.", "totalTime": "4 hours", "recipeYield": "makes 2 loaves", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["3/4 cup warm water (105˚ to 115˚F)", "1 tablespoon (1 package) active dry yeast", "Pinch of sugar", "1 1/2 cups warm milk (105˚ to 115˚F)", "1/3 cup good olive oil", "5 to 5 1/2 cups unbleached all-purpose flour or bread flour", "1 cup Spanish-style pimiento-stuffed green olives, drained, patted dry, and halved", "2 cups pitted black olives, drained, patted dry, and halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl pour in the warm water. Sprinkle the yeast and sugar over the surface of the water. Stir to dissolve and let stand at room temperature until foamy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl using a whisk or in the work bowl of a heavy-duty mixer fitted with the paddle attachment, combine the milk, olive oil, yeast mixture, salt, and 2 cups of the flour. Beat hard until creamy and smooth, about 1 minute. Add the remaining flour, 1/2 cup at a time, until a soft, shaggy dough that clears the sides of the bowl is formed. Switch to a wooden spoon when necessary if mixing by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured work surface and knead for 4 minutes, dusting with flour only 1 tablespoon at a time as needed to prevent sticking. The dough should be smooth and springy, but not dry.<br />\r\nIf kneading by machine, switch from the paddle to the dough hook and knead for 3 to 4 minutes, or until the dough is smooth and springy and springs back when pressed. If desired, transfer the dough to a floured surface and knead briefly by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough in a greased deep container. Turn the dough over once to coat the top and cover with plastic wrap. Let rise at room temperature until doubled in bulk, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently deflate the dough. Turn the dough out onto a lightly floured work surface. Grease or parchment-line a baking sheet or grease two 9-by-5-inch loaf pans. Divide the dough into 2 equal portions. Pat the dough into flat ovals. Scatter a mixture of both kinds of olives evenly over the surface of the dough and press them in lightly. Using a rolling pin, roll the dough to encase the olives. Shape the dough into a tight rounds or standard rectangular loaves. Place the dough on the baking sheet or in the loaf pans (clay pans are nice.) Cover lightly with plastic wrap and let rise, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Twenty minutes before baking, preheat the oven to 375˚F. Place the sheet or pans on a rack on the center of the oven and bake for 40 to 45 minutes, or until the bread is browned and pulls away from the sides of the pan, and the loaves sound hollow when tapped with your finger. Transfer the loaves immediately to cooling racks. Cool completely before slicing.</p>"}]}