{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120219-193095-preserved-meyer-lemon-marmalade-primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["Marmalade", "meyer lemon", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meyer Lemon Marmalade", "link": "https://www.seriouseats.com/recipes/2012/02/meyer-lemon-marmalade-recipe.html", "description": "Somewhere between a conventional lemon and a mandarin orange, the Meyer lemon is plump, juicy, and surprisingly sweet. This simple Meyer lemon marmalade showcases the fruit's bold, bright flavor. Try it with blueberry muffins or cornbread.", "totalTime": "1 hour, 30 minutes", "recipeYield": "Makes 5 cups, or 5 half-pint jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces"], "recipeIngredient": ["4 cups sugar", "6 Meyer lemons", "1/2 teaspoon baking soda", "1/4 teaspoon unsalted butter", "One (1.75-ounce) package low or no sugar needed powdered fruit pectin, such as Sure Jell"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the sugar into a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a vegetable peeler, remove the zest from the lemons in strips. Cut the strips lengthwise into very thin slices. Transfer the strips to a large, heavy-bottomed pot and add 2 1/2 cups of water and the baking soda. Bring to a boil, then reduce the heat and simmer until the peels have softened, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, using a sharp knife, cut the remaining pith (white part) from the lemons. Working over a bowl to catch the juices, cut the lemon into segments. Put the segments in the bowl and squeeze the membrane to release as much juice as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the lemon segments and juices (removing any seeds). You should have about 1 cup. Add the segments and juices to the pot. Add butter. Sprinkle pectin over the mixture and bring it to a boil, stirring constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sugar all at once. Return to full boil, stirring constantly. Boil hard for one minute. Remove the pot from the heat and stir in the crystallized ginger. Skim any foam from the surface of the marmalade. Ladle the marmalade into hot sterilized jars and process them in a hot water bath for 10 minutes. </p>"}]}