{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120423-195206-boston-cream-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["Boston cream pie", "chocolate", "pie", "pie of the week", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Classic Boston Cream Pie", "link": "https://www.seriouseats.com/recipes/2012/05/classic-boston-cream-pie-recipe.html", "description": "This pie, with its layers of sponge cake, vanilla pudding, and a slick of sweet dark chocolate glaze, is a classic.", "totalTime": "5 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "1 quart whole milk", "1 tablespoon vanilla extract", "10 ounces (about 1 1/2 cups) granulated sugar, divided", "Pinch of salt", "1 egg", "7 egg yolks", "2 ounces (about 1/2 cup) corn starch", "5 ounces dark chocolate, chopped (about 1 cup)", "4 ounces heavy cream (about 1/2 cup)", "2 tablespoons light corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a light golden brown, about 10 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, stir together milk, vanilla, half of sugar, and salt. In a large bowl, whisk together egg and egg yolks. Add starch and remaining sugar and whisk until very pale yellow in color, about 2 minutes. Set aside. Place saucepan with milk mixture over low heat and bring to a simmer, stirring occasionally. When it starts to bubble, remove from the heat. Temper the eggs with the hot liquid in small amounts, whisking constantly with each addition. Once all of the liquid has been poured into the eggs, pour the mixture back into the pot and whisk constantly over low heat until the mixture begins to thicken and bubble. From the point you see the first bubble, whisk for two additional minutes, then pour the custard into the pie shell and press plastic wrap against the top. Allow the custard to cool at room temperature, then chill in the fridge for at least two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve, placed the chopped chocolate in a bowl. In a medium-sized saucepan, combine the cream and corn syrup and bring to a simmer over medium heat. Once the cream begins to simmer, pour the cream over the chocolate and allow it to sit for 2 minutes. Stir the mixture until the chocolate is smooth. Pour the chocolate glaze over the top of the chilled pie and smooth with an offset spatula, and serve immediately.</p>"}]}