{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120402-199997-silken-tofu-and-edamame-soup-primary-2.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Andrea Nguyen", "cold soup", "Cook the Book", "edamame", "soup", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andrea Nguyen's Silken Tofu and Edamame Soup", "link": "https://www.seriouseats.com/recipes/2012/04/andrea-nguyens-silken-tofu-and-edamame-soup-recipe.html", "description": "A duo of soy beans makes this <strong>Silken Tofu and Edamame Soup</strong> a truly lovely and very telling dish, one that encompasses the multifaceted beauty of the soy bean. Adapted from <em><strong><a href=\"http://www.amazon.com/Asian-Tofu-Discover-Best-Make/dp/1607740257/?tag=serieats-20\">Asian Tofu</a></strong></em> by <a href=\"http://www.vietworldkitchen.com/blog/about_andrea_nguyen.html\">Andrea Nguyen</a>, this mild, pea green Japanese soup can be enjoyed warm, chilled or at room temperature. It's all about the subtly of the edamame purée and creamy silken tofu.", "totalTime": "45 minutes", "recipeYield": "serves 4 to 6 with 2 or 3 other dishes", "recipeCategory": ["Cook the Book", "Soups and Stews", "Tofu", "Vegetarian"], "recipeIngredient": ["1/4 cup packed cooked white rice (short, medium, or \u2028long grain)", "1/4 teaspoon salt", "1 1/2 cups water, filtered or spring preferred", "6 ounces (1 rounded cup) frozen edamame, thawed and \u2028at room temperature", "About 1 1/2 teaspoons white (shiro) miso", "About 1 cup <a href=\"http://www.seriouseats.com/recipes/2009/10/how-to-make-dashi-asian-miso-soup-bonito-flakes-kelp-kombu.html\">Dashi Stock</a>", "8 ounces silken tofu ", "Japanese ground chile pepper (ichimi togarashi), fresh citrus zest, or 6 edible flower petals, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine the rice, salt, and water. Bring to a simmer over medium heat. Partially cover, and adjust the heat to allow the mixture to gently bubble for 10 to 12 minutes. The rice will enlarge and release its starch into the water, creating a slightly thick opaque mixture similar to a thin gruel. Add the edamame, then turn off the heat. Set aside for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the rice gruel and edamame to a blender. Add the miso and blend until smooth. Add the dashi stock and continue blending to incorporate the liquid well. Taste and add extra miso or dashi if you want a more savory flavor or thinner soup, respectively. Pour through a mesh strainer positioned over a bowl or saucepan; stir to facilitate straining. Discard the solids. Cover and refrigerate up to a day in advance. You should have about 3 cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The soup may be served cold, warm, or hot. If you are serving the soup warm or hot, bring the tofu to room temperature or warm it by letting it sit in hot water for about 10 minutes. Regardless, cut the tofu into 4 to 6 blocks (one for each serving); use a crinkle cutter if you want pretty ridged surfaces.</p>\r\n\r\n<p>Place each block of tofu in a shallow soup bowl, then ladle the soup around it. Top the tofu with the garnish of your choice and serve.</p>"}]}