{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120705-tomatoes-provencal-main-edit.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "French", "keywords": ["French", "gruyere", "stuffed tomatoes", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Provençal Tomatoes (Baked Tomatoes Stuffed with Cheese and Breadcrumbs)", "link": "https://www.seriouseats.com/recipes/2012/08/provencal-tomatoes-recipes.html", "description": "Provençal tomatoes couldn't be simpler to make: cut tomatoes in half, scoop out their innards, and fill them with a quick but flavor-packed stuffing made of fresh bread crumbs, grated Gruyere cheese, garlic and fresh or dried herbs. Drizzled with a little olive oil, they bake in the oven until the stuffing soaks up those wonderful tomato juices, becoming soft and tender, yet brown and crusty on top.", "totalTime": "1 hour", "recipeYield": "serves 4 to 6", "recipeCategory": ["French", "Mains", "Tomato", "Vegetarian"], "recipeIngredient": ["1/2 cup plus 3 tablespoons extra virgin olive oil, divided", "6 large, firm tomatoes, halved crosswise", "4 to 6 ounces rustic white bread (such as ciabatta), torn into large pieces (about 1 quart)", "1 cup plus 1/4 cup grated Gruyere cheese, divided", "1 small shallot, peeled and finely chopped (about 2 tablespoons)", "2 medium cloves garlic, chopped (about 2 teaspoons)", "1/4 cup chopped fresh parsley leaves", "1 teaspoon dried thyme", "1/2 teaspoon crushed red pepper flakes", "1 teaspoon zest from one lemon", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400&deg;F. Brush an 11- by 13-inch glass baking dish with one tablespoon of olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the tomatoes</strong>: Using a small, sharp paring knife, cut around the inside wall of the tomato to loosen the seeds and jelly. Then, working over a large, deep bowl, use a tablespoon to gently scrape out the seeds and flesh, taking care to leave the tomato intact. Make sure each tomato half sits flat. If it doesn't, use the paring knife to shave a small slice off the bottom of the tomato, which will ensure that it sits level in the dish. Place tomato halves in baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the filling</strong>: Place bread pieces in the bowl of a food processor. Pulse to create breadcrumbs. You should have two cups. Add 1/2 cup Gruyere, shallot, parsley, thyme, red pepper, lemon zest, and salt and black pepper to taste, and pulse to combine. With the machine running, drizzle 1/2 cup of olive in through the spout in the lid. Blend until mixture clumps together slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide filling evenly between 12 tomato halves, pressing down slightly on the filling. Sprinkle remaining Gruyere over tomatoes. Drizzle tomatoes with remaining 2 tablespoons olive oil and bake until filling puffs and browns and tomatoes just start to split, about 40 minutes. Serve hot or at room temperature.</p>"}]}