{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120705-213500-grape-nuts-ice%20cream.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "frozen desserts", "grape nuts", "ice cream", "ice cream month"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grape-Nuts Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/07/grape-nuts-ice-cream-recipe.html", "description": "What's so great about Grape-Nuts ice cream? Besides the fact that it's the perfect breakfast food (hello, cereal and milk!), those little cereal nuggets make a great crunchy mix-in.", "totalTime": "6 hours and 30 minutes", "recipeYield": "Makes about 1 quart", "recipeCategory": ["American Classics", "Ice Cream and Frozen Treats"], "recipeIngredient": ["6 egg yolks ", "2 cups heavy cream", "1 cup whole milk", "2/3 cup sugar", "1 (4-inch) vanilla bean", "1/4 teaspoon salt", "1 cup Grape-Nuts cereal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl lightly beat egg yolks and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan add cream, milk, and sugar. Split vanilla bean lengthwise and use the tip of the knife to scrape out the seeds. Add the seeds to the cream mixture along with a pinch of salt. Whisking occasionally, heat mixture over medium low heat until bubbles begin to form along the edges of the pan. Remove from heat and add heated cream mixture to the eggs one tablespoon at a time while whisking constantly to temper the eggs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cream mixture and eggs have been combined return to the saucepan and heat on medium low until mixture coats back of a spoon or spatula and line drawn with a finger leaves a distinct trail. Mixture should register 170° to 175° F, do not allow mixture to overheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour custard into a medium bowl and set over an ice bath. Let cool at room temperature for 1 hour, stirring occasionally, then cover and refrigerate for 2 more hours or up to overnight until completely chilled. Churn chilled custard according to your ice cream maker's instructions, adding the Grape-Nuts in the last 5 minutes of churning. Transfer ice cream into a bowl or container that will hold 1 quart. Cover and freeze for at least 3 hours to fully set. Serve</p>"}]}