{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120829WholeRoastTroutPreOven.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["asparagus", "Dinner for Two", "fish", "light eating", "potatoes", "seafood", "trout"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Whole Roast Trout with Potatoes and Asparagus", "link": "https://www.seriouseats.com/recipes/2012/08/whole-roast-trout-dinner-with-potatoes-and-asparagus.html", "description": "A whole roast rainbow trout stuffed with lemons and lemon thyme, roasted with new potatoes and asparagus--per person!  A hearty, healthy, fast weeknight feast.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Asparagus", "Dinner for Two", "Fish", "Mains", "Potato"], "recipeIngredient": ["1 pound baby new potatoes, halved", "1 pound asparagus stalks, trimmed and cut in half crosswise", "2 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "2 whole rainbow trout, scaled, gutted, and gilled", "Half a lemon, thinly sliced", "1 bunch lemon thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat 425°F. Place potatoes in a large saucepan and cover with cold water by 1-inch. Bring to a boil and cook until barely tender, about 10 minutes. Drain. Arrange the asparagus and potatoes on a large parchment-lined baking sheet. Drizzle with 1 tablespoon of olive oil and season with salt and pepper. Toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the trouts inside and out with the remaining tablespoons of olive oil and season inside and out with salt and pepper. Stuff the cavitites of the two trout with the lemon slices and fresh thyme. Arrange the two fish on the baking sheet with the vegetables so that everything is in a single layer.  Roast for 25 minutes until the potatoes are crisp and tender and the fish is cooked through.  Serve immediately.</p>"}]}