{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120912-dt-tyler-florence-peach-mozzarella-crispy-prosciutto-salad.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "peaches", "prosciutto", "salad", "tyler florence"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tyler Florence's Peach, Mozzarella, and Crispy Prosciutto Salad", "link": "https://www.seriouseats.com/recipes/2012/09/tyler-florences-peach-mozzarella-and-crispy-p.html", "description": "While the summer months are over and fall is approaching, this is nonetheless one of the best times of year for cooking, in my opinion&mdash;not to mention eating outside. The weather is a tad cooler, but the produce is still excellent. In that spirit, I selected this recipe from Tyler Florence, which relies on gorgeous, juicy peaches as a counterpoint to shaved fennel, peppery watercress, creamy mozzarella, and crisp slices of prosciutto.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Mains", "Peach", "Salads"], "recipeIngredient": ["4 ripe peaches, pitted and cut into large wedges", "1/2 fennel bulb, shaved into thin crescents (preferably with a mandoline)", "8 thin slices prosciutto", "2 cups fresh watercress", "2 tablespoons balsamic vinegar", "1/4 cup extra virgin olive oil", "kosher salt and freshly ground black pepper", "8 oz fresh mozzarella, preferably buffalo, cut into bite-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pre-heat oven to 350° Fahrenheit. On a baking sheet, lay the slices of prosciutto in a single layer. Bake until firm and golden, 15&ndash;20 minutes. The prosciutto may not be crisp in the oven, but will become crisp as it cools.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, toss the peaches, fennel, and watercress together in a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, make the dressing by whisking together the vinegar and oil, adding the oil in a slow stream to create an emulsion. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the vegetables together with the dressing and arrange on a serving platter or on plates. Nestle the mozarella amongst the ingredients, and top with the crisp prosciutto.</p>"}]}