{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120130-190642-raspberry-double-crust.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Handheld Pies", "pies", "Rachel Wharton", "raspberries", "Sarah Billingsley"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Raspberry Double-Crust Jar Pie", "link": "https://www.seriouseats.com/recipes/2012/02/raspberry-double-crust-jar-pie-recipe.html", "description": "Tucking a buttery crust into a little jar and filling it with raspberries tossed with brown sugar, lemon zest, and just enough flour makes for a mini-pie that browns up beautifully and somehow stays crisp on both the top and bottom crusts.", "totalTime": "3 hours", "recipeYield": "Makes 8 double-crust pies", "recipeCategory": ["Bake the Book", "Desserts", "Pies, Tarts, and Crumbles", "Raspberry"], "recipeIngredient": ["1 recipe Flaky Butter Crust (recipe follows)", " All-purpose flour for dusting", "1 egg", "&nbsp;", "<strong>Raspberry (or Other Tart Berry) Filling </strong>", "2 cups fresh or frozen raspberries (if frozen, do not thaw) \u2028", "1/4 to 1/2 cup loosely packed light or dark brown or granulated sugar ", "1 tablespoon all-purpose flour\u2028", "1/2 teaspoon grated lemon zest", "Pinch of kosher salt ", "&nbsp;", "<strong>Flaky Butter Crust</strong>", "1 cup cold unsalted butter ", "\u20282 cups all-purpose/plain flour, plus more for dusting", "1 teaspoon sugar", "1 teaspoon kosher salt", "1 cup cold unsalted butter, cut into 1/2-inch cubes", "3 to 5 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Flaky Butter Crust:</strong> Cut the butter into 1/2-inch pieces, and freeze them while you measure and mix the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dough in a food processor:</strong> Combine the flour, sugar, and salt in the processor and pulse three or four times to mix. Retrieve the butter cubes from the freezer, scatter them over the flour mixture, and pulse until the mixture forms pea-size clumps. Add the ice water, 1 tablespoon at a time, and pulse to mix, adding just enough water for the dough to come together. </p>\n\n<p><strong>To make the dough by hand:</strong> In a large bowl, whisk together flour, sugar, and salt. Retrieve the butter cubes from the freezer and distribute them evenly in the flour mixture, coating them with the flour mixture. Sink your fingers into the mixture and begin pinching the butter and flour together, making thin, floury disks of the butter. Continue working the mixture until the butter is broken down first into floury pea-sized beads and then into a loose mixture that resembles wet sand. Drizzle in 3 tablespoons of the ice water and use your hand like a comb to mix in the liquid just until the dough holds together. If necessary, add additional water, 1 tablespoon at a time, until the dough comes together in a crumbly mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a clean, floured work surface or sheet of parchment paper. Gather the dough together in a mound, then knead it a few times to smooth it out. Divide it in half, and gently pat and press each half into a rough rectangle, circle, or square about 1 inch thick. The shape you choose depends on what shape you will be rolling out the dough. If you don’t know how you will be using the dough at this point, opt for a circle. Wrap in plastic wrap or in the parchment paper and refrigerate for at least 2 hours or up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pies:</strong> Have eight half-pint jars ready. Remove half of the dough from the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a clean work surface. Unwrap the dough, place it on the floured work surface, and flour the top lightly. Roll out the dough into a square measuring 12 to 14 inches and about 1/8 inch thick. Cut the square into six uniform squares or circles. Roll out the remaining half of the dough the same way and cut out two more squares or circles of the same size and eight circles the same size as the mouth of the jar. You can flip over a jar and use it to cut these circles (it’s a perfect fit!), or use a biscuit or cookie cutter. If needed, gather the dough scraps from both halves, form into a ball, and roll out to cut more circles. (Reroll the dough only once or it will bake up tough.) <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To line each jar, hold the jar in your nondominant hand (left hand if you are right-handed, for example) and pick up a square or circle dough in your other hand. Position the dough over the jar mouth and then gently stuff it into the jar, pressing it against the bottom and up the sides of the jar and centering it as you work. Then, using your thumbs, press the dough gently against the sides of the jar while rotating the jar slowly in a clockwise motion. Make sure the dough is clinging to the sides of the jar. It should not extend more than three-fourths of the way up the sides of the jar. Repeat to line the remaining jars.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternatively, carefully lift the dough round or square and fold it in half. Then, with the folded side down and the open edges facing up, lower the dough into the jar, open it, and press the dough from the middle outward to the sides of the jar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> In a bowl, combine all of the ingredients, adding the sugar to taste. Mix gently so as not to crush the berries. Use immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To fill the Pies:</strong> Fill each pastry-lined jar with about 2/3 cup. Do not fill the crusts to the top. (The jars should be no more than three-fourths full.) You want to leave at least 1/4 inch of dough above the filling uncovered so you can attach the top crust. Now, lay a dough circle on top of the filling in each jar, and use your fingers or a fork to tease the edges of the crusts gently together. Cut a few small slashes in the top of each pie to allow the steam to vent. Refrigerate for at least 30 minutes or up to 24 hours. (At this point, the unbaked pies can be covered with a lid and frozen for up to 2 months.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Just before baking, in a small bowl, whisk together the egg and 1 tablespoon water until blended. Brush the top crust of each pie with the egg mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the jars on a rimmed baking sheet, place in the oven, and bake until the top and side crusts are golden, about 25 minutes. Remove from the oven and let cool on a baking rack for at least 1 hour before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the pies have cooled for 1 hour, they can be popped out of the jars. Holding a jar in your nondominant hand, run a sharp, thin knife around the inside rim of the jar with your other hand to loosen any filling that may have stuck to the glass. Then gently invert the pie into your palm. It should slide from the jar with little resistance. If it sticks, coax it out gently by running the knife along the inside edge of the jar. Once the pie slides free of the jar, quickly invert it onto a plate or the baking rack. Serve warm or at room temperature. </p>"}]}