{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120324-198527-dinner-tonigh-kale-chorizo-poached-eggs-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chorizo", "egg", "kale", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kale with Chorizo and Poached Eggs", "link": "https://www.seriouseats.com/recipes/2012/03/kale-with-chorizo-and-poached-eggs.html", "description": "Kale fans, pay attention! You'll notice that kale is mentioned first in the title, and that's no mistake. This recipe from Nigella Lawson's <em><a href=\"http://www.amazon.com/How-Eat-Pleasures-Principles-Good/dp/0470173548/ref=sr_1_1?ie=UTF8&amp;qid=1332452630&amp;sr=8-1\">How to Eat</a></em> calls for nearly a bunch of kale per person, which kind of makes the poached egg on top look a little lost. Of course, it's true that the kale is cooked for a few minutes in boiling water, so it does wilt to a more manageable size.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner Tonight", "Eggs", "Kale", "Mains", "Vegetarian"], "recipeIngredient": ["12 ounces curly kale, stems removed, roughly chopped ", "2 tablespoons vegetable oil ", "8 ounces dried Spanish chorizo, halved lengthwise, and the sliced crosswise 1/4-inch thick", "2 eggs", "2 tablespoons white vinegar ", "salt and pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add the kale and cook until tender but not completely soft, five to seven minutes. Drain in a colander when done. When cool, squeeze out some of the excess water.  <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large skillet set over medium heat. Add the chorizo and cook until it has rendered some of its fat, three to four minutes. Add the kale, season with salt and pepper, and toss well. Cook until the kale is coated in the chorizo drippings and is bright green. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the poached eggs, pour water into a medium-sized saucepan and fill with two to four inches of water. Bring to a bare simmer. Crack each egg into a separate shallow dish. Once tiny little bubbles start to rise from the saucepan, add the white vinegar. Gently slide each egg into the water. If necessary, you can use a spoon to move the whites closer to the yolk. Cook until the whites have completely set, three to four minutes. (<a href=\"http://www.seriouseats.com/2010/04/how-to-poach-an-egg-instructions-breakfast.html\">This guide has more detailed instructions</a>.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the eggs are cooking, divide the kale and chorizo mixture between two plates. When the eggs are finished, remove each with a slotted spoon, letting as much of the water drip off as possible. Top each pile of kale with a poached egg. Season with more salt and pepper to taste. Serve immediately. </p>"}]}