{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120531-208730-chicken-and-vegetable-quiche.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "egg", "Lorraine Wallace", "Mr. Sunday's Saturday Night Chicken", "quiche"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Lorraine Wallace's Quick Chicken and Vegetable Quiche", "link": "https://www.seriouseats.com/recipes/2012/06/lorraine-wallaces-quick-chicken-and-vegetable.html", "description": "After a week's worth  of chicken recipes from <strong>Lorraine Wallace</strong>'s <em><strong><a href=\"http://www.amazon.com/Mr-Sundays-Saturday-Night-Chicken/dp/1118175301/?tag=serieats-20\">Mr. Sunday's Saturday Night Chicken</a></strong></em>, we're bound to end up with some leftovers.  Chicken salad?  Well, sure, but how about something a little different, a little unexpected. How about this Quick Chicken and Vegetable Quiche?", "totalTime": "1 hour", "recipeYield": "serves 6", "recipeCategory": ["Chicken", "Cook the Book", "Eggs", "Quiche"], "recipeIngredient": ["1 refrigerated pie crust ", "2 tablespoons extra-virgin olive oil", "1 large yellow onion, thinly sliced", "1 teaspoon coarse salt", "1/2 cup fresh asparagus, tough woody stems snapped off and discarded, cut into 1/2-inch pieces ", "1 1/2 cups cooked shredded chicken, from a store-bought rotisserie chicken or leftover roasted chicken", "5 large eggs, beaten", "3/4 cup whole milk", "Freshly ground black pepper", "1 cup Gruyère or Emmenthal Swiss cheese, shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the refrigerated pie crust and line a 9- or 10-inch pie or quiche plate. Prick the dough all over with the tines of a fork and crimp the edges between your thumb and forefinger so they form a pattern along the top edge of the plate. Place a piece of aluminum foil into the tart shell and weight with pie weights, uncooked rice, or dried beans. Prebake the shell until crisp, 10 to 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the oil in a large skillet over medium heat. Add the onions and sprinkle with the salt. Cook, stirring, until the onions are wilted and translucent, about 5 minutes. Reduce the heat and continue to cook, stirring occasionally, until the onions have softened completely and are lightly caramelized, another 20 minutes. Add the asparagus to the skillet and toss until slightly cooked, about 3 minutes. Add the chicken and toss together with the asparagus and onions until heated through, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven temperature to 375°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large measuring cup, whisk the eggs and milk together and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the prebaked pie crust on a baking sheet to prevent any egg mixture from spilling into the oven and place the meat-vegetable mixture into the crust, top with grated cheese, and then carefully pour over the egg-milk mixture. Bake for 35 minutes, or until the top begins to brown and the custard is almost set in the middle. Allow to stand for 10 minutes before slicing and serving.</p>"}]}