{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120911-221894-cook-the-book-knishes.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Kosher", "keywords": ["Cook the Book", "dumplings", "Jewish", "knishes", "mile end", "mile end deli", "noah and are bernamoff"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mile End's Knishes", "link": "https://www.seriouseats.com/recipes/2012/09/mile-ends-knishes.html", "description": "More than just a fun-to-say word, knishes are emblematic of Jewish deli snacks. Their hearty nature and portable shape make for an easy, if heavy, snack on the go. The version at the <strong><a href=\"http://www.mileenddeli.com/\">Mile End Deli</a></strong> is a different shape than most: rolled into a log instead of shaped into a dumpling, transforming the knish into light(-er) fare.", "totalTime": "5 hours", "recipeYield": "makes 12", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bread", "Chicken", "Cook the Book", "Kosher", "Sides"], "recipeIngredient": ["<strong>For the Filling</strong>", "2 pounds russet potatoes (about 4 potatoes), scrubbed clean", "1 1/2 pounds yukon gold potatoes (6 to 8 potatoes), scrubbed clean", "2 parsnips, peeled and roughly chopped", "1/2 celery root, peeled, trimmed, and roughly chopped", "2 medium white onions, roughly chopped", "3 tablespoons <a href=\"http://www.seriouseats.com/recipes/2012/09/mile-ends-gribenes-and-schmaltz.html\">Schmaltz</a> or canola oil", "2 fresh bay leaves", "Diamond Crystal kosher salt and freshly ground black pepper", "3 large eggs", "&nbsp", "<strong>For the Knish Dough</strong>", "8 large eggs, beaten", "3/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/09/mile-ends-gribenes-and-schmaltz.html\">Schmaltz</a>, at room temperature, or canola oil", "5 1/3 cups all-purpose flour (reduce flour to 5 cups if using canola oil)", "4 teaspoons baking powder", "2 teaspoons Diamond Crystal kosher salt", "1 additional large egg, beaten, for the egg wash", "Poppy seeds, sesame seeds, caraway seeds, or other toppings of your choice", "Spicy brown mustard, such as Gulden's, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Filling:</strong> Preheat the oven to 375 degrees. Bake the russet and Yukon gold potatoes on a 10- by 15-inch baking sheet until a small knife meets no resistance when piercing the center of the potatoes, 60 to 90 minutes. Set the potatoes aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the parsnips, celery root, and onions in a food processor and pulse them until finely chopped. Heat the schmaltz or oil in a large saute pan over medium heat, add the chopped vegetables and the bay leaves, and season with salt and pepper to taste. Cover and cook for about 15 minutes, stirring frequently, until the vegetables are completely tender, then uncover and cook for another 10 minutes to let the liquid evaporate. Remove from heat; discard the bay leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are cool enough to handle, peel them and pass them through a ricer into the sauteed vegetable mixture. Add the eggs and season with more salt and pepper; stir with a wooden spoon until the ingredients are thoroughly mixed together. Let cool before forming the knishes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Dough:</strong> Place 8 beaten eggs and the schmaltz or oil in the bowl of a stand mixer fitted with the paddle attachment. Combine the flour, baking powder, and salt in a large bowl and add the mixture to the bowl of the stand mixer. Mix on low speed until the dry ingredients are mostly incorporated. Increase the speed to medium and mix until the dough has a smooth, consistent texture, about 1 minute more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the dough loosely in plastic wrap and flatten it into a disk. Refrigerate for at least 1 hour or as long as overnight. (The dough can also be frozen for up to 3 weeks; thaw it in the refrigerator overnight before proceeding.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Roll and Trim the Dough:</strong> Portion the dough approximately into thirds. Flatten one third with a rolling pin or the palm of your hand to approximately 1/4 inch thick. Pass it through a pasta machine at the widest setting. Fold the dough in half, if necessary, and pass it through the rollers 1 or 2 more times until the results yield a piece that is close to the width of the machine (about 6 inches).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adding flour as necessary to prevent sticking, continue to pass the dough through the machine, making the setting more narrow with each pass until you achieve a piece that is approximately 1/16 inch thick. Place the dough on a floured surface and cut it into squares. Reserve the trimmings and incorporate into the next piece of dough to be rolled. Repeat with the other two-thirds of the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Stuff and Bake the Knishes:</strong> Preheat the oven to 375 degrees. Lightly oil a 10- by 15-inch baking sheet. Distribute about 1 cup of the filling evenly along one edge of a trimmed dough piece. Roll the dough around the filling to make a cylinder, using a spatula to help lift the bottom of the dough from the work surface where the dough is sticking. Brush the seam of the rolled knish with the egg wash and press lightly to seal it. Place the knish seam-side down on the prepared baking sheet. Repeat with the remaining dough pieces and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make 4 or 5 diagonal slashes across the top of each knish to allow for expansion while cooking. Brush each knish with a little of the egg wash and sprinkle it with the topping of your choice. Bake until golden brown, 20 to 25 minutes. Allow to cool slightly before serving. Slice each knish into 4 small logs and serve with the mustard.</p>"}]}