{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120301-195206-apple-dried-fruit-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["apple pie", "dried fruit", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Winter Apple and Dried-Fruit Pie", "link": "https://www.seriouseats.com/recipes/2012/03/winter-apple-pie-dried-fruit-recipe.html", "description": "This variation on apple pie lends some variety in texture and flavor. You can (and should) customize the sweetness, based on the levels of tartness of the apples and dried fruits that you choose.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Christmas", "Pies, Tarts, and Crumbles", "Thanksgiving"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "8 medium Golden Delicious, Braeburn, or other baking apples peeled, cored, and sliced into 1/4-inch slices", "10 ounces dried fruits (a combination of dried cherries, chopped dried figs, dried cranberries, currants, raisins)", "1 tablespoon zest from one lemon", "6 ounces granulated sugar (adjust to taste, depending on sweetness of apples and dried fruits)", "1/2 ounce cornstarch", "1 teaspoon cinnamon", "1 pinch grated nutmeg", "1 whole egg, lightly beaten", "Sanding sugar for top (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat the oven to 425°F. Place apple slices in a large bowl or pot. Pour boiling water directly over top. Cover and set aside at room temperature for ten minutes. Drain apples well and transfer to a large bowl. Allow to cool for 20 minutes, tossing occasionally. Transfer to a large bowl and toss with the dried fruit. Whisk together the sugar, starch, and spices and add to the apple mixture. Toss until well-coated. pour the contents of the bowl into the chilled pie shell. Cover with the top crust, either by cutting the chilled top crust into strips and weaving a lattice, or by covering the pie with the whole crust. Crimp the sides and chill the pie for 15 - 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, brush the top with egg wash and sprinkle with sanding sugar. If you've covered the pie with a whole top crust, cut slits in the top. Bake for 20 minutes, then turn down the heat to 375°F and bake for additional time: for non-lattice, approximately 40 minutes, for lattice, approximately 50, both rotating halfway through. The crust should be golden brown and the filling should be bubbling. If parts of the crust start to look too dark, cover the darker parts with small patches of foil to protect them from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the pie to cool completely before serving. You may make this pie in advance, but it is best served the same day that you bake it.</p>"}]}