{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120121-pizza-bianca-19.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["pizza", "pizza bianca", "recipes", "The Food Lab", "the pizza lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "No Knead Pizza Bianca", "link": "https://www.seriouseats.com/recipes/2012/01/no-knead-pizza-bianca.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: For best results, use a scale set in grams. About the author: J. Kenji Lopez-Alt is the Managing Editor of Serious Eats where he likes to explore the science of home cooking in his weekly...", "totalTime": "one day", "recipeYield": "makes 1 pizza with about 8 rectangular slices", "recipeCategory": ["Bread", "Pizza"], "recipeIngredient": ["500 grams (17.5 ounces, about 3 1/4 cups) bread flour", "10 grams (.34 ounces, about 2 teaspoons) kosher salt", "5 grams (.18 ounces, about 1 1/2 teaspoons) instant or rapid-rise yeast", "375 grams (13.25 ounces, 1 cup plus 10.5 tablespoons) lukewarm water", "1/4 cup extra-virgin olive oil", "Coarse sea salt such as Maldon or fleur de sel", "1 tablespoon finely chopped rosemary leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, salt, and yeast in a large bowl and whisk together until homogenous. Add water and stir with a wooden spoon until no dry flour remains. Cover bowl tightly with plastic wrap and allow to rest at room temperature overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, lightly flour the dough and your hands. Scrape dough out of the bowl onto a well-floured piece of parchment paper set inside a rimmed baking sheet and gently fold dough into an even blob in the center. Dust with flour and cover with a clean kitchen towel. allow to rise at room temperature until nearly doubled in volume, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>30 minutes before baking, adjust oven rack to upper-middle position, place a baking stone on it (or a double stack of rimmed baking sheets) and preheat oven to 550°F. Gently stretch the dough into an even rectangular shape (you shouldn't have to lift it). Carefully stipple the top surface with your fingertips. Drizzle with olive oil and sprinkle with coarse sea salt and rosemary if using. Transfer entire baking sheet with dough to pizza stone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 5 minutes just until the pizza is slightly firm. Remove from oven and transfer pizza to a pizza peel. Discard parchment paper. Return pizza to bake directly on the baking stone until burnished golden brown, about 10 to 15 minutes longer. Remove from oven and allow to cool for 5 minutes. Transfer to a large cutting board, cut into 8 or 12 rectangular slices, and serve. </p>"}]}