{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110406-chinese-appetizers-egg-roll-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "spring roll", "Super Bowl", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispy Bánh Mì Spring Rolls With Creamy Chili Mayo", "link": "https://www.seriouseats.com/recipes/2012/02/crispy-banh-mi-spring-rolls-with-creamy-chili-recipe.html", "description": "Spring rolls are great, and I love the flavors of bánh mì, so why not stick 'em together? These rolls are stuffed with pickled carrots and daikon radish, cucumber, jalapeño, and cilantro (you can, of course, add whatever other filling you'd like. Tofu or shiitake mushrooms would be nice).", "totalTime": "1 1/2 hours", "recipeYield": "Makes 30 to 40 small spring rolls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Christmas", "Dairy-Free", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1 large carrot, cut into 3-inch matchsticks 1/8 inch thick (about 2 cups)", "1 small daikon radish, cut into 3-inch matchsticks 1/8 inch thick (about 2 cups) ", "1/4 cup sugar", "1 tablespoon salt", "2 tablespoons white distilled or rice wine vinegar", "30 to 40 five-inch frozen spring roll wrappers, thawed", "1 large cucumber, peeled, cored, and cut into 3-inch sticks about 1/4-inch wide (30 to 40 sticks total) ", "2 whole jalapeño peppers, cored, seeded, and cut into 3-inch sticks about 1/8th inch thick (30 to 40 sticks total)", "1 bunch cilantro, leaves and thin stems only", "&nbsp;", "<strong>For the Dipping Sauce</strong>:", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2012/01/how-to-make-vegan-mayo-mayonnaise-recipe.html\">Vegan Mayonnaise</a>", "2 tablespoons chili garlic sauce such as sambal oelek or sriracha, or more to taste", "1 teaspoon juice from 1 lime", "2 tablespoons finely minced cilantro leaves", "2 quarts vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine carrots, daikon, sugar, salt, and vinegar in a large bowl and massage with hands until vegetables are softened and salt and sugar are dissolved. Set aside for 15 minutes at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay one spring roll wrapper down with a corner pointed towards you. Cover remaining wrappers with plastic or a moist clean kitchen towel. Add a half dozen carrot/daikon sticks, 1 cucumber stick, 1 jalapeño stick, and a few leaves/stems of cilantro in a bundle in the lower third of the wrapper, keeping it in a nice, tight row. Roll from the bottom corner towards the top, keeping everything nice and tight. Roll until nearly half way up, then stop.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next step is to fold the left and right corners towards the center. Start by first pressing in on the edges of the filling with your fingertips to make sure it's packed nice and tight. Fold the corners towards the center, again keeping everything tight. Moistening the edges of the wrapper with a bit of water will help it stick to itself and keep its shape.You want the bottom edge to form a 90° angle with the new edge you've just created by folding over the corner.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After both corners have been folded in, continue rolling towards the top of the paper. Moisten the top corner of the wrapper with a bit of water and continue rolling until the entire package is sealed. Repeat with remaining rolls until all the filling is used up. Finished rolls can be frozen for up to 3 months in a sealed container. If freezing, fry directly from the freezer, adding 1 minute to cook time.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make The Sauce</strong>: Combine mayonnaise, chili garlic sauce, lime juice, and cilantro. Set aside. Sauce will keep in a sealed container in the refrigerator for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Heat oil in a large wok or Dutch oven to 325°F as registered on an instant read thermometer. Add 10 to 15 rolls and cook, agitating occasionally with a wire mesh spider, until golden brown and crisp, about 4 minutes. Drain on paper towels and serve immediately with spicy mayonnaise.<br />\n</p>"}]}