{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/083112-220925-Sunday-Supper-Buffalo-Chicken-Waffles(1).jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["chicken", "Sunday Supper", "waffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Savory-Sweet Buffalo Chicken and Waffles", "link": "https://www.seriouseats.com/recipes/2012/09/savory-sweet-buffalo-chicken-and-waffles-recipe.html", "description": "Buffalo chicken and waffles commingle spicy-sweet heat with big, bold flavors, just the ticket for a breakfast-as-dinner treat.", "totalTime": "1 hour", "recipeYield": "serves 6", "recipeCategory": ["Chicken", "Mains", "Sunday Supper"], "recipeIngredient": ["2 cups (10 ounces) all-purpose flour", "1/2 teaspoon baking soda", "1 teaspoon baking powder", "1 1/2 teaspoons kosher salt, divided", "1 tablespoon sugar", "3 large eggs, separated", "4 cups buttermilk, divided", "10 tablespoons melted unsalted butter, divided", "1 1/4 cups peanut oil", "1 cup Wondra flour", "1 teaspoon cayenne pepper", "2 teaspoons garlic powder", "2 pounds raw chicken tenderloins (12 to 18 pieces total)", "1 medium clove garlic, minced (about 1 teaspoon)", "1/4 cup hot sauce, such as Frank's", "Non-stick cooking spray", "Maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat waffle iron. Adjust an oven rack to center position and preheat oven to 200&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the batter by whisking the flour, baking soda, baking powder, 1/2 teaspoon salt and sugar together in a medium bowl. Beat egg whites in a clean medium bowl until they form stiff peaks. Whisk together egg yolks, 2 cups buttermilk, and 4 tablespoons butter in a medium bowl or 1 quart liquid measure. Add to dry ingredients and stir to combine. Gently fold egg whites into flour mixture, taking care not to over mix. Allow to rest for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat oil to 325°F in a 12-inch cast iron skillet or heavy frying pan. Adjust heat to maintain temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While oil is heating, prepare breading by combining Wondra, cayenne, garlic powder and remaining 1 teaspoon of salt on a shallow pie plate or bowl. Pour the remaining 2 cups of buttermilk into a second shallow pie plate or bowl. Dredge chicken in Wondra mixture to coat. Transfer to buttermilk and turn to coat. Let excess buttermilk drip off and return to  Wondra to form a thick crust. Place breaded tenders on a wire rack for 5 minutes to allow the crust to adhere. Working one piece at at time, dip once more in Wondra flour, shake off excess, and carefully add to hot oil. Repeat with remaining tenders, frying in batches to avoid overcrowding. Fry, turning occasionally, until golden brown, 4 to 5 minutes total. Drain cooked chicken on paper towels and keep warm in preheated oven while cooking the waffles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the buffalo sauce by stirring together remaining 6 tablespoons melted butter with garlic and hot sauce in a large bowl. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray preheated waffle iron with non-stick cooking spray. Working in batches, ladle waffle batter onto the waffle iron according to the manufacturer's instructions. Close iron top and cook until the waffle is golden on both sides and is easily removed from iron, 3 to 6 minutes. Keep cooked waffles warm in the oven until ready to serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all of the chicken and waffles are cooked, remove from the oven. Transfer chicken to the wing sauce. Toss to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top waffles with buffalo chicken and a drizzle of syrup. Pass additional syrup and hot sauce at the table.</p>"}]}