{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120116-187401-twinkietiramisurec.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "desserts", "tiramisu", "Twinkie Tiramisu", "Twinkies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Twinkie Tiramisu", "link": "https://www.seriouseats.com/recipes/2012/01/twinkie-tiramisu-recipe.html", "description": "It's official: Hostess, the maker of Twinkies, has filed for Chapter 11. While this doesn't necessarily mean <a href=\"http://money.cnn.com/2012/01/11/news/companies/hostess_bankruptcy/\">the demise</a> of the iconic treat, it's as good an excuse as any to stockpile on the sweet snack cakes and make something amazing: <strong>Twinkie Tiramisu. </strong>", "totalTime": "3 hours, 20 minutes", "recipeYield": "serves 8", "recipeCategory": ["Cakespy", "Puddings and Custards"], "recipeIngredient": ["3 large eggs, separated", "1 cup strong coffee or espresso, cooled to room temperature", "1/2 cup granulated sugar", "2 tablespoons sweet marsala wine", "8 ounces mascarpone cheese, room temperature", "9-10 twinkies", "1/4 cup chocolate shavings, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 3 egg yolks, one tablespoon of espresso, sugar and marsala wine into a large bowl. Beat for 2-3 minutes. Add the mascarpone, and beat for 3-5 minutes until lump-free and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat whites with a pinch of sugar in a separate bowl until soft peaks form. Fold into the mascarpone mixture until combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap 9 Twinkies. Cut three Twinkies in half. Set the halved Twinkies to the side for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly dip one of the whole Twinkies in the remaining espresso, and then place it at the top left corner of your 8x8-inch dish (you must act quickly because it will become soft and you don't want it to fall apart!). Dip one of the half-Twinkies in espresso and fit it into the pan so that it fills the rest of the left hand side to form a \"row\". </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with three more whole and 4 more half Twinkies, so that you have four rows total. This should cover the entire bottom of the pan. If desired, stagger the rows so that halves are paired next to whole Twinkies (not necessary, but I found it gave a better visual). You will have one whole and one half Twinkie remaining; do not dip these in espresso.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently spread the mascarpone over the Twinkie-lined pan, ensuring even coverage. You can tilt the pan by hand to gently distribute the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the remaining Twinkies into coins (it is best to gently \"saw\" them with a serrated knife, as they are quite delicate) and use them, along with the chocolate shavings, to garnish the top of the Tiramisu.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let chill in the refrigerator for at least three hours before serving.</p>"}]}