{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/cookie-monster-peanut-butter-jelly-rollup-cookies.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["cookie monster", "Cookies", "kid-friendly", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Peanut Butter and Jelly Roll-Up Cookies", "link": "https://www.seriouseats.com/recipes/2012/11/peanut-butter-and-jelly-roll-up-cookies-recipe.html", "description": "In a nod to the favorite childhood snack, flaky dough is rolled up, pinwheel style, around strawberry jam and peanut butter chips.", "totalTime": "2 hours 30 minutes", "recipeYield": "makes 2 dozen cookies", "recipeCategory": ["Cookie Monster", "Cookies", "Nuts"], "recipeIngredient": ["1 cup (about 5 ounces) all purpose flour", "1/4 teaspoon salt", "1 tablespoon plus 2 teaspoons sugar, divided", "4 ounces cream cheese, diced", "8 tablespoons (1 stick) unsalted butter, diced", "1/3 cup strawberry perserves", "1/2 cup peanut butter chips", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine flour, salt, and 2 tablespoon sugar and pulse twice to combine. Add cream cheese and butter and pulse until dough is just starting to come together, but not a coherent ball, about 10 short pulses. Transfer to a lightly floured work surface and form dough into a ball, then cut ball into two equal pieces. Form each half into a disk, wrap tightly in plastic wrap, and chill in refrigerator for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two baking sheets with parchment paper. On a clean and lightly floured surface, roll out one ball of dough to a 12- by 6- inch rectangle. Brush with 1/2 strawberry jam and top with 1/4 cup peanut butter chips. Roll up, jelly-roll style, starting at the wide end. Cut into 12 cookies. Place cookies with the cut sides on the side (not facing up and down) on a baking sheet and repeat with remaining dough. Cover baking sheets with plastic wrap and let chill for 30 minutes in refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350&deg;F. Lightly beat egg with 1 teaspoon water to create egg wash. Brush each cookie with egg wash and sprinkle with remaining 2 teaspoons sugar. Bake cookies until golden, 20 to 25 minutes. If any jam has seeped out the sides while baking, use a knife to brush aside while cookies are still warm. Let cool for 5 minutes on sheet then transfer to a rack to finish cooling. </p>"}]}