{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120423-195206-cookiesandcream-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cakes", "cookies and cream", "frozen desserts", "ice cream cakes", "oreos", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Frozen Cookies n' Cream Pie", "link": "https://www.seriouseats.com/recipes/2012/05/frozen-oreos-cookies-n-cream-pie-recipe.html", "description": "Seldom do I promote a recipe so chock-full of store-bought components, but when there are Oreos involved, I make an exception. This is just the ticket for lovers of the cookies n' cream combo, when an ordinary bowl of ice cream just won't do.", "totalTime": "4 hours", "recipeYield": "makes 8 large servings", "recipeCategory": ["Pies, Tarts, and Crumbles"], "recipeIngredient": ["25 ounces Oreo chocolate sandwich cookies (this is shy of two standard packages)", "4 tablespoons unsalted butter, melted and cooled", "1 1/2 teaspoons kosher salt", "1 quart vanilla ice cream (I recommend Bryer's Vanilla Bean for its white color and fluffy texture), softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, pulverize 15 1/2 ounces of the Oreos until they make uniform crumbs, about 30 seconds. Add the butter and salt. Process until the crumbs have the consistency of wet sand, loose but can be pressed into a shapes, about 15 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the pulverized mixture into the springform pan and use your fingertips to press it into the bottom and sides to form a crust that rises two inches from the floor of the crust. Chill for at least 20 minutes. While the crust chills, twist to separate the remaining cookies and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an offset spatula, spread a 1/2 inch layer of the softened ice cream on the bottom of the crust. Cover with cookies, then a thin layer of ice cream, and repeat. Place the remaining cookies over the top. Freeze for 3 hours to solidify. 10 minutes before serving, release from the springform pan and allow the pie to sit out. Serve immediately.</p>"}]}