{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120612-209864-knead-book-sesame-white.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "knead the book", "sesame seeds", "the bread bible", "white bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Bread Bible's Sesame White Bread", "link": "https://www.seriouseats.com/recipes/2012/06/the-bread-bibles-sesame-white-bread.html", "description": "I love an unassuming white bread. It's great for sandwiches, for toast, for croutons, and a well-done loaf of white has plenty of flavor. When I saw this recipe for a sesame-covered white bread where the dough was kneaded in the food processor, I had to give it a try.", "totalTime": "3 hours, 15 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread Baking", "Yeast Bread"], "recipeIngredient": ["3/4 cup lukewarm milk (105˚ to 115˚F)", "2 1/2 teaspoons active dry yeast", "1/2 teaspoon sugar", "3 cups bread flour", "1 teaspoon salt", "2 tablespoons unsalted butter, at room temperature, cut into pieces", "1 large egg", "3 tablespoons sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 2-cup liquid measure, pour in the lukewarm milk. Sprinkle the yeast and sugar over the surface of the warm milk. Stir to dissolve and let stand at room temperature, until foamy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the work bowl of a food processor fitted with the metal blade, combine the flour, and salt. Dot the top with the butter pieces. Process for 5 seconds. With the motor running, immediately pour the yeast-milk mixture and the egg through the feed tube in a steady stream as fast as the flour mixture will absorb it. After the dough forms a soft, elastic ball and cleans the sides of the bowl, process 45 seconds more to knead. If the dough is sticky, add flour by the tablespoonful. If it is too dry, add water by the teaspoonful.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a plastic dough scraper, transfer the dough ball to a clean work surface and give a few kneads by hand to even out the dough consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough into a lightly greased container. Turn once to grease the top and cover with plastic wrap. Let rise at room temperature until doubled in bulk, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a floured work surface. Grease and 8 1/2-by-4 1/2-inch clay or metal loaf pan. Shape the dough into an oblong loaf. Place the sesame seeds on a piece of wax paper or a plate and roll the entire loaf in the seeds, coating it heavily. Place the loaf in the pan. Cover loosely with plastic wrap and let rise again at room temperature until it reaches 1 inch about the top of the pan, 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Twenty minutes before baking, preheat the oven to 375˚F. Using a sharp knife, slash 1 long crease lengthwise across the top, not more than 1/2 inch deep. Place the pan on the center rack of the oven and bake 40 to 45 minutes, or until lightly browned and the bottom sounds hollow when tapped with your finger. Transfer the loaf immediately to a cooling rack. Cool before slicing.</p>"}]}