{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/121112-233448-jello-poke-cake.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "cake", "Christmas", "Jell-O", "layer cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Holiday Jell-O Poke Cake", "link": "https://www.seriouseats.com/recipes/2012/12/holiday-christmas-jell-o-poke-cake-recipe.html", "description": "The basic recipe is simple: 1 box white cake mix + 1 box Jell-O = fun. We've saved the fun, but made the cake from scratch.", "totalTime": "5 hours", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Cakes"], "recipeIngredient": ["<strong>For the Cake</strong>", "3 cups all-purpose flour  ", "3/4 teaspoon baking powder ", "1/4 teaspoon salt ", "1 1/2 cups unsalted butter, slightly softened", "2 1/2 cups granulated sugar ", "5 eggs", "1 tablespoon vanilla extract", "1 cup milk", "1 (3 ounce) package of red Jell-O (I used Black Cherry)", "1 (3 ounce) package of lime Jell-O", " ", "<strong>For the Frosting</strong>", "1 1/2 sticks (10 ounces) unsalted butter, slightly softened", "2 1/2 cups confectioners sugar", "2 teaspoons vanilla extract", "1/4 cup heavy whipping cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to middle position and preheat oven to 350°F. Grease and flour two cake pans and set aside. In a medium bowl whisk together flour, baking powder, and salt, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of a stand mixer fitted with a paddle attachment, cream butter and sugar together on high speed until light and fluffy (about 5 minutes). Reduce mixer speed to medium and add eggs, one at a time, mixing well between each addition until incorporated and scraping down sides with a rubber spatula as needed. Once eggs have been added, mix in vanilla. Alternate adding dry ingredients and milk a third at a time on low speed, mixing until just incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour batter into prepared pans and bake until a cake tester comes out clean, approximately 45 to 50 minutes. Cool ten minutes in pan. Then loosen sides and remove and cool completely on a wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While cake is cooling, bring 1 cup water to boil (if you want to use 2 flavors you'll need 2 cups of boiling water). Add boiling water to a small bowl (or bowls, if you're using multiple flavors), pour in the Jell-O and stir until dissolved. Once cake has cooled return it to a cleaned pan, top side up. Use a fork to poke holes in the top of the cake at regular intervals then pour 1/2 cup of Jell-O evenly over the top of each layer (if you are using two flavors you will have extra Jell-O which you can use or dispose of as you wish). Cover and refrigerate for 3 hours or up to overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the frosting</strong>: In the bowl of a stand mixer beat the butter on medium until well softened. Add sugar and continue beating until incorporated then add vanilla and cream until thoroughly combined. Frost cake and serve. </p>"}]}