{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120730-215477-wellesleyfudge3.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "chocolate cakes", "fudge"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Wellesley Fudge Cake", "link": "https://www.seriouseats.com/recipes/2012/07/wellesley-fudge-cake-recipe.html", "description": "Wellesley Fudge cake, a deeply decadent chocolate cake topped with a slab of fudge frosting, seems an unlikely sweet to associate with the prim-and-proper ladies of Wellesley (the college featured in the classic feat of cinema Mona Lisa Smile). But it's true: fudge, and the cake, both have strong ties to ladies' colleges.", "totalTime": "3 hours", "recipeYield": "Serves 12", "recipeCategory": ["Cakes", "Cakespy", "Chocolate"], "recipeIngredient": ["<strong>For the Cake:</strong>", "2 1/2 cups (about 12 1/2 ounces) flour", "2 teaspoons baking soda", "1 teaspoon baking powder", "1/2 teaspoon salt", "3/4 cup hot water", "1/2 cup (about 1 1/2 ounces) Dutch-processed cocoa powder (Hershey's Special Dark also works)", "1 cup (2 sticks) unsalted butter, softened", "2 cups (about 14 ounces) granulated sugar", "2 large eggs", "1 cup (about 8 ounces) buttermilk, at room temperature", "2 teaspoons vanilla extract", " ", "<strong>For the Frosting:</strong>", "1 1/2 cups (about 11 1/4 ounces) packed light brown sugar", "1 cup (about 8 ounces) evaporated milk", "1/2 cup (1 stick) unsalted butter, softened and cut into 1/2 inch pieces", "1/2 teaspoon salt", "8 ounces bittersweet chocolate, coarsely chopped", "1 teaspoon vanilla extract ", "3 cups (about 12 ounces) confectioners' sugar, sifted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust an oven rack to the middle position and heat the oven to 350&deg;F. Grease and flour two 8-inch square or round baking pans, then line the bottoms with parchment paper. Combine the flour, baking soda, baking powder and salt in a bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt the chocolate with the hot water. In the bowl of a stand mixer fitted with the paddle attachment, cream the butter and granulated sugar together with an electric mixer on medium-high speed until light and fluffy. Beat in the eggs, one at a time, until incorporated. Mix in one-third of the flour mixture, followed by 1/2 cup of the buttermilk. Repeat with half of the remaining flour mixture and the remaining 1/2 cup buttermilk. Add the remaining flour mixture and vanilla extract and mix until combined. Reduce the mixer speed to low and slowly add the cocoa mixture until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give the batter a final stir with a rubber spatula to make sure it is thoroughly combined. Scrape the batter into the prepared pans, smooth the tops, and gently tap the pans on the work surface to settle the batter. Bake the cakes until a toothpick inserted in the center comes out with a few crumbs attached, 25 to 30 minutes, rotating the pans halfway through baking. Let the cakes cool in the pans for 15 minutes. Run a small knife around the edges of the cakes, then flip them out onto a wire rack. Peel off the parchment paper, flip the cakes right side up, and let cool completely before frosting, about 2 hours. (The cakes can be wrapped tightly in plastic wrap and stored at room temperature for up to 2 days.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting:</strong> Stir together the brown sugar, 1/2 cup of the evaporated milk, 4 tablespoons of the butter, and salt in a large saucepan and cook over medium heat until small bubbles appear around the edge of the pan, 4 to 8 minutes. Reduce the heat to low and simmer, stirring occasionally, until large bubbles form and the mixture has thickened and turned deep golden brown, about 6 minutes. Transfer to a large bowl. Stir in the remaining 1/2 cup evaporated milk and remaining 4 tablespoons butter until the mixture has cooled slightly. Add the chocolate and vanilla and stir until smooth. Whisk in the confectioners’ sugar until incorporated. Let the frosting cool to room temperature, stirring occasionally, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the edges of a cake platter with strips of parchment paper to keep the platter clean while you assemble the cake. Place one of the cake layers on the platter. Spread 1 cup of the frosting over the cake, right to the edges. Place the second cake layer on top, press lightly to adhere, and spread the remaining frosting evenly over the top and sides of the cake. Refrigerate the cake until the frosting is set, about 1 hour. Remove the parchment strips from the platter before serving.</p>"}]}