{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120417-202148-curry-leaf-fried-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "curry leaves", "Eat With Your Hands", "fried chicken", "Zakary Pelaccio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zakary Pelaccio's Curry Leaf Fried Chicken", "link": "https://www.seriouseats.com/recipes/2012/04/zakary-pelaccios-curry-leaf-fried-chicken.html", "description": "Reading through this recipe for <a href=\"http://fattycrew.com/the-crew/zak-pelaccio/\">Zak Pelaccio</a>'s <strong>Curry Leaf Fried Chicken</strong> from <em><strong><a href=\"http://www.amazon.com/Eat-Your-Hands-Zak-Pelaccio/dp/0061554200/?tag=serieats-20\">Eat with Your Hands</a></strong></em>, you might not believe that the finished product is really just good old fried chicken.  After all, how many recipes call for brining your bird in <a href=\"http://en.wikipedia.org/wiki/Cincalok\">cincalok</a>, a Malaysian fermented shrimp sauce, and sprinkling it with curry leaves once it's out of the oil?", "totalTime": "1 day", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Deep Frying", "Fried Chicken"], "recipeIngredient": ["<strong>For brining the chicken:</strong>", "One 8-ounce bottle cincalok, a Malaysian fermented shrimp condiment ", "2 garlic cloves, crushed and peeled ", "2 tablespoons black peppercorns ", "2 tablespoons coriander seeds", "1 dried bay leaf ", "1 whole chicken (about 3 pounds),  cut into 8 pieces ", " ", "<strong>Chili Vinegar</strong>", "2 cups chopped long green chilies,  such as Anaheim or Hungarian  Wax  ", "2 cups distilled white vinegar ", "1 teaspoon sea salt", " ", "<strong>For the chicken:</strong>", "2 cups all-purpose flour ", "¼ cup kosher salt ", "¼ cup freshly ground black pepper ", "6 cups neutral oil, such as  grapeseed or canola", "Coarse sea salt ", "4 sprigs fresh curry leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The day before, brine the chicken:</strong> In a large saucepan, combine the cincalok, garlic, peppercorns, coriander seeds, bay  leaf, and 2 cups water. Bring the water to a simmer over medium-high heat and cook for 10 minutes. remove the pot from the heat and let the solution cool completely. Pour the cooled mixture into a large bowl. Add the chicken pieces, tossing well, then cover the bowl with plastic wrap and refrigerate for 24 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The day before, make the chili vinegar:</strong> Puree the chilies, vinegar, and 1 teaspoon sea salt together in a blender. Transfer the liquid to a bowl and refrigerate, covered, for at least 24 hours to let the flavors meld.  Strain the mixture through a fine-mesh sieve, discarding any solids. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>That day, fry the chicken:</strong> Remove the chicken from the brine and pat it dry. Whisk together the flour, kosher salt, and pepper in a large bowl. Dredge the pieces of chicken in the flour and put them on a cooling rack set over a baking pan. Let sit them for 5 minutes and then repeat the dredging process to make sure you get a perfect coating of flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the oil in a large, heavy saucepan to 350°F over high heat  (measured on a deep-frying thermometer). once the temperature is reached, reduce the heat to medium-high to maintain it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches, add the chicken to the oil and fry until the chicken is golden, crispy, and cooked through, about 12 minutes for white meat and 15 to 17 minutes for dark. Remove the chicken pieces with a slotted spoon and place on a cooling rack. Season generously with coarse sea salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken has finished cooking, fry the curry leaves in the cooking oil until crispy, about 10 seconds, then transfer them with a slotted spoon to a paper-towel-lined plate to drain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken on a large plate and crumble some of the fried curry leaves over it. Pile a few more whole fried curry leaves on the side as a garnish and serve with a little bowl of the chili vinegar. </p>"}]}