{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120713-195206-butterscotch-pudding-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["butterscotch", "butterscotch pie", "pie of the week", "pies", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Butterscotch Pudding Pie", "link": "https://www.seriouseats.com/recipes/2012/07/butterscotch-pudding-pie-recipe.html", "description": "An easy butterscotch pudding pie with a whipped cream topping.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "6 tablespoons unsalted butter", "2 cups light brown sugar, packed", "3 tablespoons scotch whiskey", "2 cups heavy cream, divided", "4 egg yolks", "1 egg", "1/4 cup cornstarch", "3 cups 2% milk", "1/2 teaspoon salt", "1/2 cup chopped walnuts or pecans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a light golden brown, about 10 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt butter over low heat. Once butter is melted, add the brown sugar and whisk until the brown sugar is melted and begins to bubble, approximately 3 minutes. Deglaze the pan with the scotch. Add 1 cup heavy cream and whisk until any solid particles have dissolved. Set mixture aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together eggs and yolks until they are pale yellow. Add the cornstarch and whisk until the mixture is smooth and glossy. Set aside. In a large saucepan set over low heat, combine the milk and salt and bring to a simmer. Remove from heat, and temper the egg mixture with the milk by adding the milk in small amounts and whisking between additions. Pour the mixture back into the saucepan and set over low heat, stirring continuously. When the mixture begins to thicken, add the butterscotch mixture and continue to whisk. Watch for the mixture to begin bubbling, after about 3 minutes. Once it start to bubble, whisk for two additional minutes, then remove from heat. Scrape the pudding mixture into the pie shell and press plastic wrap directly on top. Chill for at least three hours, or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, whip remaining cup cream to soft peaks, sweetening with sugar if desired. Top the pie with cold whipped cream and sprinkle with nuts. Serve immediately.</p>"}]}