{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/080212-217049-Sunday-Supper-Chicken-Nicoise-primary.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["chicken", "chicken breast", "nicoise salad", "salad", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Chicken Niçoise Salad", "link": "https://www.seriouseats.com/recipes/2012/08/grilled-chicken-nicoise-salad-recipe.html", "description": "Entrée-sized, grilled chicken Niçoise is a bounty of crisp, colorful vegetables, all swathed in lively tarragon vinaigrette.", "totalTime": "5 hours", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Salads", "Sunday Supper"], "recipeIngredient": ["<strong>For the Vinaigrette:</strong>", "2 tablespoons red wine vinegar", "1/2 small shallot, minced", "1 medium clove garlic, minced (about 1 teaspoon)", "1 teaspoon Dijon mustard", "1/2 teaspoon anchovy paste or 1 chopped anchovy filet", "1 tablespoon juice from 1 lemon", "1/4 teaspoon sugar", "1 teaspoon minced fresh thyme", "2 tablespoons minced fresh tarragon", "1/2 cup extra virgin olive oil", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Salad:</strong>", "Two bone-in, skin-on chicken breasts", "1 pound small, red new potatoes, scrubbed and quartered", "4 large eggs", "3/4 pound haricots verts, trimmed", "1 head Boston lettuce, cleaned, with leaves separated and torn", "1 pint grape or cherry tomatoes, halved", "3/4 cup Niçoise or other small brine-cured black olives", "8 caper berries, stems removed and halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl whisk together vinegar, shallot, mustard, garlic, anchovy, lemon juice, sugar, thyme, and tarragon. Drizzle in olive oil, whisking constantly. Season to taste with salt and pepper. In a reasealable bag, marinate chicken in three tablespoons of prepared vinaigrette. Place in refrigerator for at least four hours and up to a day. Refrigerate remaining vinaigrette in a resealable container for later use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Remove chicken from refrigerator and pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken on the grill, skin side down. Cook until skin is crisp and just-charred, about 4 minutes. Flip chicken and continue to cook, turning occasionally until an instant read thermometer registers 155°F when inserted into the thickest part of the breast (about 20 to 30 minutes). Remove chicken from grill and allow to rest for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a pot of salted water to a boil over medium heat. You will be using the same pan to cook three salad ingredients simultaneously. Add the potatoes to boiling water and cook for 12 minutes, then add eggs and cook for two minutes longer. Place a steamer basket on top, fill with green beans, cover and steam for four minutes. Drain potatoes, eggs and green beans and rinse with cool water. Allow to cool completely. Peel and quarter eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the salad, carve chicken from the bone and slice. Scatter torn lettuce in the bottom of a large, flat bowl. Arrange the chicken, eggs, green beans, potatoes, tomatoes, olives and caper berries atop lettuce in neat, narrow rows. Whisk the vinaigrette and drizzle salad with enough dressing to coat but not drench. Taste and season with salt and fresh-cracked pepper, as needed. Lightly toss the salad with tongs tableside, and serve family-style with additional vinaigrette.</p>"}]}