{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120703-carrot-soup.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["carrot", "soup", "vegetarian", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chilled Spice-Roasted Carrot Soup with Yogurt", "link": "https://www.seriouseats.com/recipes/2012/07/chilled-spice-roasted-carrot-soup-with-yogurt-recipe.html", "description": "This bright and tangy soup is cold in temperature but warm in flavor: whole spices such as coriander, mustard and cumin seeds are roasted with the carrots, lending complexity and fragrance to the dish.", "totalTime": "3 hours (for chilling soup)", "recipeYield": "makes 2 quarts, serving 4 to 6", "recipeCategory": ["Soups and Stews", "Vegetarian"], "recipeIngredient": ["3 pounds carrots, peeled and cut into medium, uniform chunks (about 2 quarts)", "3 tablespoons neutral oil such as grapeseed or canola", "1 1/2 teaspoons whole coriander seeds", "1 1/2 teaspoons whole cumin seeds", "1 1/2 teaspoons whole mustard seeds (yellow or brown)", "Kosher salt and freshly ground black pepper", "2 tablespoons extra virgin olive oil", "2 medium onions, peeled and cut into a large dice (about 2 cups)", "3 medium cloves garlic, chopped (about 1 tablespoon)", "1 tablespoon minced fresh ginger", "1 quart vegetable broth", "1 cup plain yogurt, whole or lowfat ", "2 tablespoons juice from 1 to 2 limes", "Fresh cilantro leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 425&deg;F. In a large bowl, toss carrots, neutral oil, coriander, cumin, mustard seeds, and salt and pepper to taste. Stir well. Turn carrots out onto a large rimmed baking sheet lined with aluminum foil and roast, stirring occasionally, until carrots are tender and well-browned, about 40 minutes. Remove tray from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large, heavy-bottomed saucepan or Dutch oven over medium heat until shimmering. Add onion and cook, stirring occasionally, until onions are soft but not browned, about 4 minutes. Add garlic and ginger and cook, stirring constantly, until fragrant, about 30 seconds. Add carrots and stock, cover, and bring to a boil. Lower heat to medium-low and simmer soup, partially covered, until carrots have absorbed cooking liquid and re-plumped, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove soup from heat and use a hand blender to blend until mostly smooth. Alternatively, blend soup in a blender in two batches. Add yogurt and lime juice and blend until totally smooth (again, working in batches if using standard blender), about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let soup cool at room temperature for one hour, stirring occasionally. Transfer to refrigerator and let cool, stirring occasionally, until well chilled, about 45 minutes. Check soup for seasoning, adding more salt or pepper to taste. Serve, garnished with cilantro leaves.</p>"}]}