{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/2012-02-29-roasted-beet-salad-honey-dijon-dressing-primary.jpg", "author": {"@type": "Person", "name": "Jennifer Segal"}, "recipeCuisine": "", "keywords": ["beet salads", "beets", "salad", "serious salads", "vinaigrettes", "walnuts", "winter salads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Serious Salads: Roasted Beet Salad with Goat Cheese, Walnuts and Honey Dijon Vinaigrette", "link": "https://www.seriouseats.com/recipes/2012/02/serious-salads-roasted-beet-salad-with-goat-cheese-walnuts-vinaigrette.html", "description": "This elegant salad showcases earthy jewel-toned roasted beets, tangy goat cheese, and toasted walnuts in a sharp yet sweet honey dijon vinaigrette.", "totalTime": "1 hour", "recipeYield": "4", "recipeCategory": ["Nuts", "Salads"], "recipeIngredient": ["<strong>For the Beets:</strong>", "1 bunch medium beets (about 3)", "1 tablespoon extra virgin olive oil", "&nbsp;", "<strong>For the Vinaigrette:</strong>", "2 tablespoons honey", "1-1/2 tablespoons Dijon mustard", "3 tablespoons red wine vinegar", "1-1/2 tablespoons minced shallots", "1/2 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "6 tablespoons vegetable oil", "&nbsp;", "<strong>For the Salad:</strong>", "10 ounces mixed greens (such as radicchio, frisée and mesclun)", "3 ounces goat cheese, crumbled", "1/2 cup walnuts, toasted if desired and coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Beets: Preheat oven to 425°F.  Wipe or scrub beets clean then trim stems down to one-inch, leaving “tails” on. Place beets on a large piece of foil; drizzle with olive oil, then wrap foil around them to form a neat packet. Roast directly on rack in middle of oven until tender, about 1 hour. Test for doneness by piercing the largest beet with a knife. If it enters easily, it’s done. Unwrap beets and let sit until cool enough to handle. Use your hands or a paring knife to peel skin, then cut into ½-inch dice (I usually do this right on the aluminum foil but you can also use a stain-proof cutting board or plate). Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Vinaigrette: In a small bowl, whisk together the honey, Dijon mustard, red wine vinegar, shallots, salt and pepper. Whisking constantly, slowly add the oil in a steady stream. (Alternatively, add all your ingredients to a jar, cover with lid, and shake vigorously to blend.) Taste and adjust seasoning if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Salad: Place the greens in a large bowl, drizzle with about half of the vinaigrette and toss to combine. Add as much of the remaining vinaigrette as desired and toss again. Divide greens onto plates, then sprinkle with beets, walnuts and goat cheese. (The reason you don’t just mix it all together in a salad bowl is that the beets would turn the whole salad pink.) Serve immediately.</p>"}]}