{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120410-Keralan-Stir-Fried-Cabbage.jpeg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["Beyond Curry", "cabbage", "Indian", "Kerala", "quick", "stir fry", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cabbage Thoran (Kerala-Style Stir-Fried Cabbage)", "link": "https://www.seriouseats.com/recipes/2012/04/cabbage-thoran-kerala-stir-fried-cabbage-recipe.html", "description": "If your travels ever take you to the South Indian state of Kerala, it won't be too long before you get acquainted with the delicious cabbage thoran. Mildly spiced and brightly colored, this easy stir-fry retains the delicate taste of cabbage without drowning it in a host of spices and strong flavors. ", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["Cabbage", "Indian", "Mains", "Sides", "Stir Frying", "Vegetarian"], "recipeIngredient": ["2 tablespoons coconut oil (or any vegetable oil)", "1 teaspoon black mustard seeds", "12 curry leaves", "3 small green chilis slit lengthwise ", "2 small shallots sliced", "1/2 teaspoon ground turmeric", "1/2 teaspoon ground cumin", "2 cups finely sliced green cabbage", "Kosher salt", "3/4 cup freshly grated coconut", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large lidded saucepan, heat the oil over medium-high heat until shimmering. Add mustard seeds reduce heat to medium. Add curry leaves and cook, stirring frequently, until fragrant about 15 seconds. Add chillis and stir until fragrant, about fifteen seconds. Add onions and cook, stirring constantly, until slightly softened, about 1 minute. In quick succession add the turmeric and cumin powders and stir vigorously to ensure the spices don't burn, but the oil turns yellow, about ten seconds. Add the cabbage and salt and stir fry until just starting to wilt, about 1 minute. Put the lid on and let the cabbage cook, stirring occasionally, until wilted, 7 to 10 minutes. Remove lid, if the cabbage has released water, turn the heat up and dry it off. Once dry, add the grated coconut and stir until it's nicely mixed into the cabbage, about 30 seconds. Season to taste with salt and serve hot with rice and daal, or puris (deep fried bread).<br />\r\n</p>"}]}