{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121106-229068-bar-bites-garlic-rosemary-lamb-chops-with-honey-cider-glaze.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["apple cider", "bar bites", "lamb", "lamb chops", "rosemary"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Garlic and Rosemary Lamb Chops with Honey Cider Glaze", "link": "https://www.seriouseats.com/recipes/2012/11/bar-bites-rosemary-lamb-chops-honey-cider-glaze-recipe.html", "description": "Because of their dainty size, lamb chops make for a great finger food to serve alongside a beer or glass of wine. Each chop provides a succulent two or three-bite serving of lamb&mdash;and on top of that, the rib bone makes for a convenient built-in handle. Although corn dogs, kebabs, and satays all make for great bar bites in their own right, there is no other meat-on-a-stick option more elegant than a lamb rib chop.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 2 to 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Lamb"], "recipeIngredient": ["8 lamb rib chops (about 2 pounds total)", "Salt and freshly ground black pepper", "1/4 cup olive oil, plus 1 tablespoon", "1 tablespoon minced garlic (about 3 medium cloves)", "2 teaspoons chopped fresh rosemary", "1 tablespoon minced shallots (about 1/2 small)", "1/2 cup apple cider", "1 tablespoon cider vinegar", "1 tablespoon honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the lamb chops in a shallow dish, then season the lamb chops on all sides with salt and pepper. Combine the 1/4 cup olive oil, garlic, and rosemary in a small bowl, then pour over the lamb chops. Marinate the lamb chops in the refrigerator for 1 hour, turning the chops over once midway through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining tablespoon of olive oil in a large saute pan over medium high heat until shimmering. Working in batches, cook the lamb chops in the pan until brown and crusty, 2-3 minutes per side for medium rare. Transfer the lamb chops to a large platter and let rest at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While lamb rests, add the shallots to the pan and cook, stirring constantly, until the shallots begin to wilt and soften, 2 to 3 minutes. Pour the apple cider into the pan, stirring to scrape up any browned bits from the bottom of the pan. Stir in the vinegar and the honey, bring to a boil, then reduce heat and simmer for 5 minutes until the sauce is slightly thickened. Spoon the glaze over the lamb chops and serve immediately.</p>"}]}