{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121017-stuffed-delicata-squash.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["kale", "light eating", "squash", "stuffed squash", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Kale-Stuffed Delicata Squash", "link": "https://www.seriouseats.com/recipes/2012/10/baked-kale-stuffed-delicata-squash-recipe.html", "description": "This is one of those all-too-rare vegetarian recipes that makes a complete main course. A complex, nutty-tasting filling of leeks, apples, and kale is topped with breadcrumbs, Parmesan and butter for a crispy brown crust that nicely complements the soft, smooth flesh of the squash.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Kale", "Mains", "Squash", "Vegetarian"], "recipeIngredient": ["2 medium to large Delicata squashes, halved and seeds removed", "4 tablespoons extra virgin olive oil", "Kosher salt and freshly ground black pepper", "2 medium apples, peeled, cored and finely chopped", "2 medium to large leeks, white and light green parts only, cleaned of grit, split in half lengthwise, and sliced into 1/4-inch half moons", "2 medium cloves garlic, minced (about 2 teaspoons)", "1/2 cup raisins", "1 teaspoon dried thyme", "1 bunch kale, rinsed, thick stems removed, shredded (about 2 loosely packed quarts)", "1 cup cottage cheese", "2 eggs", "3/4 cup packaged or fresh unseasoned breadcrumbs, plus more for topping", "1/2 cup grated Parmesan cheese, plus more for topping", "1 tablespoon unsalted butter, cut into 8 small cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375&deg;F. Rub squash with 1 tablespoon oil and lightly season with salt and pepper, then lay on a baking sheet. If squash halves do not sit flat on baking sheet, use a vegetable peeler to trim a strip or two away from the bottom to allow them to lie flat. Bake until flesh is starting to turn tender and a paring knife inserted shows just a little resistance, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the stuffing. Heat remaining olive oil in a large, heavy-bottomed skillet over medium-high heat until shimmering. Add the apples and leeks and cook, stirring occasionally, until lightly browned, about 10 minutes. Stir in the garlic, raisins and thyme. Cook, stirring occasionally, until fragrant, 1 to 2 minutes. Reduce heat to medium, add kale, cover pan and cook, stirring occasionally, until kale is mostly wilted, 5 to 7 minutes. Transfer mixture to a large bowl and let cool slightly. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cottage cheese, eggs, breadcrumbs and Parmesan. Mix well. Remove squash from oven and divide filling evenly among 4 halves. Sprinkle squash with additional breadcrumbs and Parmesan, and dot each squash half with 2 cubes of butter. If you have any leftover stuffing, bake it in a greased dish alongside. Return to oven and bake until squash is tender and stuffing is nicely browned, about 30 more minutes.<br />\n</p>"}]}