{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120221domino610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "little debbie", "oatmeal cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Oatmeal Creme Pies", "link": "https://www.seriouseats.com/recipes/2012/03/oatmeal-creme-pie-recipe.html", "description": "[Photographs: Sarah Jane Sanders] Note: These cookies require very little bake time. In my oven, 8 minutes is enough to cook them through and results in soft and pliable cookies, just like the real deal. 10 minutes, however, results in...", "totalTime": "90 minutes", "recipeYield": "makes 15 sandwich cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["<strong>For Cookies:</strong>", "8 ounces all purpose flour", "4 ounces rolled oats", "1/2 ounce cocoa powder", "2 ounces dried apple rings", "3 ounces unsalted butter ", "2 1/4 ounces neutral flavored oil, like safflower ", "7 ounces sugar", "1 1/2 ounce molasses", "3 ounces corn syrup", "1 1/2 teaspoon baking soda", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "1/4 teaspoon ginger", "1/4 teaspoon cinnamon ", "1/4 teaspoon mace", "1 egg ", "2 ounces milk ", "&nbsp;", "<strong>For Marshmallow Filling:</strong>", "1 1/2 teaspoons gelatin powder", "2 1/2 ounces water, divided", "1 3/4 ounces corn syrup", "4 1/2 ounces sugar", "1/4 teaspoon salt", "1 teaspoon vanilla extract", "3/4 ounce unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Cookies:</strong> Preheat the oven to 350&deg; F and have two parchment lined cookie sheets at the ready, plus to extra sheets of parchment. In the bowl of a food processor, combine the flour, oats, cocoa and dried apples. Set a timer to two minutes and process continuously for that time. Sift and reserve and large bits of oats or apple that remain. Process the large remaining bits another 2 minutes. They will still not be small enough to sift, but they should by now be incredibly small. I've found 4 minutes of total processing is perfect to get this texture: it's important that no visible oat flakes remain and that all apple bits have been ground to pieces smaller than, say, a lentil. Combine with the previously sifted ingredients. Set dry ingredients aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a hand or stand mixer, cream together the butter, oil, sugar, molasses, corn syrup, baking soda, baking powder, salt, ginger, cinnamon and mace until thoroughly combined and lightened; about two minutes. Add in the egg and beat another minute more. With mixer set to low, add in the dry ingredients all at once and mix until homogenous. Drizzle in the milk and mix until fully incorporated. Shut the mixer off, scrape down the bowl and beater thoroughly with a rubber spatula. Use a <a href=\"http://www.amazon.com/Portion-Scoop-18-10-Stainless/dp/B006NQDEGW/ref=sr_1_2?s=home-garden&ie=UTF8&qid=1331135176&sr=1-2\">#60 scoop</a> (a two teaspoon scoop) to portion the dough about 15 per cookie sheet. Be sure to give the cookies ample room, they will spread considerably during baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for about 8 minutes, or until the cookies have puffed and set. You may want to bake one tray by itself to determine the optimal bake-time for your oven. The cookies should seem a little underdone, but will firm up as they cool. If they cool to a crisp, bake the next batch a few minutes less. Bake off remaining cookie dough. Cool the cookies thoroughly, then flip half over to await filling. Should they stick to the parchment, use a metal spatula to gently loosen them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the filling:</strong> In a medium bowl (or the bowl of a stand mixer) combine the gelatin with half the water, 1 1/4 ounces. Mix with a fork to ensure no lumps of gelatin remain. Set aside. In a very small pot, combine the remaining water, corn syrup, sugar and salt over medium heat. Stir gently with spatula to ensure the sugar dissolves, but avoid splashing the mixture onto the sides of the pot. Cook until the mixture registers 240&deg; F on a candy thermometer. When it does, immediately shut off the heat and cool to 210&deg;. It is very important the mixture cools all the way to 210&deg; before proceeding! Once cool, add the sugar syrup to the gelatin mixture and whip on low speed until the gelatin has fully dissolved. Increase the speed to medium high and whip until light, fluffy and tripled in bulk. While still mixing, add in the vanilla and the butter, a teaspoon at a time. Scrape the bowl down, if necessary, and whip until no specs of butter remain. Use a spatula to transfer the mixture to a pastry bag. The filling is more of a \"cream\" than a \"fluff.\" If you find it tricky to work with, let it stand for an hour before piping. Pipe a quarter sized dollop of filling onto half the cookies (less than you think!), then sandwich with the remaining cookie halves. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The cookies are delicious to eat right away, but will gain a more authentic texture the following day, when the gelatin has had a chance to set. Store in an airtight container one week at room temperature. </p>"}]}