{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120909-baking-out-loud-lemon-ricotta-pancakes.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Baking Out Loud", "breakfast sweets", "pancakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Lemon Ricotta Pancakes", "link": "https://www.seriouseats.com/recipes/2012/09/baking-out-loud-lemon-ricotta-pancakes-recipe.html", "description": "Rich whole-milk ricotta and lemon zest are lightened by meringue to produce a pancake that is tangy, fluffy, not-too-sweet, and satisfying. This recipe from <strong><em><a href=\"http://www.amazon.com/Baking-Out-Loud-Desserts-Flavors/dp/0307951774/?tag=serieats-20\" target=\"_blank\">Baking Out Loud: Fun Desserts with Big Flavors</a></em></strong> is simple enough to make every day.", "totalTime": "25 minutes", "recipeYield": "makes 13 4-inch pancakes", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Pancake"], "recipeIngredient": ["3 tablespoons sugar", "1 tablespoon finely grated lemon zest (about 1 lemon's worth)", "1 cup whole-milk ricotta", "3 extra-large eggs, separated, at room temperature", "1/4 teaspoon kosher salt", "1/2 cup all-purpose flour", "fresh fruit, for garnish", "confectioner's sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the sugar and lemon zest, and using your hands, rub them together to release the lemon oils. Add the ricotta, egg yolks, and salt, and whisk until blended.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, using an electric mixer fitted with the whisk attachment, beat the egg whites on medium-high speed for about 3 minutes until they form medium-firm peaks. Scoop about one-third of the whites into the egg mixture, and using a rubber spatula, fold them in until blended. Add the remaining whites and gently fold them in until just blended. Don't stir, or the batter will deflate and leave you with flat, rubbery pancakes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease a griddle (preferably with Pam) and set it over medium heat until hot. Spoon about 2 tablespoons of batter (or, for larger cakes, up to 1/4 cup) per pancake onto the griddle, about 2 inches apart. Cook for 2 to 3 minutes, or until the bottoms of the pancakes are golden or \"blond\" and the edges look set. Using a wide spatula, turn the pancakes and continue cooking for about 2 to 3 minutes, or until the bottoms are golden and the top springs back when lightly pressed. Repeat with the remaining batter, lightly greasing the griddle between batches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately with fresh fruit and a dusting of confectioners' sugar. </p>"}]}