{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120904-221018-cook-the-book-french-style-vegetable-stew.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "James Peterson", "stews", "vegetables revised", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "James Peterson's French-Style Vegetable Stew", "link": "https://www.seriouseats.com/recipes/2012/09/james-petersons-french-style-vegetable-stew.html", "description": "This stew takes advantage of more than a few cooking techniques (blanching, boiling, steaming, glazing, and simmering); a good challenge for anyone wanting to test their skills. Each vegetable is precisely cut, cooked, and assembled to be as dramatic as possible. The method(s) works; the final stew is a celebration of vegetation.", "totalTime": "2 hours", "recipeYield": "serves 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Gluten-Free", "Mains", "Vegetarian"], "recipeIngredient": ["6 fresh baby artichokes or 12 frozen baby artichoke halves", "1 tablespoon extra-virgin olive oil (if using fresh artichokes)", "1 small fennel bulb", "4 ounces green beans, preferably haricots verts, trimmed and cut into 1-inch lengths", "24 small or 12 large asparagus tips", "12 ounces fresh fava beans, shelled and peeled, or 8 ounces fresh baby peas, shelled, or 1 cup frozen peas, thawed", "12 medium spinach or sorrel leaves, stemmed, stacked, rolled up, and sliced into 1/8-inch shreds", "6 cloves garlic, peeled", "18 pearl onions, peeled", "12 baby carrots, peeled, 1/4 inch of green left attached, or 2 medium carrots, trimmed, peeled, and cut into 1-inch pieces", "1 tablespoon unsalted butter", "3 tablespoons water", "4 ounces cremini mushrooms, quartered vertically", "1 cup heavy cream", "1 tablespoon finely chopped fresh chives", "1 tablespoon finely chopped fresh parsley", "1 tablespoon finely chopped fresh chervil or tarragon (optional)", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you're using fresh baby artichokes, trim off their outer leaves and peel their stem. Bring 4 cups water to a boil with the olive oil in a nonaluminum pot. Add the artichokes and simmer for about 15 minutes, or until easily penetrated with a skewer, but not soft. Drain, let cool, and cut in half from top to bottom. If you're using frozen artichokes, thaw and pat them dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 5 quarts of salted water to a rapid boil. Cut the fennel bulb in half vertically, then cut each half into three wedges, leaving a section of the core along one side of each of the wedges to keep them from falling apart. Boil the fennel wedges for about 10 minutes, until they've softened but still retain some texture. Remove the fennel with a slotted spoon or spider and let cool on a plate. If you're not finishing the stew right away, rinse the fennel in a colander under cold running water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot, boil the green beans until tender, about 5 minutes, remove with a slotted spoon or a spider, and let cool on a plate. If you're not finishing the stew right away, rinse the beans under cold running water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot, boil the asparagus for 3 to 5 minutes and remove with a slotted spoon or spider. If you're not serving the stew right away, rinse the asparagus under cold running water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot, boil the fava beans or fresh peas (there's no need to boil frozen peas) and the spinach for 1 minute, scoop out with a spider, and rinse under cold running water and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot, boil the garlic for 15 minutes, or until they're easily penetrated with a knife; scoop out with a slotted spoon and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the garlic is cooking, put the onions and carrots in a heavy-bottomed 4-quart pot with the butter and water over medium heat. When the water starts to steam, cover the pot, and decrease the heat to low. Cook until the vegetables soften but still have some texture when you poke them with a paring knife, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the onions and carrots are cooking, simmer the mushrooms with the cream in a medium pot over medium heat until the cream starts to thicken slightly, about 10 minutes. Stir in the chives, parsley, and chervil and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, combine the vegetables in a large, wide pot. Pour over the mushroom-cream mixture and gently reheat all the vegetables. Season to taste with salt and pepper and serve on hot plates.</p>"}]}