{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120807-195206-nectarine-hand-pies-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["hand pies", "nectarines", "picnic food", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Nectarine Hand Pies", "link": "https://www.seriouseats.com/recipes/2012/08/nectarine-hand-pies-recipe.html", "description": "Besides being so darn cute, these hand held nectarine pies are incredibly practical for picnics, cocktail parties, and the beach.", "totalTime": "1 day (including time for making and resting the dough)", "recipeYield": "Serves 12", "recipeCategory": ["Nectarine", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>", "4 ounces granulated sugar", "3 tablespoons tapioca, corn, or potato starch", "20 ounces (approximately 4 large or 6 small) ripe nectarines, pitted and diced into 1/2 inch pieces", "1 egg beaten with a pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured workspace, roll out dough into a rectangle approximately 12- by 16-inches and 1/8th inch thick. Cut it into twelve 4- by 4-inch squares. Place the squares on a sheet pan and return them to the fridge until you are ready to use them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the sugar and starch. Add the nectarines and gently toss until they are evenly coated with the sugar mixture. Place 2 ounces of the mixture in the center of each chilled square. lightly brush egg wash around the edges of each and fold over the diagonal, so the pie is triangle shaped. press gently all around the edges with a fork to seal, then return the pies to the fridge to chill for at least 1 hour and up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to bake, adjust oven rack to lower position and preheat oven to 425°F. Place the chilled pies on a parchment-lined sheet tray. Brush with egg wash, and sprinkle with sugar, if desired. Cut slits in the top for steam to escape. Bake for 10 minutes, then turn the sheet tray and lower the oven temperature to 350°F and bake until the pies are golden brown and the fruit inside is bubbling out of the slits, an additional 15 to 20 minutes. Cool completely before serving.</p>"}]}