{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120118-185823-monkey-bread-first-rise.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["breakfast breads", "breakfast pastries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Monkey Bread", "link": "https://www.seriouseats.com/recipes/2012/01/monkey-bread-sticky-rolls-bubble-loaf-recipe.html", "description": "Imagine dozens of cinnamon roll nuggets piled together and bound by caramel and you have Monkey Bread.", "totalTime": "3 1/2 hours", "recipeYield": "Makes 10 to 12 servings", "recipeCategory": ["Bread", "Breakfast and Brunch", "Breakfast Sweets", "Desserts"], "recipeIngredient": ["<strong>For the Dough</strong>", "3 1/4 cups all-purpose flour", "1 package (2 1/4) rapid-rise or instant yeast", "1 teaspoon salt", "1 cup whole milk", "1/2 cup water", "1/4 cup granulated sugar", "2 tablespoons unsalted butter, melted", "2 teaspoons vanilla extract", "&nbsp;", "<strong>Brown Sugar Coating</strong>", "8 tablepoons (1 stick) unsalted butter, melted", "1 1/4 cup packaged light brown sugar", "1 tablespoon ground cinnamon", "&nbsp;", "<strong>For the Glaze</strong>", "1/2 cup confectioners sugar", "1 tablespoon whole milk", "1/4 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric stand mixer add flour, yeast and salt. Use a spoon to stir well to combine then attach dough hook. Preheat the oven to 200&deg;F. Once the oven reaches the desired temperature turn it off. Spray a large bowl with cooking spray and set aside. If using a metal Bundt pan, very generously butter the pan and set aside. If using a silicone pan, no buttering is required.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan combine milk and water and warm to 110 to 115&deg;F. Pour warmed milk mixture into a large measuring cup. Add sugar, butter, and vanilla and stir well to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn stand mixer on low and slowly add the milk mixture. Once the dough comes together increase speed to medium and mix until shiny and smooth (about 7-8 minutes). On a lightly floured work surface knead dough  briefly and form a ball. Place dough in prepared large bowl and spray the top of the dough with additional cooking spray. Tightly cover the bowl with plastic wrap and place in still warm oven until dough doubles in size, about one hour. (Note: double check that your oven is off or you'll kill the yeast).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While dough is rising, mix brown sugar and cinnamon and set aside. Prepare another bowl with melted butter and set aside. When dough is finished rising, remove from oven and turn out onto a lightly floured surface. Pat the dough into roughly an 8-inch square and using a knife or a pizza cutter, cut into 64 1-inch square pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each piece into a ball, dip in melted butter and roll in brown sugar mixture then layer into prepared Bundt pan. Be sure to stagger the dough balls so they aren't stacked directly on top of each other, the staggering gives the bread the interlocking puzzle structure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap Bundt pan tightly with plastic wrap and return to turned-off oven to let the dough balls rise until they are puffy and have risen about an inch from the top rim of the pan, about an hour. Remove pan from oven and set aside. Preheat to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once oven is ready, remove plastic wrap and bake until the top is deep brown and the caramel is bubbling up around the edges of the pan, about 30 to 35 minutes. Cool in the pan for 5 minutes then turn bread out onto a serving plate. Let cool for 8 to 10 minutes before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl whisk together confectioners sugar, milk and vanilla until smooth to form the glaze, adding a splash of additional milk if you prefer a thinner glaze. Drizzle glaze over monkey bread and serve warm.</p>"}]}