{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120115-187283-preserved-blood-orange-marmalade-primary-2.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["blood oranges", "citrus", "Marmalade", "orange", "oranges", "Preserved", "wine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blood Orange Beaujolais Marmalade", "link": "https://www.seriouseats.com/recipes/2012/01/blood-orange-beaujolais-marmalade-recipe.html", "description": "This marmalade has a gorgeous, purple-crimson hue. The flavor is a bit sweeter than traditional marmalade, with notes of raspberry and wine. It would be absolutely delicious sandwiched between layers of almond or polenta cake, or try it with cornmeal biscuits. A jar would make a great Valentine's Day gift.", "totalTime": "1 1/2 hours", "recipeYield": "Makes 6 cups, or 6 half-pint jars", "recipeCategory": ["Breakfast Sweets", "Condiments and Sauces", "Orange"], "recipeIngredient": ["5 cups sugar", "6 small to medium blood oranges ", "1 cup Beaujolais or other light-bodied red wine", "1/8 teaspoon baking soda", "4 tablespoons plus 1 1/2 teaspoons regular powdered fruit pectin", "1/4 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the sugar into a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the blood oranges and remove the rind in quarters. Thinly slice the rind lengthwise, then roughly chop them crosswise into smaller pieces. Transfer the rind to a large pot and add the wine, baking soda, and 1 1/4 cups of water. Bring to a boil over medium heat, cover, reduce the heat, and simmer until the rinds have softened, 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, coarsely chop the oranges and remove any seeds. Transfer the oranges to a food processor and pulse until the orange pieces are broken up but still chunky, about 8 pulses. Add the oranges to the pot with the rind and bring to a simmer. Simmer, covered, 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure the mixture. You should have about 5 cups. (If you have less, add a bit more wine. If you have more, discard the extra.) Stir in the pectin and butter and bring to a boil over high heat, stirring constantly. Add the sugar all at once and return the mixture to a full rolling boil, stirring constantly. Boil hard for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and skim any foam from the surface of the marmalade with a cold metal spoon. Ladle the marmalade into hot sterilized jars and process them in a hot water bath for 10 minutes. </p>"}]}