{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120410-200825-bread%20-baking-rye-with-molasses-2.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "caraway", "molasses", "rye", "rye bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rye Bread with Molasses and Caraway", "link": "https://www.seriouseats.com/recipes/2012/04/rye-bread-with-molasses-and-caraway.html", "description": "[Photograph: Donna Currie] I used a medium rye flour but you can use any rye you find. Because we probably won't be using the same rye flour, you may need to add more or less bread flour to get the...", "totalTime": "Up to 14 hours, depending on resting time", "recipeYield": "makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["9 ounces (about 2 cups) rye flour", "1 1/4 cups water", "2 1/4 teaspoons instant yeast, divided", "6 3/4 ounces (about 1 1/4 cups) bread flour", "1 teaspoon salt", "1 tablespoon molasses", "1 tablespoon olive oil", "2 tablespoons caraway seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the rye flour, water, and 1/4 teaspoon yeast in the bowl of your stand mixer. Stir to combine, cover with plastic wrap, and let it sit for 8 to 12 hours at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, add the rest of the yeast, the bread flour, salt, and molasses. Knead with the bread hook until the dough is smooth and elastic. It should be tacky, but not goopy or sticky. If the dough is still very sticky, add more bread flour, as needed. Add the olive oil and caraway seeds, and knead until both are incorporated and well distributed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a ball, drizzle with a small amount of olive oil, and return it to the bowl. Cover with plastic wrap and set aside until doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface  and place your oven rack in the center of the oven. Preheat the oven to 350&deg;F. Place a sheet a parchment on a baking sheet, or sprinkle with cornmeal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough, and knead it briefly. Form it into a long oval shape, seal the seam on the bottom, and place it on your prepared baking sheet. Sprinkle the dough with rice flour (preferably) or wheat flour. Cover the dough with plastic wrap and set aside until doubled in size, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has risen, uncover it, slash it several times diagonally, and bake at 350&deg;F, until nicely browned, about 35 minutes. Let the bread cool completely on a rack before slicing.</p>"}]}