{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120328-199301-pizza-bianca.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Jim Lahey", "mushrooms", "My Pizza", "pizza", "pizza bianca"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jim Lahey's Pizza Bianca", "link": "https://www.seriouseats.com/recipes/2012/03/jim-laheys-pizza-bianca-recipe.html", "description": "Our love for <a href=\"http://www.sullivanstreetbakery.com/history\">Jim Lahey</a>'s <strong>pizza bianca</strong> is no secret. Remember when Ed declared that a whole pizza bianca was <a href=\"http://newyork.seriouseats.com/2008/10/pizza-bianca-jim-lahey-sullivan-street-bakery-grandaisy-nyc.html\">the ultimate dinner party bring-along</a>? Well, lucky for us and all fans of pizza bianca, Lahey has adapted it for <strong><a href=\"http://www.amazon.com/My-Pizza-Easy-No-Knead-Spectacular/dp/0307886158/?tag=serieats-20\">My Pizza</a>, and even better, it's another fantastic and dead simple no-knead recipe.", "totalTime": "9 to 12 hours", "recipeYield": "Makes two 10- to 12-inch pizzas", "recipeCategory": ["Cook the Book", "Pizza"], "recipeIngredient": ["200 grams (1 1/2 cups) all-purpose flour, plus more for dusting ", "1 gram (1/4 teaspoon) active dry yeast", "4 grams (1/2 teaspoon) fine sea salt", "4 grams (3/4 teaspoon) sugar", "175 grams (3/4 cup) cool water, plus more if needed", "20 fresh rosemary leaves", "4 grams (1/2 teaspoon) coarse sea salt", "30 grams (about 3 tablespoons) extra-virgin olive oil for drizzling, plus more for the bowl"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, thoroughly blend the flour, yeast, fine sea salt, and sugar. Add the water and, using a wooden spoon or your hands, mix for at least 30 seconds, until you have a soft, loose dough. It should be slightly sticky; if it’s not, mix in more water (up to 2 tablespoons).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat the inside of a large bowl with olive oil and put the dough in it. Cover the bowl with a plate or plastic wrap and let it sit for a minimum of 9 hours and up to 12 hours at room temperature (about 72°F), until doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously flour a work surface and scrape the dough onto it. Fold the dough over itself 2 or 3 times and split it into 2 rather flat balls. Put the dough in a warm, draft-free spot, covered with a very damp tea towel, and let rise until doubled in volume, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Half an hour before the end of the second rise, place the pizza stone in a gas oven about 8 inches from the broiler. Preheat the oven on bake at 500°F for 30 minutes. Switch to broil for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape one of the balls into a disk, as with other pizzas, and place it on a floured peel. Sprinkle with half of the rosemary. With the tips of your fingers, make indentations (dimples) all over the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With quick, jerking motions, slide the dough onto the baking stone.  If it's sticking to the peel, gently lift it around the edges, adding more flour to the peel.  Broil until still pale in the dimples, about 3 1/2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the peel under the pizza and transfer the pizza to a rack.  Sprinkle with half of the coarse salt, drizzle with half the oil, and allow to cool for at least a few minutes before slicing and serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat the shaping and broiling with the second ball.</p>"}]}