{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20111226-185189-flourless-nutella-chocolate-torte1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["cake", "chocoholic", "flourless", "holiday cakes", "nutella", "Torte"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Flourless Nutella Chocolate Torte", "link": "https://www.seriouseats.com/recipes/2012/01/flourless-nutella-chocolate-torte-flourless-chocolate-cake-recipe-hazelnut.html", "description": "There's not a speck of flour in this one layer torte, so the result is <strong>richer, fudgier, and loads more sinful than any brownie</strong>.", "totalTime": "5 hours", "recipeYield": "makes 16 servings", "recipeCategory": ["Cakes", "Chocolate", "Desserts"], "recipeIngredient": ["<strong>For the Torte:</strong>", "3/4 cup skinned hazelnuts, lightly toasted", "9 ounces bittersweet chocolate, finely chopped", "9 ounces milk chocolate, finely chopped", "3 tablespoons unsalted butter, plus more for greasing pan", "1 1/4 cups Nutella ", "6 large eggs", "1/3 cup granulated sugar", "1/8 teaspoon salt", "1/4 cup heavy cream, cold", "&nbsp;", "<strong>For the Garnish:</strong>", "2 ounces bittersweet chocolate, finely chopped", "16 whole skinned hazelnuts", "1/4 cup heavy cream", "Cocoa for dusting cake"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and heat oven to 350&deg; F. Coat bottom and sides of 9-inch springform pan with butter. Place bottom of pan over large sheet of foil and fold foil up sides to create a waterproof seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place hazelnuts in food processor and process until finely ground, 15 to 30 seconds; set aside. Place bittersweet chocolate, milk chocolate, and butter in heatproof bowl set over saucepan of barely simmering water. Heat, stirring occasionally, until mixture is melted. Remove from heat and stir in Nutella and chopped hazelnuts until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of standing mixer fitted with whip attachment, Beat eggs with sugar and salt on medium-high speed until doubled in volume, 3 to 4 minutes. Fold 1/3 eggs into chocolate mixture to lighten. Gently fold in remaining eggs until no streaks remain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the unwashed mixer bowl, whip cream on medium-high speed to soft peak, about 30 seconds. Fold into chocolate mixture just until no streaks remain. Pour into prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pan in roasting pan and fill pan with 1-inch hot water. Bake until center is just set and torte doesn't jiggle when shaken, 60 to 70 minutes. Remove springform pan from roasting pan and place on cooling rack to cool about 30 minutes. Chill until completely set, 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate and cream in microwave proof bowl and heat, stirring often, until mixture is warm and chocolate is melted. Whisk until mixture is smooth. Chill, if necessary, until mixture is thick enough to pipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust torte with cocoa. Place chocolate mixture in piping bag fitted with tip and pipe 16 rounded teaspoon sized mounds along perimeter of torte. Place hazelnut on top of each mound of chocolate. When ready to serve, run sharp knife along inside of pan and remove sides of springform pan.</p>"}]}