{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120130-190634-farmer-cheese-pie.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["farmers cheese", "Handheld Pies", "Rachel Wharton", "Sarah Billingsley", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Farmer Cheese Pie", "link": "https://www.seriouseats.com/recipes/2012/02/farmer-cheese-pie-handheld-pies-recipe.html", "description": "These handheld pies are somewhere in the sweet spot between dessert and breakfast, with a crumbly cornmeal crust filled with honey-laced farmer cheese and a touch of thyme that make them feel as though they are a viable breakfast option.", "totalTime": "3 hours", "recipeYield": "Makes 12 to 16 pies", "recipeCategory": ["Bake the Book", "Breakfast Sweets"], "recipeIngredient": ["1/2 recipe Versatile Cornmeal Crust (recipe follows)", "All-purpose flour for dusting", "1 2/3 cups farmer cheese ", "3 eggs", "1/2 cup half-and-half", "3 tablespoons honey", "Pinch of kosher salt", "1 to 2 tablespoons fresh thyme leaves", " ", "<strong>Versatile Cornmeal Crust</strong>", "3/4 cup cold unsalted butter", "1 1/2 cups all-purpose/plain flour, plus more for dusting ", "1/2 cup cornmeal ", "1/2 cup sugar ", "1 teaspoon kosher salt", "2 egg yolks", "2 to 3 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Versatile Cornmeal Crust:</strong> Cut the butter into ½-inch cubes, and freeze them while you measure and mix the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dough in a food processor:</strong> Combine the flour, cornmeal, sugar, and salt in the processor and pulse 3 or 4 times to mix. Retrieve the butter cubes from the freezer, scatter them over the flour mixture, and pulse until the mixture forms pea-size clumps. In a small bowl, which together the egg yolks and 2 tablespoons of the ice water. Drizzle the yolk mixture into the flour mixture and pulse just until the dough holds together. If the mixture won’t come together, add the remaining 1 tablespoon ice water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To the make the dough by hand:</strong> In a large bowl, whisk together flour, cornmeal, sugar, and salt. Retrieve the butter cubes from the freezer and distribute them evenly in the flour mixture, coating them with flour mixture. Sink your fingers into the mixture and begin pinching the butter and flour together, making thin, floury disks of the butter. Contirnue working the mixture until the butter is broken down first into floury pea-sized beads and then into a loose mixture that resembles wet sand. In a small bowl, whisk together the eggs yolks and 2 teaspoons of the ice water. Drizzle the yolk mixture into the flour mixture and use your hand like a comb to mix in the liquid just until the dough holds together. If necessary, work in the remaining 1 tbsp ice water until the dough comes together in a crumbly mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough onto a clean work surface or sheet of parchment/baking paper. Gather together in a mound, then knead it a few times to smooth it out. Divide it in half and gently pat and press each half into a rough rectangle, circle, or square about 1 inch thick. The shape you choose depends on what shape you will be rolling out the dough. If you don’t know how you will be using eth dough at this point, opt for a circle. Wrap in plastic wrap or in the parchment paper and refrigerate for at least 2 hours or up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pies:<strong> Have two 12-cup standard muffin tins ready. Remove the dough from the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a clean work surface. Unwrap the dough, place it on the floured work surface, and flour the top lightly. Roll out the dough into a large circle about ⅛ inch thick. It will be about 14 inch in diameter. Using a round biscuit or cookie cutter, cut out as many circles 4 to 5 inch in diameter as possible. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Handling the dough circles gently, lift each circle and press it into a muffin cup, leaving a ⅛- to ¼-inch overhang and patching any tears by pinching them together or plugging them with a dough scrap. You can crimp the dough that extends beyond the edge of the cup with fork tines or your fingers so it adheres to the top of the tin and forms a rim, if you like, but it is not necessary. Gather the dough scraps, form into a ball, roll out, and cut out more circles. (Reroll the dough only once or it will bake up tough.) You should have 12 to 16 circles total. If you don’t have enough dough circles to fill every cup in a muffin tin, stagger the crusts rather than clustering all of them at one end of the tin. If you’ve filled one tin, refrigerate it while you line the cups in a second tin, then refrigerate the second tin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle attachment, beat together the cheese and eggs until smooth. Add the half-and-half, honey, and salt and beat until thoroughly combined. (Or, use a large bowl and a handheld mixer or a wooden spoon.) Generously sprinkle in the thyme and stir to mix. (The filling can be made up to 24 hours in advance and refrigerated.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough-lined cups from the refrigerator. Place 3 to 4 tablespoons filling in each cup. Refrigerate the assembled pies for at least 30 minutes or up to 24 hours. Preheat the oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pies until the filling is slightly puffed and golden, about 20 minutes. The filling should jiggle slightly when a tin is gently shaken. Be careful not to overbake or the filling will crack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool on a baking rack for 10 minutes. Run a sharp, thin knife around the edge of each pie to loosen it from the cup. Then, using the knife tip or a fork, gently pry each pie upward so you can grab it with your fingertips and lift it out of the tin. Serve warm or at room temperature.</p>"}]}