{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120215-19261-the-italian-baker-cornbread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "Italian", "keywords": ["bread baking", "breads", "cornbread", "Italian", "The Italian Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Italian Baker's Pan di Mais", "link": "https://www.seriouseats.com/recipes/2012/02/the-italian-bakers-pan-di-mais-bread-recipe.html", "description": "I'd never heard of Italian cornbread before I saw this recipe in <em>The Italian Baker</em>. This bread is nothing like American cornbread. It isn't soft or squishy or sweet. The bread is very dense, very firm.", "totalTime": "2 hours 45 minutes", "recipeYield": "Makes 2 loaves", "recipeCategory": ["Bread Baking", "Cornbread", "Italian"], "recipeIngredient": ["4 1/2 teaspoons (2 packages / 0.5 oz / 14 g) active dry yeast", "2 cups minus 2 tablespoons (15.8 oz / 450 g) warm water (or 6 tablespoons / 3 oz / 75 g warm water plus 1 1/2 cups / 12.6 oz / 360 g cold water if using a processor)", "1/2 cup (3.8 oz / 110 g) olive oil", "3 3/4 cups (21 oz / 600 g) cornmeal, preferably stone-ground and not degerminated ", "Scant 3 cups (14 oz / 400 g) unbleached all-purpose flour", "1 tablespoon (0.5 oz / 15 g) salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By hand:</strong> This bread is just not worth the effort of making by hand, although it can be done if you have enormous patience. You must keep breaking the dough into little pieces, adding flour, then letting it rest, because it exudes water as it relaxes. Because it can take as long as 30 minutes, I strongly recommend the stand mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By mixer:</strong> Stir the yeast into the water in a large mixer bowl; let stand until creamy, about 10 minutes. Stir in the oil, then mix in the cornmeal, flour, and salt with the paddle until the dough comes together. Change to the dough hook and knead for 3 to 4 minutes, stopping the machine several times to push down the dough that has climbed up the collar. Finish kneading the slightly sticky dough briefly by hand on a lightly floured work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By food processor:</strong> Process this dough in two batches. Stir \u2028the yeast into the 1/4 cup of warm water in a small bowl; let stand until creamy, about 10 minutes. Place the cornmeal, flour, and salt in a food processor fitted with the dough blade and process with several pulses to sift. Mix the oil and the cold water. With the machine running, pour the dissolved yeast and the cold water mixture through the feed tube as fast as possible. Process 45 seconds to knead. Finish kneading by hand on a lightly floured surface. The dough should be soft but not wet; it will stick to your hands a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First rise:</strong> Place the dough in a lightly oiled bowl, cover tightly with plastic wrap, and let rise until doubled, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shaping and second rise:</strong> Cut the dough in half on a floured surface and shape each piece into a round loaf. Place in buttered 4-cup charlotte molds or soufflé dishes, sprinkle the tops lightly with flour, cover with a towel, and let rise about 45 minutes. It must not double in volume or it will collapse in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Preheat the oven to 400ºF. Just before baking, cut a pattern, either a tic-tac-toe or three parallel lines, on top of the loaves. Bake 30 minutes. (It will be slightly underdone but corn dries out as it cools.) You may bake the loaves out of the molds on a baking sheet or stone for the last 5 to 10 minutes to brown the bottoms and sides. Cool on racks.</p>"}]}