{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121019-226094-cook-the-book-coconut-sauce-noodles.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["burma: rivers of flavor", "chicken soup", "coconut milk", "Cook the Book", "egg noodles", "Naomi Duguid", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Naomi Duguid's Coconut Sauce Noodles", "link": "https://www.seriouseats.com/recipes/2012/10/naomi-duguids-coconut-sauce-noodles.html", "description": "Poached chicken plus broth and noodles is nothing new. Most of us eat chicken noodle soup on a more than regular basis throughout fall and winter. But <strong><a href=\"http://naomiduguid.com/#_\">Naomi Duguid's</a></strong> <strong>Coconut Sauce Noodles</strong> in <em><a href=\"http://www.amazon.com/Burma-Rivers-Flavor-Naomi-Duguid/dp/1579654134/?tag=serieats-20\">Burma</a></em> is far from ordinary. In its most basic form, egg noodles are boiled and then dressed with a thick soup of chicken, cracked coconut milk, and shallots.", "totalTime": "30 minutes to 1 1/2 hours", "recipeYield": "serves 6", "recipeCategory": ["Chicken", "Cook the Book", "Eggs", "Other Seafood", "Pasta", "Soups and Stews"], "recipeIngredient": ["2 1/2 pounds bone-in chicken legs or breasts; or 1 1/2 pounds boneless chicken  broth (if using bone-in chicken)", "&nbsp", "<strong>Broth</strong>", "5 cups water", "3 or 4 slices ginger", "2 shallots, halved", "&nbsp", "1 teaspoon fish sauce", "1 1/2 teaspoons salt", "4 cups chicken broth, from above or store bought if using boneless chicken", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/10/naomi-duguids-toasted-chickpea-flour.html\">Toasted Chickpea Flour</a>", "3/4 cup water", "3 tablespoons peanut oil", "1/4 teaspoon turmeric", "1 1/2 cups minced shallots, plus (optional) 1 cup small whole shallots", "1 tablespoon minced garlic", "1 cup canned coconut milk", "1 1/2 pounds fresh egg noodles or 1 pound dried egg noodles", "&nbsp", "<strong>Accompaniments and Toppings</strong>", "About 1 cup <a href=\"http://www.seriouseats.com/recipes/2012/10/naomi-duguids-fish-cakes-and-fish-balls.html\">Fish Balls</a> (optional)", "About 1 cup <a href=\"http://www.seriouseats.com/recipes/2012/10/naomi-duguids-fried-noodles.html\">Fried Noodles</a> (optional)", "2 hard-cooked hen or duck eggs, sliced (optional)", "2 limes, cut into wedges", "red chile powder", "1 cup thinly sliced shallots, soaked in water for 10 minutes, drained, and squeezed dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are using bone-in chicken, cut the chicken off the bones. Set the meat aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the optional broth: Place the bones in a medium pot and add the water, ginger, and shallots. Bring to a boil, half-cover, lower the heat, and simmer for an hour. Remove the bones, ginger, and shallots, or strain the broth into a large saucepan. You should have about 4 cups broth; add water if necessary. (The broth can be made ahead and stored, once completely cooled, in a well-sealed container in the refrigerator; it can also be frozen.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, about 30 minutes before the broth is ready, chop the reserved chicken meat or the boneless chicken into 1-inch pieces. Place in a bowl, add the fish sauce and 1/2 teaspoon of the salt, and mix well. Cover and set aside for 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the chicken broth to a simmer. Put the chickpea flour in a small bowl, add 1/2 cup of the water, and whisk to blend it into a paste, then stir in the remaining 1/4 cup water. Scoop out some warm broth and whisk or stir it briskly into the chickpea mixture so there are no lumps. Add it all back into the broth and whisk to incorporate it smoothly. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large wok or wide heavy pot over medium-high heat. Add the oil and then the turmeric. Stir, then add the minced shallots and cook, stirring frequently, for 4 minutes or until translucent. Add the garlic and cook for about 30 seconds, then add the chicken and stir-fry until all the meat has changed color. Add the chicken broth and the remaining 1 teaspoon salt, then add the coconut milk and whole shallots, if using, and bring to a boil. Lower the heat and simmer until the oil rises to the surface, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put on a large pot of water to boil. Put out six large soup bowls. Drop the egg noodles and fish balls, if using, into the boiling water. Lift out or drain when the noodles are cooked through, about 4 minutes for fresh noodles, 7 for dried. Place about 1 cup noodles in each soup bowl. Ladle over the sauce generously. Top with 2 or 3 fish balls, if using, some fried noodles, and several slices of egg, if you wish. Put out the remaining fish balls, fried noodles, and egg slices on a platter, along with the lime wedges, chile powder, and shallot slices, so guests can top their soup as they wish.</p>"}]}