{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120724-jeni-splendid-ice-creamoatmeal-cream-lineup.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["frozen desserts", "ice cream", "ice cream sandwiches", "jeni britton bauer", "jeni's splendid ice cream", "oatmeal cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jeni Britton Bauer's Oatmeal Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/07/jeni-britton-bauers-oatmeal-cream-sandwiches-recipe.html", "description": "These sandwiches are like the classic oatmeal cream pie, but ramped up with chewy homemade oatmeal-molasses cookies and vanilla ice cream.", "totalTime": "", "recipeYield": "makes 12 sandwiches", "recipeCategory": ["Cookies", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 cup (2 sticks) unsalted butter, softened", "1 cup light brown sugar, packed", "1/2 cup granulated sugar", "3/4 teaspoon salt", "1 Tablespoon molasses", "1 teaspoon vanilla extract", "2 eggs", "1 1/2 cups all purpose flour", "2 cups quick oats (instant oatmeal, plain)", "1 teaspoon baking soda", "1/4 teaspoon cinnamon", "72 ounces vanilla ice cream, such as Jeni's Ugandan Vanilla Ice Cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter, in the bowl of a stand mixer with a paddle attachment or with a hand held mixer.  Add both sugars and the salt and beat again until the mixture is light in color and fluffy, scrape down the bowl as needed to ensure even consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the molasses, vanilla extract and beat just to combine.  Add the eggs one at a time, beating in between to fully incorporate.  The batter should look smooth and creamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine the flour, quick oats, baking soda and cinnamon and mix thoroughly.  Working in two batches, fold in the first half of the dry mix and mix on low speed (or by hand) until just combined.  Add the remaining flour, and mix on low speed until fully combined but be careful not to over work the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line baking sheets with parchment (easy to use, no cooking spray needed and easy to clean up!).  Use a 1 ounce disher scoop to portion the dough onto the tray, spacing the cookies about 1 ½ to 2 inches apart.  A disher scoop is the professional secret to getting perfectly round cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once portioned, flatten the cookie portions slightly with the heel of your hand or with the back of a spoon, this will help the cookies bake more evenly. Bake the cookies for 7 minutes, rotate the trays, then bake 4-6 minutes longer or until the cookies are very lightly browned on the edges and barely set in the center.  Baking times may vary between ovens so keep an eye on your first batch to get a sense of how hot your oven is.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool on the parchment.  Once cool, stack the cookies in a container or in a freezer plastic bag and freeze.  You are now ready to sandwich every 2 cookies with 6 ounces of vanilla ice cream (try Jeni's Ugandan Vanilla Ice Cream for the most indulgent oatmeal creme sandwich.)</p>"}]}