{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/04212012-201804-sunday-supper-buchtel.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["bread", "buchtel", "rolls", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Buchtel (Austrian-style Fruit-Filled Sweet Rolls)", "link": "https://www.seriouseats.com/recipes/2012/04/buchtel-dumpling-roll-recipe.html", "description": "", "totalTime": "3 hours 30 minutes", "recipeYield": "makes 8 buchtel", "recipeCategory": ["Bread", "Breakfast and Brunch"], "recipeIngredient": ["2 packages active dry yeast", "4 tablespoons sugar, divided", "1/2 cup warm water", "1/2 cup milk", "4 tablespoons melted butter, plus more for greasing pan", "2 eggs, beaten", "3 to cups all-purpose flour, plus up to 1 cup more", "1/2 cup fruit preserves of your choice", "1 egg, beaten (for glaze)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine yeast, 2 tablespoons sugar and water in a bowl and stir to combine.  Set aside and wait for yeast to begin to bubble. Once yeast has been activated combine yeast mixture with milk, butter, and beaten egg and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together 3 cups and remaining sugar. Pour yeast mixture over flour and mix with a wooden spoon until dough forms. Continue to knead with your hands, adding remaining flour as needed until dough comes together and no longer sticks to your hands. Continue to knead another 10 minutes. Cover dough with a clean kitchen towel and leave to rise in a warm place until doubled in size, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dough has doubled in size punch it down and turn it out onto a floured surface.  Pat into a large rectangle and divide into 8 equal pieces. Press each piece into a 3- by 5-inch rectangle. Place 1 tablespoon of fruit preserves in the center then gather the dough around the preserve pinching the ends of the dough together to seal. Repeat with remaining dough and preserves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350&deg;F. Place filled buchtel into a buttered 9- by 5-inch loaf pan in two rows of four and let rise in a warm place for 30 minutes (the buchtel will be pushing against each other). Brush buchtel with beaten egg, then bake buchtel until deep brown and cooked through, about 1 hour. Remove from oven and place on a cooling rack. Allow to cool for at least 10 minutes. Serve warm or at room temperature.</p>"}]}