{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120919-222231-british-bites-berry-trifle.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["berries", "british bites", "custard", "pound cake", "trifle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Berry Trifle", "link": "https://www.seriouseats.com/recipes/2012/09/berry-trifle-recipe.html", "description": "A layered dessert of custard cream, pound cake, and berries.", "totalTime": "1 hour", "recipeYield": "Serves 8", "recipeCategory": ["British Bites", "Cakes", "Fruit Desserts", "Puddings and Custards"], "recipeIngredient": ["12 ounces (about 2 cups) blueberries, divided", "18 ounces (about 3 cups) raspberries, divided", "1 tablespoon juice from 1 lemon", "6 tablespoons sugar, divided", "1 1/2 teaspoons cornstarch, divided", "1 1/2 cup milk  ", "2 eggs, beaten ", "1 teaspoon cornstarch ", "1/2 teaspoon vanilla extract ", "1 quart heavy whipping cream ", "1 (1 pound) vanilla pound cake, sliced in 1/2 inch pieces ", "3 tablespoons sherry (or liquor of your choice) ", "1 pound strawberries, halved, divided "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1 cup blueberries, 1 cup raspberries, lemon juice, 1 tablespoon sugar, and 1/2 teaspoon cornstarch in a saucepan and mix to combine.  Place saucepan over medium high heat and cook, stirring often, until berries begin to break down, about 5 minutes.  Allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan whisk together milk, eggs, 2 tablespoons sugar, and remaining teaspoon cornstarch until all ingredients are evenly incorporated.  Place saucepan over medium heat and cook, stirring constantly with a wooden spoon, until mixture starts to thicken and coats the back of a spoon, about 5 minutes. Transfer custard to a large bowl and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a standing or handheld mixer, whip the cream and remaining 3 tablespoons sugar together until stiff peaks form. Set aside 1 cup for topping. Place 1/4 of remaining whipped cream in bowl with custard and gently fold together using a spatula.  Once initial whipped cream is incorporated into custard, fold in remaining whipped cream (leaving cup set aside for topping).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble trifle:  Place about 1/2 cup of the custard at the bottom of the trifle dish, then using about a third of the pound cake, cover the bottom of the dish.  Sprinkle pound cake with 1 tablespoon of sherry (or other liquor).  Cover pound cake with 1/3 of berry compote, followed by 6 ounces (about 1 cup) blueberries, followed by custard.  Top the custard with more pound cake sprinkled with 1 tablespoon sherry, followed by 1/2 the remaining berry compote, 1/2 the remaining raspberries, and 1/2 the remaining custard.  Top with remaining pound cake sprinkled with remaining sherry, followed by remaining compote and 1 cup of the halved strawberries.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the trifle with 1 cup remaining whipped cream and decorate with remaining berries. Allow to sit for at least 30 minutes in the refrigerator. Serve cold.</p>"}]}