{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120123-189541-preserved-lemon-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "couscous", "Cree LaFavour", "Poulet", "preserved lemons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Poulet's Preserved Lemon Chicken with Olives with Almond Couscous", "link": "https://www.seriouseats.com/recipes/2012/01/poulets-preserved-lemon-chicken-with-olives-with-almond-couscous.html", "description": "Not everyone has a jar of preserved lemons hanging out in the fridge, but after giving this recipe for <strong>Preserved Lemon Chicken with Olives with Almond Couscous</strong> a go, you might consider it. Adapted from our poultry-centric cookbook of the week, <em><strong><a href=\"http://www.amazon.com/Poulet-Cree-LeFavour/dp/0811879690/?tag=serieats-20\">Poulet</a></strong></em>, this recipe brings together a trio of salty-fantastic ingredients&mdash;capers, olives, and those great preserved lemons)&mdash;to make a pot full of falling-off-the-bone braised chicken thighs.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Chicken"], "recipeIngredient": ["8 to 10 bone-in, skin-on chicken thighs", "2 tablespoons peanut oil, plus more for the chicken", "Kosher salt", "1 shallot, minced", "1 head garlic, cloves peeled and chopped", "3 cups chicken stock ", "1 whole Preserved Lemon (recipe follows or store bought), rinsed well and chopped", "1/4 cup capers", "1 cup Moroccan or Spanish green olives, pitted", "3 bay leaves", "1/4 cup chopped fresh oregano ", "&nbsp:", "<strong>Preserved Lemons</strong>", "3 or 4 organic lemons", "1/2 cup fresh lemon juice", "1/4 cup kosher salt", "&nbsp;", "<strong>Almond Couscous</strong>", "1 orange or red bell pepper, seeded and diced", "3 tablespoons olive oil", "1 1/2 cups water", "1 1/4 cups couscous", "1 cup whole blanched almonds, toasted", "1/4 cup chopped fresh parsley", "1/4 cup chopped fresh oregano ", "5 dried apricot halves, diced", "1 tablespoon fresh lemon juice", "1/2 teaspoon kosher salt", "Flaky salt for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Preserved Lemons:</strong> Cut the lemons into quarters, starting from the stem and cutting until just shy of the bottom so the lemon stays intact. Stuff the lemons into a mason jar or any jar with a sealable lid. The jar should be as full as possible so pressing the lemons in tightly is a good thing. Add the salt and then fill the jar to the top with lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place on the counter or windowsill for at least 10 days—30 days if possible. Before using, rinse to remove the very salty brine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken:</strong>Preheat the oven to 450°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the chicken with peanut oil, sprinkle with kosher salt, and set on the countertop for 30 minutes or so to take the chill off before cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the 2 tablespoons peanut oil in a 12-inch or larger cast-iron frying pan or 5-quart or larger Dutch oven over medium heat. Working in batches, lay the thighs in the pan, and cook, skin-side down, turning frequently, until nicely browned on both sides. Transfer the chicken to a plate, pour off any excess fat, and wipe away any burned bits in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to low and add a little more oil, if needed, along with the shallot and garlic. Cook just until the shallot and garlic are soft but not brown, 2 to 3 minutes. Add the stock, scrape the bottom of the pan, and return the chicken, skin-side up, to the pan along with the preserved lemon, capers, olives, bay leaves, and oregano. The thighs should be nestled in the liquid but not submerged. Put the pan in the oven and roast for 30 minutes. An instant-read thermometer inserted into the thickest part of a thigh should register 175°F. If you’re unsure, cut into a piece and take a peek. Look for clear, not red or pink, juices running from the spot where you pierced the meat and opaque, barley pink, flesh at the bone. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool for 5 minutes, then taste for salt (I doubt it will need any—the preserved lemons, olives, and capers are all salty) and serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Almond Couscous:</strong> Preheat the oven to 450°F. Toss the bell pepper with 1 tbsp of the olive oil and roast until black on the edges, about 10 to 15 minutes. Remove from the oven and set aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a boil in a saucepan with a tight-fitting lid. Remove from the heat, add the couscous, cover, and let sit for 5 minutes. Fluff the couscous with a fork before transferring to a large bowl. Add the almonds, bell pepper, parsley, oregano, apricots, remaining 2 tbsp olive oil, lemon juice, and kosher salt and mix thoroughly. Sprinkle a pinch of flaky salt on top before serving.</p>"}]}