{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120417-202152-lobster-club-sandwiches.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Eat With Your Hands", "lobster", "recipe newsletter", "sandwich", "seafood", "shellfish", "Zakary Pelaccio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zakary Pelaccio's Lobster Club Sandwich", "link": "https://www.seriouseats.com/recipes/2012/04/zakary-pelaccios-lobster-club-sandwich-recipe.html", "description": "<a href=\"http://fattycrew.com/the-crew/zak-pelaccio/\">Zakary Pelaccio</a>, author of <em><strong><a href=\"http://www.amazon.com/Eat-Your-Hands-Zak-Pelaccio/dp/0061554200/?tag=serieats-20\">Eat with Your Hands</a></strong></em> has upped the club sandwich ante by adding butter poached lobster and turning that middle slice of bread into a riff on that classic Chinese restaurant app, shrimp toast, only here it's lobster toast.  Sounds pretty good, right?  Well, there's also slices of crispy bacon and the mayo on this club is a Sambal Aïoli.", "totalTime": "2 hours", "recipeYield": "makes 4 sandwiches", "recipeCategory": ["Lobster and Crab", "Sandwiches"], "recipeIngredient": ["<strong>For the lobster toast:</strong>", "About 4 cups peanut oil  ", "1 cup parcooked lobster meat  ", "1 1/2 teaspoons fish sauce ", "1/2 teaspoon MSG ", "1/2 cup all-purpose flour", "Sea salt and freshly ground black  pepper  ", "1/2 cup rice flour ", "1 to 1 1/2 cups sparkling water ", "4 slices Pepperidge farm white  bread, crusts removed ", " ", "<strong>To finish the sandwiches:</strong>", "8 tablespoons (1 stick) unsalted  butter ", "Two (1 1/2-pound) lobsters, parcooked and meat removed from shells", "12 slices bacon", "8 slices Pepperidge farm white bread, lightly toasted ", "8 teaspoons Sambal Aïoli (recipe follows) ", "2 heads of Boston or Bibb lettuce, the best inner leaves only ", "4 slices medium gorgeous heirloom tomato, about 1/4 inch thick ", " ", "<strong>Sambal Aïoli:</strong>", "1 large egg yolk", "2 small garlic cloves, minced", "2 cups grapeseed oil", "1 teaspoon brown rice vinegar", "1 teaspoon lime juice", "Sea salt", "1 tablespoon Sambal Belacan, a Malaysian chile shrimp sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sambal Aïoli:</strong> Put the egg yolk and the garlic in the bowl of a food processor and pulse, using a spatula to scrape any yolk that gets stuck to the sides of the processor back to the blades, until smooth. Then purée, slowly adding the oil with the machine is running until the aïoli has emulsified. Add the vinegar and lime juice and process to combine. Season with salt to taste. Cover and refrigerate until you're ready to use it and stir the sambal belacan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Lobster Toast:</strong> Heat at least 2 inches of oil in a deep heavy pan over medium-high heat to 375°F (measured on a deep-frying thermometer). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, pulse the parcooked lobster meat, fish sauce, MSG, 2 tablespoons of the all-purpose flour, 1 tablespoon salt, and 1 teaspoon pepper until a paste forms. in a bowl, whisk together the rice flour and the remaining all-purpose flour. Season it with salt and pepper. Then add the sparkling water, starting with 1 cup, whisking to incorporate evenly and ensure there are no lumps. Whisk in up to 1/2 cup more sparkling water if necessary to obtain the consistency of a slightly watery pancake batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the lobster paste evenly over each piece of bread, all the way to the edges. The coating should be 1/4 inch thick. Working with one piece at a time, dip the lobster-smeared bread into the batter and coat fully, shaking off the excess. Carefully add each piece to the hot oil and fry, flipping once, until golden and crisp on both sides, about 3 minutes total. Transfer to a paper-towel-lined plate to drain and season with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish the sandwiches:</strong> In a medium saucepan, heat the butter and 1/2 cup water over low heat, whisking until the butter has completely emulsified. Cut the lobster tails in half lengthwise. Add the tails to the butter mixture and poach gently until just cooked through, about 5 minutes. Transfer them to a plate and gently poach the claws until just cooked through, about 4 minutes. Remove the pan from the heat, return the tails to the liquid, and set the pan to the side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium sauté pan over medium-high heat, cook the bacon until brown and crisp, then transfer to a paper-towel-lined plate to drain. Cut the cooked bacon slices to fit perfectly on the bread and eat the trimmings. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the crusts from the toasted white bread. Spread each slice with 2 teaspoons of the sambal aïoli. Top each of four of the slices with a few lettuce leaves, a slice of tomato, a slice of lobster toast, and 3 slices of bacon. Put half a lobster tail and a whole claw on each stack. Top with the remaining toasted white bread, slice each sandwich diagonally, and serve immediately. </p>"}]}