{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120909-baking-out-loud-chocolate-bourbon-fudge-tart.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Baking Out Loud", "chocolate", "fudge", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Bourbon Fudge Tart", "link": "https://www.seriouseats.com/recipes/2012/09/chocolate-bourbon-fudge-tart-recipe.html", "description": "Forget the bars, make the tart. <strong><em><a href=\"http://www.amazon.com/Baking-Out-Loud-Desserts-Flavors/dp/0307951774/?tag=serieats-20\" target=\"_blank\">Baking Out Loud: Fun Desserts with Big Flavors</a></em></strong> has a recipe for a fudge tart that is boozy, dark and delightful.", "totalTime": null, "recipeYield": "serves 10-12", "recipeCategory": ["Bake the Book", "Chocolate", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong> For the Crust </strong>", "1 1/2  cups all-purpose flour", "2 tablespoons sugar", "1/2 teaspoon kosher salt", "1/2  cup (1 stick) unsalted butter, cut into small cubes and very cold", "3 tablespoons ice-cold water", "<strong> For the Filling </strong>", "2 ounces semisweet chocolate (preferably Valrhona), chopped", "1 cup (2 sticks) unsalted butter, cut into 2-inch pieces", "1/2 cup natural dark cocoa powder (preferably Valrhona)", "1 1/2 cups sugar", "3 tablespoons Lyle’s Golden Syrup", "3 tablespoons sour cream", "4 extra-large eggs, at room temperature", "1 extra-large egg yolk, at room temperature", "1/4 cup bourbon (preferably Maker’s Mark)", "1 teaspoon vanilla bean paste or pure vanilla extract", "1/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the crust:</strong> Using an electric mixer fitted with the paddle attachment, mix the flour, sugar, and salt on medium speed for about 1 minute, until blended. Add the cold butter pieces and mix on medium-low speed for about 3 minutes, or until the largest pieces of butter are about pea size. With the mixer on medium speed, add the cold water and beat for 1 minute, or until the dough forms moist clumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough and any remaining floury bits onto a work surface and knead 3 to 4 times, until it all comes together into a smooth dough. Shape into a disc, wrap in plastic wrap, and refrigerate for about 1 hour, or until firm enough to roll out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a large piece of parchment paper (or two taped together) on a work surface. Put the dough in the center of the paper and top with a second sheet of parchment paper (or two taped together). Roll out the dough into a 14-inch circle, stopping occasionally to peel away the paper, dust the dough lightly with flour, and reposition the paper so you don’t get any wrinkles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough loosely around the rolling pin and center it over a 10-inch springform pan. Unroll the dough evenly into the pan. Using your fingers, gently press the dough into the sides and bottom of the pan. Trim off all but 2 inches of dough that hangs off the sides of the pan. Refrigerate for 1 hour, or until the dough is very firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and preheat the oven to 375°F (350°F if using a convection oven).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the chilled crust with a large piece of foil and fill it with dried beans to weight it down. Bake for 35 minutes (15 to 20 minutes if using a convection oven), or until the edges are light brown and the dough looks dry. Carefully lift out the foil and beans and continue to bake for 3 to 5 minutes (1 to 2 minutes if using a convection oven) longer, or until the crust is golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the filling:</strong> Reduce the oven temperature to 325°F (300°F if using a convection oven).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heatproof bowl, melt the chocolate and butter over simmering water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the heat, add the cocoa, and whisk until blended. Add the sugar, Lyle’s Golden Syrup, and sour cream and whisk until blended. Add the eggs, egg yolk, bourbon, vanilla, and salt and whisk just until blended. Pour into the baked tart shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 40 to 42 minutes (30 to 35 minutes if using a convection oven), or until the edges are slightly puffed and the center of the filling jiggles slightly when the pan is gently shaken. Transfer the pan to a wire rack and let cool completely. Cover and refrigerate overnight, or for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, unclasp and remove the outer ring of the pan, and using 2 large offset spatulas, move the tart to a flat serving plate. Using a large knife dipped in hot water and wiped dry, cut the tart into slices, dipping the knife in hot water and wiping dry in between cuts.</p>"}]}