{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120119-dt-gung-bao-chicken.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Chinese", "keywords": ["chicken", "Chinese", "Dinner Tonight", "mains", "poultry", "sichuan", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "4"}, "name": "Gong Bao Chicken", "link": "https://www.seriouseats.com/recipes/2012/01/gong-bao-chicken-recipe.html", "description": "If you've ordered takeout from a Chinese restaurant in your life, you've probably either seen or tasted Kung Pao chicken. And I'll admit that it's a dish I've loved and still enjoy. But the Westernized version is missing the key ingredient that is the star of the authentic Sichuan version, known more commonly as Gong Bao chicken: Sichuan peppercorns.  It's their unique, mouth-numbing effect that gives the dish its spicy, warming quality.", "totalTime": "15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chinese", "Dinner Tonight"], "recipeIngredient": ["1/3 cup unsalted peanuts", "1 pound boneless, skinless chicken breasts, cut into 3/4-inch cubes", "1 tablespoon cornstarch", "4 tablespoons light soy sauce", "2 tablespoons unroasted peanut oil or other neutral oil", "1 teaspoon Sichuan peppercorns", "2 dried red chiles, roughly chopped or crushed", "2 garlic cloves, peeled and very thinly sliced", "1-inch knob ginger root, peeled and very thinly sliced", "4 scallions, trimmed and roughly chopped", "Cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chicken, corn starch, and half the soy sauce in a small bowl. Toss the chicken until it's well-coated in the mixture, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat a large, dry skillet or wok over medium heat. Add the peanuts and cook, gently tossing occasionally, until they're golden brown and fragrant, 2-3 minutes. Transfer to a plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in the skillet or wok over medium-high heat until shimmering. Add the Sichuan peppercorns and dried chiles and cook, stirring continuously, until the chiles turn a light brown in color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat to high and add the marinated chicken. Cook for 2-3 minutes, until starting to turn golden, then add the garlic, ginger, scallions, and peanuts. Continue cooking until the chicken is cooked through, 1-2 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat, pour the remaining soy sauce over the chicken, and serve immediately with rice.</p>"}]}