{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120118-186790-roasted-brussels-sprouts-butternut-squash-and-apple.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["apple", "brussels sprouts", "butternut squash", "Cook the Book", "Elaine Louie", "The Occasional Vegetarian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Occasional Vegetarian's Roasted Brussels Sprouts, Butternut Squash, and Apple with Candied Walnuts", "link": "https://www.seriouseats.com/recipes/2012/01/roasted-brussels-sprouts-butternut-squash-apple-candied-walnuts-recipe.html", "description": "These <strong>Roasted Brussels Sprouts, Butternut Squash, and Apple with Candied Walnuts</strong> were created by Carmen Quagliata, chef of New York's fantastically Greenmarket-centric Union Square Cafe for <em><strong><a href=\"http://www.amazon.com/Occasional-Vegetarian-Delicious-Dishes-Vegetables/dp/1401310362/?tag=serieats-20\">The Occasional Vegetarian</a></strong></em>.  Instead of enriching the cabbage-y sprouts with salty, porky flavors, this recipe pairs their slight bitterness with chunks of sweet winter apples, butternut squash, crunchy candied walnuts, and maple syrup.", "totalTime": "1 hour 30 minutes", "recipeYield": "serves 2 to 3", "recipeCategory": ["Apple", "Cook the Book", "Dairy-Free", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the brussels sprouts:</strong>", "1 1/2 cups trimmed, halved brussels sprouts", "2 cups peeled butternut squash, cut into 1-inch asymmetrical chunks", "2 cups (about 1 large) Honeycrisp, Cortland, or Granny Smith apple, cored and cut into 1-inch asymmetrical chunks", "1 shallot, cut crosswise into 1/4-inch slices", "2 tablespoons olive oil", "5 fresh sage leaves", "Salt and freshly ground black pepper", "1/2 tablespoon maple syrup", "&nbsp;", "<strong>For the walnuts (purchased candied walnuts may be substituted):</strong>", "6 cups vegetable or canola oil, or as needed for frying", "6 ounces walnut halves", "2 cups confectioners’ sugar", "Kosher salt ", "Walnut bread, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the brussels sprouts:</strong> Preheat the oven to 375°F. In a large, shallow baking dish, toss the brussels sprouts, butternut squash, apples, and shallot with the olive oil and sage leaves. Season with salt and pepper to taste. Bake without stirring until the vegetables and apples are wrinkled, slightly brown, and the edges of the squash are beginning to crisp, 45 minutes to 1 hour. Meanwhile, prepare the walnuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the walnuts:</strong> Place a deep fryer or high-sided saucepan over high heat, and add vegetable or canola oil to come no closer than 3 inches from the top of the pot; when the walnuts are added, the oil will bubble and rise. Heat to 375°F. If using a saucepan, reduce the heat to very low to hold the temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot over high heat, bring 4 cups of water to a boil. Add the walnuts and boil for 10 seconds. Drain well and immediately toss with the confectioners’ sugar. Spread flat on a baking sheet and allow to dry for a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have a baking sheet lined with paper towels nearby. Confirm that the temperature of the oil is 375°F, adjusting as needed. Working in batches if necessary, add the walnuts and stir once or twice. Fry until amber-brown, about 30 seconds. Using a wire skimmer or heatproof slotted spoon, remove from the oil and transfer to paper towels. Sprinkle lightly with salt and allow to cool for 5 minutes before handling. May be stored in an airtight container at room temperature for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Remove the vegetables from the oven, drizzle with maple syrup, and sprinkle with 2 to 3 tablespoons of halved or roughly crumbled walnut pieces. Serve with walnut bread, if desired.</p>"}]}