{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/03102012-196413-sunday-supper-goat-cheese-spinach-stuffed-pork-chop-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["goat cheese", "pork", "pork chops", "spinach", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spinach and Goat Cheese Stuffed Pork Chops", "link": "https://www.seriouseats.com/recipes/2012/03/spinach-and-goat-cheese-stuffed-pork-chops-recipe.html", "description": "Pork chops are a mild, tender cut of pork that can sometimes lack flavor. But along with brines and marinades, a quick stuffing can bring added flavors that make a simple pork chop a Sunday Supper all-star.  Spinach and goat cheese add just the right amount of flavor without overwhelming the mild pork chop.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mains", "Pork", "Spinach", "Sunday Supper"], "recipeIngredient": ["4 boneless pork chops (about 2 pounds)", "Kosher salt and cracked black pepper", "2 tablespoons butter, divided", "2 cloves garlic, finely chopped", "2/3 cups breadcrumbs", "10 ounces frozen chopped spinach, thawed and excess water squeezed out", "4 ounces goat cheese", "1/2 small onion, finely chopped", "1/2 cup white wine", "1 teaspoon Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F.  Using a sharp knife, make an incision in the side of the pork chop so that each side is even.  Cut almost all the way through the pork chop to create a pocket, repeat with remaining pork chops, and season each one with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon butter in a sauté pan over medium high heat then add garlic and cook until garlic begins to soften, but not brown.  Add breadcrumbs and toss with butter and garlic; toast breadcrumbs until golden brown, then remove from pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When breadcrumbs are cool, add drained spinach and mix until well combined.  Crumble goat cheese into spinach mixture, being careful not to break up the goat cheese too much.  Taste and season with salt and pepper.  Fill each pork chop with an even amount of filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining butter in a large sauté pan.  Add pork chops and cook on each side until brown. Place browned pork chops on baking sheet and place in oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion to sauté pan and cook until soft; add wine and mustard and bring to a simmer.  Reduce until sauce has thickened and season to taste with salt and pepper.  When pork chops are cooked through, remove from oven and let rest for 5 minutes.  Drizzle sauce over pork chops and serve with brown rice and broccoli,and any remaining white wine.</p>"}]}