{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120425-203472-fried-pigs-ear-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Girl and Her Pig", "April Bloomfeild", "Cook the Book", "pig ears", "pork", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "April Bloomfield's Fried Pig's Ear Salad", "link": "https://www.seriouseats.com/recipes/2012/04/april-bloomfields-fried-pigs-ear-salad.html", "description": "[Photograph: David Loftus] What Worked: This salad is all about perfectly balanced contrasts&mdash;bitter endive and radicchio dressed with a bracingly tart dressing that cuts through the chewy fattiness of the pig's ear. What Didn't: If you're big into the nasty...", "totalTime": "4 hours 45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Pork", "Salads"], "recipeIngredient": ["4 pig’s ears (about 3 ounces each)", "About 6 cups rendered duck fat, gently warmed until liquid", "1 medium head Treviso, radicchio, or two red endives", "Lemon Caper Dressing (recipe follows), chilled", "&nbsp;", "<strong>Lemon Caper Dressing</strong> ", "2 medium lemons", "3 tablespoons finely chopped shallots", "2 tablespoons Dijon mustard", "2 tablespoons drained capers, finely chopped", "1/2 teaspoon Maldon or other flaky sea salt", "1/2 teaspoon superfine sugar", "1/4 cup extra virgin olive oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 250°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sure your pig’s ears are free of hair. remove any that you spot with a<br />\nsharp knife or razor. put the ears in an ovenproof saucepan with a lid that holds<br />\nthem snugly, then add enough duck fat to cover them. Cut out a circle of parchment paper that’ll cover the ears, put it on top of them, and top it with a saucer to weigh them down. Cover the pan, put it in the oven, and cook just until the ears are so tender that when you give them a firm pinch, your fingers meet, about 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Lemon Caper Dressing:</strong> Segment the lemons.  Squeeze the juice from the membranes into a separate bowl, add the rest of the ingredients, and stir well.  Add the lemon segments and toss gently to coat them without breaking them up.  Use straightaway or chill in the fridge covered, for up to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ears from the oven and let them cool submerged in the fat. once the ears are cool, remove them from the fat, wipe them off, and pat them dry. (Strain and reserve the duck fat for another use.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, separate the leaves of the endives and treviso or radicchio. put<br />\nthem in a large bowl, cover with plastic wrap, and put the bowl in the fridge. (I love the contrast between the cool leaves and the hot pig’s ear.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the peanut oil into a deep fryer and heat to 350°F. (the amount of oil will depend on your fryer’s capacity.) I don’t recommend doing this in a fryer without a lid, because the oil will pop, spit, and spatter like mad. Try not to be alarmed. Gently add 1 ear (or 2 if you have a larger fryer), immediately close the lid, and fry until deliciously golden brown, about 8 minutes. transfer to paper towels to drain and season right away on both sides with salt. Keep the ear(s) somewhere warm, like a toasty spot near the stove, while you fry the rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the bowl of endive from the fridge. Sprinkle 5 tablespoons or so of the chilled dressing over the leaves, making sure it gets into all the curves. add the arugula and mix gently but thoroughly with your fingers, so the lemon segments in the dressing stay more or less whole but every leaf gets some dressing. Put the greens on a platter, top it off with the warm, crispy ears, and add a little more dressing, if you fancy.</p>"}]}