{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120627-211503-british-bites-boxty-bacon.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["boxty", "british bites", "potato pancakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Boxty and Bacon", "link": "https://www.seriouseats.com/recipes/2012/06/boxty-and-bacon-recipe.html", "description": "These traditional Irish potato pancakes are sometimes called \"poorhouse bread\", but when paired with some salty bacon and a few drizzles of syrup you've got a meal you can be proud to serve, no matter who you're hosting.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "British Bites", "Pancake"], "recipeIngredient": ["3 russet potatoes, peeled", "1 cup all-purpose flour", "1 teaspoon baking powder", "2 tablespoons butter, melted", "1/4 cup milk", "12 strips bacon (about 3/4 pound)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 350°F.  Cut one of the potatoes into 2 inch pieces; place in a saucepan and cover with water.  Bring to a simmer and cook until potatoes are soft and mashable, about 8 minutes.  Mash the potatoes, then allow to cool.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate the other 2 potatoes on the large holes of a box grater.  Place a handful of grated potatoes into the center of a clean tea towel, then gently twist the towel until the potatoes release their water. Repeat with remaining potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl combine flour and baking powder and whisk until combined.  Toss grated potatoes with flour mixture, then add mashed potato and mix until all the ingredients are combined.  Pour butter and milk over potatoes, mixing until the ingredients come together into a stiff batter. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, cook bacon over medium heat until crisp, flipping once in the middle of cooking. Transfer to a paper towel-lined plate, leaving fat in skillet. Add boxty batter to the bacon fat by the spoonful and cook until well browned on both sides, about 4 minutes per side. Transfer to a wire rack set in a rimmed baking sheet as they cook. When all boxty have been fried, transfer baking sheet to oven and bake until cooked through, about 10 minutes. Serve with bacon and maple syrup.</p>"}]}