{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/verysmallanna%20pretzel%20flour.jpeg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["chocolate", "ganache", "tart", "very small anna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Pretzel Tart", "link": "https://www.seriouseats.com/recipes/2012/12/chocolate-pretzel-tart-recipe.html", "description": "Rich, chocolatey, salty, sweet, and easier to make than you might think.", "totalTime": "3 hours", "recipeYield": "serves 10", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Crust</strong>", "6 1/2 ounces pretzels", "7 tablespoons unsalted butter, room temperature", "1/4 cup powdered sugar", "1 egg", "1/4 teaspoon baking powder", "1/4 teaspoon salt", "&nbsp;", "<strong>For the Filling</strong>", "10 ounces excellent quality dark chocolate, divided", "1/4 to 1/2 cup roughly crushed pretzels", "4 tablespoons unsalted butter, cut into small pieces and softened", "1 1 /4 cups heavy cream", "&nbsp;", "<strong>For the Caramel Cream</strong>", "1/4 cup granulated sugar", "1 tablespoon water", "1 1/4 cup heavy cream, divided", "Salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Use food processor or high powered blender to grind pretzels into flour. If you do not have a food processor, place pretzels into large Ziploc bag, seal it, and crush with a rolling pin. You want the pretzels to be a fairly fine flour or they won't bind the other ingredients properly. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With electric mixer, cream softened butter with powdered sugar until fluffy, then add egg and fully incorporate, stopping to scrape bowl often. Add baking powder and salt to pretzel flour, mixing to incorporate, then add pretzel mixture to creamed ingredients. Mix on low to combine, scraping bowl often. Wrap dough and chill for about 30 minutes, until firm but not rock-hard (thaw slightly before using if it chills for longer),</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mash small chunks of the dough into the fluted edges of the tart pan, going all the way around, then add more and smooth it out to get a circle in the middle. You don't want the crust to be more than 1/2 inch at its thickest or less than 1/8 inch at its thinnest. Try for a nice right angle at the top. Once edge is neatly pressed in, fill the middle with the remaining dough and mash it flat. You also want a right angle at the bottom. It's more important to have neat edges than a perfectly flat bottom. Wrap and freeze shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once shell is thoroughly frozen, place a rack in the middle of the oven and preheat to 350&deg;F. Unwrap frozen shell and bake for 10 minutes, then turn and bake for about another 10 minutes, until lightly browned. Carefully remove from oven and allow to cool fully. Crust will be very soft and fragile while hot but will harden and crisp once cool. Don't worry about any cracks in the bottom; they will be patched in the next step.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Melt 2 ounces chocolate in a small metal bowl placed over a small saucepan of simmering water, or by microwaving in a microwave-safe bowl in increments of 30 seconds, stirring in between. Once chocolate is fully melted, pour into cooled shell and spread with a small offset spatula or small spoon until the bottom is fully coated and any cracks are patched. While chocolate is still wet, press in crushed pretzels. Refrigerate until chocolate is set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place remaining chocolate and butter in a medium bowl. Heat the cream in a small saucepan over medium heat until steaming but not quite boiling. Pour over chocolate and butter and immediately cover bowl with plastic wrap. Allow to sit for 5 to 10 minutes. Remove plastic wrap and gently stir with a whisk until all chocolate and butter are melted and mixture is smooth. Slowly pour into shell and carefully place in fridge to set, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While ganache sets, <strong>prepare caramel cream</strong>: Place sugar in a small saucepan and add water to moisten. Set over medium heat until sugar caramelizes and turns amber (color should be between honey and maple syrup), gently swirling the pan to ensure even caramelization and using a wet brush to wipe down sides of saucepan if any sugar crystals start to form. Remove from heat and slowly pour in 1/2 cup of cream. Caramel will seize and sputter so be careful. Place caramel over low heat and stir until melted, then pour into a small bowl and refrigerate until cold and you are ready to serve the tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Test your ganache for doneness every 15 minutes or so once it begins to set and is no longer liquid. Lightly press a fingertip onto the middle of the tart; if it gives at all keep waiting. It's ready when it's solid but slightly soft. If it gets completely hard, remove from refrigerator and allow to temper briefly at room temperature until slightly softened. Cut into 10 slices with a large chef's knife, starting by rocking through the outer crust and then leaning the blade straight down through the ganache and lower crust. Wipe knife clean with a hot moist towel in between slices. Store in an airtight container in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve, remove desired amount of tart slices from the refrigerator to temper and prepare the caramel cream. In a large bowl, whip 3/4 cup cream to stiff peaks. Fold in chilled caramel, salt to taste and re-whip back to stiff peaks. Pipe or scoop on plates next to slices of tart.</p>\n\n<p>Leftover cream and tart will keep in airtight containers for 2-3 days.</p>"}]}