{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120514-206726-dinner-tonight-mario-batali-pork-chop-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "Mario Batali", "pork", "pork chops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mario Batali's Pork Chops with Fennel Seed and White Wine", "link": "https://www.seriouseats.com/recipes/2012/05/mario-batalis-pork-chops-with-fennel-seed-and.html", "description": "I'm always surprised by how flavorful sautéing meat in a skillet and then deglazing the pan with wine can be. But as this fascinating recipe from <a href=\"http://www.foodnetwork.com/recipes/mario-batali/pork-chops-in-the-style-of-beneventana-costole-di-maiale-beneventana-recipe/index.html\">Mario Batali</a> proves, even minor adjusts can dramatically change the outcome.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Mains", "Pork"], "recipeIngredient": ["4 thick-cut bone-in pork rib chops, about 1-inch thick (about 2 pounds total)", "Kosher salt and freshly ground black pepper", "1 cup all-purpose flour", "2 tablespoons extra-virgin olive oil ", "1 teaspoon ground fennel seed", "1 cup white wine ", "3 medium garlic cloves, crushed ", "8 fennel fronds, for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 300&deg;F. Meanwhile, dry the pork chops with paper towels, and then season both sides with salt and pepper. Pour flour onto shallow plate or pie pan. Dredge pork chops on both sides and shake off any excess. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large skillet over high heat until barely smoking. Add chops and cook until well browned, about one minute. Flip, and brown on second side, another minute. Remove from heat and sprinkle 1/2 teaspoon of the ground fennel seed on top of the chops. Flip the chops with a pair of tongs, and sprinkle the remaining fennel seed on top. Add the wine and the garlic, and then transfer the skillet to the oven. Cook until the pork chops register 140&deg;F on an instant read thermometer inserted in the thickest part, 10 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When done, transfer the chops to a plate and set aside. Place the skillet over medium and cook until the liquid has reduced by half. Add half of the fennel fronds, and cook until wilted, about one minute. Turn off the heat and discard the garlic. Divide the pork chops between four plates, and spoon some of the wine sauce on top of each. Garnish with some of the remaining fennel fronds. Serve with roasted fennel bulbs, broccoli, or potatoes. </p>"}]}