{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120425-spring-vegetable-risotto-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "favas", "morels", "risotto", "spring", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spring Vegetable Risotto With Asparagus, Zucchini, Fava Beans, Snap Peas, and Morels", "link": "https://www.seriouseats.com/recipes/2012/05/spring-vegetable-risotto-asparagus-zucchini-fava-morel-snap-pea-recipe.html", "description": "What we're here to talk about today is vegetables, in particular, asparagus and morel mushrooms.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Asparagus", "Mains", "Rice", "The Food Lab", "Vegetarian", "Zucchini"], "recipeIngredient": ["1/2 pound mixed asparagus (white, green, purple, or a combination thereof), ends trimmed, stalks cut into 1-inch segments, tips removed and reserved separately", "1/2 pound sugar snap peas, cut into 1/2-inch segments on the bias", "1/2 pound fresh shelled fava beans, still in their skins", "1/2 pound baby zucchini, split in half lengthwise", "2 ounces dried morel mushrooms", "1 1/2 cups (about 13.5 ounces) risotto-style rice (see note) ", "1 cup white wine", "1/4 cup extra-virgin olive oil", "2 medium cloves garlic, grated on a microplane grater (about 2 teaspoons) ", "2 small shallots, finely minced (about 2 tablespoons) ", "Kosher salt and freshly ground black pepper ", "1/4 cup fresh parsley leaves, finely chopped", "1 tablespoon juice and 2 teaspoons zest from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 quarts of lightly salted water to a boil. Prepare an ice bath. Working with one vegetable at a time, cook asparagus stalks, asparagus tips, snap peas, fava beans, and zucchini by adding to water and cooking until just tender, 2 to 3 minutes (taste as they cook to confirm doneness). Transfer to ice bath to stop cooking, then drain and transfer to a bowl. Carefully peel skins off of fava beans. Set all vegetables aside while you prepare the risotto.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mushrooms to a microwave-safe bowl and cover with 1 quart of vegetable blanching water. Microwave on high heat until just starting to simmer, about 5 minutes. Let steep for 10 minutes, then remove mushrooms and carefully dry with paper towels. Reserve mushroom liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine rice and mushroom liquid in a large bowl. Agitate rice with fingers or a whisk to release starch. Strain through a fine mesh strainer set in a 2-quart liquid cup measure or other large bowl. Allow to drain five minutes, stirring rice occasionally. Reserve liquid.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons olive oil in 12-inch skillet over medium-high heat until foaming subsides. Add rice and cook, stirring and tossing frequently until all liquid is evaporated, oil is bubbling, and rice has begun to take on a golden blond color and nutty aroma, about 5 minutes. Add garlic and shallots and continue to cook, stirring frequently until aromatic, about 1 minute. Give reserved broth a good stir and pour all but one cup over the rice. Increase heat to high and heat until simmering. Stir rice once, cover, and reduce heat to lowest possible setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook rice for ten minutes undisturbed. Stir once, shake pan gently to redistribute rice, cover, and continue cooking until liquid is mostly absorbed and rice is tender with just a faint bite, about 10 minutes longer.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While rice is cooking, heat remaining tablespoon olive oil in a medium skillet over medium-high heat until shimmering. Add dried mushrooms and cook, stirring occasionally, until faintly nutty and crisp in bits, about 2 minutes. Season to taste with salt and pepper and transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid from rice and add final cup of liquid. Increase heat to high and cook, stirring and shaking rice constantly until thick and creamy. Fold in vegetables, mushrooms, parsley, and lemon juice and zest. Season to taste with salt and pepper. Add water just until risotto is creamy and loose. Serve immediately.</p>"}]}