{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20140423-ramp-mapo-dofu-3-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "mapo dofu", "quick", "ramps", "sichuan", "sichuan peppercorns", "spring", "tofu", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Mapo Tofu with Ramps", "link": "https://www.seriouseats.com/recipes/2012/04/mapo-dofu-tofu-with-ramps-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: Both the chili bean paste and the Sichuan Peppercorns can be bought online (follow the links) if you don't have a good Chinese market nearby. Use tofu labeled \"silken\" in a hardness range of medium...", "totalTime": "15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Mains", "Tofu"], "recipeIngredient": ["2 tablespoons Sichuan peppercorns, divided (see note) ", "1/4 cup vegetable oil ", "1 teaspoon cornstarch ", "2 teaspoons cold water ", "1 1/2 pounds medium to firm silken tofu, cut into 1/2-inch cubes ", "1/4 pound ground beef ", "8 whole ramps, finely sliced, whites and greens reserved separately", "1 tablespoon fresh ginger grated on a microplane grater ", "2 tablespoons fermented chili bean paste (see note) ", "2 tablespoons Xiaoxing wine ", "1 tablespoon dark soy sauce ", "1/4 cup low-sodium chicken stock ", "1/4 cup roasted chili oil (see note) ", "1/4 cup finely sliced scallion greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat half of sichuan peppercorns in a large wok over high heat until lightly smoking. Transfer to a mortar and pestle. Pound until finely ground and set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining sichuan peppercorns and vegetable oil to wok. Heat over medium high heat until lightly sizzling, about 1 1/2 minutes. Pick up peppercorns with a wire mesh skimmer and discard, leaving oil in pan.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine corn starch and cold water in a small bowl and mix with a fork until homogenous. Bring a medium saucepan of water to a boil over high heat and add tofu. Cook for 1 minute. Drain in a colander, being careful not to break up the tofu.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in wok over high heat until smoking. Add beef and cook, stirring constantly for 1 minute. Add ramp whites and cook, stirring constantly, until fragrant, about 30 seconds. Add ginger and cook until fragrant, about 15 seconds. Add chili-bean paste, wine, soy sauce, and chicken stock and bring to a boil. Pour in corn starch mixture and cook for 30 seconds until thickened. Add tofu and carefully fold in, being careful not to break it up too much. Stir in chili oil and half of ramp greens and simmer for 30 seconds longer. Transfer immediately to a serving bowl and sprinkle with remaining ramp greens and toasted ground Sichuan pepper. Serve immediately with white rice.<br />\n</p>"}]}