{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120522-195206-cheesecake-pie-514x386-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cheesecake", "pie", "pie of the week", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ricotta Cheesecake Pie", "link": "https://www.seriouseats.com/recipes/2012/05/ricotta-cheesecake-pie-with-strawberry-compote-recipe.html", "description": "This is a lighter alternative to traditional cheesecake. The flaky crust and the addition of ricotta help lighten the affair, making it the perfect finish for early summer dinners. While this pie would be great with any fruit topping, I recommend strawberries and rhubarb, made with frozen or fresh strawberries and fresh rhubarb.", "totalTime": "5 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "13 ounces whole milk ricotta (room temperature, see note)", "6 ounces cream cheese (room temperature)", "1 egg (room temperature)", "1 egg yolk (room temperature)", "4 ounces granulated sugar", "1 tablespoon potato or corn starch", "1 tablespoon vanilla", "Pinch of salt", "1 tablespoon zest from 1 lemon", "&nbsp;", "<strong>Strawberry and rhubarb compote:</strong>", "8 ounces fresh rhubarb, cut into 1/2 inch pieces", "8 ounces frozen strawberries, thawed", "Approximately 3 ounces sugar (adjust to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust just begins to get color on the top (you'll be baking it more later), about 5 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain excess liquid from ricotta by gently squeezing the whey from the cheese through doubled cheesecloth. Discard the liquid and place the ricotta in the bowl of a stand mixer with the cream cheese. Mix with the paddle attachment on medium speed until the mixture is completely combined and slightly fluffy, about one minute. Add the egg and yolk and mix on low speed until completely incorporated. In a small bowl, whisk together the sugar and starch, then add to the mixing bowl and mix on low speed until they are completely incorporated. Continue mixing on low and add the salt, vanilla, and zest. Pour the cheesecake mixture into the cooled pie crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 325&deg;F. Place the pie in the center of the rack and bake until the sides are just set, the filling is slightly puffed, and the center jiggles slightly, about 30 minutes. Be sure to turn the pie halfway through baking. Allow the pie to cool on the counter for 30 minutes, then press plastic wrap directly on top of the filling and chill for at least one hour. Slice to serve, or store in the fridge for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Compote:</strong> Combine the rhubarb and strawberries in a medium sized saucepan set over low heat, stirring occasionally. After about 5 minutes, the fruit will begin to soften and let out liquid. Stir in the sugar a little at a time un1til desired sweetness is reached. Remove from heat and chill to cool completely. Once cool, use as a pie topping if desired. Leftovers are great on toast or stirred into yogurt.</p>"}]}