{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120816-218974-cook-the-book-banana-fritters-kaya-jam.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["bananas", "coconut", "Cook the Book", "fritters", "jams", "pandan", "Susan Feniger", "Susan Feniger's Street Food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Susan Feniger's Sesame Crusted Banana Fritters with Coconut Kaya Jam", "link": "https://www.seriouseats.com/recipes/2012/08/susan-fenigers-street-foods-sesame-crusted-ba.html", "description": "Susan Feniger's Coconut Kaya Jam (a pudding-like mixture of rich coconut milk; grassy, vanilla-like pandan leaves, sugar, and eggs) is familiar to anyone with a Top Chef addiction. Who could forget Gail Simmons' proclamation that she'd \"love to be sticking [her] finger in [it] at all ours of the day\"?", "totalTime": "2 1/2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Banana", "Coconut", "Condiments and Sauces", "Cook the Book", "Fruit Desserts", "Puddings and Custards"], "recipeIngredient": ["<strong>For the Jam</strong>", "1 cup well-shaken canned coconut milk", "1 cup sugar", "8 fresh pandan leaves", "1/4 teaspoon kosher salt", "3 large eggs", "3 large egg yolks", "&nbsp", "<strong>For the Fritters</strong>", "1/3 cup rice flour", "3/4 cup all-purpose flour", "1 1/2 tablespoons sugar", "1/4 cup sesame seeds, toasted", "1/2 teaspoon kosher salt", "1 cup sparkling water", "Canola oil, for frying", "8 ripe mini bananas, or 4 regular-size bananas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Jam:</strong> In a small saucepan, combine the coconut milk and 1/2 cup of the sugar. Cut the root end off the pandan leaves and wash the leaves under cold running water to remove any dirt. Cut the pandan into 4-inch pieces to better fit into the saucepan. Add the pandan and the salt to the coconut milk mixture. Bring the mixture to a boil, pushing the pandan leaves down into the milk, and cook for 3 to 4 minutes until soft. Remove from the heat and let the mixture steep for 20 minutes, or until the pandan is cool enough to handle with your bare hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull the pandan leaves out of the pan and squeeze them over the coconut mixture to extract as much flavor and liquid as possible. Discard the leaves and set the liquid aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 inches of water to a simmer in a medium saucepan. In a stainless steel bowl, whisk together the eggs, egg yolks, and remaining ½ cup sugar. Slowly whisk in the coconut mixture. Set the bowl over the saucepan of lightly simmering water and cook gently, stirring constantly with a rubber spatula, until the mixture thickens, 15 to 20 minutes. It will seem like a long time before you see any results, but then the moment the mixture starts to set, it becomes easy to overcook—so be careful not to walk away. The texture should be like a thick custard. Pour the mixture into a clean container and put it in the refrigerator to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fritters:</strong> In a medium bowl, whisk together the rice flour, all-purpose flour, sugar, sesame seeds, and salt. Slowly whisk in the sparkling water to create the consistency of a loose pancake batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a wide pan with 3-inch sides (a cast-iron skillet works best) with enough oil to reach halfway up the sides. (Remember, the oil will expand and rise as it heats.) Heat the oil over medium heat for 4 to 5 minutes, or until a drop of batter floats immediately and a deep-frying thermometer registers 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the bananas and cut them lengthwise into long, thin slices (1/8 inch thick, about 4 slices per banana). (If you are using large bananas, cut them in half horizontally and then slice them lengthwise.) Dip each slice in the batter, drop it into the hot oil, and fry for 2 to 3 minutes on each side, or until golden brown. Transfer to a paper-towel-lined plate to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, with a bowl of the jam for dipping.</p>"}]}