{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120918-127677-LTE-Marble-Pound-Cake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["chocolate", "Let them eat cake", "pound cake", "Vahlrona"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Almond-Chocolate Marble Pound Cake", "link": "https://www.seriouseats.com/recipes/2012/09/almond-chocolate-marble-pound-cake-recipe.html", "description": "Pound cake, in its elegant simplicity, adapts to a number of variations and additions; try this marbled almond and Vahlrona version.", "totalTime": "2 hours, 20 minutes", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Cakes", "Chocolate", "Let Them Eat..."], "recipeIngredient": ["Baking spray", "2 tablespoons almond paste", "1 1/4 cups (about 8 3/4 ounces) granulated sugar", "2 cups (about 8 ounces) cake flour", "3/4 teaspoon salt", "1/4 cup good quality cocoa powder, such as Vahlrona", "1/4 cup boiling water", "3 large eggs plus 2 large egg yolks, at room temperature", "2 1/2 sticks (10 ounces) unsalted butter, at room temperature ", "1 1/2  teaspoons almond extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 325&deg;F. Coat a 9- by 5-inch loaf pan with baking spray. Line pan with 1 sheet of parchment paper, allowing sides to hang over edges of long sides of pan. Coat parchment with baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In small bowl, rub almond paste into sugar with fingertips until completely crumbled. Alternatively, pulse almond paste and sugar in food processor until completely crumbled. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whisk together flour and salt. In large bowl, combine cocoa powder and boiling water, stirring until smooth; reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat butter and almond sugar with electric mixer on medium speed until light and fluffy, about 3 minutes. Add eggs and egg yolks one at a time, beating well after each addition and scraping down bottom and sides of bowl with rubber spatula as needed. Add almond extract and beat just until incorporated, about 10 seconds. Sift flour over mixture in three batches, folding in with rubber spatula after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer 1/3 of batter to bowl with chocolate mixture and stir until thoroughly incorporated. Spoon half of plain batter and half of chocolate batter into prepared baking pan, alternating spoonfuls to create a checkerboard pattern. Repeat procedure with remaining batters. Run a dinner knife through batters in a swirling motion to create a marbled pattern.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cake until tester inserted in center of cake comes out clean, 45 to 50 minutes. Transfer to cooling rack and cool in pan 10 minutes. Using parchment overhang, transfer cake directly to cooling rack and cool completely, about 1 hour.  Serve.</p>"}]}