{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120409-127677-Sandwiched-Popovers-Chocolate-Mousse-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["chocolate desserts", "chocolate mousse", "dessert sandwiches", "popovers", "sandwich", "sandwiched"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cocoa Popovers with Chocolate Mousse and Raspberries", "link": "https://www.seriouseats.com/recipes/2012/04/sandwiched-cocoa-popovers-with-chocolate-mous.html", "description": "Note: Don't use higher cocoa content chocolate, as it will affect texture of mousse. Popover recipe adapted from Serious Eats by Carrie Vasios (original recipe). Mousse recipe adapted form Gourmet, December 2002. About the author: María del Mar Sacasa is...", "totalTime": "2 hours", "recipeYield": "makes 6", "recipeCategory": ["Breakfast Sweets", "Cakes", "Chocolate", "Sandwiches"], "recipeIngredient": ["<strong>For the Cocoa Popovers</strong>    ", "4 tablespoons (1/2 stick or 2 ounces) unsalted butter, melted", "4 large eggs, at room temperature", "1 1/2 cups milk, warm", "1 cup plus 6 tablespoons all-purpose flour (about 6 3/4 ounces)", "2 tablespoons natural cocoa powder ", "1 tablespoon sugar", "1 teaspoon salt", "   ", "<strong>For the Chocolate Mousse</strong>    ", "2 cups heavy cream, chilled", "4 large eggs, separated", "1/4 cup sugar", "2 teaspoons almond extract", "6 ounces bittersweet (60%) chocolate, chopped (see note)", "1/4 teaspoon salt", "   ", "<strong>For the Assembly</strong>    ", "6 tablespoons honey", "1 pint fresh raspberries", "Maldon salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cocoa Popovers:</strong> Adjust oven rack to middle position and preheat oven to 450&deg;F. With pastry brush, coat popover pan thoroughly with 1 tablespoon butter. In large bowl, whisk together eggs and milk. Whisk in remaining 3 tablespoons butter. Sift flour, cocoa powder, and salt into a separate large bowl. Add milk mixture a small amount at a time, whisking until combined. Transfer mixture to refrigerator and allow to rest while you make the custard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Mousse:</strong> Bring 1 cup cream to simmer in large heavy-bottomed saucepan over medium heat. In large bowl, whisk together egg yolks and 2 tablespoons sugar until mixture is thick and pale yellow in color. Secure bowl to counter by wrapping a damp kitchen towel around the base, or by setting it on top of a rubber non-skid mat, then, slowly pour in the hot cream, vigorously whisking to incorporate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to now-empty saucepan and cook over medium-low heat, stirring constantly, until it is thick enough to coat the back of a spoon and registers 160&deg;F on an instant read thermometer. Pour custard through a fine-mesh sieve into a bowl and stir in almond extract. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt chocolate in microwave in a microwave-safe bowl, stirring ever 20 seconds until chocolate is completely melted, smooth, and glossy. Alternatively, place chocolate in metal bowl that fits over a saucepan. Bring about 2 inches of water to boil in saucepan and arrange bowl over pan, making sure bottom of bowl does not make contact with water. Stir until chocolate is completely melted, smooth, and glossy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk melted chocolate into custard until thoroughly incorporated. Place piece of plastic wrap directly on surface of custard and place in refrigerator until completely cold, about 30 minutes. Alternatively, place custard bowl in an ice bath and stir until completely cold, about 10 minutes. Mixture will be very dense.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once custard is chilled, in a stand mixer or with an electric mixer, beat egg whites on medium speed until frothy, then, slowly add remaining 2 tablespoons sugar and continue beating until firm, but not dry, peaks form. Stir 1/3 of whites into custard to loosen, then carefully fold in the remaining whites with a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out egg white bowl, and beat remaining 1 cup cream on medium speed to soft peaks, then fold into mixture. Cover and refrigerate until needed (mousse may be made up to 24 hours in advance).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Assembly:</strong> Once popover mixture has rested (mixture should rest at lest 30 minutes) mix just to reincorporate. Divide batter equally between popover cups and bake until puffed and golden, about 30 minutes. Transfer to cooling rack and cool in pan about 5 minutes. Turn popovers out directly onto rack and cool an additional 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With serrated knife, cut off popover tops and remove crumb. Cool to room temperature, about 10 minutes, then fill with mousse. Drizzle with honey, top with raspberries, and sprinkle with (optional) Maldon salt. Top with popover tops. Serve immediately.</p>"}]}