{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120814-219273-bread-baking-dried-blueberry-biscuits.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["biscuits", "blueberries", "bread baking", "breads", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dried Blueberry Biscuits", "link": "https://www.seriouseats.com/recipes/2012/08/dried-blueberry-biscuits-recipe.html", "description": "Giving these milk biscuits a few folds before cutting them makes for extra flaky, tender layers. I like to use dried blueberries, but any dried berry will do.", "totalTime": "35 minutes", "recipeYield": "Makes 12 biscuits", "recipeCategory": ["Biscuit", "Blueberry", "Bread Baking", "Breakfast and Brunch", "Vegetarian"], "recipeIngredient": ["2 cups self-rising flour (or two cups all-purpose flour mixed with 1 tablespoon baking powder and 1 teaspoon salt)", "1 tablespoon sugar (plus more for sprinkling)", "1/2 stick (4 tablespoons) cold butter", "1/2 cup dried blueberries", "3/4 cup cold milk (plus more as needed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper, adjust oven rack to center position, and and preheat oven to 425&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the flour and sugar. Cut the butter into several pieces and add it to the bowl. Using a pastry cutter or two knives cut the butter into the flour until the largest pieces are no larger than a pea. Add the blueberries and stir to combine, then the milk. Stir just enough to moisten all the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto a floured work surface. Shape it into a rough rectangle. Flour the top and roll to a rectangle roughly 12- by 9-inches and 1/4 inch thick. Fold in thirds crosswise like a letter. Rotate dough 90 degrees. Flour the work surface and dough as needed and roll into a rectangle again. Fold in thirds again. Roll once more into a rectangle roughly 9- by 6-inches and 3/4-inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a 2 1/2-inch biscuit cutter, cut as many rounds from the dough as you can, cutting straight down without twisting the cutter. Place them on the prepared baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather the scraps, trying not to turn any of the pieces sideways (this keeps the layers running horizontally) and flatten to the same 3/4-inch thickness. Cut as many pieces as possible again. Gather the scraps again. Usually I make the last biscuit or two free-form. They're not as pretty, but that's fine for sampling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the tops of the biscuits with a little bit of milk and sprinkle with sugar. Bake at 425&deg;F in the center of the oven until the biscuits are light golden brown, about 15 minutes. Remove the biscuits from the oven and place on a rack to cook just for a moment before serving.</p>"}]}