{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120403-199590-GFTues-Poutine-Recipes.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["cheese", "french fry", "gluten free", "Gluten-Free Tuesday", "gravy", "poutine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Poutine", "link": "https://www.seriouseats.com/recipes/2012/04/gluten-free-poutine.html", "description": "[Photographs: Elizabeth Barbone] The recipe makes a classic poutine, only gluten-free. To serve your poutine nice and hot, this flow works well: Prepare fries up to final frying stage. Prepare gravy. Keep warm over low heat. Be sure to whisk...", "totalTime": "2 hours", "recipeYield": "serves 4", "recipeCategory": ["Cheese", "French Fries", "Gluten-Free", "Gluten-Free Tuesday", "Sides"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2009/06/perfect-french-fries-recipe.html\">Perfect Thin and Crispy French Fries</a>, prepared until just before final frying stage", "8 ounces (1 cup) gluten-free chicken stock, divided, warm", "3 tablespoons butter", "3 tablespoons sweet rice flour", "8 ounces (1 cup) gluten-free beef broth, warm", "1 tablespoon cornstarch", "1 teaspoon apple cider vinegar", "Kosher salt and freshly ground black pepper", "8 ounces cheese curds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak potatoes as directed in recipe. <em>Prepare gravy:</em> Just before frying french fries, prepare gravy. Reserve one tablespoon chicken stock. Set aside. In medium pot, melt butter over medium-high heat. Add sweet rice flour and whisk to combine. A thick paste will form. Cook, whisking constantly, until mixture turns lightly golden brown, about three minutes.  Whisking constantly, add remaining chicken stock and all beef broth in a slow and steady stream. Cook until gravy thickens, about four minutes. Combine cornstarch and reserved chicken stock. Whisk with a fork until smooth. Add to gravy. Continue whisking and bring gravy to a boil. Reduce heat to low. Add vinegar and season to taste with salt and pepper. Whisk gravy occasionally while you prepare the french fries. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove cheese curds from refrigerator. Set aside. Fry french fries as directed in recipe. Divide cooked french fries between four bowls. Top with cheese curds and gravy. Serve immediately. </p>"}]}