{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120518-207004-scone-thugs-n-harmony.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "breakfast sweets", "Kir Jensen", "scones", "The Sugar Cube"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scone Thugs-'n'-Harmony", "link": "https://www.seriouseats.com/recipes/2012/05/the-sugar-cube-kir-jensens-scone-thugs-n-harmony-recipe.html", "description": "But hip hop and high tea aside, these Scone Thugs are pretty awesome: delicate, buttery, and packed with loads of bright lemon zest.  Cake flour and plenty of butter give them a wonderfully tender crumb. And while they're gorgeous on their own, we certainly wouldn't balk at Jensen's suggestion for topping them with lemon curd or rhubarb jam.", "totalTime": "40 minutes", "recipeYield": "makes 8 scones", "recipeCategory": ["Breakfast Sweets", "Desserts"], "recipeIngredient": ["2 1/4 cups cake flour ", "1/3 cup sugar, plus more for sprinkling ", "1 tablespoon baking powder", "Grated zest of 2 large lemons", "3/4 cup (1 1/2 sticks) unsalted butter, cut into 1/2-inch cubes and frozen  ", "1/2 to 3/4 cup cold heavy cream, plus extra for brushing", "1 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large baking sheet with parchment paper. In the bowl of a food processor, combine the flour, sugar, and baking powder and pulse a few times. Add the lemon zest and butter and pulse until the mixture is pale yellow and the consistency of cornmeal. (If you don’t have a food processor, just whisk the dry ingredients together in a large bowl, then cut in the zest and butter with a pastry blender.)<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to a wide mixing bowl. Make a well in the center and pour in 1/2 cup of the cream and the vanilla. Using your hand, draw the dry ingredients into the wet, mixing until just combined (you don’t want to overmix, or the scones will be tough). If the mixture feels too dry and crumbly, add the remaining 1/4 cup cream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, form the dough into a patty about 9 inches wide and 3/4 inch thick. Cut into 8 wedges. Transfer each wedge to the prepared baking sheet and chill in the freezer for at least 15 minutes. (This will firm up the butter so it will create flaky layers when baked.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Remove the scones from the freezer, brush the tops with heavy cream, and sprinkle with sugar. Place on the middle rack of the oven and bake, rotating the pan from front to back halfway through, until the scones are golden brown and the tops are firm to the touch, 15 to 20 minutes. Cool for 10 minutes before serving...that is, if you can wait that long. <br />\n</p>"}]}