{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120113-127677-Dulces-Islas-Flotantes-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["chilled desserts", "coconut desserts", "creme anglaise", "Dulces", "Latin American desserts", "meringue desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Islas Flotantes de Coco (Coconut Floating Islands)", "link": "https://www.seriouseats.com/recipes/2012/01/dulces-islas-flotantes-de-coco-coconut-floating-islands-recipe.html", "description": "Though some recipes call for baking the meringues and then slipping them into the custard, I follow the more traditional route and poach them. A bite reveals that these islands are rather more like clouds.", "totalTime": "2 to 4 hours", "recipeYield": "makes 8 servings", "recipeCategory": ["Desserts"], "recipeIngredient": ["<strong>For the Floating Islands</strong>    ", "1 (13.5-ounce) can coconut milk", "1/2 cup heavy cream", "4 large egg whites, at room temperature", "1/8 teaspoon salt", "1/2 cup sugar", "1/3 cup sweetened flaked coconut", "&nbsp;  ", "<strong>For the Coconut Crème Anglaise</strong>    ", "3 large egg yolks, at room temperature", "1/4 cup sugar", "1 tablespoon dark rum", "1 teaspoon pure vanilla extract", "&nbsp;  ", "<strong>For the Cashew Crunch</strong> ", "Nonstick cooking spray", "1 1/2 cups sugar", "1 cup water", "1/2 teaspoon pure vanilla extract", "1 1/4 cups roasted and salted cashews, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Floating Islands:</strong> Line baking sheet with 2 layers of paper towels.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring coconut milk and cream to simmer over medium-low heat in large heavy-bottomed saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whip egg whites and salt to soft peaks at medium-high speed, about 2 minutes. With mixer running, gradually add sugar. Continue whipping until stiff, glossy peaks from, 2 to 3 minutes longer. Fold in coconut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using 2 soup spoons, scoop out meringues 1 at a time into an egg-like shape and gently slide into simmering coconut milk mixture (there will be 8 total&mdash;poach in batches of 4). Poach 1 to 2 minutes, then turn over and poach for another 1 to 2 minutes. Meringues will puff slightly and firm up, then deflate as they cool. Transfer to prepared baking sheet and refrigerate at least 30 minutes and up to 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the coconut milk mixture into bowl and wipe out saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coconut Crème Anglaise:</strong> Whisk eggs yolks and sugar in large bowl until very thick and pale yellow.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly pour warm coconut milk mixture into egg mixture. Return mixture to large saucepan and cook over low heat, stirring constantly with a wooden spoon, until thickened: mixture should coat the back of spoon, and, if you run a finger across it, a clear trail will be left, 3 to 5 minutes. Don’t cook mixture over 180&deg;F&mdash;it will curdle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain sauce into bowl, then stir in rum and vanilla. Press plastic wrap directly onto sauce and refrigerate until completely chilled, about 2 hours. Alternatively, place bowl in ice bath and stir until chilled, 5 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cashew Crunch:</strong> Adjust oven rack to middle position and preheat oven to 350&deg;F. Line baking sheet with parchment paper and lightly coat with nonstick cooking spray. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar and 1/2 cup water in medium heavy-bottomed saucepan, stirring over medium heat until sugar dissolves. Increase heat to medium-high and boil, swirling pan occasionally, until syrup turns amber, 15 to 20 minutes. Immediately remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully add remaining 1/2 cup water and vanilla: mixture will bubble and sputter. Once syrup has settled, return pan to heat and cook, stirring over medium heat, until temperature reaches 230&deg;F on candy thermometer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, combine cashews and 1/4 cup of syrup. Lightly coat both sides of rubber spatula with nonstick cooking spray, then scrape out mixture onto prepared baking sheet. Flatten out into single layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake crunch until deep golden and fragrant, 7 to 10 minutes. Transfer to cooling rack and cool to room temperature, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break into pieces. Cashew crunch may be prepared up to 2 days in advance and stored at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caramel Sauce:</strong> Transfer remaining caramel to microwave-safe pitcher or glass liquid measuring cup. Caramel sauce may be prepared up to 2 days in advance and stored at room temperature. If it hardens, microwave for 20 to 30 seconds until it becomes liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Divide crème anglaise among 8 dessert plates. Place a meringue on top of each pool, then top with cashew crunch and drizzle with caramel. </p>"}]}