{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120802-217021-old-school-peach-cobbler-pre-flip.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "cobblers", "fruit desserts", "peaches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Old Fashioned Peach Cobbler (A.K.A. Peach Puzzle)", "link": "https://www.seriouseats.com/recipes/2012/08/old-fashioned-peach-cobbler-recipe.html", "description": "This old fashioned peach cobbler has a trick: a tea cup or ramekin catches all the juices during baking, making for a delicious syrup.", "totalTime": "1 hour and 30 minutes", "recipeYield": "Serves 7", "recipeCategory": ["American Classics", "Fruit Desserts", "Peach"], "recipeIngredient": ["2 cups (about 10 ounces) all-purpose flour", "2 tablespoons (about 1/2 ounce) sugar", "2 teaspoons baking powder", "1/4 teaspoon salt", "7 tablespoons unsalted butter, cut into 1/2 tablespoon pieces, plus more for buttering pie plate", "1 egg", "3/4 cup (about 6 ounces) whole milk", "7 medium peaches or 6 large peaches, peeled with stems removed", "3/4 cup (about 6 ounces) packed dark brown sugar", "1/4 teaspoon salt", "1/4 cup water", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to middle position and preheat oven to 400°F. Add flour, sugar, baking powder, and salt to the bowl of a food processor. Pulse several times to mix. Add 4 tablespoons of butter pieces and pulse several more times until butter is incorporated as tiny pieces. Transfer mixture to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl whisk together egg and milk then add liquid to flour mixture. Stir with a spoon until well incorporated and a sticky dough begins to form. Turn dough out on a very well floured surface and sprinkle the top with flour then knead lightly until you have a soft, workable dough. Wrap dough in plastic wrap and refrigerate while you prepare the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously butter a 9-inch pie dish. Place an inverted teacup or 6 ounce ramekin in the center of the pie plate and butter the outside of the cup. Place peaches, stem side down into the dish, spacing them out evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan add sugar, salt, remaining 3 tablespoons butter, water and vanilla extract. Heat over medium, stirring until sugar has dissolved and butter has melted. Pour syrup evenly over peaches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out biscuit dough so you have a large circle that will cover the peaches (about 11 inches). Drape dough over the peaches (dough will be stretchy) and press the dough so it fits around the peaches (do not press the dough into the sides of the pans). Bake for 30 to 35 minutes or until the top of the biscuit is golden brown. Remove from oven and place on a wire rack to cool for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cobbler has cooled, place a large serving plate over the pie dish and quickly invert so as not to spill the juice. Slice so each piece has a full peach and drizzle with extra syrup. Serve immediately with whipped cream or vanilla ice cream.</p>"}]}