{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121116-229557-cook-the-book-creamed-onions-edit.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "creamed onions", "onions", "Sam Sifton", "Thanksgiving: How to Cook it Well"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sam Sifton's Creamed Onions", "link": "https://www.seriouseats.com/recipes/2012/11/sam-siftons-creamed-onions.html", "description": "Nothing screams fancy dinner quite like a bowl of pearl onions. The small orbs of sweetness signal vast amounts of prep time and tears on the part of the cook. But don't let the extra work steer you away from <strong><a href=\"http://en.wikipedia.org/wiki/Sam_Sifton\">Sam Sifton's</a></strong> recipe for <strong>Creamed Onions</strong>. These morsels are easy to peel once par-boiled and shocked, then are coated in the most luscious of cream sauces. A smattering of bacon adds even more richness as well as smoky flavor, and a bright finish of herbaceous parsley, cayenne, and black pepper balance the sauce.", "totalTime": "1 hour and 20 minutes", "recipeYield": "serves 6", "recipeCategory": ["Bacon", "Cook the Book", "Sides"], "recipeIngredient": ["2 pounds fresh pearl onions", "3 thick slices of bacon, cut into lardons", "3 tablespoons all-purpose flour", "1 1/2 cups turkey or chicken broth", "1 cup heavy cream, or light cream, or milk", "2 sprigs fresh thyme, stems removed, leaves chopped fine", "1 pinch cayenne pepper, or to taste", "Kosher salt and freshly ground black pepper to taste", "Chopped fresh parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a saucepan about halfway with water and set over high heat until it comes to a boil. Add onions and cover, then turn off the heat and allow them to sit for 15 minutes, or until the skins are very soft. Drain onions and rinse them in cold water until they are cool enough to handle. Using a small paring knife and your fingers, remove the skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan set over medium heat, cook the bacon until it renders its fat and begins to turn crisp, approximately 5 minutes. Remove bacon from pan and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add flour to the pan and stir it into the fat to create a roux. Cook, stirring constantly, for 3 to 5 minutes, or until the roux begins to color. Add the broth and whisk to combine. Add the cream, the thyme and the cayenne, and salt and pepper to taste. Cook for a few minutes to thicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onions to the pan, reduce heat to a low simmer and cook, covered, for 30 to 40 minutes, or until the onions are tender and the sauce is quite thick. Garnish with the reserved bacon, another pinch of cayenne and — of course — chopped parsley.</p>"}]}