{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20110116-chilaquiles-pumpkin-seed-salsa-verde-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["beans", "black beans", "breakfast", "chilaquiles", "Mexican", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Chilaquiles With Pepitas, Charred Corn, and Black Beans", "link": "https://www.seriouseats.com/recipes/2012/01/vegan-chilaquiles-with-pepitas-charred-corn-and-black-beans.html", "description": "Chilaquiles are a classic Mexican breakfast dish that can be pretty aptly described as a fried tortilla casserole. Crisp chips are soaked in salsa (in this case a bright and tangy salsa verde made from tomatillos&mdash;charred to add some bitter,...", "totalTime": "1 hour 15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beans and Pulses", "Breakfast and Brunch", "Dairy-Free", "Mains", "Mexican", "Mother's Day", "Vegan", "Vegetarian"], "recipeIngredient": ["1 1/2 pounds tomatillos, peeled and cut in half", "6 cloves garlic", "1 small onion, roughly chopped", "1 serrano or jalapeño pepper", "Kosher salt", "1 tablespoon vegetable oil ", "1 ear corn, kernels removed", "12 ounces corn tortilla chips", "1 cup canned black beans (about half of a 14-ounce can), drained and rinsed", "1 avocado, thinly sliced", "1 small onion, thinly sliced, slices placed in a bowl of cold water for 10 minutes", "2 tablespoons chopped cilantro", "1/2 cup toasted pumpkin seeds (pepitas)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Place tomatillos, garlic, onion, and pepper on a foil-lined heavy-duty rimmed baking sheet. Broil without moving until well charred on top side, about 15 minutes. Flip vegetables with a spatula and continue broiling until well-charred and completely softened, about 15 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer vegetables to a food processor and process until roughly pureed. Season salsa verde to taste with kosher salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a medium skillet over high heat until smoking. Add corn kernels, toss to coat, and cook without moving until charred on one side. Toss and continue to cook, tossing occasionally until well charred all over, about 6 minutes total. Season to taste with kosher salt and transfer to a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 1/2 cups salsa verde and 1 cup water in a large saucepan until simmering. Add tortilla chips and fold with a rubber spatula until all the chips are coated. Transfer chips to a large serving dish or individual serving plates. Top with charred corn, black beans, avocado slices, sliced onion, chopped cilantro, and toasted pumpkin seeds. Serve immediately with a side of vegan refried beans if desired.</p>"}]}