{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121012-225216-cook-the-book-mac-and-greens.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "ellen brown", "greens", "mac and cheese", "Marcus Samuelsson", "red rooster"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Red Rooster's Mac and Greens", "link": "https://www.seriouseats.com/recipes/2012/10/red-roosters-mac-and-greens.html", "description": "<a href=\"http://www.marcussamuelsson.com/\">Marcus Samuelsson's</a> penchant for Southern American-African-Swedish fusion cuisine always makes him an interesting chef to watch. His recipe for <strong>Mac and Greens</strong>, adapted in <strong>Ellen Brown's</strong> <em><a href=\"http://www.amazon.com/Mac-Cheese-Creative-Versions-Ultimate/dp/0762446595?tag=serieats-20\">Mac &amp; Cheese</a></em>, fits right into his oeuvre. The recipe title is apt, as his mac contains just as much greenery as pasta. Braised collards and bok choy pair perfectly with the gooey cheddar-Gruyère-Parmesan mix, and the hints of soy and coconut lend glutamate-rich depth. But don't be fooled, this is no health food--there's bacon, heavy cream, and plenty of cheese in each and every nook and cranny.", "totalTime": "about 2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cheese", "Cook the Book", "Mac and Cheese", "Mains", "Pork"], "recipeIngredient": ["<strong>For the Greens</strong>", "3 slices bacon", "1/4 cup light coconut milk", "2 tablespoons soy sauce", "1 1/2 teaspoons grainy mustard", "2 tablespoons olive oil", "2 garlic cloves, halved", "2 cups firmly packed shredded collard greens", "2 cups shredded bok choy", "&nbsp", "<strong>For the Topping</strong>", "1/4 cup panko breadcrumbs", "1/4 cup toasted plain breadcrumbs", "1/4 cup chopped fresh parsley", "2 tablespoons freshly grated Parmesan", "Salt and freshly ground white pepper to taste", "&nbsp", "<strong>For the Pasta</strong>", "1/2 pound orecchiette", "1/4 cup (1/2 stick) unsalted butter", "2 shallots, thinly sliced", "1 tablespoon all-purpose flour", "1 garlic clove, minced", "2 cups heavy cream, warmed", "1/2 cup whole milk, warmed", "4 ounces cheddar, grated", "2 ounces freshly grated Parmesan", "2 ounces Gruyère, grated", "1/2 teaspoon freshly grated nutmeg", "1/2 teaspoon dry mustard powder", "Salt and freshly ground white pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Greens:</strong> Cook the bacon in a large skillet over medium-high heat for 5 to 6 minutes, or until crisp. Remove the bacon from the pan, reserving the bacon grease. Drain the bacon on paper towels. Crumble the bacon, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the coconut milk and soy sauce in a small pan, and bring to a boil over medium heat. Stir in the mustard and bacon, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil and bacon grease over medium-low heat. Add the garlic and cook for 4 to 5 minutes, or until the garlic is pale golden. Remove and discard the garlic. Raise the heat to medium-high, and add the collard greens. Cook, stirring frequently, until the greens wilt. Add the coconut milk mixture, cover the pan, and cook the greens over low heat for about 12 minutes, stirring occasionally, or until the greens are almost tender and the sauce has thickened. Add the bok choy, and cook, covered, for an additional 3 to 5 minutes, or until tender. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Topping:</strong> Combine the panko, breadcrumbs, parsley, Parmesan, salt, and pepper in a food processor fitted with the steel blade, and grind until fine using on-and-off pulsing. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pasta:</strong> Preheat the oven to 375 degrees. Grease a 13x9-inch baking pan. Bring a pot of salted water to a boil over high heat. Cook the pasta until it is just beginning to soften to the al dente stage. Drain the pasta, run it under cold water, and return it to the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the butter in a saucepan over medium-low heat. Add the shallots and cook for 7 to 10 minutes, or until the shallots are golden. Stir in the flour and garlic, and cook, stirring constantly, for 1 minute, or until the mixture turns slightly beige, is bubbly, and appears to have grown in volume. Increase the heat to medium, and slowly whisk in the warm cream and milk. Bring to a boil, whisking frequently. Reduce the heat to low, and simmer the sauce for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cheeses to the sauce by 1/2-cup measures, stirring until the cheese melts before making another addition. Stir in the nutmeg and mustard. Pour the sauce over the pasta, and stir well. Fold in the cooked greens, and season to taste with salt and pepper. Transfer the pasta to the prepared pan, and sprinkle the topping over the dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the casserole for 20 to 30 minutes, or until the cheese sauce is bubbly and the crumbs on the top are deep brown. Allow to sit for 5 minutes, then serve.</p>"}]}