{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120322-198373-basic-tomato-sauce.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Jim Lahey", "My Pizza", "pizza", "tomato sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Basic Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2012/03/basic-tomato-sauce-jim-lahey.html", "description": "When it comes to sauce making, Lahey keeps it simple, as in really simple.  His <strong>Basic Tomato Sauce</strong> is nothing more than tomatoes crushed and blended with a bit of salt and olive oil.  No cooking, no herbs, no garlic, just tomatoes.  He gives two options for tomatoes: canned or fresh.  We'd go with a good can of San Marzanos until July rolls around since they're the ones that are going to pack the sweetest, tomato-iest punch.", "totalTime": "10 minutes for fresh tomatoes, 5 minutes for canned", "recipeYield": "Makes 620 to 800 grams (depending on whether you use fresh or canned tomatoes, which yield a greater volume); or enough for about 8 pizzas", "recipeCategory": ["Cook the Book", "Pizza"], "recipeIngredient": ["700 grams (1 ½ pounds) ripe plum tomatoes or 1 794-gram (28-ounce) can peeled Italian plum tomatoes", "20 grams (about 2 tablespoons) extra-virgin olive oil", "2 grams (1/4 teaspoon) fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fresh tomatoes, bring 4 quarts water to a boil in a 5- to 6-quart pot.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut away the dry stem area of the tomatoes, leaving the core intact. Place 2 or 3 tomatoes at a time in the boiling water for 5 to 10 seconds. Remove with a slotted spoon and put on a rack to cool. Peel the tomatoes with a paring knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whether using fresh or canned, cut each tomato into several wedges and run them through a food mill over a medium bowl to create a pulp (not a fine puree; you want to retain some texture). If you don’t have a food mill, just squish them with your hands—it’s messy but fun.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the olive oil and salt. The sauce will keep, covered, in the refrigerator for up to 1 week.</p>"}]}