{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121010-vegetarian-lasagna-spinach-mushroom-whole.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["Italian", "lasagna", "mushrooms", "pasta", "spinach", "The Food Lab", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Ultra-Creamy Spinach and Mushroom Lasagna", "link": "https://www.seriouseats.com/recipes/2012/10/ultra-creamy-spinach-and-mushroom-lasagna-recipe.html", "description": "An ultra-creamy, hearty lasagna stuffed with spinach, mushrooms, and cheese. Rich enough to appease even the most hard-core meat eater.", "totalTime": "1 1/2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Christmas", "Italian", "Lasagna", "Mains", "Mushrooms", "Spinach", "The Food Lab", "Vegetarian"], "recipeIngredient": ["8 tablespoons (1 stick) unsalted butter, plus more for greasing baking dish, divided", "3 medium cloves garlic, minced (about 1 tablespoon)", "2 pounds washed fresh spinach leaves, roughly chopped", "1 pint (2 cups) heavy cream, divided", "1/2 teaspoon freshly grated nutmeg", "Kosher salt and freshly ground black pepper", "1 pound cottage cheese", "1/2 cup chopped fresh parsley leaves, divided", "1 egg", "1 package (15 sheets) no-boil lasagna noodles", "24 ounces button, cremini, or shiitake mushrooms, stems removed, finely chopped (see note)", "2 medium shallots, finely chopped (about 1/2 cup)", "2 teaspoons minced fresh thyme leaves", "1 tablespoon soy sauce", "2 teaspoons fresh juice from 1 lemon", "2 tablespoons flour", "2 cups whole milk", "12 ounces whole milk mozzarella, grated, divided", "2 ounces Parmiggiano-reggiano, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to the upper-middle position and preheat oven to 400°F. Melt 3 tablespoons butter in a large saucepan over medium-high heat until foaming subsides. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add spinach in batches, allowing previous batch to wilt before adding next. Once all spinach is added, add 1 cup heavy cream. Bring to a boil, and reduce to a strong simmer. Cook, stirring frequently, until thick and reduced, about 15 minutes. Add nutmeg, and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While spinach is cooking, combine cottage cheese, egg, and 6 tablespoons parsley in the bowl of a food processor. Process until combined and cottage cheese is broken up to the texture of ricotta cheese, about 5 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cooked spinach and cottage cheese mixture in a large bowl. Meanwhile, place lasagna noodles in a 8- by 13-inch baking dish and cover with warm water. Allow to soak, agitating occasionally to prevent sticking, until lightly softened, about 15 minutes. Transfer in a single layer to a clean kitchen towel to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While noodles soak, wipe out spinach pot and return to medium-high heat. Add 3 more tablepsoons butter and heat until melted. Add mushrooms and cook, stirring occasionally, until liquid evaporates and mushrooms start to sizzle, about 10 minutes. Add shallots and thyme and cook, stirring frequently, until fragrant and softened, about 2 minutes. Add soy sauce and lemon juice and stir to combine. Add remaining heavy cream. Bring to a simmer, and cook until lightly thickened, about 3 minutes. Season to taste with salt and pepper. Transfer mixture to another bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out pot and return to medium-high heat. Add remaining 2 tablespoons butter and heat until melted. Add flour and cook, stirring constantly with a whisk, until light golden blond. Slowly pour in milk, whisking constantly. Bring to a simmer, then remove from heat. Stir in 2/3rds of mozzarella and parmesan, then season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble lasagna, dry the 8- by 13-inch baking dish and grease with butter. Add 1 cup cheese sauce to bottom of dish. Lay three noodles on top of it, spacing them evenly across the bottom of the dish (there will be about 1/4-inch gap between each noodle and the edge of the pan. This is fine). Top noodles evenly with half of mushroom mixture, then top with another three noodles. Top with half of spinach/cottage cheese mixture, then top with another three noodles. Repeat layers with remaining mushroom mixture, spinach mixture, and noodles, ending with a layer of noodles. Pour remaining cheese sauce over top and spread evenly. Sprinkle remaining 1/3rd of grated mozzarella evenly over top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until lasagna is bubbling around the edges, about 20 minutes. Switch broiler on and broil until top is lightly browned, about 5 minutes longer (if you have an under-oven broiler, you'll have to transfer it to the broiler after baking). Let cool for 10 minutes, then slice and serve.</p>"}]}