{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120822-dt-bobby-flays-skate-amandine-with-preserved-lemon.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Bobby Flay", "Dinner Tonight", "fish", "seafood", "skate", "sole"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bobby Flay's Skate Amandine with Preserved Lemon", "link": "https://www.seriouseats.com/recipes/2012/08/bobby-flays-skate-amandine-with-preserved-lem.html", "description": "Last week, when celebrating Julia Child's100th birthday, I started craving that famous dish that she described as an early culinary epiphany while in France: sole meuniere. It is one of the best and simplest fish preparations in the world, with its nutty brown butter and burst of lemon juice. Amandine is a variation that uses sliced almonds, and <a href=\"http://www.foodnetwork.com/recipes/bobby-flay/skate-wings-brown-butter-preserved-lemon-almond-sauce-wilted-red-swiss-chard-raisins-recipe/index.html\">this recipe</a> from Bobby Flay takes it a step further with preserved lemons in place of lemon juice.", "totalTime": "10 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Fish", "Mains"], "recipeIngredient": ["2 tablespoons neutral oil, such as grapeseed", "4 skate fillets, about 2 pounds total", "Salt and freshly ground pepper", "1/2 cup flour, seasoned with salt and pepper", "1 stick unsalted butter, quartered", "3 preserved lemon rinds, diced, or 2 tablepoons lemon juice", "1/4 cup sliced almonds", "3 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large (12-inch) stainless steel or cast iron skillet pan over medium high heat until lightly smoking. Season the skate wings with salt and pepper, then dredge on both sides in the seasoned flour. Tap off any excess, then carefully half of the skate wings into the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sear the skate wings until golden brown, 2-3 minutes, then flip and continue cooking on the other side until the flesh just begins to flake. Remove to a plate and keep warm while repeating with the remaining skate wings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the pan and return it to the heat. Add the butter and cook until the foam subsides and it begins to turn nutty and brown. Add the preserved lemons (if using) and almonds and cook until the almonds are golden. Add the parsely and lemon juice (if using) to halt the cooking process. Remove from the heat, season to taste with salt and pepper, and pour over the fish.</p>"}]}