{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120514-206359-lemon-mint-sherbet.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alice Medrich", "Bake the Book", "lemon", "mint", "sherbet", "Sinfully Easy Delicious Desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon Mint Sherbet", "link": "https://www.seriouseats.com/recipes/2012/05/alice-medrich-food-processor-easy-lemon-mint-sherbet-recipe.html", "description": "This Lemon Mint Sherbet is a shining example of Medrich's way with the processor.  Instead of breaking out the ice cream maker, she's come up with an innovative method to make smooth, lemony sherbet by freezing the base and then whizzing it in the bowl of the food processor, aerating it, and then returning to the freezer to firm it up a bit more.  It's bright, fresh, and even a little sparkly, and the best part is there's no need to dust off the ice cream maker.", "totalTime": "4 hours 30 minutes", "recipeYield": "makes 3 1/3 cups", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats", "Lemon"], "recipeIngredient": ["A very large handful of fresh mint leaves", "1 cup (7 ounces) sugar", "1/2 cup fresh lemon juice (from about 3 medium lemons; grate the zest before juicing \u2028the lemons)", "2 2/3 cups 1% or whole milk", "1 1/2 teaspoons grated lemon zest (preferably organic or unsprayed) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserve a few mint leaves for garnish. Stir the sugar, lemon juice, and remaining mint leaves together in a medium bowl. Let stand for 1 hour.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the milk into the lemon juice mixture, then strain the mixture through the sieve into a bowl, pressing lightly on the mint leaves; discard the mint. Add the lemon zest. The mixture will thicken slightly and may look curdled—this is okay. Pour the mixture into a shallow pan, cover, and freeze until hard, 3 to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the frozen mixture into chunks with a fork, and process in the food processor or blender until the mixture is smooth and the color has lightened. If some of the frozen chunks are stubborn, don’t be afraid to continue processing: extra processing only makes smoother, creamier sherbet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately as a slushy spoon drink, garnished with the reserved mint leaves, or transfer to an airtight container and refreeze until hard enough to scoop, 3 to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the sherbet freezes too hard, let it soften in the fridge for 15 minutes or longer, or carefully soften it in the microwave on the defrost setting, a few seconds at a time. For the best flavor and texture, serve within 2 to 3 days.</p>"}]}