{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120403-127677-LTE-Honey-Lavender-Crepes-Cake-photo%20Tara%20Striano-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["crepes", "honey", "lavender", "Let them eat cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Honey Lavender Mille Crêpes Cake", "link": "https://www.seriouseats.com/recipes/2012/04/honey-lavender-mille-crepes-cake-recipe.html", "description": "This cake is made from 20 layers of thin, buttery crepes. Honey and vanilla bean pastry cream is a delicate, sweet touch.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Cakes", "Crepe"], "recipeIngredient": ["<strong>For the Lavender Crêpes</strong>    ", "6 tablespoons sugar", "1 tablespoon dried edible lavender flowers (see note)", "2 teaspoons finely grated zest from 1 lemon", "2 cups (about 10 ounces) all-purpose flour, sifted", "2 cups milk", "1 cup water", "6 large egg yolks", "8 tablespoons (1 stick) unsalted butter, melted plus 2 tablespoons for greasing pan", "1/4 teaspoon salt", "   ", "<strong>For the Honey Pastry Cream</strong>    ", "3 cups milk ", "6 tablespoons honey", "1 vanilla bean, halved and seeds scraped ", "9 large egg yolks ", "3/4 cup sugar ", "1/2 cup cornstarch", "1/4 teaspoon salt", "6 tablespoons (3/4 stick) unsalted butter, chilled and cut into 6 pieces", "2 cups heavy cream", "2 tablespoons confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lavender Crêpes:</strong> Process sugar, lavender, and lemon zest in food processor until no lemon strands remain. Add flour and pulse to combine. Add milk, water, egg yolks, melted butter, and salt and pulse until mixture is smooth. Cover and refrigerate at least 2 hours and up to 48 hours.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After crêpe batter has rested, line baking sheet with parchment paper. Stir ingredients together to recombine. Heat crêpe pan over medium-high heat and brush with butter. Pour about 3 tablespoons batter into pan, swirling to coat entire surface. Cook until bottom of crêpe begins to spot and the top is dry, 45 to 60 seconds. Gently loosen edges of crêpe from pan with a heat-proof rubber spatula or offset (metal) spatula and flip. Cook an additional 30 seconds, until bottom is spotted. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide crêpe onto prepared baking sheet and repeat with remaining batter (there should be 18 to 20 crêpes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Honey Pastry Cream:</strong> Bring milk, honey, vanilla bean seeds, and vanilla bean pod to boil in small saucepan over medium heat, then remove from heat and allow to steep for 10 minutes. Remove and discard pod, or, rinse, pat dry, and reserve for other use.     </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large heavy-bottomed saucepan, whisk together egg yolks, sugar, cornstarch, and salt. Gradually whisk in milk and bring mixture to boil over medium-high heat, constantly and vigorously whisking. Once mixture has reached the boil, continue to cook for 1 to 2 minutes to avoid a weepy pastry cream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain pastry cream into large bowl. Stir in butter. Set bowl in an ice bath and stir until pastry cream cools, about 10 minutes. Press piece of plastic wrap and directly onto surface of pastry cream and refrigerate until needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Assembly:</strong> Whisk cream in large bowl until soft peaks form. Whisk chilled pastry cream to loosen, then, fold in whipped cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange one crêpe on cake stand or serving plate. With offset spatula or back of soup spoon, spread about 1/4 cup pastry cream on crêpe. Top with second crêpe and repeat procedure with remaining crêpes and pastry cream. Chill milles crêpes at least 2 hours and up to 48 hours prior to serving. Dust with confectioners’ sugar; serve.</p>"}]}