{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121107-228675-cook-the-book-honey-harissa-farro-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["carrot", "Cook the Book", "deb perelman", "farro salad", "harissa", "parsnips", "the smitten kitchen cookbook", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Smitten Kitchen's Honey and Harissa Farro Salad", "link": "https://www.seriouseats.com/recipes/2012/11/smitten-kitchens-honey-and-harissa-farro-sala.html", "description": "It's hard to get through fall without encountering more than a few roasted vegetable salads. They're earthy, filling, and entirely seasonal. In <em><a href=\"http://www.amazon.com/The-Smitten-Kitchen-Cookbook-Perelman/dp/030759565X/?tag=serieats-20\">The Smitten Kitchen Cookbook</a></em>, <strong><a href=\"http://smittenkitchen.com/about/#Deb\">Deb Perelman</a></strong> writes about a few such salads, but the one that drew my eye was her <strong>Honey and Harissa Farro Salad</strong>. I'm a big <a href=\"http://en.wikipedia.org/wiki/Harissa\">harissa</a> fan, and the idea of tempering its spiciness with honey sounded like a perfect dressing base. But what the title of the recipes leaves out is that over half of this salad is made up of roasted batons of carrots and parsnips-two of my favorite fall staples. And if you're lucky enough to live in a place with choices in your carrots, go for a rainbow of colors for a vibrant fall meal.", "totalTime": "50 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cook the Book", "Mains", "Other Grains", "Salads", "Vegetarian"], "recipeIngredient": ["<strong>Farro</strong>", "1 cup (215 grams) uncooked farro", "4 cups (950 ml) water or broth", "&nbsp", "<strong>Vegetables</strong>", "2 tablespoons (30 ml) olive oil", "1/2 pound (225 grams, about 4 medium) carrots", "1 pound (455 grams, about 2 large) parsnips", "Salt", "&nbsp", "<strong>Dressing</strong>", "5 tablespoons (75 ml) olive oil", "1/2 teaspoon harissa, or to taste", "1 teaspoon honey", "2 tablespoons (30 ml) freshly squeezed lemon juice, plus more to taste", "Pinch of ground cumin", "Salt", "1/4 cup chopped fresh mint leaves, or half parsley and half mint", "3/4 cup (4 ounces or 113 grams) crumbled feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook farro:</strong> Bring the farro, water or broth, and a few pinches of salt (if using water or unsalted broth) to a boil. Once it’s boiling, reduce the heat to a simmer and cook the farro until tender, for about 15 to 20 minutes. If any extra water or broth remains, drain it. Set the farro aside until the vegetables are ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare vegetables:</strong> Preheat your oven to 400 degrees. Coat two large baking sheets with one tablespoon olive oil each. Peel carrots and parsnips, and cut them into 2- inch lengths. If they’re skinny, quarter them lengthwise to make batons. If they’re thicker, cut them into matchsticks about 1/4 to 1/2 inch thick. Spread the vegetables on prepared baking sheets, and sprinkle them with salt. Roast for 20 minutes, then toss them about in their pan, before roasting them for a further 10 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble salad:</strong> Whisk the dressing ingredients together, seasoning to taste with pinches of salt. Use more harissa if you’d like more heat; I suggest a restrained amount, because the heat of harissas can vary widely. In a large bowl, combine farro and roasted vegetables. Stir in most of the mint and feta, leaving a spoonful of each for garnish. Stir in dressing, to taste. Serve, garnished with the reserved feta and mint.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Do ahead:</strong> This salad keeps in an airtight container for 3 to 4 days in the fridge.<br />\r\n</p>"}]}