{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120206-tofu-detail.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Korean", "keywords": ["Korean", "soondubu jjigae", "soup", "stews", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Soondubu Jjigae (Korean Soft Tofu Stew)", "link": "https://www.seriouseats.com/recipes/2012/02/soondubu-jjigae-korean-soft-tofu-stew-recipe.html", "description": "[Photograph: Jessica Leibowitz (mycameraeatsfood.com)] Notes: Kombu, small dried anchovies, kimchi, gochujang, and Korean chili flakes can be found in most Asian supermarkets. For a vegan-friendly recipe, omit anchovies and add 1 tablespoon miso paste, using vegan kimchi (see recipe here)....", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Korean", "Soups and Stews", "Tofu"], "recipeIngredient": ["1 four-inch-square piece kombu (sea kelp, see note)", "1/2 cup small dried anchovies (optional, see note)", "2 cups very fermented kimchi with juice (see note)", "1 tablespoon vegetable oil", "1/2 pound thinly sliced pork belly or bacon (optional)", "6 scallions, finely sliced, greens and whites reserved separately", "4 cloves garlic, grated on a microplane grater", "2 to tablespoons <em>gochujang</em> (see note)", "1 tablespoon light soy sauce", "2 to 4 tablespoons kochukaru, to taste (Korean dried chili flakes, see note)", "24 ounces soft silken tofu, roughly broken", "4 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine kombu and anchovies (if using) and cover with 1 quart water. Bring to a simmer and remove from heat. Let stand 5 minutes, then strain. Discard solids and reserve broth. Meanwhile, drain kimchi in a fine mesh strainer set over a small bowl, squeezing to remove as much liquid as possible. Roughly chop kimchi and reserve kimchi and juice separately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 2 to 3 quart stone dolsot or saucepan over medium-high heat until shimmering. Add pork belly and cook, stirring constantly, until just cooked through, about 1 minute. Add scallion whites, garlic, and chopped kimchi. Cook, stirring constantly, until fragrant, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add kimchi juice, gochujang, and soy sauce. Cook until vegetables are well-coated in even layer of sauce. Add strained broth, kochukaru, and soft. Stir gently and heat until boiling. Season to taste with more kochukaru or soy sauce if desired. Remove from heat and add eggs. sprinkle with scallion greens. Serve immediately while still boiling, gently stirring eggs into the broth.</p>"}]}