{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120702-212472-recipeflag.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cake", "dessert", "Fourth of July"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "American Flag Cake", "link": "https://www.seriouseats.com/recipes/2012/07/american-flag-cake-recipe.html", "description": "When it comes to festive food for Independence Day, here's a sweet treat that really takes the cake: a layer cake decorated to resemble the American Flag!", "totalTime": "2 hours, 30 minutes", "recipeYield": "Makes one 6-inch cake", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["<strong>For the Cake:</strong>", "7 eggs, separated", "1 cup (about 7 ounces) sugar", "1 cup (about 5 ounces) flour", "2 tablespoons butter, melted", "Red and blue food coloring", " ", "<strong>For the Frosting: </strong>", "1 cup (2 sticks) butter, softened", "6 to 8 cups confectioners' sugar", "2 teaspoons vanilla extract", "1 to 2 tablespoons cream or milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350&deg;F. Grease and flour bottoms and sides of three 6-inch cake pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the eggs, putting the whites in one medium bowl and the yolks in another. Add half of the sugar to each bowl. Beat the egg whites until they form stiff peaks; beat the egg yolks until they are thick and pale yellow in color. Gently fold the stiff egg white mixture into the yolk mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour into the egg mixture, then stir in the melted butter. Separate the batter into three smaller bowls. Tint one part blue; one part red; leave the third plain (white).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared cake pans and bake until a cake tester comes out clean when inserted in the center of the cakes, 12 to 18 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool in the pans for about 10-15 minutes, then remove to a wire rack to cool completely. Transfer to refrigerator for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare frosting. In the bowl of a stand mixer fitted with a paddle attachment, cream butter until very smooth, about 3 minutes on high speed. Reduce speed to low and add about 3 cups of confectioners' sugar. Continue beating on low speed until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pause to scrape down the sides of the bowl. Add vanilla. Add remaining confectioners' sugar, bit by bit, until desired spreading consistency has been reached. If the frosting gets too thick, stir in some milk or cream to thin it. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cakes from the refrigerator. Slice the white and red cakes horizontally in thirds lengthwise (this will be for the \"stripes\" on the flag). If you find it too difficult to cut the layers into thirds, you can cut each cake in half lengthwise; you will just have fewer, thicker layers in your final product.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one of the red layers on your serving plate. Lightly frost the top. Adhere one of the white layers on top of this layer. Lightly frost the top of this layer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat this step with two more layers, so that you have four layers total assembled (from the bottom going up, red-white-red-white). Skip this step if you only have two each of the white and red layers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a 3-inch circle made of parchment as a guide, cut a 3-inch circle out of the center of the blue cake. You should end up with an \"O\" shaped cake layer. Place the \"O\" cake layer on top of the stacked white and red layers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly frost the top of the remaining red layer, and adhere the remaining white layer on top of it. Using the same parchment circle, cut out a three-inch round from the center of this two-layer stack. Place in the center of the blue \"O\" layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply a thin coat of frosting to the cake, then place in the refrigerator until firm, about 20 minutes. Remove from the refrigerator and frost all over with the remaining frosting before serving.</p>"}]}