{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121210-foie-gras-torchon-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "French", "keywords": ["charcuterie", "foie gras", "The Food Lab", "torchon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Foie Gras Torchon", "link": "https://www.seriouseats.com/recipes/2012/12/foie-gras-torchon-recipe.html", "description": "One of the pinnacles of Western food, a torchon of foie takes several days to make and requires expensive ingredients, but the time and cost are worth it in the end.", "totalTime": "3 days", "recipeYield": "Serves 10 to 16", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "French", "Offal", "Other Meats", "The Food Lab"], "recipeIngredient": ["1 entire Grade A or Grade B fresh foie gras, about 500 to 750 grams", "75 grams salt", "25 grams sugar", "12.5 grams pink curing salt (optional)", "10 grams white or black pepper", "2 to 3 tablespoons brandy (such as Cognac)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let foie gras rest at room temperature for about 45 minutes before starting to clean. Split foie into two separate lobes with your hands. Working one lobe at a time, using a paring knife or small offset spatula and a pair of tweezers, carefully remove all the veins from the center of the liver, following <a href=\"http://www.seriouseats.com/2012/12/the-food-lab-how-to-make-a-foie-gras-torchon.html\">the instructions in this slideshow</a>. Discard veins and repeat with remaining half. Return foie gras to the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine salt, sugar, curing salt, and pepper in a spice grinder and grind into a fine powder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Weigh foie gras, then weigh out exactly 2.5% of the foie gras' weight in spice mixture. For example, for a 500 gram piece of foie gras, you should have 12.5 grams of spice mixture (500 grams x 2.5%). Set aside remaining spice mixture for future use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a triple layer of plastic wrap, 12 by 18-inches on a cutting board. Remove foie gras from refrigerator and transfer to plastic wrap, exterior membrane-side down. Carefully butterfly with your fingertips, spreading the foie gras out and pushing it into shape with your hands until it forms a rough 9- by 9-inch square of even thickness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half of weighed spice mixture in a fine mesh strainer and sprinkle evenly over top surface of foie gras. Sprinkle with half of cognac. Lay a piece of plastic wrap on top and carefully flip. Peel of plastic wrap from what is now the top, and sprinkle with remaining spice mixture and cognac. Flip back over and remove top piece of plastic wrap to expose surface again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide foie with plastic on top of a bamboo sushi rolling mat, adjusting it so the bottom edge of the foie is flush with the bottom of the mat. Fold the trailing plastic wrap underneath. Carefully start rolling foie, using bamboo mat to keep it nice and tight until a complete cylinder is formed. Pull back tightly on bamboo to tighten cylinder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out a quadruple layer of cheesecloth about 16 inches wide by 2 feet long. Roll foie gras off of plastic onto the cheesecloth a few inches from the bottom edges. Carefully roll foie in cheesecloth, pulling back as you go to keep it very tight and even.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Twist ends of cheesecloth and secure one side with a short piece of twine. Secure other side with a 3-foot piece of twine. Twist twine around end of cheesecloth to tighten the roll, making the torchon shorter and shorter with each twist. Tighten until you see foie fat starting to leak out around the edges of the torchon and it has the consistency of a bike tire. Tie off cheesecloth</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hang torchon from a refrigerator rack for at least 1 day and up to 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to 160°F (bubbles should just begin to appear on the bottom of the pan. Prepare a large ice bath. Submerge foie torchon for 2 minutes, then transfer immediately to ice bath. You should see little droplets of fat forming on the surface. Let rest for 10 minutes, then transfer to a triple layer of paper towels and roll to dry carefully.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat the tightening step, using more twine to twist and shorten the ends of the torchon until the entire thing starts to show signs of leaking fat. Hang in refrigerator for at least 1 more night and up to 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice off ends of torchon through the cheesecloth (eat these ends for yourself), then unwrap the center portion. To serve, slice into disks. For better presentation, use a round pastry cutter to trim oxidized edges off of foie. Sprinkle with coarse salt, and serve with toast, preserves, or dried fruits.</p>"}]}