{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111219-lima-beans-kale-eggs-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beans", "kale", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Butter Beans with Kale and Eggs", "link": "https://www.seriouseats.com/recipes/2012/01/butter-beans-with-kale-and-eggs.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: Instead of the salt pork, if you have leftover rind and bones leftover from roasted suckling pig or pork shoulder, use them! Ham bones work great as well. About the author: J. Kenji Lopez-Alt is...", "totalTime": "1 day", "recipeYield": "Serve 4 to 6", "recipeCategory": ["Bacon", "Kale", "Mains", "Pork"], "recipeIngredient": ["1 pound butter beans (large lima beans)", "Kosher salt", "3 to 4-ounce salt pork (see note)", "2 quarts low-sodium homemade or canned chicken broth", "2 bay leaves", "4 thyme sprigs", "1 whole onion, split in half", "1 medium carrot", "1 rib celery", "1 (28-ounce) can whole tomatoes packed in juice, roughly chopped", "4 cups roughly chopped kale, swiss chard, or curly spinach leaves", "2 to 4 hard boiled eggs", "2 tablespoons extra-virgin olive oil", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover beans with 2 quarts cold water and add 2 tablespoons salt. Stir once to combine then set aside at room temperature for at least 8 hours and up to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain and rinse beans and add to a large saucepan. Add salt pork (see note), chicken broth, bay leaves, thyme, onion, carrot, and celery. Bring to a boil over high heat, reduce to a bare simmer and cook until beans are completely tender, about 1 hour, topping up with water as necessary (beans should be just poking through the top surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard bay leaves, thyme sprigs, onion, carrot, and celery. Remove pork and discard if desired or chop up and add back to pot. Add tomatoes and kale to pot, bring to a simmer, and cook, gently stirring occasionally with a wooden spoon until thickened and stew-like, about 20 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season to taste with salt and pepper and serve, topping with hard boiled eggs and a drizzle of extra virgin olive oil. Beans can be stored in an airtight container in the fridge for up to 5 days and will improve with time. Reheat by microwaving or stir gently over medium heat, adding liquid as necessary.</p>"}]}