{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/223991-20121003-british-bites-sausage-bap.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["baking", "baps", "bread", "british bites", "rolls", "sandwich bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Traditional British Baps", "link": "https://www.seriouseats.com/recipes/2012/10/traditional-british-baps-recipe.html", "description": "Baps are soft white buns that make for excellent sandwiches. It may seem like making a batch of baps from scratch is a lot of effort to go through for a simple sandwich, but as when it comes to sandwiches, God is in the details.", "totalTime": "2 hours", "recipeYield": "makes 8 baps", "recipeCategory": ["British Bites", "Mains", "Pork", "Sandwiches"], "recipeIngredient": ["2/3 cup plus 1 tablespoon milk, divided ", "2/3 cup water ", "2 teaspoons active dry yeast ", "1/2 teaspoon sugar ", "2 teaspoons salt ", "3 cups all-purpose flour, plus extra for dusting ", "Vegetable oil ", "1 1/2 pounds breakfast sausage links "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the 2/3 cup milk and water in a microwave safe bowl and microwave for 30 seconds; the mixture should be lukewarm. Sprinkle the yeast and sugar over the warmed milk mixture and let sit until frothy, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the salt with the flour into a large bowl.  Gently mix the yeast mixture with a fork, then pour over flour; mix with a wooden spoon until dough forms, then knead the dough lightly with your hands.  Form the dough into a ball and place into an oiled bowl.  Cover with a tea towel and let the dough double in size, about 90 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 425°F. Punch down the dough and divide it into 8 portions. Form these into ovals, and set them on the baking sheet, leaving as much room as possible between them. Cover with plastic wrap, making sure that the wrap is touching the dough to prevent a skin from forming. Let rise for an additional 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove plastic wrap, then brush tops and sides of the baps with remaining tablespoon milk, and sprinkle with flour.  Bake until baps are puffed and golden, about 15 minutes.  Remove from the oven and allow to cool on a rack. Baps are best the day they are made but can be stored in a plastic bag or covered container at room temperature for up to two days. Reheat in a 350° oven for 5 minutes to refresh. Use baps for sandwiches.</p>"}]}