{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120329-197700-bread-baking-cinnamon-cereal-bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cinnnamon Cereal Swirl Bread", "link": "https://www.seriouseats.com/recipes/2012/03/cinnnamon-cereal-swirl-bread-recipe.html", "description": "This bread isn't heavy on the sugar or the cinnamon. You could easily double the amounts of both if you prefer a stronger-flavored or sweeter filling. You could also double up on the cereal, but I liked the idea of having it dotted in the swirl rather than being a filling.", "totalTime": "3 hours", "recipeYield": "makes 1 9-inch loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["2 1/4 teaspoons yeast", "2 tablespoons sugar", "1 cup lukewarm water", "11 1/4 ounces (about 2 cups) bread flour", "1 teaspoon salt", "2 teaspoons vanilla extract", "4 tablespoons butter, divided", "1/2 cup Erewhon brown rice cereal", "1 tablespoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the yeast, 2 tablespoons sugar, and water in the bowl of your stand mixer. Let it stand for a minute or two, then add the bread flour. Knead with the dough hook until the mixture is smooth and elastic. Add the salt, vanilla, and 3 tablespoons of butter and knead until all are fully incorporated. Cover the bowl and let the dough rest until doubled in size, about an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and preheat the oven to 350&deg;F. Turn out the dough and form in into a rough rectangle. Roll it to about 9 inches by 18 inches. Sprinkle the cereal, cinnamon, and remaining 2 tablespoons sugar over the dough, leaving about an inch uncovered on one of the short ends.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll up the dough, jellyroll style, starting at the short end opposite the end you left uncovered. Don't roll it tightly. When you get to the end, seal the seam and the ends and put the dough into a 9x5 bread pan. Cover the pan with plastic wrap and set aside until doubled in size, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap and bake at 350&deg;F until the loaf is nicely browned, about 40 minutes. About 10 minutes before the bread is done baking, brush the top with the remaining 1 tablespoon of butter. Let cool completely on a rack before cutting.</p>"}]}