{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120820-218809-dinner-tonight-penne-fried-zucchini-arugula-cherry-tomatoes-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["arugula", "Dinner Tonight", "pasta", "tomato", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Penne with Fried Zucchini, Sun Golds, and Arugula", "link": "https://www.seriouseats.com/recipes/2012/08/penne-with-fried-zucchini-sun-golds-and-arugula-recipe.html", "description": "Ever glanced around your kitchen and realized that you have way more zucchini than any man or woman could reasonably eat in a year? I'm there. But instead of fretting about the pounds stacking up on my counter, I looked for solutions from southern Italian cooks.", "totalTime": "30 minutes", "recipeYield": "serves 3 to 4", "recipeCategory": ["Dinner Tonight", "Leafy Greens", "Mains", "Pasta", "Tomato", "Vegetarian", "Zucchini"], "recipeIngredient": ["1/4 cup extra-virgin olive oil ", "1 1/2 pounds zucchini, thinly sliced", "Kosher salt and freshly ground black pepper", "1/2 pounds penne ", "2 handfuls arugula, roughly chopped ", "2 garlic cloves, minced ", "1/4 teaspoon red pepper flakes ", "8 ounces Sun Gold tomatoes or cherry tomatoes, halved", "Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil over high heat. Meanwhile, heat olive oil in a 12-inch cast-iron skillet over medium heat until shimmering. Add the zucchini slices and toss them to coat in oil. Season with salt and pepper. Cook, stirring occasionally, until very soft and starting to brown, 15 to 20 minutes. Stir more often at the end to prevent the zucchini from burning. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halfway through cooking the zucchini, add the penne to the boiling water. Cook for five minutes, and then add the arugula. Cook until the pasta is al dente, four to five more minutes longer. When done, set aside a quarter cup of the pasta water, and then drain pasta and arugula in a colander. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a wooden spoon and move the zucchini to the side of the skillet. Add garlic and red pepper flakes, stir well, and cook until fragrant, about 15 seconds. Add tomatoes, and stir in zucchini slices. Cook until tomatoes are soft, but haven't collapsed, about a minute. Season with salt and pepper. Add the pasta and arugula to the skillet, along with the pasta water. Cook, stirring often, until the liquid has reduced, and the pasta is coated in sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste for salt and pepper, and adjust if necessary. Divide the pasta mixture between four plates. Sprinkle with grated Parmesan and serve.  </p>"}]}