{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120422-202914-april-bloom-field-deviled-eggs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Girl and Her Pig", "appetizers", "April Bloomfield", "Cook the Book", "deviled eggs", "egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "April Bloomfield's Deviled Eggs", "link": "https://www.seriouseats.com/recipes/2012/04/april-bloomfields-deviled-eggs.html", "description": "It would be a tragedy to go to <a href=\"http://thespottedpig.com/info.php\">April Bloomfield</a>'s <a href=\"http://thespottedpig.com/\">The Spotted Pig</a> and not order at least one round of her exemplary Deviled Eggs.  They're just too good not to try, at least once.  The thing is, they're not all that far off from the basic recipe, mayo, mustard and paprika are all there, but Bloomfield's added a few tweaks that round out the flavor, giving them an eggy, tangy richness that makes them so irresistible.", "totalTime": "1 hour", "recipeYield": "makes 12 deviled eggs", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Deviled Eggs"], "recipeIngredient": ["6 large eggs", "3 tablespoons mayonnaise ", "1 tablespoon champagne vinegar ", "1 tablespoon crème fraîche", "1 teaspoon Dijon mustard ", "Maldon or other flaky sea salt", " 2 tablespoons finely chopped chives", "1 tablespoon finely chopped chervil", "Cayenne or paprika ", "Extra virgin olive oil (optional) for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium pot at least halfway with water and bring to a boil over high heat. Use a slotted spoon to gently place the eggs in the water, and cook them for 10 minutes (set a timer). Drain the eggs and run them under cold water until they’re fully cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly tap each egg against the counter to crack the shell all over, then peel them and pat them dry. Halve them lengthwise with a sharp knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the yolks into a small food processor. Add the mayonnaise and blend until smooth, then add the vinegar, creme fraiche, and mustard and blend again. Have a taste and season with salt.<br />\r\nFor really pretty eggs, feed the mix into a pastry bag (alternatively, you can jerry-rig one with a large resealable plastic bag; snip off a corner before piping).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pop it into the fridge for 30 minutes. Put the egg whites on a plate, cover with plastic wrap, and put them in the fridge as well. Pat the whites dry with a kitchen towel and pipe or spoon an equal amount of the yolk mixture into each white. Top each one off with a sprinkle of the chives and chervil and a dusting of cayenne or paprika. If you like, add a sprinkle of sea salt and a drizzle of olive oil and serve.</p>"}]}