{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120217-188620-pound-cake-610x458-18.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cakes", "pound cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Vanilla Bean Pound Cake", "link": "https://www.seriouseats.com/recipes/2012/02/easy-vanilla-bean-pound-cake-recipe.html", "description": "This is a recipe for a classic pound cake, using its namesake 1:1:1:1 ratio. Its flavor comes from the abundance of butter and real vanilla bean. This recipe makes a lot of batter, so you'll be able to make two loaves, or perhaps, 1 loaf and 1 bundt cake. Use one now, and wrap the other one tightly with plastic wrap and freeze for later use.", "totalTime": "3 hours", "recipeYield": "makes 16 servings", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["16 ounces butter, softened but cold, plus more for greasing", "16 ounces sugar", "16 ounces shelled eggs (approximately 8 eggs), room temperature", "Seeds scraped from 1 vanilla bean, or 2 tablespoons vanilla extract", "16 ounces cake flour, sifted", "1/2 tablespoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F. Grease the sides and bottoms of two loaf pans with butter and line with parchment, leaving the ends bare and enough parchment overhang to be able to pull the loaves out of the pans after baking. If using bundt pans, grease these very heavily with butter and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a paddle attachment, combine the butter and sugar and beat on high speed for approximately 10 minutes, stopping frequently to scrape down the sides and bottom of the bowl and the paddle. The mixture will become very light and fluffy and almost completely white in color. Crack all of the eggs into a container with a pouring spout, add the vanilla bean seeds, and add the eggs one at a time to the batter, mixing well on high speed between additions. Be sure to frequently scrape down the sides and bottom of the bowl and the paddle. Once all the eggs have been added, beat the mixture on high speed until it is completely smooth and homogenous. Stop the mixer, add the dry ingredients, and mix on the lowest speed until the batter comes together. Scrape everything one more time, and mix on low just a little bit more, then remove the bowl from that mixer and finish mixing the batter by hand, stopping as soon as the batter is smooth. Over-mixing will cause the cake to be tough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter into the pans and place the pans on the center rack of the preheated oven. Bake for approximately 1 hour, rotating the pans at 15, 30, and 45 minutes. Rotate the pans carefully and slowly, try not to disturb the cakes. Test for doneness by inserting a cake tester or toothpick into the center - it should come out clean. Allow the cakes to cool in the pans for 10 minutes before removing them from the pans. Cool the cakes on a cooling rack without the parchment. Cool completely before serving.</p>"}]}