{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120308-indoor-skillet-pizza-04.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["homemade pizza", "no bake pizza", "no-knead", "skillet pizza", "The Food Lab", "the pizza lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Skillet Neapolitan Pizza (No Kneading or Oven Required!)", "link": "https://www.seriouseats.com/recipes/2012/03/skillet-neapolitan-pizza-no-kneading-or-oven-recipe.html", "description": "Note: This technique can be used with your favorite pizza dough recipe or with store-bought dough. It works best with a blow torch or a gas burner, but an electric burner will work as well....", "totalTime": "1 day", "recipeYield": "makes 4 10-inch pizzas", "recipeCategory": ["Pizza", "Stovetop", "The Food Lab", "The Pizza Lab"], "recipeIngredient": ["16 ounces (about 3 cups plus 2 tablespoons) all-purpose flour, plus more for dusting", ".3 ounces (about 2 1/3 teaspoons) kosher salt, plus extra for assembly", ".2 ounces (about 1 teaspoon) active dry yeast", "12 ounces water", "1 (14-ounce) can whole peeled Italian tomatoes packed in juice", "1 (12 to 16-ounce) ball buffalo mozzarella or fresh cow's milk mozzarella, at room temperature", "4 tablespoons extra-virgin olive oil", "Handful fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, salt, and yeast in a large bowl. Whisk until homogenous. Add water and stir with hands until dough comes together and no dry flour remains. Dough will be very sticky. Cover bowl tightly with plastic wrap and let sit at room temperature for 8 to 16 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto heavily floured board and using floured hands, divide into four pieces. Form each piece into a ball and place on floured board, leaving a few inches of space between each ball. Cover with plastic wrap or with a well-floured clean dish towel. Let rise for two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, roughly blend tomatoes in a food processor, blender, with a hand blender, or by hand. Season to taste with salt. Roughly tear mozzarella into 1/2- to 1-inch chunks and squeeze out excess whey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When dough has risen, gently stretch one dough ball on a well-floured board into a round about 6 inches in diameter. Gently lift dough and drape across knuckles, slowly stretching it out by rotating it around your knuckles until it's about 10 inches across.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a 12-inch skillet over medium-high heat until a drop of water dropped on its surface forms a bead that skids around (about 500 to 600°F). Carefully transfer dough to skillet and cover with tight-fitting lid. Cook until bottom side is very lightly browned and dough has puffed up in spots, about 1 minute. Remove dough with a metal spatula. deflate all bubbles in the center of the dough, leaving bubbles around the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flip dough and return to skillet so that the cooked side is now facing up. cook, shaking occasionally until the dough is darkly charred in spots. Remove to cutting board and invert (so that first-cooked side is now back on the bottom)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using a blow torch</strong>: carefully torch edges of crust until roughly charred and browned in spots. Continue with step 8. <strong>If using a gas burner</strong>: Place pizza dough top-side down (the side you cooked second facing down) with the very edge hanging over the edge of the skillet. Cook the overhanging edge directly over the flame of a gas burner until well-charred. Rotate pizza so new section is overhanging edge and char again. Repeat until entire crust edge is charred. Continue with step 8. Alternatively, place a wire cooling rack directly over the burner flame. Invert pizza dough and use flame from burner to char and brown the edges of the crust. Continue with step 8. <strong>If using an electric burner</strong>: Proceed to step 8.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sure dough is facing right-side up (it should be facing the same way it was when you first put it in the skillet). Spread a few tablespoons of tomato sauce over the dough, leaving the risen bubbly edges uncovered. Scatter a few pieces of mozzarella and a few basil leaves over the pizza. Sprinkle lightly with salt. Drizzle with 1 tablespoon olive oil. Return pizza to skillet, reduce heat to medium-low, cover, and cook until bottom is nicely charred and mozzarella is melted, about 3 minutes longer. If using torch, you can use it to help melt the cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve pizza immediately. Repeat steps 4 through 8 with remaining three balls of dough.</p>"}]}