{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120919-223243-bar-bites-spam-slices.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "pineapple", "spam", "spring rolls"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spam and Pineapple Spring Rolls with Homemade Sweet and Sour Sauce", "link": "https://www.seriouseats.com/recipes/2012/09/spam-and-pineapple-spring-rolls-with-sweet-and-sour-sauce-recipe.html", "description": "If sliced just right, Spam makes for an excellent spring roll filling&mdash;especially so when combined with slivers of fresh pineapple, toasted sesame seeds, and green onions.\r\n\r\nWhen fried to a crisp in hot oil, these Hawaii-ified spring rolls are great as is, but a dip in homemade sweet and sour sauce provides another contrast to the crunchy shell and toasted sesame seeds, salty Spam and sweet pineapple.", "totalTime": "30 minutes", "recipeYield": "Makes 12 spring rolls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Pineapple"], "recipeIngredient": ["<strong>For the Sweet and Sour Sauce</strong>:", "2 tablespoons water", "2 teaspoons cornstarch", "3/4 cup pineapple juice", "2 tablespoons cider vinegar", "1 tablespoon soy sauce", "2 teaspoons brown sugar", "1 teaspoon finely chopped ginger", "1 medium clove garlic, finely chopped (about 1 teaspoon)", "1/2 teaspoon dried red pepper flakes", " ", "<strong>For the Spring Rolls</strong>", "1 can of Spam", "1 small fresh pineapple", "2 tablespoons toasted sesame seeds", "12 square spring roll wrappers, thawed", "2 green onions, thinly sliced", "About 1 quart peanut or vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sweet and Sour Sauce:</strong> combine the water and cornstarch in a small bowl and set aside. Combine the pineapple juice, vinegar, soy sauce, brown sugar, ginger, garlic, and red pepper flakes in a small saucepan over moderately high heat and bring to a boil, stirring to dissolve the sugar. Stir the cornstarch slurry into the saucepan, decrease the heat to low and simmer until the sauce thickens, 3-5 minutes. Remove the sauce from the heat and allow to cool to room temperature before serving. The sauce will continue to thicken a bit more as it cools.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spring Rolls:</strong> Slice the Spam into 6 equal pieces about 1/2-inch thick each, then cut each slice in half to yield 12 equal pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and core the pineapple and slice the pineapple to yield 12 equal pieces that are each roughly the same size as the Spam slices (about 1/2-inch thick, 1/2-inch wide, 4-inches long). You will only need about half the pineapple pieces. Reserve the other half to serve with the spring rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip one side of the pineapple slices into the toasted sesame seeds and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1 spring roll wrapper on a clean, dry work surface so that one corner of the wrapper is pointing at you (positioned like a diamond, rather than a square). Place a Spam slice, a sesame-coated pineapple slice, and some of the sliced green onions just under the midpoint of the diamond, closest to the corner pointing at you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the corner closest to you and roll it up and over the filling, until half of the wrapper remains. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the left and right corners of the wrapper over the filling. Using your fingers, or a pastry brush, dab the edges of the wrapper with water, then continue to roll the spring roll toward the final corner at the top. Place the finished spring roll aside, underneath a moist towel, and continue rolling the rest of the spring rolls until all of the filling has been used.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour enough oil into a large heavy skillet to reach a depth of 1 inch. Heat the oil over moderately high heat until it reaches a temperature of 350°F on a deep-fry or instant read thermometer. Fry the spring rolls in batches of four, turning occasionally, until golden and crisp, 3 to 4 minutes total. Transfer the fried spring rolls to a paper towel-lined plate to drain. Serve immediately with Sweet and Sour Sauce and any extra sesame-coated pineapple sticks.</p>"}]}