{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121014-225836-corncake1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cake", "Cakespy", "candy corn", "upside-down cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Candy Corn Upside-Down Cake", "link": "https://www.seriouseats.com/recipes/2012/10/candy-corn-upside-down-cake-halloween-recipe.html", "description": "What happened when I baked it up was a surprise: the brown sugar and butter topping fused with the melty candy corn to form some sort of unholy, monstrous Halloween caramel-sugar topping, which dripped back into the cake when inverted. The result? The entire buttery cake tasted like it had been basted in candy corn. And if you're a candy corn lover, that might just be a beautiful thing.", "totalTime": "1 hour, 30 minutes", "recipeYield": "Serves 9", "recipeCategory": ["Cakes", "Cakespy", "Halloween"], "recipeIngredient": ["1/3 cup (about 5 tablespoons) butter, plus 1/2 cup (1 stick) butter, softened and divided", "2/3 cup (about 6 ounces) packed light brown sugar", "1 1/2 cups candy corn", "1 1/2 cups (7 1/2 ounces) all purpose flour", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 cup (about 7 ounces) granulated sugar", "2 large eggs", "3/4 cup milk (whole or 2 percent)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F. Place the butter in a 9-inch square baking pan, and set it in the oven until melted (it is fine to do this as the oven preheats). Remove the pan from the oven and gently tilt so that the butter coats the entire bottom of the pan. Sprinkle brown sugar evenly over the butter. Sprinkle candy corn evenly on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, sift together the flour, baking powder, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, cream the butter and granulated sugar on medium speed until light and fluffy, 3 to 5 minutes. Add the eggs, mixing until incorporated. Add the flour mixture alternately with the milk, in 2 to 3 additions, pausing to scrape down the sides of the bowl with each addition. Beat on low speed until fully incorporated. Pour the batter into the pan, taking care not to dislodge the carefully planted candy corn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a cookie tray under the cake in the oven, in case the candy bubbles or drips. Bake until a toothpick inserted in the center comes out mostly clean, 45 to 50 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately place a heatproof serving plate upside down over the pan; in one swift, sure motion, flip the plate and pan over so that the cake is now on the plate. Leave the pan in place for several minutes so the gooey mixture can drip down over the cake. After the dripping is done, lift off the pan. Serve still slightly warm. Store, loosely covered, at room temperature. </p>"}]}