{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121102-brown-betty-cookbook-red-velvet-cake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "cream cheese frosting", "red velvet cake", "the brown betty cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red Velvet Layer Cake", "link": "https://www.seriouseats.com/recipes/2012/11/red-velvet-layer-cake-with-cream-cheese-frosting-recipe.html", "description": "A classic that has enjoyed a recent resurgence, this deep red chocolate cake with cream cheese frosting is a crowd-pleaser.", "totalTime": "2 hours", "recipeYield": "serves 20 people", "recipeCategory": ["Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["<strong>Red Velvet Cake</strong>", "Vegetable shortening", "Nonstick cooking spray with flour", "21/4 cups all-purpose flour", "2 cups granulated sugar", "1/2 cup plus 3 tablespoons unsweetened Dutch-process cocoa powder", "3/4 teaspoon baking powder", "3/4 teaspoon baking soda", "3/4 teaspoon regular salt", "3/4 cup buttermilk", "2 sticks (1 cup) unsalted butter, melted", "2 large eggs", "2 large egg yolks", "11/2 teaspoons pure vanilla extract", "1 tablespoon red food coloring (1/2 ounce)", "3/4 cup boiling water", "&nbsp", "<strong>Cream Cheese Buttercream</strong>", "3/4 cup 100% white grape juice", "3 ounces Philadelphia® cream cheese, at room temperature", "2 sticks (1 cup) unsalted butter, at room temperature", "2 large egg yolks", "2 tablespoons sugar-free maple syrup", "4 teaspoons pure vanilla extract", "Pinch of ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake</strong><br />\nPreheat the oven to 350ºF. Coat three 9-inch round cake pans with vegetable shortening, line the bottoms of the pans with parchment paper, and spray with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, beat the flour, sugar, cocoa powder, baking powder, baking soda, and salt on low speed to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, mix the buttermilk, butter, eggs, egg yolks, vanilla, and food coloring until just blended.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the buttermilk mixture to the flour mixture in 2 batches, beating on low speed until blended. Increase the mixer speed to high and beat until smooth. Reduce the mixer speed to low, slowly pour in 3/4 cup boiling water, and beat until blended. The batter will be thin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter equally among the prepared pans and bake until a wooden pick inserted into the center comes out clean, 25 to 30 minutes. Let the cakes cool in the pans for 15 minutes before turning them out onto wire racks to cool completely. Remove the parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting</strong><br />\nIn a small saucepan over medium-high heat, bring the grape juice to a boil. Continue to boil until reduced to 1/2 cup. Cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in the bowl of a stand mixer fitted with a whisk attachment, whisk the cream cheese on medium speed until light and fluffy, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Replace the whisk attachment with the paddle attachment and beat the butter into the cream cheese on medium speed, scraping the bowl as necessary, until light and fluffy. Increase the mixer speed to medium-high and beat until pale yellow and almost doubled in volume, scraping the bowl as necessary, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl of a stand mixer fitted with the whisk attachment, whisk the egg yolks on high speed until thick and a pale yellow, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to medium and add the cooled reduced grape juice to the egg yolks in a slow and steady stream until blended. Increase the mixer speed to high and whisk until very light and fluffy. On low speed, add the maple syrup and vanilla to the egg yolk mixture. Increase the mixer speed to high and whisk until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of the whipped cream cheese--butter to the egg yolk mixture and whisk on medium speed until blended. Add the remaining whipped cream cheese--butter and cinnamon and whisk until fluffy, scraping the bowl as necessary, about 5 minutes. Set aside until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble and frost the cakes, place 1 cake layer, bottom-side up, on a cake plate. Use an offset spatula to spread 1 cup of the buttercream on top. Add the second cake layer, bottom-side down, and spread 1 cup of the buttercream on top. Top with the third cake layer, bottom-side up. Frost the top and sides of the cake with the remaining buttercream</p>"}]}