{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120711-dt-farfalle-with-golden-beets-and-pine-nuts.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["beets", "Dinner Tonight", "pasta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jeanne Thiel Kelley's Farfalle with Golden Beets and Pine Nuts", "link": "https://www.seriouseats.com/recipes/2012/07/dinner-tonight-jeanne-thiel-kelleys-farfalle-beets-pine-nuts-recipe.html", "description": "It took me a long time to get over my childhood memory of canned beets (I'd guess that lots of people avoid them altogether for years, like I did). But when beets are simply cooked and especially when they're in season, the earthy sweetness is subtle and delicious. Here, they're paired with farfalle, parmesan, and pine nuts for a simple summer supper.", "totalTime": "45", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Pasta", "Vegetarian"], "recipeIngredient": ["1/3 cup pine nuts", "4 tablespoons extra-virgin olive oil, divided", "2 large onions, quartered lengthwise through root end, thinly sliced crosswise", "3 cloves garlic, minced", "8-10 2-inch-diameter golden beets with greens attached", "12 ounces farfalle (bow-tie) pasta", "1/3 cup grated Parmesan cheese, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (12-inch) heavy skillet, toast the pine nuts over medium high heat until golden and fragrant. Transfer to a bowl to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half the olive oil to the skillet and heat over medium until shimmering. Add the onions and saute until beginning to soften and turn golden. Reduce heat to medium low, season with salt, and continue cooking, stirring occasionally, until the onions are tender and caramelized, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the onions are caramelizing, peel the beets and cut each into 8 wedges, then slice the greens into 1-inch strips. Bring a large pot of salted water to boil and cook the beets until tender, 10-15 minutes. Remove them with a slotted spoon to a bowl to cool, leaving the water to cook the pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the onions are caramelized, add the garlic and cook for 3 minutes longer, then add the beet greens on top of the onions and drizzle the remaining oil over them. Cover and continue cooking until the greens are tender, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water back to a boil and add the pasta. Cook until al dente, then drain, reserving 1 cup of pasta cooking water. Return the pasta to the pot, add the onion mixture and beets, and toss to combine. Add the Parmesan plus pasta water 1/4 cup at a time, and cook over low heat to create a silky sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with the toasted pine nuts and more Parmesan.</p>"}]}