{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120510-grilled-asparagus-bread-zucchini-panzanella-salad-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "panzanella", "salad", "The Food Lab", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Grilled Asparagus, Zucchini, and Bread Salad with Olive-Caper Dressing", "link": "https://www.seriouseats.com/recipes/2012/05/grilled-asparagus-and-baby-zucchini-salad.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science of home cooking in his weekly column The Food Lab. You can follow him at...", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Mains", "Salads", "Sides", "The Food Lab", "Vegetarian", "Zucchini"], "recipeIngredient": ["2 medium red onions, cut into 1/2-inch slices", "1 pound zucchini (about 3 medium), split in half lengthwise", "1 1/2 pounds asparagus, trimmed", "1 loaf Italian bread (about 12 ounces), split in half lengthwise", "1/2 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "1 lemon", "1/4 cup chopped pitted black olives (such as kalamata)", "1/4 cup capers, drained, rinsed, dried, and chopped", "1/4 cup chopped fresh parsley leaves", "3 tablespoons red wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place onion slices flat on cutting board thread two wooden skewers through each onion slices to keep them flat as they grill. Place onions, zucchini, asparagus, and bread on two large rimmed baking sheets. Drizzle evenly with 1/4 cup olive oil and rub with hands to coat all the vegetables and bread evenly. Season everything with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. If using a gas grill, preheat half the grill to high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When fire is ready, place bread over cool side of grill. Place onions in center of grill. Place zucchini cut-side-down over hot side. Cook, turning once until well charred on both sides and just starting to become tender, about 4 minutes total. Return to baking sheet. Check bread and flip and rotate to make sure it's drying evenly. Check onions and flip if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add asparagus to hot side of grill and cook, turning occasionally until well charred and barely tender, about 3 minutes total. Return to baking sheet. Continue cooking onions until charred and tender throughout, about 10 minutes total. Return to baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When bread is mostly dry, transfer to hot side of grill and cook, turning occasionally, until well toasted and lightly charred, about 1 minute total. Return to baking sheet. Split lemon and place on grill cut-side-down. Grill until lightly charred and warm about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine olives, capers, parsley, vinegar, and remaining 1/4 cup olive oil in a large bowl and whisk to combine. Cut zucchini, asparagus, bread, and onions into rough chunks and add to bowl. Season with salt and pepper and toss everything well to combine, adding extra olive oil to taste if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer salad to a bowl and serve with charred lemon halves.</p>"}]}