{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120806-217032-black-rice-pudding-strawberries-pumpkin-seeds.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "Thai", "keywords": ["black rice", "breakfast", "coconut", "coconut milk", "my thai cooking", "purple rice", "rice", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Breakfast Black Rice Porridge With Coconut Cream", "link": "https://www.seriouseats.com/recipes/2012/08/breakfast-black-rice-porridge-with-coconut-cr.html", "description": "A popular Thai dessert/snack of black sticky rice pudding is reinterpreted as a wholesome breakfast porridge that happens to be made of whole grain, vegan, and gluten-free.", "totalTime": "30-60 minutes", "recipeYield": "serves 4", "recipeCategory": ["Coconut", "Dairy-Free", "Mother's Day", "Rice", "Thai", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 cup Thai black (purple) rice", "2 cups of room temperature water (more if needed, up to 4 cups)", "Granulated sugar (or shaved palm sugar), to taste", "1/2 cup of coconut cream (the thick part that rises to the top of canned unsweetened coconut milk)", "Salt, to taste", "Assorted fresh fruits, nuts, and seeds of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 2-quart saucepan, bring the rice and water to a boil; lower the heat so the mixture no longer boils so vigorously. Continue to cook the rice, covered, until the water is almost entirely absorbed. The amount of time this takes depends on the age of your rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once most of the water is absorbed, check to see if the rice kernels have split and softened and the overall consistency has become like runny oatmeal. If not, add more water, one cup at a time, and bring the mixture back to a boil then lower the heat and simmer, covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to check for doneness and add more water along the way as necessary. You shouldn't need more 4 cups of water, and the rice shouldn't take longer than 45 minutes to soften and gelatinize.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the grains have split and released some starch, turn off the heat. Let the rice kernels continue to swell as they cool in the covered pot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the rice has cooled down somewhat, you'll see that there's no liquid left in the pot and the rice has become soft (though it's not going to be entirely soft and smooth as we're dealing with whole grain here) and gooey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Your black rice porridge is now ready to be sweetened and salted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, spoon the rice porridge into a serving bowl, top with the coconut cream, fresh fruits, nuts and/or seeds. </p>"}]}