{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/201201016-226638-dinner-tonight-squash-apple-beet-soup-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["soup", "squash soup", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Squash and Apple Soup with Beet and Bacon", "link": "https://www.seriouseats.com/recipes/2012/10/squash-and-apple-soup-with-beet-and-bacon.html", "description": "A basic blended delicata squash and apple soup was already a great fall meal, but I couldn't help but add in some roasted and chopped beets, which add a pop of color and some much needed sweetness.", "totalTime": "45 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Christmas", "Dinner Tonight", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["1 pound beets (about 2 medium)sliced into 8 wedges", "4 slices thick-cut bacon, chopped", "1 medium yellow onion, chopped (about 1 cup)", "Kosher salt and freshly ground black pepper", "2 medium garlic cloves, minced (about 2 teaspoons)", "1 tablespoon minced fresh ginger", "2 pounds delicata squash (about 2 medium), peeled, seeded, and cut into 1/2-inch chunks", "1 1/2 tart apples, peeled, cored, and chopped (about 1 1/2 cups)", "4 cups low sodium canned or homemade chicken stock ", "1/2 cup yogurt or sour cream", "3 tablespoons chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F. Place beets on a rimmed baking sheet and cover tightly with coil. Cook until tender or a knife can easily slip into the skin, 20 to 30 minutes. Remove from the oven, discard foil, and let cool. Peel off the skins and chop into 1/4-inch cubes. <strong>To microwave the beets</strong>: Place the beets in a small microwave-safe dish, and cover with plastic wrap. Cook for ten minutes. Carefully peel off the plastic wrap, and check if a knife can easily slip in the skin. If not, cook for an additional two to four minutes until tender. When done, let cool for a few minutes, peel the skins off, and chop into 1/4-inch cubes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bacon to a large heavy-bottomed pot set over medium heat. Cook, stirring occasionally, until bacon has rendered its fat and starts to crisp up. Remove the bacon with a slotted spoon. Discard all but two tablespoons of the fat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chopped onion and a pinch of salt, and cook until soft and translucent, stirring occasionally. Add the garlic and ginger, stir well, and cook until fragrant, about 30 seconds. Add the squash and apples, stir well, then add the stock. Turn heat to high and bring to a boil, andthen reduce heat to maintain a simmer. Cook, uncovered, until the squash is tender, 20 to 30 minutes. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a standing blender or immersion blender, puree the soup in batches until the smooth, pressing soup through a fine mesh strainer into a clean pot. Reheat soup, season to taste with salt and pepper, and, if desired, thin with extra broth or water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle some of the soup into a warm bowl. Add a quarter of the beets and bacon in the middle. Drizzle with some yogurt or sour cream, and garnish with chives. Repeat with remaining bowls.</p>"}]}