{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121008-nasty-bits-bowl-steamed-pork-belly-plated-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "Chinese", "pork", "ya cai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bowl-Steamed Pork Belly", "link": "https://www.seriouseats.com/recipes/2012/10/bowl-steamed-pork-belly-recipe.html", "description": "Chinese-style pork belly steamed in a bowl with pickles and chilies until tender.", "totalTime": "2 hours 45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Mains", "Pork", "The Nasty Bits"], "recipeIngredient": ["1 pound fresh boneless pork belly, skin-on", "2 teaspoons dark soy sauce or 1 tablespoon light soy sauce", "1/2 cup vegetable oil", "2 tablespoons pickled chili, spicy pickled mustard green stems, or 4 bird's eyes chilies, thinly sliced (see notes)", "1 tablespoon dried fermented black beans", "1 cup Sichuanese ya cai (pickled greens) or Tianjin preserved vegetable"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of water to boil.  Add the pork to the boiling water and cook for 5 minutes. Remove the pork from the water and rinse under cold running water. Do not discard the cooking water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the vegetable oil to 350°F in a wok.  Add pork, skin side down, and fry, swirling pan occasionally, over medium heat until the skin is crispy and dark brown, about 5 to 8 minutes (be careful, pork will sputter&mdash;use a splatter guard or light lid if desired). Return pork to pot of water and let soak for 15 minutes, until the skin is wrinkled.  Remove the pork from the liquid and let it cool. When the pork is cool, cut it into 1/4 slices so that each piece has a strip of skin at the top.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl about 7 to 8 inches in diameter, lay the pork in two neat rows across the entire base of the bowl, including the sides.  Each slice should overlap with the last.  Every strip of skin should be touching the bowl.  Lay any fragmented pieces of pork on top, then spoon the soy sauce all over the meat.  Add the pickled chilies and fermented beans. Press the ya cai all over, so that it forms a cover over the meat. Press down gently to compact everything into the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bowl in a steamer insert, cover with a lid, and steam over medium-high heat for 2 hours, taking care that the water on the bottom doesn't dry out.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, pour off excess fat and moisture and place a large plate upside down over the bowl. Grasping plate and bowl firmly, invert to unmold. Serve immediately. Leftovers may be gently re-steamed. </p>"}]}