{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121113OrzoRisotto.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Dinner for Two", "orzo", "pastas", "peas", "quick", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Sausage and Pea Orzo Risotto", "link": "https://www.seriouseats.com/recipes/2012/11/easy-sausage-and-pea-orzo-risotto-recipe.html", "description": "A thick, hearty orzo risotto, more foolproof than the rice variety, full of sweet Italian sausage, peas, and Parmesan.", "totalTime": "20 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner for Two", "Legumes", "Mains", "Rice"], "recipeIngredient": ["1 teaspoon olive oil", "10 ounces Italian sausage, removed from its casing", "1 medium shallot, minced (about 1/4 cup)", "1/2 pound orzo", "3 cups hot water or low-sodium homemade or store-bought vegetable or chicken stock", "Kosher salt and freshly ground black pepper", "1 cup frozen peas", "1/4 cup finely grated Parmigiano Reggiano", "A handful of chopped flat-leaf parsley (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil into a medium saucepan over medium-high heat until shimmering. Add the sausage and cook, breaking it up into small pieces until no longer pink. Add the shallot and sauté until translucent, about 1 minute. Add the orzo and water or stock.  Use a wooden spoon to help scrape any of the brown bits on the bottom of the pan from the sausage.  Bring to a boil, then cover, and reduce the heat to medium-low. Cook, stirring occasionally, until the orzo has absorbed all the liquid and is cooked through (add more liquid if orzo starts to dry out or stick to the bottom). Season to taste with salt and pepper. Stir in the peas, and allow to cook for a minute or two just to thaw. Remove from the heat, and stir in the Parmesan and parsley. Serve immediately.</p>"}]}