{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121025-nasty-bits-lambs-face-salad.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["lamb", "Nasty Bits", "salad", "Xian Famous Foods"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lamb's Face Salad", "link": "https://www.seriouseats.com/recipes/2012/10/lambs-face-salad-xian-famous-foods.html", "description": "Tender braised lamb's face meat in a crunchy salad with spiced salty-sweet-hot dressing.", "totalTime": "4 hours, 45 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Lamb", "Salads", "The Nasty Bits"], "recipeIngredient": ["2 lamb's heads", "1 large onion, roughly chopped (about 1 1/2 cups)", "5 ribs celery (divided)", "1/4 cup roasted chili oil", "1 tablespoon soy sauce", "1/2 teaspoon Chinkiang vinegar, or to taste", "1 teaspoon toasted sesame oil", "1/4 teaspoon sugar", "1 teaspoon tahini (optional)", "1 tablespoon cumin seed, toasted and ground coarsely", "1 whole star anise, toasted and ground medium-fine", "One 1-inch piece of cinnamon stick, toasted and ground medium-fine", "Kosher salt", "1 cup mung bean sprouts", "1 medium-sized cucumber, cut into julienne (about 1 1/2 cups)", "Chopped cilantro, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 300°F.  Place the lambs' heads in a pot or pan large enough to fit them snugly. Scatter onion and 3 ribs roughly chopped celery over top. Add water until it comes up half way over the heads. Bring to a boil over high heat, then cover the pot or pan with its lid or foil and transfer to the oven. Cook until meat is tender and falling off the bone, at least 3 hours. Let heads cool in liquid.  At this point, the heads may be stored (covered with foil) in the refrigerator for up to 4 days. Gently reheat in a 300 F oven until warmed through, about 20 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk together chili oil, soy sauce, vinegar, sesame oil, tahini, cumin, star anise, and cinnamon. Season to taste with salt. Sauce can be made and stored in refrigerator up to 1 week in advance. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When heads are cool enough to handle, remove all meat from skull and discard skulls. Peel the outer layer off the tongue and discard. Slice the tongue thinly. Chop or tear all the meat into slivers.  Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium sized pot of water to boil. Add bean sprouts and boil until tender crisp, about 2 minutes. Rinse under cold water and drain carefully. Thinly slice remaining two ribs celery on a bias.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the lamb meat and tongue with the cucumber, bean sprouts, celery, and dressing, adding more soy sauce and salt to taste.  Garnish with chopped cilantro. Serve.</p>"}]}