{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120419-202588-crispy-pork-and-watermelon-salad.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Eat With Your Hands", "Fatty Crab", "pork", "pork belly", "salad", "summer", "watermelon", "Zakary Pelaccio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zak Pelaccio's Crispy Pork and Watermelon Salad", "link": "https://www.seriouseats.com/recipes/2012/04/zakary-pelaccios-crispy-pork-and-watermelon-salad-fatty-crab.html", "description": "There's a reason this <strong>Crispy Pork and Watermelon Salad</strong> is the signature dish at <a href=\"http://fattycrew.com/the-crew/zak-pelaccio/\">Zakary Pelaccio</a>'s <a href=\"http://www.fattycrab.com/\">Fatty Crab</a> restaurants.  It highlights the best of Pelaccio's cooking style, combining his love of Southeast Asian flavors with an irreverent American lean.", "totalTime": "1 hour plus one day", "recipeYield": "serves 4 to 6", "recipeCategory": ["Pork", "Salads", "Watermelon"], "recipeIngredient": ["<strong>For the Watermelon Salad</strong>", "2 cups rice vinegar ", "3 shallots, thinly sliced", "2 fresh Thai bird chilies, thinly sliced ", "2 fresh kaffir lime leaves", "2 inches fresh ginger, peeled and sliced ", "1½ ounces palm sugar (1 round gula  jawa) or 2 tablespoons light  brown sugar  ", "1 tablespoon kosher salt ", "One 5-pound watermelon ", "<strong>For the Dressing</strong>", "3 ounces palm sugar (2 rounds gula  jawa) or ¼ cup light brown sugar ", "1 cup rice vinegar ", "½ cup fresh lime juice ", "4 inches fresh ginger, peeled and  sliced  ", "6 fresh cilantro roots with 1 inch  of stems, rinsed, scraped, and  rinsed again, or 24 cilantro  stems ", "2 garlic cloves, chopped", "¾ teaspoon kosher salt ", "<strong>For the Pork</strong>", "About 3 cups rendered leaf lard or neutral oil, such as  grapeseed or canola  ", "2 pounds Braised Pork Belly (recipe follows), cut into 1-inch chunks while still cold ", "1 cup all-purpose flour ", "Sea salt ", "<strong>To finish the dish</strong>", "1 cup fresh Vietnamese mint (rou ram) leaves  ", "1 cup fresh Thai basil leaves  ", "3 scallions, sliced", "¼ cup sesame seeds ", "<strong>Braised Pork Belly</strong>", "<strong>For the Brine</strong>", "¼ cup coriander seeds", "2 tablespoons fennel seeds ", "4 cups sea salt", "2 cups sugar", "10 garlic cloves, crushed and peeled", "10 fresh long red chilies, such as Anaheim or Hungarian Wax, thinly sliced", "5 medium shallots, sliced", "3 tablespoons black peppercorns", "1 cup packed daun salam (Indonesian bay leaves)", "2 to 3 pounds fresh pork belly", "<strong>For the Braise</strong>", "2 tablespoons rendered leaf lard or olive oil (the best you can afford) ", "1 yellow onion, cut into sixths", "1 head of garlic, halved crosswise", "2 shallots, halved lengthwise", "2 1/2 cups chicken stock "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Brine the Pork Belly:</strong>Toast the coriander and fennel seeds in a dry pan over medium heat, swirling and shaking them until they crackle lightly and release their aroma, about 3 minutes.</p>\r\n\r\n<p>Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the toasted seeds with the salt, sugar, garlic, chilies, shallots, peppercorns, daun salam, and 3 gallons water in a stockpot and bring to a boil over high heat. Reduce the heat and allow the brine to simmer for about 20 minutes. Remove the brine from the heat and let it come to room temperature, then refrigerate it. When it’s completely cool, pour it over the belly and refrigerate, covered, for at least 24 and up to 48 hours.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Braise the Pork Belly:</strong> Preheat the oven to 225°F. Cut a piece of parchment paper to fit your roasting pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the belly from the brine, rinse with cold water, and pat dry. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the roasting pan straddling two burners over medium-high, heat the leaf lard until hot but not smoking. Add the onion, garlic, and shallots, and cook, stirring occasionally, until golden and tender, 5 to 6 minutes. Add the stock to the pan and deglaze, scraping up any bits with a wooden spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the stock comes to a boil, add the belly to the roasting pan and remove it from the heat. Top the pan with the parchment paper and cover with a tight lid or foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Braise the belly in the oven until it is tender (when you press the tip of a pairing knife into it, there should be no resistance). Start checking it after 2. hours, though it could take up to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and let it sit at room temperature for 30 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using two big spatulas or your hands, transfer the belly from the pan to a large plate or sheet tray and let it cool to room temperature. Strain the braising liquid and reserve for future use. The liquid can be stored in the fridge for up to 5 days or in the freezer for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the belly tightly in plastic wrap. Press it between two flat pans (such as sheet trays) and put a weight on the top (a few cans of tomatoes will do the trick). Refrigerate, pressed, for at least 12 hours and up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the belly has been cooked and pressed, it’s ready for any of the following recipes or any other culinary purpose. It keeps in the fridge, wrapped tightly, for about 2 weeks or in the freezer for up to 6 months. To use frozen belly in a recipe, thaw it completely in the fridge first. Also, I like to cut my belly into portions prior to freezing so I don’t have to thaw the whole megillah at once.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Watermelon Salad:</strong> Combine everything for the salad except the watermelon in a small saucepan. Add 1 cup water, bring the liquid to a boil over medium heat, and cook, stirring, until the sugar dissolves. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cut the rind from the watermelon flesh, reserving both the rind and the flesh. Use a sharp knife to pare away the outer, darker green skin, leaving the inner, whiter fleshy rind. Discard the darker green peel. Cut the white rind into ¼-inch cubes and put them in a bowl. Strain the seasoned rice vinegar liquid over the diced rind. Let the mixture cool, then chill for at least 1 hour and up to 2 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the flesh of the watermelon into 1-inch pieces (discarding whatever seeds you can). Chill it until you’re ready to use it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Dressing:<strong> Roughly crush the palm sugar using a mortar and pestle or a plastic bag and a rolling pin. Pulse the sugar with the vinegar, lime juice, ginger, cilantro roots, garlic, and salt in a food processor until smooth and well combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fry the Pork</strong> In a large, straight-sided sauté pan or wok, heat 3 inches of lard to 375°F (measured on a deep-frying thermometer). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the cubed pork belly in the flour and shake off any excess. Working in batches, fry the pork belly until very crisp and a deep golden brown, 6 to 7 minutes. Transfer the pork with a slotted spoon to a paper-towel-lined tray to drain and season with salt. return the fat to 375°F between batches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish the Salad:</strong> Tear the mint and basil leaves. In a mixing bowl, toss the pickled watermelon rind and the chilled watermelon flesh with the sliced scallions, mint, and basil. Add just enough dressing to coat. Divide the pork among the plates. Top with the salad and garnish each dish with a sprinkle of sesame seeds. Serve immediately. </p>"}]}