{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120204-191378-fennel-blood-orange-and-avocado-salad-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["avocado", "Bi-Rite Market's Eat Good Food", "blood oranges", "Cook the Book", "Dabney Gough", "fennel", "salad", "Sam Mogannam", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bi-Rite Market's Fennel, Blood Orange, and Avocado Salad", "link": "https://www.seriouseats.com/recipes/2012/02/bi-rite-markets-fennel-blood-orange-and-avocado-salad-recipe.html", "description": "By mid-February many of us living in the chillier states are in need of some freshness, and bright flavors. This <strong>Fennel, Blood Orange, and Avocado Salad</strong> from <em><strong><a href=\"http://www.amazon.com/Bi-Rite-Markets-Eat-Good-Food/dp/158008303X/?tag=serieats-20\">Bi-Rite Market's Eat Good Food</a></strong></em> might not be seasonal or local across the board, but man, it's a breath of fresh air for those of us living under grey skies. Bright, tangy citrus, licoricey fennel, and creamy avocado have the transportive ability to bring you to a place that's warm and sunny.", "totalTime": "30 minutes", "recipeYield": "serves 4Â ", "recipeCategory": ["Avocado", "Cook the Book", "No-Cook", "Salads", "Vegetarian"], "recipeIngredient": ["4 medium blood oranges", "1 large or 2 small heads fennel, with fronds", "1 small shallot, minced", "Juice from 1/2 medium lemon (preferably Meyer lemon) ", "1 1/2 tablespoons champagne vinegar", "1/4 teaspoon honey", "Kosher salt and freshly ground black pepper", "3 tablespoons extra-virgin olive oil", "2 medium avocados "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tops and bottoms off the oranges to expose the flesh. Using a paring knife, cut off the remaining peel and pith. Slice the oranges crosswise into 1/4-inch slices and arrange on 4 salad plates, leaving room in the center of each for the fennel salad. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim off all but about 1/2 inch of the fennel stalks, reserving the bulb and fronds. Remove the first outer layer of fennel and discard or save for vegetable stock. Rinse the remaining bulb and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop 1 tablespoon fennel fronds and put them in a small bowl along with the shallot, lemon juice, vinegar, honey, a pinch of salt, and a few grinds of pepper. Whisk to blend, then drizzle in the olive oil as you continue to whisk. Taste for salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve the fennel bulb, cutting lengthwise through the narrow side of the bulb (this will make it easier to shave thinly). Using a sharp knife (or a mandoline or food processor), slice the fennel crosswise as thinly as you can—about 1/16 inch is ideal. (Too thick and it will dominate the salad; too thin and it wilt and lose its texture.) Transfer to a bowl and drizzle with half the dressing. Toss, taste, and add salt and pepper as needed. Divide the fennel among the 4 plates, mounding in the center of the orange slices.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve the avocado lengthwise, remove the pit, and cut 1/4-inch slices into the flesh. Using a large spoon, scoop the slices out and nestle them on and around the mounds of fennel. Sprinkle a little salt over the avocado and then drizzle the remaining vinaigrette all over the salad. Finish with a bit of pepper.</p>"}]}