{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120430-nyce-kluger-01a.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Dan Kluger's Homemade Ricotta with Baked Eggs and Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2012/05/dan-klugers-homemade-ricotta-with-baked-eggs-and-tomato-sauce-brunch-recipe.html", "description": "Recipe adapted from Dan Kluger's class at the <a href=\"http://nyce.nymag.com/\">New York Culinary Experience</a>.", "totalTime": null, "recipeYield": "serves 4", "recipeCategory": ["Breakfast and Brunch", "Cheese", "Eggs", "Vegetarian"], "recipeIngredient": ["<strong>For the Ricotta</strong>: (see note)", "3 cups whole milk", "1 1/2 cups heavy cream", "kosher salt", "1 1/2 tablespoons lemon juice or distilled white vinegar", "&nbsp;", "<strong>For the Tomato Sauce:</strong>  ", "1 (28-ounce) can whole peeled tomatoes (preferably Italian San Marzano or Muir Glen)", "¼ cup extra virgin olive oil, plus extra for drizzling", "4 medium cloves garlic, minced (about 1 1/2 tablespoons)", "1 small onion, finely diced (about 1/2 cup)", "2 sprigs fresh basil, plus more for garnish", "&nbsp;", "<strong>To Assemble:</strong>", "4 eggs", "1 ounce grated parmesan cheese (about 1 cup)", "2 teaspoons red chili flakes", "Coarse sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ricotta:</strong>Pour milk and cream into a medium saucepan (liquid should come less than half way up side of pot). Heat over low heat, stirring constantly, until it registers 170°F on an instant read thermometer. Add kosher salt to taste. Add lemon juice and gently stir to combine. Mixture should immediately start forming small curds. Set aside and allow to rest for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a fine mesh strainer with cheesecloth and set over a medium bowl. Pour milk mixture into strainer and allow to drain for 20 minutes. You should end up with between 1 and 2 cups fresh ricotta. Set aside while you make the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce</strong>: Transfer tomatoes to a large bowl and mash with a potato masher until crushed. Heat olive oil in a medium saucepan over medium heat until shimmering. Add garlic and cook, stirring frequently, until soft and fragrant, about 1 minute. Add onions and cook, stirring frequently, until completely soft but not browned, about 4 minutes total. Add tomatoes and increase heat to high. Bring to a boil, then reduce to a simmer and cook, stirring frequently, until reduced to 3 cups, about 8 minutes. Season to taste with salt, then stir in basil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Adjust oven rack to lower-middle position and preheat oven to 400°F. Transfer tomato sauce to a 12-inch straight-sided sauté pan. Crack eggs directly onto surface of sauce then add ricotta in tablespoon-sized dollops around the eggs. Season eggs with salt. Place lid on pan and bake until eggs white are set but yolks are still runny, about 8 minutes (check every few minutes until done). Carefully remove pot from oven and sprinkle with grated cheese, torn basil leaves, and chili flakes. Season with coarse sea salt and freshly ground black pepper. Drizzle with more extra-virgin olive oil, and serve.</p>"}]}