{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/03312012-199478-sunday-supper-roast-chicken-cornbread-sausage-stuffing-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cornbread", "roast chicken", "sausage", "stuffing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roast Chicken with Cornbread and Sausage Stuffing", "link": "https://www.seriouseats.com/recipes/2012/03/roast-chicken-with-cornbread-and-sausage-stuffing-recipe.html", "description": "[Photograph: Sydney Oland] Note: Store-bought cornbread can be used in place of the homemade. If using store-bought, skip step 2. About the author: Sydney Oland lives in Somerville, Mass.  Find more information at sydneyoland.com (or read eatingnosetotail.com)...", "totalTime": "2 hours (plus overnight for the brine)", "recipeYield": "serves 4 to 6", "recipeCategory": ["Bread", "Chicken", "Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["<strong>For the Brine:</strong>", "2 quarts cold water", "1/2 cup table salt or 3/4 cup kosher salt", "2 tablespoons sugar", "12 black peppercorns", "2 bay leaves", "1/2 lemon", "1 chicken (about 4 pounds)", " ", "<strong>For the Cornbread:</strong> (see note)", "1 cup cornmeal", "1 cup all-purpose flour", "1/4 cup sugar", "3 teaspoons baking powder", "1 teaspoon salt", "1/4 cup vegetable oil  ", "1 cup milk", "1 egg, beaten", " ", "<strong>For the Stuffing:</strong>", "1 pound bulk sausage (casing removed if necessary)", "1 shallot, finely chopped", "1 1/2 cups low-sodium store-bought or homemade chicken stock", "1/2 cup minced fresh parsley leaves", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Brine</strong>:  Bring a quarter of water, salt, sugar, black pepper, bay leaves and lemon to a simmer in a large stockpot. Add remaining cold water. Place chicken in a large pot or bowl and cover with chilled brine. Weight down with a plate to submerge. Refrigerate at least 8 hours or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cornbread</strong> (see note):  Adjust oven rack to lower middle position and preheat oven to 425°F.  Butter an 8-inch square baking pan.  Combine cornmeal, flour, sugar, baking powder and salt in a bowl.  In a separate bowl whisk together vegetable oil, milk and egg.  Pour wet ingredients over dry ingredients and mix until well combined and pour into prepared baking pan.  Bake until just beginning to brown, about 25 minutes.  Turn oven down to 375[&deg;].</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cornbread is cooked carefully remove from pan and cool on a rack for 20 minutes.  Cut into 2-inch cubes and spread on a baking sheet. Bake until dry and beginning to brown, about 15 to 20 minutes. Remove and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Stuffing:</strong> Crumble sausage and cook in a medium skillet over medium-high heat stirring frequently and breaking up sausage with a wooden spoon until no longer pink, about 8 minutes.  Add shallot and continue to cook until shallots are beginning to soften, about 5 minutes longer. Remove from pan and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to stuff the chicken remove from brine and rinse under cold water.  Pat dry with paper towels. Adjust oven rack to lower-middle position and preheat oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl combine cornbread, sausage mixture, half of parsley and chicken stock and toss to combine.  Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stuff cornbread stuffing into chicken (it may not all fit&mdash;you can bake the rest separately). Using two pieces of kitchen twine truss chicken by tying bird once around the wings, and then once around legs securing the ends of the drumsticks together.  Place on a rack in a baking sheet and roast until center of stuffing, as well as between leg and body reaches 155°F, 1 to 1 1/2 hours. Remove from oven and allow to rest for 15 minutes before serving. Sprinkle with remaining parsley</p>"}]}