{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120827-Mustard-Salmon-En-Papillote-edit.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["asparagus", "French in a Flash", "mustard", "quick", "salmon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Mustardy Salmon in a Packet with Asparagus", "link": "https://www.seriouseats.com/recipes/2012/08/mustardy-salmon-in-a-packet-with-asparagus-recipe.html", "description": "Delicate asparagus. Flaky salmon. Jaunty mustard. Just wrap them all up in a foil-parchment packet and bake. What comes out is perfectly steamed fish, tender asparagus, and a punchy sauce. The best part? It's ready in twelve minutes with no clean up.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "French", "Mains", "Salmon"], "recipeIngredient": ["4 tablespoons crème fraîche", "4 tablespoons dry white wine", "2 tablespoons Dijon mustard", "2 tablespoons whole grain mustard", "2 bunches (32 stems) asparagus, trimmed and cut in thirds", "Kosher salt and freshly ground black pepper", "4 boneless skinless salmon filets (about 6 ounces each)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400&deg;F.  Whisk together the crème fraîche, wine, and mustards.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear off four large rectangles of aluminum foil, and four slightly smaller rectangles of parchment.  Place the parchment on top of the foil.  On each sheet of parchment, place a quarter of the asparagus and season with salt and pepper.  On top of each pile of asparagus, place one piece of salmon, and season the fish with salt and pepper.  Divide the mustard sauce among the four pieces of salmon, pouring it over the top.  Finally, fold the packets of foil so they are sealed up tight with the parchment and fish within.  Bake packets on a large rimmed baking sheet in a single layer until fish is cooked through, about 12 minutes. Open packets and serve.</p>"}]}