{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120905SearedTunaSoyNoodles.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["asparagus", "Dinner for Two", "dinners", "easy", "egg noodles", "French in a Flash", "lime", "soy sauce", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Sesame Seared Tuna with Soy Lime Noodles", "link": "https://www.seriouseats.com/recipes/2012/09/sesame-seared-tuna-with-soy-lime-noodles.html", "description": "Fresh tuna crusted in sesame seeds and seared, on a bed of ready-bought egg noodles, vibrant green veggies and herbs, and a light soy-lime sauce.  Can't beat it!", "totalTime": "10 minutes", "recipeYield": "2 servings", "recipeCategory": ["Asparagus", "French", "Lime"], "recipeIngredient": ["2 (4- to 5-ounce) tuna steaks", "Salt and pepper", "6 tablespoons sesame seeds", "1 tablespoon olive oil", "1 (12-ounce) bunch of asparagus, trimmed and quartered", "1/4 cup soy sauce", "1/4 cup water", "2 tablespoons fresh juice from about 2 limes", "1 (14-ounce) pack egg noodles, cooked according to package instructions", "2 scallions, thinly sliced", "1 small bunch (about 1 ounce) cilantro, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the tuna dry with paper towels and season on both sides with salt and pepper.  Pour the sesame seeds onto a wide plate, and coat the tuna on both sides with the seeds.  Heat oil in large nonstick skillet over medium-high heat until smoking. Sear the tuna 1 minute on each side for medium doneness (30 seconds each side for rare, 90 seconds to 2 minutes per side for well-done).  Transfer tuna to plate.  Add the asparagus to the now-empty skillet and cook just until charred, stirring occasionally, about 3 minutes.  Just before removing the asparagus, add any sesame seeds from the plate that didn’t stick to the tuna to the pan and cook over medium heat until golden, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, stir together the soy sauce, water, and lime juice.  Add the noodles, scallions, cilantro, asparagus, and toasted sesame seeds, and toss to combine.  Plate the noodles.  Cut each tuna steak in half, and perch on the noodles.  Serve!</p>"}]}