{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120529-208045-bread-baking-orange-pull-apart.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads", "orange"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange Pull-Apart Loaf", "link": "https://www.seriouseats.com/recipes/2012/05/orange-pull-apart-loaf-bread-recipe.html", "description": "A slightly sweetened, orange-scented pull-apart loaf that stays soft and serveable for two days. While this bread has a little more sugar than normal, and a little more butter than normal, it's got enough flavor that you don't need to add any butter to it when you eat it. You can slather it with butter if you want to, of course. But it doesn't need it.", "totalTime": "3 hours", "recipeYield": "makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking", "Breakfast Sweets", "Orange"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons yeast", "3 ounces (1/2 cup) semolina flour", "2 tablespoons honey", "13 1/2 ounces (about 2 1/2 cups) bread flour", "2 tablespoons fresh orange juice ", "1 large egg", "1 teaspoon salt", "1 teaspoon vanilla extract", "1 teaspoon orange extract", "4 tablespoons unsalted butter, softened ", "Non-stick cooking spray", "1/3 cup granulated sugar (or more, as needed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of stand mixer fitted with a dough hook attachment, combine the water, yeast, semolina flour, and honey. Stir to combine and let it sit until foamy, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bread flour, orange juice, egg, and salt. Knead on low speed until the dough is smooth and elastic, about 10 minutes. Add vanilla extract, orange extract, and butter. Continue kneading until the dough is shiny and elastic and butter is completely incorporated, about 5 minutes longer. Cover the bowl with plastic wrap and set aside until the dough has doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour work surface, and turn out dough. Knead dough briefly, then cut into about 16 pieces (It's ok if they are uneven). Roll each piece into a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350°F. Spray a tall, 8-inch round cake pan with non-stick cooking spray (a springform pan works as well). Pour the sugar onto a small plate, roll each ball in the sugar to coat it, and arrange the pieces loosely in baking pan. Sprinkle any remaining sugar over top of balls. Cover pan with plastic wrap and set aside until the dough has doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the buns have risen, remove the plastic wrap and bake until browned, about 35 minutes. Remove pan from the oven, let cool on a rack for 5 minutes, the turn the loaf out and let it cool on a rack. Cover the bread with a clean kitchen towel of you want a softer crust.</p>"}]}