{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120115CherryDuck.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["cherries", "condiments", "duck", "French in a Flash", "poultry", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sweet-Tart Duck Breasts With Fresh Cherry Sauce", "link": "https://www.seriouseats.com/recipes/2012/01/sweet-tart-duck-breasts-with-fresh-cherry-sauce-recipe.html", "description": "Simply seared duck breast is flavored with a sweet-tart Bing cherry sauce spiked with Balsamic.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Cherry", "Condiments and Sauces", "Duck", "French", "Other Meats"], "recipeIngredient": ["2 5- to 6-ounce duck breasts", "Coarse sea salt, such as Maldon", "2 teaspoons olive oil", "1 small shallot, finely diced", "1/2 cup dry red wine", "1/4 cup low-sodium chicken stock", "7 ounces Bing cherries, pitted, stemmed, and halved", "1 tablespoon balsamic vinegar", "10 twists on the black pepper mill", "1 teaspoon honey, preferably orange flower", "1/2 tablespoon very cold unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the duck out of the fridge 15 minutes before you want to use it.  Preheat the oven to 400&deg;F. Score the fat on top of the duck in a crosshatch fashion, carefully to score only the fat and not the flesh beneath it. Season the duck on all sides with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a small nonstick skillet on medium heat. Place the duck, skin-side-down, in the hot pan and leave it alone for 10 to 12 minutes, until the skin is golden brown and the fat has rendered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the pan off the heat, and turn the duck breasts over so the bottom of the breasts are coated in the rendered duck fat. Pour the excess fat into a heat-proof container, and keep for frying potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the duck, skin-side-up in its original sauté pan, in the oven and cook for 10 minutes. The internal temperature will be about 135&deg;F. Let the duck breasts rest on a cutting board for 10 minutes before slicing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cherry sauce, heat a small nonstick skillet over medium-low heat. Add the olive oil and the shallots. Sauté for 1 minute, just to soften the shallots. Add the wine, stock, and cherries. Bring the mixture to a boil. Add the balsamic vinegar, salt to taste, and pepper. Reduce the heat to medium-low, and simmer for 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove a 1/4 cup combination of liquid and cherries and purée in a mini food processor. Return the puréed mixture to the pan with the rest of the sauce, and stir in the honey and the cold butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the duck. Pour the sauce onto a serving plate, and arrange the slices of duck on top. Season with a bit of salt and pepper for garnish.</p>"}]}