{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/03172012-197344-sunday-supper-crubeens-cabbage-trotter-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cabbage", "mains", "pig trotters", "pork", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crubeens and Cabbage", "link": "https://www.seriouseats.com/recipes/2012/03/crubeens-and-cabbage-irish-trotters-recipe.html", "description": "Crubeens are a traditional Irish dish of boiled pigs feet that are often served fried and eaten by hand. Removing the bones and stuffing it with mashed potatoes elevates this Irish classic Sunday Supper status while keeping it in comfort food territory.", "totalTime": "5 hours", "recipeYield": "serves 4", "recipeCategory": ["Cabbage", "Mains", "Offal", "Pork", "Sunday Supper"], "recipeIngredient": ["<strong>Crubeens:</strong>", "2 pigs trotters with hocks attached, split lengthwise", "3 bay leaves", "4 medium carrots, coarsely chopped (about 2 cups)", "2 medium onions, coarsely chopped (about 2 cups)", "5 medium garlic cloves, coarsely chopped (about 5 teaspoons)", "12 black peppercorns", "4 medium russet potatoes, peeled and cut into 2 inch pieces", "1/4 cup cream", "Kosher salt and freshly ground black pepper", "1/2 pound caul fat", " ", "<strong>Cabbage:</strong>", "4 strips thick cut bacon, chopped", "1/2 small green cabbage, finely sliced (about 1 quart)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the trotter halves together and wrap tightly with cheese cloth. Place trotters in a large stock pot with bay leaves, carrots, onions, garlic and peppercorns. Cover with water then bring to a simmer skimming foam off the top of the pot until trotters are tender (test with a knife) 2-3 hours. Remove trotters then strain liquid through a strainer. Reserve liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover potatoes with water and bring to a simmer, cook until tender, then drain and mash. Add cream then season to taste with salt and pepper. Allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When trotters are still warm but cool enough to handle, unwrap the cheese cloth and gently separate the halves. Remove all the bones from the trotter, trying to keep each half as intact as possible. If any bits of trotter fall off, reserve them. Season both sides of each trotter half with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. Carefully unroll caul fat so that the thin sheets are separated and easy to handle. Place each trotter half skin side down on a cutting board then divide potatoes evenly between trotters. Roll trotter around potatoes, then gently wrap each trotter half with caul fat. Repeat with remaining trotters. Place wrapped trotter halves on rack in baking pan and roast until deep golden brown, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet cook bacon over medium high heat until fat is rendered and bacon is crisp, about 6 minutes. Add any bits of trotter that fell off while the bones were being removed and cook until beginning to brown. Add cabbage and cook until wilted, adding some of the pork stock leftover from cooking the trotters if anything begins to stick. Season to taste with salt and pepper.  Once trotters are roasted serve alongside cabbage with plenty of dark beer.</p>"}]}