{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121116-broccoli-rabe-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["broccoli rabe", "eggplant", "Italian", "sicilian", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sicilian-Style Broccoli Rabe With Eggplant and Capers", "link": "https://www.seriouseats.com/recipes/2012/11/sicilian-style-broccoli-rabe-recipe.html", "description": "A simplified versino of caponata&mdash;the classic sweet and sour Sicilian eggplant relish&mdash;tossed with bitter broccoli rabe. This is about as flavorful as side dishes get.", "totalTime": "45 minutes", "recipeYield": "Serve 8 to 10", "recipeCategory": ["Christmas", "Eggplant", "Italian", "Sides", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["1 small eggplant, cut into 1/2-inch dice (about 1 quart)", "Kosher salt", "6 tablespoons extra-virgin olive oil", "1 medium onion, finely diced (about 1 cup)", "2 stalks celery, finely diced (about 1/2 cup)", "2 tablespoons tomato paste", "3 tablespoons capers, rinsed, drained, and roughly chopped", "1/4 cup golden raisins", "2 tablespoons sugar", "3 tablespoons red wine or balsamic vinegar", "1 cup canned whole peeled tomatoes with their juice, chopped into 1/4-inch pieces", "Freshly ground black pepper", "3 bunches (about 2 1/2 pounds) broccoli rabe, thick stems trimmed, cut into 3-inch lengths"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place eggplant on a large plate lined with a triple layer of paper towels or a clean kitchen towel. Season with salt. Top with another triple layer of paper towels or a clean kitchen towel. Top with another large plate. Microwave on high power until eggplant has lost most of its moisture and appears slightly shriveled, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat olive oil in a medium saucepan over medium-high heat until shimmering. Add onion and celery and cook, stirring frequently, until softened and translucent, about 8 minutes. Add eggplant and cook, stirring occasionally, until eggplant is starting to break down, about 5 minutes longer. Add tomato paste, capers, raisins, sugar, vinegar, and chopped tomatoes and stir to combine. Bring to a gently simmer and cook, stirring occasionally, until reduced into a thick, stew-like consistency, about 20 minutes. Season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add broccoli rabe and cook until tender, about 6 minutes. Drain in a colander and transfer to a large bowl. Add eggplant mixture and toss to combine. Season to taste with salt, pepper, and more vinegar or sugar as desired. Serve.</p>"}]}