{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120619-211004-bread-baking-everything-buns.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "buns", "hamburger buns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Everything Buns", "link": "https://www.seriouseats.com/recipes/2012/06/everything-buns-recipe.html", "description": "Everything buns aren't chewy like their bagel cousins. I wanted to mimic some of the flavors of Everything bagels, but just some, not quite all. I limited the seeds to sesame and poppy on top, and anise in the dough. Dried toasted onions go into the dough. These buns are definitely on the savory end of the bread continuum.", "totalTime": "2 hours 30 minutes", "recipeYield": "Makes 8 buns", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons instant yeast", "1 tablespoon sugar", "11 1/4 ounces (about 2 1/4 cups) bread flour", "1 teaspoon salt", "1/4 teaspoon anise seeds", "2 tablespoons dried toasted onion", "1/4 cup powdered milk", "2 tablespoons unsalted butter, softened", "Egg wash (1 egg beaten with 1 tablespoon water)", "1 tablespoon sesame seeds (or more as needed)", "1 tablespoon poppy seeds (or more as needed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water, yeast, and sugar in bowl of stand mixer fitted with paddle attachment and let rest 5 minutes. Add bread flour, salt, anise seeds, toasted onion, and powdered milk. Knead on low speed until dough is elastic, about 10 minutes. It won't be completely smooth because the onions will be bumpy. Dough should be soft, but not sticky, barely clinging to bottom of work bowl. Add butter and continue kneading on low speed until it is completely incorporated, about 3 minutes. Cover bowl with plastic wrap and set aside until the dough has doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper, adjust oven rack to middle position, and preheat oven to 350&deg;F. When dough has risen, turn out onto lightly floured work surface. Divide it into 8 pieces, form each piece into a ball, then flatten balls into disks about 1 inch high. Place dough disks onto the prepared baking sheet and cover with plastic wrap. Set aside until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, brush it with egg wash, then sprinkle with sesame and poppy seeds. Use more or less, as you desire. Bake at 350&deg;F until nicely browned, about 30 minutes. Remove buns to a rack to cool.</p>"}]}