{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/091812-222985-SeriousEats-Pork-Mojo-edit.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["mojo picón", "mojo verde", "pork", "potatoes", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Pork Loin With Wrinkled Potatoes, Mojo Verde, and Mojo Picón", "link": "https://www.seriouseats.com/recipes/2012/09/grilled-pork-loin-wrinkled-potatoes-mojo-verde-picon-recipe.html", "description": "Marinated with citrus and smoky, spicy pimentón, grilled pork loin is good; but with a duo of Spanish-style sauces&mdash;mojo verde and mojo picón&mdash; this Sunday staple is all the better.", "totalTime": "About a day", "recipeYield": "serves 6 to 8", "recipeCategory": ["Mains", "Pork", "Potato", "Sunday Supper"], "recipeIngredient": ["<strong>For the Pork:</strong>", "3 1/2-pound boneless pork loin", "10 medium cloves garlic, divided", "1 1/2 teaspoons hot smoked paprika, divided", "7 tablespoons extra virgin olive oil, divided use", "2 tablespoons juice from about 1 lemon", "3 tablespoons red wine vinegar, divided", "Kosher salt", "&nbsp;", "<strong>For the Potatoes:</strong>", "1 1/2 pounds small red potatoes, quartered", "Freshly ground black pepper", "&nbsp;", "<strong>For the Mojo Verde:</strong>", "2 tablespoons sherry vinegar", "1/2 cup lightly packed, fresh cilantro leaves", "1 teaspoon fresh oregano leaves", "1/4 cup lightly packed, fresh parsley leaves", "1/2 teaspoon cumin seeds, toasted, divided", "1 serrano pepper, seeded and coarsely chopped", "2 slices stale white bread, crusts removed and torn, divided", "1/4 cup plus 2 tablespoons water, divided", "&nbsp;", "<strong>For the Mojo Picón:</strong>", "3 roasted red peppers, skins removed", "1/2 teaspoon crushed red pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Score fat on pork loin in a cross-hatch pattern. Poke pork with a fork 15 times. Smash four cloves garlic. Place pork and garlic in a resealable plastic bag, along with 1 teaspoon pimentón, 2 tablespoons olive oil, lemon juice, 1 tablespoon red wine vinegar and 1/2 teaspoon salt. Seal bag and squish around to combine and rub marinade into the meat. Place in refrigerator and marinate for at least four hours or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, remove pork from marinade and pat dry with paper towels. <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Set a disposable aluminum pan under the cool side of the grill. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Place pork loin over hot side of coals and cook until all sides are browned, about 10 minutes total. Transfer pork to cool side, cover grill with vents open, and cook, turning occasionally, until pork registers 140°F in center, about 25 minutes. Transfer to a cutting board, tent with foil, and allow to rest for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pork is cooking, adjust oven rack to lower-middle position and preheat oven to 425&deg;F. Place potatoes in a baking dish. Drizzle with 1 tablespoon olive oil and season with salt and black pepper to taste. Roast until tender, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the mojo verde by roughly chopping 5 cloves of garlic. Place the garlic, sherry vinegar, cilantro, oregano, parsley and 1/4 teaspoon cumin seeds in a blender. Add serrano pepper and pulse until it forms a paste. Add 1 slice bread, 2 tablespoons olive oil and 1/2 teaspoon salt. Puree until smooth, adding up to 1/4 cup water in 1 tablespoon increments to achieve a sauce-like consistency. Set aside at room temperature.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the mojo picón, roughly chop remaining 3 cloves garlic. Place the garlic, remaining 1/4 teaspoon cumin seeds, red peppers, remaining 1/2 teaspoon pimentón, crushed red pepper and remaining 2 tablespoons red wine vinegar in a blender. Pulse until it forms a puree. Add remaining slice of bread and 1/2 teaspoon salt. With the blender running, add remaining 2 tablespoons olive oil in a steady stream and puree until smooth, adding up to 2 tablespoons water in 1 tablespoon increments to achieve a sauce-like consistency.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When meat has rested, carve and serve with potatoes and both sauces.</p>"}]}