{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120504-steamed-pork-ribs-black-bean-01.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["chichi's chinese", "fermented black beans", "pork", "Pork Ribs", "rib"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Steamed Pork Ribs with Fermented Black Beans", "link": "https://www.seriouseats.com/recipes/2012/05/steamed-pork-ribs-with-fermented-black-beans.html", "description": "About the author: Chichi Wang took her degree in philosophy, but decided that writing about food would be much more fun than writing about Plato. She firmly believes in all things offal, the importance of reading great books, and the...", "totalTime": "1 hour, plus overnight for salting the meat", "recipeYield": "4 as a main course", "recipeCategory": ["Pork"], "recipeIngredient": ["2 pounds pork ribs, cut crosswise by your butcher into 1-inch slices", "1 teaspoon kosher salt", "1 teaspoon soy sauce", "3 tablespoons dried fermented black beans, smashed with a cleaver or the bottom of a pan", "2 tablespoons rice wine", "½ teaspoon sesame oil", "½ teaspoon corn or potato starch mixed with 2 tablespoons water", "1 sliced jalapeño", "2 tablespoons chopped fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the ribs in between the bones to yield rough 1-inch chunks. At least four hours before cooking, toss the ribs with the salt, black beans, and soy sauce. The ribs may be salted and stored in the refrigerator for up to two days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, place the ribs on a shallow bowl that can fit inside your steamer. Add the rice wine and sesame oil and mix well.  Spread ribs into as close to a single layer as possible. Steam over medium-high heat, flipping and stirring occasionally, until just cooked through, about 45 minutes. Very carefully remove the ribs from the steamer, pouring the cooking liquid into a small saucepan. You should have about 1/2 cup of pork broth.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the cornstarch slurry into the broth, then heat over medium high heat, stirring occasionally until glossy and thickened, about 2 minutes.  Add the thickened broth back to the pork ribs.  Add the slices of jalapenos and stir to incorporate the jalapenos with the sauce. Garnish with cilantro.  Serve hot.  Leftovers may be microwaved or re-steamed over low heat.  </p>"}]}