{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120409-200375-poptartinnard2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "jelly beans", "Pop Tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Leftover Jelly Bean Pop-Tarts", "link": "https://www.seriouseats.com/recipes/2012/04/jelly-bean-pop-tarts-recipe.html", "description": "Preparing a homemade version of the popular store-bought pastries is extremely easy, and placing rows of jelly beans in the middle is a vibrant way to make use of any straggler candy. The jelly beans become soft and slightly gooey while still the tarts are still warm; they form into flattened but soft little sugar lumps when cooled.", "totalTime": "30 minutes (includes cooling time)", "recipeYield": "makes 8 tarts", "recipeCategory": ["Cakespy", "Candy", "Pastry", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong> For the Pastry</strong>:", "1 1/2 cups (about 7 1/2 ounces) flour", "1/2 teaspoon salt", "1/2 cup (1 stick) butter, softened and cut into cubes", "3 tablespoons cream", " ", "<strong>For the Filling</strong>:", "1 cup jelly beans", " ", "<strong>For the Icing</strong>:", "1 cup (about 6 ounces) confectioners' sugar, sifted", "2 tablespoons heavy cream", "Rainbow sprinkles (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 450&deg;F. Line a baking sheet with parchment paper; set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and salt in a large bowl. Add butter and blend with a fork, pastry cutter, or your hands. Blend until the mixture is fairly coarse. Add the cream, bit by bit, gently mixing the dough after each addition, until the dough is cohesive enough to form a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dough on a lightly floured surface and roll into a rectangle, about 1/8-inch thick. Cut out rectangles approximately the size of index cards (3- by5-inches), or smaller if you prefer a more modest portion. Make sure you have an even number of cutouts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place jelly beans in neat rows along half of the rectangles, forming color patterns if you'd like. How many beans fit on your pastry rectangles will vary depending on the brand; I was able to get 4 rows of 4 jelly beans on each rectangle. Be sure to leave about half an inch empty on all sides of the pastry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining rectangles of dough on top of the ones with jelly beans. Crimp all four edges by hand or with a fork to ensure that your filling won't ooze out. Poke a few holes in the top to allow steam to escape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tarts on your prepared baking sheet, and bake until light golden on the edges, 7 to 8 minutes. Remove from the oven and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tarts cool, prepare your icing; combine the confectioners sugar with the cream. After the tarts have cooled, drizzle icing on top. Garnish with sprinkles if desired.</p>"}]}