{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/231719-20121208-sunday-brunch-roesti-shallots-pancetta-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "potatoes", "roesti", "Sunday Brunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roesti with Shallots and Pancetta", "link": "https://www.seriouseats.com/recipes/2012/12/roesti-with-shallots-and-pancetta-recipe.html", "description": "Classic crispy potato pancakes flavored with shallots, pancetta, and thyme.", "totalTime": "40 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Potato", "Vegetarian"], "recipeIngredient": ["About 2 tablespoons plus 1 teaspoon vegetable oil ", "1/4 pound pancetta, chopped (about 3/4 cup)", "2 large shallots, finely chopped (about 3/4 cup)", "1 1/2 pounds (about 3) Yukon gold potatoes ", "Kosher salt and freshly ground black pepper", "2 teaspoons picked thyme leaves", "1/2 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 teaspoon of vegetable oil in a 10- inch non stick skillet over medium high heat until shimmering. Add chopped pancetta and cook, stirring until pancetta is crisp, about 5 minutes. Add chopped shallots and cook, stirring frequently, until soft and translucent, about 5 minutes. Transfer shallots and pancetta to a large bowl using a slotted spoon. Transfer fat to a cup. Add enough oil to add up to about 4 tablespoons total fate. Set skillet aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the largest holes on a box grater grate potatoes one at a time. Place grated potato in the center of a clean tea towel and twist tea towel to drain out liquid over sink. Transfer to bowl with pancetta and shallots. Season to taste with salt and pepper. Add 1 1/2 teaspoons picked thyme leaves and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet. Heat 1 tablespoon of fat over medium heat, and when shimmering add 1/2 of potato mixture to the skillet. Using a rubber spatula, press into the bottom of the pan and cook until edges begin to look brown, about 6 minutes. Carefully slide roesti onto a plate then place another plate on top. Flip plates over, then slide roesti back into pan and continue to cook until completely crisp, about 7 minutes longer. Transfer to a large plate and keep warm in a 200°F oven. Repeat with remaining fat and potato. Sprinkle roesti with thyme and serve with sour cream.</p>"}]}