{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120719-jenis-farmers-market-sundae.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["ice cream", "jeni britton bauer", "jeni's splendid ice cream", "sundaes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jeni Britton Bauer's Farmers Market Sundae", "link": "https://www.seriouseats.com/recipes/2012/07/jeni-britton-bauers-farmers-market-sundae-recipe.html", "description": "This ambrosial sundae is eagerly anticipated each summer at our shops. We usually\nuse tawny port, but it works well with almost any wine or spirit. You can add roughly\nchopped peaches, apricots, or plums, or substitute them for the berries.", "totalTime": null, "recipeYield": "serves 6", "recipeCategory": ["Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["3 cups blueberries, raspberries, 3 cups blackberries, halved strawberries, and/or halved pitted cherries", "1/4 cup sugar", "1 tablespoon honey", "2 tablespoons tawny port, ice wine, Champagne, or lambrusco or 1 tablespoon Grand Marnier", "Lemon Frozen Yogurt* (see below)", "Whipped Cream** (see below)", "6 fresh herb sprigs, such as mint, basil, or lemon balm", "&nbsp;", "<strong>Lemon Frozen Yogurt</strong>", "1 quart plain low-fat yogurt", "1 1/2 cups whole milk", "2 tablespoons cornstarch", "2 ounces (4 tablespoons) cream cheese, softened", "1/2 cup heavy cream", "2/3 cup sugar", "1/4 cup light corn syrup", "Zest from 1 lemon (reserved from below)", "&nbsp;", "<strong>Lemon Syrup</strong>", "2 to 3 lemons", "3 tablespoons sugar", "&nbsp;", "<strong>Whipped Cream</strong>", "1 cup (8 dollops) heavy cream", "1 to 2 tablespoons sugar", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Advance prep for the frozen yogurt base:</strong> Fit a sieve over a bowl and line it with two layers of cheesecloth. Pour the yogurt into the sieve, cover with plastic wrap, and refrigerate for 6 to 8 hours to drain. Discard the liquid, and measure out 11/4 cups of the drained yogurt; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the lemon syrup:</strong> Using a vegetable peeler, remove the zest in large strips from 1 lemon; reserve for the frozen yogurt (leave the lemon zest in large strips so it’s easier to strain out later). Juice enough of the lemons to make 1/2 cup. Combine the lemon juice and sugar in a small saucepan and bring to a boil over medium-high heat, stirring to dissolve the sugar. Remove from the heat and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the frozen yogurt base:</strong> Mix about 2 tablespoons of the milk with the cornstarch in a small bowl to make a smooth slurry. Whisk the cream cheese in a medium bowl until smooth. Fill a large bowl with ice and water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the remaining milk, the cream, sugar, corn syrup, and lemon zest in a 4-quart saucepan, bring to a rolling boil over medium-high heat, and boil for 4 minutes. Remove from the heat and gradually whisk in the cornstarch slurry. Bring the mixture back to a boil over medium-high heat and cook, stirring with a heatproof spatula, until slightly thickened, about 1 minute. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually whisk the hot milk mixture into the cream cheese until smooth. Add the reserved 11/44 cups yogurt and the lemon syrup and whisk until smooth. Pour the mixture into a 1-gallon Ziploc freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the zest from the frozen yogurt base. Pour into the frozen canister and spin until thick and creamy. Pack the frozen yogurt into a storage container, press a sheet of parchment directly against the surface, and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make whipped cream</strong>: Chill a large metal or glass bowl in the refrigerator for at least 15 minutes; it should be cold to the touch. Add the cream, sugar, and vanilla to the chilled bowl and whip by hand mixer. Use immediately, or refrigerate for up to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make sundaes</strong>: Toss the berries with the sugar, honey, and wine in a bowl and let sit for at least 30 minutes and up to 6 hours, to macerate. The berries will create their own lovely syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the macerated fruit among 6 plates (or assemble the sundaes in wide-mouthed Mason jars). Place 2 small scoops of frozen yogurt on top of the fruit, then garnish each sundae with a large dollop of whipped cream and an herb sprig.</p>"}]}