{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120617-broccoli-tortilla-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["allioli", "broccoli", "chorizo", "spanish", "spanish tortilla", "tortilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Spanish Tortilla with Broccoli, Chorizo, and Onion", "link": "https://www.seriouseats.com/recipes/2012/06/spanish-tortilla-with-broccoli-chorizo-and-onion-recipe.html", "description": "Spanish-style tortilla does not <em>have</em> to be made with potatoes. This broccoli-based version has all the creamy texture of the original, with the grassy, nutty, flavor of broccoli.", "totalTime": "30 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Broccoli", "Sides", "Spanish"], "recipeIngredient": ["6 large eggs", "Kosher salt and freshly ground black pepper", "1/2 cup extra-virgin olive oil", "3 cups bite-sized broccoli florets", "1 medium onion, finely sliced (about 1 cup)", "3 ounces chorizo, finely sliced or diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk eggs together with 1 teaspoon salt and 1/2 teaspoon black pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat half of olive oil in a 10-inch non-stick or cast iron skillet over high heat until simmering. Add broccoli and cook without moving until well charred on one side, about 2 minutes. Reduce heat to medium and continue to cook, stirring occasionally, until broccoli is very tender, about 5 minutes longer. Add onions and chorizo, season to taste with salt and pepper, reduce heat to medium, and continue to cook, stirring frequently, until onions and broccoli are completely softened, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add broccoli/onion mixture to bowl with eggs and stir immediately to combine. Return skillet to heat and add remaining 1/4 cup olive oil. Heat until shimmering. Add egg mixture and cook, stirring gently with a wooden spoon or rubber spatula until eggs are about 1/3 set, about 1 minute. Continue to cook, swirling pan gently until eggs are set about 2/3 of the way through and base of tortilla is deep golden brown, about 5 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large plate over the skillet and using both hands and two kitchen towels, invert skillet and plate so that tortilla flips out onto the plate with the cooked-side up. Carefully slide back into skillet. Continue to cook, gently swirling pan until tortilla is golden brown on second side, about 4 minutes longer. For a perfect shape, invert onto plate and slide back into skillet 4 to 5 more times. Transfer to a cutting board and let rest at least 5 minutes and up to 3 hours before slicing and serving with <a href=\"http://www.seriouseats.com/recipes/2012/06/spanish-style-allioli-olive-oil-garlic-mayonnaise-recipe.html\">allioli</a>.</p>"}]}