{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120911-2205670-bread-baking-serious-rye.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "rye bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Serious Rye Bread", "link": "https://www.seriouseats.com/recipes/2012/09/serious-rye-recipe.html", "description": "I tend to make fluffy rye breads that are destined for sandwiches, but sometimes I really want a dense, chewy rye. This isn't sandwich bread; it's more a bread you'd slice thin with appetizers or toss in a bread basket. It's not a lightweight bread; it's more serious than that.", "totalTime": "2 hours 40 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 1/4 cup buttermilk", "2 1/4 teaspoons instant yeast", "1 cup rye flour", "1/2 cup oat flour", "1 cup bread flour", "1 tablespoon vital wheat gluten", "1 teaspoon salt", "1 tablespoon olive oil", "1 teaspoon sesame seeds", "1 tablespoon caraway seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, combine buttermilk, instant yeast, rye flour, oat flour, bread flour, and wheat gluten. Knead on low speed until mixture is smooth, about 10 minutes. It won't be as elastic as a wheat dough, and it will be a little bit sticky. Add salt, olive oil, sesame seeds, and caraway seeds. Continue kneading until the ingredients are completely incorporated, about 5 minutes longer. Cover the bowl and set aside until the dough has doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle rack and preheat the oven to 350&deg;F and sprinkle some cornmeal on a baking sheet. Flour your work surface and turn out the dough. Knead the dough briefly and form it into a ball. Place the ball, seam-side down, on prepared baking sheet. Cover with plastic wrap and set aside until doubled in size, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove plastic wrap and bake until dough is nicely browned, about 35 minutes. Remove the bread from the oven and cool completely on a rack before slicing.</p>"}]}