{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/2012929-224092-moravian-sugar-cake-edit.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "breakfast bread", "cake recipes", "cakes", "coffee cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Moravian Sugar Cake", "link": "https://www.seriouseats.com/recipes/2012/10/moravian-sugar-cake-recipe.html", "description": "Moravian Sugar Cake is a traditional Easter breakfast, though fluffy and sweet coffee cake is always in season. The secret to this warm, yeasty bread's lightness is the addition of mashed potatoes.", "totalTime": "2 hours plus overnight rise", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Breakfast Sweets", "Cakes"], "recipeIngredient": ["<strong>For the Cake</strong>", "2 teaspoons instant yeast", "1/4 cup warm water (between 110 an 115&deg;F)", "1/2 cup (about 3 1/2 ounces), plus 1 teaspoon sugar", " 3 1/2 cups (about 17 1/2 ounces) all-purpose flour", "1/2 teaspoon salt", "12 tablespoons (6 ounces) unsalted butter, softened", "1 egg", "1/2 cup cooked mashed potatoes, unseasoned, room temperature", "1/2 cup whole milk", "2 teaspoons vanilla", "3/4 cup light brown sugar", "2 teaspoons ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dissolve yeast in water. Sprinkle surface with teaspoon of sugar, cover with plastic wrap and set aside to proof for 5 minutes; yeast mixture should become foamy. In a medium bowl, whisk together flour and salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fit with an paddle attachment, beat together 8 tablespoons (1 stick) butter and sugar until light and creamy. Add the egg, beating until just combined, then add the mashed potatoes, milk, dissolved yeast, and vanilla until fully combined. Slowly stir in the flour mixture until a soft dough forms. Shape dough into a ball and place in a large greased bowl. Cover with plastic wrap and let rise in the refrigerator. Dough should double in size overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch dough down and knead lightly on a generously floured surface. Roll out the dough so it fits a 13- by 9- by 2-inch greased baking dish. Place the dough in the dish, then cover with a light towel and set in a warm place to rise until doubled in size, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move the oven rack to the center position and preheat the oven to 375&deg;F. Add remaining 4 tablespoons butter, brown sugar, and cinnamon, to the bowl of a food processor. Pulse until thoroughly combined. Using your index finger, poke deep holes evenly across the surface of the cake. Swirl your finger to widen the hole to create wells for the topping. Fill each hole with cinnamon and sugar topping. Bake  until golden on top and done in the middle, about 30 to 35 minutes. Serve warm.</p>"}]}