{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151110-spritz-cookies-vicky-wasik-001.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["butter cookies", "Cookies", "spritz cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spritz Cookies", "link": "https://www.seriouseats.com/recipes/2012/01/spritz-cookies-butter-cookie-recipe.html", "description": "Spritz cookies are crisp and buttery; they're the perfect example of how a cookie of few ingredients can be one of the best you've ever tasted. I love using the seeds from a real vanilla bean in my spritz dough along with a tiny hint of cardamom to heighten the toffee notes.", "totalTime": "3 hours", "recipeYield": "Makes about 40 small cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["8 ounces unsalted butter, softened (2 sticks; 225g)", "7 ounces granulated sugar (about 1 cup; 200g)", "Seeds scraped from 1 vanilla bean", "1 teaspoon (5g) salt", "1/4 teaspoon (1 to 2g) ground cardamom (optional)", "1 egg", "11 1/2 ounces all-purpose flour, sifted (about 2 1/4 cups; 325g)", "Sanding sugar, sugar decorations, and candied fruits for decorating (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F. In the bowl of a stand mixer fitted with the paddle attachment, cream butter, sugar, vanilla bean seeds, salt, and cardamom on high speed, stopping often to scrape down the sides, until the mixture is light and fluffy, about 7 minutes total. Add the egg and beat again, stopping often to scrape down the sides and beater, until light and fluffy, 5 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the mixer and add the sifted flour all at once. Mix on the lowest speed just until the flour starts to incorporate with the butter mixture, 15 to 30 seconds. Stop the mixer and finish the job by hand using a large rubber spatula or wooden spoon. Take care to only mix until the dough is homogeneous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the dough into the tube of the cookie press, turning the tube as you go for even distribution of dough. Screw in the desired pattern and pipe quickly onto the surface of cool, clean metal baking sheets (do not use nonstick trays, silicone liners, or parchment paper). Work quickly and rhythmically; try not to stop as you pipe out the cookies. If you are not satisfied with the shape, scrape them off the pan with an offset spatula and reload the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle with decorations, if desired, and bake for 5 to 7 minutes for small cookies, 7 to 9 minutes for larger ones, turning halfway through. Spritz cookies are traditionally baked to a pale golden-blond color, but baking until a bit darker yields a crispy cookie with toffee notes. Watch the cookies carefully for browning at the edges if you are aiming to make a lighter cookie. Remove from the oven and allow them to cool on their baking sheets for 5 minutes before loosening with an offset spatula and transferring to a cooling rack. Cool completely before serving. The cookies will keep in an airtight container for up to 3 days.</p>"}]}