{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120415-spring-salad-egg-17.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "egg", "peas", "ramps", "salad", "snap peas", "spring", "The Food Lab", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Spring Salad of Asparagus, Ramps, Snap Peas, and Peas With Poached Egg and Lemon Zest Vinaigrette", "link": "https://www.seriouseats.com/recipes/2012/04/spring-salad-of-asparagus-ramps-snap-peas-and-peas-with-poached-egg-and-lemon-zest-vinaigrette-recipe.html", "description": "Feel free to use whatever fresh green vegetables you can find. Young broccoli stalks, brussels sprouts, fava beans, or fiddleheads would all work fine.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Eggs", "Legumes", "Salads", "Vegetarian"], "recipeIngredient": ["<strong>For the Vinaigrette:</strong>", "6 tablespoons extra-virgin olive oil", "2 tablespoons juice from 1 or 2 lemons", "2 teaspoons grated zest from 1 lemon, plus a few extra thin threads of zest for garnish", "2 tablespoons finely minced fresh parsley leaves", "1 small shallot, minced (about 1 tablespoon)", "Kosher salt and freshly ground black pepper", "&nbsp;", "<strong>For the Salad</strong>", "1 cup fresh shelled English peas or 1 cup defrosted frozen peas", "2 cups fresh sugar snap peas, strings removed, ends trimmed, cut into 1/2-inch pieces on the bias", "1 pound asparagus, stalks trimmed, tips removed, tips and stalks reserved separately", "2 to 3 tabespoons extra-virgin olive oil", "4 large very fresh eggs", "2 tablespoons distilled white vinegar", "2 tablespoons canola or vegetable oil", "8 to 12 whole ramps, ends trimmed and cleaned", "2 cups tender pea or snow pea shoots, thick stalks trimmed and discarded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dressing</strong>: Combine olive oil, lemon juice, lemon zest, parsley, and shallots together in a small sealable container. Mix together and season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Vegetables</strong>: Bring a large pot of salted water to a rolling boil. Prepare an ice bath. Blanch peas in water, boiling until bright green and just tender, about 1 minute. Transfer to ice bath with a wire mesh strainer. Add snap peas to blanching water and cook until bright green and just tender, 1 to 1 1/2 minutes. Transfer to ice bath with a wire mesh strainer. Add asparagus tips (not the stalks) to blanching water and cook until bright green and just tender, about 1 minute. Transfer to ice bath with a wire mesh strainer. Remove all vegetables from ice bath and transfer to a rimmed baking sheet lined with a clean kitchen towel or paper towels to dry. Set vegetables aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Asparagus</strong>: Transfer asparagus stalks to blanching water and cook until completely tender, about 2 minutes. Transfer hot stalks to the jar of a blender. Add 2 tablespoons olive oil. Start blender at slow speed and gradually increase to high. Blend until asparagus purée is completely smooth, adding a tablespoon or two of blanching water and scraping down sides as necessary. Season purée to taste with salt and pepper and more olive oil if desired, then set aside to cool slightly. Discard blanching water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Eggs:</strong> In a large saucepan, bring three inches of water to a simmer over high heat. Add vinegar and season with salt. Reduce heat until water is just barely quivering. Break one egg into a small bowl. Swirl water in pot with a wooden spoon, then carefully lower egg into the water. Repeat until all four eggs are in the water. Cook, gently swirling the water and turning the eggs occasionally, until whites are set but yolks are still liquid, about 2 minutes. Using a slotted spoon, carefully remove eggs and transfer to a bowl filled with warm tap water. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ramps:</strong> Heat canola or vegetable oil in a large heavy-bottomed skillet over high heat until smoking. Add ramps and reduce heat to medium. Cook, stirring and tossing occasionally until browned and lightly crisped. Season to taste with salt and pepper and transfer ramps to a plate lined with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Salad:</strong>: Spread asparagus purée along the bottoms of four wide, shallow bowls or plates. Toss the peas, snow peas, snow pea greens, and asparagus tips with 3/4 of the dressing in a large bowl. Season to taste with salt and pepper. Divide salad evenly amongst the four bowls. Top each salad with sautéed ramps and a poached egg. Spoon remaining dressing over the egg and season the egg with salt. Serve immediately.</p>"}]}