{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120412-201604-thai-coconut-rice-pudding-mango-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "Thai", "keywords": ["coconut", "desserts", "mangoes", "my thai cooking", "pandan", "quick", "rice", "rice pudding", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai-Inspired Coconut-Pandan Rice Pudding With Fresh Mango", "link": "https://www.seriouseats.com/recipes/2012/04/thai-inspired-coconut-pandan-rice-pudding-wit.html", "description": "[Photograph: Leela Punyaratabandhu] An easier, quicker, more stovetop-friendly version of the iconic Thai dessert, Khao Niao Ma-muang, this coconut rice pudding and mango retains all of the flavors found in the original dish by which it is inspired. Pandan leaves...", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Coconut", "Desserts", "Fruit Desserts", "Rice", "Thai"], "recipeIngredient": ["1 cup raw Thai jasmine rice", "1 1/4 cups water", "1 1/2 cups coconut milk", "2 frozen pandan leaves, thawed and roughly chopped", "1 cup granulated sugar", "1/2 teaspoon salt", "4 ripe Ataulfo mangoes, peeled, sliced, and divided into 4 portions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice and water to a 2-quart pot, stir one, set it on high heat, and bring to a boil, uncovered. Reduce the heat to the lowest setting, cover the pot, and allow the rice to slowly absorb all the water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the chopped pandan leaves and coconut milk in a blender. Blend on high speed until liquefied, about 30 seconds. Pass mixture through a fine mesh strainer set in a bowl and discard solids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the rice has absorbed all of the water, add to the pot the strained pandan-infused coconut milk, sugar, and salt. Give the mixture a stir and bring it to a hard boil over medium heat. Allow the rice pudding to boil hard for 2 minutes, stirring constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from heat and let the rice pudding sit, covered and undisturbed, for 10 minutes. Stir once and let the rice pudding sit, covered, for another 10 minutes before serving. You can also allow the rice pudding to cool completely to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the rice pudding into 4 servings. Top each serving with one portion of the prepared mangoes. Serve immediately.</p>"}]}