{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120326-198923-chocolate-marshmallow-peeps1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["chocoholic", "marshmallow", "Peeps"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Marshmallow Peeps", "link": "https://www.seriouseats.com/recipes/2012/03/chocolate-marshmallow-homemade-peeps-recipe.html", "description": "These homemade chocolate marshmallow Peeps are delicious and adorable.", "totalTime": "1 hour", "recipeYield": "18", "recipeCategory": ["Desserts", "Easter"], "recipeIngredient": ["3 tablespoons gelatin", "2/3 cup plus 1/2 cup water, divided", "2 cups sugar, plus extra for coating peeps", "1 tablespoon light corn syrup", "1 teaspoon pure vanilla extract", "2/3 cup cocoa powder, sifted", "1 ounce semisweet chocolate, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 2/3 cup water in mixing bowl of standing mixer and sprinkle gelatin over top. Let sit until gelatin is absorbed into water, about 5 minutes. Set aside. Sprinkle enough sugar to generously coat bottom of rimmed baking sheet. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium saucepan, stir remaining 1/2 cup water with 2 cups sugar and corn syrup. Heat over medium-high heat until mixture just comes to boil, stirring to dissolve sugar. When mixture comes to boil stop stirring. Continue to cook until mixture registers 240&deg;F. Occasionally brush down sides of pan with water as the mixture cooks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When sugar syrup comes up to temperature, pour over gelatin and stir gently to combine. Let mixture sit to cool briefly, about 10 minutes. Then whip on medium-high speed until light, fluffy, and the consistency of shaving cream, about 10 minutes. Gently fold in vanilla and cocoa until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Plop a small spoonful of marshmallow onto plate. If it doesn't hold its shape, set mixing bowl over pan of ice water until marshmallow thickens to the point where it just holds its shape. Fill pastry bag and pipe chicks (see note). Let chicks sit for 10 minutes to set and then sprinkle sugar over to coat. Use toothpick to dab chocolate eyes onto chicks.</p>"}]}