{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120313-nasty-bits-scrapple-plate-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["mains", "pork", "scrapple", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scrapple", "link": "https://www.seriouseats.com/recipes/2012/03/scrapple-recipe.html", "description": "Scrapple sounds like an insult, the name you call the runt in gym class. More likely it derives from the terms scraps and scrappy. And what a fitting name indeed for a traditional Pennsylvania-Dutch dish made from the odds and ends of the pig, stewed, chopped, or ground up, and mixed with cornmeal and flour. (Yum.) Often the cornmeal is cooked in the gluey gelatinous stock that comes from such a commingling of pig parts in a pot.", "totalTime": "4 hours", "recipeYield": "serves 6 as a main course", "recipeCategory": ["Mains", "Pork", "The Nasty Bits"], "recipeIngredient": ["2 to 3 pounds pork butt, preferably skin on ", "2 pig trotters", "2 medium onions, roughly chopped (about 2 cups)", "6 medium cloves garlic", "4 ounces pork liver (a slab about 1/2 inch thick)", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable or canola oil", "2 cups cornmeal", "1/2 cup flour, preferably buckwheat", "1 teaspoon paprika", "1/4 teaspoon cayenne pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork butt and trotters into soup pot and cover with water. Bring to boil, skimming off scum that rises to the top. Cook for 3 hours or until the flesh is very tender and slipping off the bone. Let the meat cool down slightly in the pot, about 10 minutes. Remove meat with a slotted spoon and transfer to a large bowl. Allow to cool at room temperature until cool enough to handle, about 15 minutes. Reserve cooking liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat is cool enough to handle, remove all the meat, skin, and tendons from the trotter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season liver with salt and pepper. Heat oil in a large skillet over medium-high heat until shimmering. Add liver and cook without moving for 2 minutes. Flip and cook on second side until center is just cooked through, about 2 minutes longer. Transfer to a cutting board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely dice liver and pork shoulder together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Follow the directions on the package of cornmeal, replacing the water with pork stock. Add more pork stock or water as needed to prevent the cornmeal from sticking to the bottom of the pot. (Depending on the cornmeal, it will take 20 to 45 minutes to cook.) Towards the last ten minutes of cooking, add the flour and stir quickly to prevent the flour from clumping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all the meat into the pot with the cornmeal and the flour and mix well. Add paprika and cayenne pepper and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to a loaf pan and smooth the surface. Cover with plastic wrap and let cool. Refrigerate scrapple until set, at least 3 hours. Scrapple may be kept in the refrigerator for several days, or frozen.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Heat a skillet with a few tablespoons of oil. Slice scrapple into slabs about 3/4 inch thick. Add to the skillet and pan-fry on both sides until the surface is brown and crispy, turning only once or twice. Serve immediately.  </p>"}]}