{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120111-186982-endive-cheese-tart.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Elaine Louie", "endives", "Époisses", "tarts", "The Occasional Vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Occasional Vegetarian's Endive Cheese Tart", "link": "https://www.seriouseats.com/recipes/2012/01/endive-cheese-tart-recipe.html", "description": "This <strong>Endive Cheese Tart</strong> is one of the most elegant and intriguing offerings from <a href=\"http://topics.nytimes.com/topics/reference/timestopics/people/l/elaine_louie/index.html\">Elaine Louie</a>'s <em><strong><a href=\"http://www.amazon.com/Occasional-Vegetarian-Delicious-Dishes-Vegetables/dp/1401310362/?tag=serieats-20\">The Occasional Vegetarian</a></strong></em>.  Inspired by the classic French <em><em>tarte tatin</em></em>, this one treads the line between sweet and savory with refined ingredients and rustic technique.", "totalTime": "2 hours and 45 minutes", "recipeYield": "6 to 8 servings", "recipeCategory": ["Cook the Book", "Vegetarian"], "recipeIngredient": ["<strong>For the dough:</strong>", "1/2 cup confectioners’ sugar", "1 cup all-purpose flour", "Pinch of salt", "41/2 tablespoons unsalted butter, at room temperature, cut into small pieces", "1 large egg", "&nbsp;", "<strong>For the filling:</strong>", "3 pounds small Belgian endives, trimmed of brown edges", "8 tablespoons unsalted butter", "1/2 cup granulated sugar", "1/2 pound Époisses cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the dough:</strong> In a mixing bowl, combine the sugar, flour, and salt. Add the butter and mix with a pastry cutter or two knives until it resembles large crumbs. Add the egg and mix with a fork until it forms a mass. Shape into a disk and cover with plastic wrap. Refrigerate for 2 hours.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the filling: Fill the bottom of a steamer with 1 1⁄2 inches of water, place over high heat, and bring to a boil. Add the endives and steam until just tender, about 20 minutes depending on the size. Transfer to a colander and allow to drain for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a 9 1/2-inch flameproof baking dish or cast-iron skillet over medium heat. Melt the butter and add the sugar, stirring until dissolved. Reduce the heat to low and add the endives in a circular pattern, tips meeting in the center, or other attractive pattern (which will be visible when the tart is finished).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the endives to cook over low heat until the liquid is reduced to a caramel on the bottom of the dish and the endives are golden brown (but not burned) on the underside, 45 minutes to 1 hour. Meanwhile, preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the endives are cooked, remove the pan from the heat. Cover the endives evenly with slices of Époisses. Remove the dough from the refrigerator and roll out into a circle large enough to cover and slightly overhang the top of the pan. Place the dough on top of the Époisses; do not try to adjust it once placed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the excess dough from the sides. Perforate in a few places with a sharp knife and bake until the dough is golden brown, 20 to 30 minutes. Remove from the oven. Place a large plate on top of the pan. Invert, gently removing the pan. Serve hot or warm.</p>"}]}