{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/10-23-12-227433-Skillet%20Pasta-Skillet%20Suppers.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["eggplant", "One Pot Wonder", "pasta", "penne", "quick", "skillet suppers", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Eggplant and Tomato Pasta", "link": "https://www.seriouseats.com/recipes/2012/10/eggplant-and-tomato-pasta-recipe.html", "description": "An all-in-one pasta dish with tender eggplant and a bright tomato sauce.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Eggplant", "One-Pot Wonders", "Pasta", "Stovetop", "Tomato", "Vegetarian"], "recipeIngredient": ["3 ½ tablespoons olive oil", "1 medium to large eggplant, trimmed and diced (about 4 cups)", "Kosher salt and freshly ground black pepper", "1 medium onion, finely chopped (about 1 cup)", "2 medium cloves garlic, minced or grated with a Microplane (about 2 teaspoons)", "1 teaspoon dried red chile flakes", "1 (28-oz) can whole peeled tomatoes", "1 cup low-sodium homemade or store-bought chicken stock or water", "3 cups uncooked penne pasta", "½ cup packed basil leaves, roughly chopped", "1 (4-oz) ball of fresh mozzarella"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons oil a 12-inch skillet over medium-high heat until shimmering. Add the eggplant and a generous pinch of salt and allow to cook, shaking and tossing occasionally, until eggplants are brown and have fully softened, 10 to 11 minutes. If eggplant threatens to burn, reduce heat to medium. Transfer to a bowl, cover with foil, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining oil to the pan and increase the heat to medium high. When shimmering, add the onions and a pinch of salt. Cook, stirring frequently, until the onions are softened, about 3 minutes. Add the garlic and red chili flakes and cook until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes and their juice and bring to a simmer. Once the tomatoes have softened, gently break them apart with a potato masher. Cook until the sauce has thickened, seasoning to taste, 8 to 10 minutes. Then add the broth and bring to a gentle simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta and cover, over medium heat, making sure there are active and vigorous bubbles. Stir occasionally to make sure the sauce isn’t sticking and allow to cook until the pasta is firm to the bite, 12 to 15 minutes,  and stir in the eggplant. Tear the mozzarella into small chunks and add to the pan, heating until just starting to melt, about 1 minute. Stir in basil, season to taste with salt and pepper, and serve.</p>"}]}