{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121114-230129-bar-bites-buttered-rum-and-cranberry-popcorn.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "cranberries", "popcorn", "snacks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Buttered Rum and Cranberry Popcorn", "link": "https://www.seriouseats.com/recipes/2012/11/buttered-rum-and-cranberrypopcorn-recipe.html", "description": "This cranberry-studded popcorn is a light enough snack to munch on without being too filling; but its combination of sweet and salty, tangy and boozy is enough to satisfy just until your holiday feast really starts.", "totalTime": "1 hour 10 mintes", "recipeYield": "Serves 4 to 6 as a snack", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Christmas", "Cranberry", "Sides"], "recipeIngredient": ["1/2 cup dried cranberries", "2 tablespoons dark rum", "3 tablespoons canola oil", "1/2 cup popcorn kernels", "4 tablespoons butter", "1/2 teaspoon salt", "1/2 teaspoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cranberries and rum in a small bowl and set aside to soak for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large deep pot over medium high heat for 1 to 2 minutes. Place 4 to 5 popcorn kernels into the pot and cover the pot. As soon as you hear the kernels pop, place the rest of the kernels into the pot, cover, and gently shake the pot back and forth over the burner. The kernels will begin popping all at once.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to gently move the pot back and forth over the burner until the popping subsides, 2 to 3 minutes longer. When you can no longer hear any kernels popping, remove the pot from the heat. Transfer the popcorn from the pot and into a large brown paper bag and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe the pot out with a paper towel to remove any unpopped kernels. Return the pot to low heat, then add the butter. Stir until the butter is completely melted. Once the butter melts, add the cranberries and rum to the pot and stir to combine. Continue to cook over low heat for 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cranberry mixture into the paper bag with the popcorn. Sprinkle in the salt and sugar, crimp the bag closed, and shake vigorously until the popcorn is uniformly coated with the butter and seasonings. Transfer the contents of the bag to a large bowl and serve immediately.</p>"}]}