{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120223-194357-shrimp-and-sweet-corn-curry.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "corn", "curry", "Masala Farm", "quick", "shrimp", "Suvir Saran"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Suvir Saran's Shrimp and Sweet Corn Curry", "link": "https://www.seriouseats.com/recipes/2012/02/suvir-sarans-shrimp-and-sweet-corn-curry-recipe.html", "description": "Regardless of whether you're using summer fresh or winter frozen corn, this curry is pure genuis; creamy, delicately spiced, and fill of sweet notes that comfort and intrigue.  The complexity comes from a bright green herb paste of ginger, cilantro, lemongrass, curry leaves and chiles cooked with down toasted spices coconut milk and just enough cream to add a velvety richness.  The corn and shrimp are added in the final stages, making sure that neither overcook and retain all of their respective sweetness.", "totalTime": "35 minutes", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Corn", "Shrimp"], "recipeIngredient": ["<strong>Herb Paste:</strong>", "40 fresh or 60 frozen curry leaves", "3-inch piece fresh ginger, peeled and roughly chopped", "2 tablespoons frozen ground lemongrass paste (optional)", "1 bunch fresh cilantro, leafy parts and tender stems ripped off of the tough stems", "1 jalapeño or serrano chile, stemmed, and seeded for less heat ", " ", "<strong>Curry</strong>", "3 tablespoons canola oil", "1 1/2 teaspoons cumin seeds", "1 teaspoon brown mustard seeds", "15 fresh or 22 frozen curry leaves, roughly chopped", "3 dried red chiles", "1/4 teaspoon ground turmeric", "1/8 teaspoon asafetida", "Two 13 1/2-ounce cans coconut milk", "1/2 cup heavy cream, half-and-half, or milk ", "1 teaspoon kosher salt", "4 cups fresh corn (from 4 to 6 ears) or frozen corn ", "2 pounds tiger shrimp (16 to 20 shrimp/prawns per pound), peeled and deveined", "1/4 cup finely chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the herb paste:</strong> Combine the curry leaves, ginger, lemongrass paste (if using), cilantro, jalapeño, and 3 tablespoons of water in the bowl of a food processor, and purée into a nearly smooth paste. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the curry:</strong> Heat the canola oil, cumin seeds, and mustard seeds in a large pot over medium-high heat. Cook, stirring occasionally, until the cumin browns and becomes fragrant and the mustard seeds pop, 1 to 2 minutes. Add the curry leaves, chiles, turmeric, and asafetida, and cook, stirring, for 1 minute. Then stir in the herb paste, reduce the heat to low, and cook until the mixture is very fragrant, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the coconut milk and the cream, stir, increase the heat to high, and bring to a boil. Reduce the heat to medium-low, stir in the salt, and add the corn and shrimp. Simmer until the shrimp curl and are just cooked through, 2 to 4 minutes, stirring occasionally. Stir in the cilantro and serve.</p>"}]}