{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120928-btb-cheesecakebars.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Baked Elements", "bar cookies", "cheesecake", "fall desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Cheesecake Bars", "link": "https://www.seriouseats.com/recipes/2012/10/pumpkin-cheesecake-bars-recipe.html", "description": "Welcome fall, but keep it light. These airy bars from <strong><em><a href=\"http://www.amazon.com/Baked-Elements-Our-Favorite-Ingredients/dp/1584799854/?tag=serieats-20\" target=\"_blank\">Baked Elements: Our 10 Favorite Ingredients</a></em></strong> still pack plenty of pumpkin and spice. Sweet cream cheese frosting is just a bonus.", "totalTime": "4 hours, including cooling", "recipeYield": "Makes 24 bars", "recipeCategory": ["Bake the Book", "Cookies", "Desserts", "Pumpkin"], "recipeIngredient": ["<strong>For the Sweet Pastry Dough</strong>", "1 1⁄2 cups all-purpose flour", "1⁄4 cup sugar", "1⁄4 teaspoon salt", "4 ounces (1 stick) cold unsalted butter, cut into 1⁄2-inch cubes", "1 large egg", "&nbsp;", "<strong>For the Pumpkin Cheesecake Filling</strong>", "16 ounces cream cheese, softened", "1⁄2 cup sugar", "3⁄4 cup pumpkin puree (see page 100)", "2 tablespoons maple syrup", "1⁄2 teaspoon vanilla bean paste", "1⁄2 teaspoon salt", "1 teaspoon cinnamon", "1⁄2 teaspoon freshly grated nutmeg", "1⁄2 teaspoon ground ginger", "1⁄2 teaspoon ground allspice", "2 large eggs", "&nbsp;", "<strong>Cream Cheese Frosting</strong>", "4 ounces (1 stick) unsalted butter, softened", "8 ounces cream cheese, softened", "3 cups confectioners’ sugar, sifted", "1 tablespoon pure vanilla extract", "1⁄2 teaspoon salt", "1⁄2 cup pecans, toasted (page 19), coarsely chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sweet Pastry Dough</strong><br />\nButter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Line the bottom with a sheet of parchment paper and butter the parchment.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour, sugar, and salt in a food processor and pulse until combined. Add the butter and pulse until sandy (6 to 10 quick pulses). In a small bowl, whisk the egg and add it to the food processor. Pulse just until the dough begins to hold together (if the dough seems exceedingly dry and crumbly, add a teaspoon of water and pulse again). Form the dough into a disk, wrap it tightly in plastic wrap, and refrigerate for at least 1 hour or overnight.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust a work surface with a sprinkling of flour. Using a rolling pin, roll the dough into a rectangle slightly larger than 9 by 13 inches (the size of the pan) and about 1⁄4 inch thick. The dough might be sticky, so turn it with a bench knife or spatula as needed and keep the work surface floured. Some people find it easier to roll the dough between two layers of parchment paper—this can make it less messy and easier to transfer to the pan.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ever so gently, guide the dough into the pan and lightly press it—without pulling—into the bottom; it is not necessary to bring the dough up the sides of the pan, only to completely cover the bottom of the pan. Trim off any excess. Place the pan in the freezer for 30 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the freezer, line it with aluminum foil, and fill it three-quarters full with pie weights or dried beans. Bake for 15 minutes, then remove the foil and weights and bake for another 10 minutes, until the crust is lightly browned. Transfer the pan to a wire rack to cool. Reduce the oven temperature to 300 degrees F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pumpkin Cheesecake Filling</strong><br />\nIn the bowl of a standing mixer fitted with the paddle attachment, beat the cream cheese on medium speed just until it is lump free and smooth. Do not overbeat or the tops of the bars may crack. Add the sugar and beat again until well combined, about 2 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the pumpkin puree, maple syrup, vanilla bean paste, salt, cinnamon, nutmeg, ginger, and allspice. Add this mixture to the cream cheese mixture and beat on medium-low speed until completely combined. Scrape down the sides and bottom of the bowl and add the eggs, one at a time, beating well after each addition, then beat until the mixture is smooth. Note: This batter is slightly looser than the average cheesecake batter.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture over the crust and bake for 23 to 30 minutes, or until the bars are set and slightly puffy (if the tops start to crack, the bars are overbaked). Transfer the pan to a cooling rack and allow the bars to come to room temperature, then refrigerate until chilled, at least 2 hours.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cream Cheese Frosting</strong><br />\nIn the bowl of a standing mixer fitted with the paddle attachment, beat the butter until it is completely smooth. Add the cream cheese and beat until combined. Add the confectioners’ sugar, vanilla, and salt and beat until smooth (be careful not to overbeat the frosting or it will lose its structure). The frosting can be made a day ahead: after mixing, cover the bowl tightly and refrigerate; let it soften to room temperature before using.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use an offset spatula to spread the frosting evenly across the top of the filling layer. If you like, sprinkle the pecans evenly over the top of the frosting. Place the bars in the refrigerator for 30 minutes to set before cutting and serving.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The bars can be stored in the refrigerator, tightly covered, for up to 3 days.</p>"}]}