{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120426-fiaf-zucchini-gratin-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["creme fraiche", "French in a Flash", "gratins", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lightened Up Zucchini Gratin", "link": "https://www.seriouseats.com/recipes/2012/04/lightened-up-zucchini-gratin-recipe.html", "description": "A light, green version of the classic French gratin, this baked zucchini crumble is inspired by Avignon and full of the flavors of wine, herbs, and lots of cheese.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["French", "Mains", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 tablespoon unsalted butter, room temperature, plus 1 1/2 tablespoons", "1 large shallot, finely diced (about 1/4 cup)", "Kosher salt and freshly ground black pepper", "2 medium cloves garlic, finely chopped (about 2 teaspoons)", "1/3 cup dry white wine, such as Sauvignon Blanc", "1/4 cup crème fraîche", "6 medium zucchinis, diagonally sliced 1/2-inch thick", "1 tablespoon chopped fresh thyme", "1 tablespoon chopped fresh mint", "1 tablespoon chopped fresh flat leaf parsley", "1 cup fresh breadcrumbs", "1/3 cup finely chopped walnuts", "1/2 cup grated Gruyère", "1/2 cup grated Parmigiano Reggiano", "Drizzle of extra virgin olive oil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat the oven to 400&deg;F.  In a medium skillet, melt 1 tablespoon butter over medium-low heat.  Add the shallot, season with salt and pepper, and cook, stirring frequently, until softened, about 2 minutes. Add the garlic, and cook until fragrant, about 1 minute longer. Add the wine, bring the mixture up to a boil, then add the crème fraîche. Stir until melted, then remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, add the zucchini, thyme, mint, and parsley. Season with salt and pepper, and add the shallot and wine mixture. Toss well and place in a lightly greased 9- by 13-inch rectangular baking dish. In another bowl, combine the crumbs, walnuts, cheese, and remaining 1 1/2 tablespoons butter with fingertips until the mixture is crumbly. Season with salt and pepper, and spread evenly over the zucchini. Drizzle lightly with olive oil (if using) and cover the baking dish with foil. Place the baking dish on a baking sheet, transfer to oven, then lower oven to 375&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, covered, for 1 hour and 15 minutes. Remove foil, and bake uncovered until the topping is golden brown and crisp, 5 to 10 minutes.  Transfer to a cooling rack and let cool 5 minutes before serving.</p>"}]}