{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20111231jellospoon610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "chocolate", "chocolate pudding", "gluten free", "Jello", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Jell-O Style Chocolate Pudding", "link": "https://www.seriouseats.com/recipes/2012/01/how-to-make-jello-pudding-from-scratch-chocolate-pudding-recipe.html", "description": "The flavor of this pudding changes dramatically depending on the ingredients used. Skim milk makes a pudding with the lighter taste and texture of the \"low-fat\" puddings where as whole milk gives the full flavor of the original. High end fancy cocoa powders like Valhrona will result in a really dynamic, flavorful chocolate pudding, whereas grocery store staples like Hershey's will have a simpler flavor more in line with the taste of the pudding you remember.", "totalTime": "4 hours", "recipeYield": "makes 4 servings", "recipeCategory": ["Chocolate", "Desserts", "Gluten-Free", "Puddings and Custards"], "recipeIngredient": ["1/4 ounce powdered gelatin", "2 1/2 ounces milk", "5 ounces sugar", "3/4 ounce cocoa powder", "1/2 to 3/4 teaspoon kosher salt, half as much if iodized", "12 ounces milk", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the gelatin and 2 1/2 ounces milk. Whisk with a fork to ensure no lumps remain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small sauce pot, combine the sugar, cocoa, salt and remaining milk over medium low heat. Whisk constantly until smooth and the mixture beings to bubble around the edges, about five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the hot dairy mixture through the sieve and into the bowl of gelatin. Whisk the gelatin into the chocolate mixture. Stir in the vanilla, and season with additional salt if needed (I've discovered the amount needed will vary according to the bitterness of the cocoa powder, which varies between brand and type).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the bowl, uncovered, in the refrigerator. After fifteen minutes cover the pudding with a sheet of plastic wrap pressed against the surface and refrigerate until fully thickened, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Whip the thickened pudding with a hand or stand mixer for a full minute to restore a creamy texture. (Alas, stirring or beating with a spatula alone will not sufficiently break up the pudding into a creamy, homogenous mixture.) Spoon the whipped pudding into four serving dishes.</p>\n\n<p>If all the pudding is not eaten at this time, it will be necessary to re-whip the pudding before serving as prolonged refrigeration creates an unpleasantly firm texture.</p>"}]}