{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120119-188620-doughnuts-610x458-17.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Chocolate Cake Doughnuts", "link": "https://www.seriouseats.com/recipes/2012/01/chocolate-cake-doughnuts--make-at-home-recipe.html", "description": "Brush up on your doughnut technique over at <a href=\"http://sweets.seriouseats.com/2012/01/sweet-technique-how-to-make-doughnuts-donuts-at-home-instructions.html\">this Sweet Technique post.</a>", "totalTime": "1 1/2 hours", "recipeYield": "makes approximately 12 doughnuts", "recipeCategory": ["Breakfast Sweets", "Desserts", "Doughnuts"], "recipeIngredient": ["2 1/2 cups all-purpose flour", "1 cup unsweetened Dutch-processed cocoa powder", "2 teaspoons baking powder", "1 teaspoon salt", "4 large eggs", "1 1/2 cups granulated sugar", "1/3 cup buttermilk", "5 tablespoons butter, melted and cooled", "2 quarts fat (lard, crisco, or neutral oil) for frying", "1/4 cup milk", "2 1/2 cups confectioner's sugar", "1 teaspoon vanilla", "pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together flour, cocoa powder, salt, and baking powder and set aside. In a smaller bowl, whisk eggs for 1 minute, until they are lightened. Add the sugar, melted butter, and buttermilk and whisk immediately for an additional minute. Add the wet ingredients to the dry and mix together with a large rubber spatula, until they come together. Do not overmix. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Liberally flour a work surface and turn the dough out onto it. Give the dough a fold so it comes together in one mass, then allow it to rest for 10 minutes. Liberally flour the top of the dough (it will be sticky, don't be afraid to use flour) and press it flat. Then, use a rolling pin to make the dough an even 1/2 inch thick. Using cutters dipped in flour, cut the doughnuts and place on a floured tray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your frying oil and glaze setup. Place a large, heavy pot on the stove and rest the thermometer inside. Pour in the oil and set the pot over medium heat. The goal is to get the oil to reach 375&deg;F and it is important to watch the pot at all times to maintain that temperature (and for safety). Set up a cooling rack covered with paper towels next to the stove and get tongs, spiders, chopsticks, or strainers ready (whatever you prefer to turn the doughnuts and remove them from the hot oil). On another burner, warm the milk in a small saucepan set over low heat until the milk begins to steam. Remove it from heat and add the confectioner's sugar, pinch of salt, and vanilla and whisk until they are smooth. Pour the glaze into a bowl and set the bowl over a small saucepan of water and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the oil has reached 375&deg;F, begin to add the doughnuts, one at a time, until there are three in the pot. Cake doughnuts will sink to the bottom of the oil, then cook for a bit before rising up. Once the doughnut bobs to the surface, fry it for approximately 2 minutes more before turning it and fry for an additional 2 minutes on the other side. Place the doughnuts on the prepared cooling rack. Break one open to ensure that it is cooked, and if additional time is needed, add the doughnuts back to the oil to finish and add a bit more cooking time for the rest. Fry the rest in similar fashion, and allow all of the doughnuts to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Glazing:</strong> Place the pot of water with the bowl of glaze set over it over low heat and stir to bring it back to a gooey liquid. Remove from heat and use your fingers to carefully submerge each of the doughnuts in the glaze. Place the glazed doughnuts on a clean cooling rack to dry. The glaze will become more translucent as it dries. For best flavor, serve immediately.</p>"}]}