{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121128-231802-eggnog-pie-600x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["eggnog", "holiday desserts", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.5", "ratingCount": "2"}, "name": "Eggnog Cream Pie", "link": "https://www.seriouseats.com/recipes/2012/12/eggnog-cream-pie-recipe.html", "description": "If you're a fan of store-bought eggnog, this is the pie for you. It's filled with a rich pudding made from eggnog and lightened with clouds of whipped cream. Shaving fresh nutmeg over the top really makes this pie sing.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Christmas", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["20 ounces (2 1/2 cups) store-bought eggnog", "1 egg", "5 egg yolks", "Kosher salt", "4 ounces (1/2 cup plus 1 tablespoons) granulated sugar", "2 tablespoons corn starch", "10 ounces gingersnaps, roughly broken (about 3 cups broken cookies)", "4 tablespoons butter, melted and cooled", "8 ounces (1 cup) heavy cream", "2 tablespoons confectioner's sugar", "Sprinkle of freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with plastic wrap and set aside (have additional plastic wrap close at hand). Place the eggnog in a large saucepan and set aside. In a large bowl, whisk together the egg, yolks, and pinch of salt until they are pale and fluffy. In a small bowl, whisk together starch and sugar and add it to the egg mixture, whisking as you go. Whisk the mixture until smooth and shiny, about 1 minute. Gently heat the eggnog over medium heat, stirring slowly to prevent it from scorching. Once it begins to bubble at the edges, temper the egg mixture with the hot eggnog by ladling the hot eggnog into the bowl in small additions and whisking vigorously as you go. Once the two mixtures are combined, pour the liquid back into the saucepan and whisk it over medium heat. It will thicken. Keep whisking. Once it starts to bubble, continue whisking vigorously for two minutes more. Scrape the pudding onto the prepared baking sheet and press plastic wrap directly on top. Allow the pudding to cool at room temperature for 30 minutes, then transfer it to the fridge to cool completely, for approximately 3 hours and up to one day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gingersnaps and 1/2 teaspoon of salt in the bowl of a food processor fitted with a metal blade. Pulse to grind the cookies down to uniform crumbs, approximately 30 seconds. Add the melted butter and pulse for an additional 15 seconds. Scrape the mixture into a pie plate and using your fingers, press to shape the crumbs into a crust against the bottom and sides of the plate. Chill for 30 minutes and up to one day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve: In a large bowl or the bowl of a stand mixer fitted with a whisk attachment, combine the heavy cream and confectioner's sugar. Whisk to medium peaks. Remove half of the whipped cream from the bowl and place it in a piping bag fitted with a fluted tip and chill. Add the chilled pudding to the bowl with the remaining cream and whisk until the pudding is smooth and creamy. Pour the pudding into the prepared pie shell and smooth the top with a spatula. Pipe the reserved cream onto the top of the pie. Grate fresh nutmeg over the top and serve immediately.</p>"}]}