{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121107-229164-dinner-tonight-shrimp-tomato-tomatillo-soup-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["chipotles", "Dinner Tonight", "Mexican", "potatoes", "quick", "shrimp", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shrimp and Chipotle Soup with Tomato, Tomatillo, and Potato", "link": "https://www.seriouseats.com/recipes/2012/11/shrimp-chipotle-soup-tomato-tomatillo-potatoes-recipe.html", "description": "The roasted soup base is acidic but thick, with just a little bit of spice hiding out in the back. The shrimp add a pop of sweetness, while a finally sprinkling of cilantro, avocado, and lime help freshen things up.", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Mexican", "Potato", "Shrimp", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["8 ounces tomatoes, stems removed", "8 ounces tomatillos, husks removed, rinsed ", "1/2 medium onion, peeled, cut in half  ", "1medium garlic clove, peeled", "2 to 3 tablespoons chipotles en adobo, chopped (depending on spice level you prefer)", "1 tablespoon olive oil", "4 cups low sodium homemade or store-bought chicken broth", "1 pound red potatoes, scrubbed, and cut into 1/2-inch pieces", "1 pound medium shrimp, shells and tails removed, deveined", "1 ripe hass avocado, skin removed, seeded, and chopped  ", "Handful fresh cilantro, chopped", "2 limes, cut into quarters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to six inches below the broiler. Preheat the broiler to high. Place the tomatoes, tomatillos, and onion pieces on a foil-lined baking sheet, and set underneath the broiler. Broil until everything just starts to develop black spots, about 10 minutes. Carefully flip everything with a pair of tongs, and cook until slightly blackened on the other side, about 5 minutes longer. Turn off the heat, and remove the pan from the oven. Let everything cool for 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cool, add the tomatoes, tomatillos, and onion pieces to a blender, along with the chipotles and garlic. Puree the mixture until smooth.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a Dutch oven or a large heavy-bottomed saucepan over medium-high heat. When oil starts to shimmer, add the puree. Cook, stirring often with a wooden spoon, until it has reduced somewhat and starts to thicken, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken stock and stir well. Bring to a boil over high heat, and then reduce heat to maintain a simmer. Add the potatoes. Simmer until tender, 10 to 15 minutes. Add the shrimp and cook until pink and firm, about two minutes. Season to taste with salt (this may not be required if chicken broth is salty).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the soup with a sprinkle of cilantro, a quarter of the avocado, and a wedge of lime. </p>"}]}