{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120702-127677-Queso-Corn-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cheese", "chili", "corn", "grilled cheese", "sandwich", "sandwiched", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Cheese Sandwich With Charred Chili and Corn", "link": "https://www.seriouseats.com/recipes/2012/07/charred-chili-cheese-and-corn-sandwiches-recipe.html", "description": "This recipe's backbone is melted oaxaca cheese, but since it's summer, we added fresh summer corn, charred until it begins to smell like popcorn over the heat of a grill. This sandwich gets griddled grilled cheese style and served with chopped onions and cilantro.", "totalTime": "30 minutes", "recipeYield": "makes 4 sandwiches", "recipeCategory": ["Cheese", "Corn", "Mains", "Sandwiches", "Vegetarian"], "recipeIngredient": ["4 ears fresh corn, shucked", "4 jalapeño peppers, split in half, stems, seeds, and ribs removed", "2 poblano peppers, split in half, stems, seeds, and ribs removed", "2 tablespoons vegetable oil", "1 pound grated oaxaca or mozzarella cheese", "Kosher salt and freshly ground black pepper", "4 crusty rolls (about 6 inches long), split lengthwise", "2 tablespoons unsalted butter, softened", "1 small white onion, finely diced (about 3/4 cup)", "1/2 cup cilantro leaves, chopped", "1 tablespoon lime juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat grill or grill pan over medium-high heat. Preheat for 5 minutes. Brush corn, jalapeños, and poblanos with vegetable oil. Grill until charred on all sides, turning occasionally with tongs, 7 to 10 minutes for corn, 5 to 7 minutes for chilis. Transfer to cutting board. When cool enough to handle, cut corn kernels from cob into a large bowl and slice the chilies into thin strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat cheese in a non-stick skillet over medium heat. Cook, stirring occasionally, until completely melted and browned in spots, about 4 minutes. Stir in corn and chilies. Season to taste with salt and pepper. Reduce heat to lowest setting to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, butter exterior of split rolls. Divide cheese mixture evenly among rolls and press together. Cook in a large skillet or over the grill, 2 sandwiches at a time, until crisp and browned, about 3 minutes per side. Transfer to cutting board and cut in half. Toss together onions, cilantro, and lime juice. Serve sandwiches with onion mixture.</p>"}]}