{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121212-233604-bar-bites-clams-with-tequila-and-chorizo.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "chorizo", "cinco de mayo", "clam", "clams", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Clams With Tequila and Chorizo", "link": "https://www.seriouseats.com/recipes/2012/12/clams-tequila-chorizo-bar-bites-recipe.html", "description": "This quick and easy surf-and-turf beer snack has a sauce that resembles bolognese, but is wholly comprised of Mexican chorizo sausage, tequila, and the liquid released from fresh clams.", "totalTime": "20 minutes", "recipeYield": "Serves 2 to 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Clams, Mussels, and Oysters", "Sides"], "recipeIngredient": ["1 tablespoon canola or vegetable oil", "4 medium garlic cloves, minced (about 4 teaspoons)", "1/4 pound fresh Mexican chorizo sausage", "1/2 cup silver tequila", "1 dried Chile de Arbol", "2 pounds fresh Manila clams, scrubbed and cleaned", "1 tablespoon lime juice", "Salt and freshly ground black pepper", "1/4 cup chopped cilantro", "Crusty bread, or tortilla chips, for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large saute pan over moderately high heat until shimmering. Add the garlic and cook, stirring constantly, until it just begins to brown, about 1 minute. Stir in the sausage, breaking it up with a wooden spoon or spatula. Cook until the sausage is browned and heated through, 3 to 5 minutes. Transfer the sausage to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the tequila into the pan, stirring to scrape up any browned bits from the bottom of the pan. Drop the chile pepper into the pan and continue to cook until the tequila is reduced by half, 1 to 3 minutes. Arrange the clams in a single layer on the bottom of the pan. Cover the pan and continue to cook until all of the clams have opened, 5 to 7 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, transfer the opened clams to a large shallow serving dish or bowl. Stir the lime juice into the pan and return the cooked sausage to the pan, simmer for 2 to 3 more minutes. Taste the sauce and season with salt and pepper as needed. Keep in mind that the sausage, as well as the liquor given up by the clams, are both salty, so not much additional salt may be needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the sauce over the clams and sprinkle with the chopped cilantro. Serve with lime wedges on the side, and with crusty bread or tortilla chips for dipping into the sauce.</p>"}]}