{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120305-195124-spamdonut1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["breakfast sweets", "Cakespy", "maple desserts", "spam"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mini Maple Spam Doughnuts", "link": "https://www.seriouseats.com/recipes/2012/03/maple-spam-doughnuts-recipe-cakespy.html", "description": "Like so many guilty-pleasure treats, Mini Maple Spam Doughnuts taste way better than they really ought to. The lightly crunchy, sweet doughnut exterior is contrasted by the crisp, crackly fried pork; finished with a creamy, maple-infused frosting and crunchy SPAM bits on top, it makes for a veritable sea of contrasting sweet and salty flavors and textures, and for an overall wholly enjoyable holey treat.", "totalTime": "", "recipeYield": "Makes 24 mini doughnuts", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Cakespy", "Doughnuts"], "recipeIngredient": ["1 cup all purpose flour", "3 tablespoons light brown sugar, packed", "1/4 teaspoon baking soda", "1/8 teaspoon salt", "1/3 cup buttermilk, plus one tablespoon", "1 egg", "1 tablespoon butter, melted", "1 (12-ounce) can SPAM ", "3/4 cup confectioners' sugar", "1 teaspoon maple syrup", "2 teaspoons freshly ground cinnamon, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the dough. In large mixing bowl, mix flour, brown sugar, baking soda and salt. Stir in 1/3 cup buttermilk, egg, and melted butter. Beat<br />\r\ntogether until well blended. Spoon batter into a pastry bag fitted with a round tip or a resealable plastic bag. Chill mixture for 1 hour.<br />\r\nMeanwhile, prepare SPAM Rings and glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the SPAM rings. Remove the SPAM from the can and slice from the lid side to the bottom into 12 slices (each slice about<br />\r\n1/4-inch thick). Using a 1-1/2-inch round biscuit cutter, cut each slice of SPAM into two rounds (you should have a total of 24<br />\r\nrounds from the can of SPAM Classic ). Using a straw, knife or small pastry tip, cut a small circle out of the center of each piece of<br />\r\nSPAM Classic to make a ring. Place rings into a large skillet and fry until golden brown on both sides. Repeat until all of the rings are fried; place on paper towels after frying to blot excess oil. Take the remaining scrape pieces of SPAM and finely dice. Place the diced SPAM into the same skillet and fry until golden brown; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the glaze. In small bowl, whisk together the confectioners' sugar, maple syrup and remaining 1 tablespoon of buttermilk until well combined; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the doughnuts. Preheat oven to 325&deg;F. Remove the chilled dough from the refrigerator. Spray a mini doughnut pan with nonstick<br />\r\ncooking spray. Pipe batter into the mini doughnut tin; filling 2/3 of the way full (if using a resealable plastic bag snip the corner of the<br />\r\nbag and pipe batter into the mini doughnut pan). Place the SPAM Rings on top of the dough. Bake for 10 minutes or until the<br />\r\ndoughnuts spring back when touched. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the doughnuts to cool slightly and then carefully remove from the pan. Spread the prepared maple glaze over the doughnuts and top with the diced SPAM for sprinkles. Repeat as necessary with the remaining dough and SPAM rings. If desired, sprinkle with a little cinnamon (I found this worked nicely with the maple flavor). Serve the doughnuts warm.</p>"}]}