{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121019-226094-cook-the-book-coconut-sauce-noodles.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["burma: rivers of flavor", "Cook the Book", "fish balls", "Fish Cakes", "Naomi Duguid"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Naomi Duguid's Fish Cakes and Fish Balls", "link": "https://www.seriouseats.com/recipes/2012/10/naomi-duguids-fish-cakes-and-fish-balls.html", "description": "These fish balls are served as an accompaniment to <strong><a href=\"http://naomiduguid.com/#_\">Naomi Duguid's</a></strong> <strong>Coconut Sauce Noodles</strong> in <a href=\"http://www.amazon.com/Burma-Rivers-Flavor-Naomi-Duguid/dp/1579654134/?tag=serieats-20\">Burma: Rivers of Flavor</a>. They can also be fried into cakes and served as appetizers.", "totalTime": "20 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Fish"], "recipeIngredient": ["About 1/2 pound tilapia or other white fish fillets, rinsed and coarsely chopped ", "About 2 tablespoons minced shallots", "2 teaspoons minced garlic", "1 teaspoon minced ginger ", "Scant 1/2 teaspoon salt", "Peanut oil for shallow-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the fish, shallots, garlic, ginger, and salt in a food processor and process to a smooth, even paste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a lightly oiled large plate on your work surface. For fish cakes: Scoop up a scant 1 tablespoon fish paste at a time, shape it into a smooth ball between your palms, flatten it to a disk about 11/2 inches in diameter, and set on the plate. You should have 15 to 18 patties. For fish balls: scoop up a generous 1 teaspoon of the paste, roll it lightly between moist palms to shape a ball, and set on the plate; repeat with the remaining paste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fry fish cakes: Heat a large heavy skillet over medium-high heat. Pour in about 1/4 inch of peanut oil. When the oil is hot, slide in the patties one by one. Cook in batches; stop adding them when the pan gets crowded. Cook until the underside is golden, 3 to 4 minutes, using a spatula to prevent the cakes from sticking to the pan. Turn them over and cook until golden on the underside. Hold a spider or sieve ready in your other hand as you use the spatula to lift out each disk, and place it in the sieve or spider, letting excess oil drain off, then transfer to a plate to cool and firm up. Repeat with the remaining fish cakes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook fish balls: Drop the balls into a pot of boiling broth or water. Once cooked through, in 2 to 3 minutes, they can be used in noodle dishes or frozen for later use.</p>"}]}