{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120528-127677-Sandwiched-Banana-Ice-Cream-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["banana", "bourbon", "ice cream", "ice cream sandwiches", "sandwiched"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Banana Cookies and Bourbon Ice Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/05/sandwiched-banana-cookies-and-bourbon-ice-cream-recipe.html", "description": "Notes: Bourbon ice cream is a serving suggestion; you can skip this step and use your favorite flavor of ice cream. Use a stainless steel skillet to brown the butter--a dark-bottomed skillet will make it difficult to see the butter...", "totalTime": "3 hours", "recipeYield": "Makes 12 ice cream sandwiches", "recipeCategory": ["Banana", "Cookies", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>For the Bourbon Ice Cream</strong> (See Notes)   ", "1 quart vanilla ice cream", "1/2 cup bourbon", " ", "<strong>For the Banana-Walnut Cookies</strong>", "1 1/2 sticks (6 ounces) unsalted butter", "2 teaspoons lemon juice", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground ginger", "1/4 teaspoon ground nutmeg", "2 1/4 cups (about 11 1/4 ounces) all-purpose flour", "1/2 cup chopped walnuts, plus 12 walnut halves for garnish", "1/2 cup toasted wheat germ", "1/2 teaspoon baking soda", "1/4 teaspoon baking powder", "1/2 teaspoon salt", "1 1/2 cups (about 10 1/2 ounces) plus 2 tablespoons packed dark brown sugar", "1/2 cup mashed ripe banana (1 large)", "1 large egg", "1 large egg yolk", "1 tablespoon pure vanilla extract", "1/3 cup (about 2 1/3 ounces) granulated sugar", " ", "<strong>For the Chocolate Dip</strong>", "12 ounces milk or bittersweet chocolate, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bourbon Ice Cream:</strong> Pulse ice cream and bourbon in food processor until combined (mixture will be runny). Transfer to large bowl and freeze until set, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Banana-Walnut Cookies:</strong> Meanwhile, adjust oven rack to middle position and preheat oven to 350&deg;F. Line 2 large baking sheets with parchment paper. In medium stainless steel skillet (See Notes), melt butter over medium heat. Cook butter, swirling pan occasionally, until beginning to foam. As foam settles, brown bits of butter will become visible at the bottom of the pan (5 to  7 minutes). Immediately remove from heat and stir in lemon juice. Stir in cinnamon, ginger, and nutmeg. Transfer to large bowl and cool to room temperature, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, chopped walnuts, wheat germ, baking soda, baking powder, and salt in medium bowl. Whisk 1 1/2 cups brown sugar into butter and stir until well combined. In small bowl, beat together banana, egg, egg yolk, and vanilla. Whisk into butter mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add flour mixture to butter mixture and combine with wooden spoon. If mixture appears to soft to roll into balls, refrigerate until firm, 15 to 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop dough into 2-tablespoon portions and roll into balls.  Combine remaining 2 tablespoons brown sugar and granulated sugar in medium bowl and toss cookie dough balls to coat. Arrange about 2 inches apart on prepared baking sheets and press down to make 2-inch diameter discs. Press 12 walnut halves into 12 cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cookies until edges are set and centers are still slightly soft, 12 to 14 minutes, rotating and alternating sheets halfway through baking. Transfer to cooling racks and cool on sheets 5 minutes, then transfer directly to cooling racks and cool completely, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Spread 1/3 cup ice cream on bottom side of 12 cookies, leaving a 1/2 inch border. Top with remaining 12 cookies and press down gently. Arrange ice cream sandwiches on plate or baking sheet and freeze to set, about 30 minutes. If desired, make chocolate dip (see below) and dip in half of ice cream sandwich. Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Dip:</strong> Place chocolate in medium bowl and microwave until smooth and melted, about 1 minute, pausing every 20 seconds to stir. Alternatively, bring about 2 inches water to boil in medium saucepan. Place chocolate in medium bowl and set on saucepan, making sure bottom of bowl is not making contact with boiling water. Stir chocolate until smooth and melted, 1 to 2 minutes. </p>"}]}