{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/229142-20121114-british-bites-gentlemens-relish-edit.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["anchovies", "british bites", "butter", "compound butters", "gentlemen's relish", "relish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gentlemen's Relish", "link": "https://www.seriouseats.com/recipes/2012/11/gentlemens-relish-recipe.html", "description": "This classic condiment is a type of seasoned anchovy butter that is also known as Patum Peperium. The strong anchovy flavor is complemented by cayenne pepper and ground nutmeg, and fresh lemon juice cuts through both the butter and the anchovy to add just a little lightness to this intense compound butter.", "totalTime": "10 minutes", "recipeYield": "Makes 2 cups", "recipeCategory": ["British Bites", "Condiments and Sauces"], "recipeIngredient": ["8 ounces (2 sticks) butter, room temperature ", "8 ounces (4 tins) flat anchovies, drained ", "1/4 teaspoon ground cinnamon ", "1/4 teaspoon white pepper ", "1/4 teaspoon cayenne pepper ", "Dash of fresh grated nutmeg ", "Kosher salt and cracked black pepper, to taste "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter, anchovies, cinnamon, white pepper, cayenne pepper, and nutmeg in a food processor and pulse until well combined. Taste for seasoning and add additional salt and pepper if necessary. Alternatively, mash butter with a wooden spoon in a large bowl and then finely chop the anchovies. Add anchovies, cinnamon, white pepper, cayenne pepper, and nutmeg to the bowl, and mix to combine.  Season to taste with salt and pepper and mix again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use right away as a spread on toast with sliced cucumber or watercress, or use as an additional ingredient to a cottage pie or scrambled eggs, or as a salty condiment for a baked potato, and even as a topping for a seared steak. Gentlemen’s relish will keep in a sealed container in the refrigerator for up to 2 weeks, or wrapped in plastic and frozen for up to three months.</p>"}]}