{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121023-cookie-monster-chocolate-peanutbutter-jack-o-lantern-pumpkin-cookies.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["chocolate cookies", "cookie monster", "Cookies", "peanut butter", "sandwich cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Peanut Butter Jack-o'-Lantern Cookies", "link": "https://www.seriouseats.com/recipes/2012/10/chocolate-peanut-butter-jack-o-lantern-halloween-pumpkin-cookie.html", "description": "These jack-o'-lanterns are made from thin chocolate roll-out cookies sandwiched over peanut butter. They're chocolatey-nutty, crispy-creamy, Halloween treats.", "totalTime": "1 hour", "recipeYield": "makes about 18 sandwiches", "recipeCategory": ["Cookie Monster", "Cookies", "Halloween", "Nuts"], "recipeIngredient": ["1 1/2 cups (about 7 1/2 ounces) flour", "1/2 cup (about 2 1/2 ounces) unsweetened cocoa powder, such as Valrhona", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "8 tablespoons (1 stick) unsalted butter, at room temperature", "1 cup (about 7 ounces) sugar", "1 extra large egg", "1 teaspoon vanilla extract", "About 4 tablespoons peanut butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together flour, cocoa powder, baking powder, baking soda, and salt; set aside. In a large bowl, cream together butter and sugar with an electric beater until light and fluffy, about 3 minutes. Beat in egg and vanilla extract. Add flour mixture to bowl and beat until just combined. Dough should come together, if too crumbly, add 1 teaspoon water. Form dough into a ball, cover with plastic wrap and chill in refrigerator for one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper and lower middle positions and preheat oven to 350&deg;F. Line two baking sheets with parchment paper. Divide dough in half and roll one half out onto a lightly floured surface to a thickness of approximately 1/8th- inch. Cut out 12 pumpkins using a pumpkin-shaped cookie cutter and transfer to a prepared baking sheet. Repeat with remaining dough. Using a pairing knife, cut jack-o-lantern faces into 1/2 of the cookies. Bake cookies until just dry on top, about 10 minutes. Let cool for 5 minutes then transfer to a wire rack to finish cooling. When completely cooled, spread top of faceless cookies with about 1 teaspoon of peanut butter (more or less depending on how much you like peanut butter). Top with a face cookie to complete sandwiches.</p>"}]}