{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120113-buffalo-wings-new-19.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["Buffalo wings", "chicken wings", "low carb", "Super Bowl", "Super Bowl wings", "The Food Lab", "wings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6923076923077", "ratingCount": "26"}, "name": "The Ultimate Extra-Crispy Double-Fried Confit Buffalo Wings", "link": "https://www.seriouseats.com/recipes/2012/01/ultimate-extra-crispy-double-fried-confit-buffalo-wings.html", "description": "Classic buffalo wings are a real triumph in recent American history. Extra crispy and perfectly spicy, this recipe is the best way to prepare your drumsticks and flats for ultimate crowd-pleasing power.", "totalTime": "2 to 36 hours", "recipeYield": "serves 4 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Sides", "The Food Lab"], "recipeIngredient": ["3 quarts peanut or canola oil", "4 pounds chicken wings, cut into drumettes and flats", "8 tablespoons (1 stick) unsalted butter", "1 cup Frank's RedHot Sauce", "Blue cheese dressing", "Celery sticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Stovetop method:</strong> Place oil and chicken wings in a large wok or Dutch oven. Heat over medium-high heat, stirring occasionally, until it registers 225 to 250°F on an instant-read or deep-fry thermometer (chicken should be gently bubbling). Continue to cook, stirring and flipping chicken occasionally while adjusting heat to maintain a temperature of 225 to 250°F until chicken is cooked through and skin is tender but not crisp or browned, about 20 minutes total. Transfer chicken with a wire mesh spider to a rimmed baking sheet lined with paper towels. Allow chicken to rest at room temperature for at least 1 hour, or cover and rest in the fridge for up to three nights. Proceed with Step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Oven Method:</strong> Adjust oven rack to lower-middle position and preheat oven to 225°F. Place oil and chicken wings in a large oven-safe Dutch oven. Heat over medium-high heat, stirring occasionally, until it registers 200°F on an instant-read or deep-fry thermometer. Cover pot and transfer to oven. Cook until chicken wings are tender but not browned, 40 minutes to 1 hour (chicken should be tender but not falling apart). Remove pot from oven. Transfer chicken with a wire mesh spider to a rimmed baking sheet lined with paper towels. Allow chicken to rest at room temperature for at least 1 hour, or cover and rest in the fridge for up to three nights. Proceed with Step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, combine butter and Frank's in a small saucepan over medium-low heat and cook, stirring occasionally, until butter is completely melted. Transfer to a large bowl. Heat oil to 400°F. Carefully add one third of chicken and cook, stirring and flipping chicken occasionally while adjusting heat to maintain a temperature of 375 to 400°F until golden brown and crisp, about 10 minutes total. Transfer to bowl with sauce, toss to coat, and serve with blue cheese and celery. Repeat with remaining batches, serving one batch at a time.</p>"}]}