{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121010-papas-chorreadas2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Latin Cuisine", "keywords": ["colombian cuisine", "guiso", "hogao", "Latin American cuisine", "potatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Papas Chorreadas (Colombian Potatoes with Cheese and Tomato Sauce)", "link": "https://www.seriouseats.com/recipes/2012/10/papas-chorreadas-colombian-potatoes-with-cheese-and-tomato-recipe.html", "description": "A traditional dish from the mountainous region near Bogotá, boiled potatoes are covered in a creamy, cheesy, tomato and onion-based <em>hogao</em>.", "totalTime": "", "recipeYield": "serves 4 to 6", "recipeCategory": ["Latin American", "Latin Cuisine", "Potato", "Sides", "Vegetarian"], "recipeIngredient": ["12 medium-sized Yukon gold potatoes (about 2 1/2 pounds)", "Kosher salt", "2 tablespoons olive oil", "1 medium onion, thinly sliced", "1 (28-ounce) can whole peeled tomatoes, drained and cut into 1/4-inch strips (see note)", "1 cup heavy cream", "6 ounces grated fresh cheese, preferably fresh mozzarella curds (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a large pot and cover with cold water by 2 inches. Salt water generously, then place over high heat. Bring to a boil, and cook until potatoes are completely tender, about 20 minutes after boiling is achieved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat olive oil in a large saucepan over medium-high heat until shimmering. Add onions and cook, stirring frequently, until lightly softened, about 3 minutes. Add tomatoes and stir to combine. Bring to a boil, adjust heat to maintain a gentle simmer, and cook, stirring occasionally, until almost no liquid remains, about 15 minutes. Add heavy cream, bring to a simmer, and cook until sauce comes together and has the consistency of light paint.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain potatoes and transfer to a serving platter. Season sauce to taste, then stir in grated cheese, heating until cheese just barely begins to melt (it should stay chunky in light curds). Spoon sauce over potatoes, and serve immediately.</p>"}]}