{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120529-195206-mallowmar-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "mallomars", "marshmallows", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mallomar Pie", "link": "https://www.seriouseats.com/recipes/2012/06/marshmallow-chocolate-graham-mallomar-pie-recipe.html", "description": "Just like a Mallomar, this pie is all about the marshmallow, which is accented with texture and richness from the graham cracker crust and chocolate glaze shell.", "totalTime": "5 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Crust</strong>", "7 ounces (approximately 1 1/2 sleeves) of graham crackers, pulverized into crumbs", "1 ounce (about 2 tablespoons) granulated sugar", "1 teaspoon salt", "4 tablespoons (1/2 stick) unsalted butter, melted", "&nbsp;", "<strong>For the Filling:</strong>", "5 ounces egg whites, room temperature (from approximately 4 eggs)", "Pinch of salt", "9 ounces (about 1 1/4 cups) granulated sugar, divided", "2 ounces (about 1/4 cup) light corn syrup", "1 ounce water", "1/2 ounce powdered, unflavored gelatin, bloomed in 1 ounce (2 tablespoons) cold water", "1 tablespoon vanilla extract", "&nbsp;", "<strong>For the glaze:</strong>", "6 ounces dark chocolate, melted", "3 ounces (about 1/2 cup) heavy cream, warmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the crust:</strong> In a large bowl, toss the graham cracker crumbs, sugar, and salt together. Add the butter and stir with a spatula to combine. Line the bottom and sides of a 9-inch pie plate evenly with the mixture and press it with your fingers to bring the crust together. Chill for at least 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the filling:</strong> In the bowl of the stand mixer fitted with a whisk attachment, place the egg whites, salt, and two ounces (about 1/4 cup) of sugar. Turn the mixer to medium speed until the egg whites become frothy (not foamy), then stop mixer. In a medium saucepan, combine the remaining 7 ounces (about 1 cup) sugar, corn syrup, and water. Wash down the sides of the pan with a pastry brush dipped in clean water. Place the saucepan over medium heat and place a thermometer in the saucepan. Heat until sugar syrup reaches 240°F. Add bloomed gelatin and stir to combine. Return mixer to medium speed and whip egg whites until glossy and thick, about 1 minute (be careful not to overwhisk). Increase speed to high speed and drizzle in the hot sugar mixture slowly. Once the mixture is added, whisk on high speed for approximately 10 minutes, until marshmallow holds stiff peaks. Scrape the filling into the pie shell and chill for 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the glaze:</strong> Melt the chocolate in the microwave in 15 second blasts, stirring between each blast. Once the chocolate is mostly melted, add the heavy cream and continue microwaving and stirring until smooth and glossy. Pour over the top of the chilled pie. Chill again for another 20 minutes. Serve up to one day after making.</p>"}]}