{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120905-221546-easy-funnel-cakes.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "fair food", "fried desserts", "fried dough", "funnel cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Funnel Cake", "link": "https://www.seriouseats.com/recipes/2012/09/easy-funnel-cake-fried-dough-recipe.html", "description": "At state fairs, funnel cakes are enormous, paper plate-sized affairs made by pouring batter from a funnel in a winding circular pattern over hot oil. This homemade version is simplified by using complete buttermilk pancake mix doctored up with a bit of sugar.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["American Classics", "Cakes", "Deep Frying", "Pastry"], "recipeIngredient": ["2 quarts canola oil for frying", "1 1/2 cups complete buttermilk pancake mix (see note)", "2 tablespoons sugar", "1/2 cup water", "2 teaspoons vanilla extract", "Powdered sugar to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil to 375&deg;F in a large Dutch oven and adjust flame to maintain temperature. While oil is heating prepare the funnel cake batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl whisk together pancake mix and sugar. Whisk in water and vanilla until you get all the lumps out. Your batter should be the thickness of cake batter, not too thin and not too gloppy. Lifting the batter with the whisk or a spoon should form ribbons as it falls back to the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour batter into a funnel or a plastic squeeze bottle with a 1/4-inch opening. You'll use about 1/2 cup of batter per funnel cake. If using a funnel, cover the opening with your finger and position over the center of dutch oven or deep fryer. Allow the batter to flow, working quickly to swirl in a loopy circular pattern to make a 4 to 5-inch large disk. Fry disk for 1 to 2 minutes or until golden on the bottom. Using a shallow heat resistant strainer, carefully turn funnel cake and fry until golden brown on second side, about 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a paper towel-lined plate. Place confectioner's sugar in a fine mesh strainer and tap over cakes to dust lightly. Serve immediately.</p>"}]}