{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120723-215412-lanecake.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "Lane cake", "recipes", "Southern desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lane Cake", "link": "https://www.seriouseats.com/recipes/2012/07/lane-cake-recipe.html", "description": "Lane Cake: now there's a <strong>tall southern belle of a layer cake</strong>, filled with coconut, chopped fruit and nuts and a generous serving of whiskey or brandy, and topped off with a snowy range of fluffy frosting. Cutting into this cake is particularly enjoyable: the white frosting gives way to a creamy-colored cake, with a slightly more yellow-toned custard, flecked with a confetti of nuts and fruits contained therein.", "totalTime": "5 hours", "recipeYield": "Serves 12", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["<strong>For the Cake:</strong>", "8 egg whites", "3 1/2 cups (about 17 1/2 ounces) flour", "1/8 teaspoon salt", "2 teaspoons baking powder", "1 cup (2 sticks) butter, softened", "2 cups (about 14 ounces) sugar", "1 cup (about 8 ounces) milk", "1 teaspoon vanilla extract", " ", "<strong>For the Filling:</strong>", "8 egg yolks", "1 cup (about 7 ounces) sugar", "1/2 cup (1 stick) butter, cut into 1/2 inch pieces", "1 cup (about 4 1/4 ounces) raisins", "1 1/2 cups (about 6 ounces) grated coconut", "1 cup (about 4 ounces) coarsely chopped pecans or other nuts", "1/8 teaspoon salt", "1 cup (8 ounces) brandy", "1 teaspoon vanilla extract", " ", "<strong>For the Frosting:</strong>", "6 egg whites", "2 cups (about 14 ounces) sugar", "3/4 cup water", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to center position and preheat oven to 375&deg;F. Grease and flour the sides of three 9-inch cake pans; line the bottoms of the pans with rounds of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat the egg whites until stiff peaks form. Set aside. In a separate large bowl, sift together the flour, salt, and baking powder three times. In a stand mixer fitted with the paddle attachment, cream the butter and sugar on medium high speed until light and fluffy, 3 to 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour mixture to the butter alternately with the milk, in 2 to 3 additions each, beginning and ending with the flour. Beat in the vanilla. The batter will be extremely thick, more like a cookie dough. Remove bowl from stand mixer and using a rubber spatula, gently fold in about 1/3 of the egg white mixture. Fold in the remaining egg white mixture until just combined. The batter will still be thick. Divide evenly between three prepared cake pans and smooth surface with rubber sptaula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until a tester comes out clean, 25 to 30 minutes, rotating front to back half way through baking. Allow the cakes to cool in the pans for 10 minutes, and then turn out onto a wire rack to cool completely. If your cakes have formed domes, level them using a large serrated knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Whisk egg yolks until they have become lightly frothy. Add the sugar and salt; continue beating until mixture is pale yellow and forms smooth ribbons when it drips off the whisk, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in the top of a double boiler over low-medium heat; once melted, add egg-sugar mixture; stir constantly until the mixture thickens. Remove from heat; stir in the raisins, coconut, nuts, 3/4 cup of the brandy, and vanilla. Place cling plastic wrap directly on top of the custard, to prevent a skin from forming. Let chill in the refrigerator for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting:</strong> In the bowl of a stand mixer fitted with a whisk attachment, beat the egg whites until they hold soft peaks. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sugar and water in a small saucepan set over medium high heat. Cook, stirring occasionally. Once it comes to a boil, continue stirring, more frequently, until the sugar is dissolved; boil the syrup until it registers 248&deg;F on a candy thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer running add the hot syrup to the egg whites, in a slow, steady stream. If any of the sugar hardens while mixing, just remove the piece (it should be easy to remove). Add the vanilla, beating the icing until it is smooth and cool</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Place the first cake layer on a serving plate, flat (un-cut) side up. Spread it with half of the custard filling, keeping a 1/2 inch margin around the edges&mdash;the weight of the next layer will spread the filling to the edges. Place another cake layer on top of the frosting, once again so that the flat side faces up. Spread the remaining filling on top of this layer, once again leaving a margin. Place the third cake layer on top, flat side up. Frost all over with frosting.</p>"}]}