{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120529-195206-strawberry-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["fruit pies", "pie", "pie of the week", "strawberries", "strawberry pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sweet Strawberry Pie", "link": "https://www.seriouseats.com/recipes/2012/05/sweet-strawberry-pie-recipe.html", "description": "This pie is the perfect celebration of summer's premiere fresh fruit offering: fresh strawberries.  It's perfection when served outdoors and a la mode.", "totalTime": "8 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles", "Strawberry"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "2 1/2 pounds fresh strawberries, washed, cored, and quartered", "Approximately 4 ounces granulated sugar (more/less to your taste)", "3 tablespoons corn or tapioca starch", "Egg wash: 1 egg beaten with a pinch of salt", "Optional: raw sugar for sprinkling (you may substitute granulated)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 425°F. Place quartered strawberries in large bowl. Whisk together sugar and starch to combine, then toss with berries until pieces are evenly coated. Allow mixture to sit for five minutes, then pour into pie shell. Remove the rolled out sheet of top dough from the fridge and cut into 1/2-inch strips. Weave a lattice pattern over the top of the pie.  Crimp sides and chill the pie for 15 to 20 minutes. When ready to bake, remove pie from refrigerator, brush with egg wash, and sprinkle with raw sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pie in oven and bake for 20 minutes, turning halfway through, then turn oven down to 350°F and bake until filling bubbles all over inside and crust is golden brown, 20 to 30 additional minutes. Remove from oven and place pie on rack to cool completely before serving.</p>"}]}