{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120919-222718-cook-the-book-roasted-whole-plaice.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "flatfish", "hugh fearnley-whittingstall", "nick fisher", "the river cottage fish book", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "River Cottage's Roasted Whole Plaice with Cherry Tomatoes", "link": "https://www.seriouseats.com/recipes/2012/09/river-cottages-whole-plaice-with-cherry-tomat.html", "description": "Roasting whole fish has got to be one of the simplest ways to impress a table full of diners&mdash;throw in a fancy British fish name or two and you've got yourself a winner of a party. <strong><a href=\"http://en.wikipedia.org/wiki/Plaice\">Plaice</a></strong> is one of the most common flatfishes eaten in Europe, and lucky for us, it and some of its more familiar neighbors are being fished in sustainable manners here across the pond.* In <em><a href=\"http://www.amazon.com/The-River-Cottage-Fish-Book/dp/1607740052?tag=serieats-20\">The River Cottage Fish Book</a></em>, <strong><a href=\"http://www.rivercottage.net/about/meet-hugh/\">Hugh Fearnley-Whittingstall</a></strong> and <strong>Nick Fisher</strong> espouse the wonders of whole plaice, praising its subtle, sweet salinity. To bring out the sweetness of the fish, they roast cherry tomatoes alongside, which caramelize and burst in the hot oven, adding their own luscious nectar to the roasting pan.", "totalTime": "40 minutes", "recipeYield": "serves 2 to 4, depending on the size of your plaice", "recipeCategory": ["Cook the Book", "Fish", "Mains", "Tomato"], "recipeIngredient": ["Olive oil", "1 large plaice, weighing at least 2 1/4 pounds, scaled and gutted, but skin on", "A generous tablespoon of unsalted butter, cut into small pieces", "1 pound sweet cherry tomatoes, such as sungold", "About 6 sprigs of thyme", "About 6 bay leaves", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F (220°C). Oil a baking sheet large enough to accommodate your plaice. Season the surface of the baking sheet and place the fish on it, pale side (underside) down. Drizzle the fish with olive oil and massage it in. Season all over with pepper and lots of salt and dot the little pieces of butter over it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter the cherry tomatoes around the fish, along with the thyme and bay leaves. Bake for 20 to 30 minutes, until the fish is just cooked and the tomatoes are blistered and soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once roasted, the flesh of the plaice should lift easily from the bone in neat fillets. Remove the top two fillets using a fish knife and fork. Ease the skeleton away to reveal the remaining two fillets from the underside. Serve the fish with the tomatoes and all the buttery, salty-sweet roasting juices.</p>"}]}