{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120430-204112-green-beans-with-crisp-shallots.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["green beans", "Mark Bittman", "shallots", "sides", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mark Bittman's Green Beans with Crisp Shallots", "link": "https://www.seriouseats.com/recipes/2012/05/mark-bittmans-green-beans-with-crisp-shallots.html", "description": "Leave it to <a href=\"http://markbittman.com/\">Mark Bittman</a> to show us how to make the best version of this side standard, <strong>Green Beans with Crisp Shallots</strong>.  Bittman's go to method for beans with a little bit of bite involves briefly boiling the green beans, shocking them in ice water, and finishing them with a quick trip to the sauté pan.  Tossed with crispy sweet butter and olive oil fried shallots, and almonds, if you'd like, this is the recipe that'll have your green beans moving out of blah territory and into much tastier place.", "totalTime": "30 to 40 minutes", "recipeYield": "4 servings", "recipeCategory": ["Legumes", "Other Vegetables", "Vegetarian"], "recipeIngredient": ["Salt ", "1 1/2 pounds green beans", "1 tablespoon olive oil", "1 tablespoon butter", "2 medium shallots, thinly sliced", "Freshly ground black pepper", "1/4 cup sliced almonds, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a stockpot of water to a boil and salt it. Fill a large bowl with cold water and lots of ice cubes and keep a colander handy. To trim the beans, snap or cut off the stem end and any brown spots. Cut them into 2-inch pieces or leave them whole.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the green beans to the boiling water and cook until they just start to get tender but remain quite crunchy, 3 to 5 minutes depending on the size of the beans. Drain the beans and immediately plunge them into the ice water. Let them sit for a minute to cool thoroughly, then drain them. (You can prepare the beans up to a day before finishing the dish; cover well and refrigerate.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the oil and butter in a large skillet over medium-high heat. When the butter melts, add the shallots and cook, stirring once or twice, until they’re golden brown and crisp, 5 to 10 minutes. Transfer the shallots to a plate lined with paper towels. Leave the fat in the pan.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the green beans to the skillet, sprinkle with salt and pepper, and cook, stirring occasionally, until the beans are crisp-tender, 3 to 5 minutes. Taste and adjust the seasoning and serve hot or warm with the shallots on top and almonds sprinkled over if you’re using them.</p>"}]}