{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120313-127677-LTE-Chocolate-Ginger-Peach-Icebox-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["chocolate cake", "icebox cake", "Let them eat cake", "peach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Ginger Peach Icebox Cake", "link": "https://www.seriouseats.com/recipes/2012/03/chocolate-ginger-peach-icebox-cake-recipe.html", "description": "Note: Sift the flour before measuring it. About the author: María del Mar Sacasa is a recipe developer, food stylist, and author of the food blog High Heels &amp; Frijoles. Behind her girly façade lurks a truck driver's appetite. Read...", "totalTime": "9 hours, 30 minutes", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Cakes", "Ginger", "Peach"], "recipeIngredient": ["<strong>For the Cake</strong>    ", "Baking spray", "1/2 cup plus 2 tablespoons sifted cake flour (See Notes)", "1/2 cup natural unsweetened cocoa powder", "3/4 cup sugar", "1 1/2 teaspoons baking powder", "1 teaspoon ground ginger", "3 large egg yolks, at room temperature ", "1/4 cup vegetable oil", "2 teaspoons pure vanilla extract", "1/4 cup hot water", "4 large egg whites, at room temperature", "1/2 teaspoon salt", "   ", "<strong>For the Ginger-Peach Semifreddo</strong>    ", "1 (.25-ounce) package unflavored gelatin", "3 tablespoons water", "2 cups gingersnap cookies", "8 ounces frozen peaches, thawed", "2 tablespoons finely grated fresh ginger", "1 teaspoon pure vanilla extract", "1 1/4 cups sugar ", "1/4 cup water", "2 tablespoons light corn syrup", "4 large egg whites, at room temperature", "1/4 teaspoon salt", "   ", "<strong>For the Chocolate Glaze and Assembly</strong>    ", "1/2 cup heavy cream", "1/2 cup dark corn syrup", "9 ounces bittersweet chocolate, chopped", "16 to 20 gingersnap cookies"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to middle position and preheat oven to 325&deg;F. Lightly coat springform pan with baking spray. Line bottom with parchment paper and once again lightly coat with baking spray.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift cake flour, cocoa powder, 1/2 cup sugar, baking powder, and ginger over piece of parchment paper. Sift mixture, once again, into large bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whisk together egg yolks, oil, and vanilla until smooth. Add to flour mixture and whisk together until combined (mixture will be thick). Add hot water and whisk until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In separate clean, dry mixing bowl, or in bowl of stand mixer, whip egg whites and salt with whisk attachment on medium speed until soft peaks form, about 2 minutes. Increase speed to medium-high and gradually add remaining 1/4 cup sugar; continue whipping until firm, glossy (but not dry) peaks form, 1 to 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir 1/3 of egg whites into cake batter until thoroughly combined. With rubber spatula, gently fold in remaining egg whites.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan and spread out evenly. Bake until cake tester inserted in center of cake comes out clean, 25 to 30 minutes. Transfer to cooling rack and cool cake in pan for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Release sprinfgform, invert cake onto cutting board or plate, remove bottom of springform, and peel off parchment. Invert cake (so that top is facing up) onto cooling rack and cool completely, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With serrated knife, cut cake in half. Re-assemble springform. Place bottom layer of cake in pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ginger-Peach Semifreddo:</strong> Combine gelatin and water in small bowl and allow to soften for 5 minutes. Microwave for 30 seconds and allow to cool to room temperature, 5 to 10 minutes.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break gingersnaps into pieces and place in large zipper-lock bag. Place bag on kitchen towel and beat with mallet until gingersnaps are broken into medium and small pieces (cookies shouldn’t be pulverized).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse peaches, ginger, 1/4 cup sugar, and vanilla in blender or food processor until completely puréed. Strain into large bowl. Stir in gingersnap pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir remaining 1 cup sugar, water, and corn syrup in heavy-bottomed medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 238&deg;F on candy thermometer, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While syrup boils, with electric mixer fitted with whisk attachment, whip egg whites and salt with whisk attachment on medium speed soft peaks form, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When syrup reaches temperature, with mixer running on medium-high speed, slowly and carefully pour into egg whites. Beat until outside of bowl is cool to the touch and whites are thick and glossy, about 7 minutes. Add gelatin and beat just to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix 1/3 of meringue into peach mixture. With rubber spatula, fold in remaining meringue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape meringue over cake in springform and smooth out top. Arrange top of cake over meringue. Freeze until set, at least 6 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Glaze and Assembly:</strong> Bring cream and corn syrup to simmer in medium saucepan. Remove from heat. Add chocolate and whisk until melted and smooth.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange cake on cooling rack set inside rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread 1 cup glaze over top and sides of cake with offset spatula. Freeze until glaze is almost set, about 5 minutes. Pour remaining glaze over cake, and working quickly, smooth sides and top. Press gingersnaps into perimeter of cake. Freeze until set, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a large knife under hot water until blade is warm. Dry and slice cake. For easy, clean slicing, repeat procedure with each cut. Serve chilled. </p>"}]}