{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120328-199579-dinner-tonight-potato-almond-soup-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Spanish", "keywords": ["almonds", "Dinner Tonight", "garlic", "potato", "saffron", "sherry", "soup", "spanish", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato Soup with Fried Almonds", "link": "https://www.seriouseats.com/recipes/2012/04/potato-soup-with-fried-almonds.html", "description": "When it comes to satisfying soups made with a bunch of pantry staples, we all have a lot to learn from the Spanish. Whereas I see stale bread and too much garlic, they see gazpacho. And where I see a mishmash of potatoes, almonds, and a little bit of ham, Anya von Bremzen in <a href=\"http://www.amazon.com/The-Spanish-Table-Anya-Bremzen/dp/0761135553/ref=sr_1_1?ie=UTF8&amp;qid=1333121721&amp;sr=8-1\">The New Spanish Table</a> sees a remarkably filling potato soup with fried almonds.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Garlic", "Mains", "Nuts", "Potato", "Soups and Stews", "Spanish"], "recipeIngredient": ["1/4 cup extra-virgin olive oil ", "1/2 cup whole blanched almonds, skins removed", "6 medium garlic cloves, peeled", "2 ounces Serrano ham or Prosiutto, cut into 1/4-inch dice (about 1/2 cup)", "1 1/2 pounds Yukon Gold potatoes, peeled, roughly chopped ", "4 cups low sodium canned or homemade chicken broth", "Kosher salt and freshly ground black pepper ", "1 pinch saffron", "2 teaspoons sherry vinegar ", "Sliced country bread, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a medium saucepan over medium-high heat until shimmering. Add the almonds and garlic. Cook, stirring often, until they are golden, four to five minutes. Remove with a slotted spoon and set aside. Add the ham, stir well, and cook until just beginning to render, about 1 minute. Add the poatoes, and cook, stirring frequently, until sizzling, about a minute longer. Add stock and 1 tablespoon salt and increase heat to high. Bring to a boil over high heat, and then reduce heat to a simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, transfer the almonds and garlic to a food processor, and process until they are finely ground. Set aside two tablespoons of the mixture. Add the rest of it to the saucepan and stir well. Place saffron in a small bowl and add two tablespoons warm water. Allow to steep for 1 to 2 minutes, then add to saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover soup with lid left open a crack and simmer until about half of the potatoes have disintegrated into the soup, about 35 minutes. Stir in the vinegar and the remaining two tablespoons of the almond and garlic mixture. Cook for another minute, and then remove from heat. Season with more salt and pepper to taste. Serve the soup with slices of country bread. </p>"}]}