{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120223-194302-mortadella-pizza.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Marc Vetri", "pizza", "pizza dough", "Rustic Italian Food", "starters"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Marc Vetri's Mortadella Pizza", "link": "https://www.seriouseats.com/recipes/2012/02/marc-vetris-mortadella-pizza.html", "description": "This Mortadella Pizza begins with the Napoletana dough, which in turn begins with a starter. Using a starter instead of just yeast adds a depth of flavor and contributes to the dough's wonderfully stretchy, pliant qualities.", "totalTime": "1 hour plus overnight rise for the dough", "recipeYield": "Makes one 12-inch pizza and dough for four or five 12-inch-diameter rounds", "recipeCategory": ["Cook the Book", "Pizza"], "recipeIngredient": ["1 round Napoletana Pizza Dough (recipe follows)", "1/4 cup grated Parmesan cheese", "1/2 cup cubed fresh mozzarella ", "2 ounces thinly sliced mortadella", "1/2 cup shelled pistachios", "3/4 cup extra-virgin olive oil  ", "&nbsp;", "<strong>Napoletana Pizza Dough</strong>", "4 cups (500 g) high-protein flour, such as King Arthur Sir Galahad or Unbleached All-Purpose", "2 1/8 cups (500 g) Biga Starter (recipe follows)", "1 cup minus 2 tablespoons (200 g) cold water", "1/2 teaspoon (1 g) packed fresh cake yeast, or 1/8 teaspoon (0.5 g) instant yeast", "2 1/2 teaspoons (15 g) fine sea salt", "&nbsp;", "<strong>Biga Starter</strong>", "4 cups (500 g) high-protein flour, such as King Arthur Sir Galahad or Unbleached All-Purpose", "1/2 teaspoon (2 g) packed fresh cake yeast, or 1/4 teaspoon (1 g) instant yeast", "21/4 cups (500 g) warm water (100 to 110ºF)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Biga Starter:</strong> Choose a large bowl that’s about five times the volume of the ingredients. Mix the flour, yeast, and water in the bowl until well combined. Cover loosely with plastic wrap and let rise at room temperature for 12 hours, or until almost tripled in volume. Now, it’s ready to use. (Keep the timing in mind. If you plan to bake bread in the morning, get the starter going early the night before.)</p>\n\n<p>When making bread daily, store the starter at room temperature and feed three times a day. If baking less frequently, store it in the refrigerator and feed every other week. To feed the starter, scoop out 2 cups (bake with it, give it away, or trash it) and replace it with 2 cups high-protein flour and 2 cups warm water (100 to 110ºF), stirring until blended. Most of the bread recipes in this book call for 1 to 2 cups of starter, so you can use that amount to bake with, then replace it with a 50-50 mix of flour and water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Napoletana Pizza Dough:</strong> Put the flour, starter, and water in the bowl of a stand mixer. Crumble in the yeast.Using the dough hook, mix on low speed until everything is moist, about 4 minutes, scraping the bowl as needed with a rubber spatula. Increase the mixer speed to medium and mix until the dough clings to the dough hook, about 3 minutes more. Add the salt and mix until the dough is very soft and stretchy, another 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the dough in an oiled bowl, turning to coat it with oil. Cover with plastic wrap and set in a warm spot (90ºF) until doubled in size, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough into 4 or 5 equal pieces and roll into balls (about the size of a small cantaloupe) on an unfloured board. Put the balls in an airtight container, cover, and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> To roll out each ball of dough, remove the dough from the refrigerator about 1 hour before using. It will stretch more easily when it’s warm. Flatten the ball on a floured work surface, then hold the disk in your hands in the air and circle your fingers around the edge, pinching gently around the edge to make a border. It’s easier to start stretching pizza dough in the air instead of on a work surface, because in the air gravity will pull down the dough, stretching it from where it’s held in your fingers. Once it’s stretched to about 8 inches in diameter, put the dough on the counter and pat it out with your fingertips from the center toward the edge to fully stretch the round of dough. Gently push your palms into the center of the dough to gently stretch it away toward to the edges. Pat and stretch to a round about 12 inches in diameter and a little more than a 1/4 inch thick, with a thicker rim. Top and bake as you like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the pizza:</strong> Remove all but the bottom rack in your oven and put a baking stone on the rack. Preheat the oven to 500ºF for at least 30 minutes. If you have convection, turn it on to help brown and blister the top of the pizza.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough round on a well-floured rimless baking sheet. Arrange a few slices of mortadella over the dough. Scatter the Parmesan and mozzarella over the mortadella. Slide the pizza onto the hot stone and bake until the cheese melts and the crust is golden brown, 5 to 7 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, buzz the pistachios and oil in a food processor until the nuts are coarsely chopped, about a minute.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pizza to a cutting board and drizzle with about 1 1/2 tablespoons of the pistachio mixture (save the rest for another use). Cut into wedges.</p>"}]}