{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20111230-185639-key-lime-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["citrus", "cream pies", "key lime", "lime", "pie", "winter desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Key Lime Pie", "link": "https://www.seriouseats.com/recipes/2012/01/classic-fresh-key-lime-pie-recipe.html", "description": "This is a simple and great version of a classic key lime pie. Since the ingredients are few, make each one count by using real, fresh key limes for a pure and tangy flavor.", "totalTime": "6 hours", "recipeYield": "serves 8 people", "recipeCategory": ["Lime", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["10 whole graham crackers", "1/2 teaspoon kosher salt", "3 tablespoons granulated sugar", "2.5 ounces melted butter, cooled", "14 ounces sweetened condensed milk", "4 egg yolks", "4 ounces freshly squeezed key lime juice (from approximately 20 key limes)", "1 tablespoon key lime zest, plus more for decoration", "6 ounces heavy cream", "2 tablespoons confectioner's sugar", "1/4 cup mascarpone cheese (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F. Place the graham crackers in the bowl of a food processor with the salt and sugar. Process for approximately 30 seconds, until the grahams are uniform, small crumbs. Add the melted butter and pulse until incorporated. Press the mixture into the bottom and sides of the springform pan (the sides of the crust should only be about 1 1/2 inches). Chill the crust in the fridge for 15 minutes, then bake for 10. Allow the crust to cool completely. Lower the oven to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of the food processor, combine the sweetened condensed milk, egg yolks, key lime juice, and zest. run the processor for 10 seconds, then stop, scrape down the sides, and run again for another 10 seconds. Scrape the mixture into the bottom of the cooled crust. Bake at 325&deg;F for 14 to 17 minutes, until it is firm but still jiggles in the center (watch it closely, this pie will set up very quickly). Allow it to cool to room temperature, then place the pie in the fridge to chill down completely, for at least four hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, release the sides of the springform pan and remove. Combine heavy cream and confectioner's sugar in a bowl and whip with a whisk (this may also be done in a stand mixer fitted with a whisk attachment) until the mixture reaches a medium peak. If using, add the mascarpone and whisk until smooth and thick. Pipe or top the pie with the cream mixture and sprinkle the top with key lime zest. Serve immediately.</p>"}]}