{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120508-chichis-chinese-dry-fried-pork-3.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "dry-fried pork", "pork", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dry-Fried Pork with Zucchini", "link": "https://www.seriouseats.com/recipes/2012/05/dry-fried-chicken-with-zucchini.html", "description": "About the author: Chichi Wang took her degree in philosophy, but decided that writing about food would be much more fun than writing about Plato. She firmly believes in all things offal, the importance of reading great books, and the...", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Pork", "Stir Frying", "Zucchini"], "recipeIngredient": ["5 tablespoons peanut or vegetable oil", "1 medium-sized zucchini, about 8 ounces, split in half lengthwise and cut into 1/4-inch slices", "1 pound thinly sliced country-style pork spare ribs or sirloin cutlets", "8 to 12 dried Chinese red chilis", "3 scallions cut into 1-inch segments", "1 1/2 teaspoons whole sichuan peppercorns", "2 tablespoons Sichuan chili bean paste", "1 1/2 tablespoons Shaoxing rice wine, sherry, or vermouth", "1 teaspoon soy sauce", "Kosher salt", "2 teaspoons sesame oil, chili oil, or a combination"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the wok over high heat until lightly smoking. Add 1 tablespoon oil and swirl to coat.  Add the zucchini and stir-fry until the vegetable is tender but not mushy, 3 to 4 minutes.  Remove from the wok and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining four tablespoons oil to wok and place over high heat. Add the pork and stir-fry until the meat has lost much of its moisture and is stringy around the edges, 5 to 8 minutes (reduce heat if pork or oil is smoking excessively).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pour off all but two tablespoons of the oil in the wok.  Reduce the heat to medium-low. Add the chilis, scallions, and Sichuan peppercorns, and stir-fry until they begin to release their fragrance, about 20 seconds.  Add the chili bean paste and stir-fry vigorously to coat the meat, about 20 seconds longer.  Add the rice wine and soy sauce. Add salt to taste, about 1/2 teaspoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keep stirring the pork over medium-low heat, until the surface of the meat is dry and browned but the interior is still tender, about 5 more minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the zucchini to the pan and stir fry until vegetables are coated in seasonings, about 1 minute. Remove from the heat, stir in the oil(s), and serve immediately.  </p>"}]}