{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120424-carrots-barley-ramps-spinach-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barley", "carrot", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange-Glazed Carrots With Ramp Barley and Spinach", "link": "https://www.seriouseats.com/recipes/2012/05/orange-glazed-carrots-with-ramp-barley-and-spinach-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: If ramps are unavailable, substitute with 4 sliced scallions and 2 minced cloves garlic. About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science...", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Vegetarian"], "recipeIngredient": ["1 cup pearled barley", "Kosher salt", "1 1/2 pounds carrots, peeled and cut into 1-inch segments on a bias", "1 tablespoon sugar", "2 tablespoons unsalted butter (divided)", "1/2 cup freshly squeezed juice and 1 teaspoon zest from 1 orange", "about 10 ramps, cleaned, trimmed, and finely sliced (about 2 cups sliced ramps, see note)", "6 ounces baby spinach", "2 tablespoons finely minced fresh parsley leaves", "Freshly ground black pepper", "1/2 cup toasted slivered almonds", "Extra-virgin olive oil for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add barley to a medium saucepan. Cover with 6 cups of water. Add 1 teaspoon salt and bring to a boil over high heat. Reduce to a simmer and cook until barley is just tender, about 30 minutes. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While barley cooks, place carrots in a large saucepan or skillet. Add 1/2 teaspoon salt, sugar, 1 tablespoon butter, and orange juice and zest. Add enough water cover by 1/2-inch. Set over high heat and bring to a boil. Reduce to a rapid simmer and cook, shaking pan occasionally, until carrots are completely tender and liquid has reduced to a saucy glaze, about 20 minutes. Season to taste with more salt and remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain barley well. Heat remaining tablespoon butter in a large skillet over medium-high until foaming subsides. Add ramps and cook, stirring constantly until fragrant and lightly tenderized, about 1 1/2 minutes. Add spinach and 2 tablespoons water. Cook, stirring constantly until spinach is wilted. Add barley and toss to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, transfer barley to a large plate. Reheat carrots, adding a tablespoon of water if sauce has broken and swirling until it comes together. Season carrots to taste with salt and pepper. Add parsley and toss to combine. Pour carrots and sauce over barley. Sprinkle with toasted almonds and drizzle with extra-virgin olive oil. Serve immediately.</p>"}]}