{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120125cinnpop610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["breakfast", "brown sugar", "cinnamon", "gluten free", "Pop Tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Brown Sugar Cinnamon Pop-Tarts", "link": "https://www.seriouseats.com/recipes/2012/02/bravetart-how-to-make-brown-sugar-cinnamon-pop-tarts-at-home-recipe.html", "description": "These Pop-Tarts boast everything you remember about the originals and even newcomers like me can appreciate their warm, spicy-sweet flavor. Frosting lovers will enjoy their irresistibly lickable icing while purists can opt to go <em>au naturel</em>. The real question is: will you butter yours?", "totalTime": "12 hours", "recipeYield": "makes 12 Pop-Tarts", "recipeCategory": ["Breakfast Sweets", "Dairy-Free", "Gluten-Free", "Mother's Day", "Pastry", "Vegan"], "recipeIngredient": ["<strong>For the Tart Dough:</strong>", "8 ounces cold butter, cubed (use shortening for vegan)", "10 ounces all purpose flour", "1 teaspoon salt", "6 ounces corn syrup ", " ", "<strong>For the Brown Sugar Cinnamon Filling:</strong>", "3 ounces fresh bread crumbs", "1 ounce unsalted butter, melted (use shortening for vegan)", "4 ounces brown sugar", "4 teaspoons cinnamon", "2 1/2 ounces corn syrup", "1 Tablespoon vanilla extract", "1/2 teaspoon salt", " ", "<strong>For the Frosting:</strong>", "12 ounces powdered sugar", "2 egg whites or 2 ounces corn syrup", "1/2 teaspoon salt", "2 teaspoons vanilla", "Cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the tart dough: With your fingers, cut butter into flour, along with salt, until reduced to pea sized lumps. Add corn syrup all at once and mix with a fork until it forms a ball. Dust your hands with a little flour, scoop out the dough, and knead lightly until smooth.</p>\r\n\r\n<p>Flatten dough into a squarish shape, wrap in plastic, and chill at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the filling: </p>\r\n\r\n<p>Put the breadcrumbs in a bowl, then drizzle with melted butter. Toss with a fork to coat. Add the remaining filling ingredients and mash together with a fork to make a paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg; F and have a parchment lined sheet pan ready. Roll the dough to a little shy of 1/4” thick. This is important. Each Pop-Tart will ultimately have 4 “layers” (pastry + filling + pastry + icing), so pay close attention to the thickness of each. If you don’t, you may wind up with massively thick Pop-Tarts. Click <a href=\"http://www.seriouseats.com/recipes/2011/09/homemade-pop-tarts-recipe.html\" target=\"_blank\">here</a> to see step-by-step photos of the cutting/assembly process.</p>\r\n\r\n<p>Take the chilled squarish lump of dough and set it onto a surface dusted in sifted powdered sugar. Roll the dough evenly both left-and-right and up-and-down, but don’t roll diagonally! This will preserve the square shape and minimize re-rolling. Lift and move the dough periodically to make certain it hasn’t stuck, dusting underneath as needed. (If you discover a patch is stuck, slide an offset metal spatula between the dough and the counter to loosen. Pull back the dough and dust the patch with powdered sugar.)</p>\r\n\r\n<p>Once the dough has reached about a 1/4” thickness and an overall square shape, use a ruler to cut it into a series of 3 1/8” wide strips. Cut each strip at 4 inch intervals. Gather up any remaining scraps, roll, and cut likewise until you have 24 pieces all together.</p>\r\n\r\n<p>On half of the pieces, place about a tablespoon of prepared filling. Use your fingers to scatter the filling into a rectangular shape, leaving a 1/4\" margin all around the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To seal and bake the tarts: </p>\r\n\r\n<p>Cover each filled tart with a plain dough piece. Use your fingers or the heel of a bench knife to smooth the dough over the filling and to gently press out any air pockets.</p>\r\n\r\n<p>Use the handle of a bench knife, the handle of a wooden spoon, or the side of your hand to gently seal the dough along all four sides of each tart. Do not use a fork to crimp the edges; have you ever seen a Pop Tart before? No crimping.</p>\r\n\r\n<p>Once you’ve smoothly sealed the edges of the Pop-Tart, carefully prick the surface with a fork.</p>\r\n\r\n<p>Use a bench knife or spatula to transfer the Pop-Tarts to a parchment lined cookie sheet. Bake for about 20 minutes, until barely beginning to take on some color. You don’t want them “golden brown” by any means, real Pop-Tarts look downright anemic (and, in fact the one pictured at the top is slightly overdone).</p>\r\n\r\n<p>Occasionally, a Pop-Tart or two will spread somewhat irregularly during baking. While they’re still warm from the oven, you can trim the edges quite easily with a bench scraper, knife or pizza cutter. Cool thoroughly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the frosting and finish the tarts: </p>\r\n\r\n<p>Use a clean towel or dry pastry brush to dust off the cooled Pop-Tarts, removing any stray crumbs.</p>\r\n\r\n<p>Combine all of the icing ingredients in a bowl and mix until a smooth paste forms. Put some of the icing into a piping bag fitted with a small, plain tip. Pipe a boarder of icing around the perimeter of each tart, leaving about a 1/4” margin.</p>\r\n\r\n<p>Thin the remaining icing, a tablespoon of water at a time, until it reaches a pourable consistency. Pour a tablespoon of icing onto each tart and use the tip of a metal spatula or spoon to help it reach all of the corners. Pop-Tarts only have a thin smear of icing on top, so take care not to overdo it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Aging the Pop-Tarts: </p>\r\n\r\n<p>Transfer the tarts to a baking sheet and store them in a cool, dry location where they will be undisturbed (the inside an empty microwave works perfectly). Let the Pop-Tarts dry, uncovered, overnight. This will significantly improve their texture.</p>\r\n\r\n<p>Store in an airtight container, about two weeks at room temperature. The Pop-Tarts will, in fact, get better with age. </p>"}]}