{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120308-195838-beef-tibs-primary-2.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "African", "keywords": ["African", "beef", "berbere", "ethiopian", "mains", "Spice Hunting", "spices", "tibs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Beef Tibs", "link": "https://www.seriouseats.com/recipes/2012/03/beef-tibs-berbere-ethiopian-african-recipe.html", "description": "The sauce in this dish gets its kick from <a href=\"http://www.seriouseats.com/2012/03/spice-hunting-berbere-ethiopian-chili-powder-african-cuisine\">berbere</a>, an Ethiopian chili powder fragrant with cardamom, fenugreek, and clove. Use it once and you'll see why a good chunk of Ethiopian cuisine is built on it.", "totalTime": "45 minutes", "recipeYield": "serves 2 to 3", "recipeCategory": ["African", "Beef", "Mains"], "recipeIngredient": ["5 tablespoons <a href=\"http://www.seriouseats.com/recipes/2010/07/niter-kibbeh-recipe.html\">niter kibbeh</a>, or plain unsalted butter", "2 medium onions, chopped medium (about 2 cups)", "3 inch knob ginger, minced, about 2 tablespoons", "6 medium cloves garlic, minced, about 2 tablespoons", "2 tablespoons berbere (see note)", "Kosher salt", "1 pound beef sirloin, cut into 1-inch cubes, trimmed of excess fat and connective tissue", "1 teaspoon vegetable oil", "1 teaspoon lemon juice, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt niter kibbeh or butter in a heavy saucepan on medium heat, then add onions, ginger, garlic, and berbere. Reduce heat to medium-low and cook, stirring occasionally, until onions are dark, ruddy, and golden, about 30 minutes. Onions should be at a low sizzle during cooking process. Adjust heat accordingly. Transfer to food processor and blend until not quite a pur&eacute;e. Return to saucepan, season to taste with salt, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season beef on all sides generously with kosher salt. Heat oil in a 12-inch cast iron or stainless steel skillet over high heat high until lightly smoking. Add beef in a single layer, leaving plenty of open space in the pan (brown in batches if you don't have a large enough skillet). Cook without moving until well-seared on one side, about 3 minutes. Flip meat cubes with tongs and cook on second side until well seared. Continue to cook meat, stirring and flipping occasionally until desired level of doneness is reached. For rare meat, transfer to saucepan immediately. For medium, cook an additional one to two minutes before transferring to saucepan. For well done, cook up to five more minutes before transferring to saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss beef with warm sauce, stir in lemon juice, and serve immediately.</p>"}]}