{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121127-carne-adovada-pork-chili-stew-20.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["carne adovada", "cinco de mayo", "low carb", "New Mexico", "pork", "taco", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7727272727273", "ratingCount": "22"}, "name": "Carne Adovada (New Mexico-Style Pork With Red Chilies)", "link": "https://www.seriouseats.com/recipes/2012/12/carne-adovada-adobada-chili-braised-pork-recipe.html", "description": "Tender chunks of pork shoulder braised in a chili-based liquid. Perfect for tacos or burrito fillings.", "totalTime": "2 hours 45 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Chili", "Mains", "Mexican", "Pork", "The Food Lab"], "recipeIngredient": ["4 whole dried ancho chilies, seeds and stems removed", "4 whole dried pasilla chilies, seeds and stems removed", "1 quart (32 ounces) homemade or store-bought low-sodium chicken stock", "1/2 cup raisins", "1 cup frozen orange juice concentrate", "3 whole chipotle chilies canned in adobo", "2 tablespoons white vinegar", "2 tablespoons Asian fish sauce", "3 pounds boneless pork shoulder, trimmed and cut into 2-inch thick steaks", "2 tablespoons vegetable oil", "2 medium onions, thinly sliced (about 2 cups)", "6 medium cloves garlic, minced (about 2 tablespoons)", "2 teaspoons dried oregano", "1 tablespoon ground cumin", "3 bay leaves", "Kosher salt", "Corn tortillas, cilantro, diced onions, lime wedges, and queso fresco for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke.  Add chicken stock, raisins, orange juice concentrate, chipotles in adobo, white vinegar, and fish sauce. Bring to a boil over high heat, reduce to a bare simmer, and let cook until chilies are totally softened, about 15 minutes. Blend into a smooth puree using an immersion blender or by transferring to a countertop blender. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pat pork dry with paper towels or a clean kitchen towel. Heat vegetable oil in a large heavy-bottomed Dutch oven over high heat until smoking. Add pork all at once and spread evenly over bottom surface (it's ok if not all the pork is touching the bottom or if the pan is crowded. Cook without moving until bottom surface is well browned, about 8 minutes. Transfer pork to a cutting board and set aside. Add onions and garlic to Dutch oven and cook, stirring frequently, until onions and garlic are softened and beginning to brown, about 10 minutes. Add oregano and cumin and cook, stirring constantly, until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chili mixture to Dutch oven and stir to scrape up any browned bits from the bottom. Dice pork into 2-inch chunks, then return to Dutch oven. Add bay leaves. Bring to a boil then reduce to a bare simmer. Cover, leaving lid slightly ajar, and cook, stirring occasionally until pork chunks break apart when you apply pressure with a spoon, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sauce should be thick, with an almost ketchup-like consistency. If too thin, increase heat to a light simmer and cook, stirring frequently, until reduced to the desired consistency. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve pork with corn tortillas, cilantro, diced onions, lime wedges, and queso fresco. Pork can be stored in a sealed container in the fridge for up to 5 days.</p>"}]}