{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120326-198433-eggfooyoung.jpeg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cadbury creme eggs", "Cakespy", "egg foo young"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cadbury Creme Egg Foo Young", "link": "https://www.seriouseats.com/recipes/2012/03/cadbury-creme-egg-foo-young-recipe.html", "description": "Taking visual inspiration from the Chinese takeout staple, this trompe l'oeil sweet starts by frying pancakes studded with Cadbury Creme Egg pieces, which are then topped with melty peanut butter \"gravy\" and served atop a bed of rice pudding.", "totalTime": "16 minutes", "recipeYield": "serves 3", "recipeCategory": ["Candy", "Desserts"], "recipeIngredient": ["2 Cadbury Creme Eggs", "1 egg, beaten", "1/4 cup flour ", "1/2 cup shredded sweetened coconut, tinted green with 2 drops food coloring, divided", "2 tablespoons butter ", "3 tablespoons creamy peanut butter", "1 1/2 cups rice pudding, for serving ", "Sprinkles, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the Cadbury Creme eggs into coarse chunks. Set to the side. Note: This may be slightly easier to do without making a gooey mess if you chill the eggs in the freezer for about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the egg and flour until you have a thick batter. Add the chopped Creme Egg pieces and 2 tablespoons of the green tinted coconut. This will be a very thick batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the 2 tablespoons of butter over medium-high heat in a medium saucepan. Once it is lightly bubbling, spoon the batter by heaping spoonfuls into into the pan. The batter should be sufficient to form three pancakes about 3 inches in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the first side until lightly browned, 2 to 3 minutes. Flip pancakes and fry until second side is browned, about 1 to 2 minutes longer. Transfer pancakes to a paper towel-lined plate to blot excess butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon 1/2 cup of rice pudding onto each of three serving plates and place one of your pancakes on top. Microwave peanut butter on high heat for 10 seconds until softened then spoon on top of pancakes. Garnish with the remaining coconut and sprinkles, if desired. Serve immediately.</p>"}]}