{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120204-191375-beet-salad-with-onions-and-feta.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["beets", "Bi-Rite Market's Eat Good Food", "Cook the Book", "Dabney Gough", "feta", "salad", "Sam Mogannam"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bi-Rite Market's Roasted Beet Salad\u2028 with Pickled Onions and Feta", "link": "https://www.seriouseats.com/recipes/2012/02/bi-rite-markets-roasted-beet-salad-with-pickled-onions-feta.html", "description": "The flavors in this beet salad are bigger, bolder, and infinitely more exciting than the average beet and goat cheese combo.  Tart, crunchy pickled red onions and salty feta are tossed with steamed beets, a honey dijon vinaigrette, and parsley.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6Â ", "recipeCategory": ["Cook the Book", "Salads", "Vegetarian"], "recipeIngredient": ["1/4 small red onion, thinly sliced lengthwise", "3 tablespoons champagne vinegar", "Kosher salt", "1 1/2 pounds (about 5 medium) beets", "1 tablespoon extra-virgin olive oil", "1/4 teaspoon Dijon mustard", "1/4 teaspoon honey ", "2 tablespoons chopped fresh parsley", "2 ounces feta cheese, crumbled (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the onion, vinegar, and a couple of pinches of salt in a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using baby beets, leave the skin on but halve or quarter them as needed so that they’re all about 1 inch thick. If using medium or large beets, peel and cut into 1-inch chunks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit a steamer basket in a large pot, add water just to the bottom of the basket, and arrange the beets in a snug single layer. Bring the water to a boil over medium-high heat, cover the pot, and reduce the heat to maintain a vigorous simmer. Cook until the beets are completely tender when pierced with a skewer, about 30 minutes. (Keep an eye on the water level during cooking, and add more if it threatens to dry up.) Remove from the heat and let cool. If you’re using baby beets, slip the skins off as soon as they’re cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserving the liquid, remove the onion from the vinegar and add to the beets. In another bowl, whisk together the oil, mustard, honey, 1 tablespoon of the reserved vinegar, and a few big pinches of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the dressing, the parsley, and all but 2 tablespoons of the feta to the beets. Toss well and taste; season with more salt or vinegar as needed. Garnish with a sprinkling of the remaining feta on top.</p>\n\n<p><strong>Note:</strong> The beautiful hue of beets will stain your hands and clothes. Wear gloves and an apron if pink isn’t your color!</p>\n\n<p><strong>Tip:</strong> Use any color beets you have available; if you choose to use both golden and red beets, toss them with the dressing separately to keep the red beets from staining the yellow ones.</p>"}]}