{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121206-232672-holiday-eclairs-chocolate-peppermint-ganache.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["chocolate", "Christmas", "eclairs", "ganache", "pastry", "peppermint"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Holiday Eclairs with Chocolate Peppermint Ganache", "link": "https://www.seriouseats.com/recipes/2012/12/holiday-eclairs-with-chocolate-peppermint-ganche-recipe.html", "description": "These decadent pastries will make a perfect addition to your holiday dessert table. A hint of mint makes for a surprising&mdash;and delicious&mdash;twist.", "totalTime": "90 minutes", "recipeYield": "8 to 12 eclairs", "recipeCategory": ["Pastry"], "recipeIngredient": ["<strong>For the Pastry</strong>", "1/2 cup butter, cut into 1-inch slices", "1 cup water", "2 teaspoons sugar", "1/4 teaspoon salt", "1 cup flour", "4 large eggs", "&nbsp", "<strong>For the Pastry Cream</strong>", "2 cups whole milk", "4 egg yolks", "2 tablespoons flour", "2 tablespoons cornstarch", "6 tablespoons sugar", "1/4 teaspoon salt", "1 tablespoon unsalted butter, softened, cut into chunks", "1 teaspoon vanilla", "&nbsp", "<strong>For the Chocolate Mint Ganache</strong>", "12 ounces semisweet chocolate, chopped finely, use 12 ounces of chips", "1 cup heavy whipping cream", "2 tablespoons unsalted butter", "2 teaspoons mint extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pastry</strong>: Center two racks in the middle of the oven and preheat to 425 degrees. Line 2 baking sheets with parchment paper. Prepare a pastry bag with a large, round tip. If you don't have a pastry bag, a zip-top bag with a corner snipped off will work just fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter, water, sugar, and salt in a pot and bring to boil over medium heat. Sprinkle in the flour and stir quickly with a wooden spoon. Stirring constantly, cook the dough for about 2 minutes, or until the dough forms a ball and pulls away from the sides of the pan and there is no more water pooled at the bottom. Remove from heat and let sit for 2 minutes, stirring four or five times to keep the dough from sticking to the bottom of the hot pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a large bowl. Using an electric mixer, beat in the eggs one at a time. After all eggs are added, keep beating until the dough is a uniform consistency; it should be sticky and form soft peaks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the dough into a pastry bag or large zip-top bag with a big corner snipped off. Pipe the dough onto the prepared baking sheet in 6-inch long strips, about the width and length of an Italian sausage. Make sure to leave 2-inchs of space between the pastries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the baking sheet into the oven and bake for 15 minutes, then reduce the heat to 375 degrees and bake for another 30 minutes, or until pastries puff up and are a gorgeous golden color. Let cool completely on the baking sheet. Once completely cool, cut the eclairs in half length-wise using a serrated bread knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pastries are cooling, prepare pastry cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pastry Cream</strong>: In a heavy-bottomed 3-quart pot, whisk the milk and egg yolks together. Set aside. In a small bowl, sift together the flour, cornstarch, sugar, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pot of milk and yolks over medium flame, heating just until bubbles form around the edges and the surface starts to steam. Sprinkle in the flour mixture, whisking quickly to break up any lumps. Bring the pastry cream just to a boil, stirring constantly, and reduce heat to low. Cook until the cream thickens and heavily coats the back of a spoon. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the butter and vanilla, mixing until fully incorporated. Let pastry cream cool completely before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Mint Ganache</strong>: Pour chocolate into a metal mixing bowl. Find a pot large enough to comfortably accommodate the metal mixing bowl without the whole bowl dropping inside. Set the bowl with the chocolate aside. Fill the empty pot halfway with water and set over medium heat to boil. Once the water is at a boil, reduce flame to low so that the water stays hot without boiling away.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add whipping cream, butter and mint extract to a small saucepan over medium heat. Whisking constantly, heat the cream to just about boiling, but don’t let it actually come to a boil. You should see bubbles forming around the edges of the pot. If you’re using a thermometer, the temperature of the cream should be about 180 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the bowl of chocolate into the pot of boiling water, creating a double boiler. Immediately pour hot cream over chopped chocolate and whisk until completely smooth. Remove chocolate from heat and allow to cool for a 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Constructing the Eclairs</strong>: Remove the top half of the eclairs and spoon pastry cream into the bottom portion of the puff pastry. Replace the top and set the pastries on a cooling rack with a piece of foil spread underneath. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the eclairs with warm ganache, scooping up any extra icing from the foil and pouring it back into the bowl. If the ganache begins to harden, set it back over the double boiler and stir until it warms up and loosen a bit. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To decorate, sprinkle the drizzled eclairs with crushed candy canes, colored sugar, or other festive sprinkles.</p>"}]}