{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/05022012-203470-british-bites-smoked-salmon-dill-tea-sandwiches-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british", "british bites", "cream cheese", "salmon", "sandwich", "tea sandwiches"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoked Salmon and Dill Tea Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/05/smoked-salmon-and-dill-tea-sandwiches.html", "description": "Throughout Britain and many of its colonies, tea is often served in the mid-afternoon as a quick bite between the midday and evening meal.  Tea sandwiches as well as pastries, breads, butter, jams and small confections are served.  Traditionally tea sandwiches are cold, two-bite sandwiches; some of the most common are egg salad, watercress, and smoked salmon.  This version of the classic salmon tea sandwich uses a cream cheese with dill along with some red onion to brighten up the sandwich.", "totalTime": "15 minutes", "recipeYield": "makes 4 tea sandwiches", "recipeCategory": ["Salmon", "Sandwiches"], "recipeIngredient": ["8 ounces cream cheese", "2 tablespoons finely chopped fresh dill", "1/2 lemon", "Kosher salt and freshly ground black pepper", "1/2 loaf whole wheat sandwich bread (8 slices)", "1/2 loaf white sandwich bread (8 slices)", "8 ounces smoked salmon", "1/2 red onion, minced (about 1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together cream cheese and dill, add lemon juice to taste, then season to taste with salt and pepper.  Remove crust from sliced bread and, using a rolling pin, gently flatten each slice of bread.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take 4 slices of the flattened whole wheat bread and spread with a quarter of the cream cheese mixture. Cover with 4 slices of white bread. Spread with another quarter of cream cheese mixture. Divide smoked salmon and onions evenly between the four sandwiches. Spread another quarter of the cream cheese mixture on remaining white bread and place cream cheese side down on top of salmon. Spread with remaining cream cheese mixture and top with remaining whole wheat bread. Slice into quarters on the diagonal and serve.</p>"}]}