{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120423-201999-torte1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "cinco de mayo", "tortes", "tortilla torte", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tortilla Torte", "link": "https://www.seriouseats.com/recipes/2012/04/chocolate-sour-cream-tortilla-torte-recipe.html", "description": "Composed of tortillas stacked chocolate cream filling and topped with a billow of fluffy white frosting, this torte visually resembles fancy stacked sponge cakes, but ultimately makes for a very different dessert experience. The tortillas take a bit of getting used to--they will remain lightly chewy even when the chocolate has had a chance to set--but the taste sensation is unlike any other dessert I've ever tried, with the floury taste of the tortillas mixing quite pleasantly with the rich chocolate-sour cream filling (which is also great by the spoonful) and the complementary tangy sweetness of the sour cream frosting.", "totalTime": "3 hours", "recipeYield": "serves 8", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["1 package (12 ounces) semisweet chocolate pieces", "4 cups (32 ounces) sour cream, divided", "10 (7-inch) flour tortillas", "3/4 cup (about 6 ounces) confectioners' sugar, sifted", "chocolate curls or sprinkles, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan or double boiler, melt chocolate pieces over low heat, stirring occasionally. Stir in 2 cups sour cream. Remove from heat and cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one tortilla on your serving plate. Spread about 1/3 cup of the chocolate mixture atop. Repeat with eight of the remaining tortillas and the remaining chocolate mixture. Top with the last tortilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the assembled torte in the refrigerator and let chill until quite solid, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir together the remaining sour cream and confectioners' sugar. Spread on the top and sides of the torte. Cover and chill for 3 hours or overnight before serving.</p>"}]}