{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121203-232082-cook-the-book-olive-oil-fried-eggs-crown-of-herbs.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Adam Roberts", "Alice Waters", "Cook the Book", "egg", "Secrets of the Best Chefs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Alice Waters' Olive Oil Fried Eggs with A Crown of Herbs", "link": "https://www.seriouseats.com/recipes/2012/12/alice-waters-olive-oil-fried-eggs-with-a-crow.html", "description": "<strong><a href=\"http://www.chezpanisse.com/about/alice-waters/\">Alice Waters</a></strong> has built her reputation on simply prepared, fresher-than-fresh produce-based <a href=\"http://www.chezpanisse.com/\">California cuisine</a>. When <strong><a href=\"http://www.amateurgourmet.com/about\">Adam Roberts</a></strong> visited her in Berkeley while writing his <em><a href=\"http://www.amazon.com/Secrets-Best-Chefs-Techniques-Americas/dp/1579654398/?tag=serieats-20\">Secrets of the Best Chefs</a></em>, she spoke of salads and cheese tacos; but it was her <strong>Olive Oil Fried Eggs with a Crown of Herbs</strong> that left the greatest impression. She gently fries up to six eggs at a time in an ample pool of olive oil showered with upwards of half a cup of chopped herbs. The eggs turn a bit crisp on the bottom, but stay velvety on top--crusty, garlic rubbed bread is all that's needed to accompany the simple dish.", "totalTime": "20 minutes", "recipeYield": "serves 2 to 3", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Eggs"], "recipeIngredient": ["A combination of herbs and greens, whatever you have on hand", "6 large organic eggs, preferably from the farmer’s market", "Olive oil", "Kosher salt and freshly ground black pepper", "Good-quality sourdough or whole wheat bread, sliced", "1 clove garlic, peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the greens and herbs with a sharp knife until they’re fragrant little flecks (you want at least 1/4 cup). Set them aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack all the eggs into a bowl, being careful not to break the yolks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour out enough olive oil to coat the bottom of a 9-inch cast-iron skillet (a nonstick pan will work here too). You want a good layer of oil (about 1/4 cup). Turn up the heat to medium and when the oil starts to feel hot, pour in the eggs. Sprinkle on salt and pepper and then crown all the eggs with the herbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the eggs are cooking, toast the bread in a toaster, in a toaster oven, or under the broiler. When it’s good and toasty, rub each piece with garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the eggs are just starting to firm up on top but the yolks are still soft, after 1 to 2 minutes, turn off the heat and cover the pan. The residual heat will finish cooking the whites on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, top each piece of garlic-rubbed bread with an egg and some of the oil from the pan. Don’t eat it with a fork and knife; use your hands! Just don’t get yolk on your shirt.</p>"}]}