{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120710-213655-knead-book-gullah-biscuits.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["biscuits", "bread", "bread baking", "knead the book", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gullah Biscuits", "link": "https://www.seriouseats.com/recipes/2012/07/gullah-biscuits-baking-recipe.html", "description": "[Photograph: Donna Currie] As always with our Knead the Book feature, we have five (5) copies of Southern Biscuits to give away this week. Enter the contest here. When I saw gullah biscuits in Southern Biscuits, they intrigued me. Not...", "totalTime": "40 minutes", "recipeYield": "Makes 12 biscuits", "recipeCategory": ["Biscuit", "Bread Baking"], "recipeIngredient": ["2 1/4 cups all-purpose flour, divided", "3 teaspoons baking powder", "1 teaspoon salt", "5 teaspoons vegetable oil", "2 large eggs", "1 1/4 cups milk or buttermilk, divided", "Butter, softened or melted, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Select the baking pan by determining if a soft or crisp exterior is desired. For a soft exterior, select a 8- or 9-inch cake pan, pizza pan, or oven-proof skillet where the biscuits will nestle together snugly, creating the soft exterior while baking. For a crisp exterior, select a baking sheet or other baking pan where the biscuits can be placed wider apart, allowing air to circulate and creating a crisper exterior, and brush the pan with butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fork-sift or whisk 2 cups of flour, baking powder, and salt in a large bowl, preferably wider than it is deep, and set aside the remaining 1/4 cup of flour. Fold in the cooking oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a deep hollow in the center of the flour with the back of your hand. Lightly beat the eggs with 1 cup of the buttermilk, reserving the remaining 1/4 cup, and pour into the hollow. Stir with a rubber spatula or large metal spoon, using broad circular strokes to quickly pull the flour into the liquid. Mix just until the dry ingredients are moistened and the sticky dough begins to pull away from the sides of the bowl. If there is some flour remaining on the bottom and sides of the bowl, stir in 1 to 4 tablespoons of reserved buttermilk, just enough to incorporate the remaining flour into the shaggy, wettish dough. If the dough is too wet, use more flour when shaping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly sprinkle a board or other clean surface using some of the reserved flour. Turn the dough out onto the board and sprinkle the top lightly with flour. With floured hands, fold the dough in half, and pat dough out into a 1/3- to 1/2-inch thick round, using a little additional flour only if needed. Flour again if necessary and fold the dough in half a second time. If the dough is still clumpy, pat and fold a third time. Pat dough out into a 1/2-inch thick round for a normal biscuit, 3/4-inch thick for a tall biscuit, and 1-inch-thick for a giant biscuit. Brush off any visible flour from the top. For each biscuit, dip a 2 1/2-inch biscuit cutter onto the reserved flour and cut out the biscuits, starting a the outside edge and cutting very close together, being careful not to twist the cutter. The scraps may be combined to make additional biscuits, although these scraps make tougher biscuits.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a metal spatula if necessary, move the biscuits to the pan or baking sheet. Bake the biscuits on the top rack of the oven for a total of 20 to 25 minutes, depending on thickness, until light golden brown. After 10 minutes, rotate the pan in the oven so that the front of the pan is now turned to the back, and check to see if the bottoms are browning too quickly. If so, slide another baking pan underneath to add insulation and retard browning. Continue baking another 10 to 15 minutes until the biscuits are light golden brown. When the biscuits are done, remove them from the oven and lightly brush the tops with butter. Turn the biscuits out upside down on a plate to cool slightly. Serve hot, right side up.</p>"}]}