{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120205-191603-dinner-tonight-mexican-pasta-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fideo (Mexican Pasta with Vegetables and Chile)", "link": "https://www.seriouseats.com/recipes/2012/02/fideo-mexican-pasta-with-vegetables-and-chile.html", "description": "...", "totalTime": "45 minuters", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Mexican", "Pasta"], "recipeIngredient": ["2 cups canola oil ", "12 ounces dried angel hair pasta nests", "1/2 white onion, diced", "2 celery stalks, diced", "2 carrots, diced ", "salt ", "black pepper", "1 jalapeño, stemmed, seeded, and diced ", "3 to 4 cups tomato sauce ", "1/2 bunch cilantro, stems discarded, leaves chopped", "1 cup grated Cotija cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a large skillet and turn the heat to medium-high. When oil starts to shimmer, add as many of the angel hair nests as will fit in one layer. Cook until each is lightly browned on the bottom, about 30 seconds. Flip and lightly brown on the other side, about another 30 seconds. When done, remove the nests and drain on paper towels. Repeat process with any remaining pasta. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all but 2 tablespoons of the oil. Also, discard any bits of pasta left in the skillet. Turn the heat to high, and when oil starts to shimmer, add the onion. Cook, stirring often, until onion is translucent, about four minutes. Add the celery, and cook, stirring often, until it lightens in color, about three minutes. Add the carrots and a pinch of salt and pepper, reduce the heat to medium-high, and cook until the carrots are tender, about five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the diced jalapeño, toasted pasta, and three cups of the tomato sauce. Bring to a boil, and then reduce the heat to maintain a simmer. Cook, stirring occasionally, for about five minutes. If pasta has absorbed all of the liquid, add a little more. The pasta will break apart into strands. Continue cooking until pasta is cooked, but still relatively firm, about three more minutes. Season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the pasta between four bowls. Top with a sprinkling of cilantro and Cotija cheese. Serve immediately. </p>"}]}