{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120204-191376-BLT-and-E.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bi-Rite Market's Eat Good Food", "Cook the Book", "Dabney Gough", "egg", "Sam Mogannam", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bi-Rite Market's BLT&amp;E with Harissa Mayo", "link": "https://www.seriouseats.com/recipes/2012/02/bi-rite-markets-blte-with-harissa-mayo.html", "description": "Eggs and bacon are an unbeatable combo much like bacon, lettuce, and tomato.  So what happens when you join the two?  Very good things.  This <strong>BLT&amp;E with Harissa Mayo</strong>, a work of sandwich genius from <em><strong><a href=\"http://www.amazon.com/Bi-Rite-Markets-Eat-Good-Food/dp/158008303X/?tag=serieats-20\">Bi-Rite Market's Eat Good Food</a></strong></em> does just that by topping an already exemplary BLT with a perfectly runny poached egg.", "totalTime": "30 minutes", "recipeYield": "Serves 2Â ", "recipeCategory": ["Bacon", "Cook the Book", "Eggs", "Sandwiches"], "recipeIngredient": ["2 tablespoons mayonnaise", "1 teaspoon harissa (see Note)", "4 slices bacon", "1 tablespoon plus 1 teaspoon cider vinegar", "2 eggs", "2/3 cup lightly packed frisee or shredded radicchio, \u2028or a mixture", "1 teaspoon minced shallot", "1/2 teaspoon extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "Four 1/2-inch slices good-quality sandwich bread, \u2028such as pain de mie", "1 small ripe tomato, thinly sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the mayonnaise and harissa in a small bowl and stir until blended. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the bacon in half crosswise, arrange in a medium skillet, and put the skillet over medium heat. Cook, turning the bacon frequently, until cooked through and crispy but still a little chewy, about 8 minutes. Transfer to a paper towel–lined plate and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring about 4 cups of water to a boil in a small saucepan. Lower the heat to a bare simmer and add \u20281 tablespoon of the vinegar. Crack an egg into a small cup or ramekin and, holding the cup just above the surface of the water, carefully pour the egg into the water. Repeat with the second egg. Cook the eggs until the whites have cooked through but the yolk is still runny, 2 to 3 minutes. (To check, carefully lift an egg out of the water with a slotted spoon. Prod the white—it should feel firm and bouncy all the way through.) With a slotted spoon, transfer the eggs to another paper towel–lined plate.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In a small bowl, combine the frisee or radicchio, the remaining 1 teaspoon vinegar, the shallot, and the olive oil. Sprinkle with a pinch of salt and pepper and toss to blend.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast or grill the bread to your liking, then spread the mayo evenly over two pieces. Top with the bacon, tomato, frisee, and egg. Sprinkle the egg with a little salt and pepper, then top with the other two pieces of bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve right away (with plenty of napkins).</p>\n\n<p><strong>Note:</strong> Harissa is a chile-and-spice paste that hails from North Africa. For a slightly different effect, you could substitute a mild Thai curry paste or other Asian chile sauce.<br />\n</p>"}]}