{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120330-199632-chilled-tofu-with-crunchy-baby-sardines.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Andrea Nguyen", "Cook the Book", "quick", "sardines", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andrea Nguyen's Chilled Tofu with Crunchy Baby Sardines", "link": "https://www.seriouseats.com/recipes/2012/04/andrea-nguyens-chilled-tofu-with-crunchy-baby-sardines.html", "description": "This <strong>Chilled Tofu with Crunchy Baby Sardines</strong> from <a href=\"http://www.vietworldkitchen.com/blog/about_andrea_nguyen.html\">Andrea Nguyen</a>'s newly released bean curd bible, <em><strong><a href=\"http://www.amazon.com/Asian-Tofu-Discover-Best-Make/dp/1607740257/?tag=serieats-20\">Asian Tofu</a></strong></em>, is all about textures.  Creamy tofu is topped with crisp fried tiny sardine, fresh shiso, and crunchy toasted sesame seeds.", "totalTime": "10 minutes", "recipeYield": "serves 4 as an appetizer", "recipeCategory": ["Cook the Book", "Fish", "Tofu"], "recipeIngredient": ["2 tablespoons canola oil", "1/4 cup dried baby sardines ", "1 pound silken tofu or medium tofu, or 2 cups tofu\u2028pudding, chilled", "4 or 5 green shiso leaves, cut into very thin strips (about 1/4 cup total) ", "1 1/2 tablespoons white sesame seeds, toasted and slightly crushed with a mortar and pestle", "High-quality Japanese soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In a small skillet, heat the oil over medium-high heat. Meanwhile, position a mesh strainer over a bowl and have this set up near the stove; you’ll use it to quickly drain the fish.</p>\r\n\r\n<p><br />\r\nThe oil is ready when you drop in a fish and it immediately sizzles. Add all the fish and gently fry, stirring constantly, for about 1 minute, until they are fragrant and crisp. During cooking, they’ll darken, then turn golden. If you like, pick up the skillet toward the end to prevent overcooking.<br />\r\nPour the contents of the skillet into the strainer. Give the strainer a good shake, then transfer the fish to a paper towel–lined plate to further drain and cool. Keep at room temperature if using within hours. Or, transfer to an airtight container and refrigerate for up to a week; return the fish to room temperature before serving.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using silken tofu, run a knife around the edge of the mold or package and invert onto a plate to unmold. Pour off the excess liquid or use a paper towel to blot it away. If using block tofu, drain it on a dishtowel or double thickness of paper towels placed atop a plate. Cut the silken or block tofu into husky 1-inch-thick dominoes or 2-inch squares. Arrange them on individual dishes or in shallow bowls. If using tofu pudding, scoop up large shards with a metal spoon, putting them into a shallow bowl or individual dishes. Before serving, pour off any whey that gathers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the tofu with some shiso and sesame seeds, and a crown of the fried fish. Serve the seasoned soy sauce on the side. If you have leftover fish, save it for a rice topping.</p>"}]}