{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120709-213358-watermeloncake.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "summer desserts", "trompe l'oeil"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Watermelon Cake", "link": "https://www.seriouseats.com/recipes/2012/07/watermelon-cake-recipe.html", "description": "Made with sour cream and boasting an achingly delicate crumb, the cake is tinted pink and then studded with mini chocolate chips for \"seeds\". The finished cake is frosted with pink and green icing to bring home the watermelon effect.", "totalTime": "2 hours, 40 minutes", "recipeYield": "makes two 9-inch single layer cakes", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["<strong>For the Cake:</strong>", "2 1/4 cups (about 5 1/2 ounces) sifted cake flour", "2 teaspoons baking powder", "1/2 teaspoon salt", "1/2 pound (2 sticks) unsalted butter, softened", "2 cups (about 14 ounces) sugar", "4 eggs, separated", "2 teaspoons vanilla ", "1 cup sour cream", "1 cup mini chocolate chips, plus 1/4 cup for garnish", "Red food coloring", " ", "<strong>For the Frosting: </strong>", "1/2 pound (2 sticks) butter, softened", "6 to 8 cups confectioners' sugar", "2 teaspoons vanilla", "1 to 2 tablespoons milk or cream", "Red and green food coloring"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350&deg;F. Grease and flour bottoms and sides of two 8 or 9-inch baking pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Sift together the flour, baking powder, and salt; set aside. Cream the butter in a large bowl with an electric mixer for about two minutes on medium speed. Add the sugar and continue to mix until light and fluffy, another 2 to 3 minutes. Add the egg yolks, one at a time, stirring to ensure that each is incorporated before adding the next.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to low and add the dry ingredients alternately with the sour cream, in 2 to 3 additions each, ensuring that each addition is fully mixed in before adding the next. Scrape down the sides of the bowl with a rubber spatula with each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, with clean beaters, beat the egg whites to soft peaks. Gently fold the whipped egg whites into the batter with a rubber spatula. Add several drops of red food coloring, mixing gently until the cake batter has a deep pink hue. Fold in the mini chocolate chips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pans and smooth with a rubber spatula. Bake in the preheated oven until the top of the cake is golden brown and a toothpick or cake tester inserted into the center comes out clean, 40 to 50 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cakes cool in the pans for 5 minutes, then turn out on to a wire rack to let cool completely. If necessary, use a serrated knife to cut the cakes to make them level.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting</strong>: In the bowl of a stand mixer fitted with a paddle attachment, cream butter until very smooth, about 3 minutes on high speed. Reduce speed to low and add about 3 cups of confectioners' sugar. Continue beating on low speed until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pause to scrape down the sides of the bowl. Add vanilla. Add remaining confectioners' sugar, bit by bit, until desired spreading consistency has been reached. If the frosting gets too thick, stir in some milk or cream to thin it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the frosting into two bowls: 2/3 of the frosting in one bowl, and 1/3 in the other. Tint 2/3 of the frosting a deep pink, to match the color of the cake as closely as you can; tint the rest of the frosting green.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost the sides of the cakes with the green frosting. Once frosted, put the cakes in the refrigerator so that the frosting can set for several minutes before proceeding to frost the tops of the cake with pink frosting. Dot the tops of the frosted cakes with mini chocolate chips to resemble watermelon seeds.</p>"}]}