{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120602-208714-cupcakepie2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "cream pies", "cupcake pie", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cupcake Cream Pie", "link": "https://www.seriouseats.com/recipes/2012/06/cupcake-cream-pie-recipe.html", "description": "As the custard sets, it absorbs some of the rich butteriness of the frosting, infusing the entire pie; as a result, the taste is kind of like cream pie meets birthday cake, in a decidedly delicious way. While some might argue that it's gilding the lily, it might interest you to know that this pie also tastes fantastic when paired with ice cream.", "totalTime": "4 hours, 20 minutes", "recipeYield": "makes 8 servings", "recipeCategory": ["Cakespy", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 (9-inch) pie crust, baked", "2 regular-sized cupcakes, or 4 mini cupcakes", "1 cup (about 7 ounces) sugar", "1/2 cup (about 2 1/2 ounces) flour", "1/4 teaspoon salt", "3 cups milk", "3 eggs, beaten", "3 tablespoons butter", "1 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the cupcakes into thin slivers, lengthwise, so that each slice has a little cake and frosting. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of the baked pie crust with cake slivers. Try to cover the bottom of the pie evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the milk, eggs, sugar, flour and salt and mix well. Bring to a boil over low heat, stirring constantly. Remove the pan from the heat, and stir in the vanilla extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the eggs lightly. Gradually stir 1 cup of the hot mixture into the yolks, and beat vigorously with a whisk (to ensure that you don't end up with scrambled eggs!). Return the egg mixture to the saucepan and bring the entire mixture to a low boil. Cook and stir for 2 minutes before removing from heat. The mixture will be rather thick, but still pourable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the filling into the prepared crust in a smooth, steady stream on top of the cupcakes. If they shift slightly, that is OK; however, if any pieces float to the top, push them back under the custard. Put the pie in the refrigerator and let set for 4 hours before serving. If desired, serve with whipped cream and / or ice cream.</p>"}]}