{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120327-198825-bread-baking-reuben-danish-slits-cut.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["cheese", "corned beef", "Danish", "pastries", "reuben", "sandwich", "sauerkraut"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Reuben Danish", "link": "https://www.seriouseats.com/recipes/2012/03/reuben-danish-sandwich-bread-recipe.html", "description": "[Photograph: Donna Currie] If you've never made pie dough or puff pastry and you're a little afraid of the recipe, let me put you at ease. If you mess up and the butter gets incorporated into the dough rather than...", "totalTime": "Up to 2 days, depending on resting time", "recipeYield": "makes 4 large Danish (about 8 servings)", "recipeCategory": ["Bread", "Bread Baking", "Cheese", "Sandwiches", "St. Patrick's Day"], "recipeIngredient": ["<strong>For the Pastry</strong>:", "1 teaspoon instant yeast", "1 1/4 cups cold water", "9 ounces (about 2 cups) medium rye flour", "4 1/2 ounces (1 cup) bread flour", "2 tablespoons vital wheat gluten", "1 teaspoon sugar", "1 teaspoon salt", "16 tablespoons (2 sticks) very cold unsalted butter", "Eggwash (1 egg, plus 1 tablespoon water, beaten together)", "1 tablespoon caraway seeds (or more as desired)", "&nbsp;", "<strong>For the Filling</strong>:", "About 1 pound cooked corned beef, thinly sliced or chopped", "About 2 cups sauerkraut, drained", "About 1/2 cup Thousand Island dressing", "About 1/2 pound Swiss cheese, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Pastry</strong>: Combine the yeast and water in a medium bowl. Stir to combine. Place the rye flour, bread flour, gluten, sugar, and salt in the bowl of your food processor. Pulse several times to combine. Cut the butter into chunks and add it to the food processor. Pulse until you have pieces about the size of a garbanzo bean. It's fine if there are some larger and smaller pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour/butter mixture to the yeast and water and mix gently until all the flour is moistened. Try not to break up the butter any more. At first the mixture might seem too dry, and after it is mixed it might seem too sticky. This is fine. Cover the bowl with a plastic bag or plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove the bowl from the refrigerator, flour your work surface generously, and turn out the dough. Flour the top of the dough and pat it into a rough square shape. Using a rolling pin, roll the dough out into a 10- by 18-inch rectangle. Flour the dough as needed to keep it from sticking to the counter and the rolling pin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly so that the butter doesn't melt, fold the dough in thirds like a business letter resulting in a 6- by 10-inch rectanble. Roll the dough out into an 18- by 10-inch rectangle again. Repeat the folding, roll again, and fold once more. (If the butter begins to get soft, refrigerate the dough for 10 minutes before proceeding). After the third roll and fold, fold the dough in half crosswise resulting in a roughly 6- by 5-inch rectangle. Flatten it a bit, wrap it in plastic, and put it in the refrigerator for at least one hour or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble and Bake:</strong> Adjust two oven racks to upper and lower-middle positions and preheat the oven to 400°F. Line 2 baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and cut the dough into 4 pieces. (If you work fast, you can leave them on the counter. Otherwise, refrigerate them until you're ready for them.) Roll the first piece into 9- by 12-inch rectangle. Layer one quarter of the corned beef, sauerkraut, Thousand Island dressing and cheese on the sandwich (use more or less of each ingredient as desired), keeping it within the center third of the dough lengthwise and leaving about an inch uncovered at each end. If you're a big fan of the Thousand Island dressing, I suggest being less generous on the sandwich and having some at the table to add as needed. If you use too much, you risk having a soggy sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, pizza cutter, or pastry cutter, make slits about an inch apart along the long ends of the dough, up to the filling. I make the cuts at an angle, but you can make the straight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold one of the uncovered ends over the filling, then begin folding the strips over the filling one at a time, alternating sides and crossing them at the top. If they look a little too short to reach, don't worry&mdash;they'll stretch. When you get to the far end, fold the end over the filling first, before you fold the final strips over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the Danish to your prepared baking sheet, cover with plastic wrap, and continue with the other three pieces of dough. Let the Danish dough rest until it feels puffy when you touch it, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap from the dough, brush with the egg wash, and sprinkle with caraway seeds. Bake at 400 degrees until the pastry is nicely browned, about 35 minutes. Remove from the oven and transfer to a wire rack to cool slightly. Serve warm.</p>"}]}