{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120926-spicy-noodle-soup-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["Asian cuisine", "chicken", "Dinner Tonight", "noodle", "quick", "soup", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "20-Minute Thai Red Curry Noodle Soup With Chicken", "link": "https://www.seriouseats.com/recipes/2012/10/20-minute-thai-red-curry-noodle-soup-with-chicken-recipe.html", "description": "This super-quick,Thai-flavored chicken and noodle soup is packed with hot, sour, salty, sweet, and aromatic flavor and goes from pantry to table in about 20 minutes.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Mains", "Noodles", "Soups and Stews", "Thai"], "recipeIngredient": ["Kosher salt", "2 teaspoons vegetable oil", "2 tablespoons Thai red curry paste", "2 quarts low-sodium store-bought or homemade chicken broth", "2 tablespoons fish sauce (plus more to taste)", "2 tablespoons sugar (plus more to taste)", "2 tablespoons fresh juice from about 2 limes (plus more to taste)", "2 small boneless skinless chicken breast halves (about 10 ounces total)", "8 ounces Thai-style rice noodles or thin spaghetti", "Handful basil, cilantro, and/or mint leaves", "Handful sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a large stock pot of salted water over high heat and bring to a boil. Meanwhile, heat oil in a large saucepan over medium-high heat until shimmering. Add curry paste and cook, pressing it into the bottom of the pan with a wooden spoon until fragrant and sizzling, about 1 minute. Whisk in chicken broth, fish sauce, sugar, and lime juice. Add chicken breast halves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow mixture to come to a simmer and cook until chicken is cooked through, about 10 minutes. Transfer chicken to a bowl and, wearing gloves or working under cold running water, tear chicken into bite-sized strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook noodles in boiling water according to package instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, divide noodles and chicken between four large bowls. Season broth to taste with more lime juice, fish sauce, sugar, and salt as desired, then pour over chicken and noodles. Divide herbs and scallions between bowl, and serve immediately with extra lime wedges.</p>"}]}