{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120427-chichi-chinese-hot-and-sour.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Cantonese-style Hot and Sour Soup", "link": "https://www.seriouseats.com/recipes/2012/04/cantonese-style-hot-and-sour-soup-recipe.html", "description": "[Photograph: Chichi Wang] Notes: Dried shiitake and wood ears can be found at most Asian grocers. You can feel free to omit one, making up the difference with more of the other. If you can't find dried mushrooms, use fresh...", "totalTime": "30 minutes", "recipeYield": "4 to 6", "recipeCategory": ["Chinese", "Soups and Stews"], "recipeIngredient": ["1 1/2 quarts low sodium store-bought or homemade chicken or vegetable stock", "4 dried shiitake mushrooms (see note)", "6 dried wood ear mushrooms (see note)", "4 to 6 ounces canned bamboo shoots, cut into thin slices", "One 1-inch piece of ginger", "A small block of firm silken tofu, about 5 ounces, cut into 1/2 inch cubes", "2 teaspoons soy sauce, or more to taste", "2 tablespoons Shaoxing rice wine", "5 tablespoons cornstarch mixed with 1/4 cup water", "3 to 4 tablespoons Chinkiang vinegar or 2 to 3 tablespoons red vinegar (see note)", "1/2 teaspoon ground white pepper or more to taste", "Chopped cilantro or green onion"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put stock in a 3- to 4-quart saucepan and set aside. Place dried mushrooms in a small bowl and cover with 3 cups of warm water, submerging all the pieces. Set aside for 15 minutes until mushrooms are reconstituted. Strain mushroom-infused liquid into the pot with the soup. Remove the tough central portion of the wood ear mushrooms and discard. Cut the wood ear and shiitake mushrooms into slivers and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the stock and mushroom-infused water to a boil over high heat, then reduce to a simmer. Add mushrooms, ginger, and bamboo. Simmer for 5 minutes. Add the tofu and simmer until the tofu is warmed through, about 4 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the soy sauce and wine to the soup and stir gently, taking care not to break up the tofu.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the cornstarch slurry in a few additions, stirring to allow the liquid to thicken before adding more. The soup should be thick and glossy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat and add the vinegar and pepper, adjusting according to your tastes. Serve immediately, garnished with scallions or cilantro. </p>"}]}