{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120713-195206-peanutbutter-pretzel-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["no-bake desserts", "peanut butter", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peanut Butter Pretzel Pie", "link": "https://www.seriouseats.com/recipes/2012/07/peanut-butter-pretzel-pie-recipe.html", "description": "When you can't stand the heat of summer, cool off with this no bake pie. There's nothing like the combination of salty and sweet, and this pie brings the two together in perfect harmony by combining creamy sweet vanilla ice cream with peanut butter and a pretzel crumb crust.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["5 ounces thin pretzel twists", "2 ounces butter, melted and cooled", "3 quarts vanilla ice cream, softened (a brand that is airy, such as Bryers or Friendly's works best)", "6 ounces smooth peanut butter, divided into 5 ounces and 1 ounce, melted until it turns to liquid", "2 ounces cold heavy cream, whipped", "Optional toppings: crushed peanut butter cups, butterfingers, pretzels, or salted peanuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, pulverize the pretzels until they are like gravel; some bigger pieces, some smaller pieces, and some sandy-textured crumbs. Add the melted butter and stir to combine. Pour the mixture into the pie plate and press it evenly against the bottom and sides to form the crust. Freeze for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl using a large spatula, stir the ice cream until it is pliable but still frozen; the consistency of soft serve. Drizzle 5 ounces of the peanut butter over it, and fold it into the ice cream. Pour the frozen mixture into the prepared shell and smooth the top so it is sightly domed. Draw a divot in the top of the dome and pour the remaining peanut butter into it. Freeze the pie for 4 hours to set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, pipe cold whipped cream around the perimeter of the pie. Sprinkle the chopped topping of your choice over the top. Serve immediately.</p>"}]}