{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121022-btb-rustic-olive-oil-cake-with-honey-syrup.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "honey", "orange", "the dahlia bakery cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Rustic Olive Oil Cake with Honey Syrup", "link": "https://www.seriouseats.com/recipes/2012/10/rustic-olive-oil-cake-with-honey-syrup-recipe.html", "description": "The grassy, earthy flavor of olive oil pairs well with notes of orange. Delicately spiced honey syrup soaks an already-moist cake. It's rustic in the best sense of the word.", "totalTime": "2 hours", "recipeYield": "makes one 9-inch cake", "recipeCategory": ["Bake the Book", "Cakes", "Desserts", "Orange"], "recipeIngredient": ["<strong>Olive Oil Cake</strong>", "vegetable oil spray, as needed for the pan", "2 cups (243 grams) all-purpose flour, plus more for the pan", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1 teaspoon kosher salt", "1 1/4 cups whole milk, at room temperature", "1/4 cup (2 ounces) Grand Marnier", "1/4 cup (2 ounces) freshly squeezed orange juice", "Grated zest of 1 lemon", "3 large eggs at room temperature", "2 cups (381 grams) sugar", "1 cup (213 grams) extra-virgin olive oil", "<strong>Honey Syrup</strong>", "1/2 cup (196 grams) honey ", "1/2 cup (127 grams) sugar", "1/2 cup water", "1 clove", "1 strip of orange or lemon zest, about 1/2 x 4 inches, cut with a vegetable peeler"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F. Spray the cake pan with vegetable oil spray. Cut a 9-inch round of parchment paper and place it in the bottom of the pan, then spray the paper. Flour the pan, shaking out the excess. Set the cake pan aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl or onto a sheet of parchment, sift together the flour, baking powder, and baking soda. Stir in the salt. Set the dry ingredients aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the milk, Grand Marnier, orange juice, and lemon zest. Set the wet ingredients aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the eggs and sugar in a large bowl and whisk by hand with a balloon whisk until well-combined and smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually add the olive oil in a steady stream while whisking the egg mixture, as if you were making a mayonnaise. Tip: Put the olive oil in a Pyrex liquid measuring cup first to make pouring easier. Also, you can make a cradle with a kitchen towel to hold your bowl steady as you whisk.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After you have emulsified the oil into the egg mixture, start adding the dry ingredients in 3 additions, alternating with the wet ingredients in 2 additions, beginning and ending with dry. As you make each addition of dry and wet ingredients, whisk by hand just until the batter is smooth, without overbeating, before adding the next. Scrape down the bowl as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan. Give the pan a couple of taps on the counter to settle any air bubbles in the batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cake until deep golden brown, slightly domed, and possibly cracked on top, about 70 minutes. A skewer should come out clean of batter but with a few moist crumbs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the oven and allow to cool on a wire rack for about 15 minutes. To unmold, run a small knife around the edges of the cake. Place a cake cardboard or a plate over the cake pan and invert the pan. THe cake should slide right out onto the cardboard. Peel off the parchment circle (from what used to be the bottom of the cake) and invert again. Remove the top board and the cake will be right side up. Allow the cake to cool on the wire rack until it is only slightly warm or at room temperature before slicing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, while the cake is baking, make the syrup. Combine the honey, sugar, water, clove and citrus zest in a small saucepan over medium-high heat. Bring to a simmer, stirring to dissolve the sugar and adjusting the heat as necessary to keep the liquid at a simmer. Simmer until reduced by almost half and as thick as a light syrup, 10 to 12 minutes. (You should have a little more than 3/4 cup of syrup.) Remove the pan from the heat and pour the syrup into a container to cool to room temperature. Remove the clove and zest from the syrup and discard. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, slice the cake and put the slices on plates. Drizzle each slice generously with honey syrup.</p>"}]}