{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121016-127677-LTE-Caramel-Cake-photo%20by%20Tara%20Striano_PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["brown butter", "cake", "caramel", "Let them eat cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Caramel Cake", "link": "https://www.seriouseats.com/recipes/2012/10/brown-butter-cake-with-caramel-sauce-recipe.html", "description": "Tender brown butter cake smothered in brown butter-sour cream caramel.", "totalTime": "2 hours, 10 minutes", "recipeYield": "Serves 12 to 16", "recipeCategory": ["Cakes", "Let Them Eat..."], "recipeIngredient": ["<strong>For the Cake</strong>:", "Baking spray", "2 sticks (8 ounces) unsalted butter, cut into 16 pieces", "2 1/4 cups (about 11 1/4 ounces) cake flour", "2 teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "1 tablespoon pure vanilla extract", "1 cup milk, at room temperature", "1 3/4 cups (about 12 1/4 ounces) granulated sugar", "3 large eggs, at room temperature", "   ", "<strong>For the Caramel</strong>    ", "2 sticks (8 ounces) unsalted butter, cut into 16 pieces", "2 cups (about 1 pound) packed dark brown sugar", "1/2 cup sour cream", "2 tablespoons of white corn syrup", "3/4 teaspoon salt", "1 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Lightly coat 13- by 9- cake pan with baking spray. Line bottom with parchment paper; coat once again with baking spray. Adjust oven rack to middle position and preheat oven to 350&deg;F.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium heavy-bottomed saucepan, melt butter over medium-low heat. Cook butter, swirling pan occasionally, until beginning to foam; as foam settles, brown bits will begin to settle at bottom of saucepan; remove butter from heat and pour into a large bowl when browning has slowed, 12 to 15 minutes total. Transfer butter to large bowl and refrigerate until solid, 45 to 60 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk flour, baking powder, baking soda, and salt together in medium bowl; reserve. Combine milk and vanilla in liquid measuring cup; reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With an electric mixer or a stand mixer fitted with a paddle attachment, beat chilled browned butter and sugar in large bowl on medium speed until light and fluffy, about 3 minutes. Add eggs, one at a time, beating well after each addition. Decrease speed to low and add flour mixture in three additions, alternating with milk mixture. Scrape bottom and sides of bowl as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan. Bake until tester inserted in center of cake comes out clean, 30 to 35 minutes. Transfer pan to cooling rack and cool 10 minutes in pan. Turn cakes out directly onto cooling rack, peel off and discard parchment, then invert onto second cooling rack set inside rimmed baking sheet so top is facing up. Cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caramel:</strong> In medium heavy-bottomed saucepan, melt butter over medium-low heat. Cook butter, swirling pan occasionally, until beginning to foam; as foam settles, brown bits will begin to settle at bottom of saucepan; when browning has slowed (12 to 15 minutes later), Immediately stir in brown sugar, corn syrup, sour cream, and salt and cook over medium-high heat until temperature registers 235&deg;F on candy thermometer, about 12 minutes. Remove from heat and stir in vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour caramel over cake, spreading into even layer with offset spatula or rubber spatula. Serve.</p>"}]}