{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120807-195206-blackberry-buttermilk-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["blackberries", "buttermilk", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blackberry Buttermilk Pie", "link": "https://www.seriouseats.com/recipes/2012/08/blackberry-buttermilk-pie-recipe.html", "description": "Blackberries present a stunning contrast against the stark white buttermilk filling of this pie. Adapted from a<a href=\"from a tart recipe by Martha Stewart\"> tart recipe by Martha Stewart</a>, the tangy filling will remind you of panna cotta and serves as the perfect backdrop for fresh fruit of all kinds.", "totalTime": "8 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "1 1/2 teaspoons unflavored, powdered gelatin", "3/4 cup heavy cream", "1/2 cup granulated sugar, divided", "1/4 teaspoon salt", "1 1/2 cups buttermilk", "1 teaspoon vanilla extract", "1 pint fresh blackberries", "1 teaspoon zest from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a golden brown, about 10 minutes. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/4 cup cold water in a small bowl and sprinkle with gelatin Allow to sit until softened, about 2 minutes. Add heavy cream, salt, and 1/4 cup sugar to a medium saucepan set over low heat, stir to combine and slowly bring the mixture to just a simmer. Once it starts to bubble on the edges, remove it from the heat and stir in the gelatin until it is completely dissolved. Stir in the buttermilk and vanilla.  Pour the mixture through a fine mesh strainer into the pie shell and chill for at least 4 hours, until the filling has set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve: In a medium bowl combine berries, remaining sugar, and zest. Toss to combine and allow to sit for ten minutes, until the berries begin to become juicy and the sugar has dissolved. Top the set pie with the berries and service immediately.</p>"}]}