{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20111231nillapile610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "butter cookies", "Cookies", "Nabisco", "Nilla Wafers", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Nilla Knockoffs", "link": "https://www.seriouseats.com/recipes/2012/01/homemade-vanilla-wafers-nilla-wafer-knockoffs-copycat-recipe.html", "description": "My recipe calls for just a bit of honey, not for its taste, but for its browning properties. Honey lends baked goods a deeper golden color, which is really helpful for giving these cookies the hue that their official counterparts gain from dye.", "totalTime": "45 minutes", "recipeYield": "makes 100 tiny cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["8 ounces flour", "4 ounces unsalted butter", "3 1/2 ounces sugar", "1 ounce honey", "1/4 teaspoon baking soda", "1/4 teaspoon salt", "1/2 ounce vanilla extract", "4 egg yolks", "3 ounces cream, plus extra for washing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cookie batter:</p>\n\n<p>Preheat the oven to 325&deg;F and line two cookie sheets with parchment, set aside.</p>\n\n<p>Sift the flour in a sieve. </p>\n\n<p>With a hand or stand mixer (fitted with a paddle attachment), cream together the butter, sugar, honey, baking soda, salt and vanilla extract. Cream for about 5 minutes on medium speed, until light and fluffy. About halfway through the mixing, scrape the bowl down with a rubber spatula.</p>\n\n<p>After 5 minutes, with the mixer still running, add the eggs yolks, one at a time. Let each addition fully incorporate before adding the next.</p>\n\n<p>Turn the mixer to low and add in the flour all at once. While it is mixing, drizzle in the cream. Continue mixing until homogenous. Use a rubber spatula to transfer the batter to a piping bag, fitted with a 1/2\" plain tip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pipe and bake the cookies:</p>\n\n<p>Pipe the cookies into 1\" wide rounds on the prepared cookie sheets. Don't worry if they have little peaks, you'll fix those later. Just try to keep the cookies all roughly the same size to ensure even baking. </p>\n\n<p>Once all of the cookies have been piped, brush each one lightly with a pastry brush dipped in cream. You're not looking to coat the cookies, but to smooth the peaks down and give them an even, smooth surface texture.</p>\n\n<p>Once the cookies have been brushed, bake approximately 18 minutes or until the cookies are firm to the touch and golden brown. To make perfectly round wafers, use a 1 1/2\" cookie cutter to trim each cookie before they cool.</p>\n\n<p>Transfer the cookies, while still slightly warm, to an airtight container and seal. This will slightly steam the cookies and give them that less than crisp Nilla texture. If you prefer a crisper wafer, allow the cookies to cool completely before storing. </p>\n\n<p>The cookies will keep, at room temperature, for several weeks.</p>"}]}