{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120910-221887-cook-the-book-chicken-soup.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chicken soup", "Cook the Book", "crackers", "knishes", "noah and are bernamoff", "the mile end cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Mile End's Gribenes and Schmaltz", "link": "https://www.seriouseats.com/recipes/2012/09/mile-ends-gribenes-and-schmaltz.html", "description": "<strong>Schmaltz</strong> is a useful cooking fat to keep around the house; for our Cook the Book feature this week, it is used in <a href=\"http://www.seriouseats.com/recipes/2012/09/mile-ends-soup-mandel.html\">Soup Mandel</a> and <a href=\"http://www.seriouseats.com/recipes/2012/09/mile-ends-knishes.html\">Knishes</a>. Keep the resulting <strong>Gribenes</strong> (fried chicken skin crackling) for snacks while you're cooking or toss them in a salad. If you don't have extra chicken skin hanging around the kitchen, call a butcher shop ahead of time and have them reserve it for you.", "totalTime": "1 hour", "recipeYield": "makes about 2 cups gribenes and 1 cup schmaltz", "recipeCategory": ["Chicken", "Condiments and Sauces", "Cook the Book"], "recipeIngredient": ["2 pounds chicken skin with its fat", "Diamond Crystal kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the chicken skin and fat out on a baking sheet in an even layer. Place the tray in the freezer until the skin is partially frozen, about 1 hour. (This will make it easier to cut.) Transfer the chicken skin to a cutting board and cut it into 3-inch-long strips; then cut each strip crosswise into 1/2-inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees. Place the chicken skin pieces in a large roasting pan and toss them with 2 teaspoons of salt. Bake for 20 minutes, then remove the pan from the oven to give the skin pieces a stir. Return them to the oven and continue to bake, stirring every 10 minutes or so, until the chicken skin pieces have rendered their fat and are crisp and nicely browned. (The cooking should be monitored closely, especially as the chicken skin pieces start to brown, because they can go from browned to burned very quickly.) Remove the pan from the oven and let it cook for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pour all the contents of the roasting pan through a metal strainer into a metal pot or other heatproof vessel. Leave the container over the pot to let the gribenes drain a couple of minutes more; then transfer the gribenes to a tray or plate lined with several layers of paper towels. Allow both the schmaltz and the gribenes to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the gribenes with more salt to taste if needed, and store them in an airtight container at room temperature for up to 3 days. Transfer the schmaltz to a covered container and refrigerate it for up to 2 weeks.</p>"}]}