{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120816-218379-cook-the-book-ukranian-dumplings.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "lemon marmalade", "Preserves", "Susan Feniger", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Susan Feniger's Lemon Marmalade", "link": "https://www.seriouseats.com/recipes/2012/08/lemon-marmalade-for-dipping-sauce-dumplings-susan-feniger.html", "description": "Try toppingSusan Feniger's Ukranian Spinach Dumplings from <em>Street Food</em> with this <strong>Lemon Marmalade</strong> for a tangy, bright finish to the rich appetizer. The marmalade itself is easy to make (at least once you've peeled and sliced the lemons) and also pairs well with buttery toast and crunchy biscotti.", "totalTime": "2 hours", "recipeYield": "makes 1 1/2 cups", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Vegetarian"], "recipeIngredient": ["5 lemons, washed well", "1 1/2 cups sugar", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using vegetable peeler, remove the yellow zest from all of the lemons. Slice the zest into narrow, delicate strips and put them in a small saucepan. Cut off the ends of each lemon, and then cut down the sides, removing the white pith so that you are left with just the fruit. Discard the pith. Cut the fruit into 1/2-inch pieces, removing any large membrane and seeds. Put the fruit in the same saucepan with the zest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1/4 cup water into the saucepan and add the sugar and salt; stir well to combine and dissolve the sugar. Put the pan over medium heat and, stirring occasionally, bring to a boil, about 5 minutes. Reduce the heat to medium-low and simmer for 20 to 25 minutes, until the marmalade is thick and glossy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to a container and let it cool in the refrigerator. Store the marmalade in an airtight container in the refrigerator for up to 3 weeks.</p>"}]}