{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121113-127677-Earl-Grey-Lavender-Chocolate-Cake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["chocolate cake", "Earl Grey", "lavender"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Lavender-Earl Grey Flourless Chocolate Cake", "link": "https://www.seriouseats.com/recipes/2012/11/lavender-earl-great-flourless-chocolate-cake-recipe.html", "description": "A flourless chocolate cake flavored with earl grey tea, lavender, and flaky sea salt.", "totalTime": "2 hours, 45 minutes", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Cakes", "Chocolate", "Let Them Eat...", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["<strong>For the Cake</strong>:", "4 ounces (1 stick) plus 1 tablespoon unsalted butter, cut into 1 tablespoon pieces ", "2 teaspoons Maldon salt", "1/2 cup boiling water", "1 1/4 cups (8 3/4 ounces) granulated sugar", "1/4 cup dried edible lavender", "3 tablespoons plus 1 teaspoon loose Earl Grey tea leaves", "3/4 cup boiling water", "16 ounces bittersweet chocolate, finely chopped", "9 large eggs, separated and at room temperature", "1/4 cup unsweetened cocoa powder, sifted", "2 teaspoons pure vanilla extract", "1 teaspoon table salt", "   ", "<strong>To Serve</strong>    ", "Confectioners’ sugar", "Dried edible lavender", "Maldon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to middle position and preheat oven to 350&deg;F. Grease a 10-inch springform pan with 1 tablespoon butter and line exterior of pan with foil. Sprinkle 1 teaspoon Maldon salt over pan bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse the sugar with 1 tablespoon lavender and 1 teaspoon tea. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine boiling water with the remaining 3 tablespoons lavender and remaining 3 tablespoons tea in a liquid measuring cup; steep for 5 minutes. Strain mixture into medium heat-proof bowl, pressing on solids to release any liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chocolate and remaining 8 tablespoons butter to lavender-tea mixture and set over double-boiler (bottom of bowl should not be touching simmering water). Stir continuously until chocolate is completely melted and mixture is smooth and shiny. Remove bowl from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl whisk egg yolks and 3/4 cup sugar vigorously until mixture is a thick, pale paste. Add cocoa, vanilla, and tables salt and whisk until completely incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 1/4 cup of warm chocolate to the egg yolk mixture and stir until completely incorporated. Whisk in remaining chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large, clean, dry bowl beat egg whites and salt with whisk attachment on medium-low speed until whites begin to froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes. Slowly add remaining 1/2 cup sugar and continue beating until stiff, glossy peaks form. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk about 1/3 of the meringue into the chocolate batter until completely incorporated. With a rubber spatula, fold in the remaining meringue. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared baking pan and sprinkle with remaining 1 teaspoon Maldon salt. Bake until top begins to crack and cake tester has moist crumbs attached to it when inserted, about 1 hour. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cake to cooling rack. Cool in pan 10 minutes, then remove springform mold and cool completely, about 1 hour. Sift cofectioners’ sugar over cooled cake, and sprinkle with lavender and Maldon salt if desired. </p>"}]}