{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120511-205111-knead-book-fast-breads-crumpets-cooking.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fast Breads' Crumpets", "link": "https://www.seriouseats.com/recipes/2012/05/fast-breads-crumpets.html", "description": "[Photographs: Donna Currie] As always with our Knead the Book feature, we have five (5) copies of Fast Breads to give away this week. Enter the contest here. Tea and crumpets. That phrase is absolutely everything I knew about crumpets...", "totalTime": "1 hour 15 minutes", "recipeYield": "Makes 10 crumpets", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup milk, any fat content ", "1 cup water", "1 tbsp corn or canola oil", "1 cup unbleached all-purpose flour", "3/4 cup unbleached bread flour", "1 tsp granulated sugar", "1 1/2 tsp kosher salt", "2 1/4 tsp instant yeast (one 1/4-oz packet)", "Flavorless nonstick cooking spray", "1 tsp baking soda dissolved in 1 tsp water mixed just before cooking", "Butter for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, heat the milk, water, and oil over medium heat to about 130ºF on an instant-read thermometer. Remove from the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, and using a large spoon, stir together both flours, the sugar, salt, and yeast. Stir in the hot milk mixture, then stir vigorously for about 2 minutes to form a smooth, thick batter. Cover the bowl with plastic wrap and let the batter sit for 45 minutes. The batter will rise and become bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the batter has risen, arrange 5 metal rings each 3- to 4-in diameter and about 11/2 in high on a griddle. Spray the inside of each ring and the griddle with flavorless nonstick cooking spray. Heat the griddle over low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the large spoon to stir down the batter. Gently stir in the dissolved baking soda, mixing well. Drop about 1/4 cup of the batter into each hot ring; it will spread evenly. Cook the crumpets over low heat until the bottom is browned and a firm skin has formed on top, about 10 minutes. Bubbles will form on the tops as the crumpets cook, and the tops should feel firmly baked and not sticky when touched lightly with a finger. Use tongs to lift off the rings and set them aside. If the crumpets stick to the rings (they won’t if the rings are well greased), jiggle the rings gently with the tongs and the crumpets should release. Turn the crumpets over and cook just until the second sides are firmly set, a minute or less. The insides of the crumpets will be soft. Transfer to a plate and serve, or keep warm in a low oven (250ºF) while the second batch cooks. Before you cook the second batch, gently stir down the batter (it will bubble up and rise while the first batch cooks) and spray the rings and griddle again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the crumpets hot with butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The crumpets can be covered and stored at room temperature for to 2 days. To serve, lightly toast the crumpets, buttered or not, just to warm them, or place them in a single layer on a baking sheet/tray, cover lightly with aluminum foil, and reheat in a preheated 225ºF 1/4 oven just until warm, about 10 minutes. </p>"}]}