{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120216-193219-dinner-tonight-red-wine-pasta-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["cooking with wine", "Dinner Tonight", "pasta", "quick", "spaghetti", "wine", "Zinfandel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zinfandel Spaghetti with Spicy Rapini", "link": "https://www.seriouseats.com/recipes/2012/02/zinfandel-spaghetti-with-spicy-rapini-recipe.html", "description": "...", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Pasta"], "recipeIngredient": ["1 1/2 pounds rapini (broccoli rabe), thick stems removed ", "1 pound spaghetti", "one 750-ml bottle Zinfandel (or other dry red wine) ", "1 tablespoon sugar", "1/3 cup extra-virgin olive oil ", "4 garlic cloves, sliced ", "1/4 teaspoon red pepper flakes", "1 teaspoon Kosher salt ", "1/2 teaspoon freshly ground black pepper ", "1/2 cup grated Pecorino-Romano "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil over high heat. Add the rapini and cook until bright green and tender, about three minutes. Remove with a wire skimmer, and spread the rapini out on a large baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water back to a boil and then add the spaghetti. Cook spaghetti until tender but still a few minutes away from al dente, five to six minutes. (You'll finish cooking the pasta later.) Reserve a cup of the cooking liquid, and then drain the pasta in a colander. Set the now empty pot back on stovetop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine and sugar to the pot, and bring to a boil over high heat. Cook until reduced by half, about eight minutes. Add the drained pasta, and stir well. Cook until most of the liquid has evaporated, stirring very often to prevent the pasta from sticking, four to five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour the olive oil into a large skillet set over high heat. When oil starts to shimmer, and the garlic and immediately reduce the heat to medium-low. Cook until garlic becomes pale golden brown, about three minutes. Add the red pepper flakes, rapini, salt, and pepper. Cook until rapini is warm, one to two minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rapini mixture to the pasta along with 1/2 cup of the reserved pasta water. Gently toss to combine. If the pasta looks dry, add more of the pasta water. If ready, divide the pasta between four plates and garnish with the grated pecorino. </p>"}]}