{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120618-209478-bsplitcake1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["banana split", "banana sweets", "Cakespy", "ice cream", "ice cream cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Banana Split Ice Cream Cake", "link": "https://www.seriouseats.com/recipes/2012/06/banana-split-ice-cream-cake-recipe.html", "description": "Banana Split Ice Cream Cake is a wonderful way to enjoy all of the classic flavors of a banana split, but in ice cream cake form. Assembling the Neapolitan flavors of ice cream with dividing levels of crumbled chocolate cake or cookies and a layer of banana slices makes for a pretty presentation. The dessert is assembled and then frozen, which allows the flavors to meld and lends a nice banana tone to the whole dessert once you're ready to eat it.", "totalTime": "3 hours 20 minutes (includes chilling)", "recipeYield": "serves 8", "recipeCategory": ["Cakes", "Cakespy", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 1/2 cups (about 8 ounces) chocolate ice cream, softened", "2 1/2 cups (about 16 ounces) cookie or cake crumbs (chocolate preferred)", "1 cup (about 5 ounces) vanilla ice cream, softened", "1 cup (about 5 ounces) strawberry ice cream, softened", "2 medium ripe bananas, sliced into 1/4-inch coins", "1/2 cup hot fudge sauce", "whipped cream, nuts, and a maraschino cherry for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a 9-inch cake or pie plate with plastic wrap, ensuring that once pressed into the pan, the plastic wrap extends out of the plate&mdash;this will make removal much easier later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chocolate ice cream in the pan. Using a spatula or wooden spoon, spread the ice cream so that it forms an even layer on the bottom of the pan. Cover the chocolate ice cream layer with 1/3 of cookie crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread vanilla ice cream over crumbs. Spread with another third of crumbs. Lay the banana slices on top of this crumb layer, making an even layer all across the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread strawberry ice cream over bananas, then top with remaining crumbs. Let chill for at least 3 hours, or overnight</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready to serve, remove the pan from the freezer. If you gently tug on the plastic wrap and then turn the pan over, it should come out on a serving plate fairly easily; if not, run a butter knife under hot water and gently run it along the inside of the pan (outside of the plastic wrap). Place a plate on top, then turn together with pan to release.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Directly before serving, spoon the hot fudge on top of the cake, and top it with whipped cream and nuts, and, if desired, a maraschino cherry on top.</p>"}]}