{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121031-228383-bar-bites-fried-chicken-livers.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "chicken", "chicken livers", "fried", "liver"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Crispy Deep-Fried Chicken Livers", "link": "https://www.seriouseats.com/recipes/2012/11/fried-chicken-livers-recipe.html", "description": "A quick flash in hot oil not only renders a crispy shell around the organ meat, but the livers are cooked just enough to yield a tender, slightly pink, creamy interior. Dipped in hot sauce, these crunchy and earthy livers are like a more flavorful and exciting version of chicken nuggets.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4 to 6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Chicken", "Deep Frying", "Offal", "Sides"], "recipeIngredient": ["1 pound chicken livers", "3/4 cup buttermilk", "1 tablespoon hot sauce, plus more for serving", "1/2 cup flour", "2 eggs, beaten", "1 1/2 cups Panko bread crumbs", "About 1 quart vegetable, canola, or peanut oil", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the chicken livers of any connective tissue or fat, then cut the livers in half. Combine the buttermilk and 1 tablespoon of hot sauce in a medium bowl, then add the trimmed chicken livers. Marinate the chicken livers in the refrigerator for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the chicken livers in a fine-mesh sieve. Place the flour, eggs, and Panko into three separate medium bowls or shallow dishes. Dredge each liver in the flour, then in the egg, and finally in the panko. Place the breaded livers on a rimmed baking sheet or plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour enough oil into a large heavy skillet to reach a depth of 1 inch. Heat the oil over moderately high heat until it reaches a temperature of 350°F on a deep-fry or instant read thermometer. Working in batches, place breaded livers in the hot oil and fry, turning occasionally, until golden and crisp, 3-4 minutes per side. Transfer the livers to a large platter lined with paper towels and season with salt. Serve the livers with additional hot sauce on the side.</p>"}]}