{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20111214-bean-soup-arepas-pork-stew-primary.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["arepas", "cheese", "corn", "Latin American cuisine", "pork", "sandwich", "Venezuela"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Venezuelan-style Arepas with Pulled Pork (Arepas Rumberas)", "link": "https://www.seriouseats.com/recipes/2012/04/venezuelan-style-arepas-with-pulled-pork-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science of home cooking in his weekly column The Food Lab. You can follow him at...", "totalTime": "3 hours 15 minutes", "recipeYield": "makes 8 arepas, serving 4 as a main course or 6 to 8 as an appetizer", "recipeCategory": ["Cheese", "Corn", "Pork", "Sandwiches"], "recipeIngredient": ["1 tablespoon vegetable oil", "1 1/2 pounds boneless pork shoulder, cut into 2-inch cubes", "1 small onion, finely chopped (about 1/2 cup)", "2 medium cloves garlic, grated on microplane grater (about 2 teaspoons", "1 roasted poblano or hatch chili, fresh, frozen, or canned, finely chopped", "2 cups low sodium homemade or store-bought chicken broth", "2 bay leaves", "1 cup finely crumbled queso fresco, cotija, or feta", "1/2 cup fresh cilantro leaves", "Kosher salt and freshly ground black pepper", "Double recipe <a href=\"http://www.seriouseats.com/recipes/2012/04/venezuelan-style-arepas-recipe.html\">Venezuelan-style Arepas</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a large Dutch Oven over high heat until smoking. Add pork shoulder and brown on all sides, about 10 minutes total. Transfer to a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium-high. Add onions and garlic and cook, stirring occasionally, until softened but not browned, about 4 minutes. Add chili and chicken stock and scrape up browned bits with a wooden spoon. Return pork to the pot along with bay leaves. Bring to a boil, then reduce to a bare simmer. Cover and cook until pork is completely tender, about 2 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork from pot with a slotted spoon and transfer to a medium bowl. Discard bay leaves, and increase heat to high. Boil until liquid is reduced to 1/2 cup. Meanwhile, shred pork with two forks. Add liquid to pork and season to taste with salt and pepper (it may not need any salt).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside while you make the <a href=\"http://www.seriouseats.com/recipes/2012/04/venezuelan-style-arepas-recipe.html\">Venezuelan-style arepas</a>. Split arepas, stuff with pork, top with crumbled cheese and cilantro, and serve with lime wedges and avocado slices if desired.</p>"}]}