{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121218-beer-pretzel%20caramels.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "candy", "caramel", "the liddabit sweets cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beer Pretzel Caramels", "link": "https://www.seriouseats.com/recipes/2012/12/beer-pretzel-caramels-recipe.html", "description": "The best endorsement I can give these caramels: I turned them into Christmas presents. Malty, sweet, and just a little crunchy, cut them as large or as small as you'd like, wrap them in wax paper, and get ready to be everyone's favorite this year.", "totalTime": "6-8 hours, for reducing and cooling", "recipeYield": "makes 75 pieces", "recipeCategory": ["Bake the Book", "Candy"], "recipeIngredient": ["7 tablespoons (100 grams) unsalted butter, plus 1 teaspoon for greasing the baking sheet", "1 cup (700 grams) heavy (whipping) cream", "3 cups (600 grams) granulated sugar", "1/3 cup plus 1 tablespoon (150 grams) barley malt syrup (available at a natural foods store, like Whole Foods)", "2 teaspoons (10 grams) fine sea salt", "About 1/4 cup (100 grams) Beer Reduction (recipe follows)", "2 1/2 cups (150 grams) crushed and sifted crunchy pretzels", "1 teaspoon (5 grams) coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease the bottom and sides of the baking sheet with the 1 teaspoon butter, and set it aside on a heatproof surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cream, sugar, malt syrup, fine sea salt, and the 7 tablespoons butter in a large (6- to 8-quart) stockpot. Stir a couple of times with the heatproof spatula just to make sure there aren’t any big clumps of dry sugar, and then bring to a boil over high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium and insert the candy thermometer. Cook, stirring occasionally, until the mixture reaches 252°F/122°C (hard ball stage), about 20 minutes. (Watch it closely: once it reaches 240°F/115°C (soft ball stage), after about 15 minutes, you’ll want to stay nearby and stir it more frequently as it tends to scorch on the bottom of the pot.) Remove the pot from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the Beer Reduction, then the pretzels and coarse sea salt. Mix thoroughly, scraping the bottom of the pot several times to incorporate everything.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put on your oven mitts and carefully (seriously—please be careful!) pour the caramel onto the prepared baking sheet. Spread it out with the spatula, distributing the pretzel pieces as evenly as possible. Allow it to cool until it’s firm to the touch, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run the tip of a sharp chef’s knife around the edges of the baking sheet to loosen the caramel. Turn it out onto the lined cutting board, cut it into 1- by 1½-inch pieces, and wrap them in the wax twisting papers. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the caramels in an airtight container in the refrigerator for up to 3 weeks (let them come to room temperature before you eat them!).<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Beer Reduction:</strong> You'll need 6 12-ounce bottles of beer, preferably a strong dark ale.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the contents of 3 of the bottles into a large (6- to 8-quart) pot, and place it over high heat. Stir frequently to dissipate the carbonation and prevent the liquid from boiling over. Once the beer is at a rolling boil, slowly add another bottle and, stirring constantly, bring to a boil again. Repeat until all the beer is in the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the beer over high heat, stirring constantly, until all the carbonation has dissipated and it's no longer in danger of boiling over, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium and continue to cook, stirring occasionally, until the volume of the liquid is dramatically reduced (to about 1/2 cup) and the reduction has the consistency of fakey pancake syrup as it cools). Remove from the heat and allow it to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the reduction in an airtight container. It will keep in the fridge for up to 1 month.</p>"}]}