{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120501-asparagus-tacos-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["asparagus", "Mexican", "quick", "taco", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Charred Asparagus Tacos With Creamy Adobo and Pickled Red Onions", "link": "https://www.seriouseats.com/recipes/2012/05/charred-asparagus-tacos-with-creamy-adobo-and-pickled-red-onions-recipe.html", "description": "Meaty tacos are great, but who doesn't love charred sweet asparagus in the springtime? An intriguing mix of white and green charred asparagus gives complexity to these tacos.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Mains", "Mexican", "The Food Lab", "Vegetarian"], "recipeIngredient": ["2 ancho chilies, stemmed and seeded", "2 tablespoons vegetable oil", "1 small onion, finely sliced", "2 medium cloves garlic, grated on a microplane grater (about 2 teaspoons)", "2 teaspoon dried oregano", "1 tablespoon cider vinegar", "1 chipotle chili and 1 tablespoon sauce from 1 can chipotles in adobo", "2/3 cup sour cream or Mexican crema", "2 teaspoons fresh juice from 2 limes", "Kosher salt and freshly ground black pepper", "2 1/2 pounds asparagus (green, white, or a mix), bottoms trimmed, cut into 1-inch segments", "24 corn tortillas <a href=\"http://www.seriouseats.com/2011/10/video-the-right-way-to-warm-corn-tortillas.html\">warmed</a>", "<a href=\"http://www.seriouseats.com/recipes/2012/05/pickled-red-onions.html\">Pickled Red Onion</a>", "Queso fresco or queso cotija", "Fresh cilantro leaves", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat ancho chilies in a medium saucepan over high heat, turning occasionally, until toasted and fragrant, about 3 minutes. Transfer to a microwave-safe measuring cup and cover with 1 cup water. Microwave on high heat until just simmering, about 3 minutes. Let steep until chilies are softened. Drain chilies, reserving liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 1 tablespoon oil in now-empty skillet over medium-high heat until shimmering. Add onions, and cook, stirring frequently until softened and lightly browned, about 8 minutes. Add garlic and oregano and cook, stirring frequently, until fragrant, about 30 seconds. Add vinegar, chipotle chili and sauce, and reserved chili liquid. Scrape up browned bits from bottom of pan. Transfer contents to jar of a blender along with soaked chilies, sour cream, and lime juice. Blend on high speed until completely smooth, about 1 minute. Season to taste with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remining tablespoon oil in a large skillet over high heat until smoking. Add asparagus, season with salt and pepper, and cook without moving until well charred on bottom, about 2 minutes. Toss and repeat, allowing asparagus to char before tossing again. Repeat until all asparagus is charred and softened, 8 to 10 minutes total. Transfer to a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form 12 double stacks of tortillas. Spread a tablespoon of sauce over each one. Divide asparagus evenly between tortillas. Top with pickled onions, cheese, and cilantro. Serve immediately with lime wedges and extra sauce.</p>"}]}