{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20120102-185746-almostflourless.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cakes", "Cakespy", "chocolate", "chocolate cakes", "dulce de leche", "flourless chocolate cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Almost Flourless Chocolate Cake With Dulce De Leche", "link": "https://www.seriouseats.com/recipes/2012/01/almost-flourless-chocolate-cake-dulce-de-leche-recipe.html", "description": "Around this time of year, an unnerving amount of people make declarations that they are going to avoid dessert, all under the alarming title of \"New Year's Resolution\". Personally, I'd rather resolve to eat more deliciously. And if you resolve similarly, you'll undoubtedly get a lot of pleasure from <strong>Almost Flourless Chocolate Cake with Dulce de Leche. </strong>", "totalTime": "2 hours", "recipeYield": "Serves 8", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["1 pound semisweet chocolate (I used Semisweet Callebaut), chopped coarsely", "10 tablespoons unsalted butter, softened", "1 tablespoon all purpose flour", "1 tablespoon sugar", "1/8 teaspoon salt", "4 large eggs, separated", "8 tablespoons dulce de leche", "Ice cream or whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 425&deg;F. Line the base of your 8-inch pan with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the chocolate slowly, over low heat, in the top of a double boiler until completely melted. Stir frequently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the melted chocolate from the heat and mix in the butter, flour, sugar and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg yolks gently with a fork, and then stir gradually into the chocolate mixture. Stir vigorously as you add the yolks, as the mixture is still quite warm and you don't want to scramble the eggs! Once incorporated, hustle with the next step.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg whites until they hold a definite shape but are not dry and fold into the chocolate mixture. Overbeating or underbeating will ruin the cake. The beaten egg whites should be folded smoothly, quickly and easily into the chocolate mixture. Pour into the prepared pan and bake for 15 minutes. Turn off the heat; open the oven door, leaving it ajar, and allow the cake to cool completely in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once ready to serve, slice with a sharp knife, cleaning between slices to remain neat. Top each slice with a tablespoon of dulce de leche and a big scoop of whipped cream or ice cream. </p>"}]}