{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/198295-thin-mint-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["chocolate", "frozen desserts", "Girl Scout Cookies", "ice cream", "mint", "Scooped", "Thin Mints"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Thin Mint Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/03/chocolate-thin-mint-ice-cream-recipe.html", "description": "Fair warning: this is some really rich chocolate ice cream. It's plenty dark, and so pumped with chocolate that it melts more into pudding than custard. The mint keeps things light enough, but a little of this goes a long way.", "totalTime": "1 hour, plus an overnight chill", "recipeYield": "makes 1 generous quart", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["6 egg yolks", "1/2 cup sugar", "3 tablespoons cocoa powder", "3 cups half and half", "28 Thin Mints (1 box), divided", "5 ounces dark chocolate (about 70% cacao), chopped fine", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan off heat, whisk together egg yolks and sugar until light in color and slightly thickened, 3 to 5 minutes. Whisk in cocoa powder until no lumps remain. Slowly add half and half, whisking constantly. Finely chop 10 Thin Mints (crumbs should be no larger than a pea) and stir into dairy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put saucepan on medium-low heat and cook, whisking frequently, until custard reaches 180&deg;F on an instant read thermometer (custard should coat the back of a spoon but a swiped finger should leave a clean line). Remove custard from heat and stir in chocolate, then salt to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chocolate is fully melted and incorporated, transfer to an airtight container and chill overnight in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, churn in an ice cream maker according to manufacturer's instructions. Roughly chop remaining Thin Mints; chunks should range from pea to nickle-sized.  In the last minute of churn, add chopped Thin Mints. Return ice cream to container and chill in freezer for at least two hours before serving.</p>"}]}