{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/01142011-187470-sunday-supper-chicken-mole-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "Chicken Mole", "mole", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Chicken Mole", "link": "https://www.seriouseats.com/recipes/2012/01/chicken-mole-recipe.html", "description": "The word \"mole\" is used to describe sauces that come in an overwhelming variety of colors and flavors. What unites all versions of mole is chili&mdash;whole, chopped, dried, or fresh, all mole use chili as one of the central components....", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Mexican", "Sunday Supper"], "recipeIngredient": ["2 dried Ancho chilies", "3 dried New Mexico or Guajillo chilies, stemmed and seeded", "1/4 cup sesame seeds", "1/2 teaspoon anise seeds", "1/4 teaspoon cumin seeds", "1/4 teaspoon coriander seeds ", "6 black peppercorns", "One 1/2-inch cinnamon stick", "3 tablespoons lard", "1 1/2 tablespoons raisins", "10 whole almonds ", "2 plum tomatoes, finely chopped", "3 garlic cloves, minced", "1 small onion, finely chopped", "2 1/2 cups chicken stock or low-sodium broth", "1 1/2 ounces Mexican chocolate, coarsely chopped", "Salt and freshly ground pepper", "1 3-4-pound chickens, cut into 8 pieces each", "1 tablespoon chopped cilantro (for garnish)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, cover all of the chili peppers with hot water. Let them stand for 30 minutes.</p>\r\n\r\n<p><br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, combine sesame seeds with the anise, cumin, coriander, peppercorns and cinnamon stick. Toast over moderately low heat, stirring, until fragrant, about 2 minutes. Allow to cool then grind the seeds and spices to a fine powder using a spice grinder or mortar and pestle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the same skillet, melt 1 tablespoon of the lard over medium low heat. Stir in the raisins, almonds and cook the mixture until the almonds are toasted and the raisins are plump, about 5 minutes. Transfer to a large bowl and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon lard in skillet. Stir in the tomatoes, garlic, onions and the spice powder and cook over medium high heat until just simmering, about 7 minutes. Add the drained chilies and the chicken stock, cover partially, and simmer for 1 hour. Remove from the heat. Working in batches, transfer sauce and chocolate to a blender and puree until smooth, if using a standing blender; if using an immersion blender, blend until smooth in skillet. Season to taste with salt and pepper.  At this point you can refrigerate the mole for up to 10 days, or freeze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Season the chicken with salt and pepper. Melt the remaining lard in the braising dish. Working in batches, brown the chicken over high heat until brown on all sides. Pour the mole sauce over the chicken and bring to a simmer. Cover and place in the oven until the meat is cooked through and very tender, about 45 minutes. Serve with rice and a side of beans, and garnish with chopped cilantro and lime wedges.</p>"}]}