{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120425-203323-dinner-tonight-jose-andres-eggs-chorizo-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Spanish", "keywords": ["chorizo", "Dinner Tonight", "egg", "fried egg", "Jose Andres", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "José Andrés's Fried Egg with Chorizo", "link": "https://www.seriouseats.com/recipes/2012/04/jose-andress-fried-egg-with-chorizo.html", "description": "It sounds simple&mdash;too simple. I mean, do you need a full recipe describing how to fry and egg warm up chorizo? Luckily, José Andrés, in a recipe from <a href=\"http://www.amazon.com/Made-Spain-Spanish-American-Kitchen/dp/030738263X\"><em>Made in Spain</em></a>, manages to throw in a couple tricks to this seemingly basic dish, helping transform into something beyond a basic dinner.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Breakfast and Brunch", "Dinner Tonight", "Fried Eggs", "Spanish"], "recipeIngredient": ["8 garlic cloves, smashed and skins removed", "1/4 cup plus 1 tablespoon extra-virgin olive oil", "4 large eggs", "sea salt and freshly ground black pepper", "4 ounces Spanish chorizo, sliced 1/4-inch thick rounds ", "4 fresh thyme sprigs ", "crusty bread, cut into slices "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour 1 tablespoon of the olive oil into a large non-stick skillet and heat over medium heat until shimmering. Add the garlic and cook, flipping occasionally, until lightly browned, about five minutes. Remove garlic with a slotted spoon and discard. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the remaining 1/4 cup of olive oil, and crank the heat to medium-high. Crack one of the eggs into a small bowl. When oil just starts to smoke, tilt the skillet so that the oil pools on one side. Carefully slip the egg into the oil. Spoon some of the hot oil on top of the egg, and cook until the whites are set, but the yolk is still runny, about 30 seconds. The edges of the whites should be browned and crispy. Carefully remove egg with a slotted spoon or spatula, and transfer to a plate and keep warm. Repeat process with remaining eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil into a bowl and set aside, but do not wipe out skillet. Return the skillet to the stovetop and turn the heat to medium-high. Add the chorizo, and cook until they start to render some oil, about 30 seconds. Add the thyme sprigs, stir well, and cook for an additional minute, reducing the heat if oil starts to smoke aggressively. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the chorizo and thyme between four plates. Top each with a fried egg. Season with salt and black pepper. Drizzle with a little bit of the reserved oil. Serve with slices of crusty bread. </p>"}]}