{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/225129-20121014-sunday-brunch-cheddar-scallion-scones.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "scones", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cheddar Scallion Scones with Jalapeno Agave Butter", "link": "https://www.seriouseats.com/recipes/2012/10/cheddar-scallion-scones-with-jalapeno-agave-butter-recipe.html", "description": "These scones are for those of us who crave something savory, but still want flaky pastry in the morning.", "totalTime": "35 minutes", "recipeYield": "Makes 12 scones", "recipeCategory": ["Bread", "Breakfast and Brunch"], "recipeIngredient": ["16 tablespoons (2 sticks) unsalted butter, 1 stick at room temperature, 1 stick cold", "1/2 jalapeno, seeded and finely chopped (about 2 tablespoons)", "1 teaspoon agave nectar ", "Kosher salt", "2 cups all-purpose flour ", "1 tablespoon baking powder ", "4 ounces (about 1 cup) shredded cheddar cheese ", "8 scallions, thinly sliced ", "3 eggs, divided ", "1/2 cup half and half "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl combine 1 stick room temperature butter, jalapeno, agave, and a pinch of salt. Mix with a spatula until ingredients are evenly incorporated, then taste for seasoning adding additional salt if necessary.  Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 400 &deg;F. In a large bowl combine flour, baking powder and 2 teaspoons salt, and whisk to combine. Cut cold remaining 1 stick cold butter into 1/4-inch pieces, then using your fingers or a pastry cutter, mix butter into flour mixture until it resembles a coarse meal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss shredded cheddar and scallions into butter/flour mixture. In a medium bowl, beat two eggs, then whisk in half and half. Pour egg mixture over flour mixture and stir using a wooden spoon until a shaggy dough forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto a floured work service and knead gently, just until it comes together into a ball, adding more flour if necessary. Pat dough into a 1 inch rectangle, then using a 2 1/2 inch round pastry cutter cut into 12 scones. Place scones on a prepared baking sheet then beat remaining egg and brush over scones. Bake scones until puffed and golden, about 17 minutes, rotating once during cooking.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow scones to cool for five minutes, then serves with jalapeño-agave butter.</p>"}]}