{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120922-222714-sunday-brunch-bacon-shrimp-toast.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["Chinese American", "shrimp", "shrimp toast", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bacon Shrimp Toast", "link": "https://www.seriouseats.com/recipes/2012/09/bacon-shrimp-toast-recipe.html", "description": "The classic Chinese-American appetizer of toast spread with a seasoned shrimp paste. Our version comes topped with a slice of bacon and scallions.", "totalTime": "40 minutes", "recipeYield": "Makes 24 pieces", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Sandwiches", "Shrimp"], "recipeIngredient": ["12 slices white bread, crusts removed", "8 slices bacon ", "1-inch piece fresh ginger ", "2 scallions ", "1 medium clove garlic ", "1 pound medium shimp, shelled ", "1 teaspoon fish sauce ", "1 teaspoon soy sauce ", "1 1/2 teaspoon sesame oil ", "1/2 teaspoon chili paste (like sambal or sriracha) ", "4 tablespoons vegetable oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 450&deg;F. Cut each slice of bread in half either into rectangles or triangles. Place bread on a rack on a baking sheet and place in the oven until just beginning to dry out, about 3 minutes, flip and toast for an additional 2 minutes then remove from oven and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover a plate with paper towel and place bacon on the plate. Working in increments of thirty seconds, microwave bacon on high power until fat begins to render and bacon just begins to curl. Slice each piece of bacon into 3 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor add ginger, scallion, and garlic and pulse until very finely chopped. Add shrimp, fish sauce, soy sauce, sesame oil, and chili paste and pulse until ingredients form a paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread shrimp paste evenly between pieces of toast, then top each piece of toast with a piece of bacon.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon vegetable oil in a medium stainless steel skillet over medium heat until shimmering, then add 1/4 of shrimp toasts bacon side up. Cook until the bottom of the toast is golden brown, about 2 minutes, then remove from the skillet and place on a rack on a baking sheet. Repeat with remaining oil and toast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bacon shrimp toast in the oven and cook until shrimp paste is cooked and bacon begins to brown, about 12 minutes. Serve hot, sprinkled with sliced scallions.</p>"}]}