{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121006-sunday-supper-moroccan-brisket.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["brisket", "peppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Coffee-Rubbed Beef Brisket With Parsley Couscous", "link": "https://www.seriouseats.com/recipes/2012/10/coffee-rubbed-beef-brisket-parsley-couscous-recipe.html", "description": "Moroccan spices and a coffee rub lend deep flavor and a russet hue to beef brisket, while couscous helps sop up its sauce.", "totalTime": "2 1/2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Beef", "Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the Brisket:</strong>", "3 tablespoon ras el hanout (see note)", "2 tablespoons ground coffee", "1 1/2 teaspoons kosher salt, divided", "4 tablespoons olive oil, divided", "2 to 2 1/2 pound beef brisket, trimmed", "3 large, sweet, multi-colored bell peppers, seeded and sliced.", "1 large onion, sliced", "2 tablespoons tomato paste", "1/4 cup ketchup", "2 cloves garlic, minced", "1 tablespoon preserved lemon or 1 1/2 teaspoons fresh lemon zest", "1 cup dry red wine", "1 (28-ounce) can crushed tomatoes", "1 cup beef broth", "2 bay leaves", "&nbsp;", "<strong>For the Couscous:</strong>", "1 1/3 cup Israeli couscous ", "1 3/4 cups low-sodium store bought or homemade chicken or beef broth", "1 1/2 teaspoons minced fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine 2 tablespoons ras el hanout, ground coffee, and 1 teaspoon salt. Rub generously all over brisket. Cover and refrigerate 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. Heat 2 tablespoons olive oil over medium-high heat in a large Dutch oven until just barely smoking. Add brisket and cook without moving until well browned, about 5 minutes. Flip and brown second side, 4 to 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add another tablespoon of olive oil to pan. Add the peppers and onion and cook, stirring frequently, until just beginning to soften. Add tomato paste, ketchup, remaining tablespoon ras el hanout and remaining 1/2 teaspoon salt. Stir and allow to brown, about 3 minutes. Add garlic and preserved lemon or lemon zest. Cook two minutes, stirring, then add red wine. Bring to a boil and simmer for one minute before adding tomatoes, broth, and bay leaves. If meat is not covered with liquid, add a bit more water until it is submerged in liquid. Return to a boil, cover, and transfer to the oven to cook for until easily shreddable with a fork-tender, 2 to 2 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When meat is nearly finished, heat remaining 1 tablespoon olive oil in a medium saucepan set to medium-high heat. When oil is shimmering, add couscous, stir and allow to toast for three minutes before adding stock. Reduce heat to low, cover and simmer until liquid is absorbed, about 12 minutes. Remove from heat and keep covered. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the meat is done, remove it from the pot. Taste sauce and season to taste with salt and pepper. Using a sharp knife, cut the brisket against the grain into 1/4\"-thick slices. Fluff couscous with a fork and garnish with parsley. Season to taste with salt and pepper. Serve brisket immediately with sauce and couscous.</p>"}]}