{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120523-dt-barbara-kafkas-chinese-chicken-in-the-pot.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Chinese", "keywords": ["barbara kafka", "chicken", "Chinese", "Dinner Tonight"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Barbara Kafka's Chinese Chicken in the Pot", "link": "https://www.seriouseats.com/recipes/2012/05/barbara-kafkas-chinese-chicken-in-the-pot.html", "description": "\"In a pot\" recipes are about two things: clean and simple flavors, and a highly aromatic and delicious broth. It's one of the best things you can do with a whole chicken&mdash;much quicker than roasting it whole, and, especially in spring, much more versatile for how it can make use of various vegetables.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chinese", "Dinner Tonight", "Gluten-Free"], "recipeIngredient": ["4 cups low sodium homemade or canned chicken broth", "1/2 ounce dried shitake mushrooms", "1 whole chicken (about 4 pounds), cut into thighs, breasts, legs, and wings, skinned and trimmed of excess fat", "6 medium cloves garlic, smashed and peeled", "1-inch piece ginger, cut into thin matchstick", "1 whole star anise", "8 scallions, whites cut into 2-inch pieces, greens cut into 1-inch pieces", "1/2 cup gluten free soy sauce (or substitute regular soy sauce)", "1 (8-ounce) can sliced water chesnuts, drained and rinsed", "4 ounces snow peas, ends trimmed", "3 cups cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 cup of stock in a small saucepan until warm, then soak the mushrooms in the warm stock for 15 minutes. Remove mushrooms, then strain the liquid through a coffee filter to remove sediment. Reserve mushrooms and liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover chicken pieces with remaining stock in a large, wide pot. Add garlic, ginger, star anise, and scallion whites. Cover and bring to a boil. Add mushroom soaking liquid and soy sauce and bring back to a boil. Add mushrooms and simmer until chicken is barely cooked through, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add water chestnuts, scallion greens, and snow peas, and stir well to submerge them in cooking liquid. Cover and bring back to a gentle boil and cook until snow peas are cooked but still barely crunchy, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the cooked rice between 4 bowls and top with the chicken pieces. Ladle the broth equally between bowls and scatter the vegetables around the chicken. Serve immediately while still warm.</p>"}]}