{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120411-195671-fried-scones-primary.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "breakfast breads", "fried foods", "honey", "scones"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fried Scones with Cinnamon Honey Butter", "link": "https://www.seriouseats.com/recipes/2012/04/utah-fried-scone-cinnamon-honey-butter-recipe.html", "description": "While you can make fried scones from refrigerated or frozen yeast roll dough, making them from scratch doesn't require that much more effort. Sprinkle them with powdered sugar or better yet, drizzle them with a cinnamony browned honey butter.", "totalTime": "about 2 hours", "recipeYield": "serves 24", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Deep Frying"], "recipeIngredient": ["<strong>For the Scones:</strong>", "2 1/4 cups all-purpose flour (approximately 12 1/2 ounces)", "2 1/4 cups bread flour (approximately 12 1/2 ounces)", "1/2 teaspoon salt", "1 cup water", "1 cup whole milk", "2/3 cup plus 1 tablespoon granulated sugar", "4 1/2 teaspoons instant yeast (2 standard sized envelopes)", "1/3 cup melted butter (approximately 5 1/3 tablespoons), cooled", "2 teaspoons vanilla", "2 quarts canola oil, for frying (you may need more depending on size of pot)", " ", "<strong>For the Glaze:</strong>", "1/2 cup (1 stick) unsalted butter", "6 ounces clover honey", "1 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, mix all-purpose flour, bread flour, 2/3 cup sugar, and salt. Set aside. Rinse bowl of stand mixer in warm water to take away the chill. Oil large bowl with cooking spray or vegetable oil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk and water in a small saucepan over medium low heat and cook until mixture it reaches approximately 110 to 115&deg;F, stirring occasionally to prevent it from burning (it should feel hot but not scalding to your touch). Pour warmed milk mixture in the bowl of stand mixer. Sprinkle yeast evenly over liquid mixture and then sprinkle remaining tablespoon of sugar on top. Let dissolve for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add melted and cooled butter and vanilla to milk. Fit dough hook on stand mixer and stir to mix. With mixer running on low, add flour mixture one cup at a time. If dough isn't pulling away from sides of the bowl, add an additional 1/2 cup of all-purpose flour. Dough will be somewhat sticky but should be workable.  Transfer dough to prepared bowl. Spray top with cooking spray then cover with plastic wrap. Set in a warm place and let rise until dough has doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Glaze</strong>: In a medium sauce pan, melt butter over medium heat. Once butter has melted, continue to cook over medium heat, stirring frequently, until butter has browned, 3 to 5 minutes. Remove from heat and transfer to a medium bowl. Whisk in honey and cinnamon until thoroughly incorporated. Keep warm while you finish the scones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out dough on a well floured work surface. Roll dough out into a large rectangle about 1/2 inch thick.  Using a knife or pizza cutter, cut out 24 triangles. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour canola oil into a large dutch oven to a depth of 2 inches. Heat oil to 360&deg;F. Use a heat resistant spatula or wire-mesh spider to carefully drop scones in, one at a time, cooking a maximum of 3 at once. Cook until first side is a dark golden brown, 1 to 1 1/2 minutes, then using heat resistant tongs turn the scones and cook until second side is deep golden brown, another minute. Remove from oil letting any excess oil drain off then transfer to a wire rack for slight cooling. Test your first scone to make sure that the insides are completely cooked, if not, return to oil and continue to cook, adjusting cooking time for all future scones. Transfer scones to a wire rack set in a rimmed baking sheet. Drizzle glaze over warm scones and serve immediately.</p>"}]}