{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120529-195206-blueberry-cream-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["blueberries", "blueberry pie", "icebox desserts", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "No-Bake Blueberry Cream Pie", "link": "https://www.seriouseats.com/recipes/2012/07/no-bake-blueberry-cream-pie-recipe.html", "description": "When it's too hot to bake, crumb crusts are here to save the day! This pie has a classic graham cracker crust and is filled with homemade vanilla pudding layered with fresh blueberries. It's a cool, creamy summer treat that is sure to please, no oven required.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Blueberry", "Condiments and Sauces", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Crust</strong>:", "7 ounces (approximately 1 1/2 sleeves) of graham crackers, pulverized into crumbs", "1 ounce (about 2 tablespoons) granulated sugar", "1 teaspoon salt", "4 tablespoons (1/2 stick) unsalted butter, melted", "&nbsp;", "<strong>For the Filling:</strong>", "16 ounces (about 2 cups) whole milk", "1 vanilla bean (split and scraped) or 1 tablespoon vanilla", "5 ounces sugar (about 2/3 cup), divided", "2 ounces cornstarch", "6 egg yolks", "1/2 teaspoon salt", "4 tablespoons (1/2 stick) butter, cut into half inch pieces", "1 quart blueberries, stemmed", "4 ounces (about 2/3 cup) cold heavy cream, whipped to soft peaks", "&nbsp;", "<strong>For the Topping:</strong>", "4 ounces (about 2/3 cup) cold heavy cream and 2 tablespoons confectioner's sugar whipped to soft peaks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the crust:</strong> In a large bowl, toss the graham cracker crumbs, sugar, and salt together. Add the butter and stir with a spatula to combine. Line the bottom and sides of a 9-inch pie plate evenly with the mixture and press it with your fingers to bring the crust together. Chill for at least 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, whisk together the milk, vanilla (pod and seeds if using the vanilla bean), and half the sugar. Set aside. In a large bowl, whisk together yolks and salt until lightened. In a separate bowl, whisk together remaining sugar and cornstarch, then add to the eggs, whisking constantly. Whisk for two minutes, until egg mixture is pale and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the milk mixture over medium heat and bring it just to a boil. Turn off the heat, and temper the egg mixture with the hot milk mixture in four additions, whisking constantly as you add the hot liquid to the egg mixture. Return the mixture to the pot and whisk constantly over medium-low heat until it begins to thicken and sputter. Once it begins to sputter, whisk two additional minutes, then turn off the heat and continue whisking as you add the butter. Whisk until the butter is completely melted and combined, then pour the pudding into the lined sheet tray. Spread it evenly to cool, then cover the surface directly with plastic wrap. Allow it to come to room temperature, then transfer to a sealed container and refrigerate for at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to assemble, whisk the pudding until it becomes smooth and supple. Using a large rubber spatula, fold in the cold whipped cream. Spread a third of the pudding over the bottom of the crust, then top with a layer of blueberries, then repeat, reserving blueberries  for garnish. Top with additional whipped cream and berries.</p>"}]}