{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/042012-202736-Sunday-Supper-Chicken-SausageB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cannellini beans", "chicken sausage", "pickled peppers", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Italian Sausage with Cannellini Beans and Pickled Peppers", "link": "https://www.seriouseats.com/recipes/2012/04/sunday-supper-italian-sausage-with-cannellini-beans-pickled-peppers-recipe.html", "description": "Nutty, chewy beans, savory chicken sausage on boldly flavored, pickled peppers: they're a perfect match. [Photograph: Jennifer Olvera] About the author: Jennifer Olvera is a veteran food and travel writer and author of \"Food Lovers' Guide to Chicago.\" Follow her...", "totalTime": "about 1 day", "recipeYield": "serves 4", "recipeCategory": ["Beans and Pulses", "Pickling"], "recipeIngredient": ["<strong>For the Beans:</strong>", "½ pound (about 2 ¼ cups) dry cannellini beans", "Kosher salt", "2 bay leaves", "3 sprigs fresh thyme", "2 cloves garlic, lightly smashed", "&nbsp", "<strong>For the Pickled Peppers:</strong>", "¼ cup sherry vinegar", "½ cup water", "½ teaspoon sugar", "½ teaspoon salt", "8 ounces (2 medium) sweet bell peppers, sliced", "1 sprig thyme", "2 cloves garlic, sliced", "1 teaspoon black peppercorns", "1 bay leaf", "&nbsp", "<strong>For the Sausage:</strong>", "1 ½ tablespoons olive oil", "4 fresh Italian sausages (chicken, turkey, or pork)", "1 small carrot, diced", "1 rib celery, diced", "1 small onion, diced", "1 tablespoon white wine vinegar", "½ cup mixed-hue cherry tomatoes, halved ", "Kosher salt and freshly ground black pepper", "1 ½ tablespoons chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The Day Before:</strong> Pick through beans and discard shriveled darkened ones. Rinse in cold running water. Transfer beans, thyme, bay leaves, and garlic to large container and cover with 2 quarts cold water seasoned with 2 tablespoons salt. Allow to rest overnight at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While beans are soaking, prepare pickled peppers. Combine vinegar, water, sugar and salt in a small saucepan. Bring to a boil over medium heat. Add peppers, thyme, garlic, peppercorns and bay leaf, and simmer for 30 seconds. Immediately remove from heat and pour mixture into resealable container. Cool to room temperature before placing in refrigerator. Allow to rest overnight while beans soak.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The Next Day</strong>: drain beans and add them to a large pot along with bay leaves, thyme and garlic. Cover with three inches of water. Slowly bring to a boil. Skim foam from top. Cover and simmer on medium-low heat until beans are tender when pierced with a fork (about 1 ¼ hours). Drain beans and discard bay leaves, garlic and woody portion from thyme sprigs. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add olive oil to a large sauté pan set to medium-high heat. When oil is shimmering, add sausage, browning on all sides until golden (2 to 3 minutes per side). Remove from pan, reduce heat to medium and add carrots, celery and onions, stirring periodically for five minutes until slightly softened. Return sausage to pan, cover with lid and cook for three minutes more before adding reserved cooked beans, white wine vinegar, and cherry tomatoes. Season with salt and pepper. Continue cooking about five minutes more, until sausages are cooked through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Plate individually or serve out of pot. Sprinkle with parsley and scatter with pickled peppers.</p>"}]}