{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121015-226083-cook-the-book-banana%20-flower-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["burma: rivers of flavor", "Cook the Book", "Naomi Duguid", "peanuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Naomi Duguid's Chopped Roasted Peanuts", "link": "https://www.seriouseats.com/recipes/2012/10/naomi-duguids-chopped-roasted-peanuts.html", "description": "These nuts are a key ingredient to many Burmese dishes (like <strong><a href=\"http://www.seriouseats.com/recipes/2012/10/naomi-duguids-banana-flower-salad-rakhine-sty.html\">Banana Flower Salad</a></strong>) and are worth roasting and chopping in bulk so you'll have them on hand.", "totalTime": "25 minutes", "recipeYield": "makes 1 cup", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Nuts"], "recipeIngredient": ["1 cup raw peanuts, with or without their papery skins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a cast-iron or other heavy skillet over medium heat, add the peanuts, and cook, stirring them frequently with a wooden spoon or spatula to prevent burning. Adjust the heat if necessary so they toast and change color gradually, in patches; as they heat up, the skins, if still on, will separate from the peanuts. When they have firmed up a little and are dotted with color, remove from the heat, but keep stirring for another minute or so. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using skin-on nuts, carry the skillet over to a sink or a garbage can and blow over it gently to blow away the loose skins. Rub the nuts between your palms to loosen the remaining skins and blow again; don’t worry if there are still some skins on your peanuts. Pick out and discard any nuts that are scorched and blackened. Transfer the nuts to a wide bowl and set aside for 10 minutes or more to cool and firm up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the peanuts are cool, place them in a food processor and process in short, sharp pulses, stopping after three or four pulses, before the nuts are too finely ground. You want a mix of coarsely chopped nuts and some fine powder. Alternatively, place the nuts in a large stone or terra-cotta mortar and pound with the pestle to crush them into smaller pieces. Use a spoon to move the nuts around occasionally; you don’t want to pound them into a paste, just to break them into small chips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chopped nuts to a clean, dry jar; do not seal until they have cooled completely. Store in the refrigerator.</p>"}]}