{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120918-222716-cook-the-book-seared-squid-with-sumac.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "hugh fearnley-whittingstall", "nick fisher", "shellfish", "squid", "the river cottage fish book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "River Cottage's Seared Squid", "link": "https://www.seriouseats.com/recipes/2012/09/river-cottages-seared-squid.html", "description": "Squid are kind of a gateway shellfish. They're not terribly fishy and they're relatively easy to clean and prepare.", "totalTime": "30 minutes", "recipeYield": "serves 4 to 5", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Gluten-Free", "Other Seafood"], "recipeIngredient": ["4 to 5 small-medium squid (about 1 1/2 to 2 1/4 pounds in total)", "1 large garlic clove, very finely chopped", "1 tablespoon olive oil", "1 tablespoon sweet or smoked paprika or sumac, plus 1 teaspoon to finish", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the squid. Set aside the trimmed tentacles. Now cut open the squid pouches,“butterfly,” and score them in a cross-hatch pattern, making sure you don’t cut right through the flesh. Cut each butterflied squid body into 2 or 3 smaller pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the squid pieces, along with the tentacles, in a bowl with the garlic, olive oil, paprika or sumac, and salt and pepper, tossing them together with your hands and making sure lots of the flavorings get trapped in the diamond cuts. Heat a grill, cast-iron griddle, or heavy-bottomed ridged pan until really hot. (If you fear the bars on your grate are too widely set for the tentacles, put a mesh screen on top of the grate.) Lay the pieces of squid on it, diamond side up, and the tentacles as they fall. Let them cook for just 1 minute, then turn them all over. Cook for a minute more. The butterflied squid pieces will want to curl up, so flip them over one more time to encourage them to do so, and allow the curled up pieces to get a final minute of cooking. Total cooking time: 4 minutes max. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, with a few more pinches of paprika or sumac flicked over the squid. On the side: a few dressed, peppery salad leaves, such as arugula, mustard, and baby kale. And, if you want to make a main course out of it, French fries.</p>"}]}