{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120807-195206-strawberry-gallette-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pie of the week", "pies", "strawberries", "strawberry galette", "summer recipes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Strawberry Galette", "link": "https://www.seriouseats.com/recipes/2012/08/strawberry-galette-recipe.html", "description": "Galettes are an excellent way to use fruit that is not quite up to par, like late summer strawberries. The lower ratio of fruit to crust and the exposure to the oven's heat allows the to fruit caramelize and concentrates the flavors.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles", "Strawberry"], "recipeIngredient": ["4 ounces granulated sugar", "3 to 4 tablespoons starch (corn, potato, or tapioca)", "1 quart fresh strawberries, hulled and quartered", "<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, rolled out to 1/8 inch thick and chilled", "Egg wash (one egg beaten with a pinch of salt)", "Optional: sanding sugar for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. In a large bowl, whisk together sugar and starch. Add the berries and toss to coat with the dry mixture. Line a sheet pan with parchment and place the dough sheet on top. Pile the strawberry mixture in the center, leaving at least 3 inches of dough uncovered on all sides. Fold the overhang back up around the fruit, encasing it on all sides, folding it into rustic pleats to gather up the excess. Chill the shaped galette in the fridge for 1/2 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chilled galette from the fridge and brush the exposed dough with egg wash and sprinkle with sugar if desired. Place the sheet tray on the prepared rack and bake for 20 minutes, turning halfway through. Lower the temperature to 350&deg;F and bake for 20-30 additional minutes, until the crust is golden brown and the filling is bubbling all over. Remove from the oven and allow the galette to cool completely before serving.</p>"}]}