{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121107-228942-pumpkin-chocolate-swirl-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["alternative thanksgiving pies", "chocolate", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Chocolate Swirl Pie", "link": "https://www.seriouseats.com/recipes/2012/11/pumpkin-chocolate-swirl-pie-recipe.html", "description": "Chocolate and pumpkin is not the most intuitive combination, but something magical happens when you combine the two in this riff on pumpkin pie. This pie is not aggressively chocolaty, but if you're looking for something new this Thanksgiving, try adding a swirl of subtle cocoa flavor to your pumpkin pie routine.", "totalTime": "4 hours (not including making the dough)", "recipeYield": "serves 8", "recipeCategory": ["Chocolate", "Christmas", "Desserts", "Pies, Tarts, and Crumbles", "Pumpkin", "Thanksgiving"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "2 tablespoons unsalted butter", "4 ounces semisweet chocolate, chopped", "12 ounces cream cheese ", "14 ounces granulated sugar", "2 large eggs, room temperature", "8 ounces pumpkin or butternut squash puree", "1/2 teaspoon vanilla extract", "1/2 teaspoon ground cinnamon", "1/4 teaspoon freshly grated nutmeg", "pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a golden brown (or slightly lighter, if you prefer that style), about 10 minutes. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the butter in a small, microwave safe bowl and microwave for 30 seconds, until the butter is melted. Add the chocolate to the bowl and microwave for 30 seconds, stop and stir the chocolate, and then return the mixture to the microwave for another 30 seconds. Continue to do this, stirring each time, until the mixture is completely melted, smooth, and shiny. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 350&deg;F. In a large bowl using an electric mixer, cream the cream cheese on medium speed. Add the sugar and cream until smooth and fluffy. Add the eggs one at a time, and mix well after each addition. Lower the mixer speed and blend in the pumpkin, spices, vanilla, and salt until the mixture is evenly combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour half of the mixture into the baked pie shell  (reserve the other half of the mixture in the bowl) and place in the oven for 10 minutes to help it partially set. Add the chocolate mixture to the remaining pumpkin mixture and stir until it is homogenous. After ten minutes, remove the pie from the oven and allow it to cool for 10 minutes. Then, pour the chocolate mixture over the top slowly and gently. Drag a spatula through the filling, scooping upward to create a swirled, marbled effect. Return the pie to the oven and bake for 35 - 40 minutes, until the filling has set completely and puffs a bit at the edges. Allow the pie to cool completely (during which time it will deflate a bit). It may be stored in the fridge for up to two days (highly recommend no more than one for best flavor).</p>"}]}