{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120208-bi-rite-market-book-cover-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bi-Rite Market's Eat Good Food", "coconut milk", "Cook the Book", "Dabney Gough", "recipe newsletter", "Sam Mogannam", "sides", "sweet potatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bi-Rite Market's Curried Coconut Sweet Potato Mash", "link": "https://www.seriouseats.com/recipes/2012/02/bi-rite-markets-curried-coconut-sweet-potato-mash-recipe.html", "description": "<a href=\"http://www.amazon.com/Bi-Rite-Markets-Eat-Good-Food/dp/158008303X/?tag=serieats-20\">Bi-Rite Market</a>'s <strong>Curried Coconut Sweet Potato Mash</strong> does a wonderful job of balancing sweet, spicy, and savory with the Indian-inspired combo of curry, cayenne, coconut milk, and a healthy dose of butter.  It's warm with heat and spice but never sugary or desserty, even with a sprinkling of toasted coconut just before serving.", "totalTime": "35 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Cook the Book", "Sides", "Sweet Potatoes and Yams", "Vegetarian"], "recipeIngredient": ["2 1/2 pounds sweet potatoes (3 or 4 large), scrubbed and cut into 11/2-inch chunks ", "4 tablespoons (1/4 cup) unsalted butter", "1 tablespoon mild curry powder", "1/4 teaspoon ground cinnamon ", "Pinch of cayenne pepper", "3/4 cup coconut milk (see tip below) ", "Kosher salt", "1 teaspoon freshly squeezed lemon juice, more\u2028as needed", "6 tablespoons toasted coconut flakes, sweetened \u2028or unsweetened (see note) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit a steamer basket into a large pot, add water just to the bottom of the basket, and arrange the sweet potatoes in a snug layer in the basket. Bring the water to a boil over medium-high heat, cover the pot, and lower the heat to maintain a vigorous simmer. Cook until the potatoes are completely tender when pierced with a skewer, 15 to 20 minutes. (Keep an eye on the water level during cooking, and add more if it threatens to boil off.) Remove from the heat, carefully remove the potatoes from the basket, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the water out of the pot and return to medium heat. Add the butter, curry, cinnamon, and cayenne and cook, stirring constantly, until the butter is melted and the spices are fragrant, about 2 minutes. Add the coconut milk and 1 1/2 teaspoons salt, bring to a simmer, and cook for an additional minute to thicken slightly. Remove from the heat and stir in the lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully peel off and discard the potato skins. Add the potatoes to the pot and mash until smooth and all ingredients are blended. (At this point you can adjust the consistency of the potatoes by adding up to 1/2 cup of water.) Taste and add more salt or lemon juice as needed. If necessary, rewarm over low heat, stirring constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, transfer to a serving dish and top with the coconut.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can make these potatoes up to a day ahead. Reheat in a covered ovenproof dish in a 350°F oven until heated through, about 40 minutes. Garnish just before serving.</p>\n\n<p><strong>Note:</strong> To toast coconut, spread it in an even layer on a rimmed baking sheet and bake in a 350°F oven, stirring occasionally, until golden.</p>\n\n<p><strong>Tip:</strong> Make sure you use coconut milk (which is unsweetened) and not coconut cream (which has a hefty dose of sugar added). And because the fatty coconut solids rise to the top, it’s always a good idea to whisk the entire contents of the can before measuring out the amount you need.<br />\n</p>"}]}