{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120527-208113-skewers-of-sage-chicken.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "grill", "grilling", "Mr. Sunday's Saturday Night Chicken", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lorraine Wallace's Skewers of Sage Chicken with Sweet Italian Sausage", "link": "https://www.seriouseats.com/recipes/2012/05/lorraine-wallaces-skewers-of-sage-chicken-with-sweet-italian-sausage.html", "description": "Memorial Day means that grilling season is officially upon us and with it comes the need for more grilling recipes in our lives.  And these <strong>Skewers of Sage Chicken with Sweet Italian Sausage</strong> from Lorraine Wallace's <em><strong><a href=\"http://www.amazon.com/Mr-Sundays-Saturday-Night-Chicken/dp/1118175301/?tag=serieats-20\">Mr. Sunday's Saturday Night Chicken</a></strong></em> are exactly what we're looking for.  Combining lean cubes of chicken breast with fatty, flavorful Italian sausage is a genius move, with all of those great porky juices cooking into the chicken along with a gorgeous olive oil infused with garlic and rosemary.  Oh, and those leaves of sage wedged between the chicken and sausage?  They've got all of the right bright, herbal notes that bring everything together.", "totalTime": "30 minutes plus at least 4 hours marinating time", "recipeYield": "serves 6", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["<strong>For the Rosemary-Garlic Oil:</strong>", "1 1/2 cups extra-virgin olive oil", "6 garlic cloves, smashed and peeled", "2 sprigs fresh rosemary, chopped ", "—", "<strong>For the skewers:</strong>", "2 pounds boneless, skinless chicken thighs, trimmed of excess fat and cut in half", "1/2 cup plus 2 tablespoons Rosemary-Garlic Oil", "1 tablespoon chopped fresh rosemary", "Coarse salt and freshly ground black pepper", "2 pounds sweet Italian sausages, cut into 2-inch pieces", "24 large fresh sage leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the rosemary-garlic oil:</strong> Combine all the ingredients in a small bowl and whisk well. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Up to a day ahead or 4 hours prior to cooking, rinse the chicken thighs in cold water and pat dry with paper towels. Toss the chicken with 2 tablespoons of the rosemary-garlic oil and the chopped rosemary. Season with salt and pepper. Cover and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the grill to medium-high heat (350°F–450°F). Place the 1/2 cup of rosemary-garlic oil in a small dish for brushing the skewers while grilling. Thread 3 pieces of the sausage, chicken, and sage leaves alternately on the metal skewers. Grill the skewers, covered, until one side is browned and has nice grill marks, about 4 minutes. Brush with the rosemary-garlic oil, flip, and cook until the other side is cooked, about 4 minutes more.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to cook, turning and brushing with the oil, until the sausage and chicken are both cooked through, about 10 minutes more. Cover with aluminum foil and let rest for a couple of minutes. To serve, arrange the skewers on a large platter and drizzle with the remaining rosemary-garlic oil.<br />\r\n</p>"}]}