{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121029-127677-Leek-Ham-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["cheese sauce", "ham", "ham sandwiches", "leeks", "sandwich", "sandwiched"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ham and Leek Sandwich with Cheddar Sauce", "link": "https://www.seriouseats.com/recipes/2012/10/ham-and-leek-sandwich-with-cheddar-sauce-recipe.html", "description": "Ham, leeks, and a velvety layer of bubbly, broiled cheddar sauce: ham-and-cheese sandwich that's not so ho-hum.", "totalTime": "20 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Cheese", "Ham", "Sandwiches"], "recipeIngredient": ["3 tablespoons unsalted butter", "2 medium leeks, white parts thinly sliced (about 1/2 cup)", "Kosher salt and freshly ground black pepper", "3 ounces French-style cooked ham, finely sliced", "1 tablespoon all-purpose flour", "3/4 cup warm milk", "2 ounces grated aged white cheddar or gruyere cheese (about 1/2 cup)", "1 teaspoon Dijon mustard", "1 large croissant or 1 (7-inch) piece baguette, split in half lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons butter in large skillet over medium-high heat. Add leeks and cook, stirring, until beginning to brown, about 3 minutes. Season with salt and pepper. Add ham and continue cooking and stirring until ham begins to brown, about 2 minutes. Transfer to plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet. Melt remaining tablespoon butter over medium-high heat. Stir in flour and coook, stirring constantly, until mixture just begins to turn golden, about 2 minutes. Add about 1/4 cup of milki n a slow, steady stream while constantly stirring. Once incorporated, continue pouring in the remaining milk, stirring until fully incorporated. Remove from heat and stir in cheese and mustard until smooth. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper-middle position and set to broil. Arrange bread pieces on baking sheet, cut-side up. Divide ham mixture evenly among them, then spoon sauce over. Broil until browned and bubbly, 2 to 3 minutes, depending on the broiler. Serve immediately.</p>"}]}