{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121025-226992-cook-the-book-tempura-green-beans-tapenade-dip.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "cynthia nims", "salty snacks", "sides", "tapenade", "tempura"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tempura Green Beans with Tapendade Dip from 'Salty Snacks'", "link": "https://www.seriouseats.com/recipes/2012/10/tempura-green-beans-with-tapenade-dip-from-salty-snacks-recipe.html", "description": "Vegetable tempura dipped in tapenade make for an utterly unique nibble in <strong><a href=\"http://www.monappetit.com/about-cynthia/\">Cynthia Nims's</a></strong> <em><a href=\"http://www.amazon.com/Salty-Snacks-Crisps-Crackers-Pretzels/dp/1607741814/?tag=serieats-20\">Salty Snacks</a></em>. To those used to dipping tempura in soy sauce and spreading tapenade on crackers, it may sound off-putting, but the two make better bedfellows than one might expect. In fact, the briny olive-caper-anchovy mixture is a perfect counterpoint to fried food, and the light grassiness of the beans takes well to delicate tempura batter.", "totalTime": "45 minutes to 1 hour", "recipeYield": "serves 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Condiments and Sauces", "Cook the Book", "Gluten-Free", "Legumes", "Sides"], "recipeIngredient": ["<strong>Tapenade Dip</strong>", "1 cup pitted black olives (about 6 ounces)", "2 tablespoons capers", "1 anchovy fillet, chopped", "1 teaspoon finely minced or pressed garlic", "1/4 cup freshly squeezed lemon juice, plus more if needed", "2 tablespoons olive oil", " ", "<strong>Tempura</strong>", "1 large egg", "1 cup ice water, plus more if needed", "1 cup sweet (white) rice flour or all-purpose flour", "Vegetable oil, for frying", "1 pound green beans, trimmed rinse, and well dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dip,</strong> combine the olives, capers, anchovy, and garlic in a food processor and pulse until finely chopped and well blended, scraping down the sides as needed. Add the lemon juice and olive oil and pulse a few times to blend. If the texture is too chunky or thick for a dip, purée it well and add a bit more lemon juice or water if needed. Transfer to a small serving bowl. It can be made up to 2 days ahead, covered, and refrigerated. Let it come to room temperature before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the tempura,</strong> pour about 2 inches of oil into a large heavy saucepan (the oil should not come more than halfway up the sides of the pan). Bring to 375°F over medium heat. When the oil is nearly to temperature, make the batter. Beat the egg with a fork in a bowl, then beat in the ice water. Add the flour gradually, beating gently as you go; avoid overmixing or the batter will become heavy. It should be of thin enough consistency to just delicately coat the beans. If it’s a bit too thick, beat in another tablespoon or two of ice water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop a small handful of green beans into the batter and stir to coat. Lift them out one by one with a fork or tongs, allowing excess batter to drip off, then gently add them individually to the hot oil to avoid clumping. Fry until crisp and lightly browned, 2 to 3 minutes. Scoop them out with a slotted spoon and drain on paper towels. Continue to coat and fry in batches, allowing the oil to reheat between batches as needed. Stir the batter gently between batches as well, especially if using rice flour, which quickly begins to settle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the dip to remix and set it in the center of a platter, surrounded by the tempura green beans. Serve right away.</p>"}]}