{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120802-ancho-chicken-tortilla-soup-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "chicken soup", "chili", "Mexican", "soup", "tortilla soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "5"}, "name": "Real-Deal Tortilla Soup", "link": "https://www.seriouseats.com/recipes/2012/08/real-deal-tortilla-soup-recipe.html", "description": "The mild heat of this hearty ancho chili-based soup is balanced by sweet corn and black beans.", "totalTime": "1 hour", "recipeYield": "makes 2 quarts, serving 4 to 6", "recipeCategory": ["Chicken", "Mains", "Mexican", "Soups and Stews"], "recipeIngredient": ["2 quarts low sodium canned or homemade chicken stock", "2 bone-in, skin-on chicken breast halves, about 1 pound total", "1 large onion, split in half, plus 1 large onion, finely diced (about 1 1/2 cups)", "2 ears of corn, shucked, kernels removed from cobs, milk scraped from empty cobs", "2 medium garlic cloves, whole, plus 2 medium cloves garlic, minced (about 1 tablespoon)", "3 whole dried ancho chilies, seeds and stems removed, flesh roughly torn into strips", "1 1/2 pounds ripe tomatoes, split in half", "2 tablespoons vegetable oil", "1 poblano pepper, seeded and finely diced (about 1 cup)", "Kosher salt and freshly ground black pepper", "1 tablespoon ground cumin", "2 tesapoons dried oregano", "1 (15-ounce) can black beans, drained and rinsed", "1 cup fresh cilantro leaves", "1 tablespoon corn flour", "&nbsp;", "<strong>To Serve</strong>:", "Diced avocado", "Fried tortilla strips or chips", "Chopped scallions", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place stock, chicken, split onion, empty corn cobs and scraped corn milk, 2 whole garlic cloves, and chilies in a large saucepan. Bring to a boil over high heat, then reduce to a simmer. Cook for 30 minutes, turning chicken occasionally, and topping up with water as necessary. Discard onion, corn cobs, and garlic cloves, and transfer chicken to a large plate. Set aside. When cool enough to handle, shred chicken into strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust rack to 4 inches below broiler element and preheat broiler to high. Place tomatoes cut side-up on a foil-lined broiler pan and broil until charred on top surface and completely softened, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine roasted tomatoes, stock, and re-hydrated chilies in the bowl of a blender. Blend on high speed until completely smooth and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large saucepan over medium-high heat until shimmering. Add onions, poblanos, and corn kernels. Season with salt and pepper, and cook, stirring frequently, until onions are softened but not browned, about 5 minutes. Add minced garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add cumin and oregano and cook, stirring frequently, until fragrant, about 30 seconds longer. Add beans and half of cilantro and stir to combine. Pour tomato-chili stock into the pot through a fine mesh strainer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk corn flour into soup. Bring to a simmer, and season to taste with salt and pepper. Let cook, stirring frequently, until onions and poblanos are totally softened, 5 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve soup, garnished with chicken, avocado, fried tortilla strips, scallions, lime wedges, and remaining cilantro.</p>"}]}