{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/201203015-195707-knead-the-book-kneadlessly-simple-english-muffin-bread-primary.jpg", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kneadlessly Simple's English Muffin Loaves", "link": "https://www.seriouseats.com/recipes/2012/03/kneadlessly-simples-english-muffin-bread-loaves.html", "description": "[Photograph: Donna Currie] Adapted from Kneadlessly Simple by Nancy Baggett. Copyright © 2009. Published by Wiley. Available wherever books are sold. All Rights Reserved...", "totalTime": "Up to 30 hours, depending on rising time", "recipeYield": "Makes 2 medium loaves, about 12 slices each", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["5 cups (25 ounces) unbleached all purpose white flour, plus more as needed", "1 tablespoon granulated sugar ", "2 teaspoons table salt", "1 teaspoon instant, fast-rising, or bread machine yeast", "2 1⁄2 tablespoons corn oil or other flavorless vegetable oil, plus extra for coating dough top and baking pans", "2 2⁄3 cups ice water, plus more if needed", "1⁄3 cup top-quality instant nonfat powdered milk (don’t use a generic brand)", "About 2 tablespoons cornmeal for coating pans (substitute flour if unavailable)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>FIRST RISE: In a very large bowl, thoroughly stir together the flour, sugar, salt, and yeast. In another bowl or measuring cup, whisk together the oil and ice water. Vigorously stir the ice-water mixture into the dry ingredients, scraping down the bowl sides completely and mixing until the dough is thoroughly blended. If it is too dry to mix together, gradually stir in just enough more ice water to blend the ingredients; don’t over-moisten, as the dough should be fairly stiff. If necessary, stir in more flour to stiffen it. Brush or spray the dough top with oil. Tightly cover the bowl with plastic wrap. If desired, for best flavor or for convenience, you can refrigerate the dough for 3 to 10 hours. Then let rise at cool room temperature for 12 to 18 hours; if convenient, vigorously stir once during the rise. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>SECOND RISE: Vigorously stir the powdered milk into the dough. Then vigorously stir in enough more flour to yield a very stiff dough. Generously grease two 8 1/2  × 4 1/2-inch loaf pans. Sprinkle them with the cornmeal, then tip the pans back and forth to coat evenly. Using well-oiled kitchen shears or a serrated knife, cut the dough in half and place the portions in the pans. Brush or spray the tops with oil, then using an oiled rubber spatula or fingertips, smooth out the surface and press the dough evenly into the pans. Tightly cover the pans with nonstick spray–coated plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>LET RISE USING ANY OF THESE METHODS: For a 1 1/2- to 2 1/2-hour regular rise, let stand at warm room temperature; for a 1- to 2-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water; or for an extended rise, refrigerate, covered, for 4 to 24 hours, then set out at room temperature. Continue the rise until the dough nears the plastic. Remove it and continue until the dough just reaches the pan rims.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>BAKING PRELIMINARIES: 15 minutes before baking time, place a rack in the lower third of the oven; preheat to 400ºF. Spritz or brush the loaf tops with water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>BAKING: Reduce the oven temperature to 375ºF. Bake on the lower rack for 30 to 40 minutes, or until the tops are well browned. Cover the loaves with foil and continue baking for 10 to 20 minutes, until a skewer inserted in the thickest part comes out with just a few crumbs on the tip (or until the centers register 208º to 210ºF on an instant-read thermometer). Then bake for 5 to10 minutes longer to ensure the centers are baked through. Cool in the pans on a wire rack for 10 to 15 minutes. Remove the loaves to the rack. Cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>SERVING AND STORING: Cool thoroughly before slicing or storing. Serve toasted. Store in plastic or aluminum foil. The bread will keep at room temperature for 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}