{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/spider%20unbaked.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "spider bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spider Bread", "link": "https://www.seriouseats.com/recipes/2012/10/spider-bread.html", "description": "I found a spider in my oven. Fortunately, it was a loaf of bread. If you're also in the Halloween spirit, bake up this slightly spooky but mostly adorable bread.", "totalTime": "2 bours, 30 minutes", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Bread", "Bread Baking", "Halloween"], "recipeIngredient": ["1 cup lukewarm water", "2 1/4 teaspoons instant yeast", "2 tablespoons honey", "1/4 cup Greek yogurt", "13 1/2 to 15 3/4 ounces (3 to 3 1/2 cups ) bread flour", "1 1/2 teaspoons salt", "1 tablespoon olive oil", "Eggwash (1 egg beaten 1ith 1 tablespoon water)", "Poppy seeds, as needed", "Sesame seeds, as needed", "1 dried apricot (or other dried fruit)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the water, yeast, honey, and yogurt in the bowl of your stand mixer. Whisk until the honey has dissolved. Add the 3 cups of flour and salt. Knead with the dough hook until the mixture is smooth and elastic.The dough should completely gather around the hook and the bowl should be clean. If there's a little \"foot\" of dough clinging to the bottom of the bowl, add more flour, a little at a time, until the dough gathers up that foot into the doughball. Add the olive oil and continue kneading until the oil is completely incorporated into the dough. Cover the bowl with plastic wrap and set aside until doubled in size, about an hour. Meanwhile, line a baking sheet with parchment paper and sprinkle cornmeal on the sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface and turn out the dough. Knead it briefly. Cut off a piece of dough that's about 1/4 of the dough, form it into a rectangle, and roll it to about 3 inches wide by 12 inches long. Using a pastry cutter, pizza cutter, or sharp knife, trim the edges, then cut it into 4 strips - this will form the 8 legs. Lay the strips on the baking sheet to form the legs of the spider. Stretch them longer, if you like or trim them so they're shorter - it's your spider, so make it look however you like. Take the trimmed pieces, and add them to the unused piece of dough. Divide that piece into two, with once piece about 1/3 of the dough and the other piece 2/3 of the dough. Form those pieces into to rounds, and arrange them on top of the legs you formed to make the head and body of the spider. Make sure the two pieces are touching each other. Adjust the legs so they look the way you want them to. Cover the completed spider with plastic wrap and set aside until doubled in size, about 30 minutes. Meanwhile, preheat the oven to 350&deg;F with the rack in the center of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the spider. If you're using several types of seeds, it's best to eggwash one part of the spider at a time. I eggwashed the legs first and sprinkled them with poppy seeds, then I eggwashed the body and sprinkled that with brown sesame seeds. Before you sprinkle the head section, cut the dried fruit (if needed) to the shape you want and apply them to the eggwashed head section. Then sprinkle the head with the seeds you choose. I used a combination of toasted sesame seeds and poppy seeds for the head. Make a vertical snip to create the mouth, and if you like, make small snips at the ends of the front feet for a little extra character. Bake at 350&deg;F until the bread is nicely browned, about 30 minutes. Rotate the pan in the oven so it bakes evenly during baking, if necessary.</p>"}]}