{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120927-223556-cook-the-book-chilaquiles-with-tomatillo-salsa.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["brunch", "chilaquiles", "Cook the Book", "eli sussman", "fried eggs", "max sussman", "this is a cookbook", "tomatillos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Max and Eli Sussman's Chilaquiles with Tomatillo Salsa", "link": "https://www.seriouseats.com/recipes/2012/09/max-and-eli-sussmans-chilaquiles-with-tomatillo-salsa-recipe.html", "description": "Any of the meals in the \"Lazy Brunch\" chapter would be excellent contenders for a home-cooked hangover helper, but perhaps the most appropriate is <strong>Max and Eli Sussman's</strong> recipe for five-minute <strong>Chilaquiles with Tomatillo Salsa</strong>. Simply a pile of chips smothered in warmed salsa, leftover chicken, eggs, and cheese, the dish isn't (I would say) true chilaquiles, but it certainly fills that greasy, rich void when the most you can handle in the morning is to fry an egg.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4", "recipeCategory": ["Breakfast and Brunch", "Cheese", "Chicken", "Cook the Book", "Fried Eggs"], "recipeIngredient": ["<strong>For the Tomatillo Salsa</strong>", "3 pounds tomatillos", "1/2 yellow onion, cut into big chunks", "1 jalapeño", "2 garlic cloves", "2 tablespoons extra-virgin olive oil", "Salt", "Leaves from 1 bunch fresh cilantro, roughly chopped", " ", "4 large eggs", "2 tablespoons olive oil", "2 cups leftover or store-bough roasted chicken, shredded (optional)", "1 large bag tortilla chips, preferably thick cut", "Crumbled queso fresco, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the tomatillo salsa:</strong> Preheat the oven to 400 degrees. Peel the papery husks off the tomatillos and rinse under warm water to remove the sticky coating. Put the tomatillos in a large bowl along with the onion, jalapeño, garlic, extra-virgin olive oil, and salt to taste. Toss to mix well. Spread in a single layer on a baking sheet and roast until the skins of the tomatillos and jalapeño are blistered and tender, 20 to 25 minutes. Let cool slightly, then remove the stem from the jalapeño, along with some or all of the seeds if you want a milder salsa.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the jalapeño and the rest of the contents of the baking sheet to a food processor and process to a coarse purée. Transfer to a bowl and let cool, then stir in half of the cilantro. Taste and adjust the seasoning. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan, warm the olive oil over medium heat. Carefully crack the eggs into the pan without breaking the yolks. Cook, without disturbing, until the whites are just set, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the chilaquiles:</strong> Warm the tomatillo salsa and the chicken, if using, in a saucepan until the salsa is just simmering. Spread the chips on a serving platter and arrange a layer of the salsa and chicken, if using, on top. Sprinkle with some crumbled queso fresco and half of the remaining cilantro. Carefully slide the fried eggs on top. Garnish with more queso fresco and cilantro and serve right away.</p>"}]}