{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120806-lemon-blackberry-swirl-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["blackberries", "frozen desserts", "ice cream", "lemon", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Lemon Ginger Blackberry Swirl Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/08/lemon-ginger-blackberry-swirl-ice-cream-recipe.html", "description": "This ice cream pairs a bright, slightly spicy lemon-ginger base with a dark, sweet, and tart blackberry swirl.", "totalTime": "2 hours, plus an overnight chill", "recipeYield": "makes about 1 quart", "recipeCategory": ["Ginger", "Ice Cream and Frozen Treats", "Lemon", "Scooped"], "recipeIngredient": ["2 cups heavy cream", "1 cup whole milk", "Peels of two large lemons, removed with a vegetable peeler", "3 tablespoons minced ginger", "3 1/2 cups blackberries (about 18 ounces)", "1 1/4 cup sugar, divided", "3/4 teaspoon kosher salt, divided", "6 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy saucepan, bring cream and milk to a simmer. Stir in lemon peels and ginger, cover, and remove from heat. Let steep for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pur&eacute;e blackberries in a blender or food processor just until they break apart into a liquid and no large chunks remain (see note). Slowly pour pur&eacute;e through a strainer and gently stir with a fork or whisk. Measure out 1 1/2 cups strained juice and discard blackberry pulp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy saucepan, bring strained blackberry juice to a simmer on medium heat and reduce to 1/2 cup, stirring frequently. Stir in 1/2 cup sugar and 1/4 teaspoon salt until dissolved. Transfer to a small container and chill in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean, heavy saucepan, whisk together 3/4 cups sugar with egg yolks until pale in color and thickened. When dairy finishes steeping, pour through a strainer into pot and whisk to combine with yolk-sugar mixture. Put saucepan on medium heat and cook, stirring frequently, until a custard forms on the back of a spoon, but a finger swiped across the back leaves a clean line. Add 1/2 teaspoon salt. Pour through a stainer into an airtight container and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, churn in ice cream maker according to manufacturer's instructions. While ice cream is churning, remove blackberry syrup from freezer and stir to loosen. Transfer 1/3 of finished ice cream into an airtight container, then quickly spread on half of syrup. Repeat, and top off with last 1/3 of ice cream. Chill in freezer until firm, at least three hours, preferably longer.</p>"}]}