{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120327-199170-birds-nest-pie.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["asparagus", "Cook the Book", "egg", "Jim Lahey", "mushrooms", "My Pizza", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jim Lahey's Bird's Nest Pie", "link": "https://www.seriouseats.com/recipes/2012/03/jim-lahey-birds-nest-pie-pizza.html", "description": "Aside from being one of the loveliest pizzas on the menu at <a href=\"http://www.sullivanstreetbakery.com/history\">Jim Lahey</a>'s pizzeria, <a href=\"http://www.co-pane.com/\">Co.</a>, it's also the most spring appropriate.  Beginning with Lahey's signature <a href=\"http://www.seriouseats.com/recipes/2012/03/jim-laheys-no-knead-pizza-dough-recipe.html\">No-Knead Pizza Dough</a>, this pie gets topped off with finely grated Parmesan, nutty Saint-Nectaire cheese, and a tangle of thinly shaved asparagus stalks.  Sounds pretty good, right?  Just wait, it's about to get even better.", "totalTime": "30 minutes", "recipeYield": "Makes one 10- to 12-inch pizza", "recipeCategory": ["Asparagus", "Cook the Book", "Eggs", "Mushrooms", "Pizza"], "recipeIngredient": ["120 grams (3 to 4) thick asparagus spears", "1 ball of <a href=\"http://www.seriouseats.com/recipes/2012/03/jim-laheys-no-knead-pizza-dough-recipe.html\">No-Knead Pizza Dough</a>, shaped and waiting on a floured peel", "15 grams (1/4 cup) finely grated Parmigiano-Reggiano cheese", "20 grams (about 3/4 ounce) Saint Nectaire cheese, cut into 6 chunks ", "4 to 6 quail eggs (see Note) ", "Pinch of fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pizza stone in a gas oven on a rack about 8 inches from the broiler. Preheat the oven on bake at 500°F for 30 minutes. Switch to broil for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut away about 2 inches of the base of each asparagus spear. With a vegetable peeler, shave the entire asparagus from bottom to top, reversing your grip and rotating as necessary to shave as much as possible. Don’t rush it; be deliberate for the greatest precision. You should have about 90 grams (3 unces) of very thin ribbons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the dough on the peel, sprinkle the Parmigiano evenly over the surface and distribute the chunks of Saint Nectaire on top. Arrange the asparagus shavings over the cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With quick, jerking motions, slide the pie onto the stone. Broil for 2½ minutes under gas (somewhat longer with an electric oven). The cheese should be bubbling, the crust only slightly charred.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the peel, pull the pizza out of the oven. Close the oven to conserve heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs very carefully to keep each yolk whole. Place the eggs around the pizza (one for each slice). Sprinkle the salt evenly over the pie. Return to the oven to broil for 1 minute, until the eggs are set but not hard and the charring is deeper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the peel, transfer the pizza to a tray or serving platter. Slice into wedges (cutting through the egg yolks to allow them to spread slightly). Serve immediately.</p>\n\n<p><small><strong>Note:</strong> If quail eggs are unavailable (farmer’s markets are often an excellent source), go with the smallest eggs you can find. In the restaurant I dress up the pie more than I do here, with a slice of oil-packed truffle on each yolk. But those truffles in oil are virtually impossible to find retail. If you’re feeling flush, go ahead and put a slice of truffle on each yolk or, for that matter, a drizzle of truffle oil (but not both, which would be overwhelming). In any case, the way I present it here—truffle-less—is great.</p>"}]}