{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120316-197752-dinner-tonight-braised-brasque-chicken-tomato-paprika-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["chicken", "Dinner Tonight", "mains", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Daniel Boulud's Braised Basque Chicken with Tomatoes and Paprika", "link": "https://www.seriouseats.com/recipes/2012/03/daniel-bouluds-braised-basque-chicken-with-tomatoes-and-paprika-recipe.html", "description": "[Photograph: Nick Kindelsperger] Adapted from Melissa Clark's Chef, Interrupted About the author: Nick Kindelsperger is the editor of Serious Eats: Chicago. He loves tacos and spicy food. You can follow him as @nickdk on Twitter....", "totalTime": "1 hour", "recipeYield": "serves 4 to 6", "recipeCategory": ["Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["4 ounces Spanish chorizo, sliced 1/4-inch thick ", "3 pounds chicken thighs and breasts", "Salt and pepper", "2 red bell peppers, stemmed, seeded, and cut into 1/2-inch thick strips", "2 small red onions, sliced", "6 garlic cloves, thinly sliced ", "2 sprigs fresh thyme ", "3/4 cup dry sherry", "1 cup cherry tomatoes, halved (or diced plum tomatoes) ", "2 teaspoons sweet paprika ", "3/4 teaspoon crushed red pepper flakes", "Handful fresh basil, thinly sliced, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to the bottom-third position and preheat the oven to 350&deg;F. Meanwhile, set a large ovenproof skillet over medium heat and add the chorizo. Cook, stirring occasionally, until chorizo has rendered some fat and is starting to brown. Remove chorizo with a slotted spoon and drain on some paper towels. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the thighs and breasts with salt and pepper on both sides. Add the chicken pieces to the skillet and brown on both sides, about ten minutes total. Remove the chicken pieces and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all but two tablespoons of fat in the skillet. Add the bell peppers, onions, garlic, and thyme. Season with salt and cook, stirring occasionally, until vegetables are soft, about five minutes. Add the sherry, tomatoes, paprika, and red pepper flakes. Stir well to dislodge any browned bits and simmer for one minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle the thighs in the skillet (you'll add the breasts later) and add the cooked chorizo. Cover the skillet and place in the oven. Cook for 15 minutes, and then remove the skillet, flip the thighs, and add the breast pieces. Cover again and return to the oven. Cook until the chicken pieces are completely cooked, ten to fifteen minutes. If needed, season with more salt and pepper. Garnish with basil. Serve. </p>"}]}