{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20121017butterfingertrio610.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "butterfinger", "candy", "candy bar", "chocolate", "gluten free", "peanuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Butterfingers", "link": "https://www.seriouseats.com/recipes/2012/01/bravetart-homemade-butterfinger-candy-bar-recipe.html", "description": "Making Butterfingers for yourself takes a fair amount of time, but the work itself isn't actually hard if you're patient.", "totalTime": "90 minutes", "recipeYield": "makes 10 candy bars", "recipeCategory": ["Candy", "Chocolate", "Dairy-Free", "Desserts", "Gluten-Free", "Nuts", "Vegan"], "recipeIngredient": ["4 ounces water", "1 1/4 ounces molasses", "1 ounce corn syrup", "8 ounces sugar", "1 vanilla bean, split and scraped", "8 ounces roasted, salted peanuts", "2 ounces powdered sugar", "1/2 ounce corn flakes", "40 ounces chocolate, divided "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the candy:</p>\n\n<p>Line a jelly roll pan (a 1/2 sheet pan) with a silicon mat and preheat oven to 200&deg; F.</p>\n\n<p>In a medium pot, combine water, molasses, corn syrup, sugar and vanilla bean seeds. Set over medium heat and stir gently with a fork, taking care not to splash, until sugar dissolves and the mixture begins to simmer. Simmer, undisturbed, until the mixture reaches between 280 and 290&deg;F on a candy thermometer. Due to the molasses, the mixture will have a sketchy burning smell, but remain within the recommended temperatures and rest assured that it’s not actually burning. Cooking molasses just smells funky.</p>\n\n<p>While the syrup is cooking, grind the peanuts and powdered sugar together in a food processor until the mixture forms a thick, damp mass with a texture like wet sand. Set aside.</p>\n\n<p>When the syrup comes to temperature, immediately pour the mixture onto the silicon mat in the sheet pan, taking care to keep the syrup within the center of the mat. Wearing a pair of oven mitts, tilt the pan left and right to help the syrup evenly coat the silicon mat into a roughly 14” by 10” rectangular shape. </p>\n\n<p>You can fold the candy back over on itself if any places flow out too far.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer the candy:</p>\n\n<p>If you’ve ever laminated dough, this will be a familiar process; if not, imagine this next step as folding a business letter in thirds. </p>\n\n<p>Sprinkle the ground peanut mixture in an even a layer over 2/3 of the candy. </p>\n\n<p>Use the silicon mat to fold the unsprinkled section up and over the center of the candy, just like the first fold of a business letter. If the candy sticks to the silicon, it’s still too hot. Wait a few moments for it to cool, then peel the silicon away; no rush. Now fold this double-thick section up and over the remaining piece. You will now have a 3 layer candy packet roughly 11” x 5”.</p>\n\n<p>Place the sheet pan in the preheated oven for 5 minutes, or until the candy has become warm and pliable. Remove it from the oven and lift out the silicon mat, setting it on the counter. Use a rolling pin to gently roll it out to a 14” x 10” rectangle; it will take some elbow grease. If at any time the candy begins to make a cracking sound, or feels too stiff to roll, return the pan to the oven for a minute or two. Take your time! Once you’ve rolled it out, fold it into thirds again just as you did the first time.</p>\n\n<p>Return the candy to the oven for another 4 minutes, then roll back out to a 14” x 10” rectangle. Sprinkle this rectangle with corn flakes, as you did with the peanut mixture. Fold into thirds (if, while folding the candy makes a cracking noise, stop folding and return it to the oven for about a minute, then proceed with folding). Return folded packet to the oven for another 4 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the candy into bars:</p>\n\n<p>Now roll the candy to 1/2” thickness and then transfer to a cutting board. Use a sharp knife to trim the edges, leaving a tidy rectangle behind. You may be able to immediately cut the candy into 10 long, thin bars. But you may find you need to return it to the oven for a minute or two. This generally depends on the temperature of the kitchen. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumb coat the bars:</p>\n\n<p>Due to the extreme flakiness of the candy, it’s important to “crumb coat” the candy bars before dipping in chocolate. Do this by tempering 12 ounces of chocolate. Drizzle or pipe a thin line of chocolate onto the bottom of each candy piece and then flip each over to form a foot on the bottom. Next, drizzle a little chocolate over each bar and use a small pastry brush to evenly coat the bar in a thin layer of chocolate. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dipping the bars:</p>\n\n<p>Once the chocolate has set, temper the remaining chocolate and dip each bar. Store the finished bars in an airtight container, indefinitely.</p>"}]}