{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120424-203274-asparagus-with-parmesan-pudding.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Girl and Her Pig", "April Bloomfeild", "asparagus", "Cook the Book", "custards", "egg", "prosciutto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "April Bloomfield's Asparagus with Parmesan Pudding and Prosciutto", "link": "https://www.seriouseats.com/recipes/2012/04/april-bloomfields-asparagus-with-parmesan-pud.html", "description": "Asparagus, eggs, and prosciutto are the unofficial holy trinity of springtime cooking.  And since these three are so well matched, figuring out how to prepare them isn't much of a issue.  You could grill the asparagus, wrap it in prosciutto, and top it off with a poached egg, or throw these three guys in an frittata or a quiche.  But if you really want to do right by your asparagus, eggs, and prosciutto, you'll want to give <a href=\"http://thespottedpig.com/info.php\">April Bloomfield</a>'s <strong>Asparagus with Parmesan Pudding and Prosciutto</strong> a go.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Cook the Book", "Eggs"], "recipeIngredient": ["<strong>For the Pudding:</strong>", "¾ cup heavy cream", "¼ cup whole milk", "2 spring garlic cloves, or 1 small garlic clove, finely chopped", "1-ounce chunk Parmesan, finely grated", "½ teaspoon Maldon or other flaky sea salt", "1 large egg", "1 large egg yolk", " ", "<strong>For the Asparagus</strong>", "1 tablespoon extra virgin olive oil, plus a drizzle", "16 asparagus spears, a little thicker than a pencil, woody bottoms discarded", "Maldon or other flaky sea salt", "A very small handful of small, tender basil leaves", "½ lemon (optional)", "12 thin slices prosciutto", "Grilled or toasted slices of rustic bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the pudding:</strong> Preheat the oven to 325°F. Combine the cream and milk in a measuring cup. Pour half of the mixture into a medium pot, add the garlic, Parmesan, and salt, and set the pot over medium heat. Let the liquid come to a simmer and cook for 1 minute, then turn off the heat. Blend the hot mixture until it is smooth.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the egg yolk and the remaining cold cream mixture in a medium bowl and whisk really well. Whisk in the hot blended mixture.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into a small (2-cup) gratin dish. Let it sit for a few minutes, skimming off the froth that develops on the surface with a spoon. Fold a small kitchen towel into a square, put it into a large baking dish, and set the gratin dish on top. Pour enough water into the pot to come to about an inch from the dish’s rim.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully put the pot in the oven and cook just until the custard has set; it should be slightly firm around the edges but still wobbly in the middle. Remove the pot from the oven and let the custard cool in the water, then remove it. (You can refrigerate the custard overnight, if you wish. I like to serve it at room temperature.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the asparagus:</strong> Heat the olive oil over medium heat in a heavy pan big enough to hold all the asparagus in one layer just until it begins to smoke. Add the asparagus to the pan, lining up the spears in the same direction. The oil should crackle and sizzle a bit. Give the spears a toss with tongs, sprinkle with a good pinch of salt, and spread out in one layer. Cook, turning the spears occasionally, until they’re golden brown in spots and tender but still snappy, about 6 minutes. Give one of the spears a squeeze—it should give just a little; it shouldn’t feel either very firm or mushy.<br />\r\nJust a minute before they’re done, sprinkle the basil over the asparagus and drizzle on a little more olive oil. Flip the spears with tongs and play with the basil a little, giving it time against the hot pan and then moving it back onto the asparagus. It’s nice if it gets just a little crispy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take off the heat and let the asparagus gently finish cooking in the heat of the pan, stirring now and then and sprinkling on a little more salt and maybe a splash of lemon juice, if you’d like, just until you can pick up a spear without scalding your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the asparagus on a platter with the custard, prosciutto, and olive oil–lashed toasted or grilled bread alongside.</p>"}]}