{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120402-wakeandbake-hotcrossbuns.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["breakfast sweets", "hot cross buns"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hot Cross Buns", "link": "https://www.seriouseats.com/recipes/2012/04/hot-cross-buns-recipe.html", "description": "These slightly sweet, iced buns are traditional for Good Friday.", "totalTime": "3 hours", "recipeYield": "makes about 2 dozen buns", "recipeCategory": ["Bread", "Breakfast Sweets", "Easter"], "recipeIngredient": ["1 cup whole milk, heated", "2 1/4 teaspoons active dry yeast", "1/2 cup sugar", "6 tablespoons (3/4 stick) unsalted butter, melted", "1 large egg plus 1 egg white", "1/2 teaspoon salt", "4 cups (about 20 ounces) all-purpose flour", "1/2 cup raisins or currants", "1 cup confectioners' sugar", "2 tablespoons milk (or more if necessary)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine warm milk and yeast. Let sit until foaming, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a paddle attachment, combine sugar and butter. Beat on medium speed until well-combined, about 2 minutes. With mixer running, add whole egg (keep egg white refrigerated until step 4) and salt, then slowly add milk and yeast mixture. Mix for 30 seconds until homogenous, stoping and scraping down sides as necessary. Stop mixer and add flour. Mix on medium-low speed until dough just comes together, about 30 seconds. Switch to hook attachment and knead dough at low speed for 5 minutes. Cover bowl with a kitchen towel and let rest until risen and doubled in size, 1 1/2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your hands and transfer dough to a lightly floured surface. Punch down dough and mix in raisins. Knead by hand for an additional 2 minutes. Line two baking sheets with parchment paper. Pull off 2-inch pieces of dough and roll into balls (you should make about 24 balls). Place rolls on two baking sheets a few inches apart, cover with a clean kitchen towel, and let rest until almost doubled in size, about 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While dough rises, adjust oven racks to upper and lower middle positions and preheat oven to 400&deg;F. In a small bowl, whisk together remaining egg white with 1 teaspoon water. Brush each roll with egg wash. Bake rolls until golden and sound hollow when tapped on bottom, about 15 minutes, rotating pans back to front and top to bottom half way through cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together 1 cup of confectioners' sugar with two tablespoons of milk until smooth, adding more milk if necessary. Pipe glaze over buns in a cross pattern. Serve warm. </p>"}]}