{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/01142011-187467-sunday-brunch-seafood-pancakes-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "pancake", "Seafood Pancakes", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Seafood Pancakes", "link": "https://www.seriouseats.com/recipes/2012/01/seafood-pancake-oyster-shrimp-scallop-crisp-brunch.html", "description": "These pancakes are modeled after the popular Korean dish <em>haemul jeon</em>.  The temptation to load these pancakes with every available shellfish at the fish counter can be overwhelming, but I recommend self-restraint; two to three varieties of shellfish are the most that should go into these pancakes.  Generally I like to pair shellfish that have different textures; a favorite combination in my kitchen is shrimp and mussel.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Other Seafood", "Pancake", "Shrimp", "Sunday Supper"], "recipeIngredient": ["1 1/2 pounds assorted seafood (shrimp, scallops, squid, oysters and mussels all work well)", "7 scallions, thinly sliced", "1/2 teaspoon finely grated ginger", "3 cloves garlic, minced", "1/2 teaspoon salt", "2 cups all-purpose flour", "1 1/2 cups water", "2 eggs, beaten", "vegetable oil for cooking", "crushed red pepper (optional)", "soy sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare seafood (shell shrimp, coarsely chop scallops if large, thinly slice squid, shuck oysters, steam mussels to remove shell).  Combine scallions, ginger, garlic, salt, and flour in a large bowl and mix until well combined.  In a separate bowl mix water and egg until well combined.  Mix flour mixture and egg/water mixture until well combined, making sure there are no lumps.  Add mixed seafood and mix until seafood is evenly distributed; season with optional ingredients, if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to low, and place baking sheet or dish inside.  Heat skillet or griddle over medium high heat and add drizzle of oil.  Using a 1/4 cup measure, drop batter onto griddle, making sure each pancake does not touch any other.  Cook in batches, flipping when bubbles appear on the surface of the pancake. Keep pancakes warm in oven until all the batter is cooked.  </p>"}]}