{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120725-jenis-green-tea-ice-cream.jpg", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["green tea", "ice cream", "jeni britton bauer", "jeni's splendid ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Jeni Britton Bauer's Jasmine Green Tea Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/07/jeni-britton-bauers-jasmine-green-tea-ice-cream-recipe.html", "description": "Jasmine-scented green tea infuses cream with the heady aroma of jasmine and the tannic, mouth gripping attributes of green tea. It is a very refreshing flavor for summer, and a makes a beautiful dessert all on its own in a pretty bowl, or as an accompaniment to a fresh apricot or cherry crisp.", "totalTime": "", "recipeYield": "Makes about 1 quart", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["2 cups whole milk", "1 tablespoon plus 1 teaspoon cornstarch", "1 1/2 ounces (3 tablespoons) cream cheese, softened", "1 1/4 cups heavy cream", "2/3 cup sugar", "2 tablespoons light corn syrup", "1/4 cup jasmine green tea leaves", "2 cups Sugar-Plumped Cherries (recipe below) ", " ", "<strong>For Sugar-Plumped Cherries</strong>", "2 cups dried cherries ", "1 cup plus 2 tablespoons water", "1 cup sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Cherries</strong>:Put the cherries in a heatproof bowl. Combine the water and sugar in a small saucepan and bring to a boil, stirring to dissolve the sugar. Pour the syrup over the cherries and let cool to room temperature. Refrigerate until chilled (the cherries will keep for up to a month in the refrigerator). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prep</strong>: Mix about 2 tablespoons of the milk with the cornstarch in a small bowl to make a smooth slurry. Whisk the cream cheese in a medium bowl until smooth. Fill a large bowl with ice and water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook</strong>:Combine the remaining milk, the cream, sugar, and corn syrup in a 4-quart saucepan, bring to a rolling boil over medium-high heat, and boil for 4 minutes. Remove from the heat, add the tea, and let steep for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the milk mixture through a fine sieve, pressing on the tea leaves to extract as much cream as possible. Return to the saucepan and gradually whisk in the cornstarch slurry. Bring back to a boil over medium-high heat and cook, stirring with a heatproof spatula, until slightly thickened, about 1 minute. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chill</strong>:Gradually whisk the hot milk mixture into the cream cheese until smooth. Pour the mixture into a 1-gallon Ziploc freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Freeze:</strong> Pour the ice cream base into the frozen canister and spin until thick and creamy.  Drain the cherries well.Pack the ice cream into a storage container, layering it with the cherries as you go. Press a sheet of parchment directly against the surface and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours.</p>"}]}