{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120312-kale-quiche-pie.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfasts", "comte", "egg", "gruyere", "kale", "quiche", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Easy Kale Quiche", "link": "https://www.seriouseats.com/recipes/2012/03/easy-kale-quiche.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science of home cooking in his weekly column The Food Lab. You can follow him at...", "totalTime": "1 hour", "recipeYield": "serves 4 to 6", "recipeCategory": ["Breakfast and Brunch", "Cheese", "Eggs", "Kale", "Mains", "Quiche", "Vegetarian"], "recipeIngredient": ["1 large bunch (about 1 1/2 pounds) kale, thick stalks discarded, leaves roughly chopped", "Kosher salt and freshly ground black pepper", "1 1/2 cups half and half", "2 whole eggs", "4 ounces grated gruyère or Comté cheese", "1/8th teaspoon freshly grated nutmeg", "2 slices high quality sandwich bread or rustic country bread, crusts removed", "2 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350°F. Bring a large pot of salted water to a boil over high heat. Add kale and press down with a wire-mesh strainer to submerge. Cook until barely tender but still bright green, about 3 minutes. Transfer kale to a colander and run under cold water until chilled. Squeeze out excess moisture then transfer kale to the center of a clean dish towel. Roll up towel to encase the kale, then twist the ends to wring out excess moisture. Transfer dried kale to a cutting board and chop into 1- to 1/2-inch pieces. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine half and half and eggs in a large bowl and whisk until homogenous. Season with 1 teaspoon salt and a pinch of black pepper. Add kale, cheese, and nutmeg and mix with hands to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bread in the bowl of a food processor and pulse until fine crumbs are achieved. Grease a 9-inch deep-dish pie plate or a cast iron skillet with better. Add bread crumbs and rotate plate while shaking to coat bottom and sides. Discard extra crumbs. Pour kale filling into prepared pie plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pie plate on a rimmed aluminum baking sheet and bake until center is just barely set but still jiggles when touched, about 35 minutes. Remove from oven and allow to cool at least 15 minutes before serving. Quiche can be served warm, at room temperature, or straight out of the fridge.</p>"}]}