{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120904-221263-strawberry-balsamic-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pastry cream", "pie", "pie of the week", "strawberries", "strawberry desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Strawberry Balsamic Custard Tart", "link": "https://www.seriouseats.com/recipes/2012/09/strawberry-balsamic-custard-tart-recipe.html", "description": "This tart brings together excellent combinations of flavor and texture to make one delicious and refreshing dessert. The crust, a crumbly chocolate sable, is filled with vanilla pastry cream, and topped with fresh sliced strawberries and a drizzle of balsamic vinegar. While vinegar as a dessert condiment may seem a little unorthodox, the slightly sweet, slightly savory acidity compliments the sweetness of the strawberries and the pastry cream. It's just the thing when you're in the mood for something a little less traditional.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles", "Strawberry"], "recipeIngredient": ["1 1/2 cups (about 7 1/2 ounces) all-purpose flour", "3/4 cup confectioners' sugar", "1/2 cup cocoa powder", "Pinch salt", "9 tablespoons (1 stick plus 1 tablespoon) cold unsalted butter, cut into 1/4-inch pices ", "1 large egg yolk", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2011/08/pastry-cream-recipe-for-cakes-eclairs-pastries.html?ref=search\">Vanilla Pastry Cream</a>, chilled", "1 quart strawberries, hulled and sliced", "3 to 4 tablespoons aged balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of food processor, pulse flour, confectioners' sugar, cocoa, and salt until combined, about 3 one-second pulses. Add butter and pulse until mixture is consistency of wet sand, with no visible bits of butter remaining, about 10 to 15 quick pulses. Add yolk and pulse until dough just begins to come together. Wrap dough with plastic wrap into 5-inch disc and chill until firm, at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Roll out dough between 2 pieces of parchment paper, plastic wrap, or on lightly floured surface to 13-inch circle. Gently roll up dough with rolling pin and roll out over tart pan. Press dough into bottom and sides of tart pan. Chill in freezer for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 10 minutes. Remove weights and liner, turn pie, and bake until the bottom crust just begins to puff slightly, about 10 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to assemble the tart, place the chilled pastry cream in a large bowl and use a large whisk to beat it until the cream is smooth and shiny. Pour the whipped pastry cream into the chilled tart shell and use a spatula to smooth the top. Top with the fresh, sliced berries and drizzle with the vinegar. Serve immediately for best results and chill leftovers.</p>"}]}