{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/201216-127677-Date-Stilton-Pear-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["Asian pears", "blue cheese", "dates", "pears", "quick", "sandwich", "sandwiched"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pressed Stilton, Pear, Date, and Bacon Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/10/pressed-stilton-pear-date-bacon-sandwich-recipe.html", "description": "This sandwich is modeled on a cheese plate: it's filled with Stilton, crisp pear, and sweet dates.", "totalTime": "30 minutes", "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Cheese", "Mains", "Pear", "Sandwiches"], "recipeIngredient": ["8 slices thick cut bacon, coarsely chopped", "4 teaspoons Dijon mustard", "12 Medjool dates", "1 Asian pear, scrubbed, cored, and sliced into 20 wedges", "8 ounces Stilton or other blue cheese", "4 (6-inch) pieces baguette, split in half lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook bacon in large skillet over medium heat, stirring occasionally, until crisp and golden, about 8 minutes. With slotted spoon, transfer to paper towel-lined plate. Pour rendered fat into bowl; reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread cut side of each bottom half of bread with 1 teaspoon mustard. With fingers, remove and discard pits from dates. Press 3 dates onto bread (over mustard), spreading lightly with fingertips. Divide bacon evenly among bread pieces, sprinkling over dates. Arrange 5 pear slices over bacon, then top with 2 ounces Stilton. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press remaining 4 baguette pieces onto cheese, then, brush both sides of each sandwich with reserved bacon fat. Cook sandwiches over medium heat in now empty skillet, pressing down with spatula, until cheese begins to melt and bread is golden, about 4 minutes per side. Serve. Alternatively, press sandwiches in a panini press until toasted and heated through. Sere.</p>"}]}