{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120402-199973-soy-saag-paneer.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "Indian", "keywords": ["Andrea Nguyen", "Cook the Book", "greens", "Indian", "paneer", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andrea Nguyen's Saag Soy Paneer", "link": "https://www.seriouseats.com/recipes/2012/04/andrea-nguyens-saag-soy-paneer.html", "description": "Tofu isn't necessarily one of the mainstays of the Indian pantry but soy paneer as it's known in India does make its way into quite a few dishes, including this Saag Soy Paneer, adapted from <a href=\"http://www.vietworldkitchen.com/blog/about_andrea_nguyen.html\">Andrea Nguyen</a>'s <em><strong><a href=\"http://www.amazon.com/Asian-Tofu-Discover-Best-Make/dp/1607740257/?tag=serieats-20\">Asian Tofu</a></strong></em>.  The tofu here stands in as a vegan variation of traditional paneer, a squeaky, mild fresh cows milk cheese.  To mimic the texture and salty flavors, Nguyen soaks the tofu in salted water before drying and pan frying it.", "totalTime": "1 hour", "recipeYield": "serves 4 with 2 or 3 other dishes", "recipeCategory": ["Cook the Book", "Indian", "Tofu", "Vegetarian"], "recipeIngredient": ["12 ounces firm or extra-firm tofu", "1 1/2 teaspoons salt", "2 cups very hot or just-boiled water, plus more as needed", "Chubby 1-inch piece fresh ginger, peeled and coarsely chopped ", "3 cloves garlic, coarsely chopped", "1 yellow onion, coarsely chopped ", "8 ounces mustard greens, or 6 ounces braising mix", "1 pound spinach (2 small or 1 large bunch)", "1/4 cup canola oil", "1 teaspoon cumin seed", "2 or 3 green Thai or serrano chiles, finely chopped (seeded for less heat)", "1/4 teaspoon cayenne", "2 tablespoons unsalted butter, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the tofu into 3/4-inch cubes, then put them in a bowl. Dissolve 1 teaspoon of the salt in the 2 cups of hot water. Pour over the tofu; it should be just covered. Set aside for 15 minutes to season. Pour the water off, then transfer the tofu cubes to a non-terry dishtowel or double layer of paper towels placed atop a plate. Set aside to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the ginger, garlic, and onion in a food processor. Run the machine to yield a finely chopped texture, occasionally pausing to scrape down the sides. Transfer to a bowl and set aside. Reassemble the food processor (you don’t have to wash it) for finely chopping the greens later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the mustard greens well, then coarsely chop, discarding the thick ribs. (If you are using braising mix, rinse, then coarsely chop the entire leaf because the ribs are tender.) Transfer to a 5- or 6-quart pot. Discard any root ends from the spinach, then rinse well. Coarsely chop the leaves and stems, then add to the pot of greens. To facilitate cooking, splash in a little water.</p>\r\n\r\n<p>Cover and cook over high heat for 5 to 7 minutes, until the greens have wilted and just cooked through. They will turn bright green and collapse to one-fourth to one-third of their original volume. To ensure even cooking, occasionally uncover the pot, stir, then replace the lid. When done, set aside to cool for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the greens to the food processor, discarding the residual liquid. Process to a rough yet finely chopped texture. Add 1/2 cup water (room temperature is fine) and pulse to blend together. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large nonstick skillet over high heat. Blot the tofu cubes dry, then panfry them in two batches for about 5 minutes, until light golden on 3 or 4 of the sides. Turn the tofu with chopsticks or a spatula during the frying. If the tofu violently sputters and spits, lower the heat slightly. Your aim is to add a bit of character and depth to the tofu, not crisp it all over—it will be soft or crisp in places. Transfer to a plate, leaving the oil behind, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the heat to medium-high, then add the mixture of ginger, garlic, and onion. Cook, stirring frequently, for about 8 minutes, until the mixture has browned and begun to caramelize. Add the cumin and chile and continue cooking for 1 to 2 minutes more, until the mixture is highly aromatic and richly browned.</p>\r\n\r\n<p>Lower the heat to medium, return the tofu to the skillet, \u2028and stir to combine well. Add the greens, stirring to combine. Add the remaining 1/2 teaspoon salt and cayenne. Cook for 2 to 3 minutes, moving the mixture frequently, until heated through. The greens will slightly darken. </p>\r\n\r\n<p>Let the mixture sit for a few minutes to meld the flavors. Taste and add salt or cayenne as needed. Stir in the butter, transfer to a communal bowl or individual plates, and serve.</p>\r\n\r\n<p><small><strong>Note:</strong> The greens and the tofu can be prepared several hours in advance. Let them cool, then cover with plastic wrap and leave at room temperature, if you’ll be finishing the dish within 2 hours. Otherwise, refrigerate and return to room temperature before continuing with step 5. Leftovers can be refrigerated for up to 3 days and reheated with a bit of water.</small></p>"}]}