{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120424-203489-lemon-chocolate-pie-primary.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate desserts", "citrus desserts", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Lemon Chocolate Pie", "link": "https://www.seriouseats.com/recipes/2012/04/new-haven-lemon-chocolate-pie-recipe.html", "description": "Where most lemon pies are single crusted affairs, this pie is double crusted with a thick, sweet lemon filling that's similar to the pudding-like innards of a Lemon Meringue. Once the pie is baked and cooled, its top is covered with what amounts to chocolate frosting.", "totalTime": "2 hours", "recipeYield": "serves 8", "recipeCategory": ["Lemon", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Filling</strong>", "5 large egg yolks", "1 1/4 cups sugar", "1/3 cups cornstarch", "1/3 cups cold water", "1 1/2 cups very hot water", "2 tablespoons melted unsalted butter", "1 tablespoon lemon zest", "1/2 cup fresh juice from 6 to 8 lemons", "2 teaspoons vanilla extract", " ", "<strong>For the Crust</strong>", "2 unbaked pie crusts (I used the Food Lab's <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">Easy Pie Crust</a>) ", "1 egg white", " ", "<strong>For the Chocolate Topping</strong>", "5 ounces 72% cacao chocolate", "3 tablespoons unsalted butter", "1 tablespoon dark corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400&deg;F. Whisk together egg yolks in a medium bowl and set aside. In a medium saucepan, mix together the sugar and cornstarch. Add cold water and stir to moisten. Then add hot water, while stirring, and cook over medium-high heat, stirring occasionally. Mixture will begin to turn translucent and thicken. When mixture begins to bubble lightly, remove from heat. Stir in melted butter. Add egg yolks while whisking constantly. Add the lemon zest, lemon juice, and vanilla extract whisking until thoroughly combined. Place in refrigerator to cool, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out crusts. For a 9-inch pan your bottom crust should be around 11 inches in diameter. Place bottom crust in pie pan or dish. Pour in cooled pie filling. Place rolled out top crust over filled pie. Seal and flute edges. Cut several slits in the top of the pie to vent then brush entire top crust with egg white and bake for 20 minutes. Turn oven down to 375&deg;F and bake for an additional 15 to 25 minutes or until crust is golden brown. Remove pie from oven and cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chocolate and butter in a medium microwave-safe bowl. Microwave on high for 30 seconds and then stir, repeat, heating in 15 second increments until butter is just melted and smooth. Stir in corn syrup. Set mixture aside until it is only slightly warm to touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour chocolate mixture over cooled pie and spread to completely cover the top of the pie. Refrigerate until ready to serve. Store covered.</p>"}]}