{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120629-chichis-chinese-tomato-egg-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "egg", "stir-fried eggs and tomatoes", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese Stir-fried Eggs and Tomatoes", "link": "https://www.seriouseats.com/recipes/2012/06/chinese-stir-fried-eggs-and-tomatoes-recipe.html", "description": "Fluffy eggs stir-fried until just cooked, mixed with tomatoes that under the heat of the wok will practically dissolve into a semi-tart, semi-sweet sauce.  It is simple, and soothing, and goes perfectly with a bowl of rice.", "totalTime": "20 minutes", "recipeYield": "4 as a dish in a multi-course meal", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Chinese", "Eggs", "Mains", "Tomato", "Vegetarian"], "recipeIngredient": ["1 teaspoon cornstarch", "6 eggs", "1 teaspoon salt ", "1/2 teaspoon white pepper", "2 tablespoons Shao xing rice wine ", "1/4 cup cooking oil", "2 scallions, thinly sliced", "2 medium-sized tomatoes or 3 roma tomatoes, roughly chopped", "2 tablespoons ketchup", "1/4 teaspoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir cornstarch with 2 tablespoons water. Set aside. In a medium mixing bowl, beat eggs well with salt and white pepper. Add the rice wine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons oil in a wok over high heat until shimmering. Add the scallions and stir-fry until the oil is fragrant and the scallions have softened but not browned, about 20 seconds.  Add the eggs and stir-fry rapidly, turning the eggs around in the pan until everything is evenly cooked and just tender, about 1 minute. Remove from heat just before eggs have completely set. Transfer to a large plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining tablespoon of oil to the wok and heat until shimmering. Add the chopped tomatoes to the wok and stir-fry until most of the flesh in the tomatoes has cooked down, about one minute.  Reduce heat to low. Add the ketchup and sugar and cornstarch slurry and stir around until the mixture has thickened slightly, about 20 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the eggs back to the wok and stir-fry until everything is mixed.  Serve immediately. Leftovers may be refrigerated and heated in the microwave just until heated through.</p>"}]}