{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120105-Mutton-Curry.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["Beyond Curry", "curries", "gravy", "Indian", "mains", "mutton"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mangalorean Mutton Gravy", "link": "https://www.seriouseats.com/recipes/2012/05/mangalorean-mutton-gravy.html", "description": "This spicy, aromatic mutton curry is packed with flavor. The toasted spices add a wonderful depth and the coconut cuts the harshness of the red chillies to give a delicately balanced gravy that's wonderful to scoop up with bread or rice.", "totalTime": "2 hours", "recipeYield": "serves 2", "recipeCategory": ["Beyond Curry", "Indian", "Lamb", "Mains"], "recipeIngredient": ["2 bone-in lamb shanks (about 1 pound total)", "2 tablespoons ginger-garlic paste (or 1 tablespoon each minced ginger and garlic)", "Kosher salt", "1 stick cinnamon", "1/2 tablespoon poppy seeds", "6 dry Kashmiri chillis", "1 cup shredded unsweetened coconut", "1 tablespoon coriander seeds", "1 tablespoon cumin seeds", "3 cloves", "1 medium onion roughly chopped", "3 cups water, divided", "2 tablespoons vegetable oil", "1 large potato, quartered", "1 lime wedge", "2 tablespoons chopped coriander leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub the lamb on all surfaces with the ginger/garlic paste and salt. Allow to rest while you make the masala paste, or up to overnight in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Masala:</strong> Preheat cast iron pan over high heat until smoking. Reduce heat to medium. add cinnamon, poppy seeds, chilis, coconut, coriander, cumin, and cloves. Cook, stirring and tossing constantly until fragrant, about two minutes. Transfer mixture to a bowl and allow to cool completely. Transfer to a blender, add onion and pulse, adding 1 cup of water in small increments until a smooth paste is formed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in the heavy-bottomed saucepan over medium-high heat until shimmering. Reduce heat to medium-low and add masala paste. Cook, stirring constantly until oil separates, about 10 minutes. The oil should take on the red color of the masala at this stage. (Take care to stand out of the way, masala pastes splutter.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lamb pieces and potato and stir until coated with masala paste. Add 2 cups water, stir to combine, and season lightly with salt (broth will reduce, so do not overseason). Bring to a boil over high heat, reduce to a bare simmer, and cook, covered, until the lamb is completely tender, about an hour and a half. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish with a sprinkle of lime and the coriander leaves. Serve hot with a loaf of bread or white rice.</p>"}]}