{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120207-191382-bread-baking-cocktail-rye.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "breads", "rye", "rye bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cocktail Rye Bread", "link": "https://www.seriouseats.com/recipes/2012/02/cocktail-rye-bread-recipe.html", "description": "[Photograph: Donna Currie] I used pumpernickel flour for this recipe, but I know that most stores don't stock a lot of different rye flours, so use whatever rye flour you have on hand, or whatever you can find. I'm usually...", "totalTime": "2 hours 30 minutes", "recipeYield": "", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 1/4 cups lukewarm water", "2 1/4 teaspoons instant yeast", "1 cup pumpernickel or dark rye flour", "2 cups bread flour (plus more, as needed)", "1 teaspoon salt", "1 tablespoon cider vinegar", "2 tablespoons olive oil", "1 tablespoon caraway seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, yeast, and rye flour in the bowl of your stand mixer and stir to combine. Let it sit for 10 minutes. It should be a bit bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 cups of bread flour, salt, and cider vinegar. Knead with the stand mixer fitted with the dough hook until the dough is elastic - it won't be smooth because of the rye flour. Add the olive oil and continue kneading until the oil is incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the mixer and touch the dough - it should be tacky rather than sticky. If the dough is still sticky add more bread flour - perhaps up to another 1/4 cup - as needed. Add the caraway seeds and knead until they are well distributed. Cover the bowl with plastic wrap and set aside until the dough has doubled in size - about 50 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees and line a baking pan with parchment paper. Flour your work surface, turn out the dough, and divide it into 3 roughly equal pieces. Form each piece into a log about 2 inches in diameter. Place them on the prepared baking sheet, leaving space between them for them to rise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the dough with plastic wrap and set aside to rise until doubled, about 30 minutes. Remove the plastic wrap and bake at 350 degrees until nicely browned, about 25 minutes. Let the loaves cool completely on a rack before cutting.</p>"}]}