{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120507-204786-coconutcream.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "coconut cream pie", "cookie sandwiches", "food holidays", "whoopie pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coconut Cream Whoopie Pies", "link": "https://www.seriouseats.com/recipes/2012/05/coconut-cream-whoopie-pie-recipe.html", "description": "True: traditional whoopie pies are not pie at all--rather, they are cake-like cookies with frosting sandwiched in-between. But in the case of the Coconut Cream Whoopie Pie, you can have your cake and eat your pie, too: the rich filling is sort of like a mix between coconut frosting and cream pie filling.", "totalTime": "", "recipeYield": "makes 12 sandwiches", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["<strong>For the Cookies</strong>:", "1 cup shredded coconut (sweetened or unsweetened is OK)", "2 1/4 cups (about 11 1/2 ounces) all-purpose flour, sifted", "1 1/2 teaspoons baking soda", "1/4 teaspoon salt", "1 egg", "1/3 cup butter (about 2 1/2 ounces), melted", "1 cup (about 7 ounces) granulated sugar", "3/4 cup (about 6 ounces) whole milk", "2 teaspoons vanilla extract", " ", "<strong>For the Filling</strong>:", "4 tablespoons unsalted butter, softened", "1 3/4 cups (about 7 3/4 ounces) confectioners' sugar, sifted", "5 tablespoons shredded coconut (sweetened or unsweetened is ok)", "3 tablespoons coconut milk (whole milk is also OK)", "1/2 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position two racks in the middle of your oven. Preheat oven to 350&deg;F. Grease or line two cookie sheets with parchment paper. Set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread 1 cup of shredded coconut evenly in bottom of 9- by 13-inch baking pan. Place in the heating oven for about 5-10 minutes, or until lightly browned and toasty. Set aside</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together flour, baking soda and salt. In a large bowl, vigorously whisk together the egg, melted butter, and sugar until mixture is smooth and has lightened slightly in color, about 1 minute. Add in half of the flour mixture, followed by the milk and vanilla extract, then the remaining flour mixture. Mix only until no streaks of flour remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop rounded spoonfuls of the cookie batter onto prepared baking sheet, trying to make each even in size. You will get either 24 jumbo cookies, or 36 medium sized cookies, depending on your size preference. Leave a generous amount of space, about 2 inches, between cookies to allow for spreading.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before putting the cookies in the oven, sprinkle the tops with about half of the toasted coconut; reserve the rest for garnishing the finished sandwiches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 8 to 10 minutes, until cookies have a dull look on top, and the edges are very lightly browned.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cookies cool, make the filling. In the bowl of a stand mixer fitted with the paddle attachment, beat together the butter and sugar on low speed until combined. Add the coconut, coconut milk (or milk), and vanilla and beat on low until smooth, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble the cookies. First, pair cookies of similar sizes together. Then, turn half of the cookies upside down. Place a spoonful of filling on the center of the flat side of a cookie; sandwich its pairing cookie on top. The filling should spread to the edges based on the weight of the cookie placed on top. Either sprinkle toasted coconut on the exposed sides of the filling in the cookie, or gently roll the filled cookie in the remaining toasted coconut. Repeat with the remaining cookies. Serve immediately; store in an airtight container for up to a week.</p>"}]}