{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120110-185998-Chocolate-souffle-610x458-11.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chocolate", "souffles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Soufflé", "link": "https://www.seriouseats.com/recipes/2012/01/chocolate-souffle-cake-how-to-make-technique-recipe.html", "description": "Chocolate soufflé has stood the test of time as the go-to for chocolate lovers everywhere. Light, airy, and served à la minute, this dramatic dessert rises up out of its ramekin in the oven and must be delivered promptly to the diner before it begins to shrink back into itself. It's gluten free and delightfully rich. While many soufflés are served with a sauce poured inside, this one stays moist enough on the inside that it's not entirely necessary. Creme anglaise makes a great optional garnish for pouring into a small hole made in the center.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Chocolate", "Desserts"], "recipeIngredient": ["Approximately 3 tablespoons of softened butter, for greasing", "Approximately 3 tablespoons granulated sugar, for coating ramekins", "1.2 ounces heavy cream", "1.2 ounces milk", "1.75 ounces 71% chocolate, chopped", "1.75 ounces unsweetened chocolate, chopped", "1.7 ounces cocoa powder", "3.5 ounces water", "8.9 ounces egg whites (from approximately 8 eggs)", "3.5 ounces granulated sugar", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 390&deg;F with the convection fan turned off. Liberally butter four ramekins, making sure to butter right to the edge of the ramekin. Sugar the buttered insides evenly, tapping out the excess and set the ramekins aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chopped chocolates in a large bowl. Combine the milk and cream and bring to a boil. Immediately remove the liquid and pour over the chopped chocolate. Allow it to stand for a few minutes, then stir with a rubber spatula until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a pot with a few inches of water on the stove over medium heat. Place the bowl of melted chocolate over it. Add the water and cocoa powder and stir frequently, until the mixture becomes thick, glossy, and smooth, about 5 minutes. Turn off the heat and remove the bowl from the pot, but place it back on top of the hot water if necessary. The goal is to hold the mixture so it is warm, not hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, beat the egg whites on high using a whisk attachment until they begin to get foamy. Slow the mixer speed and add the sugar and salt gradually, then return to high speed and whisk the egg white mixture to firm, glossy, smooth peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sacrifice about 1/4 of the meringue by mixing it thoroughly with the chocolate mixture to lighten it. Then fold in the remaining meringue, taking care not to deflate. As soon as there are no more white streaks, pipe the mixture into the prepared ramekins just to the top, then smooth the tops with an offset spatula. Place the ramekins on a sheet tray and bake in the center of the oven for 12 minutes for a souffle that is wet on the inside, 13-14 for one that is more dry. Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You may also choose to prepare the souffles in advance. If this is the case, wrap each ramekin with plastic and set in the fridge up to one day in advance. When ready, preheat the oven and bake the souffles for 15 minutes, then serve immediately.</p>"}]}