{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121212-233629-cranberry-potpourri-jam.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["Christmas", "cranberries", "Jam", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Potpourri Jam", "link": "https://www.seriouseats.com/recipes/2012/12/cranberry-spice-potpourri-jam-recipe.html", "description": "This cranberry potpourri jam is inspired by the little fruit-orange sachets I used to make as a kid. The warm, spicy scent is so inviting, you might just keep a jar in your sock drawer.", "totalTime": "90 minutes", "recipeYield": "Six (8-ounce) jars of jam", "recipeCategory": ["Condiments and Sauces", "Cranberry", "Preserved"], "recipeIngredient": ["2 pounds frozen or fresh cranberries", "1 pound of sugar, divided", "1/4 cup orange zest, from 4 to 6 large oranges", "3 tablespoons lemon juice from about 2 lemons", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground allspice", "1/2 teaspoon ground nutmeg", "1/8 teaspoon ground cayenne pepper", "1/4 teaspoon table salt (or 1/2 teaspoon kosher alt)", "1/4 cup brown sugar", "1/2 teaspoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Defrost the cranberries, if using frozen. Wash and dry the cranberries, then place them in a bowl. Mash them slightly with a potato masher, then sprinkle them with 1/4 cup of sugar. Cover and let sit for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cranberries are sitting, place a small plate in the freezer so you can test the jam for proper thickness later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cranberries, orange zest, lemon juice, cinnamon, allspice, nutmeg, cayenne, and salt to a food processor and pulse a few times until the cranberries are chunky but not completely liquified.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sure your jars are sterilized and ready to go, and start a very large pot of water to boil on the stove for processing your filled jars. Keep the pot of water covered tightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the fruit into a large, deep, heavy-bottomed pot. Add brown sugar and butter, stirring well to combine. Cook over medium heat, stirring occasionally, until the fruit begins to bubble and spit. Use a skimmer to skim off any foam that forms. Cook for about 20 minutes, stirring frequently to keep the fruit from sticking to the bottom of the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin testing the jam for doneness. Spread 1/2 teaspoon of cooked fruit on the cold plate and place it back in the freezer. Wait 30 seconds, then run your finger through the fruit. It should be thick enough to maintain a path when you run your finger through it. If you’d like thicker jam, place the plate back in the freezer and cook the fruit for another 3 minutes and test again. Repeat until desired thickness is achieved, but be careful about cooking too long or you will alter the taste of your jam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pot from heat and use a spoon to skim any foam from the surface of the fruit. Ladle jam into sterilized jars, leaving 1/2-inch of headroom, and process them in a hot water bath for 10 minutes. Unopened jars will keep at room temperature for up to 6 months. Opened jam should be refrigerated.</p>"}]}