{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120410-195206-shortbread-610x458-11.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["Cookies", "dessert", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Classic Butter Shortbread", "link": "https://www.seriouseats.com/recipes/2012/04/classic-butter-shortbread-cookie-recipe.html", "description": "This shortbread has a tender crumb complimented by a polished, wedge presentation. Feel free to adjust the levels of sugar and salt to your personal taste, and don't be afraid to add fresh herbs to the dough, such as chopped rosemary or thyme.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["9 ounces (about 1 3/4 cup) all-purpose flour", "8 ounces (2 sticks) unsalted butter, softened, plus a little more for greasing the pan", "3 1/2 ounces (about 1/2 cup) confectioners' sugar", "1 1/2 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift flour through a fine sieve and set aside. Grease sides and bottom of the tart pan with butter and set aside. In the bowl of a stand mixer fitted with a paddle attachment, cream butter and confectioners' sugar together on high speed until smooth and pale, about 3 minutes. Scrape down sides and of the bowl and paddle, and beat for an additional 30 seconds. Turn off mixer and add flour all at once. Mix on lowest speed until almost combined, with a few dry spots, about 30 seconds. Scrape down bowl and paddle, mix on low for a few additional seconds, and remove bowl from the mixer. If dry spots remain, use a spatula to incorporate them by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press dough into prepared tart pan. Cover dough with plastic wrap and use your fingers or a small rolling pin to flatten the surface evenly. Chill in fridge with plastic wrap pressed over the surface for at least one hour or up to two days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F with the rack in the center position. Using a knife, lightly draw the lines you'll use to cut the shortbread into eight wedges. Press a round cutter in the center, remove circle of dough, and replace cutter in the center of the pan. Use a skewer to score surface with holes 1/4-inch apart, poking all the way through the dough. Bake until dough feels firm in the center and is your desired shade of golden brown, 50-60 minutes. Remove from oven and allow shortbread to cool for 10 minutes, then push up on the bottom of the pan and allow outer ring to fall away. Remove round cutter. Slice shortbread into wedges on the lines you've drawn, and use an offset spatula to transfer slices to a cooling rack. Allow them to cool completely before storing in a sealed container.</p>"}]}