{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120410-201238-cremini-farro-hash-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cheryl Sternman Rule", "Cook the Book", "egg", "farro", "mushrooms", "recipe newsletter", "Ripe", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ripe's Cremini Farro Hash with Poached Eggs", "link": "https://www.seriouseats.com/recipes/2012/04/ripes-cremini-farro-hash-with-poached-eggs-recipe.html", "description": "With flecks of thyme and a touch of tangy sour cream, this farro mushroom hash would be great on its own, but finishing it off with perfectly poached eggs puts it over the top.  It's a winner.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Eggs", "Mushrooms", "Other Grains", "Vegetarian"], "recipeIngredient": ["1 1/2 cups semi-pearled farro, rinsed", "1 small yellow onion, diced", "12 ounces cremini mushrooms, wiped clean, trimmed, and finely chopped", "1/2 teaspoon dried thyme", "Kosher salt and freshly ground black pepper", "1/4 cup dry sherry", "1 to 2 tablespoons sour cream, to taste", "2 to 3 teaspoons fresh lemon juice", "1 teaspoon white vinegar", "4 large eggs", "3 tablespoons minced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the farro in a large pot of boiling, salted water according to package directions. Skim off any foam that rises during cooking. Drain, and rinse.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, warm the oil over medium-high heat. Add the onion, creminis, thyme, 1 teaspoon salt, and a generous grinding of pepper. Sauté until the mushrooms release their liquid, the onions turn translucent, and the moisture nearly evaporates, about 10 minutes, stirring frequently. Add the sherry. Allow to bubble steadily until the liquid nearly boils off, about 2 minutes. Remove from the heat and stir in the farro and sour cream. Season with 2 teaspoons of the lemon juice (adding more to taste) and additional salt and pepper. Cover to keep warm while you prepare the eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium saucepan halfway with water. Bring to a hard simmer, add the vinegar, and lower the heat to a gentle bubble. Crack 1 egg into a small ramekin. Swirl a wooden spoon in the water to create a whirlpool, then tip the egg into the swirling water. Immediately repeat with the remaining eggs, nudging the eggs to the side so they don’t clump together. Poach the eggs for exactly 3 minutes, flipping them over during the last minute of cooking. (If you’re a novice, try poaching 1 or 2 at a time.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, divide the farro mixture among four serving plates. Remove each egg with a slotted spoon, blot gently with paper towels, and lay atop each mound of farro. Sprinkle with the chives, and serve immediately.</p>"}]}