{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121213-seared-foie-food-lab-16.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["foie gras", "holiday nibbles", "hors d'oeuvres", "orange", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-Seared Foie Gras With Spiced Citrus Purée", "link": "https://www.seriouseats.com/recipes/2012/12/pan-seared-foie-gras-spiced-citrus-puree-orange-food-lab-recipe.html", "description": "Seared foie gras with a creamy spiced orange puree and candied orange zest.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 (makes enough sauce for several more servings)", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Offal", "Orange", "Other Meats", "The Food Lab"], "recipeIngredient": ["<strong>For the Orange Purée</strong>:", "1 whole orange, scrubbed clean", "1 stick cinnamon", "1 clove star anise", "3 cups sugar", "3 cups water", "Kosher salt", " ", "<strong>For the Foie Gras</strong>:", "4 slabs fresh grade \"A\" foie gras, each 1/2-inch thick, lightly scored in a hashmark pattern on one side (6 to 8 ounces total, see note)", "Freshly ground black pepper", "1 tablespoon finely sliced chives", "Coarse sea salt such as Maldon or fleur de sel", "1 tablespoon finely diced candied orange peel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Orange Puree:</strong> Use the tip of a sharp knife to cut several slits in the skin of the orange.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cinnamon, clove, sugar, and water in a small saucepan and bring to a boil over medium-high heat, stirring until sugar is dissolved. Reduce heat to the lowest setting. Add orange to pot. Place a clean kitchen towel or a paper towel over the top of the pot, pushing it down until it is in contact with the liquid to keep the orange moist on all sides. Cook until orange is completely tender, about 1 hour. Discard cinnamon and star anise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer orange to the jar of a blender and add a cup of cooking syrup. Blend on high speed until completely smooth, adding more syrup as necessary to reach a nice gel-like consistency. Season with a pinch of salt and press through a fine mesh strainer. Set aside. Reserve orange syrup for another use (see note)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Foie Gras</strong>: Lay a double layer of paper towels on top of a plate or cutting board and set aside. Season foie gras liberally on all sides with salt and pepper. Heat a small skillet over high heat for at least 3 minutes. Place foie gras in skillet scored-side-down. It should immediately start smoking, sizzling, and rendering fat. If it doesn't, remove and allow the pan to preheat for another 1 to 2 minutes. Once all four pieces of foie are in skillet, cook, swirling pan gently every few seconds, until deeply browned and crisp on first side, about 30 seconds. Use a thin metal spatula to flip foie gras onto second side and cook for 30 second longer. Transfer to paper towel-lined plate and let rest for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon some orange puree onto four individual serving plates and place 1 slice of foie gras on each. Top with chives, coarse sea salt, and candied orange peel. Serve immediately with lightly dressed greens.</p>"}]}