{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120403-199931-bread-baking-bunny-unbaked.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Bunny Bread", "link": "https://www.seriouseats.com/recipes/2012/04/bunny-shaped-bread-baking-easter.html", "description": "[Photographs: Donna Currie] You can use this shaping method with the bread of your choice, but it can't be too wet&mdash;it needs to hold its shape. And you don't want something that will have a massive amount of oven spring...", "totalTime": "3 hours", "recipeYield": "Makes 1 bunny", "recipeCategory": ["Bread", "Bread Baking", "Easter"], "recipeIngredient": ["1 1/4 cups water", "2 1/4 teaspoons instant yeast", "1 tablespoon sugar", "13 1/2 ounces (about 2 3/4 cups) bread flour", "1 teaspoon salt", "2 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the water, yeast, and sugar in the bowl of your stand mixer. Stir to combine then add the flour. Knead with the stand mixer fitted with the dough hook until the dough is smooth and elastic. Add the salt and olive oil and continue kneading until the oil and salt are fully incorporated and the dough is smooth, shiny, and very elastic. Cover the bowl with plastic wrap and set aside until the dough has doubled in size, about an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, flour your work surface, line a baking sheet with parchment paper, position a rack in the center of your oven, and preheat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough and knead it briefly to knock out the air. Cut off about 2/3 of the dough, and form it into an egg-shaped ball. Place this piece on the parchment paper, seam-side down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the remaining piece of dough in half. Form one of those halves into a teardrop shape. This will become the bunny head and ears. Begin rolling the thin end so you end up with a ball about 3 inches in diameter on the fat end attached to a thick rope (think of the shape of a Tootsie Pop) about 6 inches long. Using a bench scraper, pizza cutter, or sharp knife, slit the rope in half all the way up to the ball. Form the two pieces that you just created into ears. Set this aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut about 1/3 of the dough off of the remaining piece of dough. Form this into a rope about 6 inches long. Form it into a U-shape and slide the U under the narrow end of the egg-shaped piece of dough on the parchment. Leave the loose ends sticking out about 2 inches. (This doesn't have to be exact - arrange it so it looks pleasing to you. The important thing is that the base of that U is anchored under the body.) Those loose ends will be the front paws.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the last piece into a rope about 9 inches long. As you roll, leave a fatter bit in the center then thin it out, and leave the ends fatter. Fold the dough in half and form that center fat bit into a ball. This will be the bunny's tail.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the tail at the back end of the bunny, then tuck the thin portion under the body, leaving the thicker parts - the bunny's back legs - sticking out on either side of the bunny.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On the narrow part of the egg-shaped body, press down just behind the edge of the dough to form an indentation where the head will rest. Put the head on the body, and adjust the front paws and ears as desired. Sprinkle the bunny with flour or white rice flour, and cover it with plastic wrap. Set aside until doubled in size - about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the bunny. Using small, sharp scissors, snip the ends of the paws to form toes. Don't cut too deep - you want a hint of toes, not giant claws. Cut slits for the eyes, or if you prefer, make tiny cuts to form eyelashes. Pinch the front of the dough to form a nose. If you wish, gently adjust the paws and ears, because they've probably moved a bit during the rise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the bunny at 350&deg;F until nicely browned, about 40 minutes. Let it cool completely on a rack before slicing. Mmmm.... baked Easter bunny!</p>"}]}