{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121022-tom-kha-udon-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "", "keywords": ["light eating", "mushrooms", "my thai", "quick", "soup", "udon", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tom Kha Udon Soup With Mushrooms", "link": "https://www.seriouseats.com/recipes/2012/10/tom-kha-udon-soup-with-mushrooms-recipe.html", "description": "We're taking Tom Kha Gai, the famous Thai coconut chicken soup, and changing it up. We're removing the \"gai\" (chicken) from both the name and the dish, doubling the amount of mushrooms, adding to it the bouncy udon noodles which is very Thai (just kidding), and replacing the source of salinity from the traditional fish sauce to salt (I personally don't think Tom Kha seasoned with soy sauce is palatable, but YMMV). We're also switching from chicken broth to vegetable broth.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mushrooms", "Pasta", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["4 (8 ounce) packages fresh or frozen udon noodles", "1 1/2 cups coconut milk", "2 1/2 cups homemade or store-bought vegetable broth", "2 stalks lemongrass, cut into 1-inch pieces and bruised", "3 to 4 fresh kaffir lime leaves, torn and bruised", "1/3 cup paper thin coins of fresh galangal", "8 ounces fresh mushrooms, cut into bite-sized pieces (see note)", "3 to 4 bird's eye chilies, sliced", "Kosher salt", "1/4 cup juice from 3 to 4 limes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare udon noodles according to package instructions; drain and set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place coconut milk, vegetable broth, lemongrass, kaffir lime leaves, and galangal in a 2-quart saucepan set over medium heat. Bring mixture to a very gentle boil; reduce heat so the liquid barely simmer. Allow the broth to infuse for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mushrooms to the broth; adjust heat so mixture comes back to a gentle boil. Add prepared noodles to the pot; heat through. Remove pot from heat. Add sliced chilies while the soup is still hot. Season to taste with salt and 1/4 cup of lime juice. Adjust seasoning with more salt and lime juice as required, and serve immediately.</p>"}]}