{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120425-203085-bread-baking-smoked%20rye.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "buns", "rye"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoked Rye Buns", "link": "https://www.seriouseats.com/recipes/2012/04/smoked-rye-buns.html", "description": "[Photograph: Donna Currie] These would be great for any type of barbecue sandwich, with the added smokiness enhancing the sandwich in a way that a plain bun just couldn't do. Also great for a non-smoked sandwich where smoke would be...", "totalTime": "3 hours", "recipeYield": "makes 12 buns", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup (8 ounces) water", "2 1/4 teaspoons instant yeast", "1/2 cup (4 ounces) buttermilk", "1 cup (about 5 1/2 ounces) rye flour", "2 cups (about 11 ounces) bread flour", "1/2 cup (about 2 ounces) potato flakes", "1 teaspoon salt", "2 tablespoons olive oil", "1 tablespoon caraway seeds", "1 cup wood chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine everything water, yeast, buttermilk, rye flour, bread flour, potato flakes, and salt in bowl of stand mixer fitted with dough hook attachment, stir on low speed until just combined (about 30 seconds), cover with plastic wrap, and let rest for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 20 minutes, knead on low speed until dough is smooth and elastic, about 2 minutes. Add the olive oil and caraway seeds and continue kneading until they are fully incorporated. Cover the dough and let it rest until it has doubled in size, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has doubled, flour your work surface and turn out the dough. Knead it briefly, then divide it into 12 equal pieces. Form each piece into a ball and place them on a single baking sheet that will fit into your smoker (a quarter-sheet pan fits in mine) for pull-apart rolls, or on two baking sheets for individual rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the rolls with plastic wrap and set aside until nearly doubled in size, about 25 minutes. Meanwhile, prepare your smoker and soak your wood chips according to the manufacturer's directions. Set the temperature for 275&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has just about doubled, uncover it and bake it in your smoker until the dough is lightly golden and cooked through, about 45 minutes. Remove the buns from the smoker, and remove them from the pan to cool on a rack.</p>"}]}