{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120516-dt-david-tanis-pasta-with-white-beans-and-squid.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["Dinner Tonight", "Italian", "pasta", "quick", "squid", "white beans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "David Tanis's Pasta with Squid and White Beans", "link": "https://www.seriouseats.com/recipes/2012/05/david-tanis-pasta-with-squid-and-white-beans.html", "description": "I first encountered the combination of squid and white beans in the famous tapas bar Bar Pintxo in the <a href=\"http://www.seriouseats.com/2011/08/market-scene-la-boqueria-in-barcelona-spain.html\">Boqueria market of Barcelona</a>. There, tiny white runner beans are the bed for squid seared on a screaming hot flattop; a sauce of olive oil and the squid's ink gives the whole plate a round, salty tang. In a country of incredible food, it remains one of the best things I've eaten.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Italian", "Other Seafood"], "recipeIngredient": ["1 pound spaghetti or bucatini", "1 pound squid, cleaned, bodies slices into 1-inch rings, tentacles chopped, everything well-dried on paper towels", "1/2 cup olive oil, plus more for drizzling", "Kosher salt and freshly ground black pepper", "3 medium cloves garlic, smashed to a paste with salt (about 3 teaspoons)", "1 teaspoon red pepper flakes", "1 tablespoons chopped fresh marjoram", "2 cups cooked white beans", "1 tablespoon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil. Cook the pasta until al dente. Drain, reserving some pasta cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the pasta is about halfway done cooking, heat oil in a 12-inch stainless steel skillet over high heat until smoking. Carefully add squid. Season generously with salt and pepper and cook for 30 seconds, then add the garlic, red pepper flakes, and marjoram and stir well. Cook until squid is just cooked through but not rubbery and aromatics are fragrant, 30 seconds to 1 minute. Add white beans and remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cooked pasta to the skillet and toss to combine. Season to taste with salt, add the lemon juice, then add some pasta cooking water as needed to moisten the dish. Serve immediately.</p>"}]}