{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120112-187456-quark-strudel.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Kurt Gutenbrunner", "Neue Cuisine", "strudel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quark Custard Strudel", "link": "https://www.seriouseats.com/recipes/2012/01/quark-custard-strudel-austrian-pastry-recipe.html", "description": "While fruit-filled strudels are the norm on these shores, in Austria filling options are much more vast and varied.  One of the fillings that's pretty much everywhere in Austria (but nowhere here) is <em>Milchramstrudel</em> or <strong>Quark Custard Strudel</strong>, a lightly sweet and tangy cheese-filled strudel that's baked with a creamy, custardy sauce.", "totalTime": "", "recipeYield": "makes 6 servings", "recipeCategory": ["Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["4 tablespoons unsalted butter, softened", "2/3 cup quark cheese", "Pinch of grated lemon zest", "Pinch of salt", "2 large eggs, separated", "1 large egg yolk", "2/3 cup sour cream", "1/4 cup all-purpose flour, sifted", "1/3 cup granulated sugar, plus more for sprinkling", "5 frozen phyllo sheets, thawed", "6 tablespoons clarified unsalted butter", "Confectioners’ sugar, for dusting", " ", "<strong>Royale Sauce</strong>", "5 large eggs", "1/3 cup sugar", "1/2 cup milk ", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the royale sauce</strong>: In a medium bowl, beat the eggs with the sugar. Add the milk and cream and beat until smooth. Refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, using an electric mixer, cream the softened butter with the quark, lemon zest, and salt. Beat in the egg yolks, one by one, then beat in the sour cream. Fold in the flour. In a medium bowl, using clean beaters, whip the egg whites at medium speed until foamy. Gradually add the granulated sugar, then whip until the whites hold a soft peak. Using a rubber spatula, gently fold the meringue into the quark mixture.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a 12-by-2 1/2 -inch terrine mold with plastic wrap, leaving a generous overhang on the two long sides. Pour in the quark filling. Fold the plastic over, and freeze until very firm, at least 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the frozen quark mold onto a cutting board and remove the plastic wrap. Wash and dry the terrine mold. Trim the slanted edges by about 1/2 inch to make straight sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread 1 phyllo sheet on a work surface with a long side in front of you. Brush it lightly with clarified butter and dust with confectioners’ sugar. Top with the 4 remaining sheets, brushing each with butter and dusting with confectioners’ sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the quark mold across the lower third of the phyllo stack, leaving about 3 inches of space at the bottom. Carefully roll up the quark in the phyllo, tucking in the ends.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the terrine with clarified butter and sprinkle with granulated sugar to coat lightly. Return the strudel to the terrine, seam side down, and set in a roasting pan or large gratin dish. Transfer to the oven and bake until light golden brown, about 30 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and pour the royale sauce into the terrine; the strudel should be almost completely submerged. Pour 4 cups of cold water around the terrine. Reduce the oven temperature to 300&deg;F and bake the strudel until the custard is set, about 30 minutes. Remove from the oven and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a knife around the edges of the terrine. Cut into slices in the terrine. Using a spatula, transfer each slice to a plate. Dust the top with confectioners’ sugar, and serve.</p>"}]}