{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120611-127677-Fried-Chicken-Biscuit-PRIMARY-Cara%20Howe.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["biscuits", "butter", "fried chicken", "sandwich", "sandwiched"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fried Chicken, Honey Butter, and Biscuit Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/06/fried-chicken-and-honey-butter.html", "description": "Soft, flaky buttermilk biscuits and a smear of sweet honey butter form the base for this crisp fried chicken sandwich.", "totalTime": "45 minutes", "recipeYield": "makes 6 sandwiches", "recipeCategory": ["Breakfast and Brunch", "Deep Frying", "Fried Chicken", "Sandwiches"], "recipeIngredient": ["<strong>For the Biscuits</strong>:", "3 cups (about 15 ounces) all-purpose flour, plus additional for dusting work surface", "1 tablespoon baking powder", "1 tablespoon granulated sugar", "1 1/2 teaspoons salt", "1/2  teaspoon baking soda", "1 stick (4 ounces) unsalted butter, chilled and cut crosswise into thin slices", "1 1/2 cups buttermilk, chilled ", "   ", "<strong>For the Fried Chicken</strong>:", "8 cups peanut oil (see notes)", "6 bone in, skin on chicken thighs (about 2 1/2 pounds)", "1 cup buttermilk", "1 1/2 teaspoons salt", "2 teaspoons finely grated zest plus 2 teaspoons juice from 1 lemon", "1 1/2 cups (about 7 1/2 ounces) all-purpose flour", "1 1/4 teaspoons garlic powder", "1 1/4 teaspoons onion powder", "1 teaspoon pepper", "1 teaspoon paprika", "1 teaspoon dried thyme", "1/4 teaspoon cayenne pepper", "   ", "<strong>For the For the Honey Butter and Assembly</strong>:  ", "6 tablespoons (3 ounces) unsalted butter, softened", "2 tablespoons honey", "1/4 teaspoon salt", "30 dill or bread-and-butter pickle chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Biscuits:</strong> Adjust oven rack to middle position and preheat oven to 425°F. Line rimmed baking sheet with parchment paper. Whisk together flour, baking powder, sugar, salt, and baking soda in large mixing bowl. Add chilled butter to bowl, and, using two dinner knives, cut into dry ingredients until mixture resembles coarse meal. Alternatively, toss butter slice in flour mixture and quickly press, one slice at a time, between thumb and forefinger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 1/2 cups buttermilk and stir with wooden spoon or sturdy rubber spatula just till combined. If mixture looks dry, add more buttermilk, 1 tablespoon at a time until dough is cohesive. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour a clean, dry work surface. Turn dough out onto prepared surface and gently knead just until it comes together, no more than 4 times. Pat dough out into a 10-inch rectangle and fold into thirds. Repeat procedure two more times, then, pat into a 1-inch thick circle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour biscuit cutter and stamp out—don’t twist— 6 biscuits. Arrange them about 1 inch apart on prepared baking sheet. Bake biscuits until golden, 12 to 15 minutes. Transfer tray to cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fried Chicken:</strong> Heat oil in Dutch oven or large skillet with tall sides to 350&deg;F. With a sharp paring knife cut into the chicken until you hit bone. Carefully cut around the bones; remove and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine buttermilk, salt, lemon zest, and lemon juice in medium bowl. Whisk together flour, garlic powder, onion powder, pepper, paprika, thyme, and cayenne in large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One piece at a time, dip chicken in buttermilk, then dredge in flour. Shake off excess, then transfer flour-coated chicken pieces to a second large plate. Cook chicken in two batches, turning occasionally, until crisp and deep golden and an instant read thermometer inserted into the thickest part registers at least 165°F, about 8 minutes. Transfer fried pieces to paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the For the Honey Butter and Assembly:</strong> Stir butter, honey, and salt in small bowl with fork until smooth and combined. Cut biscuits in half and spread both halves with honey butter. Place 1 piece of chicken on 6 halves, then top with 5 pickle chips and biscuit tops. Serve immediately.</p>"}]}