{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/20120502-204507-dinner-tonight-mindy-fox-quinao-salad-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["asparagus", "Dinner Tonight", "endive", "Mindy Fox", "quinoa", "salad", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mindy Fox's Red Quinoa, Raw Asparagus and Endive Salad with Shaved Parmigiano-Reggiano", "link": "https://www.seriouseats.com/recipes/2012/05/mindy-foxs-red-quinoa-raw-asparagus-and-endive-salad-parmesan.html", "description": "When asparagus is truly in season, like at this exact moment, the vegetable is so sweet and tender it doesn't even need to be cooked. Just thinly slice the stalks, dress them with a vinaigrette, and you're left with a stunningly simple fresh asparagus salad. The only catch is that they are often light, bordering on the insubstantial. This recipe from Mindy Fox's <a href=\"http://www.amazon.com/Salads-Beyond-Extraordinary-Recipes-Everyday/dp/1906868670/ref=sr_1_1?ie=UTF8&amp;qid=1335984769&amp;sr=8-1\"><em>Salads: Beyond the Bowl</em></a> solves that problem by adding red quinoa.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Dinner Tonight", "Quinoa", "Salads", "Vegetarian"], "recipeIngredient": ["1 cup red quinoa, pre-washed ", "1/4 cup pine nuts", "1/2 pound asparagus, tough ends trimmed", "1/2 pound Belgian endive", "2 ounces Parmigiano-Reggiano, thinly shaved with a vegetable peeler or pairing knife", "1/4 cup extra-virgin olive oil (use the good stuff)", "1 tablespoon fresh lemon juice ", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two cups of water into a medium-sized saucepan. Add quinoa. Bring to a boil over high heat. Cover and reduce heat to low to maintain a simmer. Cook until the quinoa absorbs the water, about 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, set a large dry skillet over medium-low heat, and add the pine nuts. Toast the pine nuts, tossing occasionally, until lightly browned, 4 to 6 minutes. Transfer the pine nuts to a plate when done, and turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the tips of the asparagus, and then quarter the tips lengthwise. Thinly slice the asparagus stalks crosswise at a slight diagonal. Cut the endive crosswise at a slight diagonal into 1/2-inch-thick slices. Discard the bases of the endive.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the quinoa is done, spread it out on a large baking sheet set over a wire rack (that way the bottom cools quickly). Let the quinoa cool, about five to ten minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine all the ingredients, plus a 1/2 teaspoon of salt, and gently toss. Divide the salad between four plates and serve, seasoning with more salt to taste.   </p>"}]}