{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/0201812-191974-diyvsbuy-allspicedram.jpg", "author": {"@type": "Person", "name": "Marcia Simmons"}, "recipeCuisine": "", "keywords": ["cocktail ingredients", "DIY vs Buy", "tiki drinks"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "DIY Allspice Dram", "link": "https://www.seriouseats.com/recipes/2012/02/diy-allspice-dram-make-your-own-st-elizabeths-pimento-dram-recipe.html", "description": "Allspice dram is a simple liqueur flavored with allspice berries. It's also known as pimento dram, because allspice is a berry from the pimento tree. Allspice dram adds a dark, strong, and spicy counterpoint to rum and sweet ingredients in tiki drinks. For years, allspice dram was damn-near impossible to find in the states. Even though you can find it on store shelves now, it's still much more fun (and affordable!) to make it at home.", "totalTime": "14 days", "recipeYield": "Makes about 3 cups", "recipeCategory": ["Cocktails", "Other Drinks"], "recipeIngredient": ["1 cup light rum", "1/4 cup whole allspice berries", "1 cinnamon stick", "1 1/2 cup water", "2/3 cup brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush the allspice berries in a mortar and pestle or grind them in a spice grinder. You want coarse, large pieces and not a fine grind. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the crushed allspice in a sealable glass jar and pour the rum on top. Seal the jar and shake well. Let this mixture steep for 4 days, shaking daily. On day 5, break up the cinnamon stick and add it to the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 12 days total steeping, strain out the solids through a fine-mesh strainer. Then strain again through a coffee filter into your final bottle or jar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat water and sugar on medium until boiling, stirring to dissolve, about 5 minutes. Let the syrup cool, then add it to the strained allspice infusion. Shake and then let rest for a minimum of two days before using. </p>"}]}