{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120713-chichis-chinese-drunken-chicken-recipe-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "chicken", "Chinese", "drunken chicken"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Drunken Chicken", "link": "https://www.seriouseats.com/recipes/2012/07/drunken-chicken.html", "description": "Slices of poached chicken soak in a 50/50 chicken broth and rice wine marinade up until the moment you set it on a plate to eat. The resulting chicken is cold, juicy, and drenched in wine.", "totalTime": "30 minutes plus a day's marination", "recipeYield": "serves 4 as an appetizer or 2 main course", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Chinese", "Mains"], "recipeIngredient": ["2 whole chicken parts (two breasts, two leg/thighs, or a mix), totaling about 2 pounds", "One 1-inch piece of ginger", "Kosher salt", "1 cup Shaoxing rice wine", "1 cup chicken broth from simmering"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken and ginger in a medium saucepan. Add enough cold water to barely cover chicken. Bring to a simmer over medium-high heat then reduce to lowest heat. Liquid should be barely quivering. Cook until chicken is cooked through (breasts should register 155°F on an instant read thermometer and legs should register at least 165°F). Remove each piece as they cook through to a bowl. When all chicken is cooked, pour broth over chicken in bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the chicken and the broth cool.  Chop the chicken into 1-inch to 1/2 inch pieces, depending on the cut of the chicken (breasts should be cut into 1/2-inch pieces against the grain, legs can be cut into 1-inch pieces). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Find a non-reactive container that snugly fits all the chicken pieces.  Place all the chicken in the container, taking care not to cram the pieces. Season with salt. Combine chicken broth and wine, and pour over chicken until completely covered. Marinate for at least 24 hours, and up to 5 days.  Serve cold, taking out as many pieces of chicken as you need while keeping the rest in the marinade. </p>"}]}