{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121210-tam-cocoa-almond-meringue.jpg", "author": {"@type": "Person", "name": "The Serious Eats Team"}, "recipeCuisine": "", "keywords": ["cookie swap 2012", "Cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cocoa Almond Meringues", "link": "https://www.seriouseats.com/recipes/2012/12/cocoa-almond-meringues-recipe.html", "description": "Swapped at the SE Cookie Swap by Tam Ngo", "totalTime": null, "recipeYield": "makes 24-30 cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["1 cup confectioners' sugar, plus extra for dusting", "1/3 cup finely ground almonds", "1/4 cup unsweetened cocoa powder", "4 large eggs whites, at room temperature pinch of salt", "1/2 cup granulated sugar", "1/3 cup bittersweet chocolate, chopped into chunks (or store-bought chips)", "1/4 cup toasted almonds, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the racks to divide the oven into thirds and preheat the oven to 300°F. Line two baking sheets with parchment paper or silicone mats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the confectioners' sugar, ground almonds, and cocoa powder into a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with a stand mixer fitted with the whisk attachment (make sure the bowl is impeccably clean and dry), whip the egg whites and salt on medium speed until the whites are opaque. Increase the speed to medium-high and continue to whip as you add sugar about 1 tablespoon at a time. Then whip until the whites are firm and hold stiff peaks. They should still be very shiny. Beat in the vanilla, and remove the bowl from the mixer. With a large rubber spatula, quickly but gently fold in the dry ingredients, followed by the chopped chocolate and toasted almonds. The whites will inevitably deflate as you fold in the dry ingredients -- just try to work rapidly and use a light touch, so you deflate them as little as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a spatula to carefully spoon batter into gallon-size Ziploc bag. Seal the bag and trim a 1/2-inch hole from a corner to pipe the batter onto the baking sheets, leaving about 2 inches between the mounds. Dust the tops of the meringues very lightly with sifted confectioners' sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10 minutes, then, without opening the oven door, reduce the oven temperature to 200°F and bake for 1 hour more. Remove the baking sheets from the oven and allow the meringues to cool to room temperature. Then, peel the meringues from the baking sheets. Store in an airtight container.</p>"}]}