{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121031-pecan-pie-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["bourbon", "ice cream", "pecans", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pecan Pie Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/11/pecan-pie-ice-cream-recipe.html", "description": "A rich and creamy pecan-vanilla ice cream amped up with a salty molasses-twinged gooey swirl.", "totalTime": "5 hours, plus an overnight chill", "recipeYield": "makes about 5 cups", "recipeCategory": ["Ice Cream and Frozen Treats", "Nuts", "Thanksgiving"], "recipeIngredient": ["2 cups heavy cream", "1 cup milk", "1 vanilla bean, split and scraped", "2 cups (about 8 ounces) pecans, toasted and roughly chopped, divided", "6 egg yolks", "3/4 cup granulated sugar", "1 1/4 teaspoons Kosher salt, divided", "1/2 cup light (clear) corn syrup", "1/2 cup dark brown sugar", "2 tablespoons molasses", "2 tablespoons unsalted butter", "2 teaspoons bourbon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Pecan-Vanilla Ice Cream:</strong> Bring cream and milk to a simmer in a heavy saucepan over medium heat. Add vanilla and 4 ounces pecans, turn off heat, cover, and let steep for 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk egg yolks and granulated sugar together in a mixing bowl until thoroughly combined. Pour dairy through a fine mesh strainer into yolk mixture, whisking constantly. Whisk to combine and return mixture to saucepan. Discard pecans and vanilla bean. Cook dairy mixture over medium heat, whisking frequently, until a custard forms on the back of a spoon but a swiped finger leaves a clean line. Strain custard into an airtight container (preferably wide and shallow), stir in 1/2 teaspoon salt, and chill overnight or at least 6 hours. The next day, churn in ice cream maker according to manufacturer's instructions. Chill in freezer until firm but not totally solid, 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Bourbon Pecan Swirl:</strong> In a small, heavy saucepan, combine corn syrup, brown sugar, molasses, butter, and remaining 3/4 teaspoon salt. Cook on low heat until all ingredients are combined and sugar is fully dissolved. Stir in remaining 4 ounces toasted pecans. Stir in bourbon and reduce heat to very low, keeping sauce just warm enough to stay mobile.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large spoon or flexible spatula, quickly fold pecan swirl into ice cream, just enough to distribute without integrating swirl into base. Return to freezer to harden for 2 to 3 hours before serving. Pecan chunks may have settled to the bottom of the container, so scoop all the way to the bottom when serving.</p>"}]}