{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20100216-192806-knead-the-book-italian-baker-potato-bread.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "Italian", "keywords": ["bread baking", "breads", "Italian", "potatoes", "The Italian Baker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Italian Baker's Pan di Patate", "link": "https://www.seriouseats.com/recipes/2012/02/the-italian-bakers-pan-di-patate-recipe.html", "description": "When you think about potatoes, Italy is probably not the first country you think of. But that doesn't mean potatoes aren't grown there. I mean, there's gnocchi, right? So why not use potatoes in bread as well?", "totalTime": "4 hours", "recipeYield": "makes 2 loaves", "recipeCategory": ["Bread Baking", "Italian", "Potato", "Yeast Bread"], "recipeIngredient": ["1 1/2 pounds (675 g) baking potatoes", "4 1/2 teaspoons (2 packages / 0.5 oz / 14 g) active dry yeast", "3 to 4 tablespoons (1.5 to 2 oz / 45 to 60 g) warm water (or 1/4 cup / 2 oz / 60 g warm water plus \u20281/4 cup / 2 oz / 60 g cold water if using a processor)", "1 1/2 to 2 tablespoons (0.75 to 1 oz / 22 to 30 g) \u2028olive oil", "3 3/4 cups (17.5 oz / 500 g) unbleached all-\u2028purpose flour", "1 1/2 teaspoons (0.3 oz / 8 g) salt", "Cornmeal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the potatoes in water to cover until tender; drain. Peel the potatoes and press them through a ricer or mash until very smooth. Keep warm until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By mixer:</strong> Stir the yeast into 3 tablespoons of warm water; let stand until creamy, about \u202810 minutes. Place the potatoes, dissolved yeast, oil, flour, and salt in a mixer bowl. Beat with the paddle at low speed for \u20282 to 3 minutes. The dough will initially \u2028be very fine, like cornmeal, and then it \u2028will start to clump together. Add up to \u20281 tablespoon of water if necessary for the dough to come together. If you make a small ball of dough between your fingers, it should feel very slightly sticky. This is a hard dough that never gets very smooth. Knead by hand on a lightly floured surface for 3 to 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>By processor:</strong> Stir the yeast into the 1/4 cup of warm water; let stand until creamy, about \u202810 minutes. Place the potatoes, flour, and salt in a food processor fitted with the dough blade, and process with several pulses to mix. With the machine running, pour the dissolved yeast, oil, and the 1/4 cup of cold water through the feed tube and process until the dough comes together. Process 45 seconds longer to knead. This is a hard dough that never gets very smooth. If you want, finish kneading briefly by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First rise:</strong> Place the dough in a lightly oiled bowl, cover tightly with plastic wrap, and let rise until doubled, 1 to 2 hours. The processor dough is sticky and delicate because of the extra water, and the mixer dough is slightly tacky and looks chunky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shaping and second rise:</strong> Cut the dough in half on a lightly floured surface and shape each half into a round loaf, using very light tension in shaping. Flatten slightly with the palm of your hand to encourage it to spread just a bit. Place the loaves, seam side down, on heavily floured peels or rimless baking sheets. Flour the tops lightly and cover with dampened kitchen towels. Let rise until doubled, about 45 minutes. When fully risen, the dough will feel somewhat soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Baking:</strong> Thirty minutes before baking, preheat the oven with baking stones in it to 450ºF. Just before baking, sprinkle the stones with cornmeal. Very carefully invert the loaves onto the stones (the seam side will open dramatically in the baking). Bake 35 to 40 minutes, spraying the oven three times with water in the first 10 minutes. Cool completely on racks.</p>"}]}