{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120713-burger-topping-variations-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "burger toppings", "cheeseburger", "Hawaiian", "pineapple", "sandwich", "spam", "The Burger Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Hot Hawaiian Burgers (Spam, Pineapple, Swiss, and Sriracha Mayo)", "link": "https://www.seriouseats.com/recipes/2012/07/hot-hawaiian-burgers-spam-pineapple-swiss-and-sriracha-recipe.html", "description": "It's time to board a small charter flight to Polynesia, the land of Spam and pineapples. Why Spam and pineapple? Because it's a delicious combo that hits the rich/fresh/sweet flavors and the crisp/moist textures. Who wouldn't want that on a burger? Add a couple of slices of Swiss cheese along with a nice spoonful of sriracha-mayonnaise and the burger explodes with spice and goo&mdash;which is why a toasted English muffin and all its juice-catching nooks is such a great choice here (though regular burger buns would be mighty tasty too).", "totalTime": "45 mintues", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Burger", "Mains", "Pineapple", "Sandwiches", "The Burger Lab"], "recipeIngredient": ["24 ounces freshly ground beef chuck", "Kosher salt and freshly ground black pepper", "4 tablespoons mayonnaise", "1 tablespoon sriracha-style hot sauce", "4 slices Spam", "4 slices fresh pineapple, about the same size as a Spam slice", "8 slices Swiss cheese", "4 English muffins, split"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide meat into four even piles and shape into burger patties about 1/2-inch wider than English muffins. Season generously with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine mayo and sriracha in a small bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place burgers directly over hot side of grill and cook, turning occasionally, until well charred and internal temperature registers 125 to 130°F on an instant read thermometer for medium-rare, about 5 minutes total, or 135°F to 140°F for medium, about 6 minutes total. Top each burger patty with 1 slice cheese, then transfer to a large plate and tent with aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place spam and pineapple slices on hot side of grill and cook, turning occasionally, until heated through and well charred. Place 1 slice cheese on top of each Spam patty. Transfer Spam and pineapple to cool side of grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast English muffins on grill. Place bottom buns on a cutting board. Top with a slice of pineapple. Add burger patty. Top with SPAM. Top with sriracha mayo, then close burger. Serve immediately.</p>"}]}