{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120410-195206-shortbread-610x458-15.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["Cookies", "cornmeal", "Jamie Oliver", "semolina", "shortbread", "Sweet Technique"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Best Shortbread in the World", "link": "https://www.seriouseats.com/recipes/2012/04/best-butter-shortbread-cookie-recipe.html", "description": "This recipe is adapted from one by Jamie Oliver, from his book <em><a href=\"http://www.amazon.com/Cook-Jamie-Guide-Making-Better/dp/1401322336//?tag=serieats-20\" target=\"_blank\">Cook with Jamie</a></em>. It's a little less dainty than some other versions of shortbread, made extra crumbly by the addition of cornstarch and semolina flour. It's perfect on it's own, or served with berries, sorbet, or ice cream.", "totalTime": "3 hours", "recipeYield": "makes 12 servings", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["8 1/4 ounces unsalted butter", "4.2 ounces superfine sugar, plus extra for sprinkling on top", "1 teaspoon vanilla", "8 ounces all-purpose flour", "2 1/2 ounces cornstarch", "2 1/2 ounces finely ground semolina"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Draw an X with butter on the bottom of a 9x9-inch walled pan and line it with parchment, ensuring that some extra parchment hangs over the sides. Set aside. In the bowl of a stand mixer fitted with a paddle attachment, cream butter and sugar together until light and fluffy, approximately 3 minutes. Beat in vanilla until completely incorporated. Sift in flour, cornstarch, and semolina and mix on low speed until dough comes together. Finish mixing by hand to avoid overworking the dough. Press dough into the prepared pan using your fingers. Cover top with plastic wrap and press or roll with a small round cylinder. Place in fridge to chill for at least one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300&deg;F. Use a fork to poke holes all over surface of the dough. Bake until shortbread is a light golden brown, about 55 minutes, rotating every 15 minutes. Use a sifter to distribute a fine layer of superfine sugar over the surface of the shortbread. Allow to cool for 15 minutes, the carefully use the overhanging parchment to pull shortbread from the pan. Cut while still warm, transfer to a wire rack to cool completely. Store in an airtight container for up to three days.</p>"}]}