{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120827-219235-csbday1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["birthday cake", "cakes", "Cakespy", "fudge frosting", "layer cakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "My Birthday Cake", "link": "https://www.seriouseats.com/recipes/2012/08/cakespy-birthday-cake-recipe.html", "description": "Here's the classic I chose for my late August birthday this year: a fluffy golden yellow cake topped with a crowning glory of rich, stick-to-your teeth fudge frosting. The contrast of light cake and thick frosting is simply beyond compare&mdash;a taste and texture combination which is guaranteed to take you back to the glee of the birthday parties of yesteryear, if only for a few bites.", "totalTime": "1 hour, 30 minutes", "recipeYield": "Makes 12 servings", "recipeCategory": ["Cakes", "Cakespy"], "recipeIngredient": ["<strong>For the Cake: </strong>", "2 1/4 cups (about 9 ounces) sifted cake flour", "2 teaspoons baking powder", "1/2 teaspoon salt", "1 cup (2 sticks) unsalted butter, softened", "1 cup sour cream", "2 cups (about 14 ounces) sugar", "4 large eggs, separated", "2 teaspoons vanilla extract", " ", "<strong>For the Frosting: </strong>", "1 cup (2 sticks) unsalted butter, softened", "4 cups confectioners' sugar, divided", "1/2 cup unsweetened cocoa powder", "1/2 teaspoon salt", "2 teaspoons vanilla extract", "1/4 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack middle position and preheat oven to 350°F. Grease and flour two 8- or 9-inch round baking pans, then line them with circles of parchment paper. Whisk together the flour, baking powder, and salt; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, cream the butter on medium speed until smooth about 2 minutes, scraping the bowl as needed. Add the sugar and continue to mix until light and fluffy, another 2 to 3 minutes. Add the egg yolks one at a time, beating between addition and making sure that each is incorporated before adding the next. Beat in vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to low and add the dry ingredients alternately with the sour cream, in 2 to 3 additions each, ensuring that each addition is fully mixed in before adding the next. Scrape down the sides of the bowl with a rubber spatula after each addition. Transfer mixture to a separate large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean bowl of stand mixer carefully. Add the egg whites and beat with the whisk attachment on low speed until frothy, about 15 seconds. Gradually increase heat to high and beat until soft peaks form, about 1 minute. Using a rubber spatula, gently fold the whipped egg whites into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pans and smooth with an offset or a rubber spatula. Bake for until the cake is golden brown on top and a toothpick inserted into the center of the cakes should come out clean, 35 to 45 minutes, rotating half way through cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cakes cool in the pans for 5 minutes; run a paring knife around the perimeter of the cakes to release any sticky parts, then turn them out onto a wire rack. Let the cakes cool completely. If the cakes are domed on top,  use a serrated knife to make them level.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the frosting,</strong> in a stand mixer fitted with the paddle attachment, cream the butter on high speed until smooth, about 1 minute. In a separate bowl, sift together 3 cups of the confectioners' sugar with the cocoa.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar and cocoa mixture to the butter mixture in 2 to 3 additions, beating on low speed to incorporate. Pause to scrape down the sides of the bowl with a rubber spatula after each addition.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt, vanilla, and cream; increase speed to medium, and beat until the mixture is very fluffy a spreadable consistency. If the frosting is too soft, add a little more sugar; if it's too thick, add additional cream in small increments, mixing after each addition, until it has reached your desired consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, place one cake layer, flat side up, on a serving platter, and spread 1/2 to 3/4 cup of frosting on top. Leave a half-inch margin all around. Place the second cake layer, flat side up, on top of the frosted layer. Frost the sides and top, and garnish with decorating icing, sprinkles, or whatever festive treats you'd like.</p>"}]}