{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120614-210767-homemade-pantry-corn-tortillas.png", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alana Chernila", "corn tortillas", "The Homemade Pantry", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Homemade Pantry's Corn Tortillas", "link": "https://www.seriouseats.com/recipes/2012/06/how-to-make-corn-tortillas-from-scratch.html", "description": "The recipe is simple enough, just masa harina and water mixed, pressed and toasted up in a cast iron pan.  Once you make tortillas yourself you might not go back to the bagged version again.", "totalTime": "15 minutes", "recipeYield": "makes twelve 6-inch tortillas", "recipeCategory": ["Bread", "Cook the Book"], "recipeIngredient": ["2 cups masa harina (lime-treated cornmeal, available at Latin grocers and many supermarkets)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the masa harina and 1 ¼ cups water in the stand mixer bowl or mixing bowl. If using a stand mixer, use the dough hook and mix for 1 minute, or until the dough comes together in a ball. If mixing my hand, mix and knead the dough with your hands in a bowl until the dough comes together. Shape the dough into 12 balls, each about 3 inches in diameter. Lay a clean, damp dish towel over the balls of dough while you press the tortillas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start the cast-iron skillet or griddle, ungreased, over medium heat on the stove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line each side of the tortilla press with half a large freezer bag separated along the seam. Place a ball of dough in the center of the press and close it with all your weight. Open the press and peel the tortilla off the plastic. Transfer the tortilla to the heated griddle and cook for 30 seconds to 1 minute on each side, or until little spots appear on the surface. Use the spatula to remove the tortilla from the pan. Repeat with the other balls of dough. Serve immediately, or store, covered, in a warm oven or under a warm, damp cloth until ready to serve. </p>"}]}