{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120510-205109-knead-book-fast-breads-rowies.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "knead the book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fast Breads' Buttery Rowies", "link": "https://www.seriouseats.com/recipes/2012/05/fast-breads-buttery-rowies-recipe.html", "description": "I'd never heard of rowies until I saw this recipe in <em><a href=\"http://www.amazon.com/Fast-Breads-Recipes-Delicious-Bread/dp/0811865703/?tag=serieats-20\">Fast Breads</a>,</em> but as soon as I saw the recipe, I knew I had to try it. The concept is something like a croissant, but with fever folds, and with the dough cut so the butter leaks out during cooking.", "totalTime": "1 hour 30 minutes", "recipeYield": "makes 20 rolls", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["2 1/4 cups unbleached all-purpose flour", "2 teaspoons kosher salt", "2 1/4 teaspoons instant yeast (one 1/4-oz packet)", "1 cup hot water (about 130ºF) ", "1 cup plus 2 tbsp unsalted butter, at room temperature for 20 minutes to soften slightly"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the flat beater, mix together the flour, salt, and yeast on low speed just until combined. Add the hot water and mix just until all the ingredients are smoothly combined, then beat for 4 minutes. A soft dough will form that will come away from the sides of the bowl. Cover the bowl with a clean kitchen towel and let the dough rest for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cut the slightly softened butter into slices 1/4 inch thick. When the dough is ready, turn it out onto a floured work surface. Pat or roll the dough into a rectangle about 10 by 8 inches and 1/2 inch thick. Drop half of the butter slices evenly over the rectangle. Using a thin spatula and leaving a 1 inch border uncovered on all sides, spread the butter evenly over the dough. With a long edge facing you, fold the dough lengthwise into thirds, and pinch the edges tightly to seal. The dough package should now measure about 3 by 8 inches. </p>\r\n\r\n<p>With a long edge still facing you, use a rolling pin to roll the dough gently into a rectangle about 12 by 6 inches. Drop the remaining butter slices evenly over the rectangle. Using the thin spatula and leaving a 1 inch border uncovered on all sides, spread the butter evenly over the dough. With a short side facing you, fold the dough into thirds and pinch the edges tightly to seal. The dough package will be about 4 by 6 inches. Let the dough rest for 5 minutes, which will make the final rolling easier.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet/tray with 1 inch sides with parchment/baking paper. Use the rolling pin to roll the dough gently into a rectangle about 10 by 8 inches and 3/4 inch thick. Use a sharp knife to cut the dough into about 20 pieces each about 2 inches square. (Or, you can cut squares about twice as large and then cut each square into 2 triangles.) Place the squares on the prepared baking sheet, spacing them about 1 inch apart. Cover with a clean kitchen towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the rolls rise until they feel soft and puffy, about 30 minutes. The dough will not rise much. Most of the rising happens during baking. When the dough has risen for 10 minutes, position a rack in the middle of the oven and preheat to 400ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the rolls until they are browned and crisp on the top and the bottom, about 22 minutes. Some of the butter will leak out of the rolls, so they will be baking in the bubbling butter. Let the rolls cool on the pan on a wire rack for 10 minutes to reabsorb some of the released butter. Transfer the rolls to the rack to cool slightly, about 10 minutes, then serve. The rowies taste best if eaten the same day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The rowies can be covered and stored at room temperature for 1 day. To serve, preheat the oven to 275ºF and reheat the buns, covered with aluminum foil (covering them is important or they will dry out), until warm, about 15 minutes.</p>"}]}