{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120411-dt-stephanie-izards-manila-clam-and-sausage-linguine.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "Italian", "keywords": ["clam", "clams", "Dinner Tonight", "Girl and the Goat", "Italian", "linguine", "pasta", "quick", "sausage", "stephanie izard", "Top Chef"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stephanie Izard's Manila Clam and Sausage Linguine", "link": "https://www.seriouseats.com/recipes/2012/04/stephanie-izards-manila-clam-and-sausage-linguine-pasta-recipe.html", "description": "Sure, shellfish and cured pork almost always go well together&mdash;something I learned from Bill Buford's book <em>Heat</em>, a point he drives home over and over again.  But then you take crème fraîche and mix in horseradish, then amp up the whole thing with spicy sambal paste? Too intriguing to pass up.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Dinner Tonight", "Italian", "Mains", "Pasta", "Pork"], "recipeIngredient": ["1/2 cup creme fraiche", "1/3 cup prepared horseradish", "4 ounces sugar snap peas (about 2 cups)", "1 tablespoon olive oil", "8 ounces mild Italian pork sausage, casings removed", "1 pound dried linguine", "1/2 fennel bulb, minced (about 1 cup total)", "1 medium shallot, minced (about 1/4 cup)", "3 medium cloves garlic, minced (about 1 tablespoon)", "1/2 teaspoon sambal paste (or another chile sauce such as Sriracha)", "1 cup white wine", "2 pounds Manila clams", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the crème fraîche and horseradish and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil and add the snap peas.  Cook until almost tender, 2-3 minutes, then remove with a slotted spoon, leaving the water behind to cook the pasta. Run cold water over them to stop the cooking, or shock in an ice batch. Leave the pot on the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large (12-inch) skillet over medium heat until shimmering.  Add the sausage and break up into chunks in the skillet.  Cook, stirring only occasionally, until well-browned and nearly cooked through, 5 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the linguine to the boiling water and cook until al dente. Reserve 1/2 cup of pasta cooking water before draining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add the fennel, onion, and shallot to the sausage and cook until soft and fragrant, about 5 minutes more.  Stir in the sambal or other chile paste and cook for an additional minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine to the skillet and scrape up any brown bits on the bottom of the pan, bringing the wine to a simmer.  Add the clams and cover the skillet with a tight fitting lid and cook, stirring occasionally, until the clams are opened, 3 to 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cooked pasta and the snap peas to the pan and toss well to combine.  Add a little pasta water if it seems dry. Just before serving, add the crème fraîche and season to taste with salt and pepper. Toss well to combine and serve immediately.</p>"}]}