{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121213-seared-foie-food-lab-17.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["figs", "foie gras", "holiday nibbles", "hors d'oeuvres", "mostarda", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-Seared Foie Gras With Fig Mostarda and Fresh Figs", "link": "https://www.seriouseats.com/recipes/2012/12/pan-seared-foie-gras-fig-mostarda-fresh-figs-food-lab-recipe.html", "description": "Seared foie gras lacquered with a sweet-hot fig mostarda and fresh figs.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Offal", "Other Meats", "The Food Lab"], "recipeIngredient": ["<strong>For the Fig Mostarda</strong>", "6 dried figs, split into quarters", "1 cup cognac", "1 cup sugar", "1 tablespoon whole grain mustard", "1/4 teaspoon hot mustard powder", "pinch salt", " ", "<strong>For the Foie Gras:</strong>", "4 slabs fresh grade \"A\" foie gras, each 1/2-inch thick, lightly scored in a hashmark pattern on one side (6 to 8 ounces total, see note)", "Freshly ground black pepper", "1 tablespoon finely sliced chives", "Coarse sea salt such as Maldon or fleur de sel", "4 fresh figs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Fig Mostarda:</strong> Combine dried figs, cognac, sugar, whole grain mustard, and mustard powder in a small saucepan and bring to a simmer over medium-high heat. Reduce heat to maintain a bare simmer and cook until reduced and syrupy, about 30 minutes. Transfer to a bowl and set aside until cool. Season with a pinch of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Foie Gras</strong>: Lay a double layer of paper towels on top of a plate or cutting board and set aside. Season foie gras liberally on all sides with salt and pepper. Heat a small skillet over high heat for at least 3 minutes. Place foie gras in skillet scored-side-down. It should immediately start smoking, sizzling, and rendering fat. If it doesn't, remove and allow the pan to preheat for another 1 to 2 minutes. Once all four pieces of foie are in skillet, cook, swirling pan gently every few seconds, until deeply browned and crisp on first side, about 30 seconds. Use a thin metal spatula to flip foie gras onto second side and cook for 30 second longer. Transfer to paper towel-lined plate and let rest for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a small spoon to glaze each piece of foie gras with syrup from fig mostarda. Spoon some of the fig mostarda onto four individual serving plates and place 1 slice of foie gras on each. Top with chives, coarse sea salt, and fresh fig slices. Serve immediately with lightly dressed greens.</p>"}]}