{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121010-225358-cottage-pudding.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "brandy", "cake recipes", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cottage Pudding with Brandy Caramel Sauce", "link": "https://www.seriouseats.com/recipes/2012/10/cottage-pudding-with-brandy-caramel-sauce-recipe.html", "description": "Cottage pudding is neither a cottage nor a pudding. It is however, a simple cake topped with sauce. Lovely boozy sauce.", "totalTime": "1 hour", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Cakes"], "recipeIngredient": ["<strong>For the Cake</strong>:", "2 1/4 cups (11 1/4 ounces) flour", "4 teaspoons baking powder", "1/2 teaspoon salt", "4 tablespoons (1/2 stick) butter", "2/3 cup (about 4 3/4 ounces) sugar ", "1 egg, well beaten", "1 cup milk", "1 teaspoon vanilla extract", " ", "<strong>For the Brandy Caramel Sauce</strong>:", "4 tablespoons (1/2 stick) butter\t", "2 eggs, separated into yolks and whites", "1 cup (8 ounces) light brown sugar", "2 tablespoons brandy\t", "1/2 cup heavy cream", "1/2 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Move the oven rack to the center position and preheat the oven to 350&deg;F. In a medium bowl whisk together flour, baking powder, and salt and set aside. Grease and flour a 9-by 9-inch baking dish and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, cream the butter on medium speed until light and soft, about 3 minutes. Add sugar gradually, then add the egg, mixing until just combined, about 15 seconds. Reduce speed to low, then with machine running, alternately add milk and flour mixture, in three batches, stopping to scrape down sides as necessary, until fully incorporated. Stir in vanilla and pour batter into prepared baking dish. Bake until the top of the cake is a light golden brown and a cake tester comes out clean, about 35 minutes. Transfer to a wire cooling rack and let cool at least 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Wipe out stand mixer bowl. Cream the butter on medium speed until light and soft, about 3 minutes. Reduce speed to low and add sugar gradually. Slowly stir in the brandy. Add the yolks and cream, beating until just combined. Transfer mixture to a double boiler and cook over hot water whisking constantly until light and smooth, 7 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove brandy mixture from heat. Carefully clean stand mixer bowl and attach whisk head. Beat the egg whites on medium-high speed until soft peaks form, about 2 minutes. Pour brandy mixture over egg whites then quickly whisk together. Using a wooden skewer, poke 50 to 60 holes in the surface of the cake, then slice to serve. Pour the sauce over the cake and serve immediately.</p>"}]}