{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121016-226541-bar-bites-pork-schnitzel-meatballs.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "meatballs", "pork", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Schnitzel Meatballs", "link": "https://www.seriouseats.com/recipes/2012/10/bar-bites-pork-schnitzel-meatballs-recipe.html", "description": "For this meatball version of pork schnitzel, a simple blend of thyme, lemon zest, and parsley is combined with ground pork; the mixture is then formed into balls, rolled in flour, egg, and panko and then deep-fried until crisp. The crunchy panko shell gives way to a juicy schnitzel interior&mdash;just like its cutlet counterpart. And also like its cutlet counterpart, these meatballs need no further embellishment other than a squeeze of lemon, but a bit of sauerkraut or a dip in grainy mustard work wonderfully well too.", "totalTime": "30 minutes", "recipeYield": "Makes 18 to 20 meatballs", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Christmas", "Pork"], "recipeIngredient": ["2 tablespoons, plus 1 cup Panko breadcrumbs", "3 tablespoons milk", "1 pound ground pork", "1/2 teaspoon chopped fresh thyme", "2 teaspoons grated zest from 1 lemon", "Kosher salt", "1/2 teaspoon freshly ground black pepper", "1 tablespoon chopped parsley", "1/2 cup flour", "1 egg, beaten", "1 quart vegetable, canola, or peanut oil."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine 2 tablespoons of Panko with the milk and set aside to soak for 2 to 3 minutes. Add the ground pork, thyme, lemon zest, 1 teaspoon kosher salt, pepper, and parsley and gently mix until thoroughly incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with wet hands, use a tablespoon measure to scoop out meat mixture and roll between your palms to form a meatball about an inch in diameter. Transfer to rimmed baking sheet or large plate and repeat until all the mixture is used.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour, egg, and remaining cup of Panko into three separate medium bowls or shallow dishes. Dredge each meatball in the flour, then in the egg, and finally in the panko. Replace the breaded meatballs on the rimmed baking sheet or plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large cast iron skillet, Dutch oven, or wok until it reaches 350°F on a deep-fry thermometer. Adjust flame to maintain temperature. Working in batches, fry the meatballs, turning frequently, until golden brown and crisp, 3 to 4 minutes total. Transfer the meatballs to a large platter lined with paper towels and season with salt. Serve the meatballs with lemon wedges, or with grainy stone-ground mustard.</p>"}]}