{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120202-superbowl-snack-vegan-7.jpeg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Latin American", "keywords": ["cinco de mayo", "empanadas", "latin", "Super Bowl", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoky Potato and Caper Empanadas With Cilantro Sauce", "link": "https://www.seriouseats.com/recipes/2012/02/smoky-potato-and-caper-empanadas-with-cilantr-recipe.html", "description": "The chipotle and curry powder in the filling give the little pockets a good kick.", "totalTime": "2 hours", "recipeYield": "Makes 12 to 16 small empanadas", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Latin American", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Filling:</strong>", "2 medium potatoes (about 1/2 pound), but into 1/4-inch dice", "Kosher salt", "2 tablespoons extra-virgin olive oil", "1 medium onion, finely diced", "2 cloves garlic, grated on a microplane grater", "1 chipotle pepper en adobo, finely chopped (about 1 tablespoon), plus 1 tablespoon adobo sauce", "2 tablespoons capers, drained and roughly chopped", "1/2 teaspoon madras curry powder", "2 tablespoons minced fresh cilantro leaves", "&nbsp;", "<strong>For The Dough:</strong>", "2 cups (10 ounces) all-purpose flour", "1 cup (5 ounces) masa harina", "1 tablespoon kosher salt", "8 tablespoons vegetable shortening", "1/2 to 3/4 cup ice cold water", "2 quarts vegetable oil (if frying), or 2 tablespoons if baking", "&nbsp;", "<strong>For the Sauce:</strong>", "2 cups cilantro leaves and tender stems", "1 green bird chile or serrano pepper", "1 clove garlic", "2 tablespoons juice from 1 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Cover potatoes with cold water by 1-inch in a medium saucepan and add 1 tablespoon kosher salt. Bring to a boil over high heat. Reduce to a simmer and cook until potatoes are tender, about 8 minutes. Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse pan and dry. Heat olive oil over medium-high heat until shimmering. Add onions and cook, stirring frequently until softened but not browned, about 4 minutes. Add garlic and cook until fragrant, about 30 seconds. Add chipotle and sauce, capers, curry powder, and potatoes. Stir to combine, lightly mashing potatoes. Season to taste with salt and stir in cilantro. Transfer to a large plate and set aside until completely cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Process half of flour, masa, and salt in a food processor with three 1-second pulses. Add shortening in chunks and process in 1-second pulses until dough resembles wet sand, about 12 pulses. Add remaining cup flour and pulse 4 times until homogenous. Transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>add 1/2 cup cold water. Knead dough until it forms a ball. It should feel slightly tacky. If dry, add more water 1 tablespoon at a time. Wrap dough ball in plastic and refrigerate until ready to use, at least 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Combine cilantro, pepper, garlic, and lime juice in a blender. Add 1/4 cup water. Blend until smooth, adding water as necessary and scraping down sides as necessary. Season to taste with salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble and Cook:</strong> Divide dough into 12 to 16 even pieces (depending on how large you want them to be). Roll each piece into a ball. Working one piece at a time, roll dough out on a lightly floured surface with a rolling pin or press with a tortilla press into a 3 1/2- to 4 1/2-inch round. Place a few teaspoons of filling in the center of each dough round. Brush edges of dough with water and gently fold in half. Crimp edges or press with the tines of a fork to seal. Set aside and repeat with remaining empanadas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake:</strong> Adjust oven rack to upper and lower middle positions and preheat to 400°F. Line two baking sheets with parchment paper Place empanadas on baking sheet and brush with 2 tablespoons oil. Bake until golden brown and crisp, about 30 minutes. Serve with cilantro sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Fry:</strong> Heat 2 quarts oil to 350°F in a large wok or dutch oven. Fry empanadas a half dozen at a time, agitating occasionally, until golden brown and crisp, about 4 minutes. Serve with cilantro sauce.</p>"}]}