{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/DSC07879.JPG", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cadbury creme eggs", "Cakespy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cadbury Creme Egg Salad Sandwiches", "link": "https://www.seriouseats.com/recipes/2012/03/cadbury-creme-egg-salad-sandwiches-recipe.html", "description": "The bag lunch staple gets a sweet upgrade for Easter with this sweet trompe l'oeil sandwich, in which pound cake slices sandwich a \"salad\" comprised of yellow-tinted frosting studded with almonds and sliced Cadbury Creme Eggs, garnished with green coconut bits to resemble lettuce. It's a fun dish to serve at a party, and a perfect complement to your <a href=\"http://www.seriouseats.com/recipes/2011/03/cakespy-cadbury-creme-deviled-eggs-easter.html\">Cadbury Creme Deviled Eggs</a> and <a href=\"http://www.seriouseats.com/recipes/2010/03/cakespy-cadbury-creme-eggs-benedict-dessert-breakfast-recipe.html\">Cadbury Creme Eggs Benedict</a>.", "totalTime": "15 minutes", "recipeYield": "makes 8 sandwiches", "recipeCategory": ["Cakes", "Cakespy", "Candy", "Easter"], "recipeIngredient": ["1 ready-made pound cake (approximately 9 x 5 inches)", "3/4 cup vanilla buttercream frosting ", "2-3 drops yellow food coloring", "4 Cadbury creme eggs, refrigerated", "3 tablespoons almond slivers", "1/2 cup shredded coconut", "2-3 drops green food coloring"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice your pound cake into sixteen slices, about 1/2 inch-thick each, setting aside heels from either end for another use. If it is difficult to slice without the cake crumbling, place the pound cake in the freezer for 10 minutes (this will help it become a bit more firm and easier to slice). Set slices aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 3/4 cup buttercream frosting in a medium bowl. Add 2-3 drops of yellow food coloring and stir; add more drops of food coloring and stir until your desired egg salad color has been achieved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove your cadbury creme eggs from the refrigerator. Cut each egg into eighths. Do this by first cutting each egg into quarters, and then cutting each quarter in half. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently fold the Creme egg pieces and the slivered almonds into the frosting. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place your shredded coconut into a clear plastic bag with 2-3 drops of green food coloring. Shake vigorously, until the coconut has been tinted an even shade of green. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble your sandwiches. Place two slices of pound cake side by side. On one slice, spread a heaping tablespoonful of the \"egg salad\" mixture. Top it with a small spoonful of the shredded coconut mixture to give the look of lettuce on top. Gently place the second slice of pound cake on top to form a sandwich. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the remaining pound cake slices until you've formed 8 sandwiches. If desired, slice in half and serve with jelly beans on the side for a sweet Easter treat.</p>"}]}