{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/230912-SE-Skillet%20Suppers-Braised%20Winter%20greens.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["broccoli rabe", "One Pot Wonder", "pasta", "quick", "quinoa", "quinoa pasta", "skillet suppers", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Spicy Braised Broccoli Rabe with Quinoa Pasta", "link": "https://www.seriouseats.com/recipes/2012/11/braised-greens-quinoa-pasta-skillet-suppers-recipe.html", "description": "Braised broccoli rabe cooked in a skillet with quinoa-based pasta makes a quick, healthy, one-skillet meal.", "totalTime": "25 minutes", "recipeYield": "seres 4", "recipeCategory": ["Mains", "One-Pot Wonders", "Pasta", "Quinoa", "Stovetop", "Vegetarian"], "recipeIngredient": ["2 tablespoons olive oil", "1 large shallot, thinly sliced (about 1/2 cup)", "Kosher salt and freshly ground black pepper", "½ tablespoon dried red chili flakes, plus more to taste", "2 medium cloves garlic, thinly sliced", "1 bunch broccoli rabe, stems trimmed and the rest cut into 2-inch-thick pieces (about 6 cups) ", "4 cups homemade or store-bought low-sodium chicken stock", "3 cups quinoa, spelt, or farro penne pasta", "2 tablespoons fresh squeezed lemon juice from 1 lemon", "Pecorino-Romano to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 12-inch skillet over medium-high heat until shimmering. Add the shallots, a pinch of salt and the chili flakes and cook until softened, about 2 minutes. Add the garlic and cook, stirring constantly, until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 cups broccoli rabe and 2 cups of broth and cook, stirring until the rabe wilts enough to fit more into the pan. Continue adding rabe and broth until all the rabe and the liquid is in the skillet. Add the pasta and stir to combine. Bring the liquid to a boil, then lower the heat until the liquid is at a vigorous simmer. Allow to cook, stirring occasionally, until most of the liquid has been absorbed and the pasta is al dente or at desired consistency, 7 to 9 minutes. Stir in the lemon juice and season to taste with salt and pepper. Serve immediately with grated or cubed cheese.</p>"}]}