{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120613-209494-british-bites-kedgeree.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "egg", "kedgeree", "rice", "smoked fish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kedgeree (British Curried Rice With Smoked Haddock)", "link": "https://www.seriouseats.com/recipes/2012/06/british-bites-kedgeree-recipe.html", "description": "Rice, curry, smoked haddock, and eggs&mdash;at first glance these ingredients seem a tad odd, but if you've ever had a steaming plate of kedgeree, you know that it all comes together like a poem in your mouth.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["British Bites", "Eggs", "Fish", "Mains", "Rice"], "recipeIngredient": ["4 eggs", "1 cup jasmine rice", "1/2 pound smoked haddock", "1 cup milk", "1 bay leaf", "1 tablespoon butter", "1 medium onion, finely chopped (about 1 cup)", "1 medium clove garlic, finely chopped (about 1 teaspoon)", "1 Thai chili, seeded and chopped (optional)", "3 tablespoons curry powder", "1 tablespoon fresh juice from 1 lime", "1/2 cup chopped fresh cilantro leaves", "1/4 cup sliced scallions", "1 lime cut into 8 wedges", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the eggs with cold water and bring to a simmer; cover and remove from heat.  Let sit for 6 minutes then shock under cold water.  Peel under cold running water, then quarter. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 cups of water to a simmer, add rice and return to a simmer for 5 minutes. Turn heat to low, cover and allow rice to steam until water is fully absorbed and rice is cooked, about 18 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place smoked haddock, milk, and bay leaf in a saucepan and bring to a simmer.  Cook until haddock flakes easily, about 5 minutes.  Remove from heat and remove haddock from milk and gently flake with your fingers; Remove any bones.  Remove bay leaf from milk and discard; reserve milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a large skillet over medium heat; when butter is melted, add onion, garlic, and optional chili.  Cook, stirring frequently, until onions are soft and garlic is aromatic, about 6 minutes.  Add curry powder and toss with vegetables until curry is fragrant, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice to curry and onions and toss until ingredients are fully incorporated. Add haddock and reserved milk and gently toss until haddock is incorporated. Add lime juice and taste for seasoning.  Gently fold in quartered eggs and cilantro and serve with lime wedges.</p>"}]}