{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120129-potato-kale-soup-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cauliflower", "kale", "potatoes", "soup", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "4"}, "name": "Smoky Charred Cauliflower and Potato Soup With Kale", "link": "https://www.seriouseats.com/recipes/2012/01/vegan-smoky-charred-cauliflower-and-potato-soup-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] A vegan riff on the Portuguese soup of caldo verde. When charred, cauliflower attains a nuttiness that borders on meaty while simultaneously becoming sweeter....", "totalTime": "1 hour", "recipeYield": "makes about 3 quarts soup, serving 6", "recipeCategory": ["Cauliflower", "Dairy-Free", "Kale", "Potato", "Soups and Stews", "Vegan"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil, plus more for serving", "1 small head cauliflower, cut into 1-inch florets (about 1 1/2 pounds)", "1 medium onion, finely sliced (about 1 cup)", "3 garlic cloves, grated on a microplane grater", "2 chipotle chiles packed in adobo sauce, chopped fine, with 1 tablespoon sauce from can", "2 quarts water", "2 pounds russet potatoes, peeled and chopped into 2-inch chunks", "1/2 pound kale leaves, thick stems removed, leaves roughly chopped", "2 bay leaves", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a Dutch oven or large saucepan over high heat until shimmering. Add cauliflower and cook, stirring occasionally until well browned and lightly charred on all sides, about 10 minutes total, reducing heat as necessary if smoking cauliflower starts to burn or oil smokes too heavily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium-low. Add onions and cook, stirring frequently, until softened, about 2 minutes. Add garlic and chipotles and cook, stirring frequently, until fragrant, about 2 minutes. Add half of water and bring to a boil. Simmer until cauliflower is completely tender, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a hand blender or standing blender, puree cauliflower/onion/chipotle mixture until smooth. Return to pot. Add remaining water, potatoes, kale, and bay leaves. Bring to a boil over high heat, reduce to a simmer, and cook until potato is easily smashed and incorporated into broth, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bay leaves and mash potatoes with a large spoon or potato masher. Season to taste with salt and pepper. Serve, drizzling with extra-virgin olive oil.</p>"}]}