{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/diyvsbuy-coconutrum.jpg", "author": {"@type": "Person", "name": "Marcia Simmons"}, "recipeCuisine": "", "keywords": ["cocktail ingredients", "coconut", "DIY vs Buy", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "DIY Coconut Rum", "link": "https://www.seriouseats.com/recipes/2012/03/diy-coconut-rum-homemade-captain-morgans-recipe.html", "description": "Since this recipe doesn't have any sugar, it's a nice way to put a little coconut in your drink without adding sweetness. For more flavor, you could adding vanilla, peppercorns, grains of paradise, cardamom, ginger, basil, lemongrass, or chiles.", "totalTime": "2-3 weeks", "recipeYield": "Makes about 2 1/2 cups", "recipeCategory": ["Coconut", "Other Drinks", "Rum"], "recipeIngredient": ["1 whole, ripe coconut", "2 1/2 cups light rum"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Locate the three black dots, or \"eyes,\" on the coconut. Hold the coconut securely, then pierce a hole through one of the eyes by tapping the screwdriver with the hammer. Drain the coconut water out and reserve it for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a firm hold on the coconut with one hand, use the other hand to tap forcefully around the center equator of the coconut with the hammer. Rotate the coconut and continue to tap along the equator until you see a crack forming. (Some stores will even start a hairline crack in the coconut in order to make this process easier.) Once the crack has gone across most of the coconut, pry the coconut apart with your hands or with the screwdriver. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a sharp knife to separate the white coconut meat from the coconut shell. Discard shell. Chop coconut meat into chunks&mdash;you will get around 10 ounces of coconut meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the coconut chunks in a sealable glass jar and pour in rum. Seal and shake. Let it steep for a minimum of two weeks and up to three weeks, shaking often. Sample as you go to see how the flavor is progressing. Once desired flavor is achieved, remove the coconut chunks. Strain through cheesecloth or coffee filter, then store in a glass bottle or jar at room temperature for up to a year.</p>"}]}