{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120130-190584-chicken-with-tomatoes-and-olives.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "Edward Behr", "olive", "The Art of Eating Cookbook", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "The Art of Eating's Sautéed Chicken with Tomatoes and Olives ", "link": "https://www.seriouseats.com/recipes/2012/01/sauteed-chicken-with-tomatoes-olives.html", "description": "For this <strong>Sautéed Chicken with Tomatoes and Olives</strong>, the chicken is browned then left to simmer with a sauce of white wine, onions, and tomatoes that cooks down to a remarkably complex gravy.  Rendered lardons and olives are thrown in at the last minute for bursts of big, salty flavor.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Olives", "Tomato"], "recipeIngredient": ["1/4 pound lean salt pork, lardo, or pancetta without rind, cut crosswise in 1/4-by-1/4-inch lardons", "Excellent, fresh-tasting olive oil", "Salt and black pepper", "A chicken, weighing 4 to 5 pounds, cut into 8 pieces: 4 sections of breast roughly equal in size (including the wings attached to 2 of them) plus 2 thighs and 2 drumsticks", "All-purpose flour", "2 onions, finely chopped", "1/2 cup white wine", "2 cloves garlic, very finely chopped", "1 teaspoon fresh thyme leaves or 1/2 teaspoon dried thyme", "5 tomatoes, peeled, seeded, and chopped", "2 bay leaves ", "3/4 cup green or black Niçoise or other olives cured in brine ", "A large handful of parsley, chopped not long before serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the lardons into a pan of cold water, bring them to a boil, drain, and rinse in cold water. In a large, heavy pot, sauté the lardons in 2 tablespoons of olive oil until their edges just begin to crisp and they render some of their fat; remove them to a paper towel to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Salt and pepper the chicken, and coat the pieces lightly with flour. sauté the chicken in the fat from the lardons, turning, until the pieces are golden on all sides. Remove the chicken to a warm plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over low heat, cook the onions in the same fat, adding more oil if needed, stirring until they are translucent but not colored. Add the wine, raise the heat, and stir to deglaze the pan. Add the garlic and thyme and cook briefly to reduce the amount of liquid by about half. Add the tomatoes and bay leaves, and simmer until the liquid is reduced again by about one-third, depending on how juicy the tomatoes are, to a strong but not intense flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the chicken to the pot, and cook over medium-low heat, covered, until the chicken is done—perhaps 20 minutes, according to how thoroughly you sautéed it beforehand. During the last few minutes of cooking, add the sautéed lardons and the olives. Remove the bay leaves. Taste and season as needed with salt and pepper. Sprinkle with chopped parsley. Warn everyone that the olives have pits.</p>"}]}