{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20121005-224509-cook-the-book-stuffed-trout.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fish", "laurie wolf", "nedd ludd", "portland", "portland oregon chef's table", "trout"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ned Ludd's Stuffed Ruby Trout, Fennel, Scallions, and Herbs", "link": "https://www.seriouseats.com/recipes/2012/10/stuffed-ruby-trout-fennel-scallions-and-herbs.html", "description": "Salmon and trout make up a huge part of the Pacific Northwest's seafood economy, so it's no surprise that hyper-local restaurants like <a href=\"http://www.nedluddpdx.com/#!\">Ned Ludd</a> in Portland feature fish prominently on their menu. Most of these dishes at Ned Ludd are prepared in their huge wood-fired oven, which means adaptation is the name of the game when cooking this fish at home.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Fish", "Gluten-Free", "Mains"], "recipeIngredient": ["4 whole ruby trout, deboned (steelhead or rainbow also acceptable)", "Sea salt, to taste", "1 teaspoon ground fennel seeds", "1/2 teaspoon ground white pepper", "1/2 teaspoon ground brown mustard seeds", "1/2 teaspoon ground yellow mustard seeds", "4 lemons, 2 halved lengthwise and thinly sliced, 2 halved for juicing", "2 fennel bulbs, halved, cored, and thinly sliced, plus fronds", "2 bunches green onion, trimmed and halved through the stalk", "2 radishes, thinly sliced", "1/2 cup flat leaf parsley, stemmed and chopped", "2 tablespoons tarragon, stemmed and roughly chopped", "2 tablespoons chives, chopped", "Extra-virgin olive oil, to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 500°F. Place the rack on the lowest level. Open the trout to expose the flesh. Season with salt and spices. Place lemon and fennel fronds evenly over the flesh and fold the fish over. Lightly oil and season the fish on both sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter the fennel and scallion over a sheet pan or a large cast iron skillet. Place the trout on the pan. Roast fish for 6 to 8 minutes. Set the broiler on high and move the fish to the highest level. Move the fish under the broiler and roast another 5 to 7 minutes until the skin is crisp and the vegetables are browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the fish on individual plates. Scatter the vegetables over the fish. Squeeze half a lemon over each fish. Finish with radishes, herbs, extra-virgin olive oil, and sea salt. Serve immediately.</p>"}]}