{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/230712-11-19-12-Turkey%20dinner_skillet%20supper-Serious%20Eats.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["One Pot Wonder", "quick", "skillet suppers", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Easy Skillet Turkey Dinner", "link": "https://www.seriouseats.com/recipes/2012/11/easy-skillet-turkey-dinner-recipe.html", "description": "All the flavors of a thanksgiving meal from turkey to roast vegetables to gravy, made in a single skillet.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mains", "One-Pot Wonders", "Turkey"], "recipeIngredient": ["4 turkey cutlets, about 1 1/2 pounds total", "Kosher salt and freshly ground black pepper", "2 1/2 tablespoons olive oil", "3 ½ cups chopped mixed vegetables, such as split brussels sprouts, sweet potatoes, and small yellow potatoes, all cut into 1/2 to 1-inch pieces", "Pinch of dried red chile flakes", "1 to 2 fresh rosemary sprigs", "2 tablespoons unsalted butter", "¼ cup flour ", "2 cups homemade or storebought low-sodium chicken broth", "1 tablespoons fig, cranberry or lingonberry preserves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F. Season the turkey cutlets with salt and pepper. Heat 1 tablespoon oil in a 12-inch skillet over high heat until shimmering. Add the cutlets and cook until browned on one side, about 4 minutes, then flip and repeat on the other side. Remove and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same skillet, heat the remaining tablespoon of oil over medium-high heat until shimmering. Add the vegetables and cook until browned, 2 to 3 minutes, stirring. Season with salt, pepper and chile flakes, if using. Add the rosemary sprig, and transfer to the oven. Cook for 6 minutes. Place turkey cutlets on top of vegetables and return to oven. Continue cooking until vegetables are tender and turkey registers 155°F on an instant read thermometer, 15 to 20 minutes longer. Transfer to a serving platter and tent with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the skillet and return to medium-high heat. Add the butter and flour, whisking to combine. Add the broth and bring to a boil, whisking together until thickened, about two minutes. Season with salt and pepper. If desired, swirl in fig preserves and serve with the turkey.</p>"}]}