{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120626-211763-GFTues-GnocchiHowTo12.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "Gluten-Free Tuesday", "gnocchi", "pasta", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gluten-Free Potato Gnocchi", "link": "https://www.seriouseats.com/recipes/2012/06/gluten-free-potato-gnocchi-recipe.html", "description": "Tender, fluffy potato gnocchi, without the wheat flour.", "totalTime": "2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday", "Potato"], "recipeIngredient": ["2 pounds russet potatoes, washed", "1 cup white rice flour", "1/2 cup sweet rice flour", "2 large eggs", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center middle position and preheat oven to 400&deg;F. Pierce potatoes a few times with a knife and place on a baking sheet. Roast until tender, about one hour. Remove potatoes from oven and allow to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together white rice flour and sweet rice flour. Using the flour mixture, flour your counter. Peel the potatoes and pass through a potato ricer onto the counter. Whisk together eggs and 1 teaspoon salt. Pour over the potatoes. Work the egg mixture into the potatoes with a bench scrapper or fork until potatoes begin to hold together. Mixture will be sticky. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Work one cup of the flour mixture into the potato mixture. Start by working the flour into the potato mixture with a bench scrapper or fork. As soon as a dough begins to form, begin kneading the dough by hand until all the flour is incorporated. The dough should be firm and not sticky. If it is, add the remaining flour mixture, about 1/4 cup at a time. (You can test the gnocchi by boiling a small pot of water and cooking a small piece of dough. The gnocchi should hold together.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into quarters. Then, as you work with it, cut each quarter in half. Cover remaining dough with a damp paper towel. Roll out each dough eighth into a log. Cut into bite-size pieces. Shape by either pressing a small indentation into each gnocchi or rolling the gnocchi over a fork or gnocchi board. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer shaped gnocchi to a lightly white rice-floured baking sheet. Shaped gnocchi can either be frozen or cooked right away. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Freeze: </strong>Place baking sheet filled with gnocchi in the freezer. Once the gnocchi are frozen, transfer to a plastic freezer bag. Gnocchi may be frozen for up to two months. Cook as directed below.<p><br />\r\n<strong>To Cook:</strong> Boil a large pot of salted water. Cook half the fresh or frozen gnocchi in the boiling water until they  float, about four minutes. (Taste one gnocchi to ensure it is cooked through). Remove the gnocchi from the water with a skimmer and transfer to a bowl or pot of sauce. Repeat with remaining gnocchi. If gnocchi must be held for more than a moment, drizzle with oil and toss to prevent sticking.</p>"}]}