{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120423-195206-toffee-610x458-11.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["almond", "candy", "chocolate", "espresso", "toffee"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Almond Espresso Toffee", "link": "https://www.seriouseats.com/recipes/2012/04/chocolate-coffee-almond-toffee-recipe.html", "description": "This is a slight variation on most toffee recipes, which usually only hints at coffee, taking on notes of it from the caramelization. This recipe calls for the addition of espresso, either in as an instant powder, or, if you don't mind a bit of gritty texture, finely ground espresso beans.", "totalTime": "5 hours", "recipeYield": "makes approximately 30 pieces", "recipeCategory": ["Candy", "Desserts", "Nuts"], "recipeIngredient": ["8 ounces (2 sticks) butter, cut into 1 inch pieces", "2 tablespoons corn syrup", "3 ounces (6 tablespoons) cold water", "10 ounces (about 1 1/2 cups) granulated sugar", "1 1/2 teaspoons baking soda, sifted to remove all lumps", "1 tablespoon finely ground espresso, or powdered instant espresso", "1 teaspoon salt", "8 ounces dark chocolate, tempered", "6 ounces toasted almonds, finely chopped (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line jelly roll pan with parchment on the bottom and sides and set aside. Assemble all ingredients and your tools. In a large, heavy saucepan, combine the butter, sugar, water, and corn syrup. Turn the heat to medium and use a pastry brush dipped in cool water to wash down the sides of the pan to ensure that there's not sugar stuck to the edges. Once the butter and sugar melt and the mixture begins to bubble, place the thermometer in the pot and cook until the temperature reaches 300&deg;F. Remove the mixture from heat, and working quickly to prevent further cooking,  immediately mix in the espresso or espresso powder, followed by the baking soda and salt. Mix until incorporated, then pour the mixture out onto the prepared pan. Allow the toffee to cool down to room temperature, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the tempered chocolate and pour it out over the toffee. Using an offset spatula, spread the chocolate in an even coat over the toffee. Sprinkle the top with the chopped almonds and allow the chocolate to set completely, about 2 hours, preferably overnight. Remove the parchment from the pan and cut the toffee into rectangles. Store in an airtight container in a cool, dry place.</p>"}]}