{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/2012418-scooped-dark-chocolate-ice-cream-primary.jpg", "author": {"@type": "Person", "name": "Ethan Frisch"}, "recipeCuisine": "", "keywords": ["chocolate", "dark chocolate", "ice cream", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "(Basic but Fantastic) Dark Chocolate Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/04/basic-but-fantastic-dark-chocolate-ice-cream-recipe.html", "description": "This recipe is eminently flexible&mdash;a version of this flavor, paired with tawny port wine, was Guerrilla Ice Cream's most popular flavor and received accolades on these hallowed <a href=\"http://newyork.seriouseats.com/2010/06/guerrilla-ice-cream-a-new-cart-nyc-social-justice-political-movements.html\">pages</a>, among others. Replace the water with rum, or beer, or juice and adjust to taste before spinning, and you can create any chocolate-based combo flavor that your heart desires.", "totalTime": "10 hours", "recipeYield": "makes 1 quart", "recipeCategory": ["Chocolate", "Ice Cream and Frozen Treats"], "recipeIngredient": ["6 ounces (approximately 3/4 cup) chopped high-quality dark chocolate, ideally 70+% cocoa solids", "3 cups half-and-half (or 1 1/2 cups each of milk and heavy cream)", "1 cup raw sugar, reserving 1/4 cup", "6 egg yolks", "1/4 cup of water (or any other liquid)", "2 teaspoons instant coffee"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot over a low to medium flame, heat the sugar and water until the sugar bubbles and caramelizes and becomes a deep copper color, about 6 minutes. Reduce the heat to as low as possible and slowly add the half-and-half. The mixture will sputter and foam dramatically as you add it, and the sugar will immediately harden but it will gradually melt again and you'll be able to mix it into the dairy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heat-proof mixing bowl, whisk the egg yolks with the reserved 1/4 cup of sugar until the mixture lightens in color, to a pastel yellow. Slowly ladle a few cups of the hot dairy into the mixing bowl and whisk together, to temper your yolks. Slowly pour the yolks back into the pot, whisking as you do so. Add the instant coffee and whisk until dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the mixture has thickened enough to coat the back of a spoon, remove it from the heat and add the chopped chocolate, and mix vigorously, until the chocolate is melted and fully incorporated. The residual heat will be enough to melt the chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill the mixture for at least 4 hours or overnight in the refrigerator. Spin in your ice cream machine according to manufacturer's insturctions.</p>"}]}