{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120401-195206-bread-pudding-610x458-9.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["bread pudding", "challah", "Sweet Technique"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Challah Bread Pudding", "link": "https://www.seriouseats.com/recipes/2012/04/bread-pudding-recipe.html", "description": "Whether you choose to make it because you've got something you need to use up (eggs, milk, stale bread), or just because you love it, bread pudding delivers a whole lot of dessert satisfaction with just a small amount of effort.", "totalTime": "3 hours", "recipeYield": "serves 8", "recipeCategory": ["Bread Pudding", "Puddings and Custards"], "recipeIngredient": ["Butter for greasing the pan", "2 eggs", "8 egg yolks", "8 ounces granulated sugar", "16 ounces (about 2 cups) heavy cream", "32 ounces (about 3 cups) whole milk", "1 tablespoon vanilla extract", "1/2 teaspoon salt", "25 ounces of stale challah, cut into rough 1-inch pieces (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 325&deg;F. Grease a ceramic baking dish with butter and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk eggs and yolks together until well-combined. Continue to whisk, adding in the sugar a little at a time. Once all the sugar has been whisked in, whisk for an additional minute, until mixture is lightened in color. Add cream, milk, vanilla, and salt and whisk until the mixture is well-combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bread pieces in a large bowl. Pour custard mixture over bread and allow to soak for a few minutes. Toss bread to coat all pieces evenly, then allow to soak for several minutes more. Pack bread pieces evenly into the baking dish. Pour excess custard liquid over the bread and allow to soak in completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover baking dish tightly with foil. Bake pudding for 30 minutes with the cover on, then remove foil and bake until the pudding puffs slightly and does not seep liquid when pressure is applied to the top of the pudding - an additional 20-30 minutes. Allow to cool for 20 minutes before serving warm.</p>"}]}