{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121022-bake-the-book-rubys-bones.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Cookies", "dog treats", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Ruby's Bones", "link": "https://www.seriouseats.com/recipes/2012/10/peanut-butter-bacon-dog-treats-cookies-recipe.html", "description": "Avid bakers, here's a recipe you can share with your canine companion. Peanut butter and bacon is a flavor combination no person or pup could turn down. Make them crunchy, or chewy. Either way, they'll get snatched up.", "totalTime": "80 minutes", "recipeYield": "makes 20 \"bones\"", "recipeCategory": ["Bacon", "Bake the Book", "Nuts"], "recipeIngredient": ["4 strips thick-sliced bacon", "1⁄2 cup water, plus a few tablespoons for cooking the bacon", "1⁄4 cup (60 grams) peanut butter", "1 large egg", "3 tablespoons (57 grams) honey ", "3/4 teaspoon kosher salt", "1 cup (160 grams) all- purpose flour", "1 cup (90 grams) wheat germ", "1⁄2 cup (70 grams) whole wheat flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the bacon into fine julienne, about 1/8 inch thick, and place in a skillet over medium- high heat. Add a few tablespoons of water and cook, rendering out the fat, until the bacon is light golden brown and starting to get crispy. Remove the pan from the heat and transfer the bacon, with all the fat, to a bowl and allow to cool for 5 to 10 minutes. Stir in the water, peanut butter, egg, honey, and salt. Set the wet ingredients aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another bowl, combine the flour, wheat germ, and whole wheat flour. Add the wet ingredients and use a rubber spatula to combine everything into a soft dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dough on a lightly floured work surface and use a rolling pin to roll it out to a thickness of about 1/4 inch. Cut out dog bone shapes with a cookie cutter and place them at least 1/2 inch apart on a parchment- lined baking sheet. Gather the scraps together and re-roll, cutting out more dog bones and placing them on the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a fork to prick each dog bone in 2 or 3 places. Place the baking sheet inside a second baking sheet to double- pan, then place in the oven and bake until the dog bones are golden brown, 35 to 40 minutes, rotating once halfway through the baking time. Turn the oven off and let the bones dry out in the oven until the oven returns to room temperature. Remove the bones from the oven and allow to cool on a wire rack, then store in an airtight container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you, or your dog, prefer a dog bone that is a little softer and chewier, skip the step of allowing the bones to cool in the oven and instead transfer them to a wire rack as soon as they are baked and allow them to cool to room temperature.</p>"}]}