{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120815ChorizoCod.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["beans", "cannelini beans", "chorizo", "cod", "Dinner for Two", "pesto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Chorizo Crusted Cod and Beans with Arugula Pesto", "link": "https://www.seriouseats.com/recipes/2012/08/chorizo-crusted-cod-and-beans-with-arugula-pesto-recipe.html", "description": "A thick piece of cod, roasted with pennies of Spanish chorizo full of garlic and paprika, perched on a bed of cannellini beans toss in a basil-arugula pesto.  All in one pot and twenty minutes.", "totalTime": "20 minutes", "recipeYield": "serves 2", "recipeCategory": ["Beans and Pulses", "Dinner for Two", "Fish", "Mains", "Pesto"], "recipeIngredient": ["1 clove garlic", "1 cup arugula", "1 cup basil", "1/4 cup coarsely grated Pecorino Romano", "1/4 cup olive oil, plus 2 teaspoons", "Kosher salt and freshly ground black pepper", "2 (6-ounce) pieces of cod or hake", "1 (2-ounce) piece of Spanish chorizo, thinly sliced", "1 (14.5-ounce) can of cannellini beans, drained and rinsed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the oven rack in the lower middle position.  Preheat the oven to 400°F.  Put the garlic, arugula, Pecorino, and 1/4 cup olive oil in afood processor and process until a rough paste is formed. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the cod with salt and pepper.  Layer the thin slices of chorizo on the top of each fillet like the scales on a fish. Heat remaining 2 teaspoons of oil to a small nonstick skillet over medium-high heat until shimmering.  Carefully place the fish (with its chorizo scales facing up) in the skillet. Cook for 2 minutes on the stovetop, then transfer to the oven until the fish is cooked through, 10 to 12 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove fish from skillet and set aside.  Add beans and 1 tablespoon of water to the skillet and heat over medium high heat until the water is evaporated and beans are warm. Stir in pesto. To plate, make a bed of the pesto beans, and top with the chorizo fish.</p>"}]}