{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120912-222430-bar-bites-roasted-hatch-chiles.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "chicken", "chili", "cinco de mayo", "hatch chiles", "quesadilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Grilled Tequila Chicken and Hatch Chile Quesadillas", "link": "https://www.seriouseats.com/recipes/2012/09/bar-bites-grilled-tequila-chicken-and-hatch-chili-quesadaillas-recipe.html", "description": "The heat and earthiness of the Hatch chilis are a great match to the citrus tang of the chicken thighs in these cheesy quesadillas.", "totalTime": "24 hours", "recipeYield": "Makes 6 quesadillas", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Chicken", "Sides"], "recipeIngredient": ["1/4 cup fresh juice from 3 to 4 limes", "1/4 cup tequila", "2 tablespoons chopped fresh cilantro leaves", "1 teaspoon kosher salt", "1 teaspoon freshly ground black pepper", "1 teaspoon ground cumin", "1/2 teaspoon dried red pepper flakes", "1 pound boneless, skinless chicken thighs", "1 pound fresh Hatch chiles, or a mix of Anaheim and Poblano", "1 cup grated chedder cheese", "1 cup grated monterey jack cheese", "12 (10-inch) flour tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine lime juice, tequlia, cilantro, salt, pepper, cumin, and pepper flakes in a medium bowl and whisk until well combined. Place the chicken thighs in a large zip-top bag, then pour in the marinade and seal the bag, squeezing out as much air as possible. Marinate the chicken in the refrigerator overnight, turning occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chile peppers on the hottest part of the grill. Grill the chiles, turning frequently with tongs, until the skin is blistered and charred, about 5 minutes total. Transfer the charred peppers to a large bowl and cover the bowl with plastic wrap. Set the peppers aside until they are cool enough to handle, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the marinade and place the chicken on the hottest part of the grill. Grill the chicken just until they are nicely charred with grill marks on both sides, 4 to 5 minutes per side. Transfer the grilled chicken thighs to a cutting board and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your fingers, remove the charred skin from the cooled chile peppers (the skins should come off easily). Using a sharp knife, remove the stems from the chile peppers and cut a slit down one side of each chili pepper. Scrape out and discard the seeds. Roughly chop the chile peppers and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the cooked chicken thighs into rough 1/4-inch cubes. Combine the cooked chicken, chile, and cheese in a medium bowl. Lay out 6 of the tortillas on a flat work surface. Evenly distribute the cheese mixture among the tortillas, then top each with the remaining 6 tortillas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully place the filled tortillas on the cool side of the grill, working in batches if necessary. Cook the tortillas until the bottoms are slightly crisp and grill marks appear, 3-5 minutes. Using a large metal spatula, flip the tortillas over and continue to grill until the cheese is melted and the other side is crisp, 3 to 5 minutes longer. If some of the quesadillas are cooking faster than others, rearrange them on the grill as necessary. Remove the quesadillas from the grill, cut them into wedges, and serve immediately.</p>"}]}