{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120816-219005-thai-chicken-larb.1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "Thai", "keywords": ["chicken", "chicken dinner", "dinners", "larb", "quick", "thai", "weeknight dinners"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Thai Chicken Larb", "link": "https://www.seriouseats.com/recipes/2012/08/thai-chicken-larb-recipe.html", "description": "This healthy dish of ground chicken, shallots, mint, and cilantro is full of fresh and hot Southeast Asian flavors. Serve it as a crispy lettuce wrap or over rice. It can be on the table in under 30 minutes.", "totalTime": "45 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Chicken", "Chicken Dinners", "Mains", "Salads", "Thai"], "recipeIngredient": ["<strong>For the larb:</strong>", "24 ounces skinless boneless chicken breast (or pre-ground chicken breast, see note)", "1/2 cup chicken stock", "2 teaspoons vegetable oil", "2 teaspoons granulated sugar, plus extra as desired", "1/4 teaspoon salt", "6 large cloves garlic, minced (about 2 tablespoons)", "4 to 6 tablespoons fresh  juice from about 6 limes, plus extra as desired", "5 to 6 tablespoons fish sauce, plus extra as desired", "3/4 teaspoon dried red chili flakes (preferable Thai), plus extra as desired", "6 small shallots, peeled and sliced into thin rings (about 1 cup)", "1 1/4 cups fresh mint leaves, chopped", "1 1/4 cups fresh cilantro leaves, chopped ", "2 tablespoons toasted glutinous rice powder (see note)", "<strong>With the larb:</strong>", "4 to 6 cups cooked rice, preferably glutinous", "extra fish sauce, lime wedges, chili flakes, sugar on the side", "1 large heat iceberg lettuce or green leaf"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim chicken of visible fat and cut into 1-inch cubes. Place in single layer on tray and freeze until partially frozen, about 30 minutes. Working in 2 or 3 batches, pulse chicken in food processor until roughly ground into pieces the size of small peas; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large 12-inch skillet (or wok), heat the chicken stock over medium-high heat with the oil, sugar, and salt. Add the chicken and the garlic, and cook until the chicken is just cooked through, stirring and breaking up the chicken, about 2 to 3 minutes. Stir in the lime juice, fish sauce, and chili flakes. Stir in the shallots, mint, and cilantro. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the ground toasted rice. Season to taste with more sugar, lime juice, fish sauce, and chili flakes as desired. Serve the larb warm or room temperature rice and lettuce.</p>"}]}