{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/102312-227325-Serious-EatsSuperNachoB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["nachos", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Layered \"Super\" Nachos", "link": "https://www.seriouseats.com/recipes/2012/10/layered-super-nachos-recipe.html", "description": "Nachos made in smashed-down form result in a crispy vehicle for your toppings of choice.", "totalTime": "1 hour, 15 minutes", "recipeYield": "6- to-8", "recipeCategory": ["Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the salsa:</strong> ", "14 tomatillos, husks removed and washed ", "3 serrano peppers, divided use ", "4 cloves garlic, finely chopped, divided use ", "Juice from 1/2 lemon", "1/2 medium white onion, finely chopped, divided use", "3/4 cup loosely packed cilantro leaves, cleaned, divided use", "2 3/4 teaspoons kosher salt, divided use", "&nbsp;", "<strong>For the Guacamole:</strong>", "2 avocados, peeled, seeded and mashed", "Juice of 1 lime", "&nbsp;", "<strong>For the Nachos:</strong> ", "2 tablespoons vegetable oil, divided use", "1 pound ground beef", "1 tablespoon ancho chile powder", "1 1/2 teaspoons ground cumin", "1/2 teaspoon ground coriander", "1/2 teaspoon dried oregano, preferably Mexican ", "1/2 teaspoon garlic powder ", "2 teaspoons onion powder", "1/4 teaspoon cayenne powder", "1/2 teaspoon smoked paprika", "1/2 cup water", "16-ounce bag tortilla chips", "10 ounces sharp cheddar cheese, grated", "2 fresh jalapenos, sliced", "5.75-ounce can black olives, sliced", "2 tomatoes, finely chopped", "1 cup sour cream", "2 limes, wedged"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to broil. Put tomatillos on a baking sheet lined with foil and place in the oven until softened and lightly charred, about 15 minutes minutes total, turning half way during cooking. Remove from the oven and place tomatillos and any cooking juices in a blender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While tomatillos roast, fill a small saucepan with water, add peppers, and bring to a boil over medium-high heat. Continue to boil, stirring periodically, until peppers take on a gray-green tinge, about 6 minutes. Trim stems from peppers and add two of them to the blender, along with 2 cloves garlic, lemon juice, 1/2 of the onion, about 2/3 of the cilantro and 3/4 teaspoon salt. Pur&eacute;e until smooth. Taste and adjust seasoning, if necessary. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the guacamole by finely chopping the remaining pepper and cilantro. Add to a medium bowl, along with the avocado, remaining 1/2 onion, remaining 2 cloves garlic, lime juice and 1 teaspoon of salt. Mash to combine. Taste and adjust seasoning, if necessary. Cover and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium sauté pan, heat 1 tablespoon vegetable oil over medium-high heat until shimmering. Add ground beef and cook, breaking it up with a wooden spoon, until fully cooked, 6 to 7 minutes. Add chile powder, cumin, coriander, oregano, garlic powder, onion powder, cayenne, paprika and 1 teaspoon salt. Stir to combine, then add water. Bring to a simmer and cook until liquid is reduced, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a large baking sheet with remaining 1 tablespoon vegetable oil. Cover the pan with a layer of tortilla chips. Use the back of a flat spatula to smash chips into small pieces. Spread evenly with meat and top with half of the shredded cheese. Spread the remaining tortilla chips on top, again using the spatula to break them into small bits. Finish with an even shower of the remaining cheese, and top with sliced jalapenos.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put baking sheet into the hot oven and bake until cheese is melted and bubbly, about 15 minutes. Remove from oven and slice into squares. Serve with black olives, tomatoes, sour cream, limes, salsa and guacamole.</p>"}]}