{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120313PatesAuxCepes.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["French in a Flash", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pâtes aux Cêpes (Tagliatelle with Porcini Mushrooms and Crème Fraîche)", "link": "https://www.seriouseats.com/recipes/2012/03/pates-aux-cepes-tagliatelle-with-porcini-mushrooms-and-creme-fraiche-recipe.html", "description": "An all year version of a special French pasta: fresh tagliatelle with porcinis, made simply with crème fraîche, dried porcinis, and some fresh mushrooms, garlic, and thyme.  To die for.", "totalTime": "55 minutes", "recipeYield": "serves 4", "recipeCategory": ["French", "Pasta", "Vegetarian"], "recipeIngredient": ["1 3/4 ounces dried porcini mushrooms", "1 1/2 cups boiling water", "5 1/4 ounces fresh baby button mushrooms, finely sliced", "2 medium cloves garlic, thinly sliced", "2 stems thyme, leaves only (about 1/2 teaspoon leaves)", "2 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "1 pound of fresh tagliatelle noodles", "1/2 cup crème fraîche", "Finely chopped parsley leaves and grated Parmigiano-Reggiano (for serving)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the dried porcinis in a bowl and cover with the boiling water.  Cover with plastic wrap, and let soak for 30 minutes.  Drain the mushrooms well, reserving all soaking liquid, and roughly chop the porcinis.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler on high. In a large bowl, toss the porcinis, button mushrooms, thyme, garlic, olive oil, and salt and pepper.  Transfer to an oven-proof straight-sided 12-inch sautée pan and broil 3 inches below the heat source, tossing every few minutes, until the mushrooms are golden brown, about 15 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of salted water to a rolling boil. When the mushrooms are broiled, pour in the reserved mushroom liquid and the crème fraîche and scrape up any bits of mushroom from the bottom of the pan. Keep warm over low heat. Boil the fresh tagliatelle until al dente (about 2 minutes, or according to package instructions).  Drain pasta, reserving 2 cups of cooking liquid. Toss the tagliatelle with the mushroom sauce, adding pasta water as needed to moisten. Season to taste with more salt and pepper and serve immediately, topped with parsley and parmigiano-reggiano.</p>"}]}