{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120229-195224-soda-cracker-fudge.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["candy", "chocolate", "fudge", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Soda Cracker Fudge", "link": "https://www.seriouseats.com/recipes/2012/03/soda-cracker-chocolate-peanut-butter-fudge-recipe.html", "description": "This fudge packs peanut butter and marshmallow flavor into every bite. The secret to its crunchy texture? Saltine crackers.", "totalTime": "1 hour", "recipeYield": "Makes 64 1-inch squares of fudge", "recipeCategory": ["Candy", "Nuts"], "recipeIngredient": ["5 tablespoons peanut butter", "24 saltine crackers, coarsely crushed", "1 packet of unflavored gelatin (2 1/2 teaspoons)", "1/3 cup cold water, for gelatin, plus 1/4 cup for syrup", "3 cups sugar, divided", "1 teaspoon vanilla extract", "½ cup whole milk", "10 oz best quality dark chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously grease an 8 x 8 baking dish and set aside. In a large bowl, mix together peanut butter and crushed saltine crackers. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer, sprinkle gelatin evenly over 1/3 cup of cold water. Allow gelatin to soften, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine 1/4 cup water, 1 cup sugar, and vanilla and stir over medium-high heat until sugar is dissolved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop stirring, and place a candy thermometer into sugar water, wiping any sugar crystals from the side with a wet brush. Boil sugar until temperature reaches the \"soft-ball stage\" (238&deg;F), and don’t take your eyes off it. Timing is everything in confection and you don’t want the syrup to crystallize. Once 238&deg;F is reached, remove from heat. Working quickly, add syrup to softened gelatin. Using the whisk attachment of an electric mixer, hand-stir the mixture for a few minutes as it cools. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat mixture with the whisk attachment on medium high until soft peaks form and the white fluffy mixture holds its shape, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While marshmallow mixture is beating, combine milk and 2 cups of sugar in a small saucepan. Stir over medium-high heat until sugar is dissolved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop stirring, and place a candy thermometer into mixture. Boil sugar mixture on medium high until temperature reaches the \"soft-ball stage\" (238&deg;F). Remove from heat and quickly pour over cracker mixture. Working quickly add in marshmallow cream, stirring until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour fudge into prepared 8 x 8 dish. Use a large sheet of wax paper to press the fudge into the dish and ensure even distribution. Let cool for about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl melt chocolate in the microwave. Heat chocolate on high in 30 second intervals, stirring between intervals until it's completely melted and smooth. Pour chocolate over fudge and spread to coat evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool completely so that chocolate is hard. Cut into 1-inch squares and serve. Keeps several days stored in a cool place in an airtight container.</p>"}]}