{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121108-228678-cook-the-book-mushroom-bourguignon.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "deb perelman", "mushrooms", "the smitten kitchen cookbook", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "'Smitten Kitchen's Mushroom Bourguignon", "link": "https://www.seriouseats.com/recipes/2012/11/smitten-kitchens-mushroom-bourguignon.html", "description": "Those who have followed <strong><a href=\"http://smittenkitchen.com/about/#Deb\">Deb Perelman's</a></strong> blog <a href=\"http://smittenkitchen.com/\">Smitten Kitchen</a> for any length of time have learned that she works wonders with vegetables (and also butter). Her past life as a food-loving vegetarian shows in each of her recipes. Her <strong>Mushroom Bourguignon</strong> is a perfect example. Meaty portobellos (or creminis) and pearl onions are browned a la chuck roast, then added to a rich tomato and wine gravy.", "totalTime": "50 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mushrooms", "Pasta", "Vegetarian"], "recipeIngredient": ["2 tablespoons (30 ml) olive oil", "2 tablespoons (30 grams) butter, softened", "2 pounds (905 grams) Portobello mushrooms, in 1/4-inch slices (you can use cremini instead)", "1 cup (115 grams) pearl onions, peeled (thawed if frozen)", "1/2 carrot, finely diced", "1 small yellow onion, finely diced", "1 teaspoon fresh thyme leaves,or 1/2 teaspoon dried thyme", "Table salt", "Freshly ground black pepper", "2 garlic cloves, minced", "1 cup (235 ml) full-bodied red wine", "2 tablespoons (35 grams) tomato paste", "2 cups (475 ml) beef or vegetable stock (beef broth is traditional, but use vegetable to make it vegetarian; the dish works with either)", "1 1/2 tablespoons (12 grams) all-purpose flour", "Egg noodles, for serving", "Sour cream and chopped chives or parsley, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil and 1 tablespoon butter in a medium-sized Dutch oven or heavy saucepan over high heat. Sear the mushrooms and pearl onions until they begin to take on a little color— your mushrooms will make a delightful “squeak- squeak” as they’re pushed around the hot pan— but the mushrooms do not yet release any liquid, about 3 or 4 minutes. Remove mushrooms and onions from the pan and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the flame to medium, and add the second tablespoon of olive oil. Toss the carrot, onion, thyme, a few good pinches of salt, and several grinds of black pepper in the pan, and cook for 5 minutes, stirring occasionally, until the onion is lightly browned. Add the garlic, and cook for just 1 more minute. Season with more salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine to the pot, scraping any stuck bits off the bottom, then turn the heat all the way up and reduce it by half, which will take about 4 to 5 minutes. Stir in the tomato paste and the stock. Add back the mushrooms and pearl onions with any juices that have collected, and bring the mixture to a boil; reduce the temperature so it simmers for 10 to 15 minutes, or until both the mushrooms and onions are very tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour and the remaining butter with a fork; stir this into the stew. Season to taste with salt and pepper. Lower the heat, and simmer for 10 more minutes. If the sauce is too thin, boil it down to reduce to a “coating” consistency. Season with additional salt and pepper if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, spoon the stew over a bowl of egg noodles, dollop with sour cream, if using, and sprinkle with optional chives or parsley.</p>\r\n\r\n<p><strong>Do ahead:</strong> The mushroom stew reheats very well on the second and third days, in a large saucepan over low heat.</p>"}]}