{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120125heartpile600.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["banana", "BraveTart", "candy", "cherry", "clove", "freeze dried fruit", "gluten free", "key lime", "Necco", "orange", "peppermint", "strawberry", "Valentine's Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Conversation Hearts", "link": "https://www.seriouseats.com/recipes/2012/02/bravetart-how-to-make-conversation-hearts-valentines-candy.html", "description": "Sprite gives the candies a faint acidity that helps them taste like the real thing, and to that same end I've made suggestions for how to flavor each color to match the classic flavor line up. But don't hesitate to experiment! No doubt you'll think of all sorts of fun, alternative flavor pairings limited only by the extracts or freeze dried fruits you can get your hands on.", "totalTime": "24 hours", "recipeYield": "makes 4 cups", "recipeCategory": ["Banana", "Candy", "Cherry", "Desserts", "Gluten-Free", "Mother's Day", "Orange", "Strawberry", "Valentine's Day"], "recipeIngredient": ["1/4 ounce gelatin", "4 ounces Sprite", "40 ounces powdered sugar", "1/4 teaspoon salt", "&nbsp;", "For white: 1 to 2 drops  <a href=\"http://www.amazon.com/Dram-Lorann-Wintergreen-Natural-Flavor-Count/dp/B003EMXKDK/ref=pd_sbs_gro_2\">wintergreen extract</a> ", "For yellow: 1/4 ounce freeze dried bananas, ground into a powder", "For pink: 1/4 ounce freeze dried strawberries or cherries, ground into a powder", "For green: 3 to 4 drops <a href=\"http://www.silvercloudestates.com/product/Pure-Key-Lime-Extract-176.aspx\">key lime extract</a>", "For orange: 1/4 teaspoon orange extract plus 1/4 teaspoon orange flower water", "For purple:  one drop <a href=\"http://www.silvercloudestates.com/product/Pure-Clove-Extract-518.aspx\">clove oil</a>", "Coordinated food colorings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bloom the gelatin: </p>\n\n<p>In the bowl of a stand mixer, combine gelatin and Sprite. Whisk with a fork to combine; let stand five minutes. Meanwhile, bring a small pot of water to a boil. Place the bowl of gelatin over hot water and stir occasionally until melted.</p>\n\n<p>(If using a hand mixer you can use a water bath too, or use a microwave safe bowl and zap the gelatin at five second intervals until melted.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the sugar paste:</p>\n\n<p>Fit the stand mixer with a paddle attachment. Mix melted gelatin/Sprite mixture with about two cups of powdered sugar and until it forms a sauce like consistency. Add in the salt and continue adding powdered sugar, a few cups at a time, until a dough forms. You may not need all of the powdered sugar; use any excess for rolling out the paste later.</p>\n\n<p>The finished candy \"dough\" should be thick, malleable and not particularly sticky. Turn the dough out onto the counter and knead (using more powdered sugar to prevent sticking if necessary) until smooth. </p>\n\n<p>With a knife or bench scraper, divide the dough into six portions, or however many colors/flavor portions you plan on having.</p>\n\n<p>Place all the dough portions into a zippy bag, or wrap each in plastic. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flavoring and coloring the candies:</p>\n\n<p>If you have disposable gloves, this next step will be easy, just like kneading bread dough. If you don't, you'll knead the dough between two sheets of plastic wrap or through a large zippy bag.</p>\n\n<p>Take one portion of dough, unwrap, and make an indentation in the center with your fingers. In the well, place a few drops of the desired extract/freeze dried fruit powder along with a touch of food coloring (if using). </p>\n\n<p>Knead the dough until the color is perfectly uniform, about 3 minutes. Taste a pinch of the dough and adjust the flavor if need be.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rolling and cutting the candy:</p>\n\n<p>Have a parchment lined sheet tray ready. On a surface dusted very lightly with powdered sugar, roll the dough out with a pin to 1/4\" thickness. Use a heart shaped cutter to stamp out the candies. You can gather and reroll the scraps as many times as you like. </p>\n\n<p>Transfer the cut-outs to the prepared tray and set aside.</p>\n\n<p>Repeat the flavoring/coloring, rolling and cutting process with remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drying the candy:</p>\n\n<p>Let the cut-out hearts air dry, uncovered, for at least 24 hours. If you have pets or kids, be sure to set the trays somewhere out of the way. </p>\n\n<p>After 24 hours, sample one of the candies. If the texture is to your liking, you're done! If you prefer a harder, crunchier texture, flip the hearts over to expose their bottom sides and dry another 24 hours. </p>\n\n<p>In either case, decorate the candies (or not) with a food pen. Store in an airtight container, indefinitely.</p>"}]}