{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120712-214287-blue-moon-ice-cream.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "ice cream", "ice cream month"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Blue Moon Ice Cream", "link": "https://www.seriouseats.com/recipes/2012/07/blue-moon-ice-cream-recipe.html", "description": "Blue Moon ice cream and its Smurf counterpart are sweet, sweet, sweet and bright blue. If either of these things are a turnoff, you might leave this flavor to the kiddos and the young at heart. Anyone left standing grab a spoon and dig in!", "totalTime": "3 hours plus chilling time", "recipeYield": "Serves 6", "recipeCategory": ["American Classics", "Ice Cream and Frozen Treats"], "recipeIngredient": ["2 egg yolks", "1/2 cup sugar", "2 cups heavy cream ", "1 cup whole milk", "1 tablespoon instant vanilla pudding mix", "1 teaspoon raspberry flavoring", "1 teaspoon lemon oil", "1/2 teaspoon vanilla extract", "1/8 teaspoon blue gel food coloring (about 2 drops)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl lightly beat egg yolks with a 1/4 cup of sugar and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan add cream, milk, and remaining sugar.  Whisking occasionally, heat mixture over medium low heat until bubbles begin to form along the edges of the pan. Remove from heat and add heated cream mixture to the eggs one tablespoon at a time while whisking constantly to temper the eggs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cream mixture and eggs have been combined return to the saucepan and heat on medium low until mixture coats back of a spoon or spatula and line drawn with a finger leaves a distinct trail. Mixture should register 170° to 175° F, do not allow mixture to overheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour custard into a medium bowl and whisk in vanilla pudding mix until thoroughly incorporated. Whisk in raspberry flavoring, lemon oil and vanilla extract until thoroughly incorporated.  Set bowl over an ice bath. Let cool at room temperature for 1 hour, stirring occasionally, then cover and refrigerate for 2 more hours or up to overnight until completely chilled. Churn chilled custard according to your ice cream maker's instructions. Transfer ice cream into a bowl or container that will hold 1 quart. Cover and freeze for at least 3 hours to fully set. Serve.</p>"}]}