{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120613AsianFriedCalamari.png", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Chinese", "keywords": ["calamari", "Chinese", "chinese five spice powder", "Dinner for Two", "fried"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Five-Spice Fried Calamari with Sesame and Lime", "link": "https://www.seriouseats.com/recipes/2012/06/chinese-fried-calamari-with-sesame-and-lime-recipe.html", "description": "Calamari is like an upmarket version of fish sticks. It's both comforting and slightly elevated. A lot of people get nervous about frying, or about seafood in general, but fried seafood is one of the easiest things you can make. Here, strips and tentacles are coated in a Chinese five-spice powder and flour dusting, and fried in two minutes until golden and crisp. Tossed with scallions, cilantro, and lime, these calamari are exotic, quick, fresh, and totally hit the spot.", "totalTime": "10 minutes", "recipeYield": "serves 2", "recipeCategory": ["Chinese", "Deep Frying", "Dinner for Two", "Mains", "Other Seafood"], "recipeIngredient": ["1 pound calamari tubes and tentacles", "1 cup unbleached all-purpose flour", "2 tablespoons Chinese five spice powder", "1/4 cup sesame seeds, black or white, plus more for garnish", "1 quart vegetable or peanut oil", "Kosher salt", "2 scallions, thinly sliced", "2 tablespoons finely chopped cilantro", "1/2 teaspoon zest from 1 lime", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the calamari by slicing the tubes into 1/2-inch strips and cutting the tentacles in half down the center.  Rinse and drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large plastic food storage bag, toss together the flour, Chinese five spice powder, sesame seeds, and 1/2 tablespoon kosher salt.  Add the calamari. Seal and shake the bag until the calamari is coated in the flour mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a wok, Dutch oven, or cast iron chicken fryer to 370°F.  Transfer calamari to a colander or strainer and shake over sink to remove excess flour. Using hands, carefully add half of calamari to oil, bringing it as low as possible to oil before dropping in to prevent splashing. Fry, agitating constantly with a wire mesh spider until golden brown and crisp, about 2 minutes. Transfer to a large paper towel-lined plate and season immediately with salt. Repeat with second batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss fried calamari with green onion, cilantro, extra sesame seeds, and lime zest and serve with lime wedges.</p>"}]}