{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120724RoastedTurkeyMeatballs.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["Dinner for Two", "meatballs", "polenta", "quick", "tomato sauces", "turkey", "turkey meatballs"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Turkey and Porcini Meatballs with Rosemary and Polenta", "link": "https://www.seriouseats.com/recipes/2012/07/turkey-and-porcini-meatballs-with-rosemary-and-polenta-recipe.html", "description": "Light, soft turkey meatballs simmered in a porcini-rosemary tomato sauce, and poured over creamy polenta.  Perfect comfort food.", "totalTime": "30 minutes plus 15 minutes for soaking the mushrooms", "recipeYield": "2 servings, with leftovers", "recipeCategory": ["Dinner for Two", "Mains", "Other Grains", "Turkey"], "recipeIngredient": ["1 ounce dried porcini mushrooms", "1 pound ground dark meat turkey", "1/2 egg, beaten", "2 tablespoons milk", "1/4 cup breadcrumbs", "1 1/4 cups finely grated Pecorino Romano, divided", "1 tablespoons chopped fresh rosemary leaves, plus 1 whole stem fresh rosemary", "4 tablespoons chopped flat leaf parsley, divided", "3 medium cloves garlic, finely chopped (about 1 tablespoon)", "1 tablespoon olive oil", "2 cups <a href=\"http://www.seriouseats.com/recipes/2011/08/marinara-sauce-recipe.html\">marinara sauce</a>", "1 cup dry polenta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, soak the porcini mushrooms in 1 cup of recently boiled water for 15 minutes.  Once the mushrooms are reconstituted, finely chop and reserve the soaking water.  Adjust oven rack to 6 inches below broiler element and preheat broiler to high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, gently mix together half of the chopped porcini mushrooms, turkey, egg, milk, breadcrumbs, 1/4 cup Pecorino Romano, 1 tablespoon rosemary, 2 tablespoons parsley, garlic, and olive oil until just combined.  Roll the mixture into 12 equal-sized balls, and place on a parchment-lined rimmed baking sheet.  Broil for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the remaining mushrooms and their liquid, rosemary stem, remaining parsley, and marinara sauce in a medium skillet over low heat.  Place the broiled meatballs directly in the sauce, and simmer over medium-low heat until the meatballs are cooked through and the sauce has visibly reduced to the consistency of a thick ragú, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring 5 cups of water to a boil over high heat. Whisk in polenta in a thin steady stream and cook, stirring constantly until creamy and hydrated. Whisk in 1 cup of Pecorino Romano and season to taste with salt. Serve polenta with meatballs and sauce.</p>"}]}