{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120705TandooriSalmon.png", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Indian", "keywords": ["asparagus", "broccoli", "Dinner for Two", "garam masala", "Indian", "light eating", "salmon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Tandoori-style Charred Salmon and Vegetables", "link": "https://www.seriouseats.com/recipes/2012/07/tandoori-grilled-salmon-and-asparagus-recipe.html", "description": "Salmon and vegetables, coated in a spiced and spicy yogurt marinade, flash-charred and served on a bed of rice.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Asparagus", "Broccoli", "Dinner for Two", "Indian", "Mains", "Salmon"], "recipeIngredient": ["3/4 cup plain yogurt", "1 tablespoon freshly grated ginger", "2 medium cloves garlic, grated (about 2 teaspoons)", "1/2 small hot chili, sliced (optional)", "2 teaspoons Garam Masala", "1 tablespoon vegetable oil, plus more for the grill if grilling", "Kosher salt", "2 skinless salmon fillets, about 6 ounces each", "1 bunch asparagus, trimmed, or one head of broccoli, cut into spears and blanched for 2 minutes in salted boiling water", "Cilantro or parsley, torn (optional)", "Lemon wedges (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, stir together the yogurt, ginger, garlic, chili, Garam Masala, 1 tablespoon vegetable oil, and salt to taste. Pat the salmon dry with a paper towel, and coat it with the yogurt mixture. Toss the asparagus or blanched broccoli in the same bowl to coat with the yogurt as well.  Cover with plastic wrap and marinate in the fridge for 15 minutes. Meanwhile, preheat a grill pan or grill over high heat, or preheat your broiler. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If grilling, lightly grease the grill with some vegetable oil. Wipe off excess marinade, then add salmon and vegetables and lemon quarters to grill. Grill salmon until well charred on both sides and medium in the center, 3 to 4 minutes on each side, removing asparagus or broccoli and lemon as it becomes tender (about 5 minutes total for the vegetables). Sprinkle with torn cilantro and serve with lemon wedges on a bed of rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using the broiler, line a baking sheet with parchment.  Arrange the salmon (no need to wipe off the extra marinade) and vegetables and lemon quarters in a single layer on the baking sheet, spread out as much as possible.  Place under the broiler for 10 to 12 minutes for medium to well-done salmon.  Arrange on a bed of rice and top with torn cilantro.</p>"}]}