{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20120929-224390-lemon-rosemary-roasted-chicken-carrots-potatoes-edit.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["carrot", "chicken", "chicken dinners", "mains", "pan-roasted chicken", "potatoes", "poultry", "roast chicken"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon-Rosemary Roasted Chicken with Crispy Potatoes", "link": "https://www.seriouseats.com/recipes/2012/10/lemon-rosemary-roasted-chicken-with-crispy-potatoes-recipe.html", "description": "Lemon and rosemary chicken creates a flavorful pan juice to spoon over roasted carrots and crunchy roasted russet potatoes.", "totalTime": null, "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chicken Dinners", "Mains", "Potato"], "recipeIngredient": ["<strong>For the chicken:</strong>", "10 cloves garlic (6 left whole, 4 grated or minced)", "2 tablespoons minced fresh rosemary leaves, plus 1 whole sprig", "1 tablespoon grated lemon zest from 1 lemon", "2 teaspoons kosher salt", "1/4 teaspoon red pepper flakes", "2 tablespoons olive oil, divided", "3 pounds bone-in, skin-on chicken parts (drums, thighs, and breasts, or a combination)", "4 tablesopons unsalted butter", "1 pound carrots, peeled, cut on the bias into 1/2-inch pieces", "1 teaspoon salt", "2 pounds russet potatoes, peeled, cut into 2-inch chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper-middle and lower-middle position and preheat oven to 400&degF. Heat 12-inch cast iron skillet in oven for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, stir grated garlic, rosemary, zest, salt, pepper flakes, and 1 tablespoon oil. Add chicken pieces and toss to coat. Cover and let sit for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place butter in cast iron skillet and return to oven until melted, about 2 minutes. Add potatoes, garlic, rosemary, and salt, and stir to coat. Spread potatoes out into single layer and place on lower-middle rack. Roast for 30 minutes. Remove potatoes, toss with a spoon to turn and coat with butter, then return to upper-middle rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When potatoes have been transferred to upper-middle rack, prepare the chicken. Heat remaining tablespoon oil in 12-inch skillet over medium heat. Add chicken pieces, skin side down, and cook until well browned, 5 to 8 minutes. Reserve any lemon-rosemary mixture left in the chicken marinating bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, turn chicken pieces over. Add carrots and remaining lemon-rosemary mixture to pan, and transfer to lower-middle rack in oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue roasting until potatoes are fully cooked and golden and carrots are tender, about 25 minutes longer. As cooking time approaches end, check chicken pieces for doneness with an instant-read thermometer, removing chicken pieces as they finish cooking (155°F for breast meat, 170°F for legs and drumsticks), and keeping them warm on a plate covered in heavy duty foil. Serve potatoes and carrots with cooked chicken pieces.</p>"}]}