{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/04252012-202444-british-bites-eccles-cakes-primary.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "Eccles cakes", "pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eccles Cakes (Stuffed Pastry with Brandy-Soaked Raisins)", "link": "https://www.seriouseats.com/recipes/2012/04/eccles-cakes-stuffed-pastry-raisins-british-recipe.html", "description": "Sometimes called a Fly Pie or Fly Cake, this pastry is not a common one in North America, but with a few ingredients and about half an hour you can have a classic British pastry to be proud of.  Traditionally, Eccles Cakes are made with currants, which can be difficult to find as well as costly.  This recipe substitutes golden raisins, which are a bit sweeter than currants but plump and take on the flavor of the brandy and spices very nicely.", "totalTime": "30 minutes", "recipeYield": "makes 10 cakes", "recipeCategory": ["Cakes", "Desserts", "Pastry"], "recipeIngredient": ["1 cup golden raisins", "1/2 cup brandy", "1/4 cup juice from 1 orange", "1 cinnamon stick", "1/8 teaspoon freshly grated nutmeg", "1/4 cup sugar", "1 pound puff pastry (thawed if frozen)", "1 egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375°F. Combine raisins, brandy, orange juice, cinnamon, nutmeg and sugar in a small saucepan and bring to a simmer over medium low heat.  Cook until raisins are plump and liquid is absorbed, about 7 minutes.  Allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unroll puff pastry. Using round biscuit cutters, cut ten 2-inch circles and ten 2 1/2-inch circles. Place a small mound of filling in center of each of the smaller rounds of puff pastry and brush edges with egg. Top each piece of pastry with a larger round of pastry and press the edges to seal.  Brush each filled cake with beaten egg. Place pastries on a baking sheet lined with parchment paper. Use a small paring knife or kitchen shears to cut three air slits into top of each cake. Bake in preheated oven until pastry is golden brown and puffed, about 20 minutes.  Serve warm.</p>"}]}