{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120301-195206-chess-pie-610x458-100.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["chess pie", "pie", "pie of the week", "Southern desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chess Pie", "link": "https://www.seriouseats.com/recipes/2012/03/chess-pie-recipe.html", "description": "This is a great, basic recipe for Chess Pie, the gooey, sweet Southern classic. The filling is a rich custard that's sweeter than most, balanced just slightly with the addition of white vinegar. A small amount of flour and cornmeal create a very thin, crispy caramelized crust over the top.", "totalTime": "4 hours", "recipeYield": "makes 1 pie, serving 8", "recipeCategory": ["Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "4 eggs, room temperature", "2 1/2 ounces (about 5 tablespoons) whole milk", "1 tablespoon vanilla extract", "14 ounces (about 2 cups) granulated sugar", "4 ounces (1 stick) melted butter, cooled", "1/2 teaspoon salt", "2 tablespoons finely ground cornmeal", "1 tablespoon all purpose flour", "1 tablespoon white vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lowest position and preheat oven to 425&deg;F. Line the chilled pie shell with foil or parchment and fill it with pie weights (I like to use dried beans for this purpose). Bake on the bottom rack of the oven for 5 minutes, then lower the temperature to 325°F and bake for an additional 3 minutes. Remove the weights and liner and bake the pie shell until it is light golden brown, 3 to 4 minutes longer. Remove the crust from the oven and allow it to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk the eggs, milk, and vanilla together for 30 seconds, until they are well combined. Stream the sugar into the bowl, whisking as you go. Add the butter, salt, cornmeal, flour, and vinegar, and whisk until the filling is smooth and there are no visible lumps. Pour the filling into the cooled shell and place on the lower rack of the oven. Bake for 45 minutes, or until the filling has set up but still quivers a bit and is slightly puffed at the edges. Allow the pie to cool completely. Either serve warm or cover and refrigerate for a chilled filling.</p>"}]}