{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120619-fu-run-lamb-ribs.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "goat", "goat ribs", "lamb ribs", "rib", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Goat or Lamb Ribs, Dong-Bei Style", "link": "https://www.seriouseats.com/recipes/2012/06/lamb-or-goat-ribs-dong-bei-style-recipe.html", "description": "The concentration of cumin seeds on just one rack of lamb is startling.  Then you bite into a rib, stewed until it is fork-tender, and the cumin seeds crunch and crackle in your mouth. One of the best bites in recent memory.", "totalTime": "3 hours", "recipeYield": "1 rack of ribs, serving 4 as part of a multi-course meal", "recipeCategory": ["Chinese", "Lamb", "Mains", "The Nasty Bits"], "recipeIngredient": ["1 rack of goat or lamb ribs", "1/2 cup Shaoxing wine", "1 onion, roughly chopped (about 1 1/2 cups)", "2 teaspoons kosher salt", "1/4 cup whole cumin seeds", "1/2 piece star anise", "1 clove", "12 to 16 small dried red chili peppers (optional)", "3 tablespoons vegetable oil or butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place ribs in a saute pan or a roasting pan.  If cooking on stove, add wine and enough water to barely cover. Add onions and salt. Cover pan with lid or aluminum foil, bring to a simmer and cook until tender, about 2 hours.  If using oven, adjust oven rack to center position and preheat oven to 325°F.  Place rack of ribs in a roasting pan and add wine and scatter onions all around.  Add water to cover 3/4 of the way.  Cover pan, with lid or aluminum foil, bring to a simmer on the stovetop, then transfer to oven and cook until tender, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhil, preheat a skillet over medium heat until hot.  Place the cumin seeds, star anise, and clove in the pan and toast until fragrant, about 20 seconds.  Remove from heat and let cool.  Grind in a mortar and pestle or spice grinder until cumin seeds are broken up but not powdered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using chili peppers: return the skillet to medium heat. Toast the dried chili peppers just until fragrant, about 30 seconds. Remove from heat and let cool.  Grind in a mortar and pestle or process in a spice grinder until roughly ground.  Mix with the cumin seed mixture.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ribs are tender, remove from heat, transfer to a paper towel to remove excess water, and let cool slightly. Dry carefully. Heat oil or butter in a large non-stick skillet over medium heat until shimmering. Add the ribs and brown on one side until golden brown and crispy, about 5 minutes.  Flip and brown on the other side. When ribs are done browning, remove to a platter and pat off residual oil with a paper towel. Immediately sprinkle spice mixture over the hot ribs, patting the mixture down so it sticks to the surface of the meat.  Serve immediately. </p>"}]}