{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120109-186976-vegan-bibimbap-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bean sprouts", "daikon radishes", "Elaine Louie", "rice", "spinach", "The Occasional Vegetarian", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Occasional Vegetarian's Bibimbap", "link": "https://www.seriouseats.com/recipes/2012/01/the-occasional-vegetarians-bibimbap-recipe.html", "description": "While most versions of <strong>bibimbap</strong> include beef and/or an egg, this Korean rice dish is really all about the vegetables, namely quick sautéed <em>namul</em> seasoned with plenty of sesame oil.  This vegan variation adapted from <em><strong><a href=\"http://www.amazon.com/Occasional-Vegetarian-Delicious-Dishes-Vegetables/dp/1401310362/?tag=serieats-20\">The Occasional Vegetarian</a></strong></em> uses a cast iron pan to replicate dolsot bibimbap, typically served in a hot stone pot.", "totalTime": "1 hour", "recipeYield": "4 servings", "recipeCategory": ["Cook the Book", "Rice", "Spinach", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 cup short-grain rice, rinsed well and drained", "1 medium zucchini, julienned, in 2-inch lengths", "Salt", "3 1/2 teaspoons dark sesame oil", "1/2 teaspoon minced garlic", "1/2 teaspoon sugar, plus a pinch", "1 teaspoon toasted sesame seeds, plus a pinch", "1 cup thinly sliced shiitake mushroom caps", "1/2 teaspoon soy sauce", "1 cup bean sprouts", "1 cup packed spinach leaves", "1 cup peeled and julienned daikon radish, in 2-inch lengths", "1 teaspoon dried hot chile flakes", "1 teaspoon vegetable oil", "1/4 cup peeled and julienned carrot, in 2-inch lengths", "1 tablespoon Korean red chile sauce (gochujang) or other hot chile sauce, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the rice in a medium saucepan and add 2 cups water. Place over high heat to bring to a boil, then reduce the heat to low. Cover and cook until the water is absorbed, about 25 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the rice cooks, place another medium pot of water over high heat to bring to a boil. Place the zucchini in a colander and sprinkle with 1 teaspoon salt; set aside to drain for 10 minutes. Rinse and pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a medium skillet over medium heat, and add 1 teaspoon sesame oil and 1/4 teaspoon garlic. Add the zucchini, a pinch of sugar, and 1/2 teaspoon sesame seeds. Sauté 2 minutes, then transfer to a plate; set aside. Wipe out the pan and return to medium heat. Add 1 teaspoon sesame oil and the remaining 1/4 teaspoon garlic. Add the shiitakes, a pinch of salt, and the soy sauce. Sauté 2 minutes, then transfer to a plate; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bean sprouts in the boiling water until wilted, about 20 seconds. Using a slotted spoon, transfer to the colander to drain. Place the sprouts in a bowl, and add 1/2 teaspoon sesame oil, a pinch of salt, and a pinch of sesame seeds; set aside. Add the spinach to the pot of boiling water, and blanch until it wilts and turns bright green, about 30 seconds. Drain into the colander, rinse well with cold water until chilled, then drain, squeezing out the excess water. Transfer to a bowl and add 1/4 teaspoon salt, 1/2 teaspoon sesame oil, and 1/2 teaspoon sesame seeds. Mix well and set aside. Place the daikon in a bowl, and add the hot chile flakes, 1/2 teaspoon sugar, 1/2 teaspoon sesame oil, and a pinch of salt. Mix well and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a 9-inch well-seasoned cast-iron or nonstick skillet over medium heat. Add 1 teaspoon vegetable oil and heat until shimmering. Add 1 cup cooked rice and flatten it to form a pancake covering the bottom of the pan, about 1/3 inch thick. Cook until it is crisp and golden on the underside, about 5 minutes. Use a large spatula to flip it over, and cook again until crisp, another 5 minutes. Break the crusty rice into several pieces. Add the remaining rice. Arrange the vegetables on top in wedge-shaped piles (like pizza slices), topping with the julienned carrot. Cook, uncovered, until well heated through, 10 to 15 minutes. Bring the skillet to the table, add the chile sauce, and toss the mixture gently to combine the ingredients. Serve hot.</p>"}]}