{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120918-222486-GFTues-Recipes.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["bread", "gluten free", "pretzels"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gluten-Free Soft Pretzels", "link": "https://www.seriouseats.com/recipes/2012/09/gluten-free-soft-pretzels.html", "description": "This recipes makes traditional soft pretzels. The tapioca starch and xanthan gum provide a pleasant chewiness to the pretzels. Substituting a different starch or omitting the xanthan gum will affect the texture of the pretzels.", "totalTime": "about three hours", "recipeYield": "makes about 12 pretzels", "recipeCategory": ["Bread", "Breakfast and Brunch", "Gluten-Free", "Gluten-Free Tuesday", "Sides"], "recipeIngredient": ["2 cups (8 ounces) white rice flour", "1 cup (5 ounces) brown rice flour", "3/4 cup  (3 ounces) tapioca starch", "1 teaspoon salt", "1 teaspoon xanthan gum", "1/2 teaspoon baking powder", "1 cup warm water plus 2 tablespoons", "1 packet (2 1/4 teaspoons) active dry yeast", "1 large egg", "3 tablespoons light corn syrup", "2 tablespoons vegetable oil", "&nbsp;", "<b>For the Water Bath</b>", "4 quarts water", "1/4 cup baking soda", "2 tablespoons granulated sugar", "&nbsp;", "<b>For the Toppping</b>", "Kosher Salt or pretzel salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of stand mixer, combine white rice flour, brown rice flour, tapioca starch, salt, xanthan gum, and baking powder. Whisk to combine. In small bowl, combine 1 cup warm water and active dry yeast. Stir. Allow to stand for three minutes. Add water-yeast mixture, egg, light corn syrup, and vegetable oil to dry ingredients. Fit stand mixer with paddle attachment. Mix on medium speed until dough forms, about 4 minutes. The dough should be firm but not dry. If any dry ingredients remain at the bottom of the bowl or if the dough seems dry, add the additional 2 tablespoons water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto lightly white rice-floured counter. Knead dough into a ball until smooth. Take care not to use too much pressure while kneading. Transfer dough to lightly greased bowl. Cover with plastic wrap and allow to rise until almost doubled in size, about 1 to 1 1/2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle positions and preheat oven to 425°F. Bring 4 quarts of water to a rolling boiling. Turn dough out onto a very lightly white rice floured countertop. Punch down dough gently to deflate. Cut into 12 pieces. Cover dough with plastic wrap. One at a time, knead each piece of dough until smooth. Then, roll out the dough pieces into 12 to14-inch logs. (You want little to no white rice flour on the area of the counter where you are rolling the dough. If there is too much flour on the outside of the dough, the pretzel dough won't stick to itself when you go to shape it.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two rimmed baking sheets with parchment paper. Working one log at a time, form the dough into a into \"u\". Twist each end together and then press the rope into the bottom of the \"u\". You want to press the dough firmly to ensure the ends stick to the \"u\" or the pretzel can unravel during boiling. Place shaped pretzels on prepared baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the baking soda and granulated sugar to the boiling water.  One at a time, boil the pretzels. If the pretzel floats, boil for about five seconds. If the pretzel sinks, wait for it to float to the top of the water and then remove. Return boiled pretzels to the  prepared baking sheets. Sprinkle generously with kosher or pretzel salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until golden brown, about 25 minutes, rotating baking sheets halfway during baking. Remove and allow pretzels to cool. Pretzels are best served the day they're made. If desired, freeze once cooled and reheat in a warm oven.</p>"}]}