{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2011/12/20111218-easy-bean-soup-pasta-fagioli-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bean soups", "beans", "quick", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "30-Minute Pasta and Kidney Bean Soup (Pasta e Fagioli)", "link": "https://www.seriouseats.com/recipes/2012/01/30-minute-pasta-and-kidney-bean-soup-pasta-e-fagioli-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: J. Kenji Lopez-Alt is the Managing Editor of Serious Eats where he likes to explore the science of home cooking in his weekly column The Food Lab. You can follow him at @thefoodlab...", "totalTime": "30 minutes", "recipeYield": "Makes 2 quarts, serving 4", "recipeCategory": ["Soups and Stews"], "recipeIngredient": ["1 (28-ounce) can whole tomatoes packed in juice", "2 tablespoons extra-virgin olive oil, plus more for serving", "1 tablespoon butter", "3 ounces pancetta or bacon, finely chopped (optional)", "1 medium onion, finely diced (about 1 cup)", "6 cloves garlic, minced on a microplane grater", "1/2 teaspoon dried oregano", "1/2 teaspoon dried red pepper flakes", "1 quart homemade or low-sodium canned chicken broth", "2 (15 ounce) cans dark red kidney beans", "2 bay leaves", "1 cup small pasta such as shells, ditali, or elbows", "Kosher salt and freshly ground black pepper", "2 tablespoons chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the tomatoes into a medium bowl and using hands, squeeze each tomato through your fingers to break it up into small pieces (be careful, they can squirt). Set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil and butter in a large saucepan over medium-high heat until butter is melted. If using pancetta, add to pan and cook, stirring constantly until fragrant, about 2 minutes. Reduce heat to medium and add onion, garlic, oregano, and red pepper flakes. Cook, stirring constantly until fragrant and softened but not browned, about 3 minutes. Add tomatoes and their juice, chicken broth, kidney beans, and bay leaves. Bring to a boil over high heat then reduce to a bare simmer. Cook for 20 minutes, adding pasta to soup for the last 5 to 10 minutes (depending on the package directions). Season to taste with salt and pepper. Discard bay leaves, stir in parsley and serve, drizzling each serving with extra-virgin olive oil at the table.</p>"}]}