{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120416ScallopChorizoBake.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["chorizo", "Dinner for Two", "quick", "scallops"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Dinner for Two: Crispy Broiled Scallops and Chorizo", "link": "https://www.seriouseats.com/recipes/2012/05/dinner-for-two-crispy-broiled-scallops-and-chorizo.html", "description": "Sweet scallops and burnished red smoky, meaty chorizo baked together without fuss in this perfect, stylish, easy dinner for two.", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner for Two", "Mains", "Other Seafood", "Pork"], "recipeIngredient": ["14 ounces bay scallops", "2 ounces Spanish chorizo, diced to the same size as the scallops", "2 teaspoons, plus 1 teaspoon olive oil, plus extra for drizzling", "3 tablespoons panko-style bread crumbs", "1 tablespoon chopped flat leaf parsley (optional)", "A handful of microgreens, baby arugula, or cress", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler to high and adjust rack to 6-inches from element.  Pat the scallops dry with a paper towel.  Toss scallops and chorizo with 2 teaspoons olive oil in a medium bowl and season lightly with salt. Divide mixture evenly between two broiler-safe gratin dishes or one broiler-safe 8- by 8-inch square baking dish. Toss the remaining teaspoon of olive oil with the panko and parsley (if using) in a separate bowl, then top scallop mixture with crumbs. Cover each gratin dish tightly with foil. Place the dishes on a baking sheet and broil for 10 minutes.  Remove foil, and broil an addition 3 to 4 minutes until the chorizo has blistered and the crumbs are lightly toasted.  Top each dish with a handful of greens lightly tossed with olive oil and salt.  Serve immediately.</p>"}]}