{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120312-mushroom-toast-tapas-boiled-eggs-.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["egg", "mushrooms", "quick", "spanish", "tapas", "toast", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mushroom and Crushed Egg Tapas (Tapas de Setas con Huevo)", "link": "https://www.seriouseats.com/recipes/2012/03/mushroom-and-crushed-egg-tapas-tapas-de-setas-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science of home cooking in his weekly column The Food Lab. You can follow him at...", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Eggs", "Mushrooms", "Sides", "Spanish", "Vegetarian"], "recipeIngredient": ["2 large eggs", "4 tablespoons extra-virgin olive oil, plus more for serving", "2 large slices of rustic bread, such as ciabatta", "1/2 pound mixed cleaned wild mushrooms (such as hen of the woods, black trumpet, or oyster)", "1 medium clove garlic, minced on a microplane grater (about 1 teaspoon)", "1 small shallot, finely chopped (about 1 tablespoon)", "1 teaspoon picked thyme leaves", "1 teaspoon juice from 1 lemon", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place eggs in a medium saucepan and cover with cold water. Bring to a boil over high heat, cover with a lid, and set aside for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle bread slices with half of olive oil. Broil or toast until lightly charred. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat remaining two tablespoons olive oil in a large heavy-bottomed skillet over high heat until smoking. Add mushrooms and cook, stirring and tossing occasionally, until well browned on all sides, about 5 minutes. Add garlic, shallot, and thyme and cook, stirring constantly, until fragrant, about 15 seconds. Add lemon juice and toss to coat. Off-heat, season mushrooms with salt and pepper. Transfer to a small plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel eggs and crush with your hands. Top each slice of toast with mushrooms and crushed eggs. Drizzle with extra olive oil as desired and serve.</p>"}]}