{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120610-210040-rhubarb-jasmine-pops.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "David Carrell", "jasmine", "Joel Horowitz", "Nathalie Jordi", "People's Pops", "popsicles", "rhubarb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rhubarb &amp; Jasmine Pops", "link": "https://www.seriouseats.com/recipes/2012/06/peoples-pops-rhubarb-jasmine-popsicles-recipe.html", "description": "Matching up tart rhubarb with delicate, floral jasmine tea makes for a transcendent popsicle experience.", "totalTime": "10 minutes plus 4 to 5 hours freezing time", "recipeYield": "makes 10 pops", "recipeCategory": ["Bake the Book", "Dairy-Free", "Desserts", "Ice Cream and Frozen Treats", "Rhubarb", "Vegan", "Vegetarian"], "recipeIngredient": ["1 1/2 cups (12 fl oz) simple syrup (recipe follows)", "3 to 15 pearls jasmine tea", "1 pound rhubarb (about 5 long stalks), trimmed and chopped \u2028into 1-inch pieces", "&nbsp;", "<strong>Simple Syrup</strong>", "1 1/2 cups organic cane sugar ", "1 1/2 cups water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Simple Syrup:</strong> Combine the sugar and water in a small saucepan and bring to a simmer over medium-high heat, stirring until the sugar dissolves and the mixture is transparent. Turn off the heat and let cool. Add any spices before the mixture starts to simmer; add any herbs only after you’ve turned off the heat. Store plain and infused syrups in sealed containers in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the simple syrup in a covered saucepan over medium-high heat. Somewhere between a simmer and a full boil, turn off the heat and add the jasmine tea pearls, which should promptly unfurl as you stir briefly. Be careful not to simmer the mixture for too long, because the simple syrup evaporates quickly, reducing the amount of liquid remaining. You want 1 cup plus 2 tablespoons (9 fl oz) to work with. If, after 1 minute, the smell of jasmine is not pronounced, add more jasmine. It’s a really subtle flavor and has a habit of hiding under the rhubarb, so make sure it’s really present in the simple syrup to begin with. Steep for 10 minutes and then strain out the jasmine, pressing down on the flowers to extract as much liquid as possible. Let cool. Can you still smell it? If not, add more and reboil. Jasmine is subtle!<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour about 1/2 inch of water into a shallow, heavy, nonreactive saucepan and add the chopped rhubarb. Cook over medium heat, stirring frequently to make sure the rhubarb doesn’t stick to the bottom of the pan and burn, until the pieces have mostly dissolved into a thick and gloppy purée, 10 to 15 minutes. Pick out and discard any bits that are still stringy (there shouldn’t be many; if there are, keep cooking until the rhubarb breaks down some more). Stir the mixture to smooth it out (but it doesn’t have to be entirely homogenous). You should have about 2 cups plus 2 tablespoons (17 fl oz) of purée.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the rhubarb purée into a bowl or measuring pitcher with a pouring spout, add the jasmine simple syrup, and stir well to combine. Taste; the mixture should be quite sweet and the jasmine flavor subtle but noticeable. Adjust to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into your ice pop molds, leaving a little bit of room at the top for the mixture to expand. Insert sticks and freeze until solid, 4 to 5 hours. Unmold and transfer to plastic bags for storage or serve at once.<br />\n <br />\n</p>"}]}