{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/081312-218948-Sunday-Supper-Cilantro-Pesto-Pork-Tenderloin-primary.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cilantro", "pesto", "pork", "pork tenderloin", "succotash", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Cilantro Pesto-Stuffed Pork Tenderloin With Summer Succotash", "link": "https://www.seriouseats.com/recipes/2012/08/cilantro-pesto-stuffed-pork-tenderloin-with-succotash-recipe.html", "description": "Pounded pork tenderloin gets slathered with cilantro pesto and a shower of pepper jack before it's rolled, roasted and served with spicy succotash.", "totalTime": "1 hour, 35 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mains", "Pesto", "Pork", "Sunday Supper"], "recipeIngredient": ["<strong>For the Pesto:</strong>", "1 cup cilantro leaves, plus 1 1/2 tablespoons chopped cilantro, divided", "1/4 cup lightly packed parsley leaves", "4 medium cloves garlic, chopped, divided", "2 tablespoons pine nuts, lightly toasted", "2 tablespoons juice from 1 lemon", "1/4 cup grated Parmesan cheese", "Kosher salt and freshly ground black pepper", "1/2 cup, plus 2 tablespoons olive oil, divided", "1 tablespoon water", " ", "<strong>For the Pork:</strong>", "2 pounds pork tenderloin, trimmed of fat", "1/2 cup shredded pepper jack cheese", " ", "<strong>For the Succotash:</strong>", "1 small red onion, finely chopped (about 1 cup)", "Fresh kernels from four ears of corn (about 2 cups)", "16 ounces shelled, fresh or frozen edamame", "2 medium tomatoes, coarsely chopped", "1 1/2 tablespoons chopped, fresh basil", "1 tablespoon fresh juice from 1 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1 cup cilantro, parsley and two cloves garlic in a food processor fitted with a metal blade. Pulse until it forms a coarse paste. With the processor running, add the pine nuts, lemon juice, Parmesan, 1/2 teaspoon salt and and 1/2 teaspoon pepper. Slowly drizzle in olive oil and water. Process until smooth, stopping to scrape pesto from the sides, if necessary. Season to taste with more salt and pepper. Reserve half of pesto and refrigerate the rest for later use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 375&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork tenderloin from the refrigerator one hour before you’re ready to cook. Cut meat almost in half, lengthwise. Open meat like a book and place between two sheets of wax paper. Using a meat mallet or rolling pin, pound to 1/2-inch thickness. Spread with the reserved pesto. Top with cheese. Roll up meat and secure at 1/2-inch intervals with kitchen twine. Season with salt and pepper. Place in roasting pan seam-side up and drizzle with 1/2 tablespoon olive oil. Roast the pork in the oven until it reaches an internal temperature of 145&deg;F, about 35 minutes. Remove pork from oven, tent with foil and allow to rest for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pork is roasting, heat remaining 1 1/2 tablespoons olive oil in a large skillet over medium-high heat until shimmering. Add onion and sauté until slightly softened, about 4 minutes. Add corn, edamame and remaining two cloves of garlic. Sauté for three minutes before adding tomatoes. Cook, stirring often, until tomatoes start to break down, about two minutes more. Remove from heat. Season to taste with salt and pepper. Add basil, remaining 1 1/2 tablespoons cilantro and lime juice. Stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut and discard string from pork. Slice meat into medallions and serve with remaining pesto and succotash.</p>"}]}