{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120328-199307-cauliflower-pie.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["bechamel", "cauliflower", "Cook the Book", "Jim Lahey", "mushrooms", "My Pizza", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Jim Lahey's Cauliflower Pie", "link": "https://www.seriouseats.com/recipes/2012/03/jim-laheys-cauliflower-pizza-pie.html", "description": "<a href=\"http://www.sullivanstreetbakery.com/history\">Jim Lahey</a> has a thing for charred flavors.  His pizzas bake up with crisp <a href=\"http://slice.seriouseats.com/archives/2011/01/glossary-crust-terminology.html\">leopard spotted</a> crusts giving them a hint of smoke and a lot of crunch.  He's employed the same high-heat technique for his <strong>Cauliflower Pie</strong> from <strong><a href=\"http://www.amazon.com/My-Pizza-Easy-No-Knead-Spectacular/dp/0307886158/?tag=serieats-20\">My Pizza</a>, a Béchamel sauced pizza topped with roasted florets, mozzarella, green olives, chile flakes, and garlic.", "totalTime": "45 minutes", "recipeYield": "Makes one 10- to12-inch pizza", "recipeCategory": ["Cauliflower", "Cook the Book", "Mushrooms", "Pizza"], "recipeIngredient": ["150 grams (1 ½ cups) cauliflower florets", "1 ball of <a href=\"http://www.seriouseats.com/recipes/2012/03/jim-laheys-no-knead-pizza-dough-recipe.html\">No-Knead Pizza Dough</a>, shaped and waiting on a floured peel", "60 grams ( ¼ cup) Béchamel (recipe follows)", "10 grams (3 tablespoons) finely grated Parmigiano-Reggiano or Grana Padano cheese ", "50 grams (about 1 ¾ ounces) mozzarella, pulled into 5 clumps ", "15 grams (1 ½ tablespoons) coarsely chopped green olives", "½ garlic clove, finely chopped", "Generous pinch of chili flakes", "10 grams (1 ½ tablespoons) fresh bread crumbs ", "Chopped fresh parsley for sprinkling", " ", "<strong>Béchamel Sauce</strong>", "486 grams (2 cups) whole milk", "113 grams (1 stick) unsalted butter", "18 grams (about 2 ¼ tablespoons) all-purpose flour", "2 grams (1/4 teaspoon) fine sea salt", "3 rasp grates of nutmeg or a pinch of ground nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Béchamel Sauce:</strong> Pour about one-third of the milk into a saucepan. Cut the butter into a few chunks (so they’ll melt more easily) and add to the milk. Heat over medium-low heat, stirring, until the butter melts but without allowing the milk to reach a boil.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the flour in a medium mixing bowl, add the remaining milk, and whisk into a slurry. Once the butter has been completely incorporated into the hot milk, ladle some of the warm mixture into the cold flour mixture to warm it. Pour the contents of the bowl back into the saucepan and whisk it in. Stir in the salt.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over medium-low heat, whisk the mixture frequently— to prevent sticking—as it cooks and thickens. The béchamel is done at about 180°F, when it has reached the consistency of a runny sauce or heavy cream. Grate in the nutmeg and allow the sauce to cool to room temperature. It will continue to thicken slightly as it cools. Use the béchamel immediately or cool,cover, and refrigerate for up to 5 days; bring it back to room temperature before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Pizza:</strong> Place a pizza stone in a gas oven about 8 inches from the broiler. Preheat the oven to 500°F for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble the cauliflower with your fingers and spread it<br />\r\nevenly in an 8-inch pie pan or baking dish. Set the pan on the pizza stone and roast the cauliflower for 12 minutes, until it is flecked with char and slightly translucent, then remove it and set aside. Switch to broil and continue to heat the stone for another 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the dough on the peel, spoon the béchamel over the surface and spread it evenly, leaving about an inch of the rim untouched. Sprinkle the surface with the Parmigiano. Distribute the mozzarella, the cauliflower pieces, and then the olives, garlic, and chili flakes evenly over the pizza. Sprinkle the bread crumbs over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With quick, jerking motions, slide the pie onto the stone. Broil for 3 to 3½ minutes under gas (somewhat longer with an electric oven), until the top is bubbling and the crust is nicely charred but not burnt.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the peel, transfer the pizza to a tray or serving platter. Sprinkle parsley over the top. Slice and serve.</p>"}]}