{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20121512-218826-bar-bites-grilled-onions-and-tomatoes.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["animal style", "bar bites", "bruschetta", "In-N-Out"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Animal-Style Grilled Cheese Bruschetta", "link": "https://www.seriouseats.com/recipes/2012/08/bar-bites-animal-style-grilled-cheese-bruschetta-recipe.html", "description": "A beast of a bruschetta inspired by In-N-Out's Animal-Style Grilled Cheese. Perfect for your next dinner party or backyard barbecue and especially good with a cold beer, a glass of chilled white wine, or even a rosé if that's how you roll.", "totalTime": "30 minutes", "recipeYield": "serves 4-6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Cheese", "Christmas"], "recipeIngredient": ["<strong>For the Spread:</strong>", "2 tablespoons plus 2 teaspoons mayonnaise", "1 tablespoon ketchup", "2 teaspoons sweet pickle relish", "1/2 teaspoon sugar", "1/2 teaspoon distilled white vinegar", " ", "<strong>For the Bruschetta</strong>:", "2 large plum tomatoes, cut into 1/4-inch thick slices (12 slices total)", "1 small onion, cut into 1/4-inch thick slices with rings unseparated", "2 tablespoons, plus 1 tablespoon, extra virgin olive oil", "Salt and freshly ground black pepper", "12 slices baguette bread (each slice 1/2-inch thick)", "24 dill pickle chips", "12 slices American cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spread:</strong> combine mayonnaise, ketchup, relish, sugar, and vinegar in a bowl and stir until homogenous. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the sliced tomatoes and onions with the 2 tablespoons of olive oil, then lightly season with salt and freshly ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a metal spatula, place the sliced tomatoes and onions on the hottest part of your grill, taking care to keep the onion rings together and not separated. Grill the tomatoes just until they are nicely charred with grill marks on both sides, 1 to 2 minutes per side. Grill onions until they soften and caramelize with grill marks on both sides, 2 to 3 minutes per side. Transfer grilled tomatoes and onions to a large platter and set aside. It's ok if the onions separate after grilling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush one side of each baguette slice with the remaining 1 tablespoon of olive oil, then smear the other side of each baguette slice with the prepared spread. Place the baguette slices, spread side-up, on a large platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place two dill pickle chips on the spread-side of each baguette slice. Fold each slice of American cheese in half over itself, then place each cheese slice on top of the dill pickle chips on each of the baguette slices. Place a single tomato slice on each baguette slice, then evenly distribute the onions over each baguette slice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the topped baguette slices on the cooler side of the grill and cook until the bottom of the bread is toasted and the cheese is completely melted, 3 to 5 minutes. If some of the bruschetta are cooking faster than others, rearrange them on the grill as necessary. Remove the bruschetta from the grill and serve immediately.</p>"}]}