{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120724-127677-LTE-Strawberry-Birthday-Cake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["birthday cakes", "buttercream", "Let them eat cake", "yellow cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Strawberry Buttercream Birthday Cake", "link": "https://www.seriouseats.com/recipes/2012/07/strawberry-buttercream-birthday-cake-recipe.html", "description": "Yes, I bake my own birthday cakes. This year it's layers of tender yellow cake glued together with sweetened condensed milk, and a generous coat of billowy, strawberry-flecked buttercream.", "totalTime": "3 hours 15 minutes", "recipeYield": "serves 8 to 10", "recipeCategory": ["Cakes", "Let Them Eat..."], "recipeIngredient": ["<strong>For the Cake</strong>:", "Baking spray", "1 3/4 cups (about 12 1/4 ounces) granulated sugar", "2 1/4 cups (about 11 1/4 ounces) cake flour", "2 teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup milk, at room temperature", "1 tablespoon pure vanilla extract", "4 large eggs, separated and at room temperature", "2 sticks (8 ounces) unsalted butter, at room temperature", "&nbsp;  ", " <strong>For the Frosting</strong>:", "1 1/4 cups (about 8 3/4 ounces) sugar", "1/2 cup water", "2 tablespoons light corn syrup", "4 large egg whites, at room temperature (See Notes)", "1/4 teaspoon salt", "3 sticks (12 ounces) unsalted butter, cut into 24 pieces, at room temperature", "2 teaspoons pure vanilla extract", "2 cups (about 2.4 ounces) dehydrated strawberries", "1 cup (from one 14-ounce can) sweetened condensed milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Lightly coat two 9-inch round cake pans with baking spray. Line bottoms with parchment paper rounds and coat once again with baking spray. Adjust oven rack to middle position and preheat oven to 350&deg;F.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, baking powder, baking soda, and salt together in medium bowl; reserve. Combine milk and vanilla in liquid measuring cup; reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl with an electric mixer or in the bowl of a stand mixer fitted with the whisk attachment, whip egg whites on medium speed until soft peaks form, about 2 minutes. Gradually add 1/4 cup sugar and continue whipping until stiff peaks form, 1 to 2 minutes longer. If you used the stand mixer bowl, transfer whites to separate bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat butter and remaining 1 1/2 cups sugar with paddle attachment on medium speed until light and fluffy, about 2 minutes. Add egg yolks, one at a time, beating well after each addition. Add flour mixture in three additions, alternating with milk mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold in egg whites with rubber spatula and divide batter equally between prepared pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until tester inserted in center of cakes comes out clean, 20 to 25 minutes. Transfer cakes to cooling racks and cool 10 minutes in pans. Turn cakes out directly onto racks, peel off and discard parchment, then invert so the tops are facing up. Cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> <strong>For the Frosting and Assembly:</strong> Meanwhile, stir together sugar, water, and corn syrup in heavy-bottomed medium saucepan over medium-low heat, stirring until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 238&deg;F on candy thermometer, 6 to 8 minutes.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While syrup boils, In large bowl with an electric mixer or in the bowl of a stand mixer fitted with the whisk attachment, whip egg whites and salt on medium speed until soft peaks form, 2 to 3 minutes. With mixer running on medium-high speed, slowly and carefully pour boiling syrup into the egg whites. Beat until outside of bowl is cool to the touch and whites are thick and glossy, 7 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With mixer on medium speed, add butter, one piece at a time (see note). Continue beating until light and fluffy, 3 to 5 minutes. Fold in dehydrated strawberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a serrated knife, trim off about 1/8 inch from tops of cakes to make an even surface. Then, cut each cake in half to create 4 equal layers. Place one layer on a serving dish or cake stand and spread 1/3 cup sweetened condensed milk. Repeat with remaining cake layers and sweetened condensed milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With an offset spatula, frost the sides and top of cake. Serve.</p>"}]}