{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/05152012-205395-british-bites-pork-pie.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british", "british bites", "pies", "Pork Pie", "savory pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Pork Pie", "link": "https://www.seriouseats.com/recipes/2012/05/pork-pie-british-savory-pie-how-to-make-recipe.html", "description": "There may not be a British meat pie more iconic than the pork pie.  Pork and pork jelly set in a simple hot water crust&mdash;timeless, classic and elegant.  Served cold as either a snack or as part of a meal, this hearty pie is a bit like a pâté en croûte, but more British.  And if you've never had one, it is well worth the time to make it.", "totalTime": "4 hours plus overnight", "recipeYield": "serves 8", "recipeCategory": ["British Bites", "Mains", "Pork"], "recipeIngredient": ["<strong>For the Stock (see note):</strong>", "1 pork trotter with hock attached", "2 bay leaves", "3 carrots, coarsely chopped", "1 onion, halved", "6 peppercorns", "Kosher salt", "&nbsp;", "<strong>For the Filling:</strong>", "1 pound ham steak, cut into 1 inch cubes", "1 1/2 pounds ground pork", "1/4 teaspoon ground allspice", "1/4 teaspoon freshly ground black pepper", "1/2 teaspoon marmite", "&nbsp;", "<strong>For the Crust</strong>:", "3 cups all-purpose flour", "9 ounces lard (see note)", "6 tablespoons milk", "6 tablespoons water", "1 egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Stock:</strong> Combine trotter with hock, bay leaves, carrot, onion and peppercorns in a large stock pot.  Cover with cold water and bring to a boil over medium high heat.  Reduce to a simmer and cook for 4 hours, topping off the pot with additional water if trotters become exposed. Strain stock into a large pot, reserving trotter meat if desired. Discard solids. Place strained stock over medium-high heat and simmer until reduced to about 3 cups. Season to taste with salt. Transfer to a container, let cool, cover, and refrigerate overnight. The next day, skim fat off of surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Combine ham, ground pork, allspice, black pepper, 1/2 teaspoon salt, and marmite.  Mix until ingredients are well combined.  Cover and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust</strong>: Place flour in a large bowl and sprinkle with a little salt and pepper. In a small saucepan combine lard, milk and water and place over medium heat until lard has melted.  Pour lard mixture over flour and, using a wooden spoon, mix until dough forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350°F. Grease and flour the spring-form pan, then roll 3/4 of dough into a disc about the size of the bottom of the spring-form pan.  Using your fingers press the dough up the sides of the pan.  Place the filling in the pan, then roll the reserved dough into a dish the size of the spring-form pan,  Brush edges of dough with beaten egg then place on top of pie.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a steam vent in the top of the pie, brush with remaining egg, and place in the oven for 30 minutes.  After 30 minutes lower the temperature to 325°F and cook until golden brown, about 1 hour longer.  Remove from oven and allow to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat stock in a small pan. Carefully pour through the steam vent in the top of the pie until the pie is completely full and the stock begins to come out of the top. Transfer to fridge and allow to set for at least 30 minutes before serving.</p>"}]}