{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120123-189569-jerk-chicken-thighs.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "Cree LaFavour", "jerk chicken", "mains", "Poulet", "poultry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Poulet's Jerk Chicken Thighs", "link": "https://www.seriouseats.com/recipes/2012/01/poulets-jerk-chicken-thighs-recipe.html", "description": "The secret to really great jerk chicken is in the rub, and these <strong>Jerk Chicken Thighs</strong> from <em><strong><a href=\"http://www.amazon.com/Poulet-Cree-LeFavour/dp/0811879690/?tag=serieats-20\">Poulet</a></strong></em> have cracked the code with a seemingly incongruous blend of Scotch bonnets, cloves, cinnamon, allspice, celery seed, cumin, nutmeg, sugar, and salt.", "totalTime": "1 hour 45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["2 tablespoons peanut oil", "1/2 head garlic, cloves peeled and minced ", "1 or 2 Scotch bonnet chiles, minced", "1 teaspoon celery seeds", "1 teaspoon ground cumin", "1 teaspoon ground allspice", "1/2 teaspoon freshly grated nutmeg", "1/2 teaspoon ground cloves", "1/2 teaspoon ground cinnamon", "1 tablespoon kosher salt", "1 tablespoon raw sugar", "8 to 10 bone-in, skin-on chicken thighs "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the peanut oil, garlic, chile(s), celery seeds, cumin, allspice, nutmeg, cloves, cinnamon, salt, and sugar and stir to make a smooth paste. Spread 2 to 3 teaspoons of the paste on the skin of the chicken thighs. Let stand at room temperature for 30 minutes before cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Build a medium fire in a charcoal or wood grill or heat a gas grill to medium. Use a clean, well-cured grate. If you are using charcoal or wood, you want hot embers, not flames. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the thighs, skin-side down, on the grill and let them cook for 5 minutes or so before you move them. After that, I like to flip them every 5 minutes or so to keep them from sticking and to keep from burning the skin. Plan on standing, turning, flipping and generally worrying the chicken for 30 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If your chicken is burning or the fat is igniting flames, turn the heat down or move the chicken to a cooler spot on the grill. (You can also douse the flames with a squirt bottle if there’s no room to move the chicken out of the way.) Work slowly and the result will be a deep-mahogany-colored exterior concealing a well-cooked but juicy interior. That smoky flavor and crispy skin are worth the wait.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken is done, you will see that is has shrunk considerably. The meat should be firm but with a little give when you poke it with your finger. Look for a reading of 175°F on an instant-read thermometer. If you’re unsure, cut into a piece and take a peek. Look for clear, not red or pink, juices running from the spot where you pierced the meat and opaque, barley pink flesh at the bone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Platter the chicken and serve.</p>"}]}