{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120214-192940-bluestem-chawanmushi.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bluestem: The Cookbook", "Colby Garrelts and Megan Garrerts", "Cook the Book", "custard", "egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bluestem's Chawanmushi with Hon Shimeji, Scallion, and Dashi", "link": "https://www.seriouseats.com/recipes/2012/02/bluestems-chawanmushi-with-hon-shimeji-scallion-dashi-recipe.html", "description": "This recipe produced one of the best chawanmushis we've ever had. The custard itself is meltingly soft, reminiscent of a silken tofu but deeply flavored with dashi.  Topped with mushrooms and finished with a few spoonfuls of concentrated dashi flavored with soy, mirin, and rice wine vinegar, it's a bowl that you never want to get to the bottom of.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Eggs"], "recipeIngredient": ["<strong>Dashi</strong>", "2 ounces kombu", "8 cups water", "35 grams bonito flakes (usually sold in 5-gram packs)", "&nbsp;", "<strong>Chawanmushi Broth</strong>", "2 1/2 cups Dashi", "2 tablespoons soy sauce", "2 tablespoons rice vinegar", "1 tablespoon plus 1 teaspoon mirin", "&nbsp;", "<strong>Mushrooms</strong>", "1 tablespoon dark sesame oil", "4 ounces hon shimeji mushrooms", "2 tablespoons water ", "1 tablespoon mirin", "&nbsp;", "<strong>Chawanmushi Base</strong>", "2 1/2 cups Dashi", "1 tablespoon soy sauce", "1 tablespoon mirin", "1/2 teaspoon unseasoned rice vinegar", "3 large eggs", "Thinly sliced scallions, for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the dashi:</strong> Rinse the kombu under cold water. In a medium saucepan, bring the kombu and water to a boil over high heat. Turn off the heat. Remove the kombu and add the bonito flakes. Set aside to steep. The bonito will become pulpy and slowly sink. When all of the bonito has settled below the water line, strain the dashi broth through a fine-mesh sieve, discarding the bonito.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the chawanmushi broth:</strong> Combine the dashi with the soy sauce, vinegar, and mirin in a medium saucepan. Bring it to a low simmer over medium heat. Turn off the heat and keep the broth warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Sauté  the mushrooms:</strong> Heat the sesame oil in a small sauté pan over medium heat. Add the mushrooms, water, and mirin and sauté lightly for about 30 seconds to slightly soften the mushrooms. Remove the mushrooms from the pan.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the chawanmushi base:</strong> Preheat the oven to 275°F. In a blender, mix the dashi, soy sauce, mirin, vinegar, and eggs on low speed. Strain the base through a fine-mesh sieve. Divide the chawanmushi base evenly among 4 small bowls. Cover the bowls tightly with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the bowls in a casserole dish with 1 inch of water. Put the casserole dish with the bowls of chawanmushi in the oven and bake the bowls for about 40 minutes, until the chawanmushi is just set but still a little jiggly in the middle. Let the bowls cool slightly and carefully unwrap them, being careful of the escaping steam. To serve: Pour ⅛ cup of the chawanmushi broth over each custard. Top with some sautéed mushrooms and sliced scallions as a garnish. Serve immediately.</p>"}]}