{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120814-nasty-bits-tongue-cemita-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["cemitas", "Nasty Bits", "sandwich", "tongue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cemitas de Lengua (Mexican Tongue Sandwiches)", "link": "https://www.seriouseats.com/recipes/2012/08/cemita-lengua-tongue-cemita-recipe.html", "description": "A Mexican beef tongue sandwich with black beans, avocado, and crema.", "totalTime": "3 hours", "recipeYield": "makes 4 to 6 cemitas", "recipeCategory": ["Beef", "Mains", "Offal", "Sandwiches", "The Nasty Bits"], "recipeIngredient": ["1 cow or veal tongue, about 1 1/2 pounds ", "2 medium onions", "Kosher salt and freshly ground black pepper", "3 tablespoons vegetable or canola oil", "1 (15 ounce) can black beans, drained, 3 tablespoons liquid reserved", "4 to 6 cemita rolls, halved and lightly toasted when ready to serve", "2 to 3 ripe avocados ", "4 ounces fresh Mexican cheese, such as Oaxaca cheese ", "1 tomato, thinly sliced", "A few leaves iceberg lettuce, shredded", "1/2 cup crema or sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tongue in a medium saucepan Split one onion in half and add to pot. Add cold water to cover and season generously with salt. Place on a burner over high heat. Bring to a boil, then reduce heat to lowest setting. Cover and cook until completely tender, about 2 1/2 hours, topping up with extra water if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer tongue to cutting board and discard cooking liquid (or save, if desired). Carefully peel outer membrane off of tongue and discard. Chop tongue into 1-inch pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely dice remaining onion. Heat one tablespoon oil in a large skillet over medium heat until shimmering. Add onions and cook, stirring frequently until softened but not browned, about 5 minutes. Add the beans and 3 tablespoons liquid and cook, stirring frequently, until heated through. Remove from heat and set aside. Using a potato masher, food mill, or food processor, mash beans until chunky puree is formed. Season to taste with salt and pepper. Transfer to a bowl and wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining two tablespoons oil over high heat until shimmering. Add tongue and cook without moving until well browned on first side, about 2 minutes. Toss and continue to cook until browned on all sides, about 10 minutes total. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Spread a few spoonfuls of black bean mash on the bottom half of each toasted roll. Add the tongue, then layer in avocado, lettuce, tomato, and cheese.  Spoon over with crema, then add the top bun.  Serve immediately. </p>"}]}