{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120131-127677-LTE-Red-Velvet-Cake-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "", "keywords": ["blood oranges", "boiled milk icing", "cake", "cakes", "chocolate desserts", "Let them eat cake", "red velvet cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red Velvet Cake", "link": "https://www.seriouseats.com/recipes/2012/01/let-them-eat-natural-red-velvet-cake-recipe.html", "description": "If you really look inside your soul and search your tastebuds, you will, like me, come to the harsh realization that red velvet is a fiction. Those bright carmine cupcakes peddled by overhyped bakeries are dry, stale, and lacking in flavor and substance. This cake is impossibly buttery and melt-in-your mouth with moist dark brown sugar.", "totalTime": null, "recipeYield": "Makes 8 to 10 servings", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Cake:</strong>    ", "Baking spray", "4 cups plus 2 tablespoons all-purpose flour", "1/2 cup Dutch process cocoa powder, such as Vahlrona", "2 teaspoons baking powder", "1 teaspoon baking soda", "1 1/4 teaspoons salt", "16 ounces (4 sticks) unsalted butter, at room temperature", "1/4 cup vegetable oil", "2 1/4 cups packed dark brown sugar", "5 large eggs, at room temperature", "1/3 cup pureed cooked beets (see notes)", "2 teaspoons almond extract", "3/4 cup buttermilk, at room temperature", "3/4 cup red wine, at room temperature", "&nbsp;  ", "<strong>For the Icing:</strong> ", "2 1/4 cups sugar", "1 tablespoon finely grated blood orange zest", "1/2 cup blood orange juice", "1/4 cup red wine", "6 tablespoons all-purpose flour", "1/4 cup cornstarch", "3/4 teaspoon salt", "2 cups milk", "1 tablespoon pure vanilla extract", "18 ounces (4 1/2 sticks) unsalted butter, cut into tablespoon-sized pieces and at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to upper middle and lower middle positions and preheat oven to 350&deg;F. Spray three 9-inch round cake pans with baking spray (See Notes), line bottoms with parchment paper rounds, and lightly spray with baking spray once again.    </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whisk together flour, cocoa, baking powder, baking soda, and salt; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, beat remaining butter, oil, and brown sugar on medium speed until light and fluffy, about 3 minutes. Add eggs, one at a time, beating well after each addition. Beat in beets and almond extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decrease mixer speed to low and add flour mixture in three batches, alternating with buttermilk and wine. Scrape sides and bottom of bowl with rubber spatula as needed. Increase speed to medium and beat mixture just until combined, 20 to 30 seconds. Add vanilla and beat once more, just to combine, about 10 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter evenly between prepared pans. Bake 20 to 25 minutes, rotating cakes halfway through baking, until cake tester inserted in center of cakes comes out clean. Transfer cakes to cooling rack set inside baking sheet and cool in pans 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn cakes out directly onto cooling racks and cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a serrated knife, slice each cake round in half. Break one layer up into pieces and crumble with fingers; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Icing and Assembly:</strong> Pulse 1/2 cup sugar and zest in food processor until no shaggy pieces remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring juice, wine, and orange sugar to boil over medium-high heat in small saucepan. Cook until reduced to 1/3 cup, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine remaining 1 ¾ cups sugar, flour, cornstarch, and salt in medium bowl. Whisk in milk until smooth. Strain mixture into medium saucepan and cook over medium heat, whisking constantly, until mixture comes to a boil and thickens to the consistency of pudding, 5 to 7 minutes. Stir in blood orange mixture. Transfer mixture to large bowl and cool to room temperature, stirring occasionally, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat milk mixture and vanilla on low speed with whisk attachment until combined. Add butter, 1 piece at a time, waiting for each piece to be incorporated prior to adding the next. Increase mixer speed to medium-high and beat until frosting is light and fluffy, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange one cake layer on cake stand or serving plate. With offset spatula, spread about 3/4 cup icing on cake. Press second layer on top of icing and repeat icing procedure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread a fine layer of icing on top and sides of cake. Refrigerate cake 20 minutes to set. Meanwhile, reserve 3/4 cup icing in small bowl. Stir about half of cake crumbs into remaining icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ice sides of cake with crumb icing, then ice top with reserved 3/4 cup plain icing. Use remaining crumbs to sprinkle on top of cake, if desired. Serve.<br />\n</p>"}]}