{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121128-231746-dinner-tonight-clams-black-bean-sauce-noodles-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["black beans", "Chinese", "clam", "clams", "Dinner Tonight", "noodle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Clams with Black Bean Sauce, Bok Choy, and Noodles", "link": "https://www.seriouseats.com/recipes/2012/12/clams-with-black-bean-sauce-bok-choy-noodles-recipe.html", "description": "The idea to add noodles to the classic Chinese dish of clams with black bean sauce isn't exactly a huge leap from the original, but it takes some effort to achieve the right balance between the sauce, the shellfish, and the noodles. It wasn't until I added some bok choy that it really worked.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Beans and Pulses", "Chinese", "Clams, Mussels, and Oysters", "Dinner Tonight", "Mains"], "recipeIngredient": ["1/2 pound dried Chinese rice noodles", "1 tablespoon plus 1 teaspoon vegetable oil", "1-inch piece fresh ginger, peeled, minced", "2 medium garlic cloves, minced (about 2 teaspoons)", "2 scallions, ends trimmed, white and green parts separated, both chopped", "2 tablespoons fermented black beans, mashed in a mortar and pestle ", "2 pounds fresh cherrystone clams ", "2 tablespoons Shaoxing wine or medium-dry sherry", "1 tablespoon thick soy sauce", "1/4 cup water ", "4 baby bok choy, ends trimmed, leaves separated ", "1 teaspoon corn starch, dissolved in 1 tablespoon water", "chili oil to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil over high heat. Add the Chinese noodles and cook according to the directions on the packaging. When done, drain in a colander and rinse under cold water. Let drain again, toss with 1 teasopon oil, and divided between two bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in a large wok over high heat until shimmering. Add the ginger, garlic, and white scallions. Stir fry and cook until very fragrant, 20 to 30 seconds. Add the fermented bean paste, and stir until paste is even distributed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the clams and the wine to the wok. Stir well to coat the clams in the sauce. When liquid has almost evaporated, add soy sauce and water. Cover the wok and reduce heat to medium. Steam until most of the clams have opened, 8 to 10 minutes. Remove the clams that have opened, and continue cooking the remaining clams for another 4 minutes until most have opened. If any are still closed, discard. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bok choy to the wok and cook until tender, 1 to 2 minutes. Add corn starch slurry and stir well. Cook until sauce is thick, 30 seconds to 1 minute. Add the chopped green scallions and stir. Turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the clams and sauce between the two bowls. Drizzle with chili oil (optional) and serve</p>"}]}