{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120813-217681-whoopie1.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "Cookies", "mint chocolate chip", "sandwich cookies", "whoopie pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mint Chocolate Chip Whoopie Pies", "link": "https://www.seriouseats.com/recipes/2012/08/mint-chocolate-chip-whoopie-pie-recipe.html", "description": "These fat, cakey, filled sandwich cookies take their color and taste inspiration from a favorite ice cream flavor, with extremely agreeable results. The refreshing minty flavor of the cookies is pair perfectly with a rich, thick chocolate filling, making them a crowd-pleasing dessert. Though optional, a few drops of green food coloring really bring the ice cream association full circle, making for a nostalgic and novel sandwich cookie treat.", "totalTime": "1 hour, 30 minutes", "recipeYield": "Makes 12 large or 24 mini sandwiches", "recipeCategory": ["Cakespy", "Cookies"], "recipeIngredient": ["<strong>For the Cookies:</strong>", "16 tablespoons (2 sticks) unsalted butter", "1 1/2 teaspoons salt", "2 teaspoons peppermint extract", "1 tablespoon baking powder", "1 1/2 cups (10 1/2 ounces) sugar", "3 eggs", "4 1/2 cups (22.5 ounces) all-purpose flour", "1 cup (about 8 ounces) milk", "Green food coloring, to taste (optional)", "2 cups chocolate morsels", " ", "<strong>For the Filling:</strong>", "4 cups (24 ounces) chocolate chips", "2 tablespoons light corn syrup", "4 tablespoons (1/2 stick) unsalted butter", "1 1/2 cups (12 ounces) heavy cream", "1/2 teaspoon peppermint extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position two racks in the middle position of your oven. Preheat the oven to 400&deg;F. Lightly grease (or line with parchment) two baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, cream together the butter, salt, peppermint extract, baking powder, and sugar with a wooden spoon or electric mixer until light and fluffy. Add the eggs one at a time, beating well after each addition. Add the flour alternately with the milk, beginning and ending with the flour. Add the green food coloring and mix until incorporated. Do this gently; there’s no need to beat the batter. Stir in the chocolate chips at the end.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an ice cream scoop, drop the dough onto the prepared baking sheets. Leave 2 to 2 1/2 inches between each cookie. If you use a large (4 ounce) scoop, you will get about 24 jumbo cookies (for 12 sandwiches) from the batter; if you use a small (2 ounce) scoop, you will get about 48 (for 24 sandwiches).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cookies until they’re barely set on top, about 11 minutes. Cool them on the pan for 5 minutes, then transfer to a rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate chips, corn syrup, butter, and heavy cream into a large microwave-safe bowl. Heat in the microwave, stopping to stir every 30 seconds, until mixture is completely smooth, 2 to 3 minutes total. Add in the peppermint and stir one more time. Chill in the refrigerator, stirring occasionally, until the filling is cool room temperature. Remove from the fridge, and beat at high speed with an electric mixer until it lightens in color and thickens slightly. If the filling doesn’t lighten and thicken after several minutes of beating, chill for another 15 minutes, then beat again. Spread a generous amount of filling on one of the flat sides of the cookies; sandwich another half on top to form your pie. Repeat with the remaining pies. Serve, Store in an airtight container at room temperature for up to 5 days.</p>"}]}