{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120228-dt-pan-roasted-branzino.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["branzino", "Dinner Tonight", "fish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-Roasted Whole Branzino", "link": "https://www.seriouseats.com/recipes/2012/02/pan-roasted-whole-branzino.html", "description": "[Photograph: Blake Royer] About the author: Blake Royer is a food writer, photographer, and filmmaker based in Chicago; he has been writing for Serious Eats since 2007. You can follow him on Twitter @blakeroyer....", "totalTime": "20 minutes", "recipeYield": "4 servings", "recipeCategory": ["Dinner Tonight", "Fish"], "recipeIngredient": ["2 whole branzino or other white-fleshed fish, about 3 pounds total, descaled and cleaned", "Salt and pepper", "2 tablespoons canola or other neutral oil", "1 lemon, halved", "4 tablespoons butter", "1 tablespoon chopped parsley", "3 sprigs rosemary, thyme, or other mixed herbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat an oven to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry the fish thoroughly inside and out with paper towels, then season liberally with salt and pepper.  Slice half the lemon into thin slices and lay them inside the cavities of the fish, along with the rosemary, thyme, or other herbs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large, oven-proof skillet or roasting pan large enough to hold the fish over medium heat until almost smoking (or use multiple skillets), ensure that the entire surface of the skillet is coated in oil to avoid sticking.  Lay the fish carefully in to the skillet, and cook for a minute.  Spoon some of the oil over to top of the fish to coat it, then transfer the pan(s) to the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast the fish for about ten minutes, until just cooked through.  If desired, finish by broiler to crisp the top of the skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and add the butter and parsley to the pan.  As it sizzles and turns golden, spoon it constantly over the fish to infuse with flavor.  Sprinkle the parsley into the butter for the last few moments of cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the fish immediately with the second half of the lemon cut into wedges for juicing over the fish.</p>"}]}