{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120327-195206-coconut-macaroons-610x458-20.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["coconut", "Cookies", "macaroons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coconut Macaroons (made with desiccated, unsweetened coconut)", "link": "https://www.seriouseats.com/recipes/2012/04/unsweetened-coconut-macaroon-cookie-recipe.html", "description": "My go-to recipe for Passover coconut macaroons comes from <a href=\"http://www.marthastewart.com/316486/plain-macaroons\" target=\"_blank\">Martha Stewart</a>. Since coconut is lonely without chocolate, consider adding finely chopped chocolate to the cookie mixture before scooping, or temper some for dipping. You'll be glad you did.", "totalTime": "4 hours", "recipeYield": "makes approximately 12 large macaroons", "recipeCategory": ["Coconut", "Cookies", "Desserts", "Passover"], "recipeIngredient": ["6 ounces desiccated, unsweetened coconut (toasted, if desired)", "6 ounces granulated sugar", "2 egg whites", "1 teaspoon vanilla extract", "Pinch of salt", "Optional: 2 ounces finely chopped chocolate", "Optional: 4 ounces <a href=\"http://sweets.seriouseats.com/2010/03/how-to-temper-chocolate.html\">tempered chocolate</a> for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F.  Line a baking sheet with parchment paper. In a large bowl, combine sugar, coconut, egg whites, vanilla, and salt. Use your hands to mix well, completely combining ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dampen hands with cold water. Form tablespoons of mixture into a loose haystack shapes, or use a cookie scoop to form uniform domes, and place on prepared baking sheet. Repeat with remaining mixture, placing macaroons about 1 inch apart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until golden brown, 15 to 20 minutes, or longer to desired level of brownness. Remove baking sheet from oven to a wire rack, and let macaroons cool slightly on baking sheet. Transfer the cookies to a wire rack to cool completely. They may be stored in an airtight container for up to 3 days.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For dipping: Set up a station for dipping with the cooled macaroons, parchment, bowl of tempered chocolate, and forks. Dip each macaroon into the chocolate, either by holding the top and partially submerging it, or rolling it in the chocolate using a fork. Shake off the excess over the bowl, then place the finished pieces on the parchment to set up in a cool dry place.</p>"}]}