{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120423-195206-rhubarb-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["pie", "pie of the week", "rhubarb", "spring desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rhubarb Pie", "link": "https://www.seriouseats.com/recipes/2012/04/simple-rhubarb-pie-recipe.html", "description": "Making this pie is the best way I know to celebrate the coming of spring. While many people might only think of rhubarb in pie as a secondary ingredient, you'll be surprised and pleased at how well it can shine completely on its own. When adding the sugar, feel free to scale up or down, depending on your desired level of tartness.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Pies, Tarts, and Crumbles", "Rhubarb"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "2 pounds rhubarb, chopped into 1/4-inch thick slices", "8 ounces granulated sugar (or more/less to taste)", "3 tablespoons tapioca starch or corn starch", "Egg wash (made from one egg beaten with a pinch of salt)", "1 tablespoon raw sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 425°F. Place rhubarb in large bowl. Whisk together sugar and starch to combine, then toss with rhubarb until pieces are evenly coated. Allow mixture to sit for five minutes, then add to pie shell. Cover with top crust. Crimp sides, cut some slits in the top, and chill the pie for 15 to 20 minutes. When ready to bake, remove pie from oven, brush with egg wash, and sprinkle with raw sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pie in oven and bake for 20 minutes, turning halfway through, then turn oven down to 350°F and bake until filling bubbles all over inside and crust is golden brown, 20 to 30 additional minutes. Remove from oven and place pie on rack to cool completely before serving.</p>"}]}