{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120711-Potato-Chops-Indian-Mince-Stuffed-Potato-Dumplings.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["bef", "Beyond Curry", "Indian", "lamb", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato Chops (Meat-Stuffed Indian Potato Pancakes)", "link": "https://www.seriouseats.com/recipes/2012/07/potato-chops-indian-recipe.html", "description": "Crunchy, soft and mellow on the outside. Spicy, tangy and meaty inside, potato chops are the kind of thing you'd want to save for your last bite. So that all their wonderful contrasting textures and flavors stay with you to remind you of a wonderful meal.", "totalTime": "45 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Beef", "Beyond Curry", "Indian", "Lamb", "Mains", "Potato"], "recipeIngredient": ["1 1/2 pounds russet potatoes", "1/2 pound ground beef or lamb", "3 medium cloves garlic, finely minced", "5 tablespoons oil (divided)", "1 small onion, finely chopped (about 1/2 cup)", "2 tablespoons tomato puree ", "1 tablespoon toasted and ground cumin ", "1 teaspoon turmeric powder", "1/2 tablespoon red chilli powder", "1/2 teaspoon freshly ground black pepper", "1/2 tablespoon malt vinegar", "1 teaspoon sugar", "Kosher salt", "1 tablespoon chopped fresh cilantro", "1/4 cup water", "2 eggs, beaten", "1 cup fine breadcrumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover russte potatoes with cold water in a medium saucepan. Bring to a boil and cook until potatoes are completely tender, about 15 minutes. Drain, then press hot potatoes through a ricer, discarding skins. Season to taste with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While potatoes cook, combine ground meat and garlic paste in a small bowl. Set aside. Heat 1 1/2 tablespoon oil in medium saucepan over medium heat until shimmering. Add chopped onions and cook, stirring occasionally, until lightly softened, about 2 minutes. Add tomato puree and cook, stirring frequently, until reduced and oil breaks to the surface, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cumin, turmeric, red chilli powder, and pepper. Cook, stirring constantly, until fragrant, about 1 minute. Add vinegar and stir to incorporate. Add sugar, salt, and meat. Cook, stirring constantly, until meat is coated in spice mixture and cooked through and oil breaks to the surface, about 7 minutes total. Add cilantro and water. Cover and cook for ten minutes. Remove cover and continue cooking until water is completely evaporated. Season to taste with more salt, then transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the mashed potatoes into rounds about 2 1/2 inches in diameter and 1/2-inch thick. Lift one round onto the palm of your hand and make a shallow indentation in the center. Add 1 tablespoon minced meat filling. Gently fold the sides of the mash over the mince filling until it is completely covered. Gently flatten into a disk. Repeat with remaining potatoes and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip each chop into the whisked egg and dredge in breadcrumbs, then transfer to a clean large plate. Heat remaining oil in a medium non-stick skillet over medium heat until shimmering. Slide the potato chops gently into the oil and fry on each side until lightly golden brown, about 1 minute on each side. Drain on paper towel-lined plate, season with salt, and serve.</p>"}]}