{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/diyvsbuy-amaretto.jpg", "author": {"@type": "Person", "name": "Marcia Simmons"}, "recipeCuisine": "", "keywords": ["almond", "amaretto", "cocktail ingredients", "cocktails", "DIY vs Buy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "DIY Amaretto", "link": "https://www.seriouseats.com/recipes/2012/04/diy-amaretto-homemade-almond-liqueur-recipe.html", "description": "Amaretto is an Italian liqueur that tastes like almonds, though it's made from apricot kernels.", "totalTime": "About 4 weeks", "recipeYield": "makes about 3 cups", "recipeCategory": ["Cocktails", "Nuts"], "recipeIngredient": ["1 cup dried apricots", "1 1/2 cup distilled water (divided)", "1/4 cup apricot kernels", "1/4 cup raw almonds", "1 tablespoon fennel seed", "1 teaspoon mahlab (sour cherry stones)", "1 allspice berry", "1 cardamom pod", "1 1/2 cups 100-proof vodka (divided)", "1 cup brandy", "1/2 cup white sugar", "1/2 cup turbinado sugar", "1 teaspoon vanilla extract (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the dried apricots coarsely and soak them in 1 cup warm distilled water to rehydrate, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop the apricot kernels and almonds coarsely. Smash fennel, mahlab, allspice, and cardamom with the mortar and pestle. They should just be broken, not finely ground.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the apricots are soft, dump any excess water and place the apricots in a sealable glass jar along with the spices. Pour in 1 cup of vodka and all the brandy. Seal and shake the jar. Let steep for 25 days, shaking frequently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain out the solids through the sieve, pressing down to extract as much liquid as possible then filter through a strainer lined with a large coffee filter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the liquid is filtering, caramelize the white sugar by cooking it over medium heat in a sauce pot, stirring frequently. It will start to melt into a brown liquid. At the same time, in a second sauce pot, boil the turbinado sugar and 1/2 cup of water on medium heat to make simple syrup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After about 10 minutes, the white sugar will be completely caramelized and the turbinado sugar and water will be completely integrated into a simple syrup. Turn off the heat for the simple syrup, and reduce the heat on the caramelized sugar to low. Slowly pour the hot simple syrup into the caramelized syrup a little bit at a time, stirring to incorporate it so that it doesn't harden. Small chunks may form, but they will melt as you continue to cook it. Once it is a thick mixture with no chunks, pour it into a glass jar to cool. Add the remaining 1/2 cup of vodka to this syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the amaretto liquid has passed through the coffee filter, add the sugar mixture (and vanilla extract, if desired) to taste. Once you are happy with the level of sweetness, let the combined mixture rest for 1 to 3 days before use. Store at room temperature for 6 months.</p>"}]}