{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120424-asparagus-ramp-soup-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "quick", "ramps", "soup", "spring", "vegetarian", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Asparagus and Ramp Soup With Yogurt", "link": "https://www.seriouseats.com/recipes/2012/05/asparagus-and-ramp-soup-with-yogurt-recipe.html", "description": "[Photographs: J. Kenji Lopez-Alt] Note: If ramps are unavailable, substitute with 1 clove garlic and 1 bunch sliced scallions. About the author: J. Kenji Lopez-Alt is the Chief Creative Officer of Serious Eats where he likes to explore the science...", "totalTime": "30 minutes", "recipeYield": "Makes about 2 1/2 quarts, serving 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Asparagus", "Mains", "Soups and Stews", "The Food Lab", "Vegetarian"], "recipeIngredient": ["2 pounds asparagus stalks, fibrous root end trimmed", "Kosher salt", "1 pound trimmed ramps, divided (see note)", "2 tablespoons unsalted butter", "Freshly ground black pepper", "2 cups vegetable or low-sodium chicken broth", "1 cup plain yogurt", "1/4 cup extra-virgin olive oil, plus more for drizzling", "1 tablespoons juice from 1 lemon", "2 tablespoons chopped mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the top inch off of each asparagus stalk. Bring a large pot of salted water to a boil over high heat. Have a large ice bath ready. Add asparagus tips and cook until bright green and tender, about 1 minute. Transfer to ice bath until chilled. Dry carefully and reserve. Add asparagus stalks to water and cook until bright green and tender, about 2 minutes. Transfer to ice bath to chill. Transfer chilled stalks to jar of a blender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside 8 ramps (if using scallions, set aside 2 whole sliced scallions). Heat 1 tablespoon butter in a large skillet over medium-high heat until foaming subsides. Add remaining ramps and season with salt and pepper. Cook, stirring and tossing frequently, until tender and lightly browned. Transfer to blender jar. Add broth and yogurt to blender. Blend on high speed until completely smooth, stopping to scrape down sides and adding water as necessary until rich, soupy consistency is reached.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With blender running, slowly drizzle in olive oil. Season to taste with salt and pepper, then strain through a fine mesh strainer if smoother texture is desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a medium saucepan and heat, stirring frequently. When ready to serve, stir in lemon juice. Melt remaining butter in a large skillet. Sautée ramps and asparagus tips until lightly browned then transfer to a plate. Ladle soup into individual bowl. Garnish with sauteed ramps, asparagus, chopped mint, and an extra drizzle of olive oil (be generous). Serve immediately.</p>"}]}