{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120318-197792-chicken-kiev.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["butter", "chicken", "Cook the Book", "Judy Gelman and Peter Zheutlin", "Mad Men", "The Unofficial Mad Men Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Kiev", "link": "https://www.seriouseats.com/recipes/2012/03/chicken-kiev-recipe.html", "description": "Of all of the carefully curated recipes in <em><strong><a href=\"http://www.amazon.com/Unofficial-Mad-Men-Cookbook-Restaurants/dp/1936661411/?tag=serieats-20\">The Unofficial Mad Men Cookbook</a></strong></em>, <strong>Chicken Kiev</strong> has got to be the one with the most retro caché and and quite possibly the one most worth revisiting.", "totalTime": "1 hour 45 minutes", "recipeYield": "serves 6", "recipeCategory": ["Chicken", "Cook the Book"], "recipeIngredient": ["12 tablespoons unsalted butter, chilled", "6 chicken breast halves (about 8 ounces each), tenderloins removed", "¾ teaspoon salt", "¾ teaspoon freshly ground pepper", "3 tablespoons all-purpose flour", "2 eggs beaten", "2/3 to 1 cup fine dry breadcrumbs", "2 quarts vegetable, peanut, or canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut butter into six equal pieces (2 tablespoons each). With moist hands, shape each butter portion into a roll 3 inches long and ¾ inch thick (alternatively, you can shape the butter inside a piece of wax paper). Wrap butter portions in wax paper and freeze while preparing chicken breasts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim any fat from breasts. Lay each breast on wax paper, cover with another sheet of wax paper, and with a mallet or rolling pin pound meat to 1/8 inch thickness. Pound meat as thin as possible at the edges since the thinner the edges, the easier it will be to seal them firmly to prevent butter from oozing out during cooking.  Be careful not to tear the meat. Each pounded breast should be approximately 8 inches long and 5 inches wide.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, gently peel off the wax paper from each breast. Sprinkle one side of each breast with salt and pepper. Place one piece of butter in the center of the chicken breast. Fold two sides over the butter. Fold one end of the breast and roll up the rest of the way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat each cutlet on all sides with flour, shaking off excess. Dip lightly into beaten eggs shaking off excess. Roll in breadcrumbs, coating the cutlets evenly and shaking off the excess. Place cutlets in one layer on a platter, cover with plastic wrap and  refrigerate for 1-2 hours.<br />\r\n <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil to 360°F in a Dutch oven or large wok over high heat. Carefully lower three chicken cutlets into the oil and cook until golden brown, about 8 minutes total. The cutlets should not touch each other during frying. Turn twice, using tongs or 2 spoons for turning and for removing the cutlets from the hot oil; this will prevent their being pierced. Drain on paper towels and transfer to heated serving dish. Repeat with remaining cutlets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternate method: Preheat oven to 350°F.  You can fry cutlets for 3 minutes, turning once. Place cutlets in a 13 x 9 x 2-inch baking pan, and cook uncovered, for about 15 minutes. Turn over twice while cooking using tongs or two spoons. Drain on paper towels before serving.</p>"}]}