{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120816-218959-cook-the-book-romanian-sweet-and-sour-eggplant.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "eggplant", "Susan Feniger", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Susan Feniger's Street Food's Romanian Sweet and Sour Eggplant", "link": "https://www.seriouseats.com/recipes/2012/08/susan-fenigers-street-foods-romanian-sweet-sour-eggplant-recipe.html", "description": "After it has been reduced to a silky, rich version of its former self, the eggplant spends a quick 10 minutes stewing the tomatoes, sugar, and vinegar. It may not be the sexiest eggplant dish imaginable, but the final salad is certainly a unique take on the aubergine.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cook the Book", "Eggplant", "Gluten-Free", "Salads", "Sides", "Tomato", "Vegetarian"], "recipeIngredient": ["2 large eggplants (about 2 pounds)", "3 tablespoons plus 1/2 teaspoon kosher salt", "1/2 cup extra-virgin olive oil", "10 cloves garlic, peeled", "2 bunches scallions, white and green parts, roughly chopped", "1/2 bunch fresh Italian parsley leaves and small stems, roughly chopped (1/4 cup)", "1/2 teaspoon cayenne pepper", "Canola oil", "1 (14.5-ounce) can whole peeled tomatoes, drained and roughly chopped", "3/4 cup cider vinegar", "1/2 cup packed dark brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off and discard both ends of each eggplant, and cut them lengthwise into 1/4-inch-thick slices. Lay the slices out on a baking sheet, and sprinkle both sides with the 3 tablespoons salt. Set aside for 20 minutes so that the salt will draw out some of the water from the eggplant. Then pat the eggplant dry with a dish towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the olive oil, garlic, scallions, parsley, cayenne, and remaining 1/2 teaspoon salt in a food processor, and puree until a smooth paste forms (it will resemble pesto). Spread liberally all over both sides of the eggplant slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan set over medium-high heat, heat 2 tablespoons canola oil. Add enough eggplant slices to cover the bottom of the pan, and cook until they are browned on both sides and cooked through, 2 to 3 minutes per side. Transfer the eggplant to a platter or plate. Repeat this process with the remaining eggplant slices, adding 2 tablespoons oil for each batch. Cut the cooked eggplant into 1-inch-wide strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan set over medium heat, combine the tomatoes, vinegar, and brown sugar. Stew for 12 minutes or until the tomatoes begin breaking down. Add the eggplant strips and stir together. Reduce the heat to low and simmer for 8 to 10 minutes, until most of the liquid has been cooked off. Remove from the heat and serve, or chill. This dish may be served warm or cold.</p>"}]}