{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121116-sunday-supper-ancho-turkey-gratin.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["potatoes", "Sunday Supper", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ancho-Rubbed Turkey Breast With Cilantro-Habanero Potato Gratin", "link": "https://www.seriouseats.com/recipes/2012/11/ancho-rubbed-turkey-breast-with-cilantro-habanero-potato-gratin-recipe.html", "description": "Chili and cocoa-rubbed turkey breast is accompanied by tequila-spiked gravy and a cilantro-habanero potato gratin.", "totalTime": "2 hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Mains", "Potato", "Sides", "Sunday Supper", "Turkey"], "recipeIngredient": ["<strong>For the Turkey:</strong>", "1/2 tablespoon ground ancho chili powder", "1 teaspoon ground guajillo chili powder", "1 teaspoon granulated onion powder", "Kosher salt and freshly ground black pepper", "1/2 teaspoon unsweetened cocoa powder", "2 tablespoons olive oil", "1 whole bone-in, skin-on turkey breast (5 to 6 pounds total)", "3 pounds russet potatoes, sliced very thin", "2 habanero peppers, minced", "2 medium cloves of garlic, minced (about 2 teaspoons)", "1/2 cup chopped fresh cilantro leaves, plus additional for garnish", "1 1/2 cups shredded pepper jack cheese", "1 cup shredded Parmesan cheese", "2 cups homemade or store-bought low-sodium chicken broth, divided", "1 1/2 cups half and half", "2 tablespoons tequila", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower and lower-middle position and preheat oven to 375&deg;F. Mix chili powders, onion powder, 1 teaspoon salt, 1/2 teaspoon pepper, cocoa powder, and olive oil in a small bowl. Carefully separate the turkey skin from the meat by inserting your hand at the bottom of the breast, taking care not to tear it. Liberally rub spice mixture on turkey and under the skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer turkey to a roasting pan and place in the oven to cook, basting every 30 minutes or so with pan juices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, grease a 13- by 9- by 2-inch baking dish. Line it with 1/3 of the potatoes in a single, overlapping layer. Season with salt and pepper. Top with 1/3 of the habaneros and garlic. Follow with 1/3 each of the cilantro, pepper jack cheese and Parmesan cheese. Repeat until you have three layers, ending with cheese on top. Pour 1 1/2 cups broth and half and half on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the turkey has roasted for about 25 minutes, place potatoes in the oven. Continue roasting until potatoes are tender and turkey registers 155°F on an instant-read thermometer, about 1 hour 45 minutes total. Tent with foil if meat starts to become too dark. Remove turkey and potatoes from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put roasting pan on the stove top over medium-high heat. Deglaze the pan with tequila, scraping up browned bits using a wooden spoon. Simmer for a minute and add remaining 1/2 cup chicken stock. Bring to a boil. Swirl in butter and allow sauce to thicken and reduce slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve the turkey breast meat from the bone and arrange the slices on a serving platter. Pour sauce over turkey. Sprinkle potatoes with remaining cilantro. Serve.</p>"}]}