{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/07/20120724-215462-bread-baking-flour-potato-tortillas.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "Mexican", "keywords": ["bread baking", "Mexican", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flour and Potato Tortillas", "link": "https://www.seriouseats.com/recipes/2012/07/flour-and-potato-tortillas.html", "description": "I love fresh flour tortillas, whether they're homemade or purchased from one of the local tortilla shops. But tortillas on day two are never as good. Either they get brittle or rubbery. But they never stay nicely flexible. These do.", "totalTime": "", "recipeYield": "Makes 8 tortillas", "recipeCategory": ["Bread", "Bread Baking", "Mexican"], "recipeIngredient": ["9 ounces (about 2 cups) all purpose flour", "3/4 cup water", "2 tablespoons olive oil", "1 teaspoon salt", "1/4 cup instant mashed potato flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine al ingredients in the bowl of a stand mixer and knead on low speed with the dough hook until mixture is smooth and elastic, about 10 minutes. Flour work surface and divide the dough into 8 even pieces. Form each piece into a ball. Cover dough balls with plastic wrap or a clean kitchen towel and let rest for about 10 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a cast iron frying pan, comal, or griddle on medium-high heat. One at at time, roll dough balls with rolling pin or tortilla press to between 6- to 8-inches in diameter, adding flour to the work surface as needed to keep the dough from sticking. Brush the flour off the dough as much as possible and lay the tortilla on the heated pan. Cook until there are browned spots on the bottom of the dough, 1 to 2 minutes. Flip and cook on second side until spotted, another 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the finished tortilla from the pan, lay it on a clean kitchen towel, and cover the tortilla with the ends of the cloth. Continue the process until all the tortillas have been cooked. Serve warm.<br />\r\n</p>"}]}