{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/01/20120110-186710-bread-baking-cheese-crackers.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread baking", "cheese", "cheese crackers", "crackers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cheese Crackers", "link": "https://www.seriouseats.com/recipes/2012/01/bread-baking-cheese-crackers.html", "description": "Use cheese with a lot of flavor. Aged cheddar instead of a mild one, for instance. Any cheese you can grate will be fine: Parmesan, Swiss, Romano, or any others you like. For a softer cheese, I used Limburger. You could also use a soft blue cheese, goat cheese, or even a Camembert. Or a combination of what's left in your cheese drawer.", "totalTime": "", "recipeYield": "1/2 pound of crackers", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bread", "Bread Baking", "Cheese"], "recipeIngredient": ["1 1/2 cups (6 3/4 ounces) bread flour", "1/2 cup warm water", "1 teaspoon instant yeast", "1 tablespoon sugar", "1/4 teaspoon salt", "1 ounce finely grated firm cheese", "2 ounces soft cheese, cut in cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all of the ingredients in the bowl of your stand mixer. Knead with the dough hook until the dough is elastic. It won't be completely smooth because of the bits of cheese, but that's fine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This would also work really well in the food processor, and the dough would be a bit smoother since the processor blade would do a better job of integrating the cheese. If you use the food processor, put all the ingredients except the water into the processor bowl, pulse a few times, then leave the processor running and add the water slowly, as fast as the flour can absorb it. Once the dough forms a ball, let it process another 30 seconds or so, then check for elasticity.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Leave the dough in the stand mixer bowl (or, if you used the food processor, transfer it to a clean bowl) and cover with plastic wrap. Set aside for an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 250 degrees and have 2 baking sheets and parchment paper ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half, and roll each half into a thin rectangle (it doesn't have to be perfect) about 14x17 inches. Place the dough on the parchment sheets and dock it (use a dough docker or stab it with a fork all over) to keep it from puffing too much when it bakes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a pastry cutter, pizza cutter, or similar tool, cut the dough into roughly 1-inch squares. It's fine if they're not even, and you don't need to separate the pieces completely - the crackers will shrink apart a bit as they bake and will break apart at the cuts easily once they're crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the parchment sheets with the dough onto the baking sheets. Bake at 250 degrees for 30 minutes. The crackers should be beginning to brown just a little bit. Rotate the pans if they are browning unevenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the oven off, and leave the crackers in the oven for another 30-60 minutes. They will continue to brown a little and become crisp and dry, but watch them carefully - if your oven retains heat really well, you risk browning them too much. If that's the case, you can crack the oven door open a bit to let some of the heat out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>They will continue to dry as they cool, but you want them mostly dry before you remove them from the oven - they should be crisp and not squishy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove them from the oven and let them cool completely before storing them. I like to leave them out in the air for at least a day to make sure they're completely dry and crisp. It's also easier to snack on them that way.</p>"}]}