{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120305cremedementhprim.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "chocolate", "Marshmallow Madness", "marshmallows", "mint", "Shauna Sever"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crème De Menthe Marshmallows", "link": "https://www.seriouseats.com/recipes/2012/03/creme-de-menthe-mint-chocolate-marshmallow-recipe.html", "description": "Dyed a lovely mint green from Crème De Menthe, these marshmallows are studded with mini chocolate chips and dipped in bittersweet chocolate.  We love the idea of flavoring marshmallows with liqueur but if you're not feeling like a cocktail you can always sub in peppermint extract and a few dashes of green food coloring for a similarly festive mallow.", "totalTime": "6 hours 45 minutes", "recipeYield": "makes about 2 dozen 1 Â½-inch mallows", "recipeCategory": ["Bake the Book", "Candy", "Desserts"], "recipeIngredient": ["<strong>The Bloom</strong>", "4 teaspoons unflavored powdered gelatin ", "1/3 cup cold water ", "2 tablespoons crème de menthe (30 proof)", " &nbsp;", "<strong>The Syrup</strong>", "1 cup sugar ", "1/2 cup light corn syrup, divided", "1/4 cup crème de menthe", "1/4 cup water ", "1/4 teaspoon salt", "&nbsp;", "<strong>The Mallowing</strong>", "1 teaspoon pure vanilla extract ", "1/2 cup mini semisweet chocolate chips", "1/2 cup Classic Coating, plus more for dusting (recipe follows)", "8 ounces bittersweet chocolate chips (60% to 70% cacao), melted and slightly cooled ", "&nbsp;", "<strong>Classic Coating</strong>", "1 1/2 cups confectioners’ sugar", "1 cup cornstarch or potato starch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Classic Coating:</strong> Sift the ingredients together in a large bowl or combine them in a food processor. I tend to make several cups’ worth at a time and store it in an airtight container; it keeps forever.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the marshmallows:</strong> Lightly coat an 8-by-8-inch baking pan with cooking spray.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the gelatin, cold water, and crème de menthe in a small bowl. Let it soften for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the sugar, 1/4 cup of the corn syrup, crème de menthe, water, and salt in a medium saucepan over high heat. Boil, stirring occasionally, until the temperature reaches 240&deg;F. Pour the remaining 1/4 cup corn syrup into the bowl of an electric mixer fitted with the whisk attachment. Microwave the gelatin on high until completely melted, about 30 seconds, and pour it into the mixer bowl. Set the mixer to low and keep it running.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the syrup reaches 240&deg;F, slowly pour it into the mixer bowl. Increase the speed to medium and beat for 5 minutes. Increase to medium-high and beat for 3 more minutes. Beat on the highest setting for 1 to 2 minutes more, adding the vanilla. The finished marshmallow will be more than doubled in volume. Use a spatula to quickly fold in the chocolate chips; too much stirring can cause the bits to melt and give the candy a muddy look. Pour the marshmallow into the prepared pan. Sift coating evenly over top. Let set for at least 6 hours in a cool, dry place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a knife to loosen the marshmallow from the edges of the pan. Invert the slab onto a coating-dusted work surface. Cut it into pieces and dust the sticky edges with more coating. Line a baking sheet with parchment paper or a silicone baking mat. Dip the bottom half of each mallow in the melted chocolate and place on the baking sheet. Refrigerate until chocolate is firm, about 10 minutes.</p>"}]}