{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/02/20120213-192722-Maple-Bacon-Long-Johns.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["breakfast breads", "breakfast pastries", "breakfast sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Maple Bacon Long Johns", "link": "https://www.seriouseats.com/recipes/2012/02/maple-bacon-long-johns-doughnut-bars-at-home-recipe.html", "description": "When it comes to prepping the doughnuts, Long Johns are a snap. After the first rise, just roll out the dough into a large rectangle and cut out the bars. Alas, the lack of scraps means no doughnut holes, but for dunkers, the shape of the Long Johns is ideal.", "totalTime": "3 hours", "recipeYield": "Makes 20 doughnuts", "recipeCategory": ["Bacon", "Breakfast Sweets", "Doughnuts", "Pastry"], "recipeIngredient": ["<strong>For the Doughnuts:</strong>", "5 1/2 cups all-purpose flour (approximately 25 ounces), divided", "1/3 cup plus 1 tablespoon sugar, divided", "1 teaspoons salt", "1/2 teaspoon cinnamon", "1/4 teaspoon nutmeg", "1 1/2 cups whole milk", "1/3 cup water ", "2 packages instant yeast", "1/3 cup unsalted butter, melted", "2 eggs, beaten", "2 teaspoons vanilla", "2 quarts canola oil, for frying (you may need more depending on size of pot)", "&nbsp;", "<strong>For the Glaze:</strong>", "1 cup confectioners sugar", "1/3 cup pure maple syrup", "1 1/2 tablespoons whole milk", "1/4 teaspoon vanilla extract", "4 strips thick cut bacon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, mix 5 cups flour, 1/3 cup sugar, salt, cinnamon, and nutmeg. Set aside. Rinse bowl of stand mixer in warm water to take away the chill. Oil large bowl with cooking spray or vegetable oil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm milk and water in a small saucepan until mixture reaches approximately 110 to 115&deg;F. Pour warmed milk mixture in the bowl of stand mixer. Sprinkle yeast evenly over liquid mixture and then sprinkle remaining tablespoon of sugar on top. Let dissolve for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit stand mixer with paddle attachment and slowly incorporate melted butter (butter should be cooled to lukewarm). Add the eggs, vanilla, and half of the flour mixture beat on low speed to incorporate flour mixture then turn the speed up to medium and beat until well combined. Add the remaining flour mixture, combining on low speed at first, and then increase the speed to medium and beat well. Change to the dough hook attachment then beat on medium until dough comes together. Add additional 1/2 cup flour to dough, as needed, to smooth out dough. Beat until dough begins to pulls away from the bowl and becomes smooth, approximately 3 to 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough to a well-oiled bowl, cover with a clean towel or plastic wrap. Set in a warm place and let rise until doubled in size, approximately one hour. Prepare 2 large baking sheets with parchment paper and spray with cooking spray. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out dough on a well floured surface and roll out to form an 8 x 20 inch rectangle. Use a sharp knife to cut into 20 bars approximately 2 inches wide by 4 inches long. Carefully transfer bars to prepared baking sheet an cover each sheet with a clean towel. Set in a warm place and let rise approximately one hour, bars should be puffy, but may not double in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large frying pan, cook bacon on medium heat until crispy. Remove from heat and place on paper towels to drain excess fat. Once cooled chop until finely diced and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour canola oil into a large dutch oven to a depth of 2 inches. Heat oil to 360&deg;F. Once oil reaches the proper temperature use a heat resistant spatula or shallow strainer to carefully drop doughnuts in, one at a time, cooking a maximum of 3 at once. Cook until a dark golden brown, about 1 to 1 ½ minutes, then using heat resistant tongs turn the doughnuts and cook to the same degree of doneness. Remove from oil letting any excess oil drain off then transfer to a wire rack for cooling. Test your first doughnut to make sure that the insides are completely cooked, if not, adjust your cooking time accordingly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together confectioners sugar, maple syrup, vanilla and milk to form glaze. Once doughnuts are cool enough to handle, dip tops in in glaze and return to wire rack allowing the excess glaze to dribble off the sides. Sprinkle with bacon. Serve immediately. Doughnuts are best served fresh, but will last for a day. Once cooled completely, store covered.</p>"}]}