{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121220-pork-chops-vinegar.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["peppers", "pork", "pork chops", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Chops With Potatoes and Vinegar Peppers", "link": "https://www.seriouseats.com/recipes/2012/12/pork-chops-with-vesuvio-potatoes-vinegar-peppers.html", "description": "A dish of pan-fried pork chops, lemony, herby potatoes, and pickled peppers delivers a blast of flavor with minimal effort.", "totalTime": "1 hour, plus overnight marinating period", "recipeYield": "serves 4", "recipeCategory": ["Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["4 bone-in, double-cut pork chops, 1 1/4” thick, 12 to 16 ounces each", "8 tablespoons olive oil, divided", "6 cloves of garlic, thinly sliced, divided", "1/4 cup fresh juice from 2 lemons, divided", "Kosher salt and freshly ground black pepper", "4 medium russet potatoes, peeled and cut lengthwise into long wedges", "1 teaspoon minced rosemary", "1 teaspoon dried oregano", "1 teaspoon dried thyme", "1 teaspoon dried basil", "1/2 teaspoon dried sage", "1 each red, yellow, orange and green bell pepper, seeded and cut into large chunks", "1 1/2 tablespoons white wine vinegar", "1/4 teaspoon sugar", "1/4 teaspoon crushed red pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork in a resealable bag with 2 tablespoons olive oil, 2 cloves of garlic, 2 tablespoons lemon juice, 1 teaspoon salt and 1/2 teaspoon pepper. Tightly seal bag, squish around to combine and place in the refrigerator to marinate at least 8 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, Adjust oven rack to lower-middle position and preheat oven to 375&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rosemary, oregano, thyme, basil, and sage to a small bowl along with 1/2 teaspoon salt and 1/2 teaspoon black pepper. Stir to combine. Mix 2 1/2 teaspoons of spice mixture with 3 tablespoons olive oil in another small bowl. Liberally slather mixture on potatoes. Toss potatoes with remaining 2 tablespoons lemon juice and arrange in a single layer in a baking dish or roasting pan. Place in oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After potatoes have been roasting for about 30 minutes, remove pork chops from bag, pat dry with paper towels, and season generously with remaining spice mixture. Heat 1 tablespoon olive oil in a large skillet medium-high heat until just starting to smoke. Add pork chops to pan. Sear until lightly browned on both sides, flipping halfway through, about 8 minutes total. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pork chops to the oven (do not clean out the skillet), placing them on top of potatoes. Scatter remaining four cloves garlic around chops. Roast until potatoes are tender when pierced with a fork and an instant-read thermometer inserted into center of thickest section of chop registers 135&deg;F, 15 to 20 minutes. Remove from oven and tent loosely with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pork is resting, heat remaining 2 tablespoons olive oil over medium heat, using the same skillet used to brown the meat. Scrape up any caramelized bits from the bottom of the pan. Add peppers and cook, stirring frequently until starting to brown, about 2 minutes. Add vinegar, sugar, and crushed red pepper. Season with salt and pepper, to taste. Continue cooking until peppers are just beginning to soften, another 1 to 2 minutes. Serve potatoes, pork chops, and peppers together immediately.</p>"}]}