{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120418-202414-Snappy-Turtle-Cookies.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate cookies", "Cookies", "pillsbury bakeoff", "turtle cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snappy Turtle Cookies", "link": "https://www.seriouseats.com/recipes/2012/04/snappy-turtle-frosted-chocolate-pecan-cookies-recipe.html", "description": "Adapted from Beatrice Harlib's <a href=\"http://www.pillsbury.com/recipes/snappy-turtle-cookies/9095bc5c-502d-4eac-b7c4-954381c1e665/\">1952 Pillsbury Bakeoff Grand Prize-winning recipe</a>, this version adds cinnamon and ginger for a lightly spiced take on a traditional butter cookie. The original recipe calls for semi-sweet chocolate chips, which will do in a pinch, but for serious chocolate lovers, I find using the best quality dark chocolate you can get is always a worthy substitution.", "totalTime": "2 hours and 30 minutes", "recipeYield": "makes 30 cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["<strong>For the Cookies:</strong>", "1 1/2 cups (about 7 1/2 ounces) all-purpose flour", "1/2 teaspoon cinnamon", "1/4 teaspoon ground ginger", "1/4 teaspoon salt", "1/4 teaspoon baking soda", "1/2 cup (about 4 ounces) firmly packed light brown sugar", "1/2 cup (4 ounces or 1 stick) unsalted butter", "2 teaspoons vanilla extract", "2 large eggs", "75 raw pecan halves (about 1 1/2 cups)", "&nbsp;", "<strong>For the Frosting:</strong>", "3 ounces dark chocolate (72% cacao or higher is preferred)", "1 1/2 tablespoons unsalted butter, melted", "3 tablespoons whole milk", "3/4 cup confectioners sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl mix flour, cinnamon, ginger, salt and baking soda then set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand kitchen mixer fitted with a paddle attachment, combine brown sugar and butter. Beat on medium until mixture is light and fluffy. Add vanilla, 1 whole egg and 1 egg yolk (refrigerate and reserve remaining egg white); beat until thoroughly combined. Stir in flour mixture. Cover bowl with plastic wrap and chill dough for at least an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut pecan halves lengthwise. Line two large baking sheets with parchment paper. Arrange the pecan pieces in groups of five on the baking sheets (about one dozen cookies will fit per sheet), so that they resemble the head and legs of a turtle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop cookie dough by rounded tablespoon and shape into 1-inch balls. Beat reserved egg white. Brush the bottom of the cookie dough balls in egg white and press lightly into the pecan groups. (The tips of the pecans should be visible, sometimes it's easiest to arrange the pecans to look more turtlelike once the cookie is in place). Bake for 10 to 12 minutes or until edges are golden brown. Transfer cookie sheets to a wire rack and cool completely before frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While cookies are cooling, prepare frosting. In medium, microwave-safe bowl, add chocolate. Microwave on high for 30 seconds and then stir, repeat as necessary until chocolate is completely melted and smooth. Stir in melted butter and milk until mixture is smooth. Add powdered sugar and stir to incorporate, adding additional milk, if needed, to improve spreading consistency. Frost cooled cookies. Let frosting set before storing. Store in an airtight container placing waxed paper or parchment paper between cookie layers.</p>"}]}