{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120926-stir-fried-snap-peas-and-mushrooms-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "fish sauce", "mushrooms", "quick", "snap peas", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stir-Fried Snap Peas and Mushrooms With Fish Sauce and Basil", "link": "https://www.seriouseats.com/recipes/2012/10/stir-fried-snap-peas-mushrooms-fish-sauce-basil-recipe.html", "description": "A quick stir-fry with mushrooms and crunchy snap peas flavored with fish sauce, lime, and a handful of basil.", "totalTime": "10 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Legumes", "Mushrooms", "Sides", "Stir Frying"], "recipeIngredient": ["2 tablespoons fish sauce", "1 teaspoon soy sauce", "1 tablespoon juice from 1 lime", "1 tablespoon sugar", "2 tablespoons vegetable oil", "2 packages (about 10 ounces) hon-shimeji mushrooms, bottoms trimmed", "1 medium shallot, finely minced", "2 medium cloves garlic, minced or grated on a microplane grater", "1 pound sugar snap peas or snow peas, trimmed and strings removed", "1/2 cup chopped fresh basil or mint leaves", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine fish sauce, soy sauce, sugar, and lime juice in a small bowl and set aside. Heat 1 tablespoon oil in a large wok over high heat until smoking. Add mushrooms and cook, stirring and tossing frequently until browned on a few surfaces and cooked through, about 5 minutes total. Add shallots and garlic and cook, stirring and tossing constantly, until fragrant, about 30 seconds. Transfer mushrooms to a medium bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining tablespoon oil to wok and return to high heat until smoking. Add snap peas and cook, stirring and tossing occasionally, until lightly charred and just barely cooked through, about 4 minutes. Return mushrooms to wok. Stir fish sauce mixture and add to wok. Add basil. Cook, tossing and stirring constantly until vegetables are coated in sauce and pan appears dry, about 1 minute longer. Season to taste with salt. Serve immediately.</p>"}]}