{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/093012-224489-Sunday-Gravy-PolentaB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Italian", "keywords": ["Italian", "meatballs", "polenta", "sausage", "Sunday Supper", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Creamy Mascarpone Polenta Topped With Sunday Gravy", "link": "https://www.seriouseats.com/recipes/2012/10/creamy-mascarpone-polenta-sunday-gravy-recipe.html", "description": "Ultra-creamy, garlicky polenta forms a fine foundation for rich, meaty tomato ragù.", "totalTime": "3 1/2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Italian", "Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the Sauce:</strong>", "1 rack baby back ribs, split in half", "3 tablespoons olive oil, divided", "Kosher salt and freshly ground black pepper", "1 pound hot Italian sausage", "1 large onion, finely chopped, plus 1 small onion, grated, divided", "3 tablespoons tomato paste", "7 garlic cloves, minced, divided", "1 cup dry red wine, such as Chianti", "2 (28-ounce) cans crushed tomatoes", "&nbsp;", "<strong>For the Meatballs:</strong>", "1/4 cup finely chopped flat-leaf parsley", "2 teaspoons crushed red pepper flakes", "1/3 cup Italian-style bread crumbs", "1 ounce Parmesan cheese", "1 large egg yolk", "2 slices bacon, minced", "1/2 pound ground chuck", "1/2 pound ground pork", "1/4 pound ground veal", "&nbsp;", "<strong>For the Polenta:</strong>", "8 1/2 cups water", "2 scant cups coarse yellow cornmeal (not quick-cooking)", "8 ounces mascarpone"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat ribs dry with a paper towel and season with salt and pepper. Heat 2 tablespoons oil in a large Dutch oven until shimmering. Add half rack of ribs to pan and brown on both sides, about 6 minutes total. Transfer ribs to a platter and repeat with second half of rack. Add sausage and brown on all sides, about 7 minutes total. Transfer sausages to plate with ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium. Add finely chopped onion and sauté until beginning to soften and brown, about 5 minutes. Add tomato paste and four cloves minced garlic and cook until mixture becomes burnished and garlic is fragrant, 3 minutes. Pour in wine, bring to a boil and simmer for 2 minutes before adding crushed tomatoes. Stir, scraping the pan to dislodge browned bits. Return ribs and sausage to the pot, reduce heat to low and simmer, stirring occasionally, for 2 to 2 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the grated onion, parsley, red pepper flakes, breadcrumbs, Parmesan, egg, bacon, 1 teaspoon salt and 1/2 teaspoon pepper. Add the beef, pork and veal. Using your hands, combine all ingredients gently but thoroughly. Using wet hands, gently shape the mixture into 1 1/4-inch balls and set aside on a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sauce is cooking, bring water to a boil in a large stockpot. Add polenta in a thin, steady stream, stirring continuously with a whisk to avoid clumps. Add 1 1/2 teaspoons salt, remaining three cloves of minced garlic, and 1/2 teaspoon black pepper. Reduce heat to low and simmer, covered, stirring every 10 minutes or so for 30 minutes. When polenta is done cooking, add mascarpone in dollops, and stir until it melts into the polenta. Taste and season with additional salt, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When sauce is nearing the end of its cooking time, heat remaining 1 tablespoon olive oil in a large skillet over high heat until shimmering, add meatballs, browning in batches until golden on all sides, about five minutes total per batch. Drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove ribs from sauce. Pull meat from bones and shred. Return rib meat to sauce, along with meatballs and simmer until cooked through, about 15 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To plate family-style, place polenta in the center of a large serving platter, spreading to leave a well in the center. Top with sauce. Or serve on individual plates.</p>"}]}