{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120521-127677-LatAmCuisine-Gallopinto-PRIMARY.jpg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Latin Cuisine", "keywords": ["beans", "grains", "Kristin Teig photography", "Latin American cuisine", "nicaragua", "nicaraguan cuisine", "rice", "rice and beans", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Gallopinto (Nicaraguan Rice and Beans)", "link": "https://www.seriouseats.com/recipes/2012/05/gallopinto-nicaraguan-rice-and-beans-recipe.html", "description": "Rice and beans are served at every single meal in Nicaragua. It's either rice and beans, or riceandbeans, otherwise known as <em>gallopinto</em> (\"red rooster,\" though friends and I used to call it \"painted rooster\" due to odd translations and plain old foolishness). The name alludes to the color of the mixture of white rice and small red kidney beans, which mirrors that of the king of the coop.", "totalTime": "1 day", "recipeYield": "serves 8", "recipeCategory": ["Latin American", "Latin Cuisine", "Rice", "Sides", "Vegetarian"], "recipeIngredient": ["<strong> For the beans</strong>    ", "1 (16-ounce) bag dried small red or black beans", "Salt", "7 garlic cloves, peeled", "   ", "<strong> For the rice</strong>    ", "1/4 cup vegetable oil, divided", "1 medium yellow onion, finely chopped (about 1 cup), divided", "1 1/2 cups long-grain white rice", "3 cups water or low-sodium chicken broth", "1/2 green bell pepper, cored and seeded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the beans:</strong> Spread beans out in a rimmed baking sheet. Pick out any debris and broken beans. Transfer beans to colander and rinse under cold running water. Place rinsed beans in a large pot and cover with cold water; water should cover beans about 3 inches. Let soak for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to boil over high heat. Reduce heat to medium and simmer beans for 30 minutes. Turn off heat, cover beans, and let rest 1 hour. Bring beans back up to boil over high heat. Add 2 teaspoons salt and garlic, reduce heat to medium, and simmer until beans are tender, 30 to 60 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If storing the beans, cool completely, transfer beans and some of the cooking liquid to quart-sized zipper-lock bags. When ready to use, thaw out in refrigerator and heat on stovetop in saucepan or microwave.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the rice:</strong> Heat  2 tablespoons oil in large heavy-bottomed saucepan over medium heat until shimmering. Add 2/3 of onion and cook, stirring, until softened and translucent, about 5 minutes.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice and cook, stirring, until grains are shiny and evenly coated with oil, 2 to 3 minutes. Add water or broth and 1 1/2 teaspoons salt, increase heat to high, and bring to a boil. Place bell pepper on top of rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil rice without stirring until most of the liquid has evaporated and you can see small bubbles bursting on the surface of the rice. Immediately reduce the heat to the lowest setting, cover, and cook (do not stir, do not remove lid) for 15 minutes. Remove and discard bell pepper. Fluff rice with chopsticks or fork, then let cool and refrigerate for 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> For the gallopinto:</strong> Heat remaining 2 tablespoons oil in large saucepan over medium-high heat until shimmering. Add remaining onion and cook, stirring, until softened and translucent, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice and 2 cups beans to skillet and cook, stirring, until rice is evenly coated. Continue to cook, stirring, to allow flavors to meld and mixture to become slightly crisp, about 10 minutes. Cover and cook over low heat an additional 10 minutes. (See note.)</p>"}]}