{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/201204-203283-toasts-with-tamp-butter-and-quail-eggs-primary.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["A Girl and Her Pig", "April Bloomfield", "Cook the Book", "egg", "ramps", "recipe newsletter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "April Bloomfield's Toasts with Ramp Butter and Fried Quail Eggs", "link": "https://www.seriouseats.com/recipes/2012/04/april-bloomfields-toasts-with-ramp-butter-and-fried-quail-eggs-recipe.html", "description": "These <strong>Toasts with Ramp Butter and Fried Quail Eggs</strong> from <a href=\"http://thespottedpig.com/info.php\">April Bloomfield</a>'s <em><strong><a href=\"http://www.amazon.com/Girl-Her-Pig-Recipes-Stories/dp/0062003968/0061554200/?tag=serieats-20\">A Girl and Her Pig</a></strong></em> are yet another way to enjoy everyone's favorite fleeting spring vegetable.  The butter in this recipe incorporates both the cooked bulb of the ramp and its tender, raw greens into a rich butter dressed up with capers, anchovies, lemon, and chiles.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Eggs"], "recipeIngredient": ["A scant 1/4 pound ramps, roots trimmed ", "11 tablespoons unsalted butter, at room temperature ", "Maldon or another flaky sea salt ", "3 whole salt-packed anchovies, rinsed, soaked, and filleted, then finely chopped", "1 tablespoon finely grated lemon zest (from about 2 large lemons) ", "1 1/2 teaspoons freshly squeezed lemon juice, or more to taste ", "A few glugs of extra virgin olive oil ", "Dried pequin chilis or red pepper flakes ", "Freshly ground black pepper ", "Eight 1/2-inch-thick diagonal slices from a baguette, toasted and cooled ", "8 quail eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pile the ramps on your cutting board so the bulb ends line up. Start by thinly slicing the bulbs, working your way toward the green leaves. After you’ve sliced the purple stems and reached the greens, make your slices even thinner. Gather the sliced bulbs and stems into a little pile. Set the greens aside for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 1 tablespoon of the butter in a sauté pan and set it over medium-high heat. Once it melts and froths, add the sliced ramp bulbs and stems (along with a five-fingered pinch of greens) and a sprinkle of salt. Cook, stirring often, until the ramps have a hint of brown, 2 minutes or so. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the ramps into a bowl and add the remaining 10 tablespoons butter, the anchovies, lemon zest, lemon juice, a glug of olive oil, a few crumbled chilies, and, if you fancy, a few twists of black pepper. Mash, toss, and stir the mixture with a fork or wooden spoon just until everything’s nicely mixed. Give the reserved ramp greens a brief chop, then stir them in. Have a taste. You should taste the gentle onion flavor of the ramps, a good bit of umami-saltiness from the anchovies, and brightness, not tartness, from the lemon. To me, this butter tastes like spring. You might want to add another 1/4 teaspoon salt or another brief squeeze of lemon. (You can refrigerate the butter for a day or two in a bowl, or roll it into a log, if you’re feeling fancy.) <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slather the toasts with the ramp butter (you’ll have extra butter; reserve it for another day). <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour a glug or two of oil into a nonstick pan just large enough to hold the eggs comfortably (you can also fry them in 2 batches) and set it over medium-high heat. When the oil is barely smoking, crack the eggs into the pan. (it helps to insert the tip of a knife into the shell, though not so far in that you break the yolk.) You should hear spitting and sizzling when you add them. Cook them until the whites are set and golden brown at the edges but the yolks are still runny, about a minute. Top each toast with a quail egg and add a little sprinkle of salt. Serve straightaway.</p>"}]}