{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120524-207812-twisted-toll-house-cookies.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "chocolate chip cookies", "Cookies", "hazelnuts", "Kir Jensen", "The Sugar Cube"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Twisted Toll House Cookies", "link": "https://www.seriouseats.com/recipes/2012/05/the-sugar-cube-twisted-toll-house-cookies-recipe.html", "description": "Adapted from her Portland based dessert truck and namesake cookbook, <em><strong><a href=\"http://www.amazon.com/The-Sugar-Cube-Deliciously-Sweetest/dp/1452101264/?tag=serieats-20\">The Sugar Cube</a></strong></em>, these cookies gain a wonderfully nutty richness due to the high oil content of the nuts.  The cookies bake up thin, crisp, and totally awesome, especially when finished with a pinch of crunchy fleur de sel.", "totalTime": "45 minutes plus resting time for the cookie dough", "recipeYield": "makes about 24 cookies", "recipeCategory": ["Bake the Book", "Cookies", "Desserts", "Nuts"], "recipeIngredient": ["1 3/4 cups unbleached all-purpose flour ", "1/2 cup hazelnut flour (see tip) ", "1 teaspoon baking soda ", "1 teaspoon sea salt ", "1 cup (2 sticks) unsalted butter, at room temperature (see tip)", "3/4 cup granulated sugar ", "3/4 cup packed dark brown sugar ", "2 large eggs, at room temperature", "1 teaspoon pure vanilla extract ", "1 3/4 cups to 2 cups (about 10 ounces) finely chopped 70 percent bittersweet chocolate ", "Fleur de sel for sprinkling "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the all-purpose flour, hazelnut flour, baking soda, and salt. In the bowl of a stand mixer fitted with a paddle attachment, cream the butter, granulated sugar, and brown sugar on high speed until light and fluffy, about 2 minutes. Add the eggs, one at a time, beating well after each addition. Beat in the vanilla. Scrape down the sides of the bowl. With the mixer on low, add the dry ingredients and beat just until combined. Stir in the chopped chocolate, using the larger amount if you’re a chocolate fanatic. Chill the dough for at least several hours, or, if you can resist, chill it overnight to give the flavors a chance to mature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Line two large baking sheets with parchment paper or Silpats. Drop the dough by 2-tablespoon portions (I use a 2-ounce ice cream scoop) about 2 inches apart (they spread) onto the prepared baking sheets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until golden brown, 12 to 14 minutes, rotating the sheets from front to back and between upper and lower racks after about 10 minutes. Sprinkle the cookies with fleur de sel while still warm and let cool on the baking sheets for a minute before transferring them to a wire rack to cool completely. The cookies will keep in an airtight container for several days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation: Thick and Twisted Toll House</strong><br />\r\nTo make the cookies thicker and more like a classic Toll House cookie, increase the all-purpose flour to 2 cups, reduce the hazelnut flour to 1/4 cup, and add 3/4 cup chopped lightly toasted hazelnuts. Instead of finely chopped chocolate, use 1 3/4 cups to 2 cups dark bittersweet chocolate chips. </p>\r\n\r\n<p><br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><small></strong>Tips:</strong>Hazelnut flour is finely ground hazelnuts. Bob’s Red Mill and King Arthur Flour both sell it. But you can also make it yourself. Toast the hazelnuts in a preheated 350°F oven until fragrant and beginning to color, 8 to 10 minutes. Rub them between two kitchen towels to rub off as much of their dark, papery skins as you can. Let them cool before putting them in a food processor with 2 to 4 tablespoons unbleached all-purpose flour and pulsing until they are very finely chopped.</p>\r\n\r\n<p>To soften butter in a hurry, beat the crap out of it. Seriously. Just give it a couple of good whacks right in the wrapper. Get your aggression out. Peel off the wrapper, break off pieces by hand, and throw them in the mixer. </small></p>"}]}