{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/08/20120823-219716-nasty-bits-tongue-sandwich.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["horseradish", "Nasty Bits", "sandwich", "tarragon", "tongue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tongue Sandwich with Tarragon or Parsley Sauce", "link": "https://www.seriouseats.com/recipes/2012/08/tongue-sandwich-with-tarragon-sauce-recipe.html", "description": "A crispy veal tongue sandwich with horseradish, bitter greens, and a creamy, tangy tarragon sauce.", "totalTime": "3 hours 45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Offal", "Sandwiches", "The Nasty Bits"], "recipeIngredient": ["1 cow or veal tongue, about 1 1/2 pounds ", "2 medium onions, peel on", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable or canola oil", "1 slice rustic bread, crust removed, torn into small pieces (about 1/4 cup)", "3 1/2 tablespoons red wine vinegar", "2 tablespoons drained capers, finely chopped", "4 anchovy fillets, minced", "2 medium garlic cloves, minced or grated with a microplane grater (about 2 teaspoons)", "1 tablespoon Dijon mustard", "1/4 cup olive oil", "3 tablespoons minced tarragon or parsley leaves, or a mix", "1 boiled egg, yolk and white separated", "2 baguettes, or 8 slices of bread", "1/4 cup prepared horseradish", "Arugula, watercress, or some kind of bitter green"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tongue in a medium saucepan. Split one onion in half and add to pot. Add cold water to cover and season generously with salt. Place on a burner over high heat. Bring to a boil, then reduce heat to lowest setting. Cover and cook until completely tender, about 2 1/2 hours, topping up with extra water if necessary. Allow to cool until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer tongue to cutting board and discard cooking liquid (or save, if desired). Carefully peel outer membrane off of tongue and discard. Slice tongue into 1/2 inch slabs.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat two tablespoons oil over high heat until shimmering. Add tongue and cook without moving until well browned on first side, about 3 minutes.  Flip slabs of tongue and cook without moving until browned on second side. Alternatively, brush slices of tongue with oil and grill on both sides until well browned and crispy, about 5 minutes per side over moderate heat. Season to taste with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, soak the bread in the vinegar, then break up with a fork until it is mashed.  Add capers, anchovy, garlic, mustard, and olive oil and mix well.  Add the minced tarragon or parsley.  Crumble the yolk into the sauce.  Dice the egg white, then add it to the sauce.  Add salt and pepper to taste.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble sandwiches, spread a few spoonfuls of sauce on the bottom slices of bread, and horseradish on the top slice. Add the greens, then tongue to the bottom slice. Close sandwiches and serve immediately.</p>"}]}