{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121112-swiss-chard-gratin-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beans", "fennel", "gratins", "swiss chard", "thanksgiving", "vegetarian", "white beans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Swiss Chard, Fennel, and White Bean Gratin", "link": "https://www.seriouseats.com/recipes/2012/11/swiss-chard-fennel-white-bean-gratin-recipe.html", "description": "Fennel, swiss chard, and white beans in a creamy gratin scented with nutmeg and topped with cheesy breadcrumbs.", "totalTime": "1 hour", "recipeYield": "serves 8 to 10", "recipeCategory": ["Christmas", "Sides", "Thanksgiving", "The Food Lab", "Vegetarian"], "recipeIngredient": ["5 tablespoons unsalted butter", "1 large bulb fennel, cored, and sliced thin (about 3 cups)", "1 large onion, sliced thin (about 1 1/2 cups)", "Kosher salt and freshly ground black pepper", "3 medium cloves garlic, minced (about 1 tablespoon)", "3 bunches swiss chard (about 1 pound), leaves removed, tender stems sliced thinly", "1/2 teaspoon freshly grated nutmeg", "1 tablespoon flour", "1 1/2 cups half and half", "2 (15 ounce) cans white beans, drained and rinsed", "1 1/2 cups fresh breadcrumbs", "2 ounces finely grated parmesan or romano cheese (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400°F. Melt 2 tablespoons butter in a large saucepot or Dutch oven over medium-high heat. Add fennel and onion, season with salt and pepper, and cook, stirring occasionally, until vegetables are softened and translucent, about 10 minutes, reducing heat if it starts to brown. Add garlic and cook, stirring constantly until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1/3 or swiss chard and cook, stirring, until wilted, about 1 minute. Repeat with remaining swiss chard in two more batches. Add nutmeg and flour and stir to combine. Add half and half, stir to combine, and cook, stirring occasionally, until thickened. Add beans and reduce to a bare simmer. Continue to cook, stirring occasionally, for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt remaining 3 tablespoons butter. Toss breadcrumbs, butter, and cheese in a large bowl and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season filling with salt and pepper, transfer to a large casserole dish, top with breadcrumbs, and bake until golden brown on top and bubbling around the edges, about 30 minutes. Remove from oven, let rest about 10 minutes, and serve.</p>"}]}