{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121022-bake-the-book-pine-nut-marzipan-tart%20(1).jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "breakfast sweets", "marzipan", "pine nuts", "tarts", "the dahlia bakery cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Pine Nut Marzipan Tart", "link": "https://www.seriouseats.com/recipes/2012/10/roasted-pine-nut-marzipan-tart-recipe.html", "description": "And now for something completely delicious: sweet, nutty marzipan made from pine nuts, sandwiched between two layers of tart dough. Great for breakfast on a cold morning.", "totalTime": "3 hours, including baking/cooling", "recipeYield": "makes 1 9-inch tart", "recipeCategory": ["Bake the Book", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Soft Tart Dough</strong>", "1 2/3 cups (228 grams) all-purpose flour", "1⁄4 teaspoon baking powder", "1⁄4 teaspoon kosher salt", "1⁄2 cup plus 1 tablespoon (127 grams) unsalted butter, softened", "1⁄2 cup (59 grams) powdered sugar", "1 large egg plus 1 large yolk, lightly beaten", " ", "<strong>Pine Nut Marzipan</strong>", "1 cup (4 ounces/113 grams) pine nuts, toasted ", "1⁄2 cup (35⁄8 ounces/104 grams) sugar", "1 large egg, lightly beaten", "4 tablespoons (1⁄2 stick/2 ounces/ 57 grams) unsalted butter, softened ", " ", "<strong>To Finish The Tart</strong>", "1 large egg yolk", "1 tablespoon heavy cream", "About 2 teaspoons sugar as needed for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the tart dough, combine the flour, baking powder, and salt in a bowl and set the dry ingredients aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer using the paddle attachment, cream the butter and sugar together. Gradually beat in the eggs. It’s okay if the mixture looks broken. Add the dry ingredients to the butter- egg mixture and mix just until the dough comes together. Scrape the dough out onto a work surface and divide into one- third and two- third portions, forming each portion into a flattened round. Wrap the rounds in plastic wrap and chill for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pine nut marzipan, combine the pine nuts and sugar in the bowl of a food processor and pulse until finely ground. Add the egg and process until smooth. Gradually add the butter, a small bit at a time, pulsing until each bit of butter is completely incorporated. When all the butter is incorporated, scrape the marzipan into a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap the larger round of dough and place it on a lightly floured work surface. Using a lightly floured rolling pin, roll the dough out to an 11- or 12- inch round about 1 ⁄8 inch thick. Use flour as needed to roll the dough and lift the dough occasionally with a board scraper as you are working to check that it’s not sticking. Transfer the dough to the tart pan. It’s easiest to do this by folding the dough into quarters. Pick up the folded dough and place it in the pan, with the pointed tip of the dough in the center of the pan, then unfold gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ease the dough gently into the pan, patting it up against the sides. Trim the overhanging dough to about 3 ⁄4 inch. The dough is a bit fragile. If it tears while you are lining the pan, use the dough trimmings to patch any holes. Using a rubber spatula or an offset icing spatula, spread the marzipan evenly over the bottom of the tart. Unwrap the smaller round of dough and roll it out to a 9- inch round. Transfer the round of dough to cover the marzipan. (Again, it’s easiest to fold the dough into quarters to transfer it.) Use a small knife to trim the dough to fi t inside the top of the tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, beat the egg yolk lightly with the heavy cream. Brush the 1 ⁄2 inch of overhanging dough with some of the egg wash, then fold the overhang up over the top of the tart, pressing gently with the tines of a fork to seal. Brush the entire top of the tart lightly with egg wash and sprinkle with sugar. Cut a few 1- inch slashes in the top of the tart for steam to escape. Place the tart pan on a baking sheet and bake until golden, about 30 minutes. Remove from the oven and allow the tart to cool on a rack for 15 minutes before removing the rim of the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the tart to cool for at least 15 minutes more before slicing and serving. (You can leave the tart on the metal tart pan bottom, or you can slide it onto a 9- inch round cake cardboard.) Cut the tart into thin wedges and serve slightly warm or at room temperature.</p>"}]}