{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120527-Capsicum-Besan-Sabji-Bell-Pepper-and-Chickpea-flour-stir-fry.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["bell peppers", "Beyond Curry", "Indian", "quick", "stir fry", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Capsicum Besan Sabji (Bell Pepper and Chickpea Flour Stir-Fry)", "link": "https://www.seriouseats.com/recipes/2012/06/capsicum-besan-sabji-bell-pepper-and-chickpea-stir-fried-recipe.html", "description": "I've personally never liked the flavor of <em>capsicum</em> or bell peppers. But tasting this method of preparation had me completely converted. It's a unique combination of chickpea flour and bell peppers, resulting in a wonderful textural contrast of soft and mildly crisp.", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Beyond Curry", "Indian", "Sides", "Stir Frying", "Vegetarian"], "recipeIngredient": ["2 tablespoons chickpea flour", "1 1/2 teaspoon red chilli powder", "1 teaspoon ground cumin", "2 teaspoons ground coriander", "Salt", "1 1/2 tablespoon vegetable oil or ghee", "1 teaspoon black mustard seeds", "1 small onion chopped", "1 cup de-seeded and chopped green bell pepper (1/2 inch squares)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix chickpea flour, red chilli, cumin, coriander, and a pinch of salt in a small bowl.  Place this spiced flour mix in a cast iron pan and cook over medium heat until fragrant but not browned, about 1 minute. Transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pan to medium heat and heat oil or ghee until shimmering. Add the mustard seeds and cook, stirring, until they splutter, about 30 seconds. Add the onion and fry until slightly soft but not browned, about 1 minute. Add the chopped bell pepper, a pinch of salt and stir until fragrant and the mixture is coated with the ghee/oil, about 1 minute. Reduce heat to low and allow the juices of the bell pepper cook it through, about 5 minutes. Stir at intervals to make sure it doesn't stick to the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the bell peppers have softened, add the spiced flour mix and stir vigorously to blend the flour with the oil and juices in the pan, until it resembles a scrambled egg consistency, about 1 minute. Stop stirring and allow the dish to cook for 1 minute longer. Season to taste with salt. Serve hot with rotis and deal tadka.</p>"}]}