{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120521-206790-cakespy-shortcake-primary.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "strawberries", "strawberry shortcake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Doughnut Strawberry Shortcake", "link": "https://www.seriouseats.com/recipes/2012/05/doughnut-strawberry-shortcake-recipe.html", "description": "It's a beautiful balancing act: the holey rounds of lightly crispy fried dough act as perfect bookends for the light-as-air whipped cream and juicy strawberry slices which act as filling.", "totalTime": "10 minutes", "recipeYield": "makes 2 shortcakes", "recipeCategory": ["Breakfast Sweets", "Cakespy", "Doughnuts", "Strawberry"], "recipeIngredient": ["2 doughnuts (flavor of your choosing)", "2 teaspoons butter, melted", "1/2 cup cold heavy whipping cream", "1 tablespoon confectioners' sugar", "4 large strawberries, stemmed, each sliced into 4 slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice each doughnut in half, as you would a bagel. Place the doughnuts flat (cut) side up. Using a pastry brush, brush each doughnut half with melted butter. If you are using a doughnut with frosting on the top, do not butter the frosted side; just leave it to the side for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the doughnuts in a toaster oven on a foil-lined sheet (to prevent any drips) and lightly toast until the edges are golden and crispy. If you do not have a toaster oven, you can also toast the doughnut halves in a 400&deg;F oven for 3-4 minutes or until they are as toasty as you'd like them. Once again, if you are using a doughnut that has frosting on the top, do not heat the frosted side as it will melt all over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the doughnut halves from heat, and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an electric hand mixer with the whisk attachment, whisk the cream and confectioners' sugar on high speed until stiff peaks form. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a ring of strawberry halves on top of two of the doughnuts. Top with a generous dollop of whipped cream. If you have leftover berries, you can add more on top of the whipped cream (or, you can serve them on the side when you present the dessert). Add the second doughnut halves to the two composed stacks, pressing lightly to ensure that they stay in place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately.</p>"}]}