{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120501-204355-mark-bittman-rice-pudding2.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Cook the Book", "desserts", "How to Cook Everything The Basics", "Mark Bittman", "pudding", "recipe newsletter", "rice", "rice pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Mark Bittman's Rice Pudding in the Oven", "link": "https://www.seriouseats.com/recipes/2012/05/mark-bittmans-rice-pudding-in-the-oven-recipe.html", "description": "They don't call <a href=\"http://markbittman.com/\">Mark Bittman</a>, author of <em><strong><a href=\"http://www.amazon.com/How-Cook-Everything-The-Basics/dp/0470528060/?tag=serieats-20\">How to Cook Everything The Basics</a></strong></em>, The Minimalist for nothing. His recipes are simple, straightforward, and often pared down to their bare essential ingredients.  Plus, he's not one to add in labor intensive steps. Take this <strong>Rice Pudding in the Oven</strong>&mdash;it's a solid dessert that requires nothing more than tossing rice, milk, and sugar into a gratin dish, and baking for roughly two hours. Sure, you have to stir the pot every now and again, but really, it's nearly effortless. And the pudding? Well, it's a beautiful batch of rice pudding: mild, milky, and entirely comforting.", "totalTime": "About 2 hours, mostly unattended", "recipeYield": "4 servings", "recipeCategory": ["Desserts", "Pasta", "Puddings and Custards", "Rice"], "recipeIngredient": ["1/3 cup any white rice", "1/2 cup sugar", "Pinch salt ", "4 cups milk "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 300°F. Combine the rice, sugar, salt, and milk in a large gratin dish that holds at least 6 cups. Stir a couple of times and put it in the oven, uncovered. Bake for 30 minutes, then stir. Bake for 30 minutes longer, then stir again; at this point the rice might be swelling up and the milk should begin to develop a bubbly skin (if so, stir it back into the mixture).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook until the rice plumps and starts to become a more noticeable part of the mixture and the skin becomes more visible and darker, about 30 minutes more.</p>\n\n<p>Now the pudding is getting close to done, so check on it every 10 minutes, stirring each time (it should reach the right texture in 10 to 30 minutes, depending on the kind of rice you used).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pudding will be done before you think it’s done. The rice should be really swollen and the milk thickened considerably but still pretty fluid (it will thicken more as it cools). Serve warm, at room temperature, or cold.</p>"}]}