{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120501-boiled-ham-hock-nasty-bits-04.JPG", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "", "keywords": ["cabbage", "ham hock", "pork", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Broiled Ham Hock with Braised Cabbage", "link": "https://www.seriouseats.com/recipes/2012/05/broiled-ham-hock-with-braised-cabbage.html", "description": "About the author: Chichi Wang took her degree in philosophy, but decided that writing about food would be much more fun than writing about Plato. She firmly believes in all things offal, the importance of reading great books, and the...", "totalTime": "5 hours", "recipeYield": "4 as a main course", "recipeCategory": ["Cabbage", "Pork"], "recipeIngredient": ["2 tablespoons dijon or whole grain mustard", "1 teaspoon white or red wine vinegar", "6 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "4 pounds bone-in ham hocks", "1 onion, roughly chopped", "2 stalks celery, roughly chopped", "1 large carrot, roughly chopped", "1 small bunch parsley", "2 bay leaves", "1 pound savoy or white cabbage, finely sliced (about 1/2 large head)", "1 tablespoon balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine mustard and vinegar in a small sealable container. Add 1/2 cup olive oil. Seal container and shake vigorously to emulsify. Season to taste with salt and pepper then set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add ham hocks, onion, celery, carrot, parsley, and bay leaves to a large saucepan. Cover with water by 2 inches. Bring to a boil over high heat, reduce to a bare simmer, cover, and cook until hocks are completely tender, about 3 hours. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons olive oil in a 12-inch straight-sided sauté pan over medium-high heat until shimmering. Add the chopped cabbage and cook, stirring frequently, until cabbage softens, about 10 minutes. Season to taste with salt and pepper. Add balsamic vinegar and continue to cook, stirring frequently, until the cabbage is beginning to brown, about 10 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high and adjust rack to six inches below element. Transfer cabbage to a broiler-proof casserole dish. Transfer hocks to cabbage, discarding vegetables and bay leaves (save broth for another use). Nestle the hocks in the cabbage, using the cabbage to cover exposed flesh but leaving skin exposed. Season hocks with salt and pepper. Broil until the skin is browned on one side, 8 to 10 minutes.  Turn the hock over and broil again until the skin is brown and crispy, about another 8 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately with cabbage and mustard vinagrette on the side.    </p>"}]}