{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121112-229540-cook-the-book-herb-butter-turkey.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "herb butter", "roast turkey", "Tanya Steel", "the epicurious cookbook", "Tom Colicchio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tom Colicchio's Herb-Butter Turkey from 'The Epicurious Cookbook'", "link": "https://www.seriouseats.com/recipes/2012/11/tom-colicchios-herb-butter-turkey-from-the-epicurious-cookbook-recipe.html", "description": "This bird is roasted hot to brown the skin, and then low and slow to finish. What sets it apart, however, is the unabashed use of butter. This is not a turkey simply rubbed down with butter. It is slathered, stuffed, and basted with the stuff, and then the gravy is spiked with a couple more tablespoons for good measure.", "totalTime": "4 to 5 hours", "recipeYield": "serves 8", "recipeCategory": ["Cook the Book", "Mains", "Turkey"], "recipeIngredient": ["<strong>For Gravy Base</strong>", "2 tablespoons unsalted butter", "2 pounds turkey necks and/or wings", "2 cups diced onions", "1 cup diced peeled carrots", "1 cup diced celery", "6 cups low-sodium chicken broth or more as needed", " ", "<strong>For Turkey</strong>", "1 cup (2 sticks) butter, at room temperature", "2 teaspoons minced fresh thyme, plus 15 fresh thyme sprigs", "2 teaspoons minced fresh tarragon, plus 5 large fresh tarragon sprigs", "2 teaspoons minced fresh rosemary, plus 5 fresh rosemary sprigs", "2 teaspoons minced fresh sage, plus 5 fresh sage sprigs", "1 (14- to 16-pound) turkey", "4 cups low-sodium chicken broth", "1/4 cup all purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Gravy Base:</strong> Melt the butter in a heavy large deep skillet over high heat. Add the turkey necks and/or wings and sauté until deep brown, about 15 minutes. Add the onions, carrots, and celery and sauté until vegetables are deep brown, about 15 minutes. Add the 6 cups chicken broth and bring to boil. Reduce the heat to medium-low and simmer uncovered 45 minutes, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the gravy base through a strainer set over a 4-cup measuring cup, pressing on the solids to extract liquid. If necessary, add enough more chicken broth to gravy base to measure 4 cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Turkey:</strong> Mix 1/2 cup butter and all the minced herbs in a small bowl; season the herb butter with salt and pepper. Transfer 2 generous tablespoons to another small bowl and reserve for gravy; let stand at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a rack at lowest position in the oven and preheat the oven to 425°F. Rinse the turkey inside and out; pat dry. Starting at the neck end, slide your hand between the skin and the breast meat to loosen the skin. Rub 4 tablespoons of herb butter over the breast meat under the skin. Place the turkey on a rack set into a large roasting pan. Sprinkle the main cavity generously with salt and pepper. Place 4 tablespoons of plain butter and all the herb sprigs in the main cavity. Tuck the wing tips under. Tie the legs together loosely. Rub the 2 tablespoons remaining herb butter over the outside of the turkey. Sprinkle the turkey generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the turkey in the oven and roast 20 minutes. Reduce the oven temperature to 350°F. Roast 30 minutes more, then pour 1 cup broth over and add 1 tablespoon plain butter to the roasting pan. Roast 30 minutes more; baste with pan juices, then pour another 1 cup broth over and add another 1 tablespoon butter to pan. Cover the turkey loosely with foil. Roast until a thermometer inserted into thickest part of the thigh registers 175°F, basting with pan juices and adding 1 cup broth and 1 tablespoon butter to pan every 45 minutes, about 1 hour 45 minutes longer. Transfer the turkey to a platter; let stand 30 minutes (internal temperature will rise 5 to 10 degrees).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the pan juices into a bowl; whisk in the gravy base. Melt the reserved 2 tablespoons herb butter in a heavy large saucepan over medium heat; add the flour and whisk constantly until the roux is golden brown, about 6 minutes. Gradually add the pan juice-gravy base mixture; increase the heat and whisk constantly until gravy thickens, boils, and is smooth. Reduce the heat to medium; boil gently until gravy is reduced to 4 1/2 cups, whisking often, about 10 minutes. Season the gravy with salt and pepper and serve with the turkey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Do Ahead:</strong> Gravy base can be prepared 2 days ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled. Rewarm before using.</p>"}]}