{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120304-bok-choy-shallot-potato-hash-5.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "egg", "hangover helper", "hash", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Spicy Potato, Bok Choy, and Shallot Hash", "link": "https://www.seriouseats.com/recipes/2012/03/spicy-potato-bok-choy-and-shallot-hash-hangover-helper-recipe.html", "description": "This spicy potato hash with shallot and baby bok choy is easy to make.", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mother's Day", "Potato"], "recipeIngredient": ["1/2 pound (about 2 medium) russet potatoes, peeled, split into quarter lengthwise, and cut into 1/4-inch slices", "2 tablespoons plus 1 teaspoon vegetable oil, divided", "1 large shallot, thinly sliced (about 1/2 cup)", "1/2 pound baby bok choy, rinsed, dried, trimmed, and roughly chopped into 1/2-inch pieces(see note)", "1 finely sliced serrano or Thai bird chili", "1 teaspoon hot sauce (such as Frank's RedHot), or more to taste", "Kosher salt and freshly ground black pepper", "2 eggs", "Hot sauce, Sambal Oelek, or hot pepper relish for serving."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in as thin a layer as possible on a microwave-safe plate. Cover with paper towel and microwave on high power until heated through but still slightly undercooked, about 2 1/2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil in a 10-inch cast iron or non-stick skillet over high heat until lightly smoking. Add potatoes and cook, stirring and tossing occasionally, until well browned on about half of all surfaces, about 4 minutes. Reduce heat if smoking heavily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add shallot and bok choy. Continue to cook, tossing and stirring occasionally, until vegetables are all well browned and charred in spots, about 4 minutes longer. Add sliced chili and hot sauce. Cook, stirring constantly for 30 seconds. Season to taste with salt and pepper. Transfer hash to a warm serving platter and keep warm</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet and add remaining teaspoon oil. Heat over medium heat until shimmering. Add eggs and cook until desired level of doneness is reached. Season with salt and pepper. Place eggs on top of has and serve immediately with hot sauce, Sambal Oelek, or hot pepper relish.</p>"}]}