{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/06/20120611-210232-homemade-pantry-butter.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Alana Chernila", "butter", "Cook the Book", "The Homemade Pantry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Homemade Pantry's Butter", "link": "https://www.seriouseats.com/recipes/2012/06/the-homemade-pantrys-butter.html", "description": "To make butter from the comfort of your home kitchen, all you need is a stand mixer, a pint of cream, and a pinch of salt.  Over the course of just about 15 minutes, the cream whips, stiffens, then separates into butter and buttermilk.", "totalTime": "25 minutes", "recipeYield": "makes 6 to 8 ounces (12 to 16 tablespoons)", "recipeCategory": ["Cook the Book", "Dairy"], "recipeIngredient": ["1 pint (16 ounces) heavy cream", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cream and salt in the bowl of a stand mixer<br />\r\nfitted with the paddle attachment and cover with a dish towel to prevent splattering. Beat at medium to high speed, peeking in every 20 seconds or so. In 1 to 3 minutes, the cream will be whipped and airy, then it will stiffen. After that, the cream will break, and you will have both liquids and solids in the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the fat separates from the buttermilk, pour the buttermilk into a jar and refrigerate to use within 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run your hands under cold water, then squeeze the butter together, kneading it in the bowl. Place the bowl in the sink, rinse the butter in cold water, and squeeze it again. Repeat this process until the water runs clear and the butter does not release any liquid when you press on it.</p>\r\n\r\n<p><strong>Storage:</strong> store at room temperature, in a covered container or butter bell for 5 days in the fridge.  Or roll and cut into sticks, wrap individually in plastic wrap and store in a freezer bag for 3 months.</p>"}]}