{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120301-195206-layer-cake-610x458-20.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cake", "chocolate", "ganache frosting", "Sweet Technique"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Chocolate Cake with Whipped Ganache Frosting", "link": "https://www.seriouseats.com/recipes/2012/03/chocolate-cake-with-whipped-ganache-frosting-recipe.html", "description": "This is a decadent chocolate cake, reminiscent of Devil's Food in flavor and moisture. The whipped chocolate ganache frosting is every chocolate fiend's dream, but take care to watch it carefully: if you beat it too far, it will become chunky rather than smooth and light.", "totalTime": "5 hours", "recipeYield": "serves 8-10", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Cake:</strong>", "17.4 ounces granulated sugar", "12 ounces butter, softened", "3 large eggs, room temperature", "7.5 ounces whole milk", "3.5 ounces boiling water", "2.5 ounces cocoa", "12 ounces cake flour, sifted", "1 teaspoon baking soda", "1 teaspoon salt", "&nbsp;", "<strong>For the Whipped Ganache:</strong>", "24 ounces semisweet chocolate, chopped into small pieces", "1 quart heavy cream", "1 teaspoon salt", "Optional: sea salt for sprinkling on top"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cake:</strong> Preheat the oven to 350&deg;F. If using cake pans, smear a small amount of butter in the bottom of each and line the bottoms with circles of parchment. If baking on a single jelly roll pan, smear an X of butter across the center and line the bottom with parchment. Set the pan(s) aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour, baking soda, and salt together and set aside. Add the boiling water to the cocoa and mix, set aside to cool. In the bowl of a stand mixer fitted with a paddle attachment, cream butter and sugar together on high speed for 6-8 minutes, until very light and fluffy. Add the eggs one at a time and beat will after each addition. Scrape down the sides and bottom of the bowl and the beater and beat on high speed to ensure that the mixture is fully mixed. Stop the mixer, add the cocoa water and half the milk, plus half the dry ingredients. Mix on low until incorporated. Scrape down the mixer, then add the rest of the milk and dry ingredients. Mix thoroughly on low speed, scraping down one more time. Finish mixing with a big rubber spatula by hand, taking care not to overmix. If using cake pans, divide the batter evenly into three, if using the jelly roll pan, pour the batter out and smooth evenly over the sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the layers on the middle rack of the oven for 10 minutes, then carefully turn them and allow them to bake for an additional 10, or until the surface springs back a bit to the touch and the cake pulls away from the sides. Remove the cake from the oven and allow to cool in the pan(s) for 10 minutes. Invert the cakes and pull off the parchment, allow them to cool completely. Cover with plastic wrap to prevent drying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the whipped ganache:</strong> Chop the chocolate very finely and place it in the bowl of a stand mixer. Bring the cream and salt to a boil. Pour the cream over the chocolate and allow it to sit for one minute, then whisk until completely smooth (if you have a hand blender, this makes the process go faster). Chill the ganache uncovered in the fridge for two hours, stirring every twenty minutes. Once the ganache feels cold but is still liquid, remove it from the fridge and attach the bowl to the mixer. Whip using the whisk attachment, slowly at first, gradually increasing speed to high. You will notice the mixture will thicken after about a minute, watch it closely. It will begin to hold soft peaks. Watch for it to get just slightly firmer, and don’t allow it to go any further. Ice the cake with the whipped ganache immediately after making, as it will begin to seize up if left to sit. Refrigerate cake until you are ready to serve, up to one day, allow it to come to room temperature before serving. Sprinkle with sea salt before serving if desired.</p>"}]}