{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121016-226464-chocolate-covered-potato-chips.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate desserts", "potato chips", "quick", "salty and sweet snacks", "snack food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Covered Potato Chips", "link": "https://www.seriouseats.com/recipes/2012/10/chocolate-covered-potato-chips-recipe.html", "description": "The beauty of this recipe is the simplicity: chips + melted chocolate = gooood. You can customize it to you taste&mdash;don't like dark chocolate? Use milk chocolate instead! Use your favorite brand of chocolate or whatever you have on hand. If you love intensely dark chocolate like I do, consider splurging for the good stuff.", "totalTime": "1 to 2 hour (depending on drying time)", "recipeYield": "Serves 1 (ok, maybe more like 4 to 6)", "recipeCategory": ["American Classics", "Appetizers and Hors d'Oeuvres", "Chocolate"], "recipeIngredient": ["5 ounces 72% cacao chocolate, coarsely chopped", "2 (1.875 ounce) bags of kettle cooked potato chips, preferably ruffled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate in a microwave safe bowl. Cover with waxed paper and microwave on high for 30 seconds. Stir chocolate. If all the chocolate hasn't melted completely, continue microwaving and stirring in 10 second intervals until chocolate is fully melted and smooth. Stir for one minute to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the bags of chips and sort out the full chips from the broken pieces. If you're making these for a party you may want to keep the broken ones for pre-party snacking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip chips to cover half to three quarters of the surface. Remove from the chocolate and let any excess drip back into the bowl then set to dry on parchment lined baking sheets in a cool place. Depending on the weather and heat/humidity in your home it may take up to 2 hours for them to fully dry. If you are in a rush, you can place the chips in the refrigerator for 5 to 10 minutes to speed the process. Best when eaten immediately. As soon as the chips are set store in a waxed paper lined tin adding additional wax paper for each layer.</p>"}]}