{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120425-dt-jamie-olivers-steamed-asian-chicken-parcels.jpg", "author": {"@type": "Person", "name": "Blake Royer"}, "recipeCuisine": "", "keywords": ["Asian", "cabbage", "chicken", "Dinner Tonight", "Jamie Olive", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Jamie Oliver's Steamed Asian Chicken \"Parcels\"", "link": "https://www.seriouseats.com/recipes/2012/04/jamie-olivers-steamed-asian-chicken-parcels.html", "description": "While quick chicken recipes are pretty common, many of them can be boring, using the same old techniques with little variation.  But in years of cooking, I've never seen anything quite like this. Raw chicken thighs are blended up with aromatics like ginger, garlic, and scallions to make a paste, which is then quickly folded into cabbage leaves and steamed. It actually comes together far more quickly than you'd think.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cabbage", "Chicken", "Dinner Tonight", "Mains"], "recipeIngredient": ["1 medium savoy or Chinese cabbage", "2 cloves garlic, peeled", "1-inch piece fresh ginger, peeled", "6 scallions, white and light green parts, roughly chopped", "1/4 cup fresh cilantro leaves", "1 to 2 fresh small red chili peppers", "1 tablespoon fish sauce", "4 trimmed boneless skinless chicken thighs, roughly chopped (about 1 pound) ", "1 (8-ounce) can water chestnuts", "2 tablespoons juice and 2 teaspoons grated zest from 2 limes", "1 teaspoon sesame oil", "Your choice of dipping sauce, such as prepared sweet chili sauce, or hoisin thinned with soy sauce", "1 tablespoon toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil. Remove and discard the tough outer leaves of the cabbage, then slice off the root end and separate the leaves.  Plunge them into the boiling salted water to blanch for 2 minutes, then remove to a bowl of cold water to stop the cooking. Drain and set aside. Pour out all but a couple inches of water in the bottom of the pot and place a steamer inside the pot (or place a bamboo steamer on top of the pot).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a food processor, pulse the garlic, ginger, scallions, cilantro, red chilis, fish sauce, and a 1/4 teaspoon of salt until everything is minced.  Add the chicken, water chestnuts, lime zest and juice, and sesame oil.  Process until completey pureed; the result will be a kind of meat paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out the leaves of cabbage on a cutting board and place a small amount (2-3 tablespoons) of the chicken mixture onto the root end of a cabbage leaf. Fold the leaf over once to enclose the chicken, fold both sides in, then roll it once again so that the seam side is down. Repeat with the remaining cabbage leaves and chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water in the bottom of the steaming pot to a boil, then place the parcels seam side down into the basket. Cover and steam until the chicken is cooked through, 6-8 minutes depending on their size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with the dipping sauce and the toasted sesame seeds scatted on top.</p>"}]}