{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120918-beef-trim-sukiyaki-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Japanese", "keywords": ["beef", "Japanese", "japanese food", "offal", "sukiyaki", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beef Trim Sukiyaki", "link": "https://www.seriouseats.com/recipes/2012/09/beef-trim-sukiyaki-recipe.html", "description": "Sukiyaki is a Japanese dish traditionally served with thin shavings of raw beef that are cooked by dipping them in a hot liquid. This version uses rich, fatty beef trim for a heartier take.", "totalTime": "2 hours 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Japanese", "Mains", "Offal", "The Nasty Bits"], "recipeIngredient": ["2 pounds beef scraps (flesh and fat), plus additional bones (see note)", "3 cups sake", "1 onion, halved", "One 3-inch piece of fresh ginger", "1/4 cup soy sauce, plus more for serving.", "1 teaspoon salt", "3 tablespoons mirin", "1 tablespoon sugar", "2 pounds to simmer, such as scallions, daikon, potatoes, cabbage, and shitake mushrooms", "1 (8 ounce) block tofu, cut into slabs", "1 pound udon or shirataki noodles", "4 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut beef scraps into 2-inch pieces.  Rinse under cold water. Place in a large saucepan along with bones. Add water to cover.  Bring to a simmer, skimming off whatever meat scum rises to the surface. When the water is clear, add the sake, the onion, ginger, soy sauce, salt, mirin, and sugar.  Simmer until chunks of beef are tender, about 2 hours. Strain through a fine mesh strainer. Pick out beef pieces and set aside. Skim fat off the top of the broth. Alternatively, let soup cool and refrigerate until fat has solidified on top, then scrape off the fat.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, reheat soup in large saucepan in the kitchen, or on a hotplate in the center of the serving table. Add the vegetables and simmer until tender, 10 to 20 minutes depending on the vegetable.  Add the tofu during the last five minutes of simmering. Add udon or soba noodles, using cooking times directed on the package. Add beef scraps to reheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, beat eggs in individual serving bowls, seasoning to taste with soy sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, either keep broth simmering on a portable stove for the table, or bring the pot to the table. Diners will dip pieces of fatty beef into their individual bowls of egg and soy sauce, along with tofu, vegetables, and noodles.  </p>"}]}