{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/04/20120402-199960-lemon-olive-oil-and-almond-biscotti.jpg", "author": {"@type": "Person", "name": "Caroline Russock"}, "recipeCuisine": "", "keywords": ["Bake the Book", "biscotti", "Cookies", "Dawn Casale and David Crofton", "lemon", "olive oil", "One Girl Cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon, Olive Oil, and Almond Biscotti", "link": "https://www.seriouseats.com/recipes/2012/04/lemon-olive-oil-almond-biscotti-recipe.html", "description": "Made with the very Sicilian combination of almonds, olive oil, and lemon, these biscotti take on the peppery, green notes of the oil. They're rich in a way that's completely different from those baked using butter.", "totalTime": "1 hour", "recipeYield": "makes 48 biscotti", "recipeCategory": ["Cookies", "Desserts", "Lemon"], "recipeIngredient": ["1 cup whole almonds, skins on ", "2 large eggs", "Grated zest of 2 Meyer lemons (see Tips)", "1 cup sugar", "1/2 cup Sicilian olive oil (see Tips)", "1 teaspoon vanilla extract", "2 1/2 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon table salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the almonds on a baking sheet and toast them in the oven for 15 minutes, or until they are well browned and fragrant. Let the nuts cool (leave the oven on). When the almonds are cool enough to handle, put them in a food processor and pulse 5 or 6 times, until ground.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, combine the eggs, lemon zest, sugar, olive oil, and vanilla. Mix on medium speed for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the ground almonds, flour, baking powder, and salt. With the mixer running on low speed, gradually add the flour mixture to the egg mixture, stopping two or three times to scrape down the bowl. Mix until the dough is just beginning to come together. Do not overmix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the dough out onto a parchment paper–lined baking sheet, and shape it into 2 equal logs. The dough should be sticky—you may need to wet your hands slightly with water in order to work with it. Each log should be about as wide as two knuckles on your middle finger and about ½-inch tall. Bake for 14 minutes. Rotate the baking sheet and bake for 14 more minutes. Let the logs cool on the baking sheet for 12 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven temperature to 250°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the logs to a cutting board. Using a serrated knife, slice the<br />\nlogs into ½-inch-thick biscotti. Put the biscotti on the parchment-lined baking sheet, spacing them ½-inch apart. Bake for 7 minutes. Rotate the baking sheet and bake for 7 more minutes, or until the biscotti are slightly crisp on the exposed sides. Transfer them to a wire rack and let<br />\nthem cool completely.</p>\n\n<p><small><strong>Tips:</strong>  If Meyer lemons are not available, you can substitute 2 regular lemons, or even the grated zest of 1 lemon and 1 orange.</p>\n\n<p>The stronger the flavor of your olive oil, the more it will shine through in this recipe.<br />\n</p>"}]}