{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120320-jim-lahey-no-knead.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["Jim Lahey", "no-knead", "no-knead pizza", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3846153846154", "ratingCount": "13"}, "name": "Jim Lahey's No Knead Pizza Dough", "link": "https://www.seriouseats.com/recipes/2012/03/jim-laheys-no-knead-pizza-dough-recipe.html", "description": "Check out the video below for tips on stretching, topping, and baking your dough: This recipe works well with Jim Lahey's No Knead Broccoli Rabe, Garlic, Ginger, and Thai Chili Pizza. Note from Lahey: While I'm not picky about the...", "totalTime": "8 to 18 hours", "recipeYield": "makes 4 balls of dough, enough for 4 pizzas", "recipeCategory": ["Dairy-Free", "Pizza", "Vegan", "Vegetarian"], "recipeIngredient": ["500 grams (17 ½ ounces or about 3 ¾ cups) all-purpose flour, plus more for shaping the dough", "1 gram (1/4 teaspoon) active dry yeast", "16 grams (2 teaspoons) fine sea salt", "350 grams (1 ½ cups) water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, thoroughly blend the flour, yeast, and salt. Add the water and, with a wooden spoon or your hands, mix thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap or a kitchen towel and allow it to rise at room temperature (about 72°F) for 18 hours or until it has more than doubled. It will take longer in a chilly room and less time in a very warm one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour a work surface and scrape out the dough. Divide it into 4 equal parts and shape them: For each portion, start with the right side of the dough and pull it toward the center; then do the same with the left, then the top, then the bottom. (The order doesn’t actually matter; what you want is four folds.) Shape each portion into a round and turn seam side down. Mold the dough into a neat circular mound. The mounds should not be sticky; if they are, dust with more flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you don’t intend to use the dough right away, wrap the balls individually in plastic and refrigerate for up to 3 days. Return to room temperature by leaving them out on the counter, covered in a damp cloth, for 2 to 3 hours before needed.</p>"}]}