{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121224TripleLemonSalmon-edit.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["creme fraiche", "fish", "French in a Flash", "lemon", "light eating", "quick", "salmon", "seafood", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salmon with Thyme and Three-Lemon Crème Fraîche", "link": "https://www.seriouseats.com/recipes/2012/12/salmon-with-thyme-lemon-creme-fraiche-recipe.html", "description": "This salmon roasted with lemon and thyme can be served hot or room temperature with a simple sauce of crème fraîche, thyme, and lemon in three forms: zest, juice, and preserved.", "totalTime": "30 minutes", "recipeYield": "3 to 4 servings", "recipeCategory": ["French", "Lemon", "Mains", "Salmon"], "recipeIngredient": ["1 bunch fresh thyme sprigs, plus 2 teaspoons picked thyme leaves", "1/2 lemon, thinly sliced, plus 1 tablespoon juice and 1 teaspoon zest from the other half", "3 to 4 large boneless skinless salmon filets, about 4 to 6 ounces each", "1 tablespoon olive oil", "Kosher salt and freshly ground black pepper", "2 tablespoons finely chopped preserved lemon (optional, see note)", "1/2 cup crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Line a rimmed baking sheet with aluminum foil. Place thyme sprigs and sliced lemon in a pile in the center of the baking sheet large enough to hold the salmon. Rub salmon on all sides with olive oil and season with salt and pepper. Place salmon on top of thyme/lemon bed and transfer to oven. Roast until the internal temperature registers 125 to 130°F on an instant read thermometer for medium-rare or 140°F for medium, 15 to 25 minutes. Remove from oven and allow to rest at least 5 minutes, or allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the thyme leaves, lemon juice, lemon zest, preserved lemon (if using), and crème fraîche. Season with salt and pepper. Serve the salmon either hot or at room temperature with the lemon sauce.</p>"}]}