{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121207-bakethebook-buttermints.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "buttermints", "candy", "liddabit sweets", "the liddabit sweets cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Buttermints", "link": "https://www.seriouseats.com/recipes/2012/12/buttermints-candy-recipe.html", "description": "If you've ever been to a fair-to-middling dining establishment, you recognize these mints. The resemblance doesn't extend to flavor, however; buttery, sweet and rich, they taste like little bites of frosting.", "totalTime": "40 minutes, plus drying overnight", "recipeYield": "makes 1 1/3 pounds, about 300 half-inch pieces", "recipeCategory": ["Bake the Book", "Candy", "Desserts"], "recipeIngredient": ["8 tablespoons (1 stick/115 grams) unsalted butter, cold, cut into 1-inch chunks", "4 cups (520 grams) confectioners’ sugar, sifted, plus extra for rolling ", "1/4 teaspoon (1 gram) pure peppermint oil", "2 tablespoons (30 grams) whole milk ", "Food coloring (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the butter and the 4 cups confectioners’ sugar in the mixer bowl. Beat on medium-high speed until the mixture is smooth and creamy, 6 to 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the peppermint oil and milk, and beat on medium speed until combined.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust some confectioners’ sugar onto a cutting board, and turn the dough out onto the board. If you’re using food coloring, add 1 to 2 drops (or more for deeper color) and knead it into the dough with your hands until incorporated. If you’re making multiple colors, divide the dough into several pieces first (one for each color) and add the food coloring to each piece, starting with 1 drop and kneading, adding 1 drop at a time, until the desired colors are reached. Gather each piece of dough into a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift more confectioners’ sugar over the cutting board. Divide the dough into 4 pieces (if you haven’t divided it already), and set 3 of the pieces aside, loosely covered in plastic wrap to prevent them from drying out. Using your hands, and dusting them with confectioners’ sugar as needed to reduce any stickiness, gently roll one piece of dough into a log about 1/2 inch in diameter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a sharp chef’s knife to cut the log into ½ inch pieces. Lay the pieces in a single layer on the prepared baking sheet to dry. Repeat with the remaining 3 pieces of dough, and allow the candies to dry at room temperature, uncovered, overnight.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store the buttermints, layered between parchment or wax paper, in an airtight container at room temperature, away from light, for up to 2 weeks. </p>"}]}