{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121101-127677-Huevos-Rancheros-PRIMARY.jpeg", "author": {"@type": "Person", "name": "María del Mar Cuadra"}, "recipeCuisine": "Mexican", "keywords": ["breakfast", "brunch", "cinco de mayo", "egg", "huevos rancheros", "Latin American cuisine", "latin cuisine", "Mexican", "salsa", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Huevos Rancheros With Broiled Tomato Salsa", "link": "https://www.seriouseats.com/recipes/2012/11/huevos-rancheros-recipe.html", "description": "Huevos rancheros&mdash;ranch-style eggs&mdash;are one of Mexico's most instantly recognizable breakfast dishes: a pair of fried eggs topped with a thick layer of spicy tomato sauce. It sounds rather simple, and it is. However, as with all recipes made with only a handful of ingredients, the treatment of each one is important.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Latin Cuisine", "Mains", "Mexican", "Mother's Day", "Vegetarian"], "recipeIngredient": ["1 pound plum tomatoes, cut into 1-inch chunks", "2 serrano chilies, stemmed and seeded (see note)", "6 tablespoons vegetable oil", "Kosher salt and freshly ground black pepper", "1 medium white onion, finely chopped (about 1 cup)", "2 medium cloves garlic, minced (about 2 teaspoons)", "1 1/2 tablespoons cider vinegar", "4 large eggs", "2 to 4 warm flour or corn tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper third position and heat broiler. Line rimmed baking sheet with foil. Place tomatoes and chilies on sheet, drizzle with 2 tablespoons oil, and season with salt and pepper. Toss to coat and arrange in single layer. Broil until tomatoes and chilies begin to char, 8 to 10 minutes, stirring once halfway through cooking. Note that all broilers are different and attention should be paid to the vegetables as they cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer baking sheet to cooling rack and allow to cool 5 minutes. Transfer tomatoes and chilies to food processor and pulse until a chunky, salsa-like consistency is reached.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat additional 2 tablespoons oil in medium skillet over medium heat until shimmering. Add onions and cook, stirring occasionally, until softened and translucent, about 5 minutes. Add garlic and cook until fragrant, about 1 minute. Increase heat to medium-high and add tomato-chili mixture. Cook, stirring occasionally, until liquid is slightly reduced, about 3 minutes. Stir in vinegar and continue cooking until sauce is thick but still juicy, about 2 minutes longer. Season to taste with salt and pepper. Transfer sauce to bowl and cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly wipe out skillet. Heat remaining 2 tablespoons oil over medium-high heat. Add eggs and season with salt and pepper. Once whites begin to turn opaque and set, reduce heat to medium low, cover, and cook until egg yolks reach desired consistency, 2 to 4 minutes. Transfer eggs to plate, cover with sauce, and serve with warmed tortillas.</p>"}]}