{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121109-chichis-chinese-pork-belly-dish.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Chinese", "keywords": ["chichi's chinese", "Chinese", "mains", "pork", "salt-fried pork", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salt-Fried Pork", "link": "https://www.seriouseats.com/recipes/2012/11/salt-fried-pork-recipe.html", "description": "A quick stir-fry of pork belly seasoned with chili bean paste and scallions.", "totalTime": "20 minutes", "recipeYield": "4 as a main dish in a multi-course meal", "recipeCategory": ["Chinese", "Mains", "Pork", "Stir Frying"], "recipeIngredient": ["8 ounces fresh boneless pork belly, skin on", "1 medium-sized leek or 5 green onions, both white and green parts", "2 tablespoons cooking oil", "1 1/2 to 2 tablespoons chiil bean paste", "1 to 2 teaspoons fermented black beans", "1 teaspoon light soy sauce", "1/4 to 1/2 teaspoon sugar", "1/4 to 1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the pork very thinly, into rectangles about 3 by 2 inches.  Cut the leeks on a sharp bias into 1-inch slices.  If you are without a razor-sharp knife, freeze the pork belly for 20 minutes prior to slicing.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Swirl the oil into the wok and place over high heat until shimmering but not yet smoking. Add the slices of pork and stir-fry until the pork is lightly browned and has lost much of its water content, about 4 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil begins to sizzle, move aside the pork slices, grouping them as best you can on one side of the wok. Discard all but 1 tablespoon fat. Lower the heat to medium-low. Add the chili bean paste and fermented black beans into the pool of fat in the center of the wok and stir-fry until fragrant, about 20 seconds. Then allow the pork slices to re-enter the oily mixture, and stir-fry vigorously to incorporate, adding the soy sauce and sugar. Add the leeks or green onions. Continue to stir-fry just until the leeks/green onions are just cooked, about 1 minute. Taste the pork and season with salt if needed. Serve immediately. </p>"}]}