{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/05/20120522-dinner-for-2-little-italy-sausage-n-beans-primary.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["beans", "cassoulet", "Dinner for Two", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Italian 'Cassoulet' with Sausage and Beans", "link": "https://www.seriouseats.com/recipes/2012/05/italian-cassoulet-pork-sausage-broccolini-beans-recipe.html", "description": "A kind of Mulberry Street rendition of cassoulet, this one-pot dinner for two is filled of garlicky sausage, creamy cannellini beans, rosemary, garlic, and broccolini.  Rustic and hearty!", "totalTime": "25 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner for Two", "Mains", "Pork"], "recipeIngredient": ["2 tablespoons olive oil, divided", "About 1 pound of sweet pork sausage links", "1 bunch broccolini, stems chopped into small circles, florets left whole", "1 head of garlic, cloves separated and left in their wrappers", "1/2 teaspoon chopped fresh rosemary", "2 (14-ounce) cans cannellini beans, drained and rinsed", "1 cup of water, vegetable stock, chicken stock, or white wine", "Pinch of chili flakes (optional)", "Kosher salt and freshly ground black pepper", "2 tablespoons chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the oven rack in the center position.  Preheat the oven to 450°F.  In a high-sided sautépan, heat 1 tablespoon of olive oil over high heat until shimmering.  Add the sausages, and cook until lightly browned on bottom, about 1 minute.  Take the pan off the heat, and add the broccolini, garlic, and rosemary, and toss to coat in the oil.  Add the beans, and water (or stock). Add chili flakes, if using. Season lightly with salt and pepper. Nestle everything down into the liquid, and make sure the sausages are poking out on top.  The liquid will only come about halfway up the side of sausages.  Drizzle the top of the pot with the remaining 1 tablespoon of olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pot back on the heat, covered, and bring to a boil.  Lower the heat all the way down, and simmer, covered, for 5 minutes.  Then, remove the lid, and place the whole pot in the oven until sausages are cooked through, about 15 minutes.  To get sausages extra brown, broil for the last 2 minutes. Remove from oven, let cool slightly, season to taste with salt and pepper, sprinkle with parsley, and serve directly from skillet.<br />\n</p>"}]}