{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20120710BeefFilet.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Italian", "keywords": ["Dinner for Two", "Italian", "marinara", "pasta", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fresh Rigatoni with Marinara and Steak", "link": "https://www.seriouseats.com/recipes/2012/07/fresh-rigatoni-and-steak-bolognese-recipe.html", "description": "Meaty, light, easy, and so satisfying: fresh pasta tossed with a doctored up sauce full of veggies and topped with roasted thinly sliced beef.", "totalTime": "30 minutes", "recipeYield": "2 servings with leftovers", "recipeCategory": ["Beef", "Dinner for Two", "Italian", "Mains", "Pasta"], "recipeIngredient": ["1 8 ounce beef tenderloin steak, flap meat steak, or hanger steak", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil", "1 medium carrot, roughly chopped (about 3/4 cup)", "1 small yellow onion, roughly chopped (about 1 cup)", "4 cloves garlic", "2 tablespoons olive oil", "1 tablespoon fresh thyme leaves", "2 cups jarred <a href=\"http://www.seriouseats.com/2012/04/what-are-best-tomato-sauces-pasta-celebrity-chefs-brands.html\">jarred tomato sauce</a>", "1 pound rigatoni pasta", "Grated Parmigiano Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the oven rack in the top third of the oven, and preheat oven to 450°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the beef dry with a paper towel and season generously on all sides with salt and pepper. Heat vegetable oil in a small skillet over high heat until smoking. Place steak in skillet and cook until well-browned on first side, about 2 minutes. Flip and transfer to oven. Roast until steak registers 125° to 130° on an instant read thermometer, 4 to 6 minutes.  Remove the steak to a cutting board, cover loosely with foil, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine carrot, onion, and garlic in bowl of food processor and pulse until finely chopped, scraping down sides as necessary (about 20 one-second pulses). Alternatively, chop finely with a knife or grate on a box grater.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a high-sided sautépan over medium heat until shimmering. Add vegetables and thyme.  Season with salt and pepper, and cook until soft and fragrant, stirring often, for about 8 minutes.  Add the tomato sauce and ½ cup of water. Bring to a boil, reduce to a simmer, and cook for 15 minutes, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil and cook pasta according to package instructions, reducing cook time by one minute (pasta should still be just short of al dente). Add the pasta to the sauce, and keeping the pot still over low heat, gently toss the pasta and sauce together until most of the sauce is absorbed, the bottom of the pan is nearly dry, and the pasta is fully cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the pasta out into a serving dish, and top with grated Parmesan.  Thinly slice the steak, and arrange it over the top.</p>"}]}