{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/10/20121015-226083-cook-the-book-banana%20-flower-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["burma: rivers of flavor", "Cook the Book", "fried shallots", "Naomi Duguid", "shallot oil"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Naomi Duguid's Fried Shallots and Shallot Oil", "link": "https://www.seriouseats.com/recipes/2012/10/naomi-duguids-fried-shallots-and-shallot-oil.html", "description": "Crisp fried shallots are essential garnishes on many dishes in <em><a href=\"http://www.amazon.com/Burma-Rivers-Flavor-Naomi-Duguid/dp/1579654134/?tag=serieats-20\">Burma: Rivers of Flavor</a></em>. Once its been used for frying, you can save the shallot-flavored oil to drizzle over countless dishes. Here, it's used on top of <a href=\"http://naomiduguid.com/#_\">Naomi Duguid's</a> <strong><a href=\"http://www.seriouseats.com/recipes/2012/10/naomi-duguids-banana-flower-salad-rakhine-sty.html\">Banana Flower Salad</a></strong>.", "totalTime": "40 minutes", "recipeYield": "makes 3/4 cup oil and about 1 1/4 cups fried shallots", "recipeCategory": ["Condiments and Sauces", "Cook the Book"], "recipeIngredient": ["1 cup peanut oil", "2 cups (about 1/2 pound) thinly sliced Asian or European shallots "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a wide heavy skillet or a large stable wok over medium-high heat and add the oil. Toss in a slice of shallot. As the oil heats, it will rise to the surface, sizzling lightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When it’s reached the surface, add the rest of the shallots, carefully, so you don’t splash yourself with the oil, and lower the heat to medium. (The shallots may seem crowded, but they’ll shrink as they cook.) Stir gently and frequently with a long-handled wooden spoon or a spider. The shallots will bubble as they give off their moisture. If they start to brown early, in the first 5 minutes, lower the heat a little more. After about 10 minutes, they should start to color. Continue to cook, stirring occasionally to prevent them from sticking to the pan or to each other, until they have turned a golden brown, another 3 minutes or so. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a plate with paper towels. Use tongs or a spider to lift a clump of fried shallots out of the oil, pausing for a moment to shake off excess oil into the pan, then place on the paper towel. Turn off the heat, transfer the remaining shallots to the plate, and blot gently with another paper towel. Separate any clumps and toss them a little, then let them air-dry 5 to 10 minutes, so they crisp up and cool. (If your kitchen is very hot and humid, they may not crisp up; don’t worry, the flavor will still be there.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the shallots to a clean, dry, widemouthed glass jar. Once they have cooled completely, seal tightly. Transfer the oil to another clean dry jar, using all but the very last of it, which will have some stray pieces of shallot debris. (You can set that oil aside for stir-frying.) Once the oil has cooled completely, cover tightly and store in a cool dark place. </p>"}]}