{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/03/20120307-196047-knead-the-book-whole-wheat.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "bread baking", "Kneadlessly Simple", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kneadlessly Simple's 100% Whole Wheat Honey Bread", "link": "https://www.seriouseats.com/recipes/2012/03/kneadlessly-simples-100-whole-wheat-honey-bread-recipe.html", "description": "[Photograph: Donna Currie] Adapted from Kneadlessly Simple by Nancy Baggett. Copyright © 2009. Published by Wiley. Available wherever books are sold. All Rights Reserved...", "totalTime": null, "recipeYield": "makes 1 large loaf, 12 to 14 slices", "recipeCategory": ["Bread", "Bread Baking"], "recipeIngredient": ["1 cup plus 2 tablespoons boiling water", "1⁄3 cup clover honey or other mild honey", "3 1⁄2 cups (17.5 ounces) whole wheat flour or white whole wheat flour, divided, plus more as needed", "1 1⁄2 teaspoons table salt", "1 1⁄4 teaspoons instant, fast-rising, or bread machine yeast", "3⁄4 cup plus 2 tablespoons ice water, plus more if needed", "2 1⁄2 tablespoons corn oil, canola oil, or other flavorless vegetable oil, plus more for coating dough top and pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the First Rise</strong>: In a 2-quart microwave-safe bowl, make a mash by vigorously stirring the boiling water and honey into 1 cup (5 ounces) of the whole wheat flour until well blended and smooth. Cover with microwave-safe plastic and place in the microwave oven. Set a cup of boiling-hot water in the oven to help keep it warm. After 15 minutes, reheat the mash and hot water by microwaving on high power for 1 minute. Thirty minutes later, again reheat by microwaving on high power for 1 minute. Then let the mash stand, covered, in the microwave, until completely cooled. Set aside at room temperature for up to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, thoroughly stir together 2 cups (10 ounces) of the flour, the salt, and the yeast. In another bowl or measuring cup, whisk together the ice water and oil, then stir the mixture into the bowl with the flour until smooth and well blended. If the mixture is dry, add just enough more water to facilitate blending and produce a firm but not stiff dough. Brush or spray the top with oil. Tightly cover the bowl with plastic wrap. If desired, for best flavor or for convenience, refrigerate for 3 to 10 hours. Then let rise at cool room temperature for 12 to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Second Rise</strong>: Thoroughly stir the cooled mash mixture, then 1/2 cup (2 1/2 ounces) of the flour, into the dough, vigorously mixing until very thoroughly blended; if desired, use a dough hook and heavy-duty mixer on low, as this is tiring to do by hand. If necessary, using flour-dusted fingertips or the mixer, sprinkle over and work in enough more flour to yield a very stiff dough. Coat a 95-inch loaf pan with nonstick spray, then add 1 tablespoon flour, tipping the pan back and forth to evenly coat the ­interior.<br />\nUsing a well-oiled rubber spatula, fold the dough in towards the center, working your way around the bowl. Invert the dough into the pan. Brush or spray the dough with oil. Smooth out the top and evenly press the dough into the pan with oiled fingertips; for best appearance, tuck the dough evenly underneath at the ends. Evenly dust the loaf with H tablespoon whole wheat flour; smooth it evenly over the loaf top. Cover the pan with nonstick spray–coated plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Two Different Rising Methods</strong>: For a 2- to 4-hour regular rise, let stand at warm room temperature; for a 1H- to 2H-hour accelerated rise, let stand in a turned-off microwave along with 1 cup of boiling-hot water. Remove the plastic when the dough nears it, then continue the rise until dough extends I inch above the pan rim.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>When Ready To Bake</strong>: 15 minutes before baking time, put a rack in the lower third of the oven; preheat to 375ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake on the lower rack for 50 to 55 minutes, or until the loaf is well browned and firm on top; if the top begins to over-brown, tent with foil. Bake for about 10 minutes longer, until a skewer inserted in the thickest part comes out with just a few particles clinging to the end (or until the center registers 206º to 208ºF on an instant-read thermometer). Then bake for 5 to 10 minutes more to ensure the center is done. Cool in the pan on a wire rack for 10 minutes. Turn the loaf onto the rack; cool thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The loaf slices best when cool. Cool completely before storing airtight in plastic or foil. The bread will keep at room temperature for 3 days, and may be frozen, airtight, for up to 2 months.</p>"}]}