{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/09/20120925-nasty-bits-pig-parts-sugo-pasta.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Italian", "keywords": ["Italian", "pasta", "pasta sauces", "pork", "sauces", "sugo", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pig Parts Sugo", "link": "https://www.seriouseats.com/recipes/2012/09/pig-parts-sugo-recipe.html", "description": "Sugo is usually made with guanciale, unsmoked pork jowl, but I wanted to see what would happen if I used any smoked pork, plus a fresh cut. The results were mighty good. The fresh cuts, especially the ones with skin, gave some nice body to the sauce. The smoked parts added depth.", "totalTime": "1 1/2 hours", "recipeYield": "serves 6", "recipeCategory": ["Italian", "Mains", "Pasta", "Pork", "The Nasty Bits"], "recipeIngredient": ["1/4 pound smoked pig’s tails, necks, and hocks (or guanciale if you prefer unsmoked meat)", "6 medium cloves of garlic, smashed", "1 medium onion, diced (about 1 cup)", "1 tablespoon dried red chili peppers, optional", "1 (28-ounce) can tomatoes whole peeled tomatoes packed in juice, roughly broken up with fingers", "1 pound fresh hock, trotters or necks", "Up to 2 cups low-sodium store-bought or homemade chicken broth", "Kosher salt and freshly ground black pepper", "Pecorino Romano or Parmigiano-Reggiano to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the smoked parts briefly, then pat dry and place in a 3-quart sauté pan. Place pan over low heat and cook, turning occasionally, until fat begins to render out, about 10 minutes. Increase heat to medium high and add onions and garlic. Cook, stirring frequently, until translucent, about 4 minutes. Add dried red chili peppers, if using.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatoes along with their juice, then add the fresh pork parts. Add enough broth to barely cover the pork. Bring to a boil, then reduce to a bare simmer. Cook with cover slightly ajar, stirring occasionally, until pork parts are tender, 2 to 3 hours. When pork is tender, increase heat to high and cook, stirring frequently, until sauce has reduced to a rich, thick consistency. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and allow parts to cool in sauce until cool enough to handle. Transfer the parts to a cutting board and pick through them to remove any bone or bits that are too fatty. Chop meat and cartilage roughly and return it to the pot. Season to taste with salt and pepper. Sugo can be served immediately or for best flavor, store for up to five days in the refrigerator. Serve hot sugo with grated Pecorino or parmesan over a thick, robust pasta like penne rigate, tagliatelle, or pappardelle.</p>"}]}