{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130706-258418-SpicyGreenBeanSalad.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["green beans", "lunch box", "make ahead", "quick", "tofu", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Spicy Green Bean Salad with Sesame-Lime Tofu", "link": "https://www.seriouseats.com/recipes/2013/07/make-ahead-spicy-green-bean-salad-with-sesame-lime-tofu-recipe.html", "description": "Baked tofu won't dry out the next day or get sad and shriveled like fried tofu can. A trip under the broiler yields a crunchy, chewy crust; here it's bolstered by a thick coating of sesame seeds. A spicy green bean salad makes a straightforward, refreshing accompaniment, and can be mixed and matched with whatever's in your fridge.", "totalTime": "30 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Dairy-Free", "Legumes", "Lunch Box", "Mains", "Salads", "Tofu", "Vegan", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 (14 ounce) box extra-firm tofu", "Kosher salt", "8 to 10 ounces green or wax beans, ends trimmed", "1 zucchini, halved crosswise, cut into thin strips", "2 tablespoons lime juice from about 2 limes", "1 tablespoon toasted sesame seeds", "3 ounces pea shoots", "1 tablespoon soy sauce", "1/2 teaspoon red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place block of tofu on paper towels; weigh down with plate and large heavy cans to squeeze out excess liquid for 10 to 15 minutes. Meanwhile, preheat broiler to high heat. Bring pot of salted water to boil; blanch beans and zucchini until tender-crisp and bright green, about 30 seconds, then transfer to a strainer and rinse under cold water until chilled. Dry carefully.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut tofu into 1 ½-inch cubes and toss with 1 tablespoon lime juice. Transfer to foil-lined greased baking sheet and sprinkle with salt and sesame seeds. Broil until browned, 5 to 7 minutes, then flip and continue until browned on other side. Whisk together remaining lime juice, soy sauce and pepper flakes. Toss pea shoots, zucchini, peans, and tofu together. Dress with sauce and serve immediately, or reserve separately and pack for lunch the next day.</p>"}]}