{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130311-very-small-anna-cappuccino-cupcakes.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["cakes", "cappuccino cupcakes", "cupcakes", "from the pastry dungeon", "meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cappuccino Cupcakes", "link": "https://www.seriouseats.com/recipes/2013/03/cappuccino-espresso-cupcakes-recipe.html", "description": "Cappuccino cupcakes with a cappuccino meringue topping.", "totalTime": "90 minutes", "recipeYield": "Makes 18", "recipeCategory": ["Cakes", "Very Small Anna"], "recipeIngredient": ["<strong>For the Cupcakes</strong>:", "1/2 cup (4 ounces) milk", "1/3 cup instant espresso", "1 cup (8 ounces) unsalted butter, room temperature", "2 cups (about 14 ounces) sugar", "4 eggs", "1 teaspoon vanilla extract", "2 cups (about 10 ounces) all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon salt", " ", "<strong>For the Frosting</strong>:", "4 egg whites", "1 cup (about 7 ounces) sugar, divided", "1/4 teaspoon white vinegar", "Pinch salt", "1 1/2 tablespoon nonfat dry milk powder", "1 teaspoon instant espresso powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cupcakes</strong>: Combine milk and espresso powder in a small saucepan and heat over medium heat until steaming. Remove from heat, whisk until powder is fully dissolved and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a rack in center of oven and preheat to 350&deg;F. In bowl of stand mixer or in medium mixing bowl with handheld mixer, cream butter and sugar until light and fluffy. Add eggs one at a time, beating to fully incorporate and scraping bowl often. Beat in vanilla. In a separate bowl, whisk or sift together flour, baking powder and salt, then add to batter alternately with milk mixture, beginning and ending with dry mixture. Scrape bowl thoroughly between additions. Don't panic if batter looks curdled, it will bake up fine. Line muffin tins with cupcake papers and fill each one 2/3 full. Bake for 15 minutes, then turn and bake another 5. A cake tester or paring knife inserted should come out clean. Be careful not to overbake as these cupcakes easily dry out. Allow to cool fully before frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting</strong>: Combine egg whites, 3/4 cup sugar, vinegar and salt in a medium mixing bowl or stand mixer bowl. Set over simmering water, making sure bowl doesn't touch the water. Whisk occasionally until sugar is melted and egg whites are hot to the touch. While egg whites are heating, whisk milk powder into remaining 1/4 cup sugar. Once egg whites mixture is ready, remove and whip with electric handheld mixer or whip attachment on stand mixer on second highest speed. Once foamy, pour in sugar and milk powder mixture in continuous stream, then whip on highest speed until meringue holds stiff peaks. Remove 1/4 of meringue to a medium mixing bowl and fold in espresso powder. Don't worry about deflating meringue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Decorate</strong>: Using a butter knife or small offset spatula, spread meringue onto each cupcake. Dip paring knife into espresso meringue and trace a spiral on top of each cupcake, then drag through spiral from outside to center at several points to create a spiderweb pattern. Serve cupcakes immediately or store in a sealed container for up to 3 days at room temperature.</p>"}]}