{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130206-very-small-anna-pb-cake-step-3.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["banana", "cake", "meringue", "peanut butter", "very small anna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peanut Butter-Banana Cake", "link": "https://www.seriouseats.com/recipes/2013/02/peanut-butter-banana-layer-cake-recipe.html", "description": "If you like sticky sweet all-American flavors, this is the dessert for you. It's a little bit of work to put together but it will definitely impress and it makes a great birthday cake.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Banana", "Cakes", "Nuts", "Very Small Anna"], "recipeIngredient": ["<strong>For the Jam</strong>:", "6 medium sized ripe bananas", "1 cup sugar", "1/4 cup water", "1 vanilla bean, split and scraped", "2 tablespoons juice from 1 lemon", " ", "<strong>For the Cake</strong>:", "1 1/4 cups (2 1/2 sticks) unsalted butter", "1 cup (about 8 ounces) smooth peanut butter", "2 cups sugar", "2 eggs", "1 tablespoon vanilla extract", "1 cup (about 5 ounces) all purpose flour", "1 1/4 cup (about 5 ounces) cake flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup (about 4 ounces) buttermilk", "1 1/4 cup (10 ounces) hot water", " ", "<strong>For the Frosting</strong>:", "4 egg whites", "1 cup (about 7 ounces) sugar", "1/2 teaspoon cream of tartar or juice of 1/2 lemon", "1 tsp vanilla extract", "Crushed peanut brittle or honey roasted peanuts (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Jam</strong>: Place a small white plate in the freezer to chill. Peel and slice bananas thinly and place in a stock pot. Add sugar, water, vanilla bean, and lemon juice, and turn heat to high. Cook, stirring often. Once sugar is dissolved and mixture boils, reduce heat to medium-low and simmer, stirring often, for at least 20 minutes. At this point begin testing the jam for doneness; place a small amount of jam on the plate and place in freezer. Allow to chill, then test for runniness. Repeat every 5 minutes until jam is thick. Immediately remove from heat and scrape jam into a medium mixing bowl. Place in refrigerator to cool, then scrape into an airtight container. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Cake</strong>: Set a rack in center of oven. Preheat oven to 350&deg;F. Cut a piece of parchment paper to fit into the bottom of a buttered 18- by 13-inch rimmed baking sheet. Set aside. In the bowl of a stand mixer fitted with a paddle attachment, cream together butter, peanut butter, and sugar at medium speed until light and fluffy, about 2 minutes. Add eggs one at a time followed by vanilla, scraping beater and bowl thoroughly between additions. Combine flours, baking soda and salt and whisk or sift together. Combine buttermilk and hot water. Add the dry and wet mixes to the creamed ingredients in alternate additions, beginning and ending with the dry and scraping thoroughly in between additions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into prepared pan and spread evenly with a large offset spatula. Bake for 20 minutes, then turn the pan and bake until a skewer inserted in the middle comes out clean, 10 to 15 minutes longer. Remove from oven and allow to cool to room temperature before wrapping in plastic and refrigerating at least 30 minutes. Cake may have an unevenly domed top at this point, this is normal and should return upon cooling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cake, cut three 6-inch circles out of cake as close to the center as possible. Remove any cake around the circles and save scraps for trifles or snacks. With a large offset spatula, carefully separate the bottoms of the layers from the parchment. If the cake is too delicate for you to move confidently, chill in refrigerator or freezer until firmer. Remove one layer to a cake board or plate and spread with banana jam evenly and all the way to the edge, in a layer 1/4 to 1/2-inch thick. Top with another layer and repeat. Once cake is assembled, move to refrigerator. (See note.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting:</strong>: Combine egg whites, sugar, cream of tartar or lemon juice, and vanilla in bowl of stand mixer fitted. Suspend bowl over simmering water, whisking constantly by hand, until sugar dissolves and mixture is slightly foamy and hot to the touch. Move to mixer fitted with whisk attachment and whisk on highest speed to stiff peaks, about 1 minute. Generously dollop a large amount of meringue on top of cake and spread evenly around top and down sides of cake. Continue adding meringue to the sides and smoothing until completely covered, then even up the top. If you wish, transfer some remaining meringue to a piping bag or Ziploc bag with or without a star tip and pipe 8 kisses or rosettes evenly around the perimeter of the top. Fill center of top with brittle or peanuts, if desired. When slicing, be sure to wipe the blade of your knife with a damp towel between cuts to keep the frosting neat.</p>"}]}