{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131007-268849-dinner-tonight-pepper-egg-sandwich.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["bell pepper", "cheese", "easy", "egg", "quick", "sandwich", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pepper and Egg Sandwich", "link": "https://www.seriouseats.com/recipes/2013/10/pepper-and-egg-sandwich-recipe.html", "description": "When putting together the Chicago Food Glossary, a number of people chimed in that I had forgotten to include the <strong>pepper and egg sandwich</strong>, which was apparently a staple at hot dog stands during Lent. All the talk finally got me interested in a sandwich I'd always considered humble and, well, kind of boring. Perhaps I was missing something.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Dinner Tonight", "Eggs", "Sandwiches", "Vegetarian"], "recipeIngredient": ["4 sandwich rolls  ", "2 tablespoons canola oil ", "1 green bell pepper, stemmed, seeded, cut into 1/4-inch slices ", "1 red bell pepper, stemmed, seeded, cut into 1/4-inch slices ", "1/2 medium onion, thinly sliced (about 1/2 cup)", "6 eggs", "2 ounces shredded Gruyère cheese", "Kosher salt and freshly ground black pepper", "2 medium garlic cloves, minced (about 2 teaspoons)", "Hot sauce, ketchup, or other condiments as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust rack to middle position and preheat oven to 400&deg;F. Wrap each roll in aluminum foil and set on a baking sheet. Transfer to the oven to warm while preparing the rest of the meal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large cast-iron skillet over high heat until barely smoking. Add green and red bell peppers and onions. Cook, stirring often, until they start to blacken in spots and soften, 5 to 8 minutes. Season with a pinch of a salt. Reduce heat to medium low, and let the pan cool down for 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pan is cooling, crack the eggs into a bowl and whisk until combined. Stir in the cheese and a pinch of salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic to skillet and cook until fragrant, about 30 seconds. Pour in the eggs and let cook for 10 seconds before stirring. Continue stirring every ten seconds until eggs have set but are still relatively soft. Turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove rolls from the oven. Slice each roll horizontally along one side, leaving the other long side still attached. Use your hands to remove some excess bread in the middle if necessary. Scoop some of the egg and pepper mixture in each roll.Top with condiments as desired and serve.</p>"}]}