{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130218-skillet-suppers-kale-pasta.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["broccoli rabe", "One Pot Wonder", "pasta", "quick", "sausage", "skillet suppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Skillet Orecchiette with Sausage and Broccoli Rabe", "link": "https://www.seriouseats.com/recipes/2013/02/skillet-orecchiette-with-sausage-broccoli-rabe-recipe.html", "description": "Pasta with broccoli rabe and sausage is an Italian classic. Our version gets all the flavor and texture of the real deal, all in a single skillet and under half an hour.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Mains", "One-Pot Wonders", "Pasta", "Stovetop"], "recipeIngredient": ["1 tablespoon olive oil", "1 pound spicy Italian-style chicken or pork sausage", "1 pound broccoli rabe, coarse stems removed and leaves roughly chopped", "2 cloves garlic, minced or grated with a Microplane (about 2 teaspoons)", "Pinch red pepper flakes (optional)", "4 cups homemade or store-bought low sodium chicken broth", "3 cups whole wheat or regular dried orecchiette", "Kosher salt and freshly ground black pepper", "2 tablespoons fresh squeezed juice and 1 teaspoon zest from 1 lemon", "½ cup grated Parmesan cheese (about 1 ounce)", "Homemade or store-bought breadcrumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 12-inch skillet over medium-high heat until shimmering. Add the sausage and cook, breaking it apart, until no longer pink, 3 to 4 minutes. Transfer sausage to a plate. Add broccoli rabe and sautée until just beginning to wilt, about 2 minutes. Add to plate with sausage. Drain all but 1 tablespoon fat. Add the garlic and pepper flakes (if using) and cook, stirring constantly until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the broth, scraping up any browned bits from the bottom of the pan with a wooden spoon. Add the pasta and adjust heat to maintain strong, active bubbles. Cook until just not quite tender, 7 to 9 minutes minutes, maintaining active bubbles in the liquid. Return broccoli rabe and sausage to pan and continue to cook, stirring occasionally to prevent pasta from sticking, until pasta is fully cooked and broccoli is tender, about 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat, season with salt and pepper, and stir in lemon juice and zest. Stir in the cheese, place into serving bowls and top with the breadcrumbs. Serve</p>"}]}