{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130403-246148-british-bites-yorkshire-pudding.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "quick", "Yorkshire pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Yorkshire Pudding", "link": "https://www.seriouseats.com/recipes/2013/04/yorkshire-pudding-recipe.html", "description": "Arguably the most famous of the British puddings, Yorkshire pudding always makes an impressive side to serve along a perfectly cooked roast beef. But what happens if you don't have a pan of hot beef drippings to make your Yorkshire pudding in? Don't fret! You can make Yorkshire pudding in a variety of fats, taking this special occasion pudding to a fantastic side (or meal) you can make any night of the week.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["British Bites", "Sides"], "recipeIngredient": ["1 cup (5 ounces) all-purpose flour", "1/4 teaspoon kosher salt", "4 eggs, beaten", "1 cup (8 ounces) milk", "1/2 cup fat (vegetable oil, bacon fat, rendered chicken fat, lard, or beef drippings)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 450°F. Whisk together flour and salt, and in a second bowl, whisk together eggs and milk. Slowly whisk flour mixture into egg mixture until you have a smooth batter with no lumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide fat between the muffin cups, or pour into a large roasting pan. Place the pan in the oven and heat until oil begins to smoke, about 10 minutes. Divide the batter between the muffin tins, filling them up about 1/3 of the way. (Reserve any extra batter for a second batch. If using a roasting pan, pour all batter in at once). Cook until batter is puffed and golden, 10 to 12 minutes. Remove from oven and serve immediately.</p>"}]}