{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130430-bakethebook-tartlets.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "individual desserts", "strawberries", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quickie Strawberry Tartlets", "link": "https://www.seriouseats.com/recipes/2013/05/quickie-easy-strawberry-tartlets-recipe.html", "description": "<strong><em>Old School Comfort Food</em></strong> eschews tart dough and fussy filling, using crisp tuile shells and sour cream in their stead. Topped with macerated strawberries and eat immediately.", "totalTime": "60 minutes", "recipeYield": "makes 30 to 35 tartlets", "recipeCategory": ["Bake the Book", "Desserts", "Ice Cream and Frozen Treats", "Pies, Tarts, and Crumbles", "Strawberry"], "recipeIngredient": ["1 lemon", "1/4 cup granulated sugar", "1 pound small to medium strawberries, hulled and sliced 1/4 inch thick", "1 cup confectioners’ sugar", "1/2 cup all-purpose flour", "2 tablespoons unsalted butter, melted", "1/4 cup orange juice, not fresh squeezed", "Cooking spray", "1/2 to 3/4 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the fruit: Using a vegetable peeler and a light touch, remove the zest from half of the lemon. Try to remove the zest in small pieces and leave the pith (the white part) behind. Juice the lemon into a medium bowl and mix in the zest, granulated sugar, and strawberries. Cover the bowl and refrigerate until ready to assemble the tarts.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375ºF.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the batter: Using a fine-mesh strainer or sifter, sift together the confectioners’ sugar and flour into a medium bowl. Use your hands to push the sugar and flour through the strainer to make sifting easier. Whisk in the butter and orange juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a cookie sheet or invert a rimmed, baking sheet onto the counter, making sure the bottom is clean. Coat with a thin layer of cooking spray. Spoon a generous teaspoon of the batter near the corner of the sheet and use a small offset spatula to spread it thinly into a small, imperfect oval, about 3 1/2- by 2 1/2- inches. Take care to leave about an inch between the ovals because they will spread a bit when they are baked. You should be able to fit about 10 on the sheet at one time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the tart shells: Have ready a mini muffin tin or clean egg carton. Put the tuiles in the oven and bake until light brown, 8 to 11 minutes. Remove the baking sheet from the oven and while the tuiles are still warm, use an offset spatula to transfer a tuile from the baking sheet to the muffin tin. Using your fingers, press down in the center to create a shell that mimics the shape of each muffin cup. The sides will overlap or be higher than the muffin cup. That’s fine. Your goal is to make a mini tart shell to fill with the strawberries. Repeat with the remaining tuiles, working with only one at a time. If the tuiles cool too much on the baking sheet before molding and aren’t flexible, return the sheet to the warm oven for a minute to loosen them up before continuing. Let the tart shells cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Glaze the berries: Strain the liquid from the strawberries and pour it into a small pan. Simmer over medium heat to reduce until it becomes syrupy and reduced by half, about 4 minutes. Allow to cool slightly, then pour it back over the strawberries, and toss to blend. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the tarts: Remove the shells from the muffin tin. Put a small dollop of sour cream in the bottom of each shell and top with some of the strawberries. Assemble and then eat immediately. They become soggy quickly.</p>"}]}