{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130828-bakethebook-coffeecake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["breakfast sweet", "cake", "coffee", "coffee cake", "sweet"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blum's Coffee Crunch Cake", "link": "https://www.seriouseats.com/recipes/2013/09/blums-coffee-crunch-cake.html", "description": "A coating of coffee-flavored honeycomb candy adds a melting crunch that contrasts beautifully with coffee whipped cream.", "totalTime": "", "recipeYield": "serves 8", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Cakes"], "recipeIngredient": ["<strong>Chiffon Cake</strong> ", "1 1/4 cups (6.25 ounces) all-purpose flour", "1 1/2 cups (10.5 ounces) sugar", "1/2 teaspoon kosher salt", "5 large eggs, separated, plus 2 large egg whites", "2 tablespoons water", "1/4 cup (2 ounces) canola oil", "1 teaspoon vanilla extract", "1 teaspoon cream of tartar", "1 teaspoon grated lemon zest", "1 tablespoon lemon juice", " ", "<strong>Coffee Crunch</strong>", "2 1/4 cups (15.75 ounces) sugar", "1/3 cup (2.66 ounces) strong brewed coffee", "1/3 cup (3.75 ounces) light corn syrup", "1 1/2 tablespoons baking soda", " ", "<strong>Coffee Whipped Cream</strong>", "2 1/2 cups (20 ounces) well-chilled heavy cream", "2 1/2 tablespoons sugar", "2 1/2 teaspoons vanilla extract", "2 1/2 teaspoons instant coffee granules"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Cake:</strong> Position a rack in the center of the oven and heat the oven to 350°F. Coat the bottom and sides of a 9-inch round cake pan with a removable bottom with nonstick baking spray.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, 3/4 cup of the sugar, and the salt into a medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the whisk attachment (or in a large bowl, using a handheld mixer), whip the yolks and 1/4 cup sugar on medium speed until thick and pale yellow, about 4 minutes. Gradually add the water, oil, and vanilla, mixing well. If using a stand mixer, transfer the mixture to a large bowl and wash and dry the mixer bowl and whisk (or wash the beaters).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg whites to the large mixer bowl (or another bowl) and beat until frothy. Add the cream of tartar and continue beating until the egg whites form soft peaks. Add the remaining 1/2 cup sugar and beat until stiff, glossy peaks form. Add the lemon zest and juice and beat just until incorporated, about 15 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a rubber spatula, fold the yolk mixture into the egg whites. Gradually fold in the dry ingredients, approximately 1 cup at a time, until fully incorporated.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared cake pan and smooth the top with a spatula. Bake the cake for 55 minutes to 1 hour, until it is golden brown and a toothpick inserted in the center comes out clean.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cake cool completely on a cooling rack, about 45 minutes (removing the cake when it is still warm will cause it to deflate and likely tear).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run an offset spatula around the sides of the cake to loosen it from the pan. Holding the rim of the pan with one hand, press the bottom of the pan up and out. Run an offset spatula between the cake and the bottom to release it. Wrap the cake in plastic wrap and refrigerate until you are ready to assemble the cake. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Coffee Crunch:</strong> Attach a candy thermometer to the side of a 4- to 6-quart heavy pot. Add the sugar, coffee, and corn syrup to the pot and cook over medium-high heat, stirring occasionally with a heatproof silicone spatula until the mixture reaches 270°F, about 10 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heavily coat a 13-by-18-by-1-inch baking sheet with nonstick baking spray. Measure the baking soda into a ramekin or cup and place near the stovetop, along with a large whisk.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the crunch reaches 270°F, increase the heat to high and stir constantly until the crunch reaches 305°F. Remove from the heat and quickly whisk the baking soda into the crunch; the mixture will expand and aerate quickly, in a matter of seconds. Pour the crunch onto the baking sheet. Allow the crunch to cool, undisturbed, for at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a cleaver or other heavy knife, chop the crunch into quarter-sized pieces. (The crunch can be made ahead and stored in an airtight container at room temperature for up to 2 weeks.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Coffee Whipped Cream:</strong> Combine the heavy cream, sugar, vanilla, and coffee in a large bowl and whip with a handheld mixer until medium peaks form.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Place the cake on a turntable or cake stand and, using a long serrated knife, slice the cake horizontally in half. Remove the top half and place cut side up on a plate. Cover both halves with whipped cream, using approximately 1/2 cup per side. Scatter 1 cup of the crunch evenly to cover the bottom half. Place the top half, cream side down, on the top of the crunch layer and press gently to even the layers. Frost the sides and top of the cake with the remaining whipped cream. Refrigerate until ready to serve.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve the cake, cover the sides and top with the remaining crunch (if you apply the crunch in advance, it will start to melt and lose its bite).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This cake is best enjoyed the day it is assembled. Store it in a cake box or under a cake dome in the refrigerator. <br />\r\n</p>"}]}