{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130317-244853-bar-bites-pan-con-tomate.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "Spanish", "keywords": ["bar bites", "pan con tomate", "quick", "spanish", "tapas", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan con Tomate (Spanish-style Toast with Tomato)", "link": "https://www.seriouseats.com/recipes/2013/03/pan-con-tomate-tapas-recipe.html", "description": "After toasting olive oil-brushed baguette slices under the broiler, I rub the crisp bread with fresh garlic, then spoon on a mixture of tomato and serrano chile that were grated on a box grater. A drizzle of olive oil and a sprinkling of sea salt are nice finishing touches for this simple Spanish tapas dish.", "totalTime": "15 minutes", "recipeYield": "Serves 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Spanish", "Tomato", "Vegetarian"], "recipeIngredient": ["1 large ripe tomato", "1 serrano chile pepper", "1 12-inch piece of baguette, cut into fourths", "1/4 cup olive oil", "1 large garlic clove, peeled and cut in half", "Sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust broiler rack to 6 inches below element and preheat broiler to high for 10 minutes before cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the stem end of the tomato off. Place a box grater over a large bowl, then grate the cut side of the tomato on the largest holes of the box grater. Discard the remaining tomato skin. Grate the serrano pepper over the largest holes and into the tomato pulp. Mix the tomato and serrano until well-combined. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each of the baguette pieces in half crosswise to yield 8 total pieces of bread. Brush the cut sides of the bread with the olive oil, reserving any extra olive oil. Place the bread underneath the broiler just until toasted, 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bread from the broiler. While the bread is still warm, rub each of the bread pieces with the cut side of the garlic halves. Using a spoon, evenly distribute the tomato mixture over each of the bread pieces. Drizzle with the reserved olive oil, then sprinkle with sea salt. Serve immediately.</p>"}]}