{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130102-baked-ricotta-tomatoes-edit.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["ricotta", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Ricotta with Maple-Roasted Tomatoes", "link": "https://www.seriouseats.com/recipes/2013/01/baked-ricotta-maple-roasted-tomatoes-recipe.html", "description": "Baked ricotta tastes like savory cheesecake filling and is served with cherry tomatoes roasted with maple syrup and vermouth. The combination of warm, salty cheese and sweet, soft tomatoes is addictive when piled onto a crusty baguette.", "totalTime": "about 1 hour", "recipeYield": "Serves 3 to 6 as an appetizer", "recipeCategory": ["Mains", "Tomato", "Vegetarian"], "recipeIngredient": ["1 pint cherry tomatoes, rinsed", "2 tablespoons maple syrup", "1 tablespoon sweet or dry vermouth", "1 teaspoon chopped fresh rosemary leaves", "1 teaspoon chopped fresh thyme leaves", "Kosher salt and freshly ground black pepper", "1 pound high quality ricotta cheese (see note), drained in cheesecloth overnight to remove excess moisture", "4 ounces fresh goat cheese, softened to room temperature", "1 egg", "1 tablespoon olive oil, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle positions and preheat oven to 375°F. Place tomatoes in an oven-safe baking dish and add maple syrup, vermouth, half of rosemary, half of thyme, and salt and pepper to taste. Stir to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine drained ricotta, goat cheese, egg, remaining rosemary and thyme, and salt and pepper to taste. Mix with a rubber spatula or wooden spoon to combine. Brush a small gratin dish with 2 teaspoons olive oil and add ricotta mixture, using a spatula to smooth the top. Drizzle with remaining teaspoon of olive oil.  Place ricotta on top rack and tomatoes on lower rack and bake until tomatoes have burst and the liquid around them has reduced to a syrup, and ricotta mixture is lightly browned, about 40 minutes total, rotating both pans front to back half way through cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove cheese from oven and let cool slightly, about 5 minutes. Stir tomatoes to break them up and combine them with the sauce, pour over the baked ricotta, and serve.</p>"}]}