{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130822-preserved-blueberry-peach-jam-side.JPG", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["blueberry", "Jam", "peach", "preserve"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blueberry Peach Jam", "link": "https://www.seriouseats.com/recipes/2013/09/low-sugar-blueberry-peach-jam-recipe.html", "description": "Two summer favorites, preserved using a low-sugar pectin that requires less sugar for a familiar set, yield a velvety purple spread punctuated with softened blueberries.", "totalTime": "1 1/2 hours", "recipeYield": "Makes 5 to 6 half-pint jars", "recipeCategory": ["Blueberry", "Condiments and Sauces", "Peach", "Preserved"], "recipeIngredient": ["5 large or 12 small peaches (white, yellow or a combination), washed", "1 quart (about 2 cups) blueberries, washed and stemmed", "3 tablespoons lemon juice", "3 tablespoons low-sugar pectin", "1 cup granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare boiling water canner and sterilize 6 half-pint jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids and rings to sit in hot water until you need them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium-sized (3 quart) saucepan of water to a boil over high heat. While you wait for the water to boil, prepare an ice bath by filling a large bowl with ice cubes and cold water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a paring knife, score an \"X\" shape on to the bottom of each peach and gently drop, 2-3 at a time, into the boiling water. Once the water returns to a boil, remove the peaches to the ice bath using a slotted spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once blanched peaches have cooled slightly, remove their skins and crush the skinned peaches into a heat-proof measuring cup. Discard pits. Repeat blanching, skinning, and crushing with remaining peaches until you have 2 cups (16 ounces) of peach pulp. Keep any remaining peaches for another use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed saucepan or Dutch oven, combine peach pulp with lemon juice and bring to a boil over high heat. Stir together sugar and pectin in a small bowl, then stir mixture into Dutch oven and return to a boil. Add blueberries and cook until the mixture registers 220&deg;F on a candy or instant read thermometer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off heat and skim any foam with a spoon. Ladle jam into prepared jars, leaving a quarter inch of head space. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight. </p>"}]}