{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130423-249628-dinner-tonight-pork-chops-brussels-sprout-apple-salad-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["apple", "brussels sprouts", "Dinner Tonight", "pork", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pork Chops with Shaved Brussels Sprouts and Apple Salad", "link": "https://www.seriouseats.com/recipes/2013/04/grilled-pork-chop-brussels-apple-salad-recipe.html", "description": "Though the story of this dish is rather long, its appeal is immediate and clear. Shaved Brussels sprouts and apples combine to make a tart and acidic salad, which plays off a big meaty pork chop. It's obviously more a fall dish, but it's easy to admire all year long.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Apple", "Dinner Tonight", "Mains", "Pork"], "recipeIngredient": ["2 tablespoon apple cider vinegar", "2 tablespoon fresh lemon juice from 1 lemon", "1/4 cup honey", "1/2 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "1/4 cup slivered almonds", "1 pound Brussels sprouts, ends trimmed, very thinly sliced", "1 large tart apple, cored, sliced 1/4-inch thick", "4 thick pork chops, about 1 1/2-inch thick", "2 tablespoons canola oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Meanwhile, combine apple cider vinegar, lemon juice, and honey in a medium bowl. Whisk in the olive oil until combined. Season dressing with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a 12-inch cast-iron skillet over medium heat. Add almonds and cook until lightly toasted, stirring occasionally with a wooden spoon. Turn off the heat. Scoop out almonds with a spatula, and transfer to a large bowl. Wipe out skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine brussels sprouts and sliced apples in the large bowl. Add 1/4 cup of the dressing and toss well. Taste and add more dressing if desired. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork chops generously with salt and pepper. Return skillet to medium-high heat and add oil. Heat until just starting to smoke. Add chops and cook until browned on the bottom, three to four minutes. Flip the chops and brown on the other side, another three to four minutes. Transfer chops to oven and continue to cook until an instant read thermometer entered into the deepest part of the chop register 140°F, 2 to 4 minutes longer. When done, transfer chops to a plate and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off any fat in the skillet. Let cool for a minute, then set the skillet over medium heat. Pour in 1/4 cup of dressing and stir constantly with a wooden spoon to dislodge any browned bits. When dressing has slightly thickened, about 1 minute, turn off heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the pork chops with the Brussels sprout and apple salad on the side. Spoon some of the cooked dressing on the pork chops. </p>"}]}