{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131104-272120-cook-the-book-pok-pok-cover.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["andy ricker", "Cook the Book", "frying", "oil", "pok pok", "shallot"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andy Ricker's Naam Man Hom Daeng (Shallot oil)", "link": "https://www.seriouseats.com/recipes/2013/11/andy-rickers-naam-man-hom-daeng-shallot-oil.html", "description": "Use the oil from frying shallots to baste <a href=\"https://www.starchefs.com/cook/chefs/bio/andy-ricker\">Andy Ricker's</a> <a href=\"http://www.seriouseats.com/recipes/2013/11/andy-ricker-whole-roasted-chicken-game-hen-recipe-from-pok-pok-cookbook.html\">Whole Roasted Young Chickens</a> from his new <em><a href=\"http://www.amazon.com/Pok-Stories-Roadside-Restaurants-Thailand/dp/1607742888/?tag=serieats-20\">Pok Pok</a></em> cookbook. Use the fried shallots on top of salads, stir-fries, noodles, or eat for a snack.", "totalTime": "25 minutes", "recipeYield": "Makes about 2 cups", "recipeCategory": ["Cook the Book", "Deep Frying"], "recipeIngredient": ["3 ounces peeled small shallots, preferably Asian (about 6)", "About 2 cups vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve the shallots lengthwise, remove the peel, and slice them against the grain as thinly as you can. (To do it especially quickly and accurately, use a mandoline.) You're shooting for slices that are all about 1/16-inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a fine-mesh strainer over a heatproof container. Pour enough oil into a small pan to reach a depth of 3/4 inch or so. Set the pan over high heat and bring the oil to 275 degrees. (Or test whether the oil is hot enough: as soon as a piece of shallot added to the oil bubbles right away, add the rest.) Add the shallots, then immediately turn the heat to low (don't be tempted to rush the process with high heat), and stir once or twice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, stirring and scraping the sides occasionally and adjusting the heat to maintain a gentle sizzle, until the shallots are deep golden brown and completely crisp, 10 to 20 minutes. If the process takes less time, that means the oil is too hot and you risk a bitter result. You'll quickly get the hang of it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the pan's contents through the strainer, reserving the flavorful oil. Gently shake the strainer, then transfer the shallots to paper towels to drain and cool in more or less one layer. Because the shallots continue to cook after they leave the oil, by this time they will have gone from deep golden brown to deep brown.</p>"}]}