{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130507-251259-kaletahini-edit.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["chicken", "lunch box", "make ahead", "poultry", "quick", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Make-Ahead Roast Chicken and Kale Salad with Tahini, Apricots, and Almonds", "link": "https://www.seriouseats.com/recipes/2013/05/make-ahead-roast-chicken-salad-recipe.html", "description": "A quick Google search revealed that kale and tahini are not such original bedfellows, but the first time I tried a kale tahini salad it was a mind-blowing revelation. I added almonds and apricots, sticking with the Mediterranean flavor profile, and added some chicken as well to make it a more complete meal.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Chicken", "Lunch Box", "Mains", "Salads"], "recipeIngredient": ["12 ounces leftover roast chicken meat, or 2 bone-in, skin-on chicken breast halves, about 8 ounces each", "1 tablespoon olive oil", "Kosher salt and freshly ground black pepper", "1 tablespoon lemon juice from 1 lemon", "2 1/2 teaspoons tahini", "1 bunch kale, stems removed, leaves chopped", "1/4 cup dried apricots, chopped", "1/4 cup toasted almonds, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using leftover meat, skip to step 2. If using fresh chicken, place chicken in a large pot and cover with cold water. Bring to a simmer over medium-high heat. Cook at a bare simmer until thickest part of the chicken registers 155°F on an instant read thermometer. Transfer chicken to a medium bowl and allow to rest until cool enough to handle. Discard skin and bones and shred meat into bite sized pieces. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together 3 tablespoons of hot chicken cooking liquid (if using leftover chicken use 3 tablespoons boiled water), lemon juice, and tahini with large pinch salt. Reserve in airtight container. Toss together chicken, kale, almonds, and apricots. Store separately from dressing until ready to eat. Toss together with dressing and then serve, or pack into container to eat on the go.  </p>"}]}