{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131115-quince-hand-pies-primary.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["fruit", "hand pie", "pie", "quince"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quince Hand Pies", "link": "https://www.seriouseats.com/recipes/2013/11/quince-hand-pies.html", "description": "These pies are delicate, small enough to eat in two bites (or one if you're a busy line cook) but satisfying despite their daintiness.", "totalTime": "3 hours", "recipeYield": "Makes 16-24 pies", "recipeCategory": ["Fruit Desserts", "Pies, Tarts, and Crumbles", "Very Small Anna"], "recipeIngredient": ["<strong>For the Crust</strong>", "1 cup unsalted butter", "2 cups all purpose flour", "3 tablespoons sugar", "3/4 teaspoon salt", "Cold water", " ", "<strong>For the Quince</strong>", "2 large quince", "1 lemon", "3/4 cup sugar", "2 tablespoons butter", "1/2 cup heavy cream", "1/2 vanilla bean, split and scraped", "Pinch each of ground cardamom, allspice and coriander", " ", "<strong>To Bake</strong>", "1 egg yolk", "2 teaspoons water", "Sugar in the raw"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust</strong>: Cut butter into half inch cubes and place in freezer for at least 30 minutes. Combine flour, sugar and salt in bowl of stand mixer. Begin mixing on lowest speed with paddle attachment. Gradually add butter, allow to mix until butter is broken into no larger than pea-sized pieces. Slowly dribble in cold water until dough just comes together. Pat into two discs, wrap tightly with plastic and chill at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Quince</strong>: Peel quince and cut into quarters, regularly rubbing with cut lemon to prevent browning. Carefully cut out cores, then cut quarters crosswise into quarter inch thick slices. Toss with lemon juice. In large saucepan, combine quince with sugar, butter, cream, vanilla and spices. Cook over medium heat, stirring frequently, until quince is cooked through and mixture is caramelized, about one hour. Remove from heat and add more spices to taste, if you like. Allow to cool to room temperature before assembling pies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble</strong>: On lightly floured surface, roll one disc of dough to one eighth of an inch thick. Cut out as many three inch circles as you can, reserving scraps, laying circles on a parchment-lined sheet to chill. Repeat with second disc of dough, then roll scraps and cut as many circles as you can with them. Discard scraps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make egg wash by whisking egg yolk with water. Place 2 teaspoons of quince in center of each chilled dough circle, then use a fingertip to egg wash the edge of half of each circle. Fold unwashed half over filling and gently press edge to seal. Place pies in freezer 5 minutes, then cut 3 small slits in top of each pie, brush each pie lightly with egg wash and sprinkle with sugar in the raw. Pies may be frozen for later baking at this time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake</strong>: Place rack in center of oven and preheat to 375&deg;F. Lay out as many pies as you wish to bake on parchment-lined baking sheet, keeping an inch between them. Bake from fresh or frozen for ten minutes, then turn and bake for roughly another 10 minutes, up to 15 if pies were first frozen. Pies are done when quince bubbles from cut vents and crust is golden brown. Allow to cool slightly before serving.</p>"}]}