{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130507-ramp-quesadilla-recipe-5.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["quesadilla", "quick", "ramps"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ramp and Chorizo Quesadillas", "link": "https://www.seriouseats.com/recipes/2013/05/ramp-and-chorizo-quesadilla-recipe.html", "description": "Crispy quesadillas stuffed with cheeze, chorizo, and ramps.", "totalTime": "15 minutes", "recipeYield": "Makes 2 quesadillas, serving 2 to 4", "recipeCategory": ["Mains", "Sandwiches"], "recipeIngredient": ["2 ounces fresh or cured chorizo, diced or crumbled finely", "16 ramps, washed, trimmed, whites finely chopped, greens roughly chopped", "Kosher salt and freshly ground black pepper", "4 ounces (about 1 cup) grated Jack, Cheddar, or Oaxacan string cheese", "2 (10-inch) flour tortillas", "3 tablespoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat chorizo in a 10-inch non-stick or cast iron skillet over medium heat and cook, stirring occasionally, until fat has rendered and chorizo is browned and crisp, about 4 minutes. Transfer chorizo to a large bowl, leaving rendered fat in skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return to medium-high heat until fat is lightly smoking. Add ramps, season with salt and pepper, and cook, stirring occasionally, until tender and lightly browned, about 2 minutes. Transfer to bowl with chorizo and wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cheese to bowl with chorizo and ramps and toss with hands to combine. Spread half of cheese mixture over one half of one tortilla, leaving a small border around the edge. Fold tortilla firmly in half to enclose the cheese. Repeat with remaining tortilla.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 10-inch nonstick or cast iron skillet over medium heat until shimmering. Carefully add both folded tortillas to skillet and cook, shaking pan gently until first side is golden brown and puffed, 1 to 2 minutes. Carefully fip tortillas with a flexible slotted spatula, sprinkle with salt, and cook on second side until golden brown and puffed, 1 to 2 minutes longer. Transfer to a paper towel-lined plate and allow to rest 1 minutes. Cut each into four pieces and serve</p>"}]}