{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/022713-242496-SeriousEats-Sunday-Supper-Sriracha-Ribs-Brothy-NoodlesB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "noodle", "rib", "soup", "Sriracha", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Chinese Noodles with Baked Sriracha Ribs", "link": "https://www.seriouseats.com/recipes/2013/03/sriracha-glazed-ribs-chinese-noodles-recipe.html", "description": "Rubbed, steamed, and glazed Sriracha ribs are the perfect companion for brothy Chinese noodles.", "totalTime": "4 hours", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Mains", "Pork", "Soups and Stews", "Sunday Supper"], "recipeIngredient": ["<strong>For the Ribs:</strong>", "2 racks of baby back ribs", "1/2 teaspoon ginger powder", "2 teaspoons freshly ground black pepper", "1 1/2 teaspoons onion powder", "1 tablespoon ground chili, such as ancho", "1/2 teaspoon kosher salt", "1/2 cup packed brown sugar, divided", "1 cup apple juice", "1 (12-ounce) bottle of light-flavored beer", "&nbsp;", "<strong>For the Glaze:</strong>", "1/2 cup honey", "1/2 cup Sriracha", "2 1/2 tablespoons Asian chili sauce (such as sambal oelek), divided", "&nbsp;", "<strong>For the Noodles:</strong>", "1 tablespoon chili oil", "1/4 cup sliced mixed mushrooms, such as Portobello, shiitake, and oyster", "1 small fresh red chili, thinly sliced", "2 medium cloves garlic, thinly sliced", "5 cups homemade or store-bought low-sodium chicken stock", "12 ounces fresh (8 ounces dried) Chinese egg noodles", "2 scallions, thinly sliced", "1/4 cup chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 275&deg;F. Combine ginger, black pepper, onion powder, chili powder, salt, and 1/4 cup brown sugar in a small bowl. Mix thoroughly with fingertips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place ribs on a large, foil-lined baking sheet and coat with rub on all surfaces. Place in the oven to roast until fat is beginning to render and ribs are softened, 1 1/2 to 2 hours. Meanwhile, lay two 12- by 24-inch sheets of heavy duty aluminum foil out on the countertop and fold their edges tightly together to form one large sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove ribs from the oven and set them on top of the foil. Return them to the rimmed baking sheet with the foil. Pour apple juice and beer on top of the ribs, then fold up foil and seal tightly to create an enclosed package. Return to oven and continue cooking until ribs are completely tender, about 1 hour longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the ribs are cooking, prepare the glaze by mixing honey, Sriracha, 1 1/2 tablespoons chili sauce and remaining 1/4 cup brown sugar in a small bowl. Remove ribs from oven and raise oven temperature to oven to 375&deg;F. Discard liquid, return ribs to baking sheet and generously brush with glaze. Return to oven until glaze is burnished and sticky, 15 to 20 minutes longer. Remove from oven and set aside, loosely tented with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat chili oil in a medium skillet over medium-high heat until shimmering. Add mushrooms and cook, stirring, until tender, about 3 minutes. Add sliced fresh chili and garlic and cook, stirring constantly, until fragrant, about 1 minute longer. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring chicken broth to a boil over high heat. Add egg noodles and cook according to package directions (fresh noodles will be ready in 2 to 3 minutes). Transfer to a large bowl. Add mushroom mixture to noodles, along with remaining 1 tablespoon chili sauce. Toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide noodles among four deep-sided bowls. Slice ribs and place a few in each bowl of noodles. Garnish with scallions and cilantro and serve immediately. </p>"}]}