{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2013/12/SousVideCityHam.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["city ham", "ham", "holiday", "main", "pork", "roast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "6"}, "name": "Sous Vide City Ham With Balsamic Brown Sugar Glaze", "link": "https://www.seriouseats.com/recipes/2013/12/sous-vide-city-ham-with-balsamic-brown-sugar-glaze-recipe.html", "description": "<p>Ham is not for everyone, but if you're a ham lover, lucky you, because ham is one meat that's <em>darn</em> difficult to mess up. Want to make it even juicier and <em>more</em> foolproof? Cook the sucker sous vide. Because hams are precooked, it's really just a matter of reheating them. Typically, I'd suggest removing meat from its retail packaging, seasoning it, then resealing it in a sous vide bag before cooking it. But since ham's pre-seasoned, it can be cooked directly in the package it comes in, making the whole process even more appealing.</p>", "totalTime": "3 1/2 to 8 1/2 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Christmas", "Easter", "Ham", "Mains", "Pork", "Roasting", "Sous Vide", "Thanksgiving", "Winter"], "recipeIngredient": ["1 bone-in half ham (7 to 10 pounds; 3.2 to 4.5kg), packing intact (see note)", "1 cup (about 225g) brown sugar", "1 cup (240ml) balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat sous vide cooker to 140&deg;F (60&deg;C). Add ham and cook for at least 3 hours and up to 8 hours. Meanwhile, heat brown sugar in a small saucepan over medium-high heat until melted. Continue to cook until deep brown but not black, and immediately add all of balsamic vinegar, standing back as you add it. Cook, stirring occasionally, until sugar is dissolved. Reduce to a bare simmer and continue to cook until mixture is thick and syrupy and coats the back of a spoon, about 5 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 500&deg;F (260&deg;C) 30 minutes before ready to serve ham. Allow oven to preheat for 15 minutes. Remove ham from water bath, remove packaging, and place cut side down on a rack set in a foil-lined rimmed baking sheet. Wipe surface dry with paper towels and brush with glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven and roast for 5 minutes. Pull out oven rack, apply another coat of glaze, and repeat. Repeat glazing step 2 more times. Remove ham from oven and let rest 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To carve ham, place cut side down on a cutting board and make a single slice right next to the bone, dividing ham in two. Place boneless side with the newly cut side facing down and slice thinly into serving pieces. Repeat with remaining ham, cutting it from the bone one section at a time before slicing it into serving portions.</p>"}]}