{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130827-gnocchi-parisian-souffle-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["gnocchi", "parisian gnocchi", "pasta", "pastry", "pate a choux"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Parisian Gnocchi", "link": "https://www.seriouseats.com/recipes/2013/09/parisian-gnocchi-recipe.html", "description": "Light and tender Parisian-style gnocchi made with a poached pâte à choux.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Pasta", "The Food Lab", "Vegetarian"], "recipeIngredient": ["1 cup (8 ounces) water", "8 tablespoons (1 stick, 4 ounces) unsalted butter", "3/4 teaspoon (about .15 ounces) kosher salt", "1 1/4 cups (6.25 ounces) all-purpose flour", "1 tablespoon Dijon mustard", "1/2 cup (about 1 ounce) freshly grated Parmesan cheese", "3 large eggs", "2 tablespoons chopped fresh parsley leaves", "2 tables finely sliced chives", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring water, butter, and salt to a boil in a medium saucepan over high heat. Add flour all at once and stir with a wooden spoon until a smooth dough forms. Reduce heat to medium-low and continue to stir, beating dough forcefully and rapidly to prevent it from sticking to the pot. Continue cooking until dough pulls away from sides of pot leaving a thin layer and steams slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish with Stand Mixer:</strong> Transfer hot dough to the bowl of a stand mixer fitted with a paddle attachment. Add mustard and cheese and beat on medium-low speed. Add eggs one at a time, allowing dough to fully incorporate egg before adding the next one. When final egg has been added, add herbs and beat to combine. Transfer mixture to a gallon-sized zipper-lock bag or a pastry bag fitted with a 1/2-inch tip. Proceed to Step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish by Hand:</strong> Remove pot from heat. Add mustard and cheese and beat with wooden spoon until homogenous. Add eggs one at a time, beating vigorously with each addition to prevent eggs from curdling and allowing dough to fully incorporate egg before adding the next one. When final egg has been added, add herbs and beat to combine. Transfer mixture to a gallon-sized zipper-lock bag or a pastry bag fitted with a 1/2-inch tip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let mixture rest 15 to 25 minutes at room temperature. Meanwhile, bring a large pot of salted water to a simmer and have a rimmed baking sheet. If using a zipper-lock bag, cut off a 1/2-inch opening in one corner. Holding the bag over the boiling water, squeeze the mixture out of the bag, cutting it off with a paring knife into 1-inch lengths and letting them fall directly into the simmering water. Continue cutting off as many as you can in one minute, then stop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all gnocchi have floated to the top, continue cooking until gnocchi are fully cooked to the center, about 3 minutes longer. Lift gnocchi with a fine mesh strainer or a metal spider and transfer to rimmed baking sheet. Drizzle with a little bit of olive oil and toss to coat. Repeat with remaining dough. Cooled gnocchi can be refrigerated until ready to continue cooking in either the <a href=\"http://www.seriouseats.com/recipes/2013/09/parisian-gnocchi-roasted-cherry-tomato-corn-zucchini-food-lab-recipe.html\">Parisian Gnocchi with Roasted Cherry Tomatoes, Corn, and Zucchini</a>, or in the <a href=\"http://www.seriouseats.com/recipes/2013/09/parisian-gnocchi-souffle-recipe.html\">Parisian Gnocchi Soufflé</a>.</p>"}]}