{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130109-pan-seared-fish-with-shiitake-mushrooms.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["cod", "fish", "light eating", "mushrooms", "One Pot Wonder", "quick", "skillet suppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Pan-Seared Fish With Shiitake Mushrooms", "link": "https://www.seriouseats.com/recipes/2013/01/pan-seared-fish-shiitake-mushroom-recipe.html", "description": "A 20 minute meal of fresh fish in a lemon butter sauce with sauteed mushrooms.", "totalTime": "20 minutes", "recipeYield": "serves 2", "recipeCategory": ["Fish", "Mains", "Mushrooms", "One-Pot Wonders", "Stovetop"], "recipeIngredient": ["3 tablespoons olive oil", "1 pound fresh mushrooms like shiitake or oyster, shiitakes stemmed and thinly sliced", "Kosher salt and freshly ground black pepper", "Pinch of dried red chile flakes", "2 skinless fillets cod or other firm white fish like snapper or hake (about 1 pound)", "1 cup homemade vegetable stock or low-sodium vegetable broth", "2 tablespoons cold butter", "2 tablespoons fresh squeezed lemon juice from 1 lemon", "Fresh cilantro, parsley or chives, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a 12-inch skillet over medium-high heat until barely starting to smoke. Add the mushrooms, season with salt, pepper, and chili flakes, and cook, stirring occasionally, until well browned, 3 to 4 minutes. Transfer to a warmed serving plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the fish with salt and pepper. Wipe out skillet, add the remaining olive oil, and return to medium-high heat until shimmering. Add fish fillets and cook without moving until well browned on first side, about 3 minutes. Carefully flip with a flexible metal spatula and cook on second side until just cooked through, about 2 minutes longer. Transfer to plate with mushrooms. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same skillet, add 1 cup stock and cook over high heat until reduced by half, about 2 minutes. Off heat, stir in butter and lemon juice. Season to taste with salt and pepper. Pour over fish and mushrooms and serve, garnished with fresh parsley, chives, and/or lemon wedges.</p>"}]}