{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/10302013-btb-lemonmeringuepie-edit.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["gramercy tavern cookbook", "lemon", "lemon meringue pie", "meringue", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Gramercy Tavern's Lemon Meringue Pie", "link": "https://www.seriouseats.com/recipes/2013/11/gramercy-taverns-lemon-meringue-pie.html", "description": "Nearly a dozen eggs make up the filling and topping for this <em><strong><a href=\"http://www.amazon.com/Gramercy-Tavern-Cookbook-Michael-Anthony/dp/0307888339/?tag=serieats-20\" target=\"_blank\">The Gramercy Tavern Cookbook</a></strong></em> lemon meringue pie. This yields a custardy, yolky-sweet core and clouds of fluffy meringue. It's the perfect palate cleanser for heavy holiday suppers.", "totalTime": "several hours, including baking and cooling", "recipeYield": "makes one 9-inch pie", "recipeCategory": ["Bake the Book", "Desserts", "Lemon", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Lemon Curd</strong>", "10 large egg yolks (save the whites for the meringue)", "1/3 cup cornstarch", "1 cup plus 2 tablespoons sugar", "Grated zest of 4 lemons", "2/3 cup fresh lemon juice", "12 tablespoons (1 1/2 sticks) unsalted butter", "1/4 teaspoon salt", "&nbsp;", "<strong>Meringue</strong>", "1/2 cup plus 2 tablespoons sugar", "1 teaspoon cornstarch", "10 large egg whites", "&nbsp;", "<strong>Pastry Dough</strong>", "1 1/4 cups all-purpose flour", "1/4 cup sugar", "8 tablespoons (1 stick) unsalted butter, cubed and very cold", "1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the dough: In the bowl of a stand mixer fitted with the paddle attachment, combine the flour and sugar. Add the butter and mix on medium-low speed until the mixture looks like sand. Add the yolk and mix just until a dough forms. Some dry patches and crumbs are okay; they will moisten as the dough rests.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a ball, flatten, and wrap well in plastic wrap. Refrigerate for at least 2 hours, or overnight. The dough can be frozen for up to a month; thaw it overnight in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough is chilled, on a lightly floured surface, roll out the pastry dough. Fit it into a 9-inch pie dish and crimp the edges.<br />\nRefrigerate for at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F, with a rack in the middle position.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the pie shell with parchment paper and fill with pie weights. Bake the pie shell for 20 minutes. Remove the paper and weights and continue to bake until the shell is evenly golden brown and cooked all the way through, 10 to 15 minutes more. Let cool. Lower the oven temperature to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the lemon curd. In a medium bowl, combine the yolks and cornstarch and whisk until smooth, then set aside. In a medium saucepan, combine the sugar, lemon zest and juice, butter, and salt and bring to a boil, stirring until the sugar dissolves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly whisk about a cup of the hot liquid into the yolk mixture in a steady stream to temper it. Then pour the contents of the bowl into the saucepan and cook over medium heat, whisking constantly and getting into the edges of the pan to keep the curd from sticking or burning, until the first bubbles form. (Lower the heat a little if you see more than a few bubbles.) Immediately remove from the heat and spread the curd into the cooled pie shell. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately make the meringue (the meringue will adhere better to the curd if the curd is still warm).<br />\nIn a small bowl, combine the sugar and cornstarch. In the bowl of a stand mixer, whip the egg whites on medium-low speed until foamy, about 4 minutes. Increase the mixer speed to medium and gradually pour the sugar mixture into the whites. Once the sugar is incorporated, increase the speed to medium-high and whip the meringue until medium-stiff peaks form (a peak of meringue should stand up, then slowly curl over), about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the meringue over the lemon curd with a small spatula, making sure to seal the meringue to the edges of the crust all the way around the pie. Form peaks on top by lifting up the spatula. Bake the pie until the meringue is golden, about 15 minutes. Let cool, then refrigerate until cold. The pie will keep, covered, in the refrigerator for up to 2 days.</p>"}]}