{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130226-coconut-lime-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["coconut", "ice cream", "lime", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Toasted Coconut and Lime Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/03/toasted-coconut-lime-ice-cream-recipe.html", "description": "Nutty coconut and bright lime come together in an especially creamy ice cream.", "totalTime": "2 hours, plus an overnight chill", "recipeYield": "makes about 1 quart", "recipeCategory": ["Coconut", "Ice Cream and Frozen Treats", "Lime", "Scooped"], "recipeIngredient": ["2 cups sweetened coconut, packed (about 6 ounces)", "2 cups cream", "1 cup whole milk", "6 egg yolks", "3/4 cup sugar", "2 teaspoons grated lime zest from 2 limes", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350&deg;F with an oven rack positioned in the middle. Spread coconut thinly and very evenly across a half sheet pan and toast just until coconut edges begin to brown and turn aromatic, 2 to 4 minutes. Do not overbake coconut or ice cream will taste burnt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer coconut to a medium saucepan and cover with cream and milk. Bring to a boil, stir to combine, and remove from heat. Cover and let steep for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy medium saucepan, whisk together egg yolks and sugar until lighter in color and slightly thickened. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain dairy through a fine mesh strainer into a large measuring cup or a bowl with a pouring spout. Press very firmly on coconut shreds to strain as much liquid out as possible. Very slowly pour dairy into saucepan with eggs, whisking constantly, until fully combined. Cook on medium heat, stirring frequently, until a custard forms on the back of a spoon and a swiped finger leaves a clean line.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain custard into an airtight container and stir in lime zest and salt to taste. Chill overnight, or at least 6 hours, then strain chilled custard into ice cream maker (to remove lime zest) and churn according to manufacturer's instructions. Transfer ice cream to airtight container and chill for at least 4 hours in freezer before serving. Garnish with lime zest and toasted coconut flakes if desired.</p>"}]}