{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/061313-255859-Serious-Eats-Sunday-Supper-Gazpacho-ShrimpB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["garlic croutons", "gazpacho", "paprika", "seafood", "shrimp", "soup", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gazpacho With Grilled Paprika Shrimp And Garlic Croutons", "link": "https://www.seriouseats.com/recipes/2013/06/gazpacho-grilled-paprika-shrimo-garlic-croutons-recipe.html", "description": "Gazpacho gets an update with the addition of grilled shrimp and garlic croutons.", "totalTime": "About 4 hours", "recipeYield": "Serves 4", "recipeCategory": ["Garlic", "Gazpacho", "Mains", "Shrimp", "Sunday Supper"], "recipeIngredient": ["<strong>For the Gazpacho:</strong>", "1 slice day-old white bread, crusts removed and soaked in water", "2 pounds vine-ripened tomatoes, plus additional for garnishes", "1/2 large hothouse cucumber, peeled, seeded and chopped, plus additional for garnishes", "1 red pepper, stemmed, seeded, and chopped, plus additional for garnishes", "1 medium red onion, chopped, plus additional for garnishes", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 (12 ounce) can spicy tomato juice, such as V-8", "1 teaspoon sugar", "2 1/2 teaspoons hot paprika, divided", "1/4 cup plus 1 teaspoon sherry wine vinegar", "3 tablespoons olive oil, divided", "2 tablespoons fresh juice from 1 lemon", "Kosher salt and freshly ground black pepper", "&nbsp", "<strong>For the Shrimp:</strong>", "1 ½ pounds medium shrimp, shelled and deveined ", "1/8 teaspoon cayenne pepper", "1 loaf store-bought garlic bread, uncooked and cut into 1” cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze out excess water from bread and add to a blender with tomatoes, cucumbers, bell pepper, onion and garlic. Puree the ingredients until combined but still slightly chunky. Add the tomato juice, sugar, 1 ½ teaspoons paprika, vinegar, 2 tablespoons olive oil and lemon juice. Pulse again, just until combined. Season with salt and pepper. Transfer to a resealable container and refrigerate soup for at least 2 and up to 4 hours to allow flavors to meld.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shrimp in a medium bowl. Add remaining 1 tablespoon olive oil, remaining 1 teaspoon paprika, remaining 1 teaspoon vinegar and cayenne. Season with salt and pepper. Toss to coat and refrigerate for up to an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare garnishes by chopping additional tomatoes, cucumbers, peppers and onions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate, leaving an area without direct heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shrimp on wooden skewers, alternating with cubes of garlic bread. Grill skewers over center of grill, turning occasionally, until slightly charred and cooked through, about 4 mintues. Remove from the grill. Remove and discard shrimp tails.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste the gazpacho and adjust seasonings if needed. Ladle soup into bowls or a tureen and serve with shrimp, garlic crouton skewers and garnishes.</p>"}]}