{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/082113-263915-Serious-Eats-Sunday-Supper-Flank-Pistachio-Mint-PestoB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["beef", "beet", "flank steak", "mint", "parsley", "pesto", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Flank Steak with Pistachio-Mint Pesto and Roasted Beets", "link": "https://www.seriouseats.com/recipes/2013/08/grilled-flank-steak-pistachio-min-pesto-roasted-beets-recipe.html", "description": "Offering an update on traditional pesto, this minty rendition finishes marinated, grilled flank steak and is served with roasted golden beets.", "totalTime": "5 hours", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Mains", "Pesto", "Sunday Supper"], "recipeIngredient": ["<strong>For the Steak:</strong>", "2 pounds flank steak", "2 tablespoons red wine vinegar", "1 cup plus 2 tablespoons olive oil, divided use", "3 cloves garlic, divided use", "1 medium yellow onion, roughly chopped", "1 tablespoon chopped oregano", "Kosher salt", "Fresh-cracked black pepper", " ", "<strong>For the Pesto:</strong>", "1/4 cup shelled, roasted pistachios", "Juice of 1 lemon", "3 tablespoons chopped mint, plus more for garnishing", "2 tablespoons chopped flat-leaf parsley, plus more for garnishing", "1/4 teaspoon crushed red pepper", "1/2 cup finely grated Parmesan cheese, plus more for garnishing", " ", "<strong>For the Beets:</strong>", "2 pounds beets, preferably golden, scrubbed and cut into even wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Steak:</strong> Place flank steak in a resealable bag and add vinegar, 1/2 cup olive oil, 1 clove garlic (smashed), onion, oregano, and a generous sprinkle of salt and black pepper. Seal bag tightly and squish around to blend marinade and coat the meat. Place in the refrigerator to marinate for at least 4 hours and up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pesto:</strong> Roughly chop toasted pistachios in a food processor. Add 1/2 cup olive oil, lemon juice, remaining 2 cloves of garlic, mint, parsley, and red pepper. Pulse to combine. Season with salt and pepper and pulse again until well mixed but some texture remains. Transfer to a bowl and stir in cheese. Adjust seasonings if needed. Reserve in refrigerator until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beets:</strong> Set oven rack to middle position and preheat oven to 375°F. Set beets on a large piece of foil and drizzle with remaining 2 tablespoons of olive oil. Season with salt and pepper, and close foil around beets to seal them into a tight packet. Place on top of a baking sheet and transfer to the oven to roast until tender when pierced with a fork, about 1 hour. Remove from oven and let cool. Peel skins and discard. Chop beets into smaller wedges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, spread evenly over one side of coal grate. Alternatively, set the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Wipe excess marinade off of steak and cook over hot side of grill, turning occasionally, until the center of the steak registers 125&deg;F on an instant-read thermometer for medium-rare, or 135&deg;F for medium. Remove from grill and let rest 5 minutes before slicing thinly against the grain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve meat with pesto and beets (either at room temperature or warmed through). Garnish with additional mint, parsley and coarsely grated Parmesan.</p>"}]}