{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/20121210-pork-chili-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["black beans", "cannellini beans", "chili", "garbanzo beans", "kidney beans", "pork", "soup", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.625", "ratingCount": "8"}, "name": "Easy Pork and 3-Bean Chili", "link": "https://www.seriouseats.com/recipes/2013/01/easy-pork-three-bean-chili-food-lab-recipe.html", "description": "An easy 1-pot pork and three-bean chili with a rich, balanced chili flavor.", "totalTime": "2 hours 45 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Beans and Pulses", "Chili", "Mains", "Pork", "The Food Lab"], "recipeIngredient": ["2 cups homemade or store-bought low sodium chicken broth or stock", "1/2 cup raisins", "2 pounds boneless pork shoulder, trimmed and cut into 2-inch dice", "2 tablespoons vegetable or canola oil", "1 medium onion, finely sliced (about 1 cup)", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 teaspoon dried oregano", "1/4 cup chili powder", "1 tablespoon ground cumin", "1 teaspoon ground coriander", "1 (28-ounce) can whole tomatoes packed in juice, roughly squeezed through fingers to chop", "1 tablespoon Asian fish sauce", "1/2 cup frozen orange juice concentrate (or 3/4 cup orange juice)", "1 bay leaf", "Kosher salt and freshly ground black pepper", "1 (15 ounce) can red kidney beans, drained and rinsed", "1 (15 ounce) can black beans, drained and rinsed", "1 (15 ounce) can garbanzo or cannellini beans, drained and rinsed", "Diced avocado, cilantro, diced onions, lime wedges, and grated cheese for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 1 cup chicken broth and raisins in a microwave-safe bowl and microwave on high heat until very hot, about 1 minute. Let stand for 5 minutes, then puree raisins and stock until smooth in a countertop blender or with an immersion blender. Add remaining cup of chicken stock and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pat pork dry with paper towels or a clean kitchen towel. Heat vegetable oil in a large heavy-bottomed Dutch oven over high heat until smoking. Add pork all at once and spread evenly over bottom surface (it's ok if not all the pork is touching the bottom or if the pan is crowded). Cook without moving until bottom surface is well browned, about 8 minutes. Stir pork. Add onions and garlic and cook, stirring occasionally, until softened, about 5 minutes. Add oregano, chili powder, cumin, and coriander and cook, stirring frequently, until fragrant and a light patina forms on the bottom of the pan, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add broth/rasin mixture, stirring to release browned bits from bottom of pan. Add tomatoes and their juice, fish sauce, orange juice concentrate (or orange juice) and bay leaf. Season lightly with salt and pepper and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce to a bare simmer, cover pot leaving lid slightly ajar, and cook, stirring occasionally, until pork is nearly tender, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add kidney beans, black beans, and garbanzo or cannellini beans. Continue to cook until pork can be easily shredded with a fork, about 45 minutes longer. Sauce should be thick, with an almost ketchup-like consistency. If too thin, continue to cook, stirring frequently, until reduced to the desired consistency. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve chili with diced avocado, cilantro, diced onions, lime wedges, and grated cheese. Chili can be stored in a sealed container in the fridge for up to 5 days.<br />\r\n</p>"}]}