{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131128-275305-chicken-paprikash.1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["chicken", "easy", "paprika", "paprikash", "stew", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Chicken Paprikash", "link": "https://www.seriouseats.com/recipes/2013/12/chicken-paprikash.html", "description": "An ample amount of paprika adds bold flavor to this classic Hungarian dish of tender braised chicken with tomato, red pepper, and a touch of sour cream.", "totalTime": "1 1/2 to 12 hours (see note)", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Chicken Dinners", "Mains", "Soups and Stews"], "recipeIngredient": ["2 1/2 pounds chicken thighs and drumsticks", "8 teaspoons sweet paprika, divided", "3 tablespoons olive oil, divided", "Kosher salt and freshly ground black pepper", "2 medium onions, finely chopped (about 2 cups)", "2 red bell peppers, seeded and sliced into 1/2-inch strips", "3/4 cup homemade or store-bought low-sodium chicken stock, divided", "1 tablespoon all-purpose flour", "1 (14-ounce) can whole tomatoes, chopped with juice reserved (see note)", "2 tablespoons sour cream", "1 tablespoon chopped parsley "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken dry and place in bowl with 1 tablespoon olive oil. Stir 5 teaspoons paprika plus 1 teaspoon salt in small bowl. Add paprika mixture to chicken and coat well. Cover and chill at least 4 hours, and preferably overnight (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in large Dutch oven over medium high heat until shimmering. Add half of chicken to Dutch oven and cook chicken until well browned, 4 to 5 minutes per side. Transfer to plate, add remaining tablespoon oil, and repeat with second batch of chicken. Set chicken aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium and add onions and 1 teaspoon salt. Cook until onions are softened, stirring frequently, 6 to 8 minutes. Add peppers, 1/2 teaspoon black pepper, and remaining tablespoon paprika and cook, stirring, for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir 2 tablespoons chicken broth into flour and add to pot. Cook, stirring, for 1 minute. Whisk in remaining chicken broth and tomatoes (with juice), and bring to simmer. Nestle in chicken, skin side up, cover, and reduce heat to low. Gently simmer until chicken is completely tender, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to plate, stir in sour cream, season to taste, and return chicken to pot. Sprinkle with parsley and serve (see note).</p>"}]}