{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20130829-sweetpotato-shutterstock-edit.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["brioche", "French toast", "maple syrup", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sweet Potato Brioche French Toast", "link": "https://www.seriouseats.com/recipes/2013/10/sweet-potato-brioche-french-toast-draft.html", "description": "There are a lot of steps involved in this recipe for sweet potato French toast with homemade sweet potato brioche, but none of them are hard, and if you've never made brioche be reassured that it's among the easiest of bread doughs. If you can make cake, you can make brioche!", "totalTime": "2-3 days", "recipeYield": "Makes 2 loaves, 16 pieces of French toast", "recipeCategory": ["Breakfast Sweets", "French Toast", "Sweet Potatoes and Yams", "Very Small Anna"], "recipeIngredient": ["<strong>For the Brioche</strong>", "1 cup sweet potato puree (see instructions)", "1/2 cup warm water", "2 1/2 tablespoons active dry yeast", "4 eggs, divided", "5 1/8 cups all purpose flour, divided", "1/3 cup sugar", "2 teaspoons salt", "1 cup unsalted butter, cut into 1/2 inch cubes", " ", "<strong>For the Filling</strong>", "1 cup sweet potato puree", "2 egg yolks", " ", "<strong>For the Soak</strong>", "1 1/2 cup milk", "2 tablespoons butter", "1/4 cup dark brown sugar", "Pinch salt", "2 teaspoons vanilla extract", "1 tablespoon Allspice Dram", "3 egg yolks", " ", "<strong>For the Syrup</strong>", "1/4 cup sweet potato puree", "1/2 cup maple syrup", "2 tablespoons orange juice", "1/2 teaspoon ground allspice", "Pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Brioche</strong>: Obtain about 4 large or 5 medium sweet potatoes. Place rack in center of oven. Preheat oven to 400&deg;F. Gently scrub and pat dry sweet potatoes, then pierce all over with paring knife and place on lined sheet pan. Bake until juices caramelize and potatoes are baked through, 40-60 minutes. Allow to cool slightly, then peel off skin and cut into chunks, removing any blemished or overly stringy spots. Cut into large chunks and puree completely in a food processor. Measure out one cup, then another 1 1/4 cup for the filling and syrup, which can be refrigerated.</p>\r\n\r\n<p><strong>Note</strong>: If you don't have a food processor, the best way to puree the sweet potato is by forcing the warm baked potato chunks through a strainer. Press and scrape the puree with a plastic bowl scraper or sturdy spatula; you'll find that the tougher fibrous bits stay on the inside of the strainer and you can easily scrape the smooth puree from the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine warm water and yeast in bowl of stand mixer and set aside to dissolve, about 2 minutes. Add 1 egg and 1 1/8 cup flour and mix on low speed with paddle until fully combined, then set aside and allow to rise until doubled, about 30 minutes. Add sugar, salt, remaining eggs and flour and sweet potato puree and mix on low until completely combined, scraping bowl and beater as needed. On low speed, gradually add butter until completely combined, scraping as needed. Once all butter is incorporated and dough is uniform, transfer to a clean medium bowl and wrap tightly with plastic. Refrigerate at least 2 hours, up to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set rack in center of oven. Preheat oven to 425&deg;F. Brush insides of two loaf pans with butter. Divide dough in half. On a lightly floured surface, roll each piece of dough into an 8x12 inch rectangle. In a small mixing bowl, whisk together the sweet potato puree and egg yolks for the filling. Spread half the filling evenly onto each rectangle, then roll the rectangles tightly as you would for a jelly roll cake, creating two 8 inch rolled logs. Place each seam-side down into prepared pans and allow to rise until doubled in size, about 30 minutes. Once risen, melt a couple of pats of unsalted butter and brush gently onto each loaf. Bake for 15 minutes, then turn, brush with butter again and lower temperature to 350&deg;F. Bake for 20-25 minutes. Allow loaves to cool fully before turning out. Wrap cooled loaves tightly in plastic and refrigerate or freeze until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make French Toast</strong>: Set rack in center of oven and preheat oven to 375&deg;F. Combine milk and butter in small saucepan and place over medium heat. Once butter is fully melted, add sugar, salt, vanilla and Allspice dram and whisk to dissolve sugar. Remove from heat. Place egg yolks in small mixing bowl and gradually pour in hot liquid, whisking constantly. Pour soak into shallow pan (a pie pan is great for this) and slice brioche into inch-thick pieces. Soak each slice of bread in liquid for 30 seconds on each size, then set on a rack over a baking sheet. Melt a couple pats of butter in a large frying pan, once foamy add two pieces of soaked bread and cook until golden, 2-3 minutes. Flip and repeat with other side, then transfer to rack and bake 5 minutes. Repeat to cook as many pieces as desired.</p>\r\n\r\n<p><strong>Note</strong>: Soak will hold for up to 3 days in the refrigerator if you want to make it ahead or if you have leftovers. Whisk before using to break up any lumps of butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make Syrup</strong>: Combine sweet potato puree, syrup, orange juice, allspice and salt in small mixing bowl and whisk to combine. Pour generously over warm French toast.</p>"}]}