{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130103-235612-bellini-jam.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["Bellini", "champagne", "Jam", "peaches", "Preserved", "Preserves"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bellini Jam", "link": "https://www.seriouseats.com/recipes/2013/01/bellini-jam-peach-champagne-preserves-recipe.html", "description": "This Bellini jam is a perfect combination of sweet peaches and zippy champagne. Smooth with a touch of bite, it cures what ails you.", "totalTime": "1 hour 15 minutes", "recipeYield": "Six (8-ounce) jars of jam", "recipeCategory": ["Condiments and Sauces", "Peach", "Preserved"], "recipeIngredient": ["4 pounds frozen peaches, defrosted", "1 cup decent quality champagne", "1 pound white sugar, divided", "1/2 teaspoon kosher salt", "3 tablespoons juice from 1 to 2 lemons", "1/2 teaspoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small plate in the freezer so you can test the jam for proper thickness later. Sterilize jars and lids. In a food processor, pulse the peaches until they are chopped well, about five or six 1-second pulses. If you prefer a coarser jam, feel free to chop the fruit to a chunkier texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the fruit into a deep, heavy-bottomed pot. Toss with champagne and 1/4 cup of white sugar. Cover and allow to sit for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining sugar, salt, lemon juice, and butter. Cook over medium heat, stirring occasionally, until the fruit begins to bubble and spit. Use a skimmer to skim off any foam that forms. Cook for about 20-25 minutes, stirring frequently to keep the fruit from sticking to the bottom of the pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin testing the jam for doneness. Spread 1/2 teaspoon of cooked fruit on the cold plate and place it back in the freezer. Wait 30 seconds, then run your finger through the fruit. It should be thick enough to maintain a path when you run your finger through it. If you’d like thicker jam, place the plate back in the freezer and cook the fruit for another 4 minutes and test again. Repeat until desired thickness is achieved, but be careful about cooking too long or you will alter the taste of your jam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pot from heat and use a spoon to skim any foam from the surface of the fruit. Ladle jam into sterilized jars, leaving 1/2-inch of headroom, and process them in a hot water bath for 10 minutes. Unopened jars will keep at room temperature for up to 6 months. Opened jam should be refrigerated.</p>"}]}