{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130904-265300-dinner-tonight-pork-chop-sandwich-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["easy", "onion", "pork", "quick", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bone-In Pork Chop Sandwich", "link": "https://www.seriouseats.com/recipes/2013/09/bone-in-pork-chop-sandwich-recipe.html", "description": "Chicago has its fair share of iconic dishes, from deep dish to the Chicago-style hot dog, but not all of these unique eats are well known outside of the city limits. Allow me to introduce one of the strangest: the bone-in pork chop sandwich. Yep, you read that right. This sandwich features a pork chop with its bone still firmly attached.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Mains", "Onion", "Pork", "Sandwiches"], "recipeIngredient": ["4 soft hamburger buns ", "4 tablespoons butter, divided  ", "2 large onions, thinly sliced (about 3 cups)", "Kosher salt and freshly ground black pepper", "4 thin-cut pork chops, bone-in (or boneless, if you're scared)", "1/2 cup all-purpose flour ", "1 tablespoon canola or vegetable oil", "4 tablespoons brown mustard", "6 to 8 sport peppers (or pickled serranos or jalapeños), stems removed, chopped "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;. Place buns on a rimmed baking sheet and set aside. Meanwhile, melt 2 tablespoons butter in a large non-stick skillet over medium heat. Add sliced onions and cook, stirring occasionally, until browned but still with some texture, 8 to 10 minutes. Season to taste with salt and pepper. Remove with a slotted spoon and set aside in a bowl. Do not wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork chops on both sides with salt and pepper. Dredge in flour and then shake off excess. Add remaining 2 tablespoons butter and tablespoon canola oil to skillet and heat over medium high heat until foaming subsides. Add as many of the pork chops as will fit in one layer. Cook until browned on the bottom, 2 to 3 minutes. Flip the chops and brown on the other side, another 2 to 3 minutes. Remove and set aside when done. Repeat with any remaining chops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place buns in oven to warm through. Take one bun and smear both cut sides with mustard. Top the bottom bun with a pork chop, sautéed onions, and a couple chopped sport peppers. Cap with the top bun, cut-side down. Repeat with remaining buns. Eat immediately, though be careful of the bone! </p>"}]}