{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130206-239797-dinner-tonight-couscous-sweet-potato-kale-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["cous cous", "dinner tonight kale", "quick", "sweet potato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Couscous with Sweet Potato Puree and Kale Chips", "link": "https://www.seriouseats.com/recipes/2013/02/cous-cous-sweet-potato-puree-kale-chips-dinner-tonight-recipe.html", "description": "Seems like everyone these days loves kale chips. As for me, I'm on board as long as they are freshly prepared, not straight from a bag. But while undoubtedly good, why limit their potential to just snack time?", "totalTime": "45 minutes", "recipeYield": "serves 3 to 4", "recipeCategory": ["Dinner Tonight", "Mains", "Other Grains", "Sweet Potatoes and Yams", "Vegetarian"], "recipeIngredient": ["1 bunch kale (about 6 ounces), stems trimmed, leaves roughly chopped", "4 tablespoons olive oil, divided ", "1 tablespoon juice and 1 teaspoon zest from 1 lemon", "Kosher salt and freshly ground black pepper", "2 sweet potatoes, peeled, ends trimmed, chopped into 1/2-inch pieces ", "2 tablespoons butter", "1 3/4 cups low sodium homemade or store-bought vegetable broth (or chicken broth)", "1 cup Israeli couscous", "Pinch smoked paprika"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat to 300&deg;F. Cover a large baking sheet with parchment paper. In a large bowl, toss together the kale, 1 tablespoon olive oil, and lemon zest. Season to taste with salt. Arrange kale on baking sheet and transfer to the oven. Cook for 10 minutes, then rotate the pan. Cook until crispy but not browned, 10 to 12 minutes longer. When done, transfer kale chips to a wire rack to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat two inches of water in a large pot with a steamer basket until boiling. Add sweet potato pieces to the basket and cover. Cook until pieces are tender and a knife can easily slip in the flesh, about 15 minutes. Transfer sweet potatoes to a food processor and puree until smooth. Stir in butter and season with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 1/4 cups of broth in a medium-sized saucepan over high heat until boiling. Add couscous, season with a pinch of salt, and reduce heat to a simmer. Cover, stirring occasionally, until couscous is tender but not mushy, 8 to 10 minutes. Drain couscous in a colander, then transfer to a bowl. Stir in a tablespoon of olive oil and the lemon juice. Season to taste with salt and pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 1/4 cup of the sweet potato puree to a large bowl. Top with a quarter of the couscous and a quarter of the kale chips. Drizzle with olive oil and sprinkle with smoked paprika. Repeat with remaining portions. </p>"}]}