{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130821-tapas-corn-avocado-tomato-egg-kale-figs-tallegio-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["avocado", "corn", "easy", "quick", "radish", "sandwich", "tartine", "toast", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Corn, Avocado, and Radish Tartine", "link": "https://www.seriouseats.com/recipes/2013/08/corn-avocado-radish-tartine.html", "description": "Charred corn, avocado, and radishes on a slice of toasted sourdough bread.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Avocado", "Corn", "Sandwiches", "Vegetarian"], "recipeIngredient": ["4 slices of hearty bread, such as French pain au levain or sourdough", "4 tablespoons extra-virgin olive oil, divided", "1 medium clove garlic split in half, and 1 medium clove garlic, minced (about 1 teaspoon)", "Kosher salt and freshly ground black pepper", "3 cups shucked corn kernels from about 2 ears corn", "1/4 cup <a href=\"http://www.seriouseats.com/2011/10/the-food-lab-homemade-mayo-in-2-minutes-or-le.html\">homemade</a> or store-bought mayonnaise", "2 teaspoons juice from 1 lime", "1/4 cup chopped fresh cilantro leaves", "4 scallions, thinly sliced", "1 avocado", "4 radishes, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high and adjust rack to 6 inches below element. Brush bread slices on all sides with 2 tablespoons olive oil and rub with split garlic clove on all surfaces. Season with salt and pepper. Place on a rimmed baking sheet or broiler pan and broil until golden brown and toasted on first side, about 3 minutes. Flip and broil until second side is toasted, about 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 2 tablespoons olive oil in a medium cast iron or non-stick skillet over high heat until shimmering. Add corn and cook without moving until well charred on first side, about 4 minutes. Flip and toss and continue to cook, stirring occasionally, until well toasted on all sides, about 8 minutes total. Season to taste with salt and pepper and transfer to a medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add minced garlic, mayonnaise, remaining 2 tablespoons olive oil, and lime juice. Add cilantro and scallions, reserving some for garnish. Toss corn to combine and season with more salt and pepper as desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mash avocado with the back of a fork in a medium bowl and season to taste with salt and pepper. Spread bread with mashed avocado, top with corn and radishes, sprinkle with remaining cilantro and scallions, and serve.</p>"}]}