{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/082913-264657-Serious-Eats-Sunday-Supper-Crockpot-Pork-Adobo-edit.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Filipino", "keywords": ["adobo", "dinner", "egg", "Filipino", "fried rice", "garlic", "pork", "rice", "slow cooker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Slow-Cooker Filipino Pork With Garlic Fried Rice", "link": "https://www.seriouseats.com/recipes/2013/08/slow-cooker-slow-cooked-filipino-pork-with-garlic-fried-rice.html", "description": "This simple slow-cooker adobo pork with garlic fried rice is tangy, comforting, and delightfully fragrant.", "totalTime": "8 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Eggs", "Filipino", "Fried Rice", "Garlic", "Mains", "Pork", "Slow Cooker", "Sunday Supper"], "recipeIngredient": ["<strong>For the Pork:</strong>", "1 large onion, thinly sliced (about 1 1/2 cups), divided", "3 pounds bone-in pork shoulder", "1 Thai chili or jalapeno, minced", "12 medium cloves of garlic, minced (about 1/4 cup), divided", "1 teaspoon brown sugar ", "1/3 cup low-sodium soy sauce ", "1/3 cup white wine vinegar", "1/2 cup water", "3 bay leaves ", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Rice:</strong>", "1/2 cup peanut oil", "3 cups cooked, cold, leftover rice", "2 eggs, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserve 1/4 cup of onion and finely mince. Refrigerate until step 3. Place pork in the slow-cooker with the remaining onion, chile, 4 cloves of garlic, soy sauce, vinegar, brown sugar, water and bay leaves. Add 3/4 teaspoon black pepper and 3/4 teaspoon salt. Stir to combine, spooning some liquid over the top of the meat. Cover and set to low heat for 7 hours, turning over half way through cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork from the pot and roughly shred into large chunks using two forks. Discard bone and any gristle or overly fatty pieces. Return to the slow cooker submerging in juices, to let the flavor meld. Cook for 1 hour more. Remove 1/2 cup of meat and set aside in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While meat is cooking, heat oil in a large frying pan or wok over medium-high heat until shimmering. Add the rice, spreading it into an even layer. Cook without moving until browned and toasted underneath, about 3 minutes. Season with salt, stir, and flip, pushing the rice up the sides to create a well in the middle. Add egg to well and stir rapidly to cook. Stir egg and rice together, leaving another open well in the center of the pan. Add the 1/4 cup minced onion and sauté until it starts to soften, about 4 minutes. Reduce the heat to medium. Add garlic to well and cook, stirring, until aromatic, about 30 seconds, adding more oil as necessary to prevent garlic from burning. Add the reserved 1/2 cup meat. Warm through for a minute and stir everything together to evenly distribute ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard bay leaves from pork. Scoop rice into individual bowls and top with pork and juices. Or serve family-style, if desired.</p>"}]}