{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/102413-270928-Serious-Eats-Sunday-Supper-Roasted-Cauliflower-SoupB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cauliflower", "easy", "ham", "mushroom", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoky Cauliflower Soup With Wild Mushrooms and Ham Crisps", "link": "https://www.seriouseats.com/recipes/2013/10/smoky-cauliflower-soup-mushrooms-ham-recipe.html", "description": "Ultra-creamy, smoky cauliflower soup gets some zing from sherry vinegar and is served with roasted wild mushrooms and crisped ham.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cauliflower", "Ham", "Mushrooms", "Soups and Stews", "Sunday Supper"], "recipeIngredient": ["<strong>For the Soup:</strong>", "1 large head cauliflower, cored, cut into florets and tough stalks discarded", "5 tablespoons olive oil, divided", "3 1/2 tablespoons sherry vinegar, divided", "Kosher salt and freshly ground black pepper", "Black pepper", "1 teaspoon hot or sweet pimentón (smoked paprika)", "2 1/2 cups whole milk, plus additional as needed", "&nbsp", "<strong>For the Mushrooms:</strong>", "1 pound mixed wild mushrooms, cleaned and cut into 1/2- to 1-inch pieces", "1 sprig fresh rosemary", "4 sprigs fresh thyme", "&nbsp", "<strong>For the Ham:</strong>", "Non-stick cooking spray", "1/2 pound very thinly sliced deli ham or prosciutto"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cauliflower on a 13- by 9-inch baking sheet in a single layer. Toss with 3 tablespoons olive oil, 2 1/2 tablespoons sherry vinegar, 1/2 teaspoon salt, 1/2 teaspoon pepper, and pimentón. Transfer to oven to roast, tossing halfway through, until tender and browned, 35 to 40 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cauliflower is cooking, add mushrooms, rosemary, thyme, remaining 2 tablespoons olive oil and remaining 1 tablespoon sherry vinegar to a medium, oven-safe baking dish. Season with salt and pepper, toss to combine and transfer to the oven to roast until liquid evaporates and mushrooms are nicely browned, 25 to 30 minutes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On another baking sheet lined with foil and sprayed with cooking spray, place sliced ham in a single layer. Spray the side facing up with a thin coating of cooking spray and place in oven to crisp, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove cauliflower, mushrooms and ham from the oven. Discard rosemary and thyme and cover mushrooms to keep them warm. Transfer cauliflower to a blender. Add milk and pulse to combine. Season to taste with salt and pepper, then puree until smooth, adding additional liquid as needed to create a smooth, creamy soup. If necessary, heat soup in a large pot after blending.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle soup into individual bowls, and garnish with a ham crisp and mushrooms. Serve immediately.</p>"}]}