{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131014-pasta-orrechiette-brussels-sprouts-mushrooms-recipe-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brussels sprout", "easy", "mushroom", "orecchiette", "pasta", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Pasta With Mushrooms, Brussels Sprouts, and Parmesan", "link": "https://www.seriouseats.com/recipes/2013/10/orecchiette-pasta-with-mushrooms-brussels-sprouts-recipe.html", "description": "A quick dinner of orecchiette pasta tossed in a clingy sauce made with mushrooms, shallots, thyme, and brussels sprouts leaves.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Mushrooms", "Pasta", "Vegetarian"], "recipeIngredient": ["3 tablespoons olive oil", "1/4 pound brussels sprouts, divided into individual leaves", "Kosher salt and freshly ground black pepper", "8 ounces mixed mushrooms such as shiitake, button, cremini, and maitake", "1 medium shallot, finely minced (about 1/4 cup)", "2 medium cloves garlic, minced", "1 teaspoon picked fresh thyme leaves", "4 tablespoons butter", "2 teaspoons freshly squeezed juice from 1 lemon", "1/2 cup homemade or store-bought low sodium vegetable or chicken stock", "1 pound dried orecchiette", "2 ounces freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium pot of salted water to a boil. Heat 1 tablespoon olive oil in a large skillet over high heat until smoking. Add brussels sprouts, toss to coat in oil, season with salt and pepper, cook without moving until well charred on one side. Toss and continue to cook until leaves are bright green and charred in spots, about 2 minutes total. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons oil in the same skillet over high heat until lightly smoking. Add mushrooms and cook, tossing occasionally, until moisture has been evaporated and the mushrooms are well browned, about 4 minutes. Add shallots, garlic, and thyme and cook, stirring, until shallots are softened and fragrant, about 1 minute. Add butter, lemon juice, and stock. Simmer until sauce is reduced and emulsified, about 1 minute. Season to taste with salt and pepper (this may not be necessary if stock is store-bought). Set aside off heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add orecchiette to pot and cook, stirring occasionally, until nearly al dente (about 1 minute less than the package instructions). Drain, reserving 1/2 cup cooking water. Add orecchiette, half of Parmesan, reserved pasta cooking water, and a generous amount of black pepper to mushrooms. Cook, stirring, over high heat until pasta is fully al dente and liquid has thickened into a sauce that coats the pasta, about 1 minute. If sauce looks greasy or broken, add 2 tablespoons of stock or water and stir vigorously to bring it back together. Stir in brussels sprouts leaves and serve, topping with more cheese at the table.</p>"}]}