{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/2013.03.03-Indian-style-Chicken-Ghee-Roast.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["Beyond Curry", "chicken", "Dinner for Two", "ghee", "Indian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Ghee Roast", "link": "https://www.seriouseats.com/recipes/2013/03/chicken-ghee-roast-indian-recipes.html", "description": "Chicken Ghee Roast has nothing to do with an oven, but 'roast' is a term that is used quite loosely in the south of India to describe a dry dish which uses more of a braising technique. The ghee adds huge amounts of flavor to this dish which is simply finger-licking awesome.", "totalTime": "At least 3 hours and up to 2 days", "recipeYield": "Serves 2", "recipeCategory": ["Beyond Curry", "Chicken", "Indian", "Mains"], "recipeIngredient": ["<strong>For Marinating</strong>: ", "1/2 cup thick yoghurt", "2 teaspoons lime juice from one lime", "1 teaspoon turmeric powder", "Kosher salt and freshly ground black pepper", "4 whole chicken leg quarters (about 2 pounds total skinned", "&nbsp", "<strong>For Spice Paste</strong>: ", "3 tablespoons ghee or Indian clarified butter (divided)", "6 medium cloves garlic", "6 Kashmiri chillis (or small green Thai chilis)", "1 tablespoon corriander seeds ", "1/4 teaspoon fenugreek seed", "1 teaspoon cumin seed", "1 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Marinating:</strong> In a large bowl, mix yoghurt, lime juice, turmeric, 1 tablespoon kosher salt and 1 teaspoon pepper. Add the chicken and coat thoroughly. Seal the bowl with cling film and refrigerate at least 2 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spice Paste:</strong> When ready to cook, heat 2 teaspoons ghee in a cast iron skillet over medium heat until shimmering. Add garlic, chills, corriander seeds, fenugreek, and cumin, and cook, stirring consantly, until fragrant, about 5 minutes. Remove spices and allow mixture to cool. Transfer to a blender, small food processor, or mortar and pestle, and grind into a fine paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining ghee in the same cast iron skillet over medium heat until shimmering. Let excess marinade drip from chicken, then gently slide into the ghee and fry until lighty browned, about 5 minutes on each side. Make a clearing in the middle of the pan between the chicken and add the spice paste. Stir in that space until fragrant, about 5 minutes, before coating the chicken. Mix thoroughly. Add 1 cup water. Reduce heat to low and allow to cook until chicken is fully cooked and most of the water has dried out, about 10 minutes. Serve hot with white rice or bread.</p>"}]}