{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131021-270137-cook-the-book-bacon-and-deviled-eggs.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "maximum flavor"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bacon and Deviled Eggs From 'Maximum Flavor'", "link": "https://www.seriouseats.com/recipes/2013/10/bacon-and-deviled-eggs-from-maximum-flavor.html", "description": "It's a well-known non-secret among my friends that I'm a deviled egg fanatic. Without fail, I will order them at any restaurant, and find reasons to serve them at dinner parties, brunches, and any social gathering in between. So I had to try <strong><a href=\"http://ideasinfood.com/our-story.php\" target=\"_blank\">Aki Kamozawa</a></strong> and <strong><a href=\"http://ideasinfood.com/our-story.php\" target=\"_blank\">H. Alexander Talbot</a></strong>'s version in their new cookbook, <em><a href=\"http://www.amazon.com/Maximum-Flavor-Recipes-That-Change/dp/0770433219/?tag=serieats-20\">Maximum Flavor</a></em>.", "totalTime": "1 1/2 hours, plus 48 hours to marinate the eggs", "recipeYield": "Makes 24 deviled eggs", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Cook the Book", "Eggs", "Pork", "Snacks"], "recipeIngredient": ["<strong>Deviled Eggs</strong>", "12 large eggs", "4 cups (907 grams) cranberry juice", "1/2 ounce (15 grams) Lapsang Souchong tea (about 6 tea bags)", "1 tablespoon (18 grams) fine sea salt", "1/2 cup (100 grams) mayonnaise, preferably Duke’s or Hellmann’s", "1 tablespoon (14 grams) Dijon mustard", "1 tablespoon (14 grams) sweet pickle juice", "2 tablespoons (43 grams) red pepper jelly", "&nbsp", "<strong>Glazed Bacon</strong>", "6 slices bacon", "1/4 cup (85 grams) red pepper jelly"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook and brine the eggs:</strong> Set a stovetop steamer over high heat and bring the water to a boil. Put the eggs in the steamer basket, add them to the pot, cover, and steam the eggs for 14 minutes. While the eggs are steaming, prepare an ice water bath. When the eggs are cooked, transfer them to the ice water and let cool for about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large bowl, combine the cranberry juice, tea, and salt, stirring until the salt is dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the eggs out of the ice water, and use the back of a spoon to uniformly crack the shells all over without piercing the eggs or removing any of the shell. Put the cracked eggs into the brine and put another bowl on top of the eggs to keep them submerged. Refrigerate the eggs for 48 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 48 hours, take the eggs out of the brine and peel them, discarding the shells. Halve each egg lengthwise. Remove the yolks and set the whites aside. In a small food processor, combine the egg yolks, mayonnaise, mustard, and pickle juice and puree until smooth. Scoop the deviled egg mixture into a pastry bag fitted with a star tip and put the bag in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the bacon:</strong> Make the bacon: Preheat the oven to 350°F (175°C). Line a rimmed baking sheet with foil.<br />\r\nLay the bacon slices on a cutting board. Brush one side of each slice with some of the pepper jelly and then lay the slices glaze side up on a wire rack set over the foil-lined pan. Bake the bacon for 15 minutes, or until just crispy and glazed. Remove the bacon from the oven, brush both sides of the bacon with more of the jelly, and put it back in the oven for 3 more minutes. Remove the bacon from the oven and let cool. Cut each slice of bacon into 4 pieces so that you have 1 piece for each deviled egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the eggs:</strong> Put the egg whites on a cutting board or other flat work surface. Spoon 1/4 teaspoon pepper jelly into the bottom of each egg white. Pipe a rosette (about 1 tablespoon) of the egg yolk mixture on top of the jelly. Top with a slice of bacon. Arrange the deviled eggs on a cutting board or platter to serve.</p>"}]}