{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/080713-261666-cook-the-book-peppered-hanger-steak-rice-cakes-pea-shoots.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "rice", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peppered Hanger Steak with Crispy Rice Cakes from 'Treme'", "link": "https://www.seriouseats.com/recipes/2013/08/pepper-hanger-steak-with-rice-cakes-recipe-from-treme-cookbook.html", "description": "This flavorful hanger steak from the new <em><a href=\"http://www.amazon.com/books/dp/1452109699/?tag=serieats-20\">Treme</a></em> cookbook is coated in a spicy soy glaze, served with crisp sushi rice cakes and pea shoots.", "totalTime": "1 hour, plus an overnight rest for the rice", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Cook the Book", "Mains", "Rice"], "recipeIngredient": ["<strong>Rice Cakes</strong>", "1 cup sushi rice", "1 1/2 cups water ", "Fine sea salt", "3 tablespoons canola oil", "&nbsp", "<strong>Chile-Sweet Soy Glaze</strong>", "1 tablespoon Vietnamese chili-garlic sauce", "1 red Thai chile, minced, or a pinch of red pepper flakes", "2 tablespoons soy sauce", "1/2 cup <em>kecap manis</em> (Indonesian sweet soy sauce, available in Asian markets)", "1 teaspoon toasted sesame oil", "&nbsp", "<strong>Peppered Hanger Steak</strong>", "4 hanger steaks (about 6 ounces each)", "3 to 4 tablespoons cracked black pepper ", "Kosher salt", "2 tablespoons canola oil", "&nbsp", "<strong>To Finish</strong>", "2 tablespoons extra-virgin olive oil", "4 cups packed pea shoot leaves or spinach leaves ", "1 teaspoon Vietnamese chili-garlic sauce ", "3 tablespoons Chile–Sweet Soy Glaze ", "Fine sea salt ", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the rice cakes:</strong> In a sieve, thoroughly rinse the sushi rice under cold running water until the water runs clear. Place the rinsed rice in a small saucepan with the water and a generous pinch of salt. Bring the rice to a boil, uncovered, over medium-high heat. Reduce the heat to medium and simmer until most of the water has been absorbed by the rice, about 5 minutes. Cover the pan tightly, reduce the heat to low, and continue cooking for about 7 minutes longer. Remove from the heat and let stand, covered, for 15 minutes. The rice should be tender and all of the water absorbed. (Even very slightly overcooked rice is not a problem in this recipe, as that may help the rice cakes keep their shape.) Scoop the rice onto a small baking sheet lined with plastic wrap. Form the rice into a rough square 3/4 to 1 inch thick. Cover tightly and refrigerate overnight until cold and set. When the rice has set, cut 8 equal-size triangles of rice cake and set aside until ready to fry and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the steak:</strong> Generously season the hanger steaks with the cracked black pepper and kosher salt. In a cast-iron skillet over very high heat, heat the 2 tablespoons oil until almost smoking. Add the steaks to the pan and sear until nicely browned on both sides, about 3 minutes per side. Transfer the pan to the oven and bake until steaks are medium-rare, 7 to 10 minutes. Transfer the steaks to a cutting board and let rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the steaks are cooking and resting, finish the rice cakes. Heat the 3 tablespoons canola oil in a large nonstick sauté pan over medium-high heat. Carefully add the rice cakes to the hot oil. Cook until golden brown and toasty on one side, 3 to 4 minutes. Flip the rice cakes and continue cooking until golden brown on the other side, another 1 to 2 minutes. Transfer the rice cakes to a plate and cover to keep warm. Set aside, reserving the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the pan you used to fry the rice cakes, if necessary, and add the olive oil and pea shoots. Stir in the chili-garlic sauce, the sweet soy glaze, and season with sea salt and ground pepper. Sauté the pea shoots until just barely wilted. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve each of the steaks into 5 slices. Place 2 toasted rice cakes in the center of each plate, spoon the sautéed pea shoots over one side of the toasted rice cakes, and arrange the sliced beef around. Spoon the sweet soy glaze over and around the steak and serve at once. </p>"}]}