{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/131130-taiwan-eats-pineapple-cake-finished.jpg", "author": {"@type": "Person", "name": "Cathy Erway"}, "recipeCuisine": "", "keywords": ["cakes", "pastry", "pineapple", "taiwanese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Taiwanese Pineapple Cakes (Fung Li Su)", "link": "https://www.seriouseats.com/recipes/2013/12/taiwan-eats-taiwanese-pineapple-cake-fung-li-su-recipe.html", "description": "Taiwanese pineapple cakes (fung li su) are more like an encased pineapple tart, with a thick, jammy filling and a buttery crust.", "totalTime": "4 1/2 hours", "recipeYield": "Serves 12", "recipeCategory": ["Cakes", "Desserts", "Fruit Desserts", "Pineapple"], "recipeIngredient": ["1 medium-sized pineapple", "1 cup (8 ounces) water", "1 cup (7 ounces) plus 2 tablespoons sugar, divided", "1 cup (2 sticks) unsalted butter", "2 large egg yolks", "1 1/4 cups (6 1/4 ounces) all-purpose flour", "1/4 cup (1 1/2 ounces) cornstarch", "1/4 teaspoon baking powder", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the fronds and base from the pineapple. Holding it upright, slice off the thick skin all around the pineapple. Chop it into halves lengthwise. Chop each half into quarters lengthwise. Slice off the thick strip of the pineapple's core from each quarter along its length. Chop the remaining pineapple coarsely and transfer to a pot with the 1 cup of water and 1 cup of sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring pineapple mixture to a boil, stirring to dissolve the sugar. Reduce heat to medium or medium-low to cook at a rapid simmer. Cook uncovered, stirring occasionally, until the liquid has been reduced to a thick jam-like consistency and the color is orange, 2 to 3 hours. Use an immersion blender or transfer to a food processor to gently break up any remaining large chunks (do not over-process into a smooth paste). If mixture appears soupier after this step, transfer again to a pot and continue to simmer uncovered, stirring occasionally, until the mixture is dry enough to pick up with your hand and roll into a ball. You should have at least 1 cup of this pineapple filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the remaining 2 tablespoons sugar, egg yolk, and butter in a large mixing bowl until creamy and smooth. Whisk together flour, cornstarch, baking powder, and salt in a separate bowl. Gradually stir the dry ingredients into the wet ingredients until thoroughly incorporated. Form into two balls and cover with plastic wrap. Chill for at least 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to center position and preheat oven to 350°F. Cut each ball of dough into 6 equally-sized pieces. Flatten one piece against a lightly floured surface into a 3-inch round. Place 1 heaping tablespoon of the pineapple filling in the center of the round. Carefully fold the dough around the filling and enclose the edges. Place seam-side-down on the bottom of a lightly floured surface and press the ball down gently to flatten the top. Use a bench scraper to gently press the sides of the ball to form a rough rectangle. Repeat with remaining dough and pineapple filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the pastries at least one inch apart on an ungreased cookie sheet. Bake until the tops are pale golden-brown, about 30 minutes. Transfer to a cooling rack to cool before serving. </p>"}]}