{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130811-262575-tomato-martini.jpg", "author": {"@type": "Person", "name": "Autumn Giles"}, "recipeCuisine": "", "keywords": ["cocktail", "tomato", "vodka"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fresh Tomato Martini", "link": "https://www.seriouseats.com/recipes/2013/08/fresh-tomato-martini-cocktail-recipe.html", "description": "Not unlike a ripe, in-season tomato, the tomato vodka in this drink doesn't need a lot to dress it up. This is the cocktail equivalent of slicing up a beefsteak and showering it with crunchy salt.", "totalTime": "1 hour", "recipeYield": "makes 1 cocktail, makes enough tomato vodka for about 4 cocktails", "recipeCategory": ["Tomato", "Vodka"], "recipeIngredient": ["<strong>For the Tomato Vodka</strong>:", "16 ounces (about one large) beefsteak tomato, cut into large chunks", "1 cup vodka", " ", "<strong>For the Tomato Martini</strong>:", "3 ounces Tomato Vodka", "1/2 teaspoon good dry vermouth, such as Dolin", "1/4 teaspoon white wine vinegar", "Ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tomato Vodka</strong>: Combine the tomato and vodka in a blender. Pulse a few times on medium to break up the tomato then blend for about 5 more seconds to form a pulpy puree. Strain the puree through a very fine mesh strainer or a less fine one lined with a double layer of cheesecloth. Stir it gently a few times as it strains, but do not press. Strain until it stops dripping on its own, about 15 minutes. Store in the fridge if not using immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tomato Martini</strong>: Pour the tomato vodka, vermouth, and white wine vinegar into a cocktail shaker and fill it with ice. Shake until well chilled, about 20 seconds. Strain into chilled coupe glass and serve immediately. </p>"}]}