{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130715-very-small-anna-sour-cherry-lime-sorbet.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["amaretti", "cherries", "Cookies", "from the pastry dungeon", "ice cream", "sour cherries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sour Cherry-Lime Sorbet With Amaretti Cookies", "link": "https://www.seriouseats.com/recipes/2013/07/sour-cherry-lime-sorbet-amaretti-cookies-recipe.html", "description": "Sour cherries have a gloriously fleeting season, and since I can rarely afford to buy them more than once a year I splurge and make this sorbet in the peak of summer. Wonderfully tart and refreshing, it's always worth it, and homemade amaretti cookies make an absolutely lovely accompaniment for a naturally gluten-free, almost healthy treat.", "totalTime": "12 hours", "recipeYield": "Makes about 1 quart of sorbet, several dozen cookies", "recipeCategory": ["Cherry", "Fruit Desserts", "Ice Cream and Frozen Treats", "Very Small Anna"], "recipeIngredient": ["<strong>For the Sorbet</strong>:", "1 pound sour cherries, rinsed and pitted", "3/4 cup (about 5 ounces) sugar", "6 tablespoons juice from about 6 limes", "1 cup water", "1 tablespoon vodka (optional, see note)", " ", "<strong>For the Amaretti</strong>:", "3 cups blanched slivered almonds", "1 1/2 cups (about 10 ounces) sugar", "3 egg whites", "1 teaspoon almond extract or 1 tablespoon amaretto liqueur", "Pinch salt", "Demerara or muscovado sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sorbet</strong>: Combine cherries and sugar in medium saucepan and bring to a boil. Cover and reduce heat to simmer for 5 minutes. Allow to cool fully before proceeding. Place cooked cherries in blender and add other ingredients. Puree fully, then strain. Process in ice cream machine according to manufacturer's instructions. Pack into tightly lidded container and freeze until firm, at least 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Amaretti</strong>: Combine almonds and sugar in food processor, pulse until finely ground. Add remaining ingredients and process until a thick paste forms. Wrap tightly in plastic wrap and refrigerate overnight to firm. Place rack in center of oven. Preheat to 300&deg;F. Using cold, moist hands, gently roll dough into marble-sized balls. Rinse and wipe hands with a damp towel frequently to prevent sticking. Place balls and inch apart on parchment or silicone-lined baking sheets. Sprinkle generously with sugar in the raw and bake for 15 minutes, then rotate the pans and bake for another 10-15 minutes. To test for doneness, cut a cookie in half. The cookies will be toasted all the way through to the center when done. Allow to cool fully before storing in airtight containers.</p>"}]}