{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130622-256922-chicken-polenta-arugula-edit.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "Italian", "keywords": ["chicken", "chicken dinners", "Italian", "mains", "pine nuts", "polenta", "poultry", "shallots"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Creamy Polenta with Chicken, Caramelized Shallots, Arugula", "link": "https://www.seriouseats.com/recipes/2013/07/creamy-polenta-chicken-shallots-arugula-recipe.html", "description": "Creamy Parmesan polenta is topped with moist chicken, caramelized shallots, toasted pine nuts, and nutty arugula.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chicken Dinners", "Italian", "Mains", "Nuts"], "recipeIngredient": ["6 cups homemade or store-bought low sodium chicken stock, divided", "12 ounces boneless, skinless, chicken breast (about 2 medium)", "Kosher salt and freshly ground black pepper", "4 tablespoons olive oil, divided", "8 large shallots, sliced thin (about 3 cups)", "1 1/2 cups polenta (see note)", "3 tablespoons unsalted butter, cut into cubes", "2 ounces Parmesan cheese, grated", "1/3 cup toasted pine nuts", "4 cups arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice chicken in half horizontally so that pieces are of equal thickness. Heat 4 cups broth in medium saucepan over medium heat to simmer. Add chicken and reduce heat to bare simmer. Cook until chicken is just cooked through (160&deg;F), about 15 minutes. Transfer chicken to plate (reserve all broth) and shred into bite sized pieces when cool enough to handle. Place chicken in a small bowl and pour 3/4 cup broth over chicken to keep moist. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons oil in medium skillet over medium heat until shimmering. Add shallots, 1/4 teaspoon salt, and 1/4 teaspoon black pepper, and cook, stirring, until shallot begin to turn golden, 10 to 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 5 cups broth (using both chicken cooking broth and fresh unused broth) in large heavy-bottomed saucepan over medium-high heat. When broth comes to boil, whisk in polenta in a fine steady stream. Bring to simmer, whisking, then lower heat so that mixture remains at a low boil (see note). Cook until polenta is soft and creamy, stirring occasionally (see note), and adding extra broth as necessary (use water if broth runs out).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When polenta is cooked, remove from heat and whisk in butter and Parmesan until combined. Season to taste and keep warm (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chicken (with broth) to shallots and heat over medium heat until just warmed through. Season to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon polenta into serving bowls and top with chicken mixture and pine nuts. Top with arugula and drizzle with remaining oil and a sprinkle of salt and pepper. </p>"}]}