{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131219-277112-cook-the-book-classic-pot-roast-pistachio-salt.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["amy thielen", "beef", "Cook the Book", "main", "pot roast", "the new midwestern table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Beef Pot Roast with Pistachio Salt from 'The New Midwestern Table'", "link": "https://www.seriouseats.com/recipes/2013/12/classic-beef-pot-roast-with-pistachio-salt-from-the-new-midwestern-table.html", "description": "It may not be as much of a showstopper as a crown roast of pork or an elegant roast goose, but when prepared properly, a pot roast will be far more tender, delicate, and memorable than any of these typical centerpieces. Even better, it can be made in advance and popped in the oven to heat through at whatever hour needed.", "totalTime": "5 to 5 1/2 hours", "recipeYield": "Serves 8", "recipeCategory": ["Beef", "Cook the Book", "Gluten-Free", "Mains"], "recipeIngredient": ["1 (4-pound) beef chuck roast, the more marbled the better", "Fine sea salt and freshly ground black pepper", "1 tablespoon canola oil", "2 tablespoons salted butter", "3 stalks celery, cut into thirds", "3 large carrots, quartered", "2 medium turnips, quartered", "3/4 cup dry red wine", "2 cups beef stock, low-sodium store-bought or homemade", "2 large Vidalia onions, cut into eighths", "11 cloves garlic: 10 whole, 1 minced", "4 dried bay leaves", "1 tablespoon minced fresh rosemary", "1 tablespoon minced fresh thyme", "1 cup cherry tomatoes", "1/4 cup shelled salted pistachios, chopped", "1/4 cup chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the roast liberally with salt and pepper. Heat your largest high-sided skillet over high heat, add the oil, and then add the roast. Sear it quickly until dark brown on all sides, about 8 minutes. Set the roast aside, pour off and discard the excess fat from the skillet, and let the skillet cool a bit. Then add the butter, celery, carrots, turnips, 1/2 teaspoon salt, and 3/4 teaspoon pepper. Cook over medium heat, tossing, until the vegetables begin to soften at the edges, about 5 minutes. Transfer them to a wide bowl and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wine to the skillet, bring to a boil, and cook until slightly reduced, about 3 minutes. Add the beef stock, and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the onions in the bottom of a large covered roasting pan and set the beef on top of them. Scatter the whole garlic cloves, bay leaves, rosemary, and thyme over and around the roast. Pour the beef stock mixture over the meat and cover the pan tightly. Braise for 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven temperature to 285°F, and continue to braise for 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover the pan, skim off the fat around the edges with a small ladle, and discard it. With two large forks, carefully turn the meat over and ladle some juice over the top. Add the reserved sautéed vegetables, arranging them around the perimeter of the meat. Cover the pan and braise for 1 more hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skim the fat again with a small ladle, baste the top of the meat again, and then scatter the cherry tomatoes across the top, some dropping onto the meat, some onto the vegetables. Don’t stir again. Braise, uncovered this time to allow the tomatoes to split and shrink and the top of the meat to brown, until the meat feels extremely tender at the touch of a fork, 30 minutes to 1 hour. Discard the bay leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the pistachio salt, combine the pistachios, parsley, minced garlic, and 1/4 teaspoon each of salt and pepper in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before serving, dust the pistachio salt evenly over the roast (reserve any extra for passing at the table). Serve the pot roast right from the pan, pulling apart the meat with two forks for most of it, and gently carving the marbled top end of the chuck into thick slices.</p>"}]}