{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130304-baked-acorn-squash-stuffing.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Acorn Squash With Wild Rice, Pecan, and Cranberry Stuffing", "link": "https://www.seriouseats.com/recipes/2013/03/baked-acorn-squash-with-wild-rice-pecan-cranberry-stuffing.html", "description": "Sweet, creamy acorn squash is filled with a wild rice mixture accented with toasty pecans and tart chewy cranberries, with some salty ricotta salata cheese folded in for contrast.", "totalTime": "1 hour 45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Vegetarian"], "recipeIngredient": ["4 small acorn squash", "1/2 cup wild rice, boiled in 2 cups water for 30 minutes, then drained", "1 cup cooked long-grain white rice (1/2 cup raw rice)", "2 tablespoons extra virgin olive oil, plus more for drizzling", "1 medium onion, finely chopped (about 1 cup)", "2 medium garlic cloves, minced (about 2 teaspoons)", "1 teaspoon chopped fresh thyme leaves", "Kosher salt and freshly ground black pepper", "1/4 cup pecans, toasted and finely chopped", "1/2 cup dried cranberries", "1/2 cup grated ricotta salata cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove seeds from acorn squash: using a sharp chef's knife, trim away a small flat slice from the bottom of each squash so it sits flat. Then, cut off the top 1/2\" of each squash, exposing the seeds. Use a tablespoon to scrape out seeds and fibers. Place squash on a baking sheet, season lightly with salt and pepper, and drizzle each squash with 1/2 teaspoon olive oil. Bake for 45 minutes, then remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, prepare the stuffing: heat 2 tablespoons olive oil in a large cast iron skillet over medium heat until shimmering. Add the onion, garlic and thyme and cook, stirring occasionally, until onion sweats but does not brown, about 4 minutes. Add cooked wild rice and cooked white rice to the skillet and stir to combine. Add chopped pecans, dried cranberries and ricotta salata and stir to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stuff each acorn squash with about 1/4 of stuffing mixture, packing stuffing into squash cavity and mounding it slightly. Drizzle each squash with 1/2 teaspoon olive oil and bake until squash is tender and stuffing browns slightly, about 40 minutes. </p>"}]}