{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131014-266253-ccornpiere4.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["Cakespy", "candy corn", "pecan pie", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Candy Corn Pecan Pie", "link": "https://www.seriouseats.com/recipes/2013/10/halloween-candy-corn-pecan-pie.html", "description": "The idea is simple: classic pecan pie, plus candy corn. The candy corn melts so beautifully into the corn syrup and brown sugar mixture that it must feel like it's coming home; it adds a nice, vanilla-y sweetness to the pie that will satisfy even the sweetest of tooths.", "totalTime": "2 hours, 20 minutes", "recipeYield": "Makes one 9-inch pie", "recipeCategory": ["Cakespy", "Halloween", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 unbaked 9-inch <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">pie crust</a>", "1 1/2 cups (about 5.5 ounces) pecans, lightly toasted", "1 cup (about 11 ounces) light corn syrup", "3/4 cup (about 5.6 ounces) dark brown sugar, packed", "1 tablespoon unsalted butter", "2 teaspoons vanilla extract", "3 large eggs, lightly beaten", "1/2 to 3/4 cup candy corn "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325&deg;F. If you haven't already, place your pie crust in a pie plate. Set it in the refrigerator until you're ready to fill it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you glazed over the part of the ingredients that asked for the pecans to be toasted, go ahead and toast them while the oven preheats. Scatter them on a baking sheet and place in the oven. Once fragrant, remove them. It shouldn't take more than 8 minutes or so in the preheating oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the filling. Put the corn syrup and brown sugar in a heavy saucepan over medium heat and cook, stirring occasionally, until the sugar dissolves. Remove from heat and add the butter, and vanilla. Let the mixture cool, and then add the eggs and whisk until smooth (don't add the eggs while the mixture is still very hot, otherwise you'll have scrambled eggs!).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the pie crust out of the fridge. Now, arrange the pecans (which should be toasty but cooled by now) along the bottom of the crust. Add the candy corn. I lightly tussled the mixture by hand, to make sure it was nicely and evenly mixed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the hot sugar slurry on top, gently, so as not to upset your delicately proportioned candy and nuts. Some will rise like magic to the top. That's a good thing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in the preheated oven and bake for 40 to 45 minutes, or until the filling is set and the edges of the crust are browned. It will still wobble in the middle just a little bit when you take it out, but the outer parts should be firm. The center part will set further once removed from heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a couple more candy corn on the top of the pie right after you've taken it out of the oven. This will help people to know that it has candy corn inside, as the candies will have melted and might not be recognizable. Be gentle when placing them on top, so you don't hurt yourself or injure the pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool on a wire rack for about 20 minutes. I like to then transfer it to the refrigerator for about an hour, so that it can set completely. Serve at room temperature, or lightly warm and serve with ice cream.</p>"}]}