{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130315-skillet-supper-chicken-mushroom-potatoes.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["chicken", "fingerling potatoes", "mushrooms", "One Pot Wonder", "potatoes", "skillet suppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Skillet Chicken with Potatoes and Mushrooms", "link": "https://www.seriouseats.com/recipes/2013/03/skillet-chicken-potatoes-mushrooms-recipe.html", "description": "Pan-roasted chicken, mushrooms and potatoes with a rich chicken jus, all cooked together in one skillet.", "totalTime": "45 minutes", "recipeYield": "Serves 4 with a hearty salad", "recipeCategory": ["Chicken", "Mains", "Mushrooms", "One-Pot Wonders", "Potato", "Stovetop"], "recipeIngredient": ["4 bone-in, skin-on chicken thighs (about 1 1/2 pounds)", "Kosher salt and freshly ground black pepper", "2 tablespoons canola, vegetable, or light olive oil", "¾ pounds fresh oyster mushrooms, or other varieties like shiitake or maitake", "1 pound fingerling potatoes (about 4 cups), sliced in half lengthwise", "1 medium onion, finely chopped (about 1 cup)", "1 ½ cups homemade or store-bought low sodium chicken broth", "1 tablespoon cold butter", "2 tablespoons fresh juice from one 1 lemon", "2 tablespoons chopped parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken thighs with salt and pepper. Heat 1 tablespoon of oil in a 12-inch skillet over medium-high heat until shimmering. Add the mushrooms, season with salt and pepper, and cook, stirring occasionally, until browned, 3 to 4 minutes. Transfer to a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium high heat and add remaining tablespoon oil. Heat until shimmering. Add chicken thighs skin-side down and cook without moving until golden brown and crisp, 7 to 9 minutes. Flip, and cook until browned on second side, another 3 to 4s. Transfer to a large plate and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the potatoes to the fat in the pan and cook over medium-high heat, stirring and tossing occasionally until lightly browned, 5 to 7 minutes. Add the onion and cook, stirring, until slightly softened, about 2 minutes. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken stock and deglaze the pan, scraping up brown bits on the bottom. Push the potatoes to the side and place the chicken back in, skin side up. Bring the liquid to a boil, reduce to a simmer, and cook, uncovered, until the thighs register at least 165°F on an instant-read thermometer and the stock is reduced to about a half cup, 18 to 20 minutes. Place the mushrooms back on top during the last 2 minutes of cooking to warm through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to serving platter. Off heat, stir butter, lemon juice, and half of parsley into sauce and vegetables in skillet. Pour over and around chicken, sprinkle with remaining parsley, and serve.</p>"}]}