{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130127-238521-sandwiched-grilled-cheese-sandwich-with-sun-dried-tomatoes-and-harissa-edit.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["grilled cheese", "harissa", "quick", "sandwich", "sun-dried tomatoes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Cheese Sandwich With Sun-Dried Tomatoes and Harissa", "link": "https://www.seriouseats.com/recipes/2013/02/griled-cheese-with-sun-dried-tomatoes-harissa-recipe.html", "description": "A grilled cheese sandwich made with sharp white cheddar cheese is given new life with new flavors when studded with sun-dried tomatoes, and spread with spicy Harissa. And instead of using butter to brown and crisp this sandwich, brush the bread with the olive oil in which the sun-dried tomatoes are packed for an additional hit of tomato essence.", "totalTime": "15 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Cheese", "Sandwiches", "Vegetarian"], "recipeIngredient": ["2 tablespoons sun-dried tomatoes packed in olive oil, drained, plus oil from jar for brushing on bread", "4 slices sourdough bread", "Harissa paste, for spreading", "1 cup shredded sharp white chedder cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip a pastry brush into the jar of olive oil and sun-dried tomatoes. Brush 1 side of each slice of bread with the oil, then turn the bread over. Spread as much or as little harissa paste as you'd like (depending on desired level of spice) on the remaining sides of the bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Evenly distribute the cheese over two slices of bread. Divide the chopped tomatoes among the cheese-topped bread, then top with the remaining slices of bread. Heat a large cast iron, or nonstick, skillet over medium heat. Cook the sandwiches until golden brown on all sides and the cheese is melted, 3 to 4 minutes per side. Serve immediately.</p>"}]}