{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130729-260928-lunch-box-salami-sub.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["kale", "lunch box", "make ahead", "salami", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Make-Ahead Salami Sub With White Bean Spread and Kale-Slaw", "link": "https://www.seriouseats.com/recipes/2013/07/lunch-box-make-ahead-salami-sub-white-bean-spread-kale-slaw-recipe.html", "description": "The key to a make-ahead sub is choosing toppings that won't wilt or dry out, and to choose a bread that won't quickly turn stale or soggy. This sandwich iteration of the classic beans 'n' greens pairing fits all the criteria, and takes less than 20 minutes to throw together.", "totalTime": "20 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Kale", "Lunch Box", "Mains", "Sandwiches"], "recipeIngredient": ["2 1/2 tablespoons olive oil", "1 clove garlic, thinly sliced", "1 (15-ounce) can cannellini beans, drained and rinsed", "1 bay leaf", "Kosher salt", "1/4  cup homemade or store-bought low sodium chicken stock", "1 teaspoon prepared horseradish", "1 1/2 tablespoons red wine or sherry vinegar", "4 ounces lacinato (flat) kale, thinly sliced", "4 ounces sliced salami or sopressata", "2 (6-inch) baguettes or ciabatta rolls"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil in a medium skillet over low heat until shimmering. Add garlic and cook, stirring, until fragrant, about 2 minutes. Add beans, bay leaf, and 1/8 teaspoon salt. Raise heat to medium-high and cook, stirring, for 2 minutes. Add stock and simmer until reduced by half, about 3 minutes. Transfer immediately to bowl. Discard bay leaf and smash beans using fork or rubber spatula. Fold in horseradish and season to taste with more salt and desired. Spread should be thick and creamy, not thick like a paste. If too thick, thin with a little more hot chicken stock. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together remaining olive oil, vinegar, and a pinch of salt. Toss with kale, rubbing well into leaves. Slice bread and spread each side generously with white bean spread, top with the kale and salami. Serve immediately, or wrap and refrigerate until ready to eat (ideally no more than 4 hours for best flavor).</p>"}]}