{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130823-bakethebook-tiramisucharlotte.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "Italian", "keywords": ["cake", "coffee", "Italian", "marscapone", "tiramisu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tiramisu Charlotte", "link": "https://www.seriouseats.com/recipes/2013/08/tiramisu-charlotte-coffee-cocoa-cake-recipe.html", "description": "Sink into layers of cocoa-dusted mascarpone, coffee syrup and sweet, light cake in this <em><strong><a href=\"http://www.amazon.com/?tag=serieats-20\" target=\"_blank\">Say It With Cake</a></strong></em> tiramisu charlotte. An edging of ladyfingers lends an elegant presentation.", "totalTime": "6 hours, including baking and chilling", "recipeYield": "serves 15", "recipeCategory": ["Bake the Book", "Cakes", "Italian"], "recipeIngredient": ["2 tbsp unsalted butter, melted and cooled, plus extra butter for greasing", "4 large eggs", "1/2 cup superfine sugar", "3/4 cup all-purpose flour", " ", "<strong>Mascarpone mixture</strong>", "4 large eggs, separated", "3/4 cup superfine sugar", "9 oz mascarpone", " ", "<strong>Coffee syrup</strong>", "2/3 cup strong coffee, preferably espresso", "4 tbsp Marsala or Madeira, or to taste", " ", "<strong>To finish</strong>", "cocoa powder, for dusting", "7oz ladyfingers", "3 1/2 oz dark chocolate (about 70% cocoa solids), in one piece"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F, then grease and line an 8in cake pan with parchment paper, greasing the parchment too. Put the eggs and sugar in a heatproof bowl set over a pan of gently simmering water, making sure the bottom of the bowl doesn’t touch the water. Whisk constantly until the sugar has dissolved and the mixture is just warm to the touch. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the pan and, using an electric mixer, beat for 5 minutes on high speed, then reduce the speed to medium and beat for another 3 minutes. By this stage the mixture should have tripled in volume, and when the beaters are lifted from the bowl they should form a slowly dissolving ribbon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift in the flour and gently fold together, making sure all the flour is combined, but trying to keep as much volume as possible. Take a large spoonful of the batter and add it to the melted butter, then mix together (this will lighten the butter and help to incorporate it into the batter). Gently fold this into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan and gently level out. Bake for 25 minutes or until the cake is risen and golden, or when a skewer inserted into the middle of the cake comes out clean. Let cool in the pan for 10 minutes before turning onto a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the mascarpone mixture, beat the egg yolks and ½ cup of the superfine sugar until pale and creamy, then add the mascarpone and beat until smooth. Pour the egg whites into a clean, grease-free bowl and whisk until they form soft peaks. Slowly add the remaining sugar and whisk to form firm peaks. Gently fold the meringue into the mascarpone mixture and set aside. To make the coffee syrup, mix the coffee and Marsala together in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cake, use a serrated knife to slice the cake into three layers, then put the first layer into the bottom of a 9in springform cake pan. Brush the top with about a third of the coffee syrup and top with just under half the mascarpone mixture. Dust the mascarpone with about 1 heaping teaspoon cocoa powder. Repeat the process with the second layer of cake. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the ladyfingers down around the sides of the pan, then add the final layer of cake to the top and gently press down (this will help to stick the ladyfingers to the cake). Brush with the coffee and top with the remaining mascarpone mixture, gently leveling it out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill the cake for 4 hours. Just before serving, use a sharp knife or a vegetable peeler to grate the bar of chocolate to create shavings. Top the cake with the chocolate shavings, then remove the springform collar. </p>"}]}