{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130820-262968-GFTues-BlueberryMuffinCake-Recipes.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["blueberry", "brunch", "cake", "gluten free", "muffin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Blueberry Muffin Cake", "link": "https://www.seriouseats.com/recipes/2013/08/gluten-free-blueberry-muffin-cake-recipe.html", "description": "Whether you're baking up a batch of muffins or a family-style breakfast cake, this gluten-free recipe is a delightful, not-too-sweet celebration of blueberry season.", "totalTime": "about 80 minutes", "recipeYield": "Serves 12", "recipeCategory": ["Blueberry", "Breakfast and Brunch", "Breakfast Sweets", "Cakes", "Gluten-Free", "Gluten-Free Tuesday", "Quick Bread"], "recipeIngredient": ["Nonstick gluten-free cooking spray", "1 1/3 cups (5 ounces) sorghum flour plus one tablespoon, divided", "1 1/4 cups (10 ounces) granulated sugar", "1/2 cup (2 ounces) sweet rice flour", "1/2 cup (2 ounces) potato starch", "2 teaspoons baking powder", "3/4 teaspoon salt", "10 tablespoons (1 1/4 sticks; 5 ounces) unsalted butter, cold, cut into 10 pieces", "2 large eggs", "3/4 cup milk", "1 teaspoon vanilla extract", "1 pint blueberries, washed and picked over to remove stems OR 2 cups frozen blueberries, thawed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Lightly spray 9-inch square baking pan with nonstick cooking spray. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Food Processor Directions</strong><br />\r\nCombine 1 1/3 cups sorghum flour, granulated sugar, sweet rice flour, potato starch, baking powder, and salt in bowl of large (14 cup) food processor. Pulse to combine. Add the butter. Pulse until no large pieces of butter are visible. The mixture should appear uniform. Add the eggs. Pulse to combine. Mixture will be dry. Will the food processor running, add the milk and vanilla through the feed tube. (If your food processor doesn’t have a feed tube, add the milk in four additions, blending thoroughly between each addition. Add the vanilla with the final addition of milk.) Once you’ve added the milk, mix the batter for one minute. Using a flexible spatula, transfer the batter to a large mixing bowl. Toss the blueberries with remaining sorghum flour.  Gently fold in the blueberries. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mixing Bowl Directions </strong><br />\r\nToss the blueberries with remaining sorghum flour. Switch back to the wooden spoon and gently fold in the blueberries. Combine 1 1/3 cups sorghum flour, granulated sugar, sweet rice flour, potato starch, baking powder, and salt in a large mixing bowl. Cut butter into dry ingredients using a fork or pastry cutter until no large pieces of butter remain. The mixture should feel sandy and hold together if pressed. Using a wooden spoon (or switch to an electric mixer), stir in the eggs. The batter will be dry. Switch to a balloon whisk. Add the milk in four additions, blending thoroughly between each addition. Add the vanilla with the final addition of milk. Once you’ve added the milk, whisk the batter for one minute. Toss the blueberries with remaining sorghum flour. Switch back to the wooden spoon and gently fold in the blueberries. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until cake is golden brown and a cake tester inserted into the middle of the cake comes out clean, about one hour. Remove pan from oven and place on a wire rack to cool. Cut into squares and serve. Store leftover cake covered on the counter for up to three days. <br />\r\n</p>"}]}