{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130210-pambazo-torta-fried-eggplant-vegan-11.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["cinco de mayo", "eggplant", "Mexican", "quick", "sandwich", "tortas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Mexican Fried Eggplant Sandwich (Vegan Tortas and Pambazos)", "link": "https://www.seriouseats.com/recipes/2013/02/mexican-fried-eggplant-sandwich-vegan-tortas-pambazos-recipe.html", "description": "Hearty vegan Mexican-style sandwiches made with fried eggplant, refried beans, roasted chilies, and pickled red onions, served in a toasted roll doused in enchilada sauce.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Dairy-Free", "Eggplant", "Mexican", "Sandwiches", "Vegan", "Vegetarian"], "recipeIngredient": ["2 medium poblano peppers", "1 medium egplant, cut into 1/2-inch planks", "Kosher salt", "1/2 cup flour", "1 quart vegetable oil", "1 cup panko-style breadcrumbs", "1 cup <a href=\"http://www.seriouseats.com/recipes/2013/02/spicy-vegan-refried-beans.html\">homemade</a> or store-bought vegetarian refried beans", "2 tablespoons finely chopped chipotle pepper in adobo sauce", "2 teaspoons dark molasses", "4 hearty sandwich or hero rolls", "3/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/05/pickled-red-onions.html\">pickled red onions</a>", "2 cups shredded iceberg lettuce", "Handful fresh cilantro leaves", "1 avocado, sliced", "&nbsp;", "<strong>If Making Pambazos:</strong>", "1 1/2 cups store-bought or <a href=\"http://www.seriouseats.com/2012/05/sauced-red-enchilada-sauce.html\">homemade red enchilada sauce</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place poblano peppers directly over flame of a gas burner and cook, turning occasionally, until blackened on all sides, about 10 minutes. Alternatively, broil as close as you can get to broiler element, turning occasionally, until blackened on all sides, about 10 minutes. Transfer to a bowl, cover tightly in plastic wrap, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, season eggplant slices evenly with salt and pepper. Place on a paper towel-lined plate and cover with another paper towel. Combine flour and 1/2 cup water in a medium bowl. Season with salt. Place panko in a medium bowl. Heat oil in a large wok, cast iron fryer, or Dutch oven to 375°F. Adjust flame to maintain temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press down on eggplant slices to remove excess moisture, then transfer to bowl with flour/water mixture 3 to 4 pieces at a time. Lift eggplant, allow excess batter to drain, then transfer to breadcrumbs and toss to coat, pressing on crumbs to adhere firmly. Transfer to a large plate. Repeat until all eggplant is coated in crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches (do not add more than a single layer of eggplant), carefully add eggplant slices to oil and cook, turning occasionally, until golden brown and crisp on all sides, about 4 minutes. Transfer to a paper towel-lined plate, season immediately with salt, and repeat until all eggplant is cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully peel charred skin from poblano peppers, remove stems and seeds, and cut into 1/4- to 1/2-inch strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine refried beans, chipotle peppers, and molasses. Stir with a fork until homogenous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble sandwiches, split rolls in half. Spread bean mixture evenly over bottom halves. Top with pepper strips, fried eggplant, pickled red onions, shredded lettuce, and cilantro. Spread sliced avocados evenly on cut-side of top half of rolls. Close sandwiches, pressing down gently to compress.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For tortas</strong>, serve as-is, or toast in a panini press or in a hot oven for a few minutes if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For pambazos</strong>, place enchilada sauce in a large bowl. Transfer sandwiches to bowl one at a time and spoon sauce over them until completely coated. Transfer to a panini press and grill until toasted and sauce is lightly charred, about 4 minutes. Serve immediately.</p>"}]}