{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130311-243591-MarinatedMushrooms.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["kale", "kale salads", "lunch", "lunch box", "make ahead", "mushrooms", "quick", "salad", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Marinated Mushrooms with Kale, Shaved Carrots and Parmesan", "link": "https://www.seriouseats.com/recipes/2013/03/make-ahead-marinated-mushrooms-with-kale-shaved-carrots-parmesan-recipe.html", "description": "The beauty of marinated mushrooms is you can't really go wrong; you can marinate them in pretty much whatever you have on hand. If you have fresh herbs, definitely throw those in there, and minced shallots would work great, too. This is ideal for a lunch box because the mushroom marinade doubles as your salad dressing, and because this salad is all about sturdy vegetables, nothing will wilt before lunchtime.", "totalTime": "8 hours 15 minutes (includes marinating time)", "recipeYield": "serves 2", "recipeCategory": ["Kale", "Lunch Box", "Mains", "Mushrooms", "Salads", "Vegetarian"], "recipeIngredient": ["5 tablespoons plus 2 teaspoons olive oil", "1 teaspoon crushed red pepper flakes", "1/2 to 1 tablespoon Dijon or whole-grain mustard", "2 medium cloves garlic, smashed and halved", "2 tablespoons juice from 1 lemon", "Kosher salt and freshly ground black pepper ", "5 to 6 ounces button or cremini mushrooms, sliced 1/2-inch thick", "1 bunch broccolini or broccoli rabe, cut into 1-inch pieces", "1/4 cup shaved or grated Parmesan ", "1 large carrot, shaved into ribbons with vegetable peeler", "1 bunch flat kale, such as Lacinato (Dinosaur), stems removed, leaves torn into pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together 6 tablespoons olive oil, mustard, pepper flakes, garlic, lemon juice and 1 large pinch each salt and black pepper. Add mushrooms; toss to coat (should be partly submerged in marinade). Cover and let marinate in refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 2 teaspoons olive oil in large skillet over medium-high heat until shimmering. Add broccolini and pinch salt. Cook, stirring occasionally, until bright green, about 5 minutes. Let cool, then toss together with Parmesan, carrots and kale. Store in airtight container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove garlic from mushroom marinade. Spoon mushrooms and remaining marinade over salad and toss together. If preparing for work, pack altogether in airtight container to go. </p>"}]}