{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/061313-255155-cook-the-book-sukiyaki-in-an-american-kitchen.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["bbc sauce", "beef", "Cook the Book", "hiroko shimbo", "hiroko's american kitchen", "mushrooms", "onions", "squash", "sukiyaki", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sukiyaki in an American Kitchen from 'Hiroko's American Kitchen'", "link": "https://www.seriouseats.com/recipes/2013/06/sukiyaki-in-an-american-kitchen-from-hirokos.html", "description": "Traditional <a href=\"http://en.wikipedia.org/wiki/Sukiyaki\">sukiyaki</a> is a hot pot-style dish of beef and vegetables simmered in a broth of soy sauce, sugar, and mirin. It's a popular meal in Japan, but because of the lack of tabletop cooking vessels in the US, sukiyaki is challenging to replicate here. <strong><a href=\"http://www.hirokoskitchen.com/bio\">Hiroko Shimbo</a></strong>'s version in <em><a href=\"http://www.amazon.com/Hirokos-American-Kitchen-Cooking-Japanese/dp/1449409784/?tag=serieats-20\">Hiroko's American Kitchen</a></em> drops the hot pot entirely to create a one dish meal more suitable to the American home cook.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Cook the Book", "Mains", "Mushrooms", "Squash", "Sweet Potatoes and Yams"], "recipeIngredient": ["<strong>BBC Sauce</strong>", "1 cup mirin (sweet cooking wine)", "1/2 cup sake (rice wine)", "1/2 cup shoyu (soy sauce)", "1/4 cup sugar", "2 scallions", "2 akatogarashi (Japanese dried red chile peppers) or 1 1/2 teaspoons red pepper flakes", "&nbsp", "<strong>Sukiyaki</strong>", "4 large cremini mushrooms (4 ounces)", "1 small yellow zucchini (5 ounces)", "1 small green zucchini (5 ounces)", "1 thin and long sweet potato (8 ounces)", "1 bunch watercress", "4 cipollini onions (5 ounces), peeled", "4 round eye steaks (2 pounds)", "Sea salt and freshly ground black pepper", "2 1/2 tablespoons canola oil or vegetable oil", "1/2 cup BBC Sauce (above)", "1/2 cup sake (rice wine)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the BBC sauce:</strong> Place the mirin and sake in a small pot over medium heat, and bring it to a simmer. Add the soy sauce, sugar, and scallions and cook the sauce for 8 minutes. Remove the pot from the heat and let cool. Discard the scallions and add the chile peppers. (Extra sauce can be refrigerated for up to 6 months.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sukiyaki:</strong> Remove the hard bottom part of the mushroom stems and cut the mushrooms in half. Cut the yellow and green zucchini into 6 pieces each (widest part is 1 1/2 inches), using the <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-cut-carrots-slideshow.html#show-90385\">rangiri technique</a>. Cut the sweet potato (skin on) into 8 pieces using the <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-cut-carrots-slideshow.html#show-90385\">rangiri technique</a>. Remove the hard bottom part of the stems of the watercress, and cut the bunch in half crosswise. Set the watercress aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sweet potato pieces and cipollini onions in a large pot with cold water to cover over high heat, and bring it to a simmer. Add the mushrooms and yellow and green zucchini and cook for 2 minutes. Using a slotted spoon, transfer the mushrooms and zucchini to a colander to air-dry while the onions and sweet potatoes continue to cook for 5 more minutes. Using a slotted spoon, transfer the onions to the colander to air-dry while the sweet potatoes continue to cook for 7 minutes. Using a slotted spoon, transfer the sweet potatoes to the colander and air-dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the beef with salt and pepper on both sides. Heat the canola oil in a large skillet over medium heat, add the beef, and cook until both sides are golden; total cooking time is about 6 minutes. Transfer the beef to a cutting board. Add the vegetables to the skillet and cook until the surfaces of each vegetable are lightly golden. Remove the skillet from the heat, leaving the vegetables in the skillet. Cut each steak into 6 pieces. Push the vegetables to one side and return the beef to the skillet. Pour the BBC Sauce and sake over the beef and vegetables, and return the skillet to medium-high heat. Add the watercress and cook for 1 to 2 minutes, frequently basting the beef and vegetables with the sauce. Divide the beef and vegetables among deep bowls and serve.</p>"}]}