{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130422-249176-chocolate-peanut-pie-2.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate", "peanuts", "pie", "southern sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Peanut Pie", "link": "https://www.seriouseats.com/recipes/2013/04/chocolate-peanut-pie-recipe.html", "description": "The chocolate, peanut, and sweet goo combination in this pie is reminiscent of a candy bar come to life, with an added air of sophistication from the molasses.", "totalTime": "3 hours", "recipeYield": "Serves 8", "recipeCategory": ["American Classics", "Chocolate", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["One half recipe <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">Easy Pie Dough</a> (or your favorite butter pie crust)", "4 ounces 72% cacao dark chocolate, melted in the microwave or double boiler", "6 ounces dark corn syrup", "2 ounces molasses ", "3 ounces dark brown sugar", "2 teaspoons vanilla extract", "1 egg", "2 yolks", "1/2 teaspoon cinnamon", "Pinch of Kosher salt", "6 ounces split, roasted, salted peanuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare the crust:</strong> Set oven rack to the center position and preheat the oven to 425°F. Roll out your pie crust to a 12-inch circle then press it into a 9-inch pie plate. Flute the edges and place in the freezer for 15 minutes to chill. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chilled pie crust from the freezer and line the bottom with foil or parchment paper. Fill the liner with pie weights or dried beans. Bake for 20 minutes. Remove the weights and liner and then bake for 5 to 10 minutes more or until the bottom of the pie starts to brown and sets. Remove pie shell from the oven and set aside to cool for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread melted chocolate on the bottom of the crust. Set aside while you prepare the rest of the filling. Set oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the whisk attachment, add corn syrup, molasses, brown sugar, and vanilla. Mix until thoroughly combined. In a small bowl, lightly whisk together egg, egg yolks, and cinnamon. Add egg mixture to molasses mixture whisking on medium low speed until just combined. Pour filling into prepared pie shell then sprinkle the top with peanuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 40-50 minutes or until the center is set and no longer wobbles when you gently shake it. If the edges are beginning to get too browned while the center is still cooking you can cover them with small pieces of aluminum foil. Remove from oven and cool completely before serving.</p>"}]}