{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130605-253977-british-bites-rocket-salmon-leek-tart.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["arugula", "british bites", "leeks", "pies", "quiche", "salmon", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Arugula, Salmon, and Leek Tart", "link": "https://www.seriouseats.com/recipes/2013/06/arugula-salmon-leek-tart-recipe.html", "description": "We're starting to get into the season of fantastic greens, and this recipe calls for one of my favorites. Arugula (also known as rocket) is prepared in two ways&mdash;chopped and quickly cooked with leeks for the tart filling, as well as lightly dressed and served on top, adding its characteristic bright, bitter flavor to an otherwise rich, creamy dish.", "totalTime": "1 hour 10 minutes", "recipeYield": "Serves 6", "recipeCategory": ["British Bites", "Eggs", "Leafy Greens", "Mains", "Quiche", "Salmon"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">pie dough</a> (see note)", "1 tablespoon butter", "1 leek, white and light green parts only, thinly sliced (about 1 cup)", "5 ounces baby arugula, divided", "3/4 pound salmon, skinned and cut into 1 inch pieces", "Kosher salt and freshly ground black pepper", "1/2 cup cream", "3 eggs, beaten", "1 tablespoon olive oil", "2 teaspoons lemon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 425[&deg;]. Roll our pie crust and place in a 12 inch tart pan. Trim edges. Prick pie crust all over with a fork. Transfer to freezer for at least 15 minutes. When ready to bake, place on a rimmed baking sheet and bake until golden, about 15 minutes. Remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in a large skillet over medium high heat until melted. Add leek and cook, stirring often until leek is soft, about 4 minutes. Roughly chop half of arugula and add to the skillet. Cook, stirring, until wilted, about 2 minutes. Remove from heat and transfer contents to a large bowl. Season to taste with salt and pepper and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together cream, eggs, and 1/2 teaspoon salt. Scatter leek mixture over bottom of tart, followed by salmon pieces. Pour cream mixture over and place the tart back on the baking sheet in the oven. Cook until cream mixture is set and salmon is cooked, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the remaining arugula with olive oil and vinegar and season to taste with salt and pepper. Allow the tart to cool for 15 minutes then serve tart topped with dressed arugula.</p>"}]}