{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20120112%20Indian%20Unleavened%20Rice%20Bread-Bhakri.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["bread", "Indian", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bhakri (Indian Unleavened Rice Bread)", "link": "https://www.seriouseats.com/recipes/2013/12/beyond-curry-bhakri-indian-unleavened-rice-bread-recipe.html", "description": "Where there's a curry, there's usually a rice or <em>roti</em> preparation that's used to soak in or scoop up the flavorful sauce; in India's rice belt, bread made out of rice flour is common. Because it's unleavened, it can be made in just a matter of minutes&mdash;a few ingredients kneaded together, a little heat, and it's done. <em>Bhakri</em>, or rice bread, is rustic food at its best.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beyond Curry", "Bread", "Indian", "Rice"], "recipeIngredient": ["21/4 cups rice flour (divided)", "1 cup water", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 2 cups rice flour, water, and salt, and knead, adding more water or flour as necessary to create a dough that is pliable but not sticky. Continue kneading for 5 minutes. Cover dough with plastic wrap and let rest 5 minutes. Divide dough into 4 balls. Dust a rolling board and pin with remaining flour. Roll each ball into a round about 1/8-inch thick.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a bare cast iron skillet over medium heat for 5 minutes. Place one rolled out bhakri on the hot skillet and press down lightly with spatula. Cook for 1 minute, then use a thin metal spatula to carefully flip. Use a clean kitchen cloth to firmly dab the bhakri on the skillet around its edges and center. Flip again and repeat dabbing with the cloth. Remove when small brown spots appear on both sides and the bhakri has puffed slightly. Serve immediately with any curry/lentil soup of your choice or fried/scrambled egg.</p>"}]}