{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131212-276243-cook-the-book-oyakodon.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Japanese", "keywords": ["chicken", "Cook the Book", "donburi", "egg", "Harris Salat", "Japanese", "japanese soul cooking", "poultry", "Tadashi Ono"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oyakodon (Chicken and Egg Rice Bowl) from 'Japanese Soul Cooking'", "link": "https://www.seriouseats.com/recipes/2013/12/oyakodon-chicken-and-egg-rice-bowl-from-japanese-soul-cooking.html", "description": "This classic Japanese dish of chicken cooked with egg is at once delicate and comforting.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Eggs", "Japanese", "Mains"], "recipeIngredient": ["1 pound onions, peeled", "1 pound boneless chicken legs or thighs (about 2 chicken legs or 4 thighs), skinned and cut into bite-size pieces ", "1/2 cup mirin", "1/2 cup soy sauce", "1/2 cup sake", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2009/10/how-to-make-dashi-asian-miso-soup-bonito-flakes-kelp-kombu.html\">dashi</a>", "8 eggs", "6 cups cooked Japanese white rice ", "1/4 cup mitsuba leaves (optional)", "1/4 cup thinly sliced scallion (optional)", "1/4 cup crumbled nori (optional)", "Shichimi togarashi"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the onions in half lengthwise, from top to bottom (axis to axis). Cut each half into 1/4-inch slices, also cutting lengthwise. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the onions, chicken, mirin, soy sauce, sake, and dashi in a saucepan and place over high heat. When the liquid comes to a boil, reduce the heat and simmer for about 5 minutes, until the chicken cooks through. Mix the ingredients occasionally as they cook. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare the oyakodon one serving at a time:</strong> Break 2 eggs into a bowl, and lightly beat the eggs, no more than 10 times. You want part of the yolk and whites to be lightly mixed, while other parts are still separated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer one-fourth of the chicken mixture (about 1 1/2 cups chicken, onions, and broth) to a small skillet. A 6-inch skillet works great. Place the skillet over high heat. When the liquid comes to a boil, reduce the heat so the broth is simmering. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour three-fourths of the egg mixture over the chicken, onions, and broth. Do not mix. Cook for about 1 minute, then add the remaining one-fourth egg over the ingredients in the skillet. Cover the skillet and cook for 30 seconds more. Turn off the heat, and let the oyakodon rest, covered, for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oyakodon is resting, scoop 1 1/2 cups of the cooked rice into a serving bowl. When the oyakodon is ready, uncover and slide the entire contents out of the skillet to rest on the rice. Tilt the skillet and use a spatula if necessary; the oyakodon should slide out easily. Garnish with the mitsuba, scallions, and nori. Accent with the shichimi togarashi to taste. Serve immediately, and repeat this preparation for the remaining servings. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare all the servings at once:</strong> Pour the entire chicken and onion mixture into a large skillet (an 11-inch cast-iron skillet works great). Place the skillet over high heat. When the broth comes to a boil, reduce the heat so the liquid is simmering.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly beat 8 eggs. Pour three-fourth of the eggs over the chicken mixture. Do not mix. Cook for about 1 minute. Pour the remaining one-fourth eggs over the ingredients in the skillet. Cover and cook for 30 seconds more. Turn off the heat and allow the oyakodon to rest for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the cooked rice among 4 large bowls. Use a large serving spoon to scoop the oyakodon from the skillet and place over the rice. Garnish as desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation:</strong> If you prefer your eggs cooked through, in the final step pour all the eggs over the chicken, onions, and broth in the small skillet. Cover and cook for 2 minutes. Turn off the heat and let the oyakodon rest, covered, for 1 minute. </p>"}]}