{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131024-270953-dinner-tonight-nachos-sweet-potato-poblano-black-bean.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["cinco de mayo", "easy", "guacamole", "Mexican", "nacho"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Sweet Potato and Poblano Nachos With Guacamole", "link": "https://www.seriouseats.com/recipes/2013/10/dinner-tonight-sweet-potato-poblano-nacho-guacamole-recipe.html", "description": "A pile of messy goodness, laden with fall vegetables. The fun here is grasping a half-covered chip and hunting around the pile of toppings for the exact one to help complete the perfect bite.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Halloween", "Mexican", "Pumpkin", "Snacks", "Vegetarian"], "recipeIngredient": ["2 pounds sweet potatoes, peeled, cut into 1-inch cubes", "2 poblano chilies ", "2 serrano chilies ", "2 medium garlic cloves, unpeeled", "2 tablespoons canola oil ", "Kosher salt", "1 (16-ounce) can refried black beans ", "1/4 cup chicken stock ", "3 avocados ", "1 tablespoon fresh juice from about 1 lime", "Handful fresh cilantro, stems removed, leaves chopped ", "1 bag of tortilla chips ", "8 ounces Oaxacan cheese, or other string cheese (Monterrey Jack will only do in a pinch)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 450&deg;F. Combine cubed sweet potatoes, poblanos, serranos, and garlic cloves in a large roasting pan, and toss with oil. Season with a big pinch of salt. Transfer to the oven and cook, stirring every 5 minutes, until sweet potatoes are tender and lightly browned and the chilies are blackened in spots, 15 to 20 minutes total. Set pan aside to cool for a few minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat refried black beans in a medium-sized saucepan over medium-low heat. Pour in half the chicken stock, and stir until smooth. You want the beans to be a spreadable consistency, not thick, so that they are easy to spoon on the chips. If still thick, add the rest of the chicken stock. Reduce the heat if necessary to maintain a very gentle simmer, and cook until beans are warm. Then reduce heat to low. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the avocados in half, remove the pits, and scoop out the flesh. Transfer to a large mixing bowl, along with the lime juice, cilantro, and a big pinch of salt. Use the back of your knife to mash the roasted garlic cloves and add those to the bowl. Remove the stems and seeds from the roasted serrano chilies, chop the flesh and add to the bowl. Stir guacamole with a spoon until creamy. Taste and, if necessary, season with more salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When poblanos are ready to handle, peel their blackened skins, and then remove the stems and seeds. Cut the flesh into 1/4-inch thick strips. If using Oaxcan or another string cheese, pull cheese into long thin strands. If using Monterey Jack, shred on a box grater.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Place a couple handfuls of chips on four oven-safe plates, and arrange the chips so that they are mostly in one layer, even if many of their corners overlap. Top each plate with a quarter of the beans, roasted sweet potatoes, and poblanos, and then add a generous handful of the cheese. One at a time, place under the broiler until cheese just starts to melt, 15 to 30 seconds. Top each with a big scoop of the guacamole. Serve immediately.</p>"}]}