{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130910-crispy-pork-miso-ramen-03-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["egg", "Japanese", "noodle", "pork", "ramen", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Miso Ramen With Crispy Pork and Burnt Garlic-Sesame Oil", "link": "https://www.seriouseats.com/recipes/2013/09/miso-ramen-crispy-pork-burnt-garlic-sesame-oil-recipe.html", "description": "A rich and creamy miso-flavored pork stock ramen with a complex burnt garlic-sesame-chili oil, all topped with crispy braised pork.", "totalTime": "", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Eggs", "Japanese", "Mains", "Pork", "Ramen", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["3 pounds pig trotters, split lengthwise or cut crosswise into 1-inch disks (as your butcher to do this for you)", "2 pounds chicken backs and carcasses, skin and excess fat removed", "2 tablespoons vegetable oil", "1 large onion, skin on, roughly chopped", "12 garlic cloves", "One 3-inch knob ginger, roughly chopped", "2 whole leeks, washed and roughly chopped", "2 dozen scallions, white parts only (reserve greens and light green parts for garnishing finished soup)", "6 ounces whole mushrooms or mushroom scraps", "2 pounds boneless skinless pork shoulder, in one chunk", "1/2 cup red miso paste", "1/4 cup shoyu", "1 tablespoon mirin", "Salt, to taste", " ", "<strong>To Serve:</strong>", "6 to 8 portions fresh ramen noodles", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/09/burnt-garlic-sesame-chili-oil-for-ramen-recipe.html\">Burnt Garlic-Sesame-Chili Oil</a>", "3 to 4 <a href=\"http://www.seriouseats.com/recipes/2012/03/ajitsuke-tamago-japanese-marinated-soft-boiled-egg-recipe.html\">ajitsuke tamago</a>", "Other toppings such as enoki mushrooms, thinly sliced woodear mushrooms, or bamboo shoots as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork and chicken bones in a large stockpot and cover with cold water. Place on a burner over high heat and bring to a boil. Remove from heat as soon as boil is reached.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pot is heating, heat vegetable oil in a medium cast iron or non-stick skillet over high heat until lightly smoking. Add onions, garlic, and ginger. Cook, tossing occasionally until deeply charred on most sides, about 15 minutes total. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once pot has come to a boil, dump water down the drain. Carefully wash all bones under cold running water, removing any bits of dark marrow or coagulated blood. Bones should be uniform grey/white after you've scrubbed them. Use a chopstick to help remove small bits of dark marrow from inside the trotters or near the chickens' spines.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return bones to pot along with charred vegetables, leeks, scallion whites, mushrooms, and pork shoulder. Top up with cold water. Bring to a rolling boil over high heat, skimming off any scum that appears (this should stop appearing within the first 20 minutes or so). Use a clean sponge or moist paper towels to wipe and black or gray scum off from around the rim of the pot. Reduce heat to a bare simmer and place a heavy lid on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the lid is on, check the pot after 15 minutes. It should be at a slow rolling boil. If not, increase or decrease heat slightly to adjust boiling speed. Boil broth until pork shoulder is completely tender, about 3 hours. Carefully remove shoulder with a slotted spatula. Transfer shuolder to a sealed container and refrigerate until. Return lid to pot and continue cooking until broth is opaque with the texture of light cream, about 6 to 8 hours longer, topping up as necessary to keep bones submerged at all times. If you must leave the pot unattended for an extended period of time, top up the pot and reduce the heat to the lowest setting while you are gone. Return to a boil when you come back and continue cooking, topping up with more water as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once broth is ready, cook over high heat until reduced to around 3 quarts. Strain through a fine mesh strainer into a clean pot. Discard solids. For an even cleaner soup, strain again through a chinois or a fine mesh strainer lined with several layers of cheese cloth. Skim liquid fat from top with a ladle and discard. Whisk in miso paste, 3 tablespoons of shoyu, and salt to taste. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shred pork shoulder with fingers until finely shredded and toss with remaining shoyu and mirin. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Bring a large pot of salted water to a boil. Meanwhile, place shredded pork shoulder in a 10-inch non-stick skillet over medium-high heat. Cook, stirring and tossing occasionally, until crisp all over. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook noodles according to package directions. Drain and transfer to warmed ramen bowls. Ladle broth over noodles and drizzle with a tablespoon or two of burnt garlic-sesame-chili oil per bowl. Divide crisp pork evenly between bowls. Cut eggs in half and add half to each bowl. Top with other toppings as desired and serve immediately.</p>"}]}