{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131102-chestnut-sage-muffins.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["breakfast", "breakfast sweet", "chestnut", "chestnut flour", "muffin", "sage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chestnut Sage Muffins", "link": "https://www.seriouseats.com/recipes/2013/12/chestnut-sage-muffins-recipe.html", "description": "Sage and chestnut flour provide much of the perceived sweetness in this recipe. These muffins would be great for any winter holiday breakfast, with cranberry jam or orange marmalade, or even a sweetened cream cheese.", "totalTime": "30 minutes", "recipeYield": "makes 12 muffins", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Mother's Day", "Nuts", "Very Small Anna"], "recipeIngredient": ["2/3 cup milk", "2 small bunches sage (with about 5 leaves on each)", "6 tablespoons unsalted butter", "3/4 cup all purpose flour", "3/4 cup chestnut flour", "1/4 cup sugar", "2 teaspoons baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "2/3 cup yogurt", "1/4 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rack in center of oven and preheat to 400&deg;F. Combine milk and sage in small saucepan and heat to a bare simmer, then remove from heat and cover. Allow to steep at least 10 minutes, then remove sage, squeezing as much milk as possible from sage before discarding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place butter in small saucepan and heat over medium until melted and foamy. Allow to cook until liquid butter is golden brown and solids at bottom are deep brown and smell nutty. Transfer to a heatproof container, making sure to scrape out as much of browned solids as possible. Measure out 1/4 cup of brown butter and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all purpose flour, chestnut flour, sugar, baking powder, baking soda and salt in medium mixing bowl. Sift if necessary, or simply whisk together. In separate mixing bowl, combine sage milk, yogurt and vanilla and whisk until smooth. Whisking constantly, drizzle in brown butter, then scrape into dry mixture and fold together gently until all streaks of flour are incorporated and batter is fluffy and slightly lumpy. Divide evenly between cups in a 12 cup muffin pan lined with paper cups. Bake 7 minutes, then rotate pan and bake another 3-5 minutes, until a skewer inserted into muffin comes out clean. Be careful not to overbake. Allow to cool in pan slightly before transferring to rack to finish cooling.</p>"}]}