{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130427-spring-vegetables-cheesy-grits-5.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "cheese", "egg", "fava beans", "grit", "morels", "peas", "poached eggs", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cheesy Grits With Spring Vegetables", "link": "https://www.seriouseats.com/recipes/2013/05/cheesy-grits-spring-vegetables-recipe.html", "description": "Cheesy grits topped with a mix of spring vegetables sautéed with shallots in butter. A soft poached egg tops the whole mix.", "totalTime": "", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Beans and Pulses", "Cheese", "Legumes", "Mains", "Other Grains", "Poached Eggs", "Poaching", "Vegetarian"], "recipeIngredient": ["Kosher salt", "16 stalks asparagus (green, white, or a mix), ends trimmed, stalks peeled to just under the head", "1 cup shelled fava beans (unpeeled)", "1 cup snap peas, ends trimmed, cut into 1/2-inch pieces on the bias", "1/2 cup fresh or frozen english peas", "2 cups whole milk", "2 cups water", "1 cup coarse ground grits", "Freshly ground black pepper", "6 tablespoons unsalted butter, divided", "4 ounces sharp cheddar cheese", "1 ounce grated Parmigiano-Reggiano", "2 teaspoons vegetable oil", "3 ounces fresh morel mushrooms, or 1/2 ounce dried morel mushrooms soaked in warm water for 30 minutes, drained", "1 medium shallot, finely minced (about 2 tablespoons)", "1 teaspoon zest and 2 teaspoons fresh juice, from 1 lemon", "2 tablespoons minced fresh chives", "2 tablespoons minced fresh parsley leaves", "2 tablespoons minced fresh tarragon leaves", "4 <a href=\"http://www.seriouseats.com/2013/03/how-to-poach-eggs-easy-way-poached-breakfast-video.html\">poached eggs</a>, kept warm in a bowl of hot water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil and prepare an ice bath. Add asparagus to water and cook until bright green and tender-crisp, about 2 minutes. Transfer to ice bath until chilled. Drain and transfer to a paper towel-lined tray. Repeat with fava beans, snap peas, and English peas. Cafefully peel outer shells from each fava bean and discard. Set all vegetables aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring milk and water to a boil in a large saucepan over high heat. Whisking constantly, pour in the grits. Add 2 teaspoons kosher salt, reduce to a bare simmer, and cook, whisking every 2 to 3 minutes, until creamy and tender, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove saucepan from heat. Whisk in 4 tablespoons butter, cheddar, and parmesan cheese. Season to taste with plenty of black pepper and more salt as necessary. Add water or milk to thin to desired consistency if grits are too thick. Grits should be loose enough to spread out on a plate slowly. Cover pot and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable in a large skillet over high heat until smoking. Add mushrooms and cook, stirring and tossing occasionally, until well-browned on a few sides. Add shallot and cook, stirring constantly, until aromatic, about 30 seconds. Add blanched vegetables, remaining 2 tablespoons butter, lemon zest, lemon juice, and half of chives, tarragon, and parsley. Cook, tossing and stirring constantly, until any liquid in the pan is reduced to a saucy glaze. Season to taste with salt and pepper. Set aside off-heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir remaining herbs into grits, reserving a bit for garnish, then divide grits between four serving plates. Top with sautéed vegetables, then with a poached egg. Garnish with remaining herbs, season egg with salt and pepper, and serve immediately. </p>"}]}