{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130828-bakethebook-smorescake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["cake", "layer cake", "marshmallow", "meringue", "s'mores"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "S'mores Cake", "link": "https://www.seriouseats.com/recipes/2013/09/smores-cake-marshmallow-layer-cake-recipe.html", "description": "A giant version of the campfire classic. <em><strong><a href=\"http://www.amazon.com/Say-It-With-Cake-Celebrate/dp/190686893X/?tag=serieats-20\" target=\"_blank\">Say It With Cake</a></strong></em> sandwiches whipped ganache and Swiss meringue between layers of white cake.", "totalTime": "2 hours", "recipeYield": "serves 12", "recipeCategory": ["Bake the Book", "Cakes"], "recipeIngredient": ["1 cup unsalted butter, at room temperature, plus extra for greasing", "2 1/4 cups all-purpose flour", "1/3 cup cornstarch", "2 teaspoon ground cinnamon", "4 1/2 teaspoon baking powder", "1/2 teaspoon salt", "1 3/4 cups superfine sugar", "2 tsp vanilla extract", "4 medium eggs, lightly beaten", "1 1/4 cups whole milk", " ", "<strong>Whipped Ganache Filling</strong>", "3oz dark chocolate (about 70% cocoa solids), finely chopped", "1/2 cup heavy cream", "3 tsp light brown sugar", " ", "<strong>For the Swiss Meringue</strong>", "2/3 cup egg whites (about 4 large eggs)", "2 cups superfine sugar", "1/2 tsp cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F, then grease and line three 8in round cake pans with parchment paper, greasing the parchment too. In a medium bowl whisk the flour, cornstarch, cinnamon, baking powder, and salt together to combine, then set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter in a large bowl. Using an electric mixer, beat the butter on medium-high speed until smooth and light, add the sugar, and beat until light and fluffy, about 5 minutes. Add the vanilla and mix to combine. With the mixer on medium speed, add the eggs, a little at a time, beating until fully combined before adding more. With the mixer on low, add the flour mixture in three additions, alternating with the milk, starting and finishing with the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly among the prepared pans and bake for 30–35 minutes or until the cake is golden brown and springs back when lightly touched. Let the cakes cool in the pans for 10 minutes before turning onto a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the ganache filling, put the chocolate in a medium heatproof bowl. Put the cream and sugar in a small pan over medium heat and bring just to a boil.  Immediately, pour the hot cream over the chocolate and let stand for a few minutes before gently stirring together to form a smooth silky ganache. Chill the ganache until cool and slightly thickened, but not set. Using a whisk, beat until thickened. Spread the ganache across two of the cake layers and set aside while you make the Swiss meringue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the egg whites, sugar, and cream of tartar in a heatproof bowl set over a pan of gently simmering water, and whisk constantly until the sugar has dissolved and the egg whites are warm to the touch. Remove the bowl from the heat and, using an electric mixer, beat until the meringue forms stiff glossy peaks. (When you have made the meringue, you need to work with it fairly quickly. Don’t let it stand or it will firm up too much to spread easily.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cake, put the first cake layer topped with chocolate onto a cake stand or serving plate and spread with a thin layer of the meringue. Repeat with the second chocolate-topped cake layer and finish with the final layer. Take the remaining meringue and spread across the top and sides of the cake—this doesn’t have to look perfect, as any imperfections will just add to the effect. To finish the cake, take a blowtorch and lightly torch the meringue until it is golden.</p>"}]}