{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130204-vegan-bean-sopes-salsa-verde.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["beans", "cinco de mayo", "Mexican", "pepitas", "refried beans", "sopes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vegan Sopes With Refried Beans and Salsa Verde", "link": "https://www.seriouseats.com/recipes/2013/02/vegan-sopes-with-refried-beans-salsa-verde-recipe.html", "description": "Crispy homemade sope shells stuffed with refried beans drizzled with salsa verde and crunchy pepitas. A satisfying, completely vegan meal.", "totalTime": null, "recipeYield": "Serves 4", "recipeCategory": ["Dairy-Free", "Mexican", "Vegan", "Vegetarian"], "recipeIngredient": ["2 tablespoons plus 1 1/2 quarts vegetable or canola oil, divided", "1 jalapeño pepper, split in half and thinly sliced", "1 small white onion, finely sliced (about 3/4 cup)", "1 (29 ounce) can pinto beans, drained and rinsed", "1 tablespoon juice from about 1 lime", "1 small handful cilantro leaves, roughly chopped", "Kosher salt", "1 1/2 cups instant masa (such as Maseca)", "lukewarm water", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">Basic Salsa Verde</a> (or store-bought salsa verde)", "1/4 cup roasted pepitas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For The Refried Beans:</strong> Heat 2 tablespoons oil in a large skillet over medium high heat until shimmering. Add half of onions and half of jalapeños and cook, stirring frequently, until softened but not browned, about 2 minutes. Add beans and 1/2 cup water. Cook until heated through, about 4 minutes. Use a potato masher to mash the beans until desired consistency is reached, adding water as necessary. Add lime juice and half of cilantro. Season to taste with salt cover, and set aside in a warm place. Combine remaining onions, jalapeño, and cilantro in a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sope Shells</strong>: Combine instant masa with 1 teaspoon salt and lukewarm water according to package directions. Knead until a smooth dough is formed. Divide dough into 8 balls. Using your fingertips against a wooden board, gently flatten one ball into a disk about 1/4-inch thick and 3 to 4 inches in diameter. Carefully form a little lip around the edge of the disks with your fingertips. Repeat with remaining balls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 1 1/2 quarts oil in a large wok or deep cast iron skillet to 350°F. Add the sope shells one at a time until they are all in the oil. Cook, carefully turning occasionally, until shells are golden brown and crisp, about 4 minutes. Transfer to a paper towel-lined plate using a slotted metal spider. Season with salt immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, divide bean mixture evenly on top of sope shells and drizzle with salsa verde. Sprinkle with toasted pepitas, then top with remaining onions, cilantro, and jalapeño. Serve immediately with extra lemon or lime wedges on the side.</p>"}]}