{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130210-235760-no-bake-blood-orange-560x400-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["blood orange", "custard", "no bake", "pie", "pie of the week"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "No-Bake Blood Orange Pie", "link": "https://www.seriouseats.com/recipes/2013/02/no-bake-blood-orange-pie-recipe.html", "description": "This creamy, rich, no-bake pie is screaming for some acidic fruit to balance it, and here in blood orange (also sometimes called Moro oranges) season, we have our perfect topping.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Christmas", "Desserts", "Fruit Desserts", "No-Cook", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["15 sheets graham crackers", "8 tablespoons butter, melted", "3 tablespoons granulated sugar", "1/2 teaspoon kosher salt", "16 ounces cream cheese, room temperature", "14 ounces condensed milk (1 can)", "1 tablespoon vanilla extract", "3-4 blood oranges, supremed (peel, pith, and fibers all removed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put graham crackers in a large resealable plastic bag, and crush them with a rolling pin until very fine crumbs form. Pour crumbs into a medium bowl; stir in sugar and salt. Add butter, and stir until well combined. Press the crumb mixture into the pie plate, spreading it 1 1/2 to 2 inches up the side; press flat. Chill crust in freezer at least 10 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the filling: Using an electric mixer set at medium-high speed, beat the cream cheese in a large bowl until smooth. Beat in the condensed milk a little at a time, scraping the sides of the bowl as necessary. Beat in the vanilla extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the filling into the crust; smooth the top with a rubber spatula. Cover with plastic wrap, and refrigerate until firm, 3 hours. When ready to serve, supreme the oranges: using a serrated knife, cut off the top and bottom, just so the flesh is showing. Then, cut away the peel and pith in vertical strips, until all that is exposed is flesh. Using a pairing knife, cut the segments out in wedges. Arrange the supermes on top of the pie for serving.</p>"}]}