{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130221-vegan-dan-dan-mien-noodles-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Dan Dan noodles", "mushrooms", "noodle", "sichuan", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Vegan Dan Dan Noodles", "link": "https://www.seriouseats.com/recipes/2013/02/vegan-dan-dan-noodles-recipe.html", "description": "Classic Dan Dan noodles are made with pork, pickled vegetables, and plenty of chili oil. In this version, we pack in all the flavor and texture with mushrooms fried until golden brown and chewy.", "totalTime": "20 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Dairy-Free", "Mains", "Mushrooms", "Pasta", "Vegan", "Vegetarian"], "recipeIngredient": ["6 ounces white button mushrooms, quartered", "2 tablespoons vegetable oil", "3 teaspoons light soy sauce", "2 teaspoons Chinkiang vinegar (see note)", "1 tablespoon tahini paste", "2 teaspoons sugar", "4 tablespoons roasted chili oil with some chili sediment (see note)", "1 tablespoons fermented chili broad bean paste (see note)", "Kosher salt", "3 tablespoons finely chopped preserved Sichuan mustard root or stems (see note)", "2 medium cloves garlic, finely minced", "2 tablespoons shaoxing wine (see note)", "8 ounces fresh Chinese wheat noodles", "Chopped cilantro", "Thinly sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place mushrooms in the bowl of a food processor and process until pieces no larger than 1/2-inch remain, about 6 short pulses. Transfer to a small saucepan. Add vegetable oil stir to combine. Place over medium-high heat and cook, stirring occasionally, until mushroom places shrink and are deep golden brown, about 8 minutes. Pour through a fine mesh strainer set over a small bowl. Reserve mushroom pieces and discard all but 1 tablespoon oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While mushrooms are cooking, combine soy sauce, vinegar, tahini, sugar, chili oil (with its sediment), and broad bean chili paste in a medium bowl. Set aside. Bring 1 quart of salted water to a simmer in a medium pot and keep hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat reserved 1 tablespoon of mushroom oil in a large skillet or wok over high heat until shimmering. Add chopped sichuan vegetables, fried mushrooms, and garlic. Cook, stirring and tossing constantly until fragrant, about 45 seconds. Add shaoxing wine and stir to combine. Transfer mixture to bowl with sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pot of water to a hard boil and add noodles. Cook, stirring regularly to prevent sticking to each other or the bottom, until barely cooked through with a springy bite, about 4 minutes. Drain, reserving 3/4 cup of cooking liquid. Add cooking liquid to bowl with sauce and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place noodles in bowl and pour sauce with solids on top. Garnish with scallions and cilantro, and serve, stirring vigorously just before eating to pick up sauce.</p>"}]}