{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130120-237673-bar-bites-barbecue-sweet-potato-chips.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "barbecue potato chips", "chip", "potato chips", "snacks", "sweet potato chips"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Barbecue Sweet Potato Chips", "link": "https://www.seriouseats.com/recipes/2013/01/barbecue-sweet-potato-chips-recipe.html", "description": "When fried in hot oil, the sweetness in sweet potatoes concentrates and results in a tastier chip than regular russets, in my opinion. As for the barbecue flavor, a sprinkling of salt, cayenne, garlic powder, smoked paprika, and sweet paprika make for a great barbecue combination that won't overpower or mask the sweetness of the crisp, fried sweet potatoes.", "totalTime": "25 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Sides", "Snacks", "Sweet Potatoes and Yams"], "recipeIngredient": ["1/8 teaspoon cayenne pepper", "1/4 teaspoon garlic powder", "1/4 teaspoon smoked paprika", "1/4 teaspoon kosher salt", "1/2 teaspoon sweet paprika", "Canola, vegetable, or peanut oil, for frying (About 1 quart)", "1 large sweet potato (about 1 pound), very thinly sliced on a mandoline"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the spices in a small bowl and set aside. Pour one inch of oil into a large dutch oven or heavy pot over moderately high heat. Heat the oil until it reaches 375°F on a deep-fry thermometer. Adjust flame to maintain temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches, place the sweet potatoes in the hot oil, occasionally flipping and moving the slices with a slotted spoon or a wire mesh spder. Fry the potatoes until the edges curl and the potatoes become golden brown and crisp, 3 to 4 minutes total. Transfer the fried potatoes to a baking sheet lined with paper towels and immediately sprinkle with some of the spice mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all of the chips are fried, transfer them to a large bowl or serving platter and sprinkle on any remaining spice mix. Serve immediately.</p>"}]}