{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/082613-264014-cook-the-book-poppadums-with-chile-onion-dip-and-avocado-pomegranate-dip.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["avocado", "chili", "Cook the Book", "cracker", "guacamole", "indian food", "masala", "pomegranate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Poppadums with Chile-Spiked Onion and Avocado Pomegranate Dip from 'Indian Cooking Unfolded'", "link": "https://www.seriouseats.com/recipes/2013/08/cook-the-book-masala-poppadums-from-indian-cooking-unfolded.html", "description": "My only experience eating poppadums has been in Indian restaurants with a couple of chutneys alongside. The crackers have always seemed ethereally light and magically crisp. I never would have thought to serve them at home, or even knew the first thing about preparing them. This dead-simple appetizer recipe from <strong><a href=\"http://raghavaniyer.com/\">Raghavan Iyer</a></strong>'s new cookbook, <em><a href=\"http://www.amazon.com/Indian-Cooking-Unfolded-Recipes-Ingredients/dp/0761165215/?tag=serieats-20\">Indian Cooking Unfolded</a></em>, takes away that mystique and serves the crackers with an Indian twist on a couple of dips.", "totalTime": "20 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Avocado", "Condiments and Sauces", "Cook the Book", "Pomegranate", "Vegetarian"], "recipeIngredient": ["6 or 12 uncooked lentil wafers (poppadums), each at least 6 inches in diameter before cooking", "&nbsp", "<strong>Chile-Spiked Onion</strong>", "1/2 cup finely chopped red onion", "1 medium-size tomato, cored and finely chopped", "1/4 cup finely chopped fresh cilantro leaves and tender stems", "1 or 2 fresh green serrano chiles, stems discarded, finely chopped (do not remove the seeds)", "1/2 teaspoon coarse kosher or sea salt", "&nbsp", "<strong>Avocado Pomegranate Dip</strong>", "2 teaspoons coriander seeds", "1 teaspoon cumin seeds", "1/4 cup firmly packed fresh cilantro leaves and tender stems", "2 tablespoons freshly squeezed lime or lemon juice", "1 teaspoon coarse kosher or sea salt", "1 small onion, coarsely chopped", "3 large cloves garlic", "2 to 3 fresh green serrano chiles, stems discarded", "3 large ripe Hass avocados", "1/2 cup fresh pomegranate seeds or red raspberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are using a gas stove, set the flame of a burner at medium-high. Holding 1 poppadum with a pair of tongs, flip it back and forth over the open flame until bumps start to appear on the surface and the poppadum turns light brown, 1 to 2 minutes. Remember to shift the tongs in order to toast the part initially covered by them. Repeat with the remaining poppadums. Set them aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are using an electric stove, broiling is a great option. Place a rack as close as possible to the heating element, and preheat the broiler to high. Toast the poppadums until bumps appear on the surface and they turn light brown, 1 to 2 minutes. There is no need to turn them. Set them aside to cool. Microwaving poppadums on high power for 30 seconds to 1 minute is also an option. The poppadums will turn crisp and brittle as they cool. You can store them in airtight plastic zip-top bags at room temperature for up to 2 weeks (but I bet they will be gone long before that).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the chile-spiked onion,</strong> combine the onion, tomato, cilantro, and chiles in a medium-size bowl. Just before serving, stir in the salt. Salting the “salsa” ahead and letting it sit for a while results in a pool of liquid at the bottom of the bowl, an unwanted result that will render the poppadums soggy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the avocado pomegranate dip,</strong> heat a small skillet over medium-high heat. Once the skillet is hot (when you hold the palm of your hand close to the bottom of the skillet you will feel the heat), usually after 2 to 4 minutes, add the coriander and cumin seeds and toast them, shaking the skillet every few seconds, until they start to crackle and turn reddish brown and the aroma is highly nutty fragrant with citrus undertones, about 1 minute. Immediately transfer the seeds to a small heatproof bowl or plate to cool. Once cool, place the coriander and cumin seeds in a spice grinder (you can also use a coffee grinder) and grind the blend to the consistency of finely ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cilantro, lime juice, salt, onion, garlic, and chiles in the bowl of a food processor and, using the pulsing action, mince the blend. Letting the processor run constantly will create an unwanted chunky puree, full of liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pit, peel, and cut the avocado into 1/4 inch cubes. Place the avocado in a medium-size bowl and fold in the cilantro mixture, spice blend, and pomegranate seeds. Transfer the dip to a pretty serving bowl. If you are planning on serving the avocado dip later, press a piece of plastic wrap directly onto the dip’s surface, making sure there are no air bubbles in between the wrap and the surface (this slows down the dip from oxidizing and turning a wee bit black). You can store the dip in the refrigerator for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, if you are making the spiked onion, place 6 poppadums on a large pretty platter. Evenly divide the onion topping among them, spreading it over the surface of each. If you are making the dip, place the poppadums in a cloth-lined basket with the dip alongside.</p>"}]}