{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130418-bakethebook-doughnuts.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "pastry", "raspberry", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Raspberry Doughnuts with Vanilla Dipping Sauce", "link": "https://www.seriouseats.com/recipes/2013/04/raspberry-doughnuts-with-vanilla-dipping-sauce-recipe.html", "description": "It doesn't get much simpler or more indulgent than a fresh doughnut. Being able to make your own is a must for any aspiring home pastry chef. <strong><em>Old School Comfort Food</em></strong> shares chef Alex's recipe for fluffy, sugar-encrusted doughnuts filled with tangy jam and accompanied by a creamy vanilla sauce.", "totalTime": null, "recipeYield": "makes about 16 3-inch doughnuts", "recipeCategory": ["Bake the Book", "Desserts", "Doughnuts", "Pastry", "Raspberry"], "recipeIngredient": ["<strong>Doughnuts</strong>", "1 cup warm water (about 110°F)", "1 tablespoon plus 2 1/2 teaspoons active dry yeast", "1 cup all-purpose flour, plus more for rolling the dough", "10 tablespoons (1 1/4 sticks) unsalted butter, at room temperature, plus more for the bowl", "2/3 cup sugar, plus more for dusting", "3 large eggs, cracked and lightly beaten, at room temperature", "1 teaspoon vanilla extract", "1 teaspoon kosher salt", "3½ cups bread flour", "1 quart canola oil", "3/4 cup raspberry jam, preferably seedless", "&nbsp;", "<strong>Vanilla Dipping Sauce</strong>", "1 vanilla bean, split lengthwise", "2 cups whole milk", "Pinch of salt", "6 large egg yolks", "2/3 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the dough: Pour the warm water into a medium bowl. The temperature range for the “warm” water is where the dry yeast likes to wake up from its nap in those little envelopes in the back of your cupboard. (When you run the water from the tap, it’s about where water starts to feel just hot to the touch; if it is so hot that you have to pull your hand away, you’ve gone much too far.) Whisk in the yeast and set aside to dissolve in the water. After 10 minutes, you should see a few small bubbles on the surface. (If there is nothing at all, start again with fresher yeast.) Stir in the all-purpose flour, cover with plastic wrap, and set aside in a warm place.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in the bowl of a stand mixer fitted with the paddle attachment, beat together the butter and sugar on medium speed until fluffy and light, 8 to 10 minutes. Do not skimp on or rush this time. Scrape down the sides of the bowl as you mix. With the mixer on low speed, add the eggs, one by one, taking care that each one is thoroughly integrated before adding the next. When the mix is smooth, add the vanilla and salt. Scrape down the sides of the bowl. Add the bread flour and mix on low speed until fully incorporated. Add the yeast mixture and mix again until thoroughly incorporated. Transfer the dough to a greased bowl, cover with plastic, and allow to rise in a warm place until the dough has doubled in volume, about 1 hour 30 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll and cut the doughnuts: Lightly flour a cool surface and sprinkle the dough with an even layer of flour. Use a rolling pin to roll the dough out to about a 1-inch thickness. Cut rounds of dough with a 2-inch round cookie cutter. You cannot reroll scraps (though you can fry them as is and devour them in the kitchen), so cut your doughnut rounds very close together to maximize yield. Put the doughnuts, leaving room between them for them to grow, on a floured baking sheet to rest in a warm place for 20 to 30 minutes. If you wait longer than that to fry them and they become fairly puffed up, cover them with plastic and refrigerate until you are ready. Leaving them in a warm place for too long can result in overproofing and yield an overly yeasty (and somewhat sour) doughnut.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the doughnuts: In a medium, deep, heavy-bottomed pot (or deepfryer), heat the canola oil to 350ºF. Monitor the temperature of the oil with a thermometer. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop a doughnut scrap in the oil to make sure it is hot. It should bubble immediately. Cook until golden brown on both sides, 3 to 4 minutes. Remove it from the oil with a slotted spoon and set on a kitchen towel to drain. Fry the remaining doughnuts in batches.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the doughnuts: Fill a pastry bag fitted with a small plain tip (or a zippertop plastic bag with a corner snipped off) with the jam. Poke a hole into the side of each doughnut with the tip (or with a small spoon) and squirt some jam into the center. While still warm, roll in sugar. Serve immediately with the dipping sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the dipping sauce: Infuse the milk. In a saucepan, combine the vanilla bean and milk with the salt. Bring to a boil over medium heat and then reduce the heat so that the milk simmers. Cook for 2 minutes and then set the pan aside to steep for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start the sauce: In the bowl of a stand mixer fitted with the whisk attachment, combine the egg yolks and sugar. Whip on medium speed until the eggs are pale yellow, about 5 minutes. Strain the milk, pressing down to extract the maximum from the vanilla bean.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare an ice bath: Fill a large bowl halfway with ice cubes and add some cold water. Set another smaller bowl into the ice bath.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the sauce: With the machine on low speed, pour half of the warm milk into the egg yolks and blend well. Return the egg yolk mixture to the saucepan along with the remaining milk and cook over medium heat, stirring constantly with a wooden spoon, until the sauce coats the back of the spoon, 5 to 8 minutes. Pour the sauce into the empty bowl set in the ice bath to speed the cooling process.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately or refrigerate until ready to serve or for up to 3 days.<br />\n</p>"}]}