{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/091313-265569-cook-the-book-red-polenta-oyster-mushroom-broth-garlic-chips.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "garlic", "mushroom", "polenta", "vegetarian", "vermont"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Twin Farms Red Polenta with Wildcrafted Oyster Mushroom Broth from 'The Vermont Farm Table Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/09/red-polenta-with-oyster-mushroom-broth-recipe-from-vermont-farm-table-cookbook.html", "description": "This small plate combines hearty red polenta (Twin Farms grows their own, but it's easy to substitute), savory mushrooms in their cooking broth, and soft ricotta cheese. Gently fried garlic chips and whole parsley leaves round out the picturesque dish. It's a nod to the upcoming fall season, but isn't so heavy that you can't enjoy it in September.", "totalTime": "50 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Cook the Book", "Garlic", "Gluten-Free", "Mains", "Mushrooms", "Pasta", "Vegetarian"], "recipeIngredient": ["<strong>Polenta</strong>", "4 cups low-sodium chicken stock", "1 cup coarse-ground or medium-ground polenta", "&nbsp", "<strong>Oyster Mushroom Broth</strong>", "1 1/2 tablespoons olive oil", "8 ounces wild oyster mushrooms, trimmed and coarsely chopped", "3 cups vegetable stock", "1 teaspoon chopped fresh thyme, plus 4 thyme sprigs for garnish", "1 bay leaf", "1–2 tablespoons dry sherry", "Kosher salt and freshly ground black pepper", "&nbsp", "<strong>Garlic Chips</strong>", "1 teaspoon olive oil", "2 elephant garlic cloves, thinly sliced", "&nbsp", "1 cup ricotta cheese", "Parsley leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the polenta:</strong> Bring the chicken stock to a boil in a large saucepan over medium-high heat. Whisking constantly, add the polenta in a slow, steady stream. Continue stirring until the stock returns to a boil. Reduce the heat to low and simmer, stirring occasionally with a wooden spoon, until thickened, 30 to 35 minutes. The polenta should pull away from the sides of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the oyster mushroom broth:</strong> Meanwhile, heat the oil in a large skillet over medium-low heat. Add the mushrooms and cook until soft and golden, about 6 minutes. Add the stock, thyme, and bay leaf and simmer until the liquid has reduced by half, about 12 minutes. Discard bay leaf. Stir in sherry and season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the garlic chips:</strong> While the mushroom broth is simmering, heat the oil in a small skillet over medium heat. Add the garlic, and fry until golden brown on both sides, about 1 minute per side. Using a slotted spoon, remove the garlic and set aside on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the polenta into bowls; top each serving with mushrooms, ricotta cheese, and garlic chips. Drizzle the mushroom broth over the polenta, garnish with thyme sprigs or parsley leaves, if desired, and serve.</p>"}]}