{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130124-238152-ccscotchegg16.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cadbury creme eggs", "Cakespy", "chocolate", "fried desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cadbury Creme Scotch Eggs", "link": "https://www.seriouseats.com/recipes/2013/03/cadbury-creme-scotch-egg-recipe.html", "description": "The Cadbury Creme Scotch Egg is coated with a thick cocoa-kissed batter, then coated in cookie crumbs and deep-fried. When eaten warm, the taste calls to mind that of a deep-fried candy bars that one can find at state fairs, but in my opinion, a slightly more complex flavor owing to the cocoa in the batter and the vanilla cookies. Speaking of the crumbs, they also give the treat a pleasing crunch, which acts as a pleasant texture contrast to the cakey batter and soft, gooey chocolate and sugar-filled interior.", "totalTime": "2 hours, 20 minutes", "recipeYield": "makes 4 eggs", "recipeCategory": ["Cakespy", "Candy", "Deep Frying"], "recipeIngredient": ["4 Cadbury Creme Eggs", "1 egg, beaten", "1/2 cup flour", "8-12 cups of vegetable or peanut oil, quantity depending on your pan", "1 cup flour", "1 tablespoon cocoa powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup milk", "1 tablespoon white vinegar", "1/2 tablespoon vegetable oil", "1 1/2 cups vanilla wafers, crushed (I used Teddy Grahams)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start out by unwrapping your Cadbury Creme Eggs. Freeze them for at least 2 hours, or even overnight&mdash;you want them to be like little rocks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Near the end of the chilling period, get yourself set up. Have three shallow bowls handy: one with 1/2 cup of the flour, one with the beaten egg, and one containing the crushed vanilla wafers. Also get out a larger bowl, for mixing your batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, it's time to start heating the oil for frying. I poured about 6 cups of vegetable oil into a medium saucepan, so that it was about 4-5 inches deep. The exact quantity of oil required will depend on the size of your saucepan. Turn the heat to medium-high, and insert a candy or frying thermometer. The oil needs to reach 375°F on the thermometer, which will take about 10-12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oil heats, prepare the batter. Place 1/2 cup of flour in a shallow bowl and set aside for the moment. Place 3/4 cup of flour in a small bowl and stir in the cocoa powder, baking powder, and salt. In a mixing cup, stir together the milk, vinegar, and oil. Whisk the wet ingredients into the dry until smooth and free of most lumps. The batter should be thicker than a pancake batter&mdash;if it seems too liquidy (as if it might drip off when you dip the Cadbury Creme Eggs in it), whisk in the remaining flour until it has reached the desired consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the Cadbury Creme Eggs from your freezer. I found that it is best to fry one cupcake at a time, so you could take them out of the freezer a couple at a time so that the eggs fried later on don't get too warm while sitting out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spoon, coat an egg with the batter mixture. Use floured hands to mold the batter around the egg so that every bit is covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, dredge the battered Creme Egg in the flour, covering it completely. Tap off excess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, coat the floured ball with the egg wash. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the egg wash coated ball in the cookie crumbs, coating on all sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, gently ease the crumb-coated orb into the hot oil. Once the batter has reached a pleasing golden hue (a minute or less), remove the Cadbury Creme Scotch Egg from the oil and transfer to a plate covered with paper towel to soak up the excess grease. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat the battering and frying process with the remaining Cadbury Creme Eggs, battering and coating them one at a time directly before dipping in the frying oil. While frying, be sure to monitor the temperature of the oil and adjust your heat up or down accordingly so that it remains at 375°F. If the oil is too cold it won't fry quickly enough and the chocolate eggs will soak up too much grease; if it is too hot, the outside will get dark before the inside is fully warmed, leaving you with a delicious shell but a still gooey batter on the inside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat while still warm.</p>"}]}