{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131215-btb-chocolatemarquise.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "marquise", "mousse", "pudding", "Seriously Bittersweet"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Marquise", "link": "https://www.seriouseats.com/recipes/2013/12/chocolate-marquise-mousse-recipe.html", "description": "A handsome ramekin of dark chocolate mousse is a <em>Seriously Bitter Sweet </em> indulgence. Take the time to make the Cocoa Bean Cream to serve on top; the cocoa nibs add a depth that complements the mousse beautifully.", "totalTime": "1 hour 30 minutes, including chilling", "recipeYield": "serves 8 to 10", "recipeCategory": ["Bake the Book", "Chocolate", "Desserts", "Puddings and Custards"], "recipeIngredient": ["8 ounces (225 grams) 54% to 62% chocolate, coarsely chopped (see Chocolate Notes)", "8 tablespoons (115 grams/1 stick) unsalted butter, cut into pieces", "4 large eggs, at room temperature", "1/4 cup (50 grams) sugar", "Scant 1/8 teaspoon salt", "1/4 cup water", "Lightly sweetened whipped cream or Cocoa Bean Cream (ingredients and recipe follow), optional", "&nbsp;", "<strong>Cocoa Bean Cream</strong>", "1 cup heavy cream", "2 rounded tablespoons (20 grams) roasted cocoa nibs", "Sugar to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate and butter in a medium stainless steel bowl in a wide skillet of barely simmering water. Stir frequently until the chocolate is nearly melted. Remove the bowl from the heat and stir until completely melted and smooth. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the heated (egg-safe) method: In another medium stainless steel bowl, whisk the eggs with the sugar and salt until well blended. Whisk in the water. Set the bowl in the skillet of barely simmering water, and stir with a heatproof silicone spatula, sweeping the bottom and sides of the bowl continuously, to prevent the eggs from scrambling. Continue until the eggs register 160°F on an instant-read thermometer. (You will have to remove the bowl from the skillet to take the temperature unless you are agile enough to both stir and hold and read the thermometer at the same time!) For safety, rinse the thermometer stem in the hot skillet water between readings. Remove the bowl from the skillet and beat the eggs with an electric mixer at high speed for 3 to 4 minutes, or until they have a texture like softly whipped cream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the fresh-egg method: Whip the eggs, sugar, and salt—without the water or heating step—at high speed for 4 to 5 minutes, until the eggs have a texture like softly whipped cream. Fold one-quarter of the eggs into the chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold in half of the remaining eggs until nearly blended. Add the rest of the eggs and fold just until evenly incorporated. Immediately, before the mousse can begin to stiffen and set, divide it among the ramekins, or use it to fill a cake or other dessert. Chill for at least 1 hour, or until set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with whipped cream or Cocoa Bean Cream, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Notes:</strong><br />\nTo use a higher-percentage chocolate, adjust the recipe as follows.<br />\nTo use 64% to 66% chocolate: Use 6 1/2 ounces (185 grams) chocolate. Increase the sugar to 1/4 cup plus 1 tablespoon (60 grams), and the butter to 9 tablespoons (130 grams).</p>\n\n<p>To use 70% to 72% chocolate: Use 7 ounces (200 grams) chocolate. Increase the sugar to 1/3 cup plus 1 tablespoon (80 grams) and the butter to 9 tablespoons (130 grams).<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the Cocoa Bean Cream:</strong> Bring the cream and nibs to a boil in a small saucepan. Remove from the heat, cover, and let stand for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the cream into a bowl, pressing on the solids to extract all the liquid. Discard the nibs. Chill the cream for at least 6 hours; it must be thoroughly cold in order to whip properly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to use, whip the cream, adding sugar to taste as the cream thickens.</p>"}]}