{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20120129-bakethebook-creolebrownies.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["brownies", "chicory", "chocolate", "coffee", "The Back In The Day Bakery Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Creole Brownies", "link": "https://www.seriouseats.com/recipes/2013/01/creole-chocolate-chicory-brownies-recipe.html", "description": "Simple but smart, these fudgy brownies from the <strong>Back in the Day Cookbook </strong> are coated with a decadent ganache infused with chicory coffee that takes them from clever to Creole. Cocoa nibs give them a \"crunchy, yet tender\" texture.", "totalTime": null, "recipeYield": "makes 12 large or 24 small brownies", "recipeCategory": ["Bake the Book", "Brownies and Bars", "Chocolate", "Desserts"], "recipeIngredient": ["<strong>For the Brownies</strong>", "1/2 pound (2 sticks) unsalted butter, cut into cubes", "8 ounces unsweetened chocolate, coarsely chopped", "2 1/2 cups sugar", "1/2 teaspoon fine sea salt", "2 teaspoons pure vanilla extract", "4 large eggs", "1 cup unbleached all-purpose flour", "1/4 cup cocoa nibs", "&nbsp;", "<strong>For the Ganache</strong>", "1 cup heavy cream", "8 tablespoons (1 stick) unsalted butter, cut into cubes", "1/3 cup sugar", "1/4 teaspoon fine sea salt", "16 ounces bittersweet chocolate, finely chopped", "1/4 cup hot freshly brewed New Orleans–style chicory coffee or strong regular coffee", "1 teaspoon pure vanilla extract", "Fleur de sel for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven and preheat the oven to 350°F. Lightly grease a 9-by-13-by-2-inch baking pan and line with parchment, allowing the ends of the paper to hang over two opposite edges of the pan.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the brownies: Set a large heatproof bowl over a saucepan of barely simmering water (do not let the bottom of the bowl touch the water), add the butter and chocolate, and stir frequently until melted and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the heat, add the sugar, salt, and vanilla and stir until completely combined. Add the eggs one at a time, mixing well after each addition. Add the flour and stir until the batter is smooth, 2 to 3 minutes. Stir in the cocoa nibs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared baking pan and bake for 20 to 22 minutes. When the brownies are done, a slight crack will have formed around the edges. Remove the pan from the oven and let the brownies cool completely on a wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the ganache: Combine the cream, butter, sugar, and salt in a large heatproof bowl, set it over a saucepan of barely simmering water (do not let the bottom of the bowl touch the water), and stir until the butter is melted. Add the chocolate and stir until the chocolate has melted and the mixture is completely smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bowl from the heat, add the coffee and vanilla, and stir until smooth. The ganache will thicken as it cools.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish the brownies: Invert the brownies onto a baking sheet and remove the parchment. Pour the thickened ganache over the brownies, spreading it evenly with a spatula or a butter knife into a thick layer on top. Let the brownies stand until the ganache is completely set and sprinkle with fleur de sel if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut into squares. The brownies will keep in an airtight container at room temperature for up to 1 week.</p>"}]}