{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131023-270142-cook-the-book-thai-steak-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["beef", "cilantro", "Cook the Book", "salad", "steak", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai Beef Salad From 'Maximum Flavor'", "link": "https://www.seriouseats.com/recipes/2013/10/thai-beef-salad-recipe-maximum-flavor-cookbook.html", "description": "This take on Thai beef salad from <strong><a href=\"http://ideasinfood.com/our-story.php\">Aki Kamozawa</a></strong> and <strong><a href=\"http://ideasinfood.com/our-story.php\">H. Alexander Talbot</a></strong>'s new cookbook, <em><a href=\"http://www.amazon.com/Maximum-Flavor-Recipes-That-Change/dp/0770433219/?tag=serieats-20\">Maximum Flavor</a></em>, is more than just a recipe for salad. Sure, the final dish makes for a tasty dinner, but the take-aways from the recipe are also more widely applicable.", "totalTime": "50 minutes, plus 48 hours marinating time for the beef", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Cook the Book", "Mains", "Salads", "Thai"], "recipeIngredient": ["<strong>Beef</strong>", "1 sirloin cap steak or coulotte steak (17.6 ounces / 500 grams)", "1 garlic clove, thinly sliced", "1/2 jalapeño, thinly sliced", "0.35 ounce (10 grams) pickled ginger", "2 tablespoons (30 grams) sweet vermouth", "2 tablespoons (33 grams) tamari soy sauce", "1 tablespoon (14 grams) fish sauce", "1/4 teaspoon (1.5 grams) fine sea salt", "Rice bran oil or peanut oil, for frying", "Leaves from 1 bunch cilantro", "&nbsp", "<strong>Salad</strong>", "2 grapefruits", "5 teaspoons (15 grams) palm sugar, grated on a box grater, or packed dark brown sugar", "1 tablespoon (14 grams) rice vinegar", "2 teaspoons (10 grams) fish sauce", "1/2 teaspoon (3 grams) fine sea salt", "1 unripe papaya", "1 bunch watercress, chopped into bite-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the beef:</strong> Put the beef on a cutting board and remove any silver skin or large pieces of external fat. Cut a crosshatch grid into the top of the meat, cutting about 1/2 inch (13 mm) deep and leaving about 1/2 inch (13 mm) between the lines. Flip the meat over and repeat on the bottom, being careful not to cut all the way through the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the garlic, jalapeño, pickled ginger, sweet vermouth, soy sauce, and fish sauce. Put the meat into a gallon-size zip-top bag and add the marinade. Squeeze out the excess air and seal the bag. Turn the bag over a few times so that the meat is evenly coated. Refrigerate the meat in its bag on a baking dish or large plate for at least 24 hours and preferably 48, flipping the meat over twice a day, to allow the flavors to be absorbed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the salad:</strong> The day you are planning to cook the meat, grate the zest from the grapefruits. Transfer the zest to a small container, cover, and reserve in the refrigerator. Use a knife to cut the top and bottom off each grapefruit, exposing the inner segments. Stand the grapefruit up on a cutting board and pare off the skin, slicing it away from the top to the bottom, following the curve of the fruit. Once all of the pith has been removed, hold the grapefruit over a small bowl and use a paring knife to cut between the membranes and free the segments, letting them drop into the bowl. Squeeze the remaining membranes over the segments, catching the juice in the bowl. Remove the grapefruit segments from the bowl, cut them into thirds, transfer to another bowl, and set aside separately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the palm sugar, rice vinegar, fish sauce, and salt to the bowl of grapefruit juice. Stir to dissolve the salt and sugar. Return the grapefruit segments to the bowl. Peel the papaya and cut it in half lengthwise, and remove the seeds. Use a mandoline to thinly slice the fruit. Add the papaya to the grapefruit vinaigrette and stir to blend with the grapefruit segments. Cover the salad and reserve at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast-iron skillet over medium-high heat. Remove the beef from the marinade and remove any garlic or jalapeño slices that may be stuck to it. Season the meat with the salt. Add 1/4 inch (6 mm) of oil to the bottom of the hot pan and when the oil shimmers, slide the meat into the pan. Turn the heat down to medium. Cook the meat for 30 seconds and gently flip it. Cook for 30 seconds on the second side and flip the meat again. Repeat this process until the meat has cooked for a total of 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the meat is cooking, put half of the cilantro leaves on a platter large enough to hold the meat. When the meat has finished cooking, transfer it from the pan onto the bed of cilantro leaves. Cover the top of the meat with the remaining cilantro leaves and then invert a large platter over the meat to hold in heat while it rests. Let the meat rest for at least 5 minutes; the heat will release the oils in the herbs and they will permeate the meat while it rests. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the top plate and transfer the meat, still covered in cilantro leaves, to a cutting board. Carve the meat into slices, cutting against the grain. Put the meat on a serving platter and add any juices<br />\r\nand leftover cilantro from the cutting board or the resting plate. Add the watercress to the marinated fruit salad and mix gently to combine. Taste and add a pinch of salt if needed. Arrange the salad over the meat and serve immediately.</p>"}]}