{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131215-btb-coconutsaras.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "coconut", "cookie", "macaroon", "Seriously Bittersweet"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Coconut Saras", "link": "https://www.seriouseats.com/recipes/2013/12/coconut-saras-chocolate-dipped-coconut-macaroon-cookies-recipe.html", "description": "Chewy nests of coconut contain a dollop of whipped ganache. It's a beautiful contrast between smoothly bitter, and toothsomely sweet. The whole thing is dipped into melted chocolate as the finishing touch.", "totalTime": null, "recipeYield": "makes 20 to 24 cookies", "recipeCategory": ["Bake the Book", "Coconut", "Cookies", "Desserts"], "recipeIngredient": ["4 large egg whites", "3 1/2 cups (255 grams) unsweetened dried flaked (not shredded) coconut, also called coconut chips, or 3 cups (9 ounces/255 grams) sweetened shredded coconut", "3/4 cup (150 grams) sugar", "2 teaspoons pure vanilla extract", "Generous 1/4 teaspoon salt", "1/2 recipe Whipped Chocolate Ganache Filling (ingredients follow)", "5 ounces (140 grams) 54% to 72% chocolate, coarsely chopped (see Chocolate Note)", "&nbsp;", "<strong>Whipped Chocolate Ganache Filling</strong>", "8 ounces (225 grams) 54% to 58% chocolate, chopped medium-fine  (see Chocolate Notes)", "2 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the macaroons: Combine the egg whites, coconut, sugar, vanilla, and salt in a large stainless steel bowl. Set the bowl in a wide skillet of barely simmering water and stir, scraping the bottom to prevent burning, until the mixture is very hot to the touch and the egg whites have thickened slightly and turned from translucent to opaque, 6 to 7 minutes. Set the batter aside for 30 minutes to let the coconut absorb more of the goop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the racks in the upper and lower thirds of the oven, and preheat the oven to 350°F. Line two cookie sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you used large flaked coconut, scoop 2 tablespoons of the mixture per cookie—or 1 tablespoon made with finer shredded coconut—about 2 inches apart onto the cookie sheets. Use your finger to make a hollow depression in the center of each cookie so it looks like a little nest. Bake for about 5 minutes, just until the coconut tips begins to color, rotating the pans from top to bottom and from front to back halfway through the baking time to ensure even baking. Lower the temperature to 325°F and bake for 10 to 15 minutes, again rotating the pans from top to bottom and front to back halfway through the baking time, until the cookies are a beautiful cream and gold with deeper brown edges. If the coconut tips are browning too fast, you can lower the heat to 300°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the cookies on the parchment onto cooling racks. Cool completely before removing them from the paper. (They can be stored in an airtight container at room temperature for 4 to 5 days, or frozen for up to 3 months.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fill and dip the macaroons: Beat the chilled ganache just until the color lightens and the mixture becomes stiff enough to hold its shape—if you overbeat the ganache, it will have a granular texture. Scrape the ganache into the pastry bag. Pipe a 1-inch-high kiss-shaped mound (about 1 tablespoon of ganache) into each macaroon “nest.” Refrigerate until well chilled, at least 1 hour. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate in a medium heatproof bowl set in a wide skillet of barely simmering water. Stir until the chocolate is nearly melted, then remove from the heat and continue to stir until the chocolate is completely smooth. Wipe the moisture from the bottom of the bowl and transfer the chocolate to a very small bowl or cup. If necessary, let the chocolate cool to about 105°F. Hold a macaroon upside down and dip only the ganache kiss into the chocolate. Then turn the macaroon right side up, hold it over the bowl, and use a fork to drizzle a little chocolate around the edges. Set the macaroon on a tray. Repeat until all of the macaroons are dipped. Refrigerate to set the chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Notes</strong> </p>\n\n<p>For dipping, you can use the same chocolate you use in the ganache, or any other chocolate. You can use an even higher percentage chocolate than called for, but be sure you taste it first so you know what you are getting into.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the ganache,</strong> place the chopped chocolate in a medium bowl. Heat the cream in a large heavy saucepan over medium-high heat until it comes to a gentle boil. Immediately pour the hot cream over the chocolate and stir until the chocolate is mostly melted. Let stand for 15 to 20 minutes to be sure all of the chocolate particles are completely melted.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the ganache until it looks perfectly smooth and free of unmelted speaks of chocolate. Let cool. Cover the bowl and refrigerate the ganache for at least 6 hours (I usually leave it overnight); it must be very cold or it will curdle when it is whipped. (The ganache can be prepared up to 4 days ahead.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to use the ganache (and not before), whip it until it is stiff enough to hold a nice shape and seems spreadable, but don’t overdo. Overwhipped ganache looks granular, so watch it carefully: I usually stop the mixer early and finish the whipping by hand. After whipping, the ganache will firm as it sits (and even more after it is chilled), so spread it immediately. If you accidentally overwhip, or if the ganache becomes too stiff to spread, warm your spatula by rinsing it under hot tap water and wiping it dry as necessary. (The warm spatula rescued me when I overwhipped ganache for three hundred during the Tribute Cake adventure—so don’t worry.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Notes</strong></p>\n\n<p>Unlike most ganache, this one is whipped to a light, almost fluffy texture. High-percentage chocolates are superb here, but the ratio of chocolate to cream must be decreased, or the ganache will be too dense. To use a higher-percentage chocolate, adjust the recipe as follows. (At each level the flavor is less sweet but the texture is still light.)</p>\n\n<p>To use 60% to 64% chocolate: Use 7 ounces (200 grams) chocolate and increase the cream to 2¼ cups.</p>\n\n<p>To use 66% to 72% chocolate: Use 6 ounces (170 grams) chocolate, increase the cream to 2 1/4 cups, and add at least 4 teaspoons (17 grams), or up to 3 tablespoons (38 grams), sugar to the cream before heating it. Alter the technique slightly: pour half of the hot cream and sugar over the chocolate first and stir until smooth before adding the rest. (Without added sugar, the flavor of the ganache is a bit flat. The minimal 4 teaspoons sugar lifts and opens up the flavor—the way salt lifts the flavor of savory food—without adding perceptible sweetness. You can taste and adjust the sugar before chilling the ganache.)<br />\n</p>"}]}