{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130320-pesto-pizza-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["pesto", "pizza", "the pizza lab", "Top This"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pizza with Pesto, Ricotta, and Mozzarella", "link": "https://www.seriouseats.com/recipes/2013/04/pizza-pesto-ricotta-mozzarella-recipe.html", "description": "Pesto, mozzarella, and ricotta on a pizza.", "totalTime": "30 minutes (after dough has risen)", "recipeYield": "Makes three 12-inch pizzas", "recipeCategory": ["Mains", "Pesto", "Pizza", "The Pizza Lab"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">New York-style Pizza Dough</a> or 36 ounces store-bought pizza dough", "Kosher salt", "3 ounces fresh spinach leaves (about 4 loosely packed cups), tough stems removed", "3 ounces fresh basil leaves (about 4 loosely packed cups/2 bunches)", "1 minced garlic clove", "6 ounces grated parmigiano reggiano, divided", "3 ounces toasted pine nuts", "1/3 cup extra-virgin olive oil", "1 teaspoon zest from 1 lemon", "12 ounces fresh mozzarella cheese, torn into small chunks", "12 ounces fresh ricotta cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 2 hours before baking, divide dough into three even parts, form into balls, place on a lightly floured surface, cover loosely with plastic wrap, place a towel on top of the plastic wrap to keep the edges pressed down, and allow balls to rise at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of salted water to a boil and prepare an ice bath. Add spinach, basil, and garlic to boiling water and boil until leaves are just wilted, about 30 seconds. Transfer to ice bath and allow to chill completely. Transfer to the center of a clean kitchen towel. Gather up towel edges to form a bundle in the center. Squeeze until you've extracted as much liquid as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer greens to work bowl of a food processor. Add 3 ounces of parmesan, pine nuts, garlic, olive oil, and lemon zest. Process until a smooth puree is formed. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 30 minutes before ready to bake, adjust oven rack to top position and place a baking stone or steel on top. Preheat oven to highest setting (500 to 550°F).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one pizza at a time, stretch or roll dough out into a 12-inch circle on a lightly floured surface. Transfer to a lightly floured wooden pizza peel. Sprinkle surface evenly with 1 ounce of parmesan cheese. Dollop 4 ounces of mozzarella, 4 ounces of ricotta, and 1/3 of pesto over surface of pizza and sprinkle with salt. Transfer to pre-heated steel or stone and bake until blistered and bubbly, 4 to 8 minutes. Remove from oven, slice into 8 slices and serve. Repeat with remaining 2 pizzas.</p>"}]}