{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130914-266263-pumpkingraham9.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cookie", "graham cracker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Pumpkin Graham Crackers", "link": "https://www.seriouseats.com/recipes/2013/10/homemade-pumpkin-graham-cracker.html", "description": "These are a subtle treat. They're only slightly sweet, and they don't scream \"pumpkin\" but rather whisper it, with a lovely moistness that makes the crackers a bit softer than a plain homemade version. They have an earthy flavor that might make you think, for an instant, \"health food\", but the spices, brown sugar and kiss of honey will bring you quickly back to cozy fall snack territory.", "totalTime": "3 hours (includes cooling time)", "recipeYield": "Makes 18 to 20 crackers", "recipeCategory": ["Cakespy", "Cookies", "Halloween", "Pumpkin"], "recipeIngredient": ["1 cup (about 4 ounces) whole wheat flour", "1 cup (about 4 1/4 ounces) all purpose flour", "2 tablespoons granulated sugar", "2 tablespoons dark brown sugar, packed", "1 teaspoon cinnamon", "1 teaspoon baking powder ", "1/2 teaspoon salt", "1 large egg, beaten", "2 tablespoons vegetable oil", "1 tablespoon (about 0.75 ounces) honey", "1/2 cup pumpkin puree (un-spiced)", "5 tablespoons milk, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, sift together the whole-wheat flour, all-purpose flour, granulated sugar, brown sugar, cinnamon, baking powder and salt. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, combine the egg, oil, honey, and pumpkin puree. Whisk until combined. It will be lumpy and weird looking, but don't panic. It will become normal once you mix it with the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the wet ingredients into the dry ingredients, mixing until incorporated. The dough may be pretty dry. Add up to 2 tablespoons of the milk to moisten it. You want the dough moist enough to stick together with a lightly crumbly texture&mdash;not to the point where it gets sticky. The dough will be slightly crumbly, but should hold together when you clump it with your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a lightly floured board and pat into a rough square shape, about 1-inch thick. Wrap the dough in plastic and let chill in the refrigerator for two hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you’re ready to bake the crackers, preheat the oven to 375&deg;F. Line two baking sheets with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough onto a generously floured surface and knead it gently by hand until it holds together (the dough will be somewhat crumbly at the edges, which is OK; kneading will help it hold together). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the dough into a rough square shape again, then roll it out to about 1/8-inch thick. If you’re having difficulty rolling it this thin, or just prefer a more substantial cracker, it is totally fine to keep the dough thicker, you’ll just get a few less crackers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough into approximately 3- by 5- inch rectangles with either a knife or a pizza cutter. Clean up any ragged edges by pressing the flat side of a knife gently against the sides. Transfer to the prepared baking sheets using a spatula. Re-roll scraps to get more graham crackers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prick each square several times with the tines of a fork or a toothpick. These crackers won’t spread too much during the baking process, so you can keep them fairly close to one another on the sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the tops lightly with the remaining 3 tablespoons of milk. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 14-18 minutes, or until the crackers are lightly browned. Remove from the oven, transfer to a wire cooling rack, and cool completely. The crackers will be quite soft to begin, but will harden and become crunchy after a few hours. Store in an airtight container at room temperature for up to 10 days.</p>"}]}