{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/236347-20120116-british-bites-curry-sauce.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british", "british bites", "curry", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "British Curry Sauce", "link": "https://www.seriouseats.com/recipes/2013/01/british-curry-sauce-recipe.html", "description": "This spicy curry sauce can be found all over Britain, in chip shops and pubs - and even bottled (or powdered) in markets to use as a simple sauce to turn leftover roast dinners into a simple meal the following day. The spice can be tailored to the level of heat you want, but the base of aromatics and toasted spices make a fantastic base for any number of dishes.", "totalTime": "40 minutes", "recipeYield": "makes 1 1/2 cups", "recipeCategory": ["British Bites", "Condiments and Sauces", "Dairy-Free"], "recipeIngredient": ["2 tablespoons vegetable oil ", "1 medium onion, grated on the large holes of a box grater ", "2 medium cloves garlic, finely chopped (about 2 teaspoons)", "1-inch piece of ginger, peeled and finely chopped (about 1 tablespoon)", "1 1/2 teaspoons ground cumin ", "1 teaspoon ground turmeric ", "1/2 teaspoon ground coriander ", "1 teaspoon paprika ", "1/2 teaspoon curry powder (such as Madras)", "Pinch of red pepper flakes ", "1 tablespoon tomato paste ", "1 tablespoon all purpose flour ", "1 1/2 cups water ", "1 tablespoon juice from 1 lemon", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a medium non-stick skillet over medium-high heat until shimmering. Add onion, garlic, and ginger Cook stirring constantly with a spatula until onions soften about 5 minutes. Add cumin, turmeric, coriander, paprika, curry powder, and pinch of red pepper flakes and continue to cook until the spices begin to smell toasted, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium and add tomato paste and continue to stir until tomato paste is evenly incorporated and has begun to reduce, about 3 minutes. Add flour and mix until there are no lumps and no white spots left in the pan. Pour the water and lemon juice into the pan and stir until the mixture begins to thicken, allow curry sauce to reduce until the mixture has reduced to about 1 1/2 cups. Curry sauce can be stored for up to a week in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point you can decide whether or not to puree and strain the mixture. If you decide to puree and strain the curry then run it through a food processor or blender and the pass through a fine mesh strainer. Season with salt and pepper, then use to make a variety of delicious curries. </p>"}]}