{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130108-mint-chocolate-chip-panna-cotta-chocolate-ribbons.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["chocolate", "chocolate chip", "custard", "mint", "panna cotta", "pudding", "very small anna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mint Chocolate Chip Panna Cotta", "link": "https://www.seriouseats.com/recipes/2013/01/mint-chocolate-chip-panna-cotta-recipe.html", "description": "Simple, delicious and nostalgic. Panna cotta in a classic ice cream flavor.", "totalTime": "2 hours", "recipeYield": "serves 6", "recipeCategory": ["Chocolate", "Puddings and Custards", "Very Small Anna"], "recipeIngredient": ["3 1/2 cups half and half, divided", "2/3 cup sugar", "1 tablespoon powdered gelatin", "1 teaspoon peppermint extract", "1/2 teaspoon vanilla extract", "4 drops liquid green food coloring", "2 ounces bittersweet chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 cups of half and half to a medium saucepan. Stir in sugar and sprinkle with gelatin. Set aside five minutes to allow gelatin to bloom. Gently heat saucepan mixture over low heat, stirring gently. Heat until almost simmering. Both the sugar and gelatin should be completely melted. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine remaining half and half, peppermint extract, vanilla, and food coloring in a medium bowl. Pour hot mixture into bowl and gently whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place bowl over an ice bath and stir gently with a spatula until mixture is cold to the touch. Do not use a whisk or you will introduce too much air and create a strange final texture in your panna cotta. Once cold, move to refrigerator or freezer. Check every five minutes. Once mixture is thick, remove immediately. This will take about ten minutes in the freezer, up to half an hour in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While you chill panna cotta mixture, melt chocolate in a small glass or metal bowl over simmering water or in 30 second bursts in the microwave. You want it fluid but not hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle chocolate in thin ribbons over thick panna cotta mixture. Allow chocolate to harden (it will go from shiny to matte) before gently breaking up and stirring into mixture. Repeat until all chocolate is used. Pour into six 8 or 9 ounce clear glasses and transfer to refrigerator to finish setting, at least one hour. Serve.</p>"}]}