{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130904-very-small-anna-vanilla-pudding.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["pudding", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vanilla Pudding", "link": "https://www.seriouseats.com/recipes/2013/09/vanilla-pudding-recipe.html", "description": "Though many pudding recipes do not include eggs, I like yolks in my vanilla pudding for a little extra richness and color, and for that \"French vanilla\" flavor.", "totalTime": "30 minutes", "recipeYield": "Serves 5", "recipeCategory": ["Puddings and Custards", "Very Small Anna"], "recipeIngredient": ["3 cups milk", "1 vanilla bean, split and scraped", "3/4 cup plus 2 tablespoons sugar", "Pinch salt", "6 egg yolks", "2 tablespoons cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk, vanilla, sugar, and salt in a medium saucepan and place over medium heat, stirring occasionally. In a medium mixing bowl, whisk together the yolks and cornstarch to form a paste. Once the milk is steaming and the sugar has dissolved, gradually pour the liquid into the yolks, whisking constantly, then return the mixture to the pan and cook over medium-high heat, stirring constantly, until it comes to a boil. Continue to boil, stirring thoroughly and constantly, for 2-3 minutes. To test if the pudding is thoroughly cooked, taste a tiny bit&mdash;if it feels in any way gritty, boil for another minute and test again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once it is completely smooth to the taste, force through a fine mesh strainer and chill over an ice bath, stirring occasionally to prevent a skin. Once cool, blend with an immersion blender until smooth and shiny. Will keep for several days in a clean airtight container.</p>"}]}