{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130219-241438-dinner-tonight-pan-seared-steak-creamed-spinach-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beef", "Dinner Tonight", "quick", "ribeye", "spinach", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-Seared Ribeye Steak with Quick Creamed Spinach", "link": "https://www.seriouseats.com/recipes/2013/02/pan-seared-ribeye-steak-with-creamed-spinach-recipe.html", "description": "About once or twice a year, I'm struck by a desire to eat steak&mdash;and not just any old cut of meat, but a gigantic, thick-cut monster. While most of my cravings can easily be satisfied by going out to eat, I find the whole steakhouse experience prohibitively expensive. Plus, I feel like I'd have to wear a tie, and I really don't want to do that.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Beef", "Dinner Tonight", "Mains", "Spinach"], "recipeIngredient": ["1 large ribeye steak, approximately 1 1/2-inches thick (24 to 30 ounces)", "Kosher salt and freshly ground black pepper", "1/4 cup vegetable or canola oil", "5 tablespoons butter, divided ", "6 sprigs thyme or rosemary (optional)", "1 tablespoon all-purpose flour ", "1/2 cup heavy cream ", "3/4 pound spinach, washed and rinsed, cut into thin strips ", "Pinch grated nutmeg", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season ribeye well with salt and pepper. Heat oil in a 12-inch heavy-bottomed cast-iron skillet over high heat until just beginning to smoke. Carefully add steak and cook, flipping every 30 seconds or so with a pair of tongs, until a pale golden brown crust starts to develop, about 4 minutes total. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add two tablespoons of butter to skillet. Continue flipping steak every 30 seconds, while using a spoon to baste the steak with foaming butter. (See here for a <a href=\"http://www.seriouseats.com/2012/12/the-food-lab-complete-guide-to-pan-seared-steaks.html\">step-by-step slideshow of the process</a>. If butter starts to smoke excessively, reduce heat to medium. Continue process until a meat thermometer inserted in the thickest part registers 125&deg;F (for medium rare), 8 to 10 minutes total. Remove steak and set aside on a large plate to rest for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt one tablespoon butter in a small saucepan over medium-low heat. Add flour and stir with a whisk until there are no lumps. Reduce heat to medium low, and cook until the roux becomes blonde and smells toasty, 2 to 3 minutes. Pour in heavy cream and whisk continuously to avoid lumps. Season with 1/8 teaspoon salt and a pinch of grated nutmeg, and simmer gently until thick and creamy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining tablespoon of butter in a medium-sized skillet over medium heat. Add the spinach and stir with a pair of tongs until leaves have just wilted, but still have some integrity. Turn off heat. Pour half of the cream sauce in the skillet and stir well. Add more if necessary to help bind the spinach together. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the steak into 1/2-inch thick slices (if desired), sprinkle with coarse sea salt, and serve with spinach on the side.</p>"}]}