{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130805-very-small-anna-cakelets-primary.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["blackberries", "cake", "cupcakes", "from the pastry dungeon", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "White Chocolate Cakelets with Blackberry Cabernet Gastrique", "link": "https://www.seriouseats.com/recipes/2013/08/white-chocolate-cakelets-with-blackberry-cabe.html", "description": "Even those who claim to hate white chocolate will like these cakes. The white chocolate flavor comes through and the edges become slightly toasted, and the cakes are not too sweet or greasy. Balance out the rich sweetness with a gastrique of Cabernet vinegar and blackberries.", "totalTime": "1 hour", "recipeYield": "Makes 12 cakelets", "recipeCategory": ["Cakes", "Very Small Anna"], "recipeIngredient": ["<strong>For the Cakelets</strong>", "6 ounces white chocolate", "1/2 cup unsalted butter", "3 eggs", "3/4 cup sugar", "1/2 teaspoon vanilla", "3/4 cup plus 1 tablespoon flour", "3/4 teaspoon salt", "1/2 teaspoon baking powder", " ", "<strong>For the Gastrique</strong>", "1/2 cup sugar", "Pinch salt", "2 tablespoons water", "1/2 cup Cabernet vinegar", "1 cup blackberries, fresh or thawed from frozen", "Pinch black pepper (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cakelets</strong>: Place rack in center of oven. Preheat oven to 350&deg;F. Line a 12 cup muffin tray with paper liners, set aside. Place white chocolate in a bowl over barely simmering water and allow to melt completely. Remove from heat and add butter in small pieces, stirring to melt each addition before continuing. Set aside, but stir occasionally to prevent separation.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine eggs, sugar, and vanilla in bowl of stand mixer or medium bowl and set over simmering water. Whisk occasionally and continue heating until hot to the touch. Remove from heat and whip on high speed in stand mixer or with handheld electric mixer until side of bowl is room temperature and eggs are very pale and thick. Fold in chocolate mixture, then dry. Divide evenly between paper-lined muffin cups and bake for 10 minutes, then turn and bake for another 3-5 minutes, until cakes are lightly browned and cake tester inserted comes out clean. Allow to cool, then refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Gastrique</strong>: Combine sugar, salt, and water in a medium saucepan. Place over medium-high heat and cook until lightly caramelized. Remove from heat and gently swirl until darkened to a honey color, then carefully pour in the vinegar. Place over low heat and allow to cook, stirring gently, until crystallized sugar melts and mixture thickens slightly. Add blackberries and continue cooking, mashing berries as you stir. Once sugar is completely melted, remove from heat and allow to cool. Add black pepper if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, peel papers from cakes, place on plates and allow to come to room temperature. Reheat gastrique slightly and spoon over cakes.</p>"}]}