{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130225-241869-WholeWheatCouscous.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["cous cous", "fennel", "feta", "light eating", "lunch box", "make ahead", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Toasted Whole-Wheat Israeli Couscous with Fennel, Lemon, and Feta", "link": "https://www.seriouseats.com/recipes/2013/02/make-ahead-toasted-whole-wheat-couscous-fennel-lemon-feta-recipe.html", "description": "Super-toasty Israeli couscous is bombarded with flavors: roasted fennel and red onion, creamy feta, tart lemon and parsley. Let everything hang out in the fridge overnight, and you've got yourself an enviable lunchbox for tomorrow.", "totalTime": "35 minutes", "recipeYield": "serves 2", "recipeCategory": ["Lunch Box", "Mains", "Other Grains", "Vegetarian"], "recipeIngredient": ["1 small bulb fennel, tops removed, bulb halved and very thinly sliced (about 1 cup), 3 tablespoons fronds reserved and roughly chopped", "1 small red onion, thinly sliced (about 3/4 cup)", "3 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "1 cup homemade or store-bought low sodium vegetable or chicken broth", "1 tablespoon unsalted butter", "1/2 cup whole-wheat or regular Israeli couscous", "1/4 cup fresh flat-leaf parsley, roughly chopped", "2 teaspoons grated zest plus 1 tablespoon juice from 1 lemon", "3/4 teaspoon honey", "3 ounces feta cheese, crumbled "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450°F. Mix together fennel and onions with 2 tablespoons olive oil to coat, and season with salt and pepper. Roast on baking sheet, turning occasionally, until crispy on edges, about 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring broth to a boil and maintain at a bare simmer. In separate saucepan, melt butter until foamy over medium-high heat, then add couscous and cook until toasted and fragrant, stirring constantly, about 2 minutes. Add hot vegetable stock and a pinch of salt, turn heat to low, and cover. Cook until couscous is puffed and liquid is absorbed, about 8 minutes, then let sit off heat, covered, 4 to 5 minutes. Uncover, fluff, transfer to bowl and fold in fennel fronds, parsley and lemon zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together 1 tablespoon olive oil, lemon juice and honey. Let roasted fennel and onions cool slightly, then toss with dressing in bowl. Add vegetables to bowl with couscous, keeping any excess dressing in bowl. Gently stir in feta. Serve warm immediately, or let cool to room temperature and store in airtight container and refrigerate. Reheat in microwave for 45 seconds to 1 minute.</p>"}]}