{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130113-237241-SpicyNoodleBowlwithBeefandMango.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "Thai", "keywords": ["basil", "beef", "bell peppers", "fish sauce", "lunch box", "noodle", "quick", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spicy Noodle Bowl with Beef and Mango", "link": "https://www.seriouseats.com/recipes/2013/01/spicy-noodle-bowl-beef-and-mango-recipe.html", "description": "Sweet mango and Thai basil balance out a spicy dressing with lime and fish sauce in this bowl of noodle goodness. Fresh and bright, this flavorful dish won't leave you with post-greasy takeout blues.", "totalTime": "8 hours 35 minutes (includes marinating times)", "recipeYield": "serves 2", "recipeCategory": ["Beef", "Lunch Box", "Mains", "Pasta", "Thai"], "recipeIngredient": ["2 tablespoons juice and 1/2 teaspoon zest from 2 limes", "2 tablespoons soy sauce", "1 1/2 teaspoons red chili flakes", "1 teaspoon fish sauce", "1 teaspoon honey", "8 ounces flank or skirt steak, cut into 1/4-inch thick slices against the grain", "3 1/2 ounces whole-wheat dried udon noodles ", "2 1/2 teaspoons canola oil", "1 mango, peeled, sliced into wide, thin strips with a vegetable peeler", "1 red bell pepper, seeded, ribs removed, cut into thin strips", "1/4 cup unsalted roasted peanuts", "Small handful fresh basil leaves (preferably Thai), torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together lime juice and zest, soy sauce, chili flakes, fish sauce, and honey. Set aside 3 tablespoons for noodle dressing in an airtight container and refrigerate overnight. Place steak in shallow dish; pour over remaining lime-soy dressing and turn steak to coat. Let marinate 20 minutes at room temperature, turning steak occasionally. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil noodles in salted water until tender according to package directions, about 10 minutes. Drain. Transfer to a bowl and toss with 1 teaspoon canola oil. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush cast-iron grill pan with remaining canola oil and heat over high heat until oil is shimmering. Remove steak slices from marinade, discarding marinade, and grill over high heat until browned and lightly caramelized on both sides, 1 to 2 minutes per side. Transfer to plate to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss beef with noodles, mango and bell peppers and top with peanuts and thai basil. Store in refrigerator until ready to use. To assemble the next morning, toss noodle bowl with reserved dressing until well coated and pack in airtight container to go. </p>"}]}