{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/041713-248188-cook-the-book-ny-dosas-pondicherry-dosa.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["alexandra penfold", "coconut", "Cook the Book", "new york a la cart", "ny dosas", "pondicherry dosa", "potato curry", "siobhan wallace"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "NY Dosas' Pondicherry Dosa from 'New York a la Cart'", "link": "https://www.seriouseats.com/recipes/2013/04/ny-dosas-pondicherry-dosa-from-new-york-a-la.html", "description": "Until picking up <strong><a href=\"http://www.seriouseats.com/user/profile/BrooklynBrownie\">Alexandra Penfold</a></strong> and <strong><a href=\"http://www.blondieandbrownie.com/\">Siobhan Wallace's</a></strong> new cookbook, <em><a href=\"http://www.amazon.com/New-York-Cart-Recipes-Stories/dp/076244682X/?tag=serieats-20\">New York a la Cart</a></em>, I didn't know the first thing about making dosas at home. I didn't even know you <em>could</em> make dosas at home. The tangy, ethereally light and crisp oversize Indian pancakes seem like the kind of dish unwise to attempt on a tiny stove, in a tiny kitchen with little practice at spreading gloppy, sticky batter. But with a little practice, dosas pretty darn close to what you'd be served at food cart <strong><a href=\"https://www.facebook.com/pages/NY-Dosas/102646712631\">NY Dosas</a></strong> can be had in your kitchen.", "totalTime": "24 to 36 hours", "recipeYield": "serves 6", "recipeCategory": ["Bread", "Coconut", "Cook the Book", "Dairy-Free", "Gluten-Free", "Mains", "Vegan", "Vegetarian"], "recipeIngredient": ["1 cup uncooked rice (any type, according to your preference)", "1 cup Urad Dal (lentils), split and shelled", "Kosher salt", "3 whole medium potatoes", "2 carrots", "2 large whole green lettuce leaves", "2 bell peppers (mixture of red, green, yellow, orange), seeded", "1 two ounce piece of ginger, peeled", "2 tablespoons turmeric powder", "2 medium onions (any type), finely chopped", "1 tablespoon of olive oil", " ", "<strong>Indian Spices</strong>", "1 tablespoon turmeric powder", "2 teaspoons ajwain seeds", "2 teaspoons mustard seeds", "2 teaspoons chili powder", "1 teaspoon black pepper", "3 to 4 curry leaves", "1 tablespoon fenugreek seeds", "3 red dried chilies", "Cooking spray", "3 cups sambar, for serving", "2 cups coconut chutney, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the rice and lentils in separate large bowls and cover generously with water. Cover the bowls to encourage fermenting and soak the rice and lentils in water for at least 6 hours, until hydrated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the rice and lentils separately reserving their soaking liquid. Add the rice to a blender or food processor with approximately ¼ to ½ cup of the soaking water, blend until smooth, about a minute. Return the rice mixture to its bowl, then repeat with the lentils. Once the lentils are smooth combine the rice and lentils then blend together, adding salt to taste. As you’re blending, add additional soaking water in order produce a batter about the consistency of pancake batter—not too watery or too thick. Transfer the batter to a large bowl, cover and let it rest at room temperature or in a warm spot in your kitchen for at least 6 hours so that it can ferment naturally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, to make the curry, peel and cut the potatoes into bite-sized pieces. Boil them until fork-tender. Roughly chop the carrots, lettuce, and peppers mixing them together, like you would for a salad, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sauté the onions with olive oil over low heat. Once the onions are translucent and tender, about three minutes, mix the Indian spices in with them and continue sautéing. Once the onions are fully coated and the spices have become aromatic, remove from heat and mix the cooled potatoes in to make the curry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the batter has finished fermenting—it will double in size and begin to give off a sour aroma—you are ready to make the dosa. Using a long-handled metal ladle, pour a ladleful of batter onto a heated grill or large non-stick pan prepared with cooking spray, trying to make circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly use the back of your ladle to spread out the batter to create a large circle. Cook the dosa until the bottom is golden brown, and the top is dry. Once golden brown spots begin to appear on the top, add a heaping serving of the potato curry and put it on a plate. Serve with coconut chutney and sambar to dip the dosa in.</p>"}]}