{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130529-252944-british-bites-beef-ale-marmite-pie.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["ale", "beef", "british bites", "marmite", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beef, Ale, and Marmite Pie", "link": "https://www.seriouseats.com/recipes/2013/05/beef-ale-marmite-pie-recipe.html", "description": "We have reached the end of May, and with it, the last dish of <a href=\"http://www.seriouseats.com/tags/marmite\">Marmaggedon</a>. This recipe celebrates Marmite's salty, savory flavor in the form of ale-stewed beef wrapped in flakey pastry. It makes a hearty, filling dinner but could just as easily go along on a picnic as a chilled dish, instead.", "totalTime": "4 hours", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Mains"], "recipeIngredient": ["1 pound beef chuck, cut into 1 1/2- to 2-inch cubes", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil", "1 medium onion, finely chopped (about 1 cup)", "1 medium carrot finely chopped (about 3/4 cup)", "1 teaspoon finely chopped fresh thyme leaves", "1 teaspoon finely chopped fresh rosemary leaves", "10 ounces button mushrooms, sliced", "1 cup ale", "1 cup homemade beef or store-bought low sodium chicken stock", "1 tablespoon marmite", "1 pound frozen puff pastry, thawed", "1 egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season beef with salt and pepper. Heat vegetable oil in a Dutch oven over medium-high heat until lightly smoking. Add half of beef and cook, turning occasionally, until browned on all sides, about 8 minutes. Remove from pot, reheat oil, and repeat with remaining beef. Remove beef from pot and add onion, carrot, thyme, rosemary, and mushrooms, and cook, stirring until onions are translucent and mushrooms have released their liquid, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return meat to pot and add ale, stock, and marmite. Bring to a boil, reduce to a bare simmer, cover, and cook until meat is tender, about 2 hours. Season to taste with salt and pepper. Transfer to a container to cool. Cooled filling can be refrigerated in a covered container for up to three days before assembling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 400°F. Cut puff pastry in half. Roll each half into a 1/4-inch thick square large enough to be draped into a 9-inch pie pan. Transfer one half to pie pan. Place the cooled meat filling in the pie shell, brush the edges with beaten egg and place the remaining pastry over filling, trimming any bits of pastry that fall over the edges of the pie dish and pinch the edges gently with your fingers to seal.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a few steam vents in the top of the pie and brush with beaten egg, bake in preheated oven until pastry is golden brown, about 50 minutes. Allow pie to cool for 15 minutes before slicing and serving.</p>"}]}