{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130826-toasted-vanilla-ice-cream-roasted-plums.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["dessert", "ice cream", "Plum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Toasted Vanilla Ice Cream with Roasted Plums", "link": "https://www.seriouseats.com/recipes/2013/08/toasted-vanilla-ice-cream-roasted-plums-recipe.html", "description": "I meant to make caramel ice cream. I did one thing right, though, adding a split vanilla bean to the sugar before setting it on the stove. Turns out, sugary toasted vanilla bean smells a lot like toasted marshmallow. And luckily for me, toasted vanilla goes just as well with roasted plums as caramel does.", "totalTime": "16 hours", "recipeYield": "Makes 1 1/2 quarts ice cream, 1 pint plum sauce", "recipeCategory": ["Fruit Desserts", "Ice Cream and Frozen Treats", "Plum", "Very Small Anna"], "recipeIngredient": ["<strong>For the Ice Cream</strong>:", "1 cup sugar", "1/2 teaspoon salt", "1 vanilla bean, split and scraped", "2 tablespoons water", "2 cups milk", "2 cups heavy cream", "7 egg yolks", "&nbsp;", "<strong>For the Plums</strong>", "1/2 cup sugar", "Pinch salt", "2 tablespoons water", "8 plums, any combination of colors, pitted and quartered (about 1 quart)", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground ginger", "1/4 teaspoon ground nutmeg", "1 to 2 tablespoons bourbon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ice Cream</strong>: Combine sugar, salt, vanilla bean and water in medium saucepan and set over high heat. Allow to cook until bubbling slows and sugar starts to caramelize, about 10 minutes. Lower heat and watch carefully, when caramel is the color of clover honey, remove from heat entirely and slowly and carefully pour in milk and cream. Set over low heat and cook, stirring occasionally, until all seized caramel is melted and liquid is a uniform creamy honey color. Place yolks in a medium mixing bowl and whisk to lightly scramble. Slowly pour hot liquid into egg yolks, whisking constantly, then return mixture to pan and cook over low heat, stirring constantly, until thick enough to coat the back of a spoon. Immediately pass through a fine mesh strainer and chill for at least 12 hours. Process in ice cream machine according to manufacturer's instructions, and let churned ice cream set up in freezer for at least 2 hours before scooping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Plums</strong>: Place rack in center of oven and preheat to 400&deg;F. Place sugar, salt and water in an ovensafe pot or Dutch oven and place over medium-high heat, cooking until golden in color, about 8 minutes. Remove from heat and carefully add plums, spices and bourbon. Return to heat and cook, stirring occasionally, until any seized caramel is melted and plums are juicy. Place in oven for 10 minutes, then remove and allow to cool slightly before pouring over scoops of ice cream. Any leftover can be refrigerated and rewarmed in the microwave or on the stovetop for future ice cream servings.</p>"}]}