{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131108-meat-lite-soba-noodle-soup.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "bok choy", "chicken", "easy", "Japanese", "noodle", "soba", "soup", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.75", "ratingCount": "4"}, "name": "Soba Noodle Soup With Chicken, Tofu, and Bok Choy", "link": "https://www.seriouseats.com/recipes/2013/11/soba-noodle-soup-with-chicken-tofu-recipe.html", "description": "If the pairing of tofu and meat seems incongruous to you, then you've probably missed out on many of the best dishes that Asian cuisines have to offer.", "totalTime": "1 hour", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Chicken", "Japanese", "Mains", "Meat Lite", "Pasta", "Soups and Stews", "Tofu"], "recipeIngredient": ["1 tablespoon vegetable oil", "2 medium cloves garlic, finely minced or grated on a microplane grater (about 2 teaspoons)", "1 inch section fresh ginger,  finely minced or grated on a microplane grater (about 1 tablespoon)", "2 inch section fresh lemongrass, cut in half lengthwise and bruised with the back of a knife", "6 cups homemade or store-bought low sodium chicken or vegetable stock", "3 tablespoons dark soy sauce", "1 whole star anise", "3 medium chicken thighs", "7 medium shiitake mushrooms, caps very thinly sliced, stems discarded", "1 large bok choy, well rinsed, greens and stalks separated, sliced into thin ribbons", "1 teaspoon rice wine vinegar", "1/2 block block extra-firm tofu (about 8 ounces), drained in the fridge on paper towels under a weight (such as a can of beans) for several hours or overnight, cut into 1/2-inch dice", "1 pound dried soba noodles", "1/4 cup thinly sliced scallion greens and light whites", "1/4 cup torn fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large Dutch oven set over medium heat until shimmering. Add garlic, ginger, and lemongrass and cook, stirring, until aromatics are fragrant, about 1 minute. Add stock, soy sauce, anise, and chicken thighs and increase heat to high. Bring liquid to a boil then reduce heat to maintain a simmer and cook until chicken is just cooked through, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add shiitakes and sliced bok choy stems to soup and cook for 15 minutes sliced bok choy greens and cook until vegetables and chicken are tender, about 15 minutes longer. Remove chicken and let cool slightly, then shred into bite-sized pieces with your fingers. Return to soup. Add vinegar, tofu, and noodles to soup and cook until noodles are cooked (see package for cooking time). Season soup to taste with more soy sauce, vinegar, or salt, garnish with scallions and cilantro, and serve.</p>"}]}