{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/041913-248963-Sunday-Supper-Sonoran-Pot-Roast-PieB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["beef", "casseroles", "cornbread", "pot roast", "Southwestern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sonoran Pot Roast Pie with Cheesy Cornbread Crust", "link": "https://www.seriouseats.com/recipes/2013/04/sonoran-pot-roast-pie-cheesy-cornbread-recipe.html", "description": "A casserole inspired by the Sonoran hot dog combines slow-cooked salsa verde pot roast, creamy, bacon-flecked pinto beans, and a cornbread crust.", "totalTime": "2 1/2 hours", "recipeYield": "serves 6", "recipeCategory": ["Bacon", "Beef", "Cheese", "Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the Beef Layer:</strong>", "1 tablespoon olive oil", "Kosher salt and freshly ground black pepper", "2 1/2 pound whole boneless beef chuck", "1 medium onion, finely chopped (about 1 cup)", "2 medium cloves garlic, minced (about 2 teaspoons)", "12 ounces light-flavored beer (such as Corona, Dos Equis, or PBR)", "16 ounces jarred or <a href=\"http://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">homemade</a> tomatillo salsa", "3 sprigs thyme", "&nbsp;", "<strong>For the Bean Layer:</strong>", "1 (15-ounce) can pinto beans, drained and rinsed", "1 (4-ounce) can fire-roasted jalapenos or green chiles", "5 slices bacon, cooked and crumbled ", "1/4 cup sour cream", "1/3 cup chopped fresh cilantro leaves and tender stems", "1 tablespoon lime juice from 1 lime", "&nbsp;", "<strong>For the Cornmeal Crust:</strong>", "2/3 cup yellow cornmeal", "1 cup all-purpose flour", "2 teaspoons sugar", "1 teaspoon baking soda", "2/3 cup milk", "2 eggs, lightly beaten", "3 tablespoons unsalted butter, melted", "1/3 cup frozen thawed or fresh corn kernels", "1/4 cup pepper jack cheese, shredded", "3/4 cup extra-sharp cheddar cheese, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 325&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beef Layer:</strong> Heat oil over medium-high heat in a large Dutch oven. Season meat liberally with salt and pepper. When oil is shimmering, sear meat on both sides until nicely browned, about 7 minutes total. Remove the meat. Reduce heat to medium and add onions and garlic. Cook, stirring frequently, until just beginning to soften, about 3 minutes. Add beer and bring to a boil, scraping any browned bits from the bottom of the pot. Return meat to pan, add salsa and thyme and return to a boil. Cover and transfer to the oven to cook until a fork shows no resistance when inserted, 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beans:</strong> When meat nears the end of cooking time, place beans in a large bowl and gently mash, taking care to leave some texture. And canned chiles, bacon, sour cream, cilantro, and lime juice and stir to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Combine cornmeal, flour, sugar, baking soda, milk, eggs, melted butter, and 1/4 teaspoon salt in a medium bowl. Whisk with a fork until just combined and lump-free. Fold in corn kernels, pepper jack cheese, and 1/4 cup cheddar cheese. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble</strong>: When meat is finished cooking, remove from the oven. Discard thyme sprigs. Transfer pot roast to a platter and tear meat into small chunks or shreds, discarding any unappealing fatty bits. Return meat to pot and stir with juices to combine. The meat should be well-coated and saucy, not stew-like. Taste and adjust seasonings, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray cooking spray on inside of individual baking crocks or a 13- by 9-inch baking dish. If using crocks, spread an even portion of meat on the bottom of dishes. Top with equal portions of the bean mixture, followed by a layer of cheddar cheese from the remaining 1/2 cup you have on hand. Top with cornmeal mixture and spread evenly over the cheese using a spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven and bake until browned and bubbly, 30 to 35 minutes. Serve with sour cream and additional limes, if desired.</p>"}]}