{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130220-mushroom-sweet-potato-canneloni-butter-beans-escarole-09.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["beans", "cannelloni", "chicory", "endive", "escarole", "Italian", "mushrooms", "pasta", "sweet potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Sweet Potato and Mushroom Cannelloni with Braised Escarole and Butter Beans (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/03/sweet-potato-mushroom-cannelloni-braised-escarole-butter-beans-recipe.html", "description": "A vegan meal with a centerpiece of cannelloni stuffed with sauteed wild mushrooms and creamy sweet potato puree baked along with butter beans and braised escarole until crunchy and browned.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Beans and Pulses", "Dairy-Free", "Italian", "Mushrooms", "Pasta", "Sweet Potatoes and Yams", "Vegan"], "recipeIngredient": ["8 sheets flat no-boil lasagna noodles", "2 ounces dried morel mushrooms", "1 large sweet potato, peeled and roughly cubed (about 8 ounces)", "1 tablespoon maple syrup", "1 tablespoon extra-virgin olive oil, plus more for serving", "Kosher salt and freshly ground black pepper", "1 tablespoon canola or vegetable oil", "8 ounces wild mushrooms of your choice, sliced into 1/2-inch pieces", "1 small shallot, minced (about 2 tablespoons)", "1 medium clove garlic, minced (about 1 teaspoon)", "2 teaspoons picked fresh thyme leaves", "2 teaspoons soy sauce, divided", "1 tablespoon lemon juice, divided", "1 cup dry white wine", "2 (15-ounce) cans large butter beans, drained but not rinsed", "1 head escarole, dark green leaves and ends removed and discarded, pale stalks and leaves washed and cut into 3-inch segments", "2 tablespoons chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pasta sheets in a large bowl or baking dish and cover with hot water. Allow to soak, agitating them occasionally, until malleable, at least 30 minutes. Meanwhile, place dried mushrooms in a 2 quart liquid measure and cover with 1 1/2 quarts hot water. Microwave on high power until simmering, about 2 minutes. Set aside and allow mushrooms to soak until tender, about 10 minutes. Drain mushrooms and squeeze dry, reserving soaking liquid. Roughly chop mushrooms into 1/2- to 1-inch pieces</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While past and mushrooms soak, place sweet potato in a medium saucepan and cover with water. Bring to a boil over high heat, then reduce to a simmer and cook until potato shows no resistance when pierced with a knife, about 8 minutes. Drain and transfer to the bowl of a food processor. Add maple syrup and 1 tablespoon olive oil and process until smooth. Season to taste with salt and pepper. Alternatively, to make without a processor, pass potato through a ricer into a bowl. Whisk in maple syrup and olive oil and season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat canola or vegetable oil in a large skillet over high heat until smoking. Add fresh and soaked mushrooms and cook, stirring and tossing occasionally, until mushrooms are well browned on all sides, about 4 minutes. Reduce heat to medium. Add shallots, garlic, and thyme, and cook, stirring and tossing constantly until fragrant, about 30 seconds. Add 1 teaspoon soy sauce and 2 teaspoons lemon juice and toss to coat. Season to taste with salt and pepper, then transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to high heat. Add white wine and cook, scraping up browned bits with wooden spoon. Allow to reduce by half, then add mushroom soaking liquid along with beans. Simmer until reduced by 1/3, about 5 minutes. Add escarole, remaining soy sauce, and remaining lemon juice and season to taste with salt and pepper. simmer until escarole is lightly softened, about 2 minutes. Pour beans and escarole into a 9- by 13-inch baking dish. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper middle position and preheat oven to 425°F. Transfer pasta sheets to a double layer of paper towels and dry them on both sides. Working one piece at a time, lay pasta flat on cutting board with the short end parallel to the edge of the table, the add 1/8th of potato mixture and 1/8th of mushroom mixture to bottom 1/4 of the sheet. Roll the sheet up away from you into a cylinder. Repeat with all 8 rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle rolls into baking dish and moisten tops by spooning a bit of the pan liquid over them. Cover dish tightly with foil and transfer to oven. Bake fo 20 minutes, remove foil, and continue baking until tops of cannelloni are browned and crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place immediately, placing two cannelloni on each plate and surrounding them with butter beans and escarole. Sprinkle with parsley and drizzle with additional extra-virgin olive oil. Serve.</p>"}]}