{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131002-rum-raisin-ice-cream.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["boozy dessert", "ice cream", "raisin", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rum Raisin Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/10/home-made-rum-raisin-ice-cream.html", "description": "Raisins are soaked in dark rum for up to 2 days and are churned into a base that seems fairly bland, with faint accents of brown sugar and cinnamon. After setting up for a full 24 hours, though, the rum flavor leaches into the ice cream itself and the bite of pure rum in the raisins mellows out considerably.", "totalTime": "3 days", "recipeYield": "makes about 3 pints ice cream", "recipeCategory": ["Ice Cream and Frozen Treats", "Very Small Anna"], "recipeIngredient": ["1 cup raisins (dark or golden)", "1/2 cup dark rum", "2 cups milk", "2 cups cream", "1/2 cup granulated sugar", "1/4 cup dark brown sugar", "1/4 teaspoon cinnamon", "Pinch salt", "4 egg yolks", "1/2 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the raisins in a container with a tight-fitting lid and add rum. Cover and shake to evenly coat raisins in rum, let sit at room temperature at least overnight and up to 2 days. Drain excess rum from raisins, reserving 2 tablespoons. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk, cream, sugars, cinnamon, and salt in medium saucepan and place over medium heat, stirring occasionally, until mixture is steaming and sugars are dissolved. Meanwhile, whisk egg yolks in medium mixing bowl. Gradually whisk hot liquid into yolks, then scrape back into pan and cook over medium heat, stirring constantly, until mixture is thick enough to coat the back of a spoon. Strain and chill thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vanilla and reserved rum to base and process in ice cream machine according to manufacturer's instructions, adding raisins when almost fully churned. Remove to freezer-safe container and seal tightly. Freeze at least 24 hours before serving.</p>"}]}