{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130819-concord-grape-lemon-upside-down-cake.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["cake", "concord grape", "grape", "lemon", "upside-down cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Concord Grape and Lemon Upside Down Cake", "link": "https://www.seriouseats.com/recipes/2013/09/concord-grape-lemon-upside-down-cake-recipe.html", "description": "Though Concord grapes are lovely with spices, I wanted to showcase their perfectly purple flavor with a fairly plain base, and I love the flavor and color combination of grape and lemon.", "totalTime": "45 minutes", "recipeYield": "Serves 8", "recipeCategory": ["Cakes", "Fruit Desserts", "Grapes", "Lemon", "Very Small Anna"], "recipeIngredient": ["<strong>For the Caramel</strong>:", "1/2 cup sugar", "2 teaspoons honey", "2 tablespoons butter", " ", "<strong>For the Cake</strong>:", "1 1/2 cups seedless Concord (Thomcord) Grapes (about 8 ounces)", "3/4 cup plus 2 tablespoons all purpose flour", "1/4 cup plus 2 tablespoons sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1/3 cup plain yogurt", "1/3 cup milk", "1/8 teaspoon vanilla extract", "2 tablespoons butter, melted and cooled", "2 teaspoons zest from 1 lemon, plus lemon flesh cut into supremes and diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caramel:</strong> Set rack in center of oven. Preheat oven to 375&deg;F. Combine sugar, honey and butter for caramel in small saucepan over medium heat. Once butter is completely melted, stir occasionally to emulsify. Cook until very light brown in color, about 3 minutes. Immediately pour into 9-inch pie or cake pan. Lift pan carefully by edges and gently swirl caramel to evenly coat entire bottom surface. Set aside to cool and harden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Once caramel is set, lightly brush inner sides of pan with soft butter. Add grapes to pan, adding or removing some to create a single but densely packed layer of grapes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, combine flour, sugar, baking powder, baking soda, and salt, whisk to combine and set aside. In a separate mixing bowl, whisk together yogurt, milk, and vanilla. Pour melted butter in one steady stream while whisking to emulsify. Stir in lemon zest, then fold in lemon pieces. Add wet mixture to dry and gently fold together until just combined. Pour into prepared pan and bake until a skewer or paring knife inserted in center comes out slightly moist but not covered in batter, 20 to 25 minutes, turning once half way through baking. Allow cake to cool for 3 to 5 minutes before running a paring knife around the edge and inverting onto a plate or serving platter. Allow to cool to almost room temperature before serving.</p>"}]}