{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/092013-267064-Serious-Eats-Sunday-Supper-Zucchini-PastitsioB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["bechamel", "beef", "greek", "Mediterranean", "pasta", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zucchini Pastitsio (Mediterranean Baked Beef and Pasta Casserole)", "link": "https://www.seriouseats.com/recipes/2013/09/sunday-supper-zucchini-pastitsio-recipe.html", "description": "Rich and satisfying, this riff on Vefa Alexiadou's pastitsio is the perfect way to usher in fall.", "totalTime": "About 2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Beef", "Mains", "Sunday Supper", "Zucchini"], "recipeIngredient": ["<strong>For the Zucchini:</strong>", "6 tablespoons olive oil, divided", "3 medium zucchinis, sliced into 1/4-inch-thick rounds", "Kosher salt and freshly ground black pepper", "&nbsp", "<strong>For the Meat Sauce:</strong>", "1 1/4 pounds ground beef", "3 cloves garlic, minced (about 1 tablespoon)", "1 small onion, grated (about 3/4 cup)", "1/2 cup dry red wine", "1 (28-ounce) can puréed tomatoes", "1 teaspoon sugar", "2 teaspoons balsamic vinegar", "2 pinches of nutmeg, divided", "2 bay leaves", "&nbsp", "<strong>For the Bechamel:</strong>", "1 cup whole milk", "2 tablespoons unsalted butter", "2 tablespoons all-purpose flour", "2 tablespoons heavy cream", "1/2 teaspoon lemon zest", "1 cup grated Romano or Parmesan cheese", "2 eggs, lightly beaten", " ", "<strong>For Assembly:</strong>", "3/4 pound rigatoni or macaroni, cooked al dente and kept warm", "2 1/4 cups grated Kefalograviera or Gruyère", "Non-stick baking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Zucchini:</strong> Adjust oven rack to upper position and preheat broiler to high. Using a large baking sheet, toss zucchini with 3 tablespoons of oil. Season with salt and pepper and place in a single layer on the baking sheet. Transfer zucchini to the oven to brown until golden, flipping halfway through, about 8 minutes total. Remove from oven and set aside. Adjust oven rack to center position and reduce oven to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meat Sauce:</strong> Heat 2 tablespoons oil in a stockpot over medium heat. Add ground beef and garlic and cook, breaking up into little bits, until browned, about 8 minutes total. Add onion and cook until softened, 2 to 3 minutes longer. Add wine, bring to a boil and simmer for 1 minute. Add the tomatoes, sugar, vinegar, a pinch of nutmeg, and bay leaves. Season lightly with salt and pepper and stir to combine. Return to a boil; then, reduce heat and simmer, covered, for 20 minutes, stirring occasionally. Discard bay leaves, season to taste with salt and pepper, and set sauce aside until you’re ready to assemble the casserole.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bechamel:</strong> Heat milk in a small saucepan over medium heat, stirring to prevent scorching, until hot. Melt the butter in another small, non-stick pan over medium-high heat. Add the flour and quickly whisk to combine. Whisking constantly, add the flour mixture to the hot milk in stages, taking care to eliminate lumps to create a smooth sauce. Add heavy cream and lemon zest. Season with salt, pepper and remaining pinch of nutmeg. While the sauce is still hot, quickly whisk in the Romano and eggs. Heat gently while whisking constantly until thickened if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Combine warm, cooked pasta with Kefalograviera or Gruyère and remaining 1 tablespoon of oil. Spray a 9-  by 13-inch baking pan with cooking spray. Layer with half of zucchini. Top with half of the noodle mixture, followed by half of the white sauce and meat sauce. Repeat layers, ending with white sauce. Transfer to the oven to bake until golden and bubbly, 35 to 40 minutes. Serve immediately. </p>"}]}