{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/201311bread-baking-parker-house-rolls.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "roll", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Parker House Rolls", "link": "https://www.seriouseats.com/recipes/2013/11/bread-baking-parker-house-rolls.html", "description": "Soft, lightly sweet, and golden brown, these classic Parker House rolls are the perfect side for a home cooked meal.", "totalTime": "2 hours, 25 minutes", "recipeYield": "Makes 12 rolls", "recipeCategory": ["Bread Baking", "Christmas", "Rolls", "Thanksgiving"], "recipeIngredient": ["1 1/4 cups (about 10 ounces) warm milk", "2 1/4 teaspoons instant yeast", "11 1/4 ounces (about 2 1/4 cups) bread flour", "2 tablespoons sugar", "1/2 cup instant mashed potato flakes", "4 tablespoons (1/2 stick) unsalted butter at room temperature", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the milk, yeast, bread flour, sugar, and potato flakes in the bowl of your stand mixer. Knead until the dough is smooth and elastic. The dough will be quite stiff at this point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter and salt and continue kneading until the butter is completely incorporated. Cover the bowl with plastic wrap and set aside until the dough has doubled in size, about an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper and preheat the oven to 350°F. Lightly dust your work surface with flour. Turn out the dough, pat it down to flatten it. Fold the left side towards the middle, then the top, then the right side, and the bottom to form a rough square.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a rolling pin, roll the dough to about 9 by 12 inches. Using a pizza cutter or sharp knife, cut the dough into three 12-inch strips, then cut each strip into 4 equal pieces, so you have 12 squares.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a chopstick, the handle of a wooden spoon, or a similar object, press a line onto each square going straight across (not diagonally) so it's not quite across the center of the square. This will help keep the dough from unfolding when it bakes. Fold the dough over at the crease, with the larger portion folded over the smaller one, like a clam with an overbite.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the folded dough on the baking sheet, leaving space between them if you don't want them to touch, or placing them nearly touching if you prefer pull-apart buns. Cover the buns with plastic wrap and set aside until doubled in size, half the time it took for the first rise (about 30 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the buns have doubled in size, bake at 350°F until the buns are nicely browned, about 25 minutes. Remove the buns from the pan and let them cool on a rack. Serve the same day.</p>"}]}