{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130222-241677-king-ranch-chicken-casserole-edit.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "Tex-Mex", "keywords": ["casseroles", "chicken", "chicken dinners", "king ranch", "poultry", "tex-mex", "tortillas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Ultimate King Ranch Chicken Casserole", "link": "https://www.seriouseats.com/recipes/2013/02/ultimate-king-ranch-chicken-casserole-recipe.html", "description": "This gooey, cheesy Tex-Mex chicken lasagna is layered with soft corn tortillas and melty Monterey Jack cheese. Jalapeños, chili, cayenne, and Mexican hot sauce provide the kick.", "totalTime": "1 hour 30 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Chicken", "Chicken Dinners", "Mains", "Tex-Mex"], "recipeIngredient": ["1 1/2 pounds boneless, skinless, chicken breast (or thigh meat)", "3 to 4 cups homemade or store-bought low sodium chicken broth", "1 1/2 teaspoons chili powder", "1 teaspoon ground cumin", "1/4 teaspoon ground cayenne pepper", "2 to 3 teaspoons hot chili sauce (see note)", "1 teaspoon grated zest and 1 teaspoon fresh juice from one lime", "Kosher salt and freshly ground black pepper", "3 tablespoons unsalted butter, cut into cubes ", "2 small onions, finely chopped (about 1 1/4 cups)", "2 red, orange, or yellow bell peppers, finely chopped (about 2 1/2 cups)", "2 jalapeños, finely chopped", "3 medium cloves garlic, minced (about 1 tablespoon)", "2 tablespoons all-purpose flour", "1 (14-ounce) can diced tomatoes, drained, juice reserved", "3/4 cup light sour cream", "1 cup fresh cilantro leaves, chopped, divided", "8 to 12 corn tortillas (see note)", "10 ounces Monterey Jack or Colby cheese, shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375&degF. Grease 13- by 9-inch baking dish. Halve chicken breasts on the bias so that the pieces have approximately the same thickness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium saucepan over medium heat, bring 3 cups chicken broth to a simmer. Add chicken, adding more broth if necessary so that chicken is just covered with liquid. Simmer gently until chicken is just cooked through, 5 to 8 minutes. Transfer chicken to plate, strain and reserve 1 1/2 cups broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cool enough to handle, tear into small bite size shreds. Place in bowl and add chili powder, cumin, cayenne, chili sauce, lime zest, lime juice, 1/4 cup reserved chicken broth, and 1/2 teaspoon salt. Toss until well combined and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large skillet, or dutch oven, heat butter over medium heat to melt. Add onions, peppers, jalapeños, and 1/2 teaspoon salt. Cook, stirring, until vegetables have softened and are beginning to turn golden, 10 to 15 minutes. Add garlic and cook until fragrant, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle flour over vegetables and cook, stirring, for one minute. Stir in drained tomatoes and then whisk in remaining 1 1/4 cups chicken broth, scraping up any browned bits at the bottom of the pan. Cook until mixture comes to boil and is thickened, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and stir in sour cream, chicken, and 1/2 cup cilantro leaves. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour reserved tomato juice (up to 1/2 cup) into bottom of pan, spreading to coat evenly. Place 3 to 4 tortillas in single layer in pan. Spread 1/3 chicken mixture over tortillas. Sprinkle 1/3 cheese over top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer another 3 to 4 tortillas over cheese. Spread 1/2 chicken mixture and 1/2 cheese over top. Top with tortillas, remaining chicken mixture, and remaining cheese. Bake until casserole is thoroughly heated through, bubbling, and golden, about 30 minutes. Let cool 10 minutes before sprinkling with remaining cilantro and serving.</p>"}]}