{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/04132013-bakethebook-dome.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "coconut", "Cookies", "La Boulange: Cafe Cooking at Home", "meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Le Dome", "link": "https://www.seriouseats.com/recipes/2013/04/le-dome-boulange-recipe.html", "description": "The yin and yang of chocolate and vanilla are united in several mediums under Le Dome. <em><strong>La Boulange: Cafe Cooking at Home</strong></em> combines chocolate and vanilla creme, chocolate shavings, meringue cookies and whipped cream; an assortment of textures making a delicious dessert.", "totalTime": "1 hour", "recipeYield": "makes 12 to 15 domes", "recipeCategory": ["Bake the Book", "Chocolate", "Coconut", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Meringue</strong>", "4 egg whites", "1 cup sugar", "1/2 cup hazelnut meal", "Two 3-ounce bars white chocolate for shaving", "Two 3-ounce bars dark chocolate for shaving", " ", "<strong>For the Chantilly</strong>", "1 cup heavy cream", "1 tablespoon sugar", " ", "<strong>For the Vanilla Creme</strong>", "1/2 cup Pastry Cream", "2 teaspoons vanilla extract", "seeds from 1/2 vanilla bean", " ", "<strong>For the Chocolate Creme</strong>", "1/2 cup Pastry Cream", "1/2 cup bittersweet chocolate pieces for melting", " ", "<strong>For the Pastry Cream</strong>", "2 cups milk", "1/4 cup white sugar", "2 egg yolks", "1 egg", "1/4 cup cornstarch", "1/3 cup white sugar", "2 tablespoons butter", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather your ingredients. Preheat the oven to 200°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the meringue, whip the egg whites on high speed with 1/2 cup of the sugar until soft peaks form. Add another 1/3 cup of the sugar and whip until stiff peaks form. Beat in the remaining 1/3 cup of sugar. Fold in the hazelnut meal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry bag (or storage bag with the corners cut off) pipe twelve to fifteen flat meringues on one baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a second baking sheet, pipe twelve to fifteen domed meringues. Bake for 1 hour and 30 minutes. Tap a meringue to see if it's dry and remove immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the meringues are baking, with a peeler, shave 3/4 cup each from the white and dark chocolate bars and refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the chantilly (whipped cream), combine the heavy cream and sugar in a medium bowl and beat with an electric mixer until stiff peaks form. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pastry cream: In a heavy saucepan, stir together the milk and 1/4 cup of sugar. Bring to a boil over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the egg yolks and egg. Stir together the remaining sugar and cornstarch; then stir them into the egg until smooth. When the milk comes to a boil, drizzle it into the bowl in a thin stream while mixing so you do not cook the eggs. Return the mixture to the saucepan, and slowly bring to  a boil, stirring constantly so the eggs don't curdle or scorch at the bottom. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the mixture comes to a boil and thickens, remove from the heat. Stir in the butter and vanilla, mixing until the butter is completely blended in. Pour into a heat-proof container and place a piece of plastic wrap directly on the surface to prevent a skin from forming. Refrigerate until chilled before using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the vanilla creme, put the pastry cream in a large bowl and add the vanilla extract. Scrape the vanilla seeds into the bowl, and fold in half of the chantilly. For the chocolate creme, melt the chocolate over very low heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pastry cream in a large bowl and fold in the melted chocolate until combined. Fold in the remaining chantilly. Spread the vanilla creme over half the meringue bottom and top with domed meringue. Spread a layer of the creme over the domed tops. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat the process with the chocolate creme and the remaining meringue. Pour the dark and white chocolate shavings over the meringues. Serve right away or store in the refrigerator.</p>"}]}