{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/091913-266485-cook-the-book-plantain-crusted-mahimahi.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["ben sargent", "Cook the Book", "fish", "mains", "salsa", "seafood", "the catch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Plantain-Crusted Mahi mahi with Pineapple Salsa from 'The Catch'", "link": "https://www.seriouseats.com/recipes/2013/09/plantain-crusted-mahi-mahi-with-pineapple-salsa-from-the-catch.html", "description": "Mahi mahi takes well to tropical-themed preparations, such as this creative twist on fried fish from <strong><a href=\"http://brooklynchowdersurfer.com/\">Ben Sargent's</a></strong> new cookbook, <em><a href=\"http://www.amazon.com/The-Catch-Sea-Table-Recipes/dp/0307985520/?tag=serieats-20\">The Catch</a></em>. Instead of breading or battering the fish, Sargent coats the mahi mahi fillets with a thin layer of crushed plantain chips. The chips make for an ultra-crisp coating on the fish, and add needed sweet richness to the lean fish. A big spoonful of pineapple and tomatillo salsa is a perfect accompaniment, adding bright freshness to the fried fillet.", "totalTime": "35 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Fish", "Mains"], "recipeIngredient": ["1 small garlic clove, minced", "Salt", "3 tablespoons olive oil", "1/2 medium red onion, finely diced and rinsed with cold water, drained", "Finely grated zest of 1 lime", "1/4 cup fresh lime juice", "2 cups 1/2-inch diced pineapple", "2 tomatillos, husked, washed and dried, and cut into eighths", "1 large plum tomato, cut into 1/2-inch dice", "1 small red bell pepper, cored, seeded, and cut into 1/4-inch dice", "1 small green bell pepper, cored, seeded, and cut into 1/4-inch dice", "1 serrano or jalapeño, minced", "6 (6-ounce) mahi mahi fillets, skinned", "2 eggs, beaten", "1 cup plantain chips, finely crushed with a rolling pin", "Vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the garlic with a pinch of salt and 1 tablespoon of the olive oil and let stand for 5 minutes. Add the onion, lime zest, and the remaining 2 tablespoons of olive oil. Let stand for 5 minutes. Add the lime juice, pineapple, tomatillos, tomato, red and green bell peppers, and the serrano and mix well. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the mahi mahi with salt. Put the eggs and plantain chips in separate shallow bowls. Dip the fish in the egg, letting excess drip off. Then dredge the fish in the chips to coat well.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In 2 large skillets, heat 1/4 inch of vegetable oil until shimmering. Cook the fish in the skillets, leaving some room between each piece for even cooking. Cook over medium-high heat for 1 minute. Reduce the heat to medium and cook until browned and crisp, about 3 minutes. Turn the fish and cook about 4 minutes or longer, until the fish flakes and the other side is crisp. Adjust the heat as needed if the crust starts to brown too quickly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the fish on plates and pass the pineapple salsa at the table.</p>"}]}