{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/080813-261668-cook-the-book-stuffed-mirliton.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "creole", "lolis eric elie", "seafood", "shellfish", "shrimp", "squash", "treme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stuffed Mirliton from 'Treme'", "link": "https://www.seriouseats.com/recipes/2013/08/stuffed-mirliton-from-treme-cookbook.html", "description": "Before opening up the new <em><a href=\"http://www.amazon.com/books/dp/1452109699/?tag=serieats-20\">Treme</a></em> cookbook, I couldn't pick out a mirliton if it was thrown in my face. But the squash, originally native to the region, appears so frequently in <em>Treme</em>, I now consider myself a relative expert. I had, as it turns out, known the squash by its other name, <strong>chayote</strong>, and it appears on Latin American menus just as frequently as the traditional Louisiana ones.", "totalTime": "3 1/2 hours", "recipeYield": "serves 8 to 16", "recipeCategory": ["Cook the Book", "Mains", "Shrimp", "Sides", "Squash"], "recipeIngredient": ["<strong>Basic Creole Seasoning</strong>", "1 1/2 tablespoons table salt ", "1/2 tablespoon kosher salt ", "1 1/2 tablespoons ground cayenne ", "2 tablespoons coarsely ground black pepper ", "1 tablespoon ground white pepper ", "2 1/2 tablespoons sweet paprika ", "2 tablespoons granulated garlic ", "2 tablespoons granulated onion ", "1 tablespoon dried thyme ", "1 teaspoon dried oregano ", "1 teaspoon dried basil ", "1 teaspoon celery seed", "&nbsp", "8 medium mirlitons (chayotes) (about 4 1/2 pounds total weight)", " ", "<strong>Stuffing</strong>", "3/4 pound medium shrimp, peeled and deveined", "1 teaspoon Basic Creole Seasoning Blend ", "1/2 teaspoon cayenne pepper", "1/2 cup (1 stick) unsalted butter, plus about 5 tablespoons", "1 yellow onion, chopped", "2 celery stalks with leaves, finely diced", "1/4 large green bell pepper, seeded and chopped", "1/4 cup minced fresh flat-leaf parsley", "3 tablespoons finely chopped green onions, white and tender green parts ", "2 1/2 tablespoons finely chopped garlic", "1/2 cup very fine dried bread crumbs, plus about 5 tablespoons ", "1 teaspoon salt ", "1/2 teaspoon freshly ground pepper", "1 large egg, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the creole seasoning:</strong> Combine all the ingredients for the seasoning in a blender or food processor and process until thoroughly mixed. Use immediately, or store in an airtight container for up to 4 weeks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the mirlitons:</strong> Put the mirlitons in a 3-gallon pot, or two large stockpots, and cover with water. Bring to a boil over high heat. Cover the pot(s) and continue boiling, just until the mirlitons are fork tender, 45 minutes to 1 hour. Remove from the heat and, using a slotted spoon, immediately transfer the mirlitons to a colander to drain and cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cool enough to handle, place the mirlitons on a cutting board or other flat surface. Cut them in half lengthwise. With a paring knife, shallowly trim away any spiny or blemished spots from the skin, and tough pulp from the end nearest to the seed. Remove and discard the seed and use a small spoon to carefully remove the pulp from the inside of each half, leaving a 1/4- to 1/2-inch-thick shell. Drain the mirliton pulp in a colander, lightly squeezing it to release excess moisture, then chop the pulp. Set aside the pulp and shells. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the stuffing:</strong> Season the shrimp with the Creole seasoning and cayenne, mixing well. Set aside. In a heavy 5-quart saucepan or large Dutch oven over low heat, melt the 1/2 cup of butter. Add the onions and cook until they start to soften, about 5 minutes, stirring occasionally. Stir in the celery, bell pepper, parsley, green onions, and garlic, and cook and stir for 2 minutes. Add the reserved mirliton pulp and cook for 6 minutes. Put 1/2 cup of the bread crumbs into a small bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the mirliton pulp mixture has cooked for 6 minutes, add 2 tablespoons of the reserved bread crumbs, mixing thoroughly, then continue adding 2 tablespoons at a time until you have added all of them, stirring thoroughly between additions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the mixture over low heat, until it is noticeably dryer but still moist, about 3 minutes, stirring as needed. Next, add the seasoned shrimp, salt, and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking until the shrimp turn pink, about 1 minute more, stirring almost constantly. Remove from the heat and stir in the egg, blending well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mound the stuffing in the 16 mirliton shells, using it all. Place the stuffed shells in a baking pan, such as a 12-by-17-inch baking pan, that will hold the shells in a single layer touching each other lightly to help support their shapes as they cook. Sprinkle about 1 teaspoon more bread crumbs evenly over the top of each stuffed shell and center a scant 1 teaspoon butter on the top of each. Cover tightly with aluminum foil and bake in the hot oven for 10 minutes. Remove the foil and continue baking until the tops are browned, about 1 hour more. Serve at once. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> To make ahead, prepare through the point of stuffing up to 1 day in advance. Cover the stuffed mirlitons tightly and refrigerate. Bake as directed when ready to serve.</p>"}]}