{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131109-272807-DetoxTurkeySoup.JPG", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["soup", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Detox Turkey Soup", "link": "https://www.seriouseats.com/recipes/2013/11/make-ahead-detox-turkey-soup-recipe.html", "description": "After hors d'oeuvres, appetizers, first, seconds, thirds, probably a midnight snack, and leftover pie for breakfast, chances are you may be craving some clean eating after Thanksgiving. This soup creates a lot of flavor in a short period of time, using ingredients most likely already purchased for the holiday.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Soups and Stews", "Turkey"], "recipeIngredient": ["2 tablespoons olive oil", "1 clove garlic, smashed", "2 stalks celery, sliced 1/4-inch thick (about 1 cup sliced)", "2 medium leeks, whites and light greens sliced into 1/2-inch half-moons (about 1 1/2 cups sliced)", "1 bunch rainbow chard, stems sliced 1/4-inch thick, leaves torn into 3-inch pieces (about 5 cups torn leaves)", "Kosher salt", "4 cups homemade or store-bought low sodium chicken or turkey stock", "1/2 cup picked dill fronds", "1 small or 1/2 large dried bay leaf ", "Freshly ground black pepper", "2 cups roughly chopped or shredded turkey meat", "3 tablespoons fresh lemon juice from about 2 lemons", "1/4 cup finely chopped fresh flat-leaf parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in wide soup pot over medium-low heat. Add garlic and saute, stirring, until just golden on both sides, 1 to 2 minutes. Remove clove and discard. Add celery, leeks and chard stems. Sprinkle with 1/4 teaspoon salt and sweat, stirring occasionally, until softened but still with bite, 10 to 12 minutes, making sure not to achieve any color. Pour in stock and 1 cup water; bring soup to boil, then reduce to simmer. Add dill fronds and bay leaf and simmer over medium-high heat to infuse flavor in broth, about 10 minutes. Reduce heat to medium-low and add chard leaves in batches, cooking gently only until just wilted. Stir in 1/4 teaspoon salt and 1/4 teaspoon pepper. Let soup cool, and then refrigerate until ready to eat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before reheating soup on the stovetop, stir in the turkey meat. Reheat over medium heat, covered, until warmed through. Uncover and stir in parsley and lemon juice just before serving. Serve with additional lemon wedges if desired.  </p>"}]}