{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131128-preserved-fruitbutter-toast.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["apple", "apple butter", "fruit butter", "preserve"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "All-Purpose Apple Butter", "link": "https://www.seriouseats.com/recipes/2013/12/all-purpose-apple-butter.html", "description": "A basic fruit butter recipe that will work with apples, stone fruits, or pears.", "totalTime": "8 hours", "recipeYield": "Makes 4 pint jars or 8 half pint jars", "recipeCategory": ["Apple", "Condiments and Sauces", "Preserved"], "recipeIngredient": ["10 pounds assorted apples", "1 cup water", "1 tablespoon ground cinnamon", "1 teaspoon ground allspice", "1/2 teaspoon ground clove", "1 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare boiling water canner and sterilize jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids and rings to sit in hot water until you need them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash, peel, and core apples and chop roughly. Place apples and water in a heavy-bottomed dutch oven. Cover and bring to a boil. Once fruit comes to a boil, decrease heat and simmer, covered, stirring occasionally until fruit is very soft and falling apart, about a half an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When fruit has almost completely broken down and looks like applesauce, remove from heat. Blend with an immersion blender until the mixture is velvety smooth, like baby food. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pan back on stove and cook apple puree, uncovered except for splatter shield, on medium-low heat for 5-6 hours until substantially reduced. Stir every 20-30 minutes. Gradually, the color will go from golden to tawny to caramel and eventually, to toasty brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once mixture has reached a caramel color and a glossy texture, stir in sugar and spices. Cook together over low heat for 10-20 minutes to allow flavors to combine. Remove from heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle butter into prepared jars, leaving a quarter inch of head space. Gently tap gars on the counter to remove any trapped air. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight. </p>"}]}