{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131018-269443-cook-the-book-chard-collard-polenta-tamale-packages.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chard", "collard", "Cook the Book", "Mollie Katzen", "polenta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chard- or Collard-Wrapped Polenta-Chile Tamale Packages From 'Heart of the Plate'", "link": "https://www.seriouseats.com/recipes/2013/10/chard-collard-wrapped-polenta-chile-tamale-packages-from-mollie-katzen.html", "description": "Polenta and greens take a new form in <strong><a href=\"http://www.molliekatzen.com/\" target=\"_blank\">Mollie Katzen</a></strong>'s tamale-like polenta packages. These small bites from her new cookbook, <em><a href=\"http://www.amazon.com/The-Heart-Plate-Vegetarian-Generation/dp/0547571593/?tag=serieats-20\" target=\"_blank\">The Heart of the Plate</a></em>, are surprisingly simple: make a pot of thick polenta laced with Anaheim chiles and sautéed onions, blanch a dozen chard or collard leaves, scoop, roll, and sauté.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Gluten-Free", "Leafy Greens", "Mains", "Other Grains", "Sides", "Vegetarian"], "recipeIngredient": ["2–3 tablespoons olive oil", "1 cup finely minced onion", "1/4 teaspoon ground cumin", "1 medium Anaheim or poblano chili, seeded if desired, finely minced (heaping 1/2 cup)", "1/2 teaspoon salt", "Black pepper", "1 cup polenta (coarse cornmeal)", "1/4 (packed) cup grated Jack cheese (2 ounces)", "1 dozen large, perfect chard or collard green leaves (8–10 inches long)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put on a large pot of water to boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place a medium saucepan over medium heat for about a minute, then add 1 tablespoon of the olive oil and swirl to coat the pan. Toss in the onion and cumin and cook, stirring, for about 5 minutes, until the onion softens. Add the chili, salt, and some pepper and sauté for another 5 minutes, or until the chili softens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add another tablespoon of oil, if desired, and sprinkle in the polenta, stirring to coat. Reduce the heat to medium-low and sauté the mixture for 5 minutes or so, or until the grains become lightly toasty.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the water boils, add 3 cups, 1 cup at a time, to the polenta mixture, stirring it in, then covering the saucepan between additions so the polenta absorbs it (as if you were making risotto, but with less stirring). This should take about 10 minutes. (Leave the remaining water simmering in the pot on the stove.) When the 3 cups are incorporated and the mixture is tender, 6 to 8 minutes, remove it from the heat and immediately stir in the cheese. Set aside, covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick up each chard or collard leaf, one at a time, hold it by the stem, and immerse the entire leaf in the boiling water, down to the base, keeping it there until the spine becomes supple enough to bend without breaking, 20 to 30 seconds, depending on the size. Shake off any excess water and pile the blanched leaves on a plate as you go. Pat them dry with towels and, using scissors, trim off the stems at the base of the leaves and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the packages, place about 1/4 cup of the filling (slightly more for larger leaves; less for smaller) near the bottom of each leaf and roll it up tightly, folding in the sides. Place all the filled leaves seam side down on a plate. If you have leftover filling, keep it handy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shortly before serving, place a large (10- to 12-inch) skillet over medium heat for about a minute, then add about 1/2 tablespoon olive oil and swirl to coat the pan. Add the packages and sauté on both sides for a total of 5 to 8 minutes, or until heated through. (You can also sauté any leftover filling or heat it in a microwave and serve it underneath or sprinkled on top.) Serve the packages hot or warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Optional enhancements:</strong><br />\r\nAdd an ear’s worth of freshly shucked sweet corn to the filling <br />\r\nGarnish with sliced avocado and lime wedges <br />\r\n</p>"}]}