{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131017-bakethebook-custardtart.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["custard", "Nose to Tail", "tart", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fergus Henderson's Custard Tart", "link": "https://www.seriouseats.com/recipes/2013/10/custard-tart-fergus-henderson-recipe.html", "description": "With a wobbly center comprised of little more than egg yolks and cream, this sweet custard tart from <em><strong><a href=\"http://www.amazon.com/?tag=serieats-20\" target=\"_blank\">Nose to Tail</a></strong></em> is rich and simple, dusted with nutmeg and speckled with vanilla bean.", "totalTime": "several hours, including baking and cooling", "recipeYield": "serves 10 to 12", "recipeCategory": ["Bake the Book", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1/2 quantity of Treacle Tart pastry (ingredients follow)", "10 egg yolks", "1 vanilla pod", "3 cups double cream", "1 cup caster sugar", "1 nutmeg", " ", "<strong>Treacle Tart Pastry</strong>", "11 ounces unsalted butter", "1 cup 2 tablespoons caster sugar", "1 large egg", "5 large egg yolks", "Scant 1/4 cup strong white flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First make the pastry. Cream the butter and sugar together until white and fluffy. Lightly beat together the egg and egg yolks, then add them to the mixture a little at a time in order to prevent curdling. Sift in the flour and mix until just incorporated. The pastry will be very soft, so wrap it in plastic wrap and leave it in the fridge overnight. Separate into halves before wrapping, as this recipe only requires a half quantity of pastry.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the pastry out of the fridge and let it soften at room temperature for about 1-2 hours. Roll out the pastry on a lightly floured work surface about 1 inch thick and use to line a 12-inch loose-bottomed tart tin. Chill for 1-2 hours. Cover the pastry case with plastic wrap, fill with baking beans and lightly fold the cling film over the top of the beans. Bake in an oven preheated to 375F until the pastry is golden brown around the edges. Remove the plastic wrap and beans and return the pastry case to the oven until golden brown. Lightly beat one of the egg yolks. As soon as the pastry case comes out of the oven, brush all over the inside with the beaten egg to seal any little holes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the filling, slit the vanilla pod lengthways and scrape out the seeds. Put the seeds and pod in a saucepan with the double cream and bring slowly to the boil to infuse the cream with the vanilla. In a large bowl, mix the 9 remaining egg yolks and the sugar together just for a minute with a whisk. Then pour the boiling cream onto the mixture, whisking constantly to prevent curdling. Pass through a fine sieve. If there is lots of froth on top, just spoon it off and discard. Pour the custard mix into the baked pastry case, then grate some nutmeg on top (do not use ready-ground nutmeg). Place carefully in the oven without spilling any of the filling down the sides of the pastry case; if you do, you will end up with soggy pastry, which is a no-no for custard tart. Bake at 250F for about 1 hour, until there is only a small wobble in the center of the tart. Take out of the oven and place on a cooling rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or cold and, when in season, with some fresh raspberries. <br />\r\n</p>"}]}