{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/236_Bittersweet%20Decadence%20Cookies-001.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "chocolate cookie", "cookie", "Seriously Bittersweet"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Bittersweet Decadence Cookies", "link": "https://www.seriouseats.com/recipes/2013/12/bittersweet-decadence-cookies.html", "description": "A batter of mostly melted chocolate is gently warmed in simmering water. Chopped nuts and even more chocolate are stirred in. <em><strong>Seriously Bitter Sweet</a></strong></em> makes and bakes them with the centers still gooey. Seriously indulgent, with a satisfying chew.", "totalTime": "1 hour", "recipeYield": "makes 36 cookies", "recipeCategory": ["Bake the Book", "Chocolate", "Cookies"], "recipeIngredient": ["1/4 cup (30 grams) all-purpose flour", "1/4 teaspoon baking powder", "1/8 teaspoon salt", "8 ounces (225 grams) 54% to 60% chocolate, coarsely chopped (see Chocolate Notes)", "2 tablespoons (30 grams) unsalted butter", "2 large eggs", "1/2 cup (100 grams) sugar", "1 teaspoon pure vanilla extract", "2 cups (200 grams) walnuts or pecans, broken or chopped into large pieces", "6 ounces (170 grams) 54% to 72% chocolate, chopped into chunks, or store-bought chocolate chunks (see Chocolate Notes) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the racks in the upper and lower thirds of the oven and preheat the oven to 350°F. Line two cookie sheets (see Note) with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, mix the flour, baking powder, and salt together thoroughly; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the 8 ounces (225 grams) of chocolate and the butter in a large stainless steel bowl in a wide skillet of barely simmering water and stir frequently just until melted and smooth. Remove the chocolate from the skillet and set it aside. Leave the heat on under the skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heatproof bowl, whisk the eggs, sugar, and vanilla together thoroughly. Set the bowl in the skillet and stir until the mixture is lukewarm to the touch. Stir the egg mixture into the warm (not hot) chocolate. Stir in the flour mixture, then the nuts and chocolate chunks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop slightly rounded tablespoons of batter 1 1/2 inches apart onto the lined cookie sheets. Bake until the surface of the cookies looks dry and set but the center is still gooey, 12 to 14 minutes. Slide the cookies, still on the parchment, onto racks, or set the pans on the racks. Let cool completely. Store in a tightly sealed container. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> I am fussy about cookie sheets. These cookies will have the best flavor and texture if they are baked on sheets lined with parchment paper, which insulates them just enough but still allows the cookies to be a little crusty on the outside and soft within. Cushioned pans and silicone liners make the texture of the cookies too uniform for my taste. Pans with dark surfaces (even if they are nonstick) tend to scorch rich chocolate cookie bottoms before the centers are cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Notes</strong> <br />\r\nTo use higher-percentage chocolate to make cookies that are increasingly bittersweet, without sacrificing the texture or the pretty gloss on the surface of the cookies, adjust the recipe as follows.</p>\r\n\r\n<p>To use 61% to 64% chocolate: <br />\r\nUse 7 ounces (200 grams) chocolate. Increase the sugar to 1/2 cup plus 1 tablespoon (110 grams).</p>\r\n\r\n<p>To use 66% chocolate:<br />\r\nUse 6 1/2 ounces (185 grams) chocolate. Increase the butter to 3 tablespoons (45 grams) and the sugar to 1/2 cup plus 2 tablespoons (125 grams).</p>\r\n\r\n<p>To use 70% to 72% chocolate: <br />\r\nUse 5 1/2 ounces (155 grams) chocolate. Increase the butter to 3 tablespoons (45 grams) and the sugar to 3/4 cup (150 grams).</p>\r\n\r\n<p>For the chunks, use any chocolate you like, the same as or different from the batter. No alterations are necessary.</p>\r\n\r\n<p><br />\r\n</p>"}]}