{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130629-256531-sunday-brunch-beet-potato-hash.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["beets", "brunch", "hash", "potatoes", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Beet and Potato Hash", "link": "https://www.seriouseats.com/recipes/2013/06/beet-and-potato-hash-recipe.html", "description": "Small, sweet beets are plentiful in CSAs and farmers markets this time of year And while roasted beets are delicious, sometimes you just don't have time to heat up your oven. This hash is quick to prepare and makes a colorful, earthy brunch.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Potato", "Vegetarian"], "recipeIngredient": ["1 pound russet potatoes, peeled and grated on the large holes of a box grater", "3/4 pounds beets, peeled and grated on the large holes of a box grater", "Kosher salt and cracked black pepper", "4 tablespoons olive oil", "1/4 cup Greek yogurt or sour cream", "Small bunch chives, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 200°F. Place grated potato in the center of a clean towel. Twist towel over sink to wring out excess moisture from potatoes. Transfer to a large bowl. Add beets and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of olive oil in a 10- inch non-stick skillet over medium high heat until shimmering, add 1/4 of the potato and beet mixture to the skillet. Using a rubber spatula, press into the bottom of the pan and cook until edges begin to look brown, about 5 minutes. Carefully slide hash onto a plate then place another plate on top. Flip plates over, then slide hash back into pan and continue to cook until completely crisp, about 6 minutes longer. Transfer to a large plate and keep warm in a oven. Repeat with remaining fat and potato and beet mixture. Serve hash topped with Greek yogurt or sour cream and chives.</p>"}]}