{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130210-240356-Escarole-Salad.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["butternut squash", "excarole", "lunch box", "ricotta", "salad", "squash", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Grilled Escarole Salad with Citrus, Squash and Ricotta", "link": "https://www.seriouseats.com/recipes/2013/02/grilled-escarole-salad-citrus-squash-ricotta-recipe.html", "description": "Finally: a salad that holds its own with no need for dressing. Oranges and grilled lemon brighten up grilled escarole, adding enough acidity and flavor that you don't need to pour on dressing to add taste. A one-container salad that won't contain any sad, soggy lettuce.", "totalTime": "35 minutes", "recipeYield": "serves 2", "recipeCategory": ["Lunch Box", "Mains", "Salads", "Squash", "Vegetarian"], "recipeIngredient": ["One 1- to 1 1/2-pound butternut squash, peeled, halved, seeds scooped, cut into 1/4-inch-thick wedges", "3 tablespoons extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "1 tablespoon canola or vegetable oil", "1 pound escarole, bottoms trimmed, separated into stalks", "1 lemon, preferably Meyer lemon, halved", "1 orange, peeled, quartered, and cut into thin slices", "3 tablespoons fresh ricotta cheese", "2 tablespoons pine nuts, lightly toasted in dry pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle position and preheat oven to 450°F. Toss squash with 2 tablespoons olive oil, 1/2 teaspoon salt and 1/4 teaspoon pepper. Lay squash in single layers on parchment or foil-lined baking sheets; roast until tender, about 15 minutes, rotating baking sheets halfway through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss escarole with remaining olive oil and sprinkle with salt and pepper. Preheat grill or grill pan over high heat. Brush canola oil onto grill and heat until smoking. Grill escarole until wilted and charred in places, about 8 minutes, flipping halfway through. Let drain on paper towels and cool slightly. Meanwhile, grill lemon halves cut-side down until charred and caramelized, 3 to 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss together escarole, squash, oranges and ricotta. Sprinkle top with pine nuts. Serve with grilled lemon wedge to dress, or pack up in airtight container for later use, and squeeze over grilled lemon juice before eating. </p>"}]}