{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/062013-256054-cook-the-book-braised-chickpeas-couscous-harissa-yogurt-eggs.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chickpeas", "Cook the Book", "couscous", "flour too", "fried eggs", "harissa yogurt", "joanne chang"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Braised Chickpeas and Vegetables with Couscous, Harissa Yogurt, and Soft Eggs from 'Flour, Too'", "link": "https://www.seriouseats.com/recipes/2013/06/braised-chickpeas-vegetables-couscous-harissa-yogurt-soft-eggs-from-flour-too-recipe.html", "description": "Couscous is a wonderful pantry staple. It's the fastest pasta (or any starchy grain) I know how to cook, and its fluffy texture and mild flavor pair well with just about anything you throw at it. In <strong><a href=\"http://flourbakery.com/team/joanne-chang\">Joanne Chang's</a></strong> new cookbook <em><a href=\"http://www.amazon.com/Flour-Too-Indispensable-Recipes-Savories/dp/1452106142/?tag=serieats-20\">Flour, Too</a></em>, she steams the pasta with a rainbow of summer vegetables and a couple of cups of slowly braised chickpeas. Not content with this everyday flavor profile, Chang flavors the dish with North African flair.", "totalTime": "2 hours, plus overnight soak for chickpeas", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Fried Eggs", "Legumes", "Mains", "Other Grains", "Vegetarian"], "recipeIngredient": ["2/3 cup (120 grams) dried chickpeas, or one 15-ounce (430-gram) can chickpeas", "4 tablespoons (60 ml) vegetable oil", "8 ounces (225 grams) spinach, tough stems removed", "Kosher salt", "Freshly ground black pepper", "1 medium onion, cut into 1/2-inch (12-mm) pieces", "3 garlic cloves, smashed and minced", "1 medium carrot, peeled and cut into 1/2-inch (12-mm) pieces", "1 medium zucchini, trimmed, quartered lengthwise, and cut crosswise into 1/2-inch (12-mm) pieces", "1 medium yellow squash, trimmed, quartered lengthwise, and cut crosswise into 1/2-inch (12-mm) pieces", "1 medium red bell pepper, cut into 1-inch (2.5-cm) pieces", "1 teaspoon ground cumin", "1 1/2 teaspoons ground turmeric", "1 1/2 cups vegetable stock", "1 cup (180 grams) couscous", "3/4 cup (180 grams) plain full-fat Greek yogurt", "1/4 cup (60 grams) <em>harissa</em> paste", "1/2 cup (30 grams) chopped fresh cilantro", "1/2 cup (30 grams) chopped fresh mint", "6 large eggs", "1 lime, cut into 6 wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using dried chickpeas, place them in a bowl or other container, add 5 to 6 cups (1.2 to 1.4 L) water, cover, and refrigerate overnight. The next day, drain and rinse the chickpeas. In a medium saucepan, bring the chickpeas and about 6 cups (1.4 L) fresh water to a boil over high heat. Reduce the heat to medium-low and simmer for 1 to 1 1/2 hours, or until the chickpeas are tender. Remove from the heat, drain, and set aside. If using canned chickpeas, drain, rinse under cold running water, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the stockpot, heat 1 tablespoon of the vegetable oil over high heat until hot. Add the spinach, reduce the heat to medium-high, and cook, stirring frequently, for 2 to 3 minutes, or until the spinach wilts. Season with 1/4 teaspoon each salt and pepper, transfer to a small bowl, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot, heat 2 tablespoons vegetable oil over medium-high heat until hot. Add the onion and garlic and reduce the heat to medium. Cook, stirring frequently, for 3 to 4 minutes, or until the onion is translucent.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chickpeas, carrot, zucchini, yellow squash, bell pepper, cumin, and turmeric and cook over medium heat, stirring frequently, for about 5 minutes. Add the stock, raise the heat to high, and bring to a boil. Reduce the heat to low and add 1 3/4 teaspoon salt and 1/4 teaspoon pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the couscous and turn off the heat. Cover the pot and leave on the stove for 5 minutes. Remove the cover and fluff up the couscous with a fork. Replace the cover and let sit for another 5 minutes. Remove the cover and fluff up the couscous again. Taste the couscous. If too chewy, cover and let stand for another 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the couscous is steaming, chop the reserved spinach and drain off any excess liquid. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the yogurt, <em>harissa</em>, and 1/2 teaspoon salt until well blended. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the couscous is done, add the spinach, cilantro, and mint and stir to combine. Divide the couscous equally among six shallow bowls and set aside in a warm spot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat the remaining 1 tablespoon oil over medium heat. Working in batches if necessary to prevent crowding, carefully crack each egg directly into the pan, keeping the yolk intact. Season each egg with a pinch each of salt and pepper. Pour 1 to 2 tablespoons water into the pan, cover, and cook for 3 to 4 minutes, or until the tops of the egg whites are opaque and set and the yolks are still runny. Using a spatula, top each serving of couscous with an egg. Repeat with the remaining eggs if cooking in batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish each bowl with a generous spoonful of the yogurt and a lime wedge before serving, and pass the remaining yogurt at the table. The lime and the <em>harissa</em> yogurt are crucial condiments to the couscous, so make sure everyone uses both!</p>"}]}