{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/235552-20120109-british-bites-ham-split-pea-soup.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "ham", "pork", "soup", "split pea soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Ham and Split Pea Soup", "link": "https://www.seriouseats.com/recipes/2013/01/ham-and-split-pea-soup-recipe.html", "description": "A popular soup on both sides of the pond, ham and pea soup is filling but not so heavy that you feel weighed down after eating it. And soon after the holiday season, it's nice to have a hearty meal filled with legumes and just a bit of pork.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["British Bites", "Ham", "Mains", "Pork", "Soups and Stews"], "recipeIngredient": ["1 tablespoon butter ", "6 ounces ham steak (or thickly cut ham), cut into 1/2 inch pieces ", "1 medium leek, white and light green parts only, finely chopped (about 1/2 cup)", "1 small onion, finely chopped (about 3/4 cup)", "1 medium carrot, peeled and finely chopped  (about 3/4 cup)", "1 celery stalk, finely chopped (about 1/2 cup)", "2 bay leaves ", "6 sprigs thyme ", "2 small smoked ham hocks (about 3/4 pound total) ", "1 pound green split peas, rinsed and picked over", "2 quarts (8 cups) water or low-sodium store-bought or homemade chicken broth", "Pinch of red pepper flakes ", "Kosher salt and freshly ground black pepper ", "Lemon juice, to taste ", "Sour cream or plain yogurt for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a large saucepot or Dutch oven over medium high heat. Add chopped ham and cook, stirring occasionally, until ham begins to brown, about 4 minutes. Remove ham from pot with a slotted spoon, then return pot to heat and add leek and onion, scraping up browned bits from the bottom of the pot with a wooden spoon. Add carrot, celery, bay leaves, and thyme, and continue to stir until ingredients are well combined. Place ham hocks, pinch of red pepper flakes,and green split peas in the pot and cover with 8 cups of water (or broth, if using). Bring to a simmer, cover, and cook for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove hocks from the pot and allow to rest until cool enough to handle. Shred meat from bones. Add shredded meat and reserved ham back to the soup and season to taste with salt and pepper. Season with lemon juice to taste. Serve hot with sour cream or yogurt, as desired.</p>"}]}