{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130310-243950-sandwiched-chorizo-avocado-and-egg-cemitas-with-chipotle-mayonnaise.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "Mexican", "keywords": ["avocado", "cemitas", "chorizo", "fried egg", "Mexican", "sandwich", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chorizo, Avocado, and Egg Cemitas with Chipotle Mayonnaise", "link": "https://www.seriouseats.com/recipes/2013/03/chorizo-avocado-egg-cemitas-chipotle-mayonnaise-recipe.html", "description": "A messy, yet satisfying Mexican sandwich of chorizo sausage, chipotle mayonnaise, avocados, tomatoes, lettuce, and Oaxacan cheese all topped with a fried egg.", "totalTime": "15 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Avocado", "Fried Eggs", "Mexican", "Sandwiches", "Tomato"], "recipeIngredient": ["1/4 cup mayonnaise", "1 teaspoon fresh lime juice from 1 lime", "1 chipotle pepper in adobo sauce, chopped, plus 1 tablespoon adobo sauce", "12 ounces Mexican chorizo sausage", "2 eggs", "2 large cemita rolls, bolillo rolls, or Kaiser rolls", "2 ounces Oaxacan cheese, or mozzarella, torn into pieces", "1/2 cup shredded iceberg lettuce", "1 small tomato, sliced", "1 avocado, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the mayonnaise, lime juice, chipotle pepper, and adobo sauce in a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large, non-stick skillet over medium heat. Add the chorizo to the pan, breaking it up with a wooden spoon, and cook until the chorizo is heated through, 3 to 5 minutes. Scrape the chorizo out of the pan and transfer to a large platter and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to medium heat, then crack two eggs into the pan. Place a lid on the pan and cook the eggs until the whites are set, but the yolks are still runny, 3 to 4 minutes. There should be enough fat left from the chorizo to keep the eggs from sticking. Carefully transfer the eggs to another large platter and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the cemita rolls in half crosswise, then slather the chipotle mayo on each of the halves. Equally distribute the chorizo sausage among the two bottom halves of the bread. Layer the cheese, lettuce, tomato, and avocado on top of the chorizo. Place an egg on each bottom half, then top the sandwich with the remaining top halves. Serve immediately.</p>"}]}