{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130220-mushroom-spinach-sandwich.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["cinco de mayo", "Mexican", "quick", "sandwich", "spinach", "tortas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Mexican Mushroom and Spinach Sandwich (Vegan Torta)", "link": "https://www.seriouseats.com/recipes/2013/02/mexican-mushroom-and-spinach-sandwich-vegan-torta-recipe.html", "description": "A hearty sandwich packed with greens and mushrooms, refried beans, pickled red onions, and spicy pickled jalapeños.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dairy-Free", "Mains", "Mexican", "Sandwiches", "Spinach", "Vegan", "Vegetarian"], "recipeIngredient": ["2 medium poblano peppers", "2 tablespoons olive oil, plus more if toasting", "10 ounces white button or cremini mushrooms, thinly sliced", "Kosher salt and freshly ground black pepper", "2 medium cloves garlic, finely sliced", "8 ounces fresh spinach leaves", "1 cup <a href=\"http://www.seriouseats.com/recipes/2013/02/spicy-vegan-refried-beans.html\">homemade</a> or store-bought vegetarian refried beans", "2 tablespoons finely chopped chipotle pepper in adobo sauce", "2 teaspoons dark molasses", "4 hearty sandwich or hero rolls", "3 whole pickled jalapeño peppers, stems and seeds removed, cut into strips", "3/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/05/pickled-red-onions.html\">pickled red onions</a>", "Handful fresh cilantro leaves", "1 avocado, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place poblano peppers directly over flame of a gas burner and cook, turning occasionally, until blackened on all sides, about 10 minutes. Alternatively, broil as close as you can get to broiler element, turning occasionally, until blackened on all sides, about 10 minutes. Transfer to a bowl, cover tightly in plastic wrap, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoon olive oil in a large saucepan over high heat until shimmering. Add mushrooms, season with salt and pepper, and cook, stirring and tossing occasionally, until well-browned, about 10 minutes. Add garlic and cook, stirring frequently, until fragrant, about 1 minute. Add spinach along with 2 tablespoons water. Cook, folding and stirring until spinach is completely wilted and water has evaporated, about 3 minutes total. Season to taste with salt and pepper. Transfer to a paper towel-lined plate and press with more paper towels to draw out excess moisture. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully peel charred skin from poblano peppers, remove stems and seeds, and cut into 1/4- to 1/2-inch strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine refried beans, chipotle peppers, and molasses. Stir with a fork until homogenous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble sandwiches, split rolls in half. Spread bean mixture evenly over bottom halves. Top with poblano slices, followed by wilted spinach/mushroom mixture, jalapeño slices, pickled red onions, and cilantro. Spread sliced avocados evenly on cut-side of top half of rolls. Close sandwiches, pressing down gently to compress. Serve as-is, or toast in a panini press or in a hot oven for a few minutes if desired.</p>"}]}