{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130320-245320-meyer-lemon-mascarpone-cake.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["cake", "cheesecake", "let them eat", "marscapone", "meyer lemon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "6"}, "name": "Meyer Lemon Mascarpone Cake", "link": "https://www.seriouseats.com/recipes/2013/03/meyer-lemon-mascarpone-cheesecake-recipe.html", "description": "Looking for a tart, creamy cheesecake to use up all those Meyer lemons in your yard? Search no further.", "totalTime": "1 hour 15 minutes", "recipeYield": "serves 8", "recipeCategory": ["Cakes", "Let Them Eat..."], "recipeIngredient": ["<strong>For the Crust:</strong>", "2 cups ginger snap crumbs (about 9 ounces of cookies)", "4 tablespoons melted unsalted butter", "1 tablespoon maple syrup", " ", "<strong>For the Mascarpone Filling:</strong> ", "2 eight-ounce packages of cream cheese, at room temperature", "2 eight-ounce containers of mascarpone cheese, at room temperature", "1/2 cup sugar", "3 tablespoons Meyer lemon zest, from 2 lemons", "4 eggs, at room temperature, beaten", "1 teaspoon vanilla", "4 tablespoons flour", "1/2 teaspoon salt", "Pinch cayenne pepper", " ", "<strong>For the Lemon Filling:</strong> ", "4 tablespoons cornstarch", "1/2 cup cold water", "3/4 cup sugar", "1/4 teaspoon salt", "2 tablespoons Meyer lemon zest", "8 large egg yolks", "1/2 cups Meyer lemon juice", "1/2 cup butter, chopped into small pieces", "Whipped cream, for topping", "Lemon wedge jelly candy for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the crust:</strong> Preheat oven to 325&deg;F. Combine ginger snap crumbs, melted butter, and maple syrup and stir until well mixed. Press into the bottom of a greased 9-inch springform pan and bake for 10 minutes. Set aside to cool. Leave oven on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the mascarpone filling:</strong> Add the cream cheese to the bowl of an electric mixer and beat until creamy, about two minutes. Add mascarpone, sugar and lemon zest, beating on low speed for 1 minute, until the texture is smooth. Do not over-beat, as mascarpone will occasionally go to pieces if abused. Turn the mixer to medium and add eggs a little a time, and then the vanilla, again beating until smooth - about 30 seconds. Add flour, salt, and cayenne, beating for another 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour mascarpone filling into the cooled springform pan and wrap the bottom and sides tightly with <a href=\"http://www.amazon.com/gp/product/B000LLWH2W/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B000LLWH2W&linkCode=as2&tag=httpwwwwasabi-20\">heavy duty tin foil</a> to keep butter from leaking out into your oven (see headnote--springform pans are notoriously leaky). Bake for 45 to 50 minutes. The top should be slightly browned and a little jiggly in the middle. Cool for 15 minutes, then run a knife around the edges of the cake to loosen it from the pan. Allow to cool completely before adding lemon filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Meyer lemon filling:</strong> In a cup, stir together cornstarch and water until you have a well-mixed slurry. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl combine sugar, salt, lemon zest, and egg yolks, beating well with a whisk. Add in lemon juice, stir well, then add butter and cornstarch slurry, whisking again.<br />\r\n </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the lemon filling into a saucepan and cook over medium heat, whisking constantly until the mixture thickens, about 5 to 7 minutes. It should be thick enough to heavily coat the back of a spoon. If the mixture begins to boil, lower the heat to medium-low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pan from heat and continue to whisk for 1 minute. Push the filling through a sieve to remove any lumps, then pour the filling into the springform pan on top of the baked cheesecake. Chill for at least six hours to set the cake completely before removing the sides of the springform pan. Serve with a dollop of whipped cream and a slice of lemon jelly candy, if you like.</p>"}]}