{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/12/235105-20120102-british-bites-beef-stilton-pasty.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["beef", "british bites", "pasties", "pies", "Stilton"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Beef and Stilton Pasty", "link": "https://www.seriouseats.com/recipes/2013/01/beef-and-stilton-pasty-recipe.html", "description": "Based on the large version of this classic pie, these savory pasties make a great light lunch, or even a hearty snack. The combination of beef and stilton is perfect for this time of year&mdash;salty and savory and great for colder weather. This recipe calls for just 1/4 cup of stout, which adds a light malty quality to the filling. But you can try another sort of beer, or even substitute stock if you'd rather drink your beer.", "totalTime": "1 hour 20 minutes", "recipeYield": "Makes 8 pasties", "recipeCategory": ["Beef", "British Bites", "Mains"], "recipeIngredient": ["1 pound beef stew meat (such as chuck, short rib, or sirloin flap), cut into 1/2-inch pieces ", "Kosher salt and cracked black pepper ", "1 teaspoon vegetable oil ", "1 tablespoon butter ", "1 medium onion, finely chopped (about 1 cup)", "2 sprigs thyme, leaves removed ", "2 medium white potatoes, cut into 1/4 inch pieces (about 3 cups)", "1/4 cup stout ", "1/2 pound stilton, crumbled ", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">pie dough</a>", "1 egg, beaten "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400[&deg;]. Season beef with salt and pepper. Heat vegetable oil in a large stainless steel skillet over high heat until shimmering. Add meat and cook without moving until well browned on first side, about 4 minutes. Flip with tongs and continue cooking until well browned on all sides, about 12 minutes total. Transfer meat to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium-low heat. Add butter and heat until melted. Add onions and thyme and cook, stirring frequently and scraping up any browned bits with a wooden spoon, until onions have softened, about 10 minutes. Add diced potatoes and stout and cover skillet with a lid. Cook until potatoes are soft, about 8 minutes. Add potato mixture to reserved meat and allow to cool to room temperature then add crumbled stilton. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll pie crust to 1/4-inch thickness and using a 4-inch round pastry cutter, cut out as many circles as possible. Gather scraps and press into a ball. Re-roll pie crust and cut out more circles. You should be able to get 8 circles total. Divide filling evenly between the crusts. Brush edges with beaten egg, then fold over crusts and seal with a fork. Place pasties on a foil-lined rimmed baking sheet. Brush with remaining beaten egg , then using a sharp knife cut a few air vents in the top of each pasty. bake until golden brown, about 18 minutes. Allow to cool for five minutes, then serve.</p>"}]}