{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/031213-243843-cook-the-book-mussels-garlic-parsley-bread-crumbs.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "garlic and parsley bread crumbs", "mussel", "mussels", "rachel allen", "rachel's irish family food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rachel Allen's Mussels with Garlic and Bread Crumbs", "link": "https://www.seriouseats.com/recipes/2013/03/rachel-allens-mussels-with-garlic-and-bread-c.html", "description": "According to <strong><a href=\"http://www.rachelallen.co.uk/biog.html\">Rachel Allen</a></strong>, mussels with bread crumbs were immensely popular in Ireland back in the 1980s. Yet their retro appeal holds true today and her version in <em><a href=\"http://www.amazon.com/Rachels-Irish-Family-Food-classic/dp/0007462581/?tag=serieats-20\">Rachel's Irish Family Food</a></em>, is anything but kitschy. In it, plump, just-steamed mussels get a quick trip under a hot broiler topped with super buttery breadcrumbs laced with garlic and parsley. The final result is a briny, succulent bite, colorful and rich.", "totalTime": "20 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Clams, Mussels, and Oysters", "Cook the Book", "Garlic"], "recipeIngredient": ["2 pounds (900g) mussels in their shells, scrubbed clean", "4 tablespoons (50g) butter", "1 cup (50g) fresh white bread crumbs", "1 large clove garlic, crushed or grated", "1 tablespoon chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Check over the mussels and, if any are open, give them a tap; if they don’t close, discard them. Put the tightly shut mussels with just 1 tablespoon of water in a large saucepan over low heat and cover with the lid. They will open in the steam. If you catch them when they are just opening, they will be delicious and juicy, so don’t overcook them. Remove the mussels from the pan (keeping any juices for a fish soup, pie, stew, or even to mix with mayonnaise served with shellfish such as shrimp). Discard any cooked mussels with unopened shells. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard half a shell from each mussel and pull out the beard—the little fibrous tuft— from the straight side of each mussel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a medium saucepan over medium-low heat. Add the bread crumbs, garlic, and parsley and mix together. With a spoon, firmly pack the bread crumb mixture on top of each mussel. Place the mussels, crumb side up, in a single layer on ovenproof plates or gratin dishes. (These can be prepared up to 24 hours in advance.) When you are ready to eat, pop them under a preheated broiler (grill) until golden, crunchy, and bubbly, 1 to 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variations:</strong> While it isn’t classically Irish, sometimes I feel like adding a bit more zip to this recipe, so in place of the parsley, I add 1 tablespoon chopped fresh cilantro (coriander) together with one-quarter to one-half of a fresh red chile, seeded and chopped. Or you could try adding some grated lemon zest to the crumbs. </p>"}]}