{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130210-sweet-potato-banh-mi-recipe-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bánh mì", "quick", "sandwich", "sweet potato", "tempura"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vietnamese Sandwiches With Tempura Sweet Potato and Avocado (Vegan Banh Mì)", "link": "https://www.seriouseats.com/recipes/2013/02/tempura-sweet-potato-banh-mi-vegan-vietnamese-sandwich-recipe.html", "description": "Lightly battered and deep-fried until crisp, tempura sweet potato makes for an excellent Vietnamese sandwich filling. This version is flavored with a Hainnanese-style ginger-scallion oil that seeps into the batter and makes for one helluva messy vegan sandwich.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dairy-Free", "Mains", "Sandwiches", "Sweet Potatoes and Yams", "Vegan"], "recipeIngredient": ["1 1/2 quarts vegetable, peanut, or canola oil", "1/2 cup all-purpose flour", "1/4 cup cornstarch", "Kosher salt", "3/4 cup ice cold seltzer water (See note)", "1 sweet potato, cut in half lengthwise, then cut into 1/4 to 1/8-inch planks", "4 Vietnamese-style baguettes, or four soft hoagie rolls", "2 teaspoons liquid aminos, such as Maggi or Bragg's", "1 avocado, thinly sliced", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/05/hainnanese-ginger-scallion-oil.html\">Hainnanese Ginger-Scallion Oil</a>", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/02/pickled-daikon-and-carrot-do-chua.html\">Vietnamese Pickled Carrots and Daikon</a> (do chua)", "1 cucumber, seeds removed, split lengthwise into 8 spears", "1 jalapeño pepper, seeds and stem removed, sliced into thin spears", "1 bunch cilantro leaves and fine stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Heat oil in a large wok, Dutch oven, or deep fryer to 400°F. Combine flour, cornstarch, and 1/2 teaspoon salt in a medium bowl and stir with chopsticks to combine. Add soda water and stir rapidly to combine. Do not overmix (some lumps are ok). Add sweet potato slices and working one piece at a time, lift potato slice, allow excess batter to drip back into bowl, then slowly lower into hot oil. Repeat until all potato slices are in the fryer. Cook, agitating and flipping slices constantly until pale golden brown and very crisp, about 2 minutes. Transfer sweet potato slices to a paper towel-lined plate and season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place baguettes in oven until crisp, about 4 minutes. Split baguettes. Sprinkle bottoms and tops with liquid aminos, then spoon on a thin layer of the ginger-scallion oil. Spread half of avocado along bottom surface os sandwich, then divide sweet potatoes on top of avocado. Top sweet potatoes with more ginger-scallion oil, then add pickled carrot/daikon mixture, cucumber spears, jalapeño, and cilantro. Spread remaining avocado on top half of bun. Season to taste with salt, then close sandwiches, split in half crosswise, and serve immediately.</p>"}]}