{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130909-vegetarian-sauteed-bok-choy.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["bok choy", "caramelized onion", "main", "onion", "pine nut", "raisin", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sautéed Bok Choy with Caramelized Onions, Golden Raisins, and Toasted Pine Nuts", "link": "https://www.seriouseats.com/recipes/2013/09/bok-choy-caramelized-onions-golden-raisins-vegetarian-recipe.html", "description": "This tasty, boundary-transcending dish of bok choy sauteed with garlic, sherry-soaked raising, pine nuts, and caramelized onions can be spooned over fluffy rice or mixed into a bowl of toothsome pasta.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Mains", "Nuts", "Onion", "Vegetarian"], "recipeIngredient": ["1/4 cup golden raisins", "1/2 cup dry sherry or vermouth", "7 tablespoons vegetable oil, divided", "2 large or 3 medium sweet onions, peeled and sliced into half-moons (about 3 cups total)", "2 large heads bok choy, rinsed of any grit, chopped, stalks and leaves divided", "3 medium cloves garlic, chopped (about 1 tablespoon)", "Kosher salt and freshly ground black pepper", "2 tablespoons toasted pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine raisins and sherry in a small bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 4 tablespoons oil in a heavy-bottomed Dutch oven over medium heat until shimmering. Add onions and cook, stirring occasionally and then more frequently at the end, until deeply caramelized and sticky, about 40 minutes, reducing heat and adding a tablespoon or two of water is onions begin to burn. Add raisin mixture and stir, using a wooden spatula to deglaze bottom of pan. Transfer onions to a dish and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out pan and return to high heat. Add 3 tablespoons oil and, when shimmering, add chopped bok choy stalks. Cook, stirring occasionally, until bok choy releases the majority of its liquid and begins to brown, 10 to 12 minutes. Add garlic and cook, stirring, until fragrant, about 1 minute. Add chopped bok choy leaves and cook, stirring, until wilted, about 6 minutes. Lower heat, add onion mixture and stir to incorporate. Season generously with salt and pepper. Transfer vegetables to a platter, sprinkle with pine nuts, and serve immediately. </p>"}]}