{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130114-236644-cook-the-book-mil-signature-kimchi.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Korean", "keywords": ["Cook the Book", "Korean", "Lauryn Chun", "mother-in-law's kimchi", "napa cabbage", "The Kimchi Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Mother-in-Law's Signature Kimchi from 'The Kimchi Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/01/mother-in-laws-signature-kimchi-from-the-kimchi-cookbook-recipe.html", "description": "Napa cabbage is the backbone to many a kimchi recipe, so it seems natural to begin a kimchi-making adventure with a leafy ferment. In <strong>Lauryn Chun's</strong> <em><a href=\"http://www.amazon.com/The-Kimchi-Cookbook-Traditional-Modern/dp/1607743353/?tag=serieats-20\">The Kimchi Cookbook</a></em>, she presents a recipe for the house pickle from her company, <a href=\"http://milkimchi.com/\">Mother-in-Law's Kimchi</a>. As she writes in the intro to the recipe, Chun's recipe is a variation on a fall harvest kimchi, typically eaten fresh, immediately after mixing. Chun prefers to ferment the mixture of chile flakes, salted shrimp, garlic, ginger, and cabbage for a few days before eating; this is how her product is sold. The moderate fermentation time allows the seasonings to mellow a bit and take on kimchi's signature effervescent quality.", "totalTime": "2 to 3 days", "recipeYield": "makes 8 cups", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Korean", "Sides"], "recipeIngredient": ["<strong>Brine</strong>", "2 medium heads (4 to 5 pounds total) napa cabbage", "2 tablespoons kosher salt", " ", "<strong>Seasoning Paste</strong>", "2 tablespoons salted shrimp", "1/3 cup <a href=\"http://www.seriouseats.com/recipes/2013/01/sweet-rice-flour-porridge-from-the-kimchi-cookbook-recipe.html\">Sweet Rice-Flour Porridge</a>", "1/4 cup anchovy sauce ", "1/4 cup beef stock ", "2 tablespoons minced garlic", "1 tablespoon peeled, finely grated fresh ginger ", "2 teaspoons sugar", "2/3 cup Korean chile pepper flakes", " ", "1/2 cup thinly sliced yellow onion", "4 green onions, green parts only, cut into 2-inch pieces (about 1/2 cup)", "3 ounces Korean chives or 1/2 bunch European chives, cut into 4-inch pieces (about 1/4 cup)", "6 to 8 fresh oysters (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the cabbage into quarters, and then cut each quarter in half lengthwise and cut out the core. Lay each cabbage segment flat, then quarter into sections about 1 inch wide by 6 inches long. If some of the leaves are too wide, cut them to approximate proportions. In a large bowl, toss the cabbage with the salt and set aside to brine for 1 hour and 15 minutes. Rinse off the salt in a bowl of cold water and let the cabbage leaves drain in a colander for 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the seasoning paste, in a mini food processor fitted with a metal blade, purée the shrimp, porridge, anchovy sauce, stock, garlic, ginger, and sugar. Transfer the mixture to a bowl and add 1/4 cup of the chile pepper flakes and mix by hand. Let the seasoning paste sit for 15 minutes to let the flavors combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss the cabbage, onion, green onions, and chives with the remaining chile pepper flakes until the chile pepper flakes lightly coat the vegetables. Add the seasoning paste and oysters and mix until evenly distributed. Pack tightly into a 2-quart container, cover, and set aside for up to 2 days at room temperature. Then move the container to a refrigerator. You can also eat the kimchi immediately, but I prefer the slightly aged, fermented taste. As it ferments, cabbage will expand, so be sure to place the jar on a plate or in a bowl to catch the overflow.</p>"}]}