{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/062113-256056-cook-the-book-slow-baked-salmon-tabouli.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "flour too", "joanne chang", "salmon", "tabouli"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Slow-Baked Atlantic Salmon with Tabouli from 'Flour, Too'", "link": "https://www.seriouseats.com/recipes/2013/06/slow-baked-atlantic-salmon-with-tabouli-from-joanne-chang-flour-too.html", "description": "There's good news for fish-averse cooks: <strong><a href=\"http://flourbakery.com/team/joanne-chang\">Joanne Chang</a></strong>s recipe for slow-baked salmon in her new cookbook, <em><a href=\"http://www.amazon.com/Flour-Too-Indispensable-Recipes-Savories/dp/1452106142/?tag=serieats-20\">Flour, Too</a></em>, is not only easy (and pretty foolproof), but it also keeps that intense salmon smell at bay. The filets are well-coated in olive oil and then cooked in a gentle 300º F oven until just firm to the touch. They stay delicate and buttery, with no stringy flesh in sight. To pair with the rich salmon, Chang whips up a fluffy, lemon-y tabouli salad. It's heavy on the bulgur to make it a more substantial side dish, but the tabouli still has a strong, herbal presence.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Mains", "Other Grains", "Salmon"], "recipeIngredient": ["<strong>Tabouli</strong>", "1 cup (200 grams) bulgur wheat, fine grind or no. 1 grind", "1 to 1 1/2 cups (240 to 360 ml) boiling water", "6 radishes, trimmed and quartered lengthwise", "2 Persian cucumbers or 1/2 English cucumber, thinly sliced crosswise", "1 cup (170 grams) halved cherry tomatoes", "3 tablespoons minced red onion", "1/4 cup (15 grams) julienned fresh mint leaves", "1/4 cup (15 grams) julienned fresh flat-leaf parsley", "3 tablespoons extra-virgin olive oil", "1 tablespoon plus 2 teaspoons freshly squeezed lemon juice", "1/2 teaspoon grated lemon zest", "1/2 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "&nbsp", "<strong>Salmon</strong>", "4 tablespoons (60 ml) extra-virgin olive oil", "1 1/2 pounds (680 grams) salmon fillet with skin intact, cut into 4 equal pieces", "1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "1/2 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the tabouli:</strong> Put the bulgur wheat in a small heatproof bowl and pour 1 cup (240 ml) of the boiling water over it. Cover tightly with plastic wrap and place in a warm area for about 20 minutes. After 20 minutes, uncover and fluff up the bulgur wheat with a fork. If it is still hard or chewy, add 1/4 cup (60 ml) boiling water, re-cover, and steam for another 5 minutes. Repeat once more if necessary. You want the bulgur wheat to be fluffy and tender. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the radishes, cucumbers, tomatoes, red onion, mint, and parsley. Drizzle with the olive oil and lemon juice and toss until evenly coated. Add the lemon zest, salt, and pepper and toss again. Add the bulgur wheat and mix until well combined. (Taste and adjust the seasoning with salt and/or lemon juice if needed.) The salad can be stored in a covered container in the fridge for up to 3 days. For the best flavor and texture, bring to room temperature before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300°F (150°C), and place a rack in the middle of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear the baking sheet with 1 to 2 teaspoons of the olive oil and place the salmon, skin-side down, on the baking sheet. Drizzle about half of the remaining oil over the salmon and sprinkle evenly with the salt and pepper. Bake for 12 to 15 minutes, or until the fish turns opaque and feels firm when you press the thickest part. The baking time will depend on the thickness of the fillet. Keep in mind that even after the fish comes out of the oven, it will continue to cook because of carryover cooking (retained heat).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the salmon from the oven and baste it with the remaining oil. Squeeze the lemon half over the salmon pieces and let the fish rest on the baking sheet for 5 to 8 minutes. To serve, divide the tabouli evenly among four dinner plates, and top each with a salmon fillet.</p>"}]}