{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130304-242792-MisoLemongrassSoup-edit.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["lemongrass", "lunch box", "make ahead", "soup", "vegetarian", "wontons"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Miso Lemongrass Soup with Mushroom Dumplings", "link": "https://www.seriouseats.com/recipes/2013/03/make-ahead-miso-lemongrass-soup-mushroom-dumplings-recipe.html", "description": "A light lemongrass-miso broth with mushroom and scallion wontons.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Lunch Box", "Mains", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["4 cups water", "1 stalk lemongrass, whacked a few times with the back of a knife to bruise", "5 tablespoons yellow miso paste", "1 1/2 cups packed fresh spinach leaves (about 1 ounce)", "1 teaspoon vegetable oil", "8 ounces cremini mushrooms, finely chopped", "2 scallions, white and light green parts, halved lengthwise and thinly sliced", "Kosher salt and freshly ground black pepper ", "2 teaspoons brown rice or rice wine vinegar", "1 tablespoon soy sauce", "About 10 wonton wrappers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring water and lemongrass to a boil in pot. Place miso in small bowl. Pour about 1/2 cup boiling water into miso and whisk until smooth; pour into pot and whisk together. Let simmer over medium-high heat to reduce slightly and for flavors to combine, 5 to 7 minutes. Stir in spinach and simmer until just wilted, 1 minute. Remove lemongrass stalk and discard. Remove from heat and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat oil in large nonstick skillet over medium-high heat until shimmering. Add mushrooms and scallions and season with salt and pepper. Saute until softened and beginning to crisp, 3 to 4 minutes, then add vinegar, turn heat to low and cook 1 minute. Add soy sauce and simmer until liquid is nearly dry, another 2 to 3 minutes. Transfer mushroom mixture to paper-towel-lined strainer and press out any excess moisture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one at a time, lay wonton wrapper in diamond shape facing you. Place 1 heaping teaspoon filling into center. Moisten bottom edges of wrapper with water using your finger, then fold over and seal tightly. If desired, wet one edge of triangle and seal together two edges so wonton looks like a bishop's hat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To eat immediately, bring soup back to simmer and  cook dumplings in soup for 2 to 3 minutes. To make ahead, keep dumplings separate in an airtight container. Pour soup into airtight container. Reheat soup with dumplings in microwave for 2 minutes 30 seconds, until dumplings heated and papers cooked through. </p>"}]}