{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/041213-247329-cook-the-book-spring-garden-hodgepodge.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["asparagus", "butter", "Cook the Book", "Deborah Madison", "light eating", "peas", "radishes", "spring produce", "vegetable literacy", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Deborah Madison's Spring Garden Hodgepodge of Radishes, Leeks, and Peas Depending ...", "link": "https://www.seriouseats.com/recipes/2013/04/deborah-madisons-spring-garden-hodgepodge-of.html", "description": "You gotta love a cookbook author bold enough to use the words \"hodgepodge\" and \"depending\" in the same recipe title. Yet as <strong><a href=\"http://deborahmadison.com/\">Deborah Madison</a></strong> explains in her new book, <em><a href=\"http://www.amazon.com/Vegetable-Literacy-Gardening-Families-Deliciously/dp/1607741911/?tag=serieats-20\">Vegetable Literacy</a></em>, \"Depending is the operative word when there is a garden or good farmers' market.\" Indeed, when shopping seasonally, you'll never really know what'll look good until you see it. So, go ahead, embrace the hodgepodge of spring vegetables, and adapt Madison's gentle cooking technique and emphatic use of excellent butter to suit your spring haul.", "totalTime": "45 minutes", "recipeYield": "serves 2", "recipeCategory": ["Asparagus", "Cook the Book", "Gluten-Free", "Legumes", "Mains", "Vegetarian"], "recipeIngredient": ["Handful of radish thinnings, plus their greens", "3 thin leeks, white part plus a little of the pale green, sliced (about 1/2 cup)", "10 ounces pod peas, shucked (about 3/4 cup)", "3 thick asparagus spears, tough ends trimmed, peeled, and sliced on the diagonal", "Spring butter, made from the milk of grass-fed cows, or your favorite", "1/2 to 1 cup water or chicken stock", "Sea salt", "About 1 teaspoon finely chopped tarragon", "1 teaspoon lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare and wash all your vegetables. Trim the radishes and slice them lengthwise, making all the pieces more or less the same size. Also wash and dry the greens, and ready the leeks, peas, and asparagus. (If you wish, you can make a stock to use in this dish with the leek trimmings, pea pods, asparagus peels, some tarragon, and salt. You’ll need only 1 cup or so.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are about ready to eat, melt a few teaspoons butter in a heavy skillet over medium heat. Add the leeks and 1/2 cup of the water and simmer for 5 minutes. Season with a few pinches of salt, add the radishes and asparagus, and simmer for 3 minutes. Next, add the peas and radish greens, making sure there is liquid in the pan as you go and adding more if needed. Continue cooking until the peas are bright green and the leaves are tender, about 2 minutes longer. The radish leaves will wilt and look a little funky, but they will taste mild and slightly nutty.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the vegetables are done, remove from the heat, add a heaping spoonful of butter, season with salt, and stir in the tarragon and lemon juice. Taste and adjust the seasonings, then serve and enjoy your garden in a bowl.</p>"}]}