{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130218-veg-minestrone.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["minestrone soup", "pasta", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Hearty Winter Minestrone with Chili Oil, Lemon Zest, and Parmesan", "link": "https://www.seriouseats.com/recipes/2013/02/hearty-winter-minestrone-chili-oil-lemon-zest-parmesan-recipe.html", "description": "This vegetable soup is full of flavor from the many vegetables used to make it, and is given a kick with hot chili oil, bright lemon zest, and nutty Parmesan cheese.", "totalTime": "1 hour 20 minutes (plus overnight soaking time for beans)", "recipeYield": "Makes about 4 quarts", "recipeCategory": ["Soups and Stews", "Vegetarian"], "recipeIngredient": ["1 cup dried cannellini (white) beans, soaked overnight", "4 tablespoons plus 1/2 cup extra virgin olive oil, divided", "1 medium onion, chopped (about 1 cup)", "4 medium garlic cloves, minced (about 4 teaspoons)", "2 medium russet potatoes, peeled and cut into a 1/2 inch dice (about 2 cups)", "2 tablespoons tomato paste", "3 quarts water or <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">vegetable stock</a> (plus more as needed)", "2 bay leaves", "2 large carrots, peeled and chopped (about 1 1/2 cups)", "1 stalk celery, chopped (about 1/4 cup)", "Kosher salt and freshly ground black pepper", "1 small head Savoy or Napa cabbage, cored and shredded (about 8 cups)", "1 bunch Swiss chard, rinsed and shredded (about 3 cups)", "1 cup small pasta such as ditalini or macaroni, cooked to al dente (yields about 2 cups)", "1 tablespoon small whole dried red chilis, or use 1 teaspoon crushed red pepper flakes", "3 tablespoons chopped fresh parsley leaves", "Zest of half a lemon (about 2 teaspoons)", "Parmesan cheese, for grating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 4 tablespoons olive oil in an 8-quart Dutch oven over high heat until shimmering. Add onions and garlic and cook, stirring frequently, until lightly softened but not browned, about 2 minutes. Add potatoes and cook, stirring occasionally, until potatoes begin to stick to bottom of pot, about 5 minutes. Scrape vegetables to one side of pot, add tomato paste to empty space and cook, stirring, until paste darkens in color slightly, about 2 minutes. Stir tomato paste into rest of vegetables to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add beans and their soaking liquid, 3 quarts water, bay leaves, carrot, celery, and 1 tablespoon salt to pot. Bring to a boil then drop to a simmer and cook until beans are mostly tender, about 30 minutes. Add chard and cabbage and cook until vegetables are completely softened, about 30 minutes longer. Taste soup for seasoning, adding black pepper and more salt as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the chili oil: in a small pan, combine the dried chilis or pepper flakes and 1/2 cup olive oil. Heat, stirring occasionally, over very low heat until chilis toast and start to make a popping noise. Transfer to a heat-proof bowl and allow to rest until cooled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve soup, place about 1/4 cup cooked pasta into each serving bowl, ladle soup over, and top with a drizzle of chili oil and a sprinkling each of lemon zest, parsley and grated Parmesan. </p>"}]}