{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131016-269434-cook-the-book-kale-and-grilled-bread-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["bread", "Cook the Book", "fig", "kale", "nut", "onion", "salad", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Grilled Bread and Kale Salad With Red Onions, Walnuts, and Figs, From 'Heart of the Plate'", "link": "https://www.seriouseats.com/recipes/2013/10/mollie-katzen-grilled-bread-salad-with-kale-onions-walnuts-and-fig.html", "description": "Yes, kale salads have been written, served, and re-worked to death. Adding fruit, red onion, walnuts, and bread isn't terribly revolutionary. But here's what makes this salad stand out&mdash;it's not raw.", "totalTime": "35 minutes", "recipeYield": "Serves 2 to 4", "recipeCategory": ["Cook the Book", "Kale", "Mains", "Onion", "Salads", "Sides", "Vegetarian"], "recipeIngredient": ["5–6 ripe figs ", "1–2 tablespoons fresh lemon or lime juice", "1 3-ounce piece Parmesan cheese", "1 loaf ciabatta or sourdough baguette (fresh or day-old)", "1 large or 2 small bunches (1/2 pound total) lacinato kale", "3 tablespoons extra-virgin olive oil", "1 small red onion, cut in half and then into 1/4-inch slices", "1/4 teaspoon salt", "2 tablespoons balsamic vinegar", "A handful or two walnut halves, toasted and coarsely chopped", "Black pepper", "Lemon or lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stem the figs and slice them lengthwise into about 5 wedges per fig. Place them in a medium dish and sprinkle with the lemon or lime juice. Toss gently to coat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shave strips of Parmesan from the block of cheese, using a sturdy vegetable peeler. Lovely cheese ribbons will ensue. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the bread into approximately a dozen thin (as in almost see-through) slices. Larger slices from a ciabatta can be halved for easier handling and consumption. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hold each kale leaf by the stem and use a very sharp knife to release the leaf from the stem (it’s OK to leave the narrow part of the stem that blends into the leaf farther up). Make a pile of the leaves, roll them up tightly, and cut crosswise into super-thin strips. Transfer to a large bowl of cold water and swish around to clean. Spin very dry and transfer to a large bowl. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large deep skillet over medium heat for about a minute. Add 2 tablespoons of the olive oil and swirl to coat the pan. Turn up the heat to medium-high and add the onion and 1/8 teaspoon of the salt. Cook, stirring and/or shaking the pan a little, for 2 to 3 minutes, or until the onion becomes shiny and is still this side of tender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the hot onion to the kale in the bowl and stir everything around a bit, then return the entire bowlful of kale-plus-onions to the pan. Stir-fry quickly—just for a minute or so—over medium-high heat until the kale turns an even deeper shade of green and wilts slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return it all to the bowl, tossing in the remaining 1/8 teaspoon salt. You can add some of the cheese at this point, if you’d like it to melt in slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the heat, wait a minute or two, then add the vinegar to the pan (stand back—it will sizzle), swirl it around, and pour what’s left of it into the kale. (It will mostly evaporate.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Without bothering to clean the pan, return it to the stove over medium heat. Wait another minute, then add the remaining 1 tablespoon olive oil and swirl to coat the pan. Add the bread slices in a single layer and grill on each side until lightly golden and perfectly crisp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the toasts to the kale, along with the figs and all their juice and the shaved cheese to taste. Toss quickly (no need to get things uniform), adding the remaining cheese and the walnuts as you go. Serve right away, passing a pepper mill and offering wedges of lemon or lime to be aimed straight at the figs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Optional enhancements:</strong><br />\r\nNot a fig person? You can swap in a crisp fall apple, sliced thin and lemon juice-doused. <br />\r\nGo in an entirely different direction and substitute slices or chunks of a very sweet ripe heirloom tomato or a few handfuls of very sweet, ripe cherry tomatoes.<br />\r\n</p>"}]}