{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/032713-246029-Sunday-Supper-Balsamic-Ham-Basil-PeasB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["balsamic vinegar", "English peas", "ham", "mint", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Balsamic-Glazed Ham With Basil English Peas", "link": "https://www.seriouseats.com/recipes/2013/04/balsamic-glazed-ham-basil-english-peas-recipe.html", "description": "Balsamic-glazed ham and basil peas lend a springtime feel to this festive meal.", "totalTime": "2 1/2 hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Easter", "Ham", "Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["<strong>For the Ham:</strong>", "5 tablespoons balsamic vinegar", "2 tablespoons coarse-ground mustard", "1/2 cup apple jelly", "1 tablespoon brown sugar", "Kosher salt and freshly ground black pepper", "1 fully-cooked bone-in spiral-cut city ham (shank-end or butt-end, 8 to 10 pounds total)", "1/4 cup white wine", "&nbsp", "<strong>For the Peas:</strong>", "1 1/2 tablespoons olive oil", "¼ cup minced white onion (about 1/2 small)", "3 cups (about 18 ounces) fresh English peas, shelled", "1 cup homemade or store-bought low sodium chicken stock", "1 1/2 tablespoons minced fresh basil leaves", "2 tablespoons juice and 1 teaspoon zest from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 325&deg;F.<br />\r\nPrepare the glaze by combining the vinegar, mustard, jelly, brown sugar, 1/2 teaspoon salt and 1 teaspoon black pepper in a small saucepan over medium heat. Bring to a simmer and, stirring continuously, allow mixture to reduce until lightly syrupy, about 5 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place ham, flat side down, on rack in shallow roasting pan. Insert meat thermometer so tip is in thickest part of ham and does not touch bone or rest in fat. Cover loosely with foil and transfer to the oven to roast until a meat thermometer inserted into the deepest part of the ham registers 115°F, about 1 hour. Remove from oven and remove foil. Generously slather meat with glaze, taking care to sure to get mixture into the crevices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tent loosely with the foil again and return ham to the oven and continue to bake until it’s caramelized on the outside and a meat thermometer inserted into the thickest part of the meat reads 135&deg;F, about 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When done, transfer ham to a cutting board, tent lightly with foil, and let rest at least 10 minutes. Meanwhile, place roasting pan with drippings on stove top over high heat. Add wine and cook, using a wooden spoon to scrape up and browned bits. Simmer until lightly thickened, about two minutes. Transfer pan sauce to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a sauté pan over medium-high heat. When oil is shimmering, add onion and sauté for 2 minutes. Add peas, a pinch of salt and enough stock to cover the peas. Raise heat to high and cook until peas are just tender, 3 to 4 minutes. Remove from heat, add basil, lemon juice and lemon zest. Adjust seasoning if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve and serve ham and peas family-style, passing additional glaze and pan sauce as accompaniments.</p>"}]}