{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20130930-267541-mushroomtomatobreadsoup.JPG", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["bread", "easy", "mushroom", "olive oil", "soup", "stew", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Mushroom Tomato Bread Soup", "link": "https://www.seriouseats.com/recipes/2013/10/lunch-box-make-ahead-mushroom-tomato-bread-soup-recipe.html", "description": "What sets this soup apart from other tomato-bread varieties are two things: the welcome addition of mushrooms, cut into large pieces so they don't get lost in the crowd, and cinnamon, bringing an undercurrent of warm spice to the strong tomato flavor.", "totalTime": "35 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Dairy-Free", "Lunch Box", "Mains", "Mushrooms", "Soups and Stews", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1 (6-inch) ciabatta loaf or any stale bread, torn into 1-inch chunks (about 2 cups torn bread)", "1 tablespoon olive oil", "1 medium yellow onion, diced (about 1 cup)", "Kosher salt", "1 1/2 tablespoons apple cider vinegar", "12 ounces cremini mushrooms, halved if small, quartered if very large", "1 (14.5 ounce) can diced tomatoes", "1/2 teaspoon ground cinnamon", "3 cups low-sodium vegetable or chicken stock, plus 1 more cup as needed ", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 300 degrees F. Spread bread onto baking sheet and bake until dried but not browned, 15 to 20 minutes. Meanwhile, heat olive oil over medium heat in medium saucepan. Add onions, season with salt, and cook until translucent, 5 to 7 minutes. Deglaze with vinegar and cook until liquid is almost evaporated, 1 to 2 minutes. Add mushrooms, turn heat to medium-high, and cook, stirring, until softened, moisture has evaporated, and mushrooms begin to brown, 5 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in tomatoes and cinnamon, followed by chicken stock. Simmer until warmed through, 2 to 3 minutes, then stir in bread and simmer for 2 to 3 minutes more, stirring to soften bread. Season to taste with salt and black pepper. Add more chicken stock if thinner consistency is desired. Serve immediately or let cool and refrigerate overnight. To serve the next day, reheat in the microwave or stovetop, adding extra stock or water to loosen consistency as desired.</p>"}]}