{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/201311-bread-baking-pumpkin-sweet-rolls.JPG", "author": {"@type": "Person", "name": "Donna Currie"}, "recipeCuisine": "", "keywords": ["bread", "breakfast", "roll", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Sweet Swirl Buns", "link": "https://www.seriouseats.com/recipes/2013/11/pumpkin-sweet-swirl-buns.html", "description": "Sweet pumpkin buns with a hazelnut-graham cracker swirl.", "totalTime": "1 day (including overnight rest)", "recipeYield": "Makes 9 rolls", "recipeCategory": ["Bread Baking", "Breakfast and Brunch", "Christmas", "Mother's Day", "Pumpkin", "Yeast Bread"], "recipeIngredient": ["1 cup (about 8 ounces) canned pumpkin purée (not pie filling)", "1/2 cup (4 ounces) lukewarm water", "2 1/4 teaspoons active dry yeast", "1/4 cup sugar", "13 1/2 ounces (about 2 1/2 cups) bread flour", "1 teaspoon salt", "4 tablespoons (1/2 stick) unsalted butter at room temperature", "Non-stick baking spray", "1/4 cup hazelnut meal", "1/4 cup sugar", "1/4 cup graham cracker crumbs", "2 teaspoons cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the dough hook attachment, combine the pumpkin purée, water, yeast, sugar, and bread flour. Knead until the dough becomes smooth and elastic, 7 to 10 minutes. Add the salt and butter and continue kneading until the butter is completely incorporated into the dough, a few minutes longer. Alternatively, knead by hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bowl with plastic wrap and set aside for 1 hour. The dough should have visibly risen, but it won't double in size. Flour your work surface and spray a 9-inch square pan with baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough and form it into a rough square. With a rolling pin, roll into a rough 10- by 8-inch rectangle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the hazelnut meal, sugar, graham cracker crumbs, and cinnamon. Spread this mixture evenly over the top of the dough, leaving about 1/2 inch uncovered on one of the long sides. Starting from the other long side, roll the dough up loosely, and when you reach the uncovered edge, seal the seam by pinching it together. If there are any sections of the dough that are fatter, roll it gently so the whole roll is approximately the same diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the roll into nine even pieces. Place the pieces, cut side down, in the pan. The filling is quite loose and will want to come out as you lift the pieces. The easiest way to move them without losing a lot of filling is to flip the pieces onto a large dough scraper and move the to the pan and slide them off. When you've moved all nine pieces to the pan, scoop up any of the filling that's left on the counter and sprinkle it over the buns. Cover the pan with plastic wrap or put it in a large plastic bag and close the bag. Refrigerate overnight or up to 24 hours</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready to bake, remove the pan from the refrigerator and let it rest on the counter while you preheat the oven to 350 degrees. Remove the plastic wrap (or remove the pan from the plastic bag) and bake at 350&deg;F until the buns are nicely browned, about 40 minutes. If you're not sure if the buns are done, you can take the dough's temperature&mdash;it should be about 200&deg;F, but make sure you're checking the temperature of the dough and not the sugar filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the pan cool on a rack. Drizzle the buns with a sugar icing, if desired (powdered sugar and just a bit of water to reach a drizzling consistency).</p>"}]}