{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2012/11/20121128-231802-buttermilk-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["buttermilk", "buttermilk pie", "pie crust", "pie of the week", "pies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Double-Crusted Buttermilk Pie", "link": "https://www.seriouseats.com/recipes/2013/01/double-crust-buttermilk-custard-pie-recipe.html", "description": "This take on the classic buttermilk pie features the addition of a top crust, for those of you who like extra crispy textures with your creamy, nutmeg-scented, buttermilk filling.", "totalTime": "4 hours", "recipeYield": "serves 8", "recipeCategory": ["Pies, Tarts, and Crumbles", "Thanksgiving"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One recipe Easy Pie Dough</a>, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan", "8 ounces granulated sugar", "3 tablespoons all purpose flour", "13 ounces buttermilk", "3 egg yolks", "2 eggs", "4 tablespoons melted butter, just warm to the touch", "1 tablespoon vanilla extract", "1/2 teaspoon cinnamon", "1 teaspoon freshly grated nutmeg (or more if you'd like)", "1/2 teaspoon salt", "Egg wash: 1 egg beaten with 1 large pinch of salt", "Optional: sanding sugar for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together sugar and flour and set aside. In a large bowl, whisk to combine buttermilk, yolks, whole eggs, butter, vanilla, cinnamon, nutmeg, and salt. Add the sugar mixture slowly, whisking as you go, until the mixture is smooth and even.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into the chilled, rested pie shell. Cut a small circle in the center of the rolled, rested top crust. Place the top crust over the pie, taking care to stretch the dough across the surface and not allowing it to sink down into the filling. Seal the pie edges and flute them if desired. Chill the pie for 30 minutes in the fridge. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pie is chilling, adjust oven rack to lower position and preheat oven to 425°F. Place the pie in the center of the rack and bake for 15 minutes, then lower the oven temperature to 350°F and bake for 35-40 additional minutes, until the center jiggles. If you'd like a little additional color on the top of the pie, move the rack to the center for the last ten minutes of baking, which will encourage browning. Allow the pie to cool completely before serving, or cool to room temperature and then place in the fridge. Best if consumed within 24 hours of baking.</p>"}]}