{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130831-huevos-rancheros-breakfast-tacos-recipe-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["breakfast", "egg", "huevo ranchero", "Latin American", "Mexican", "tortilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Huevos Rancheros Verdes (Fried Eggs With Green Salsa and Refried Beans)", "link": "https://www.seriouseats.com/recipes/2013/09/huevos-rancheros-recipe.html", "description": "Traditional huevos rancheros with refried black beans and a green salsa.", "totalTime": "45 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Father's Day", "Latin American", "Latin Cuisine", "Mexican", "Mother's Day", "Vegetarian"], "recipeIngredient": ["<strong>For the Salsa Verde</strong> (see note):", "1 poblano or Hatch chili", "4 medium tomatillos, split in half", "1 white onion, thinly sliced (about 1 cup)", "2 tablespoon vegetable oil", "4 medium cloves garlic, thinly sliced", "2 teaspoons ground cumin", "1/2 cup roughly chopped cilantro leaves, plus more for garnish", "2 limes, divided", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Beans</strong> (see note):", "1 (15 ounce) can black or pinto beans, drained and rinsed", "1 bay leaf", " ", "<strong>To Serve</strong>:", "6 soft corn tortillas", "6 eggs", "1 avocado, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salsa Verde</strong>: Preheat broiler or toaster oven broiler to high. Place tomatillos cut side down on a foil-lined rimmed baking sheet along with poblano or Hatch chili. Broil until chili is blackened on one side, about 10 minute. Flip chili and continue broiling until blackened on second side, about 6 minutes longer. Transfer vegetables to a small bowl and cover tightly with foil. Let steam for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, set aside 1/4 cup onion for garnish. Heat 1 tablespoon oil in a medium saucepan over medium heat until shimmering. Add remaining onion and garlic and cook, stirring occasionally, until softened but not browned, about 4 minutes. Add cumin and cook, stirring, until fragrant, about 30 seconds. Remove from heat and transfer half of mixture to the bowl of a blender, food processor, or blending cup of a hand blender. (Leave remaining onions and garlic in the pot).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully peel chili (the skin should slip right off) and remove seeds. Add chili, tomatillos, cilantro, and 1 tablespoon juice from 1 lime to onion/garlic mixture in the blender. Blend until a rough puree is formed, adding water as necessary to thin to a sauce-like consistency. Season to taste with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beans:</strong> Add beans, 1/2 cup of water, and bay leaf to pot with remaining onion and garlic mixture. Cook, stirring occasionally, until simmering. Mash beans with a potato masher or with a hand blender until a chunky, thick consistency is reached. Season to taste with salt and pepper, cover, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve</strong>: Heat a large non-stick or cast iron skillet over medium-high heat until hot. Working one or two tortillas at a time, dip tortilla in a bowl of cold water, place in skillet and cook without moving until lightly charred on first side, about 1 minute. Flip and cook on second side for 30 seconds. Transfer to a clean towel placed on top of a plate and fold towel around tortilla. Repeat with remaining tortillas, stacking them in the towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, place tortillas on warm serving platter or individual plates. Spread each tortilla with beans. Add remaining tablespoon oil to skillet and heat until shimmering. Add eggs and cook without moving until whites are set but yolk is still runny, about 3 minutes. Season to taste with salt and pepper. Transfer 1 egg to each tortillas and add salsa. Sprinkle with remaining onion slices and cilantro. Cut remaining lime into wedges. Serve eggs with lime wedges and avocado slices.</p>"}]}