{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130930-one-pot-wonders-fish-hash.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["chard", "easy", "fish", "potato", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Steamed Fish With Chard and Potato Hash", "link": "https://www.seriouseats.com/recipes/2013/10/steamed-fish-chard-potato-hash-recipe.html", "description": "Tender cod fillets steamed over a potato and Swiss chard hash, all in a single skillet.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Fish", "Mains", "One-Pot Wonders", "Potato"], "recipeIngredient": ["2 1/2 tablespoons olive oil", "4 medium russet potatoes, cut into 1/2-inch cubes (about 3 cups)", "Kosher salt and freshly ground black pepper", "1 medium yellow onion, roughly chopped (about 1 cup)", "1 bunch rainbow or Swiss chard, stems removed and roughly chopped, leaves cut into 1-inch ribbons (about 4 cups, leaves and stems kept separate)", "Pinch of dried red chili flakes", "3/4 cup homemade or store-bought low sodium chicken stock", "4 cod fillets", "2 tablespoons fresh juice from 1 lemon", "½ cup roughly chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 12-inch skillet over medium-high heat until shimmering. Add the potatoes, season with salt and pepper, and stir, making sure nothing sticks to the bottom of the pan, until they begin to color, 3 to 4 minutes. Add the onions, chard stems, and red chile flakes, and season with salt and pepper. If onions or chard begin to stick, add two tablespoons of chicken stock and continue cooking. Cook until the onions have softened, about 3 minutes longer. Add the remaining stock and fold in the chard leaves until slightly wilted, stirring to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season fish with salt and pepper. Lower the heat to medium and carefully place the fish fillets on top of the hash, cover, and cook until the fish has cooked through and flakes with pulled with a fork, 3 to 5 minutes. Sprinkle with lemon juice and parsley. Transfer to serving plates and serve immediately.</p>"}]}