{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130416-grilled-cheese-variations-2-16.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cheese", "grilled cheese", "ham", "ham sandwiches", "pineapple", "quick", "swiss cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Cheese With Roasted Pineapple, Ham, and Swiss", "link": "https://www.seriouseats.com/recipes/2013/04/grilled-cheese-roasted-pineappl-ham-swiss-recipe.html", "description": "A classic grilled cheese sandwich with roasted pineapple and ham.", "totalTime": "", "recipeYield": "", "recipeCategory": ["Cheese", "Ham", "Pineapple", "Sandwiches"], "recipeIngredient": ["3 tablespoons butter", "2 (1/2-inch thick) slices pineapple, about 2- by 4-inches each", "2 slices ham", "2 slices hearty white bread, such as Pepperidge Farm or Arnold, or 2 slices hearty French or Italian bread", "2 slices Swiss cheese", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablepsoon butter in a 10-inch nonstick skillet over medium heat until foaming subsides. Add pineapple slices and cook, swirling pan occasionally, until softened and lightly browned, about 5 minutes total. Remove from skillet and set aside. Add ham and cook until lightly browned, about 3 minutes. Remove from skillet and set aside. Wipe out skillet with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 teaspoons of butter in the skillet over medium heat until foaming subsides. Add both bread slices and cook, swirling occasionally, until pale golden brown on bottom side, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a cutting board toasted-side-up. Place one cheese slice on top of one slice of bread. Top with pinapple, ham, and second cheese slice. Close sandwich, with both toasted sides facing inwards.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 more teaspoons of butter in the skillet and reduce heat to medium low. Add sandwich and cook, swirling occasionally, until deep, even golden brown, about 5 minutes. Remove sandwich using a flexible metal spatula. Add the remaining 2 teaspoons butter. Return sandwich to skillet cooked-side up. Season with salt. Cook, swirling occasionally, until second side is deep, even golden brown and cheese is thoroughly melted, about 5 minutes. Serve immediately.</p>"}]}