{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/010113-235485-sparkling-jell-o-mold.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "boozy desserts", "fruit desserts", "Jell-O", "light desserts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sparkling Jell-O Mold", "link": "https://www.seriouseats.com/recipes/2013/01/sparkling-jell-o-mold-recipe.html", "description": "Jell-O molds can be as clever and sophisticated as you can imagine. This mold shuns dyes and artificial flavorings to focus on booze and fruit, geling prosecco with white cranberry juice, a bit of sugar and raspberries for a light and refreshing treat. And honestly, what better way to kick off the New Year than with booze &amp; fruit?", "totalTime": "4 hours or up to overnight", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Puddings and Custards"], "recipeIngredient": ["3 tablespoons (3 envelopes) unflavored gelatin powder", "1 cup cold white cranberry juice", "2 cups boiling water", "1/2 cup granulated sugar", " 2 cups cold champagne or prosecco", "6 ounces fresh raspberries (about 1 pint)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle gelatin over cold juice in a large bowl and let stand until gelatin is hydrated, about 1 minute. Add boiling water and stir until gelatin completely dissolves. Stir in the sugar, then slowly stir in champagne or prosecco. Carefully skim any foam off the top with a large spoon and discard. Transfer to refrigerator. Chill until thickened but not set (the gelatin should still be jiggly, not entirely firm), 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon in enough of the gelatin mixture to just cover the bottom of a 7 cup mold. Fold raspberries into the remaining gelatin mixture then spoon into the mold. Chill until completely firm, at least two additional hours or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Before serving dip the mold into warm water for no more than 10 seconds to help release. Place a large serving platter upside-down over the mold. Holding both the mold and the platter firmly, invert. Gently shake mold to release Jell-O. Serve immediately.</p>"}]}