{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130726-lemon-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["ice cream", "lemon", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Lemon Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/07/lemon-ice-cream-with-candied-lemon-recipe.html", "description": "Sweet and tart, light and creamy, more than a little like lemon meringue pie. If you've only ever had lemon <a href=\"http://www.seriouseats.com/recipes/2012/03/rich-tart-lemon-sorbet-recipe.html\">sorbet</a>, give lemon ice cream a chance.", "totalTime": "2 hours, plus an overnight chill", "recipeYield": "makes 1 1/2 quarts", "recipeCategory": ["Ice Cream and Frozen Treats", "Lemon", "Scooped"], "recipeIngredient": ["<strong>For lemon ice cream:</strong>", "6 egg yolks", "1 cup sugar", "2 cups heavy cream", "1 cup half and half", "3/4 cup lemon juice from 6 to 8 lemons", "Grated zest of 2 lemons", "1 teaspoon kosher salt", " ", "<strong>For candied lemons:</strong>", "2 lemons, sliced about 1/8\" thick and finely chopped, seeds removed", "1 cup water", "1 cup sugar", "2 tablespoons corn syrup, glucose, or agave nectar", "1/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For ice cream:</strong> In a medium, heavy-bottomed saucepan, whisk together egg yolks and sugar until well combined. Slowly whisk in cream and half and half until fully incorporated. Put on stove on medium heat and cook, stirring frequently, until a custard forms on the back of a spoon and a finger swiped across it leaves a clean line, 5 to 7 minutes. Strain into an airtight container and stir in lemon juice, zest, and salt to taste. Cover and chill overnight in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, strain base into ice cream maker to remove zest and churn according to manufacturer's instructions. In last minute of churning, add candied lemons if using (procedure below). Transfer ice cream to an airtight container and let chill in freezer for 5 to 6 hours before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the candied lemons:</strong> Start candying the lemons once you finish making the lemon custard base and chill it in the refrigerator. Set two pots on stove with 1 quart of water in each and bring to a boil. Set a colander or large strainer in the sink. While waiting for water to boil, slice, chop, and seed lemons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add lemons to one pot and cook for 20 seconds, then drain lemons into colander in sink and immediately rinse with very cold water until no longer hot. Fill up pot again and bring to a boil. Meanwhile, cook lemons in second pot for another 20 seconds, then drain into colander and rinse again until cool. Repeat this process with the freshly boiled water from the first pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put rinsed lemons in an empty pot and add 1 cup fresh water, sugar, corn syrup, and salt. Heat on medium heat, stirring to dissolve sugar, until syrup reaches a bare simmer, then reduce heat to low and cook until lemons are soft and begin to turn translucent, about 20 minutes. Remove from heat and transfer syrup and lemons to an airtight container, then chill overnight. Candied lemons will keep for several weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While ice cream is churning, drain syrup away from candied lemons, reserving for another use. Stir lemons in during last minute of churning.</p>"}]}