{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/2013_1_28_237769_preserved_cara_cara_marmalade_primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["blondies", "cara cara orange", "orange marmalade", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cara Cara Orange Marmalade Blondies with Chocolate Chips", "link": "https://www.seriouseats.com/recipes/2013/02/orange-marmalade-blondies-with-chocolate-chips-recipe.html", "description": "A little tired of your go-to brownie recipe? Try these quick and easy blondies studded with chocolate chips and pockets of gooey orange marmalade. I make them with Cara Cara Orange Marmalade, but you can also use store-bought.", "totalTime": "50 minutes", "recipeYield": "makes 9 large blondies", "recipeCategory": ["Brownies and Bars", "Desserts", "Fruit Desserts", "Preserved"], "recipeIngredient": ["Nonstick cooking spray", "1 cup plus 2 tablespoons (about 5 1/2 ounces) all purpose flour, plus more for dusting pan", "1 teaspoon baking powder", "1/4 teaspoon salt", "1/4 pound (1 stick) unsalted butter, room temperature", "1 cup (about 9 ounces) packed light brown sugar", "1 large egg", "1/2 teaspoon vanilla extract", "2 tablespoons freshly squeezed orange juice from 1 orange", "3/4 cup chocolate chips", "1/3 cup <a href=\"http://www.seriouseats.com/recipes/2013/02/cara-cara-orange-marmalade-recipe.html\">Cara Cara orange marmalade</a>, or storebought orange marmalade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat it to 350ºF. Line an 8- by 8-inch baking pan with parchment paper. Spray the pan with nonstick spray, dust with flour, and tap out the excess. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, baking powder, and salt in a medium bowl. In a large bowl, beat the butter and sugar with an electric mixer until light and fluffy, 2 to 3 minutes. Beat in the egg, vanilla extract, and orange juice. Gradually beat in the flour mixture just until combined. Stir in the chocolate chips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan and smooth it to the edges. Drop spoonfuls of the jam over the surface of the batter and then gently swirl them in with a knife. Bake the blondies until they are puffed and golden and a toothpick inserted in the center comes out with a few moist crumbs attached, 30 to 35 minutes. Cool the blondies completely in the pan on a wire rack, then cut them into squares. Blondies can be stored in a sealed container at room temperature for up to 3 days.</p>"}]}