{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131215-btb-grappapinenuttorte.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["cake", "chocolate", "currant", "grappa", "pine nut", "Seriously Bittersweet", "Torte"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grappa, Currant, and Pine Nut Torte", "link": "https://www.seriouseats.com/recipes/2013/12/grappa-currant-and-pine-nut-torte.html", "description": "This torte's delicate, crackly top belies a soft, chocolate core. Grappa gives a boozy flourish, and currants and pine nuts provide a pleasant textural contrast.", "totalTime": "1 hour", "recipeYield": "serves 16 to 18", "recipeCategory": ["Bake the Book", "Cakes", "Chocolate", "Desserts", "Nuts"], "recipeIngredient": ["1/4 cup grappa", "1/3 cup (1 2/3 ounces/50 grams) dried currants", "1/4 cup (1 ounce/35 grams) blanched or unblanched whole almonds", "1/4 cup (40 grams) semolina flour", "9 ounces (255 grams) 70% to 72% chocolate, coarsely chopped (see Chocolate Notes)", "14 tablespoons (200 grams/1 3/4 sticks) unsalted butter, cut into pieces", "6 large eggs, separated", "1 cup (200 grams) sugar", "1/8 teaspoon salt", "1/4 teaspoon cream of tartar", "3 tablespoons (20 grams) pine nuts", "Powdered sugar for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the lower third of the oven and preheat the oven to 375°F. Unless you are planning to serve the cake on the pan bottom, line the bottom of the cake pan with a circle of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the grappa and currants. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, pulse the almonds and semolina flour until the almonds are very finely ground. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate and butter in a large heatproof bowl in a wide skillet of barely simmering water and stir occasionally until nearly melted. Remove from the heat and stir until melted and smooth. Or microwave on Medium (50%) power for 2 1/2 to 3 minutes. Stir until completely melted and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk the egg yolks with 2/3 cup (133 grams) of the sugar and the salt until pale and thick. Stir in the warm chocolate mixture and the grappa and currants. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large clean, dry bowl, beat the egg whites and cream of tartar with an electric mixer at medium speed until white and foamy. Gradually sprinkle in the remaining 1/3 cup (67 grams) sugar, beating at high speed until almost stiff. Scrape about one-quarter of the egg whites onto the chocolate mixture, sprinkle all of the almond mixture over the top, and fold together. Fold in the remaining whites. Scrape the batter into the prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the top with the pine nuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 20 to 25 minutes or until a toothpick inserted into the cake about 1 1/2 inches from the edge comes out clean. The center of the cake should still jiggle slightly when the pan is jostled and still be gooey if tested. Set the cake on a rack to cool completely; the surface of the cake will crack and fall as it cools. (The cooled cake can be covered tightly, or removed from the pan and wrapped well, and stored at room temperature for 2 to 3 days or frozen for up to 3 months. Bring to room temperature before serving.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, slide a slim knife around the sides of the cake to loosen the cake. Remove the pan sides and transfer the cake, on the pan bottom, to a platter, or invert the cake onto a rack or tray, remove the bottom and the paper liner, and invert onto a platter. Using a fine-mesh strainer, sift a little powdered sugar over the top of the cake before serving, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Notes:</strong> <br />\nYou can use any chocolate from 54% to 72% here, but the higher end of the range balances the grappa. If you serve the torte warm—which is an especially voluptuous experience—be prepared for it to be very boozy. As the torte cools and ages overnight, the chocolate flavor becomes richer and more intense—and the booze recedes.</p>\n\n<p>If you use a chocolate at the low end of the cacao range, bake a day ahead of serving so the chocolate is not overwhelmed by the grappa, or use less grappa. Note that the torte made with chocolate at the low end of the range may require up to 10 minutes longer in the oven before it tests done. </p>"}]}