{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130128-baked-ziti-primary.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "Italian", "keywords": ["One Pot Wonder", "pasta", "quick", "skillet suppers", "tomato sauce", "ziti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Skillet Baked Ziti", "link": "https://www.seriouseats.com/recipes/2013/01/skillet-baked-ziti-recipe.html", "description": "All the flavor of a classic baked ziti with tomato sauce and cheese, but in a single skillet, start to finish.", "totalTime": "45 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Italian", "One-Pot Wonders", "Pasta"], "recipeIngredient": ["1 tablespoon olive oil", "3 medium cloves garlic, minced or grated with a microplane (about 1 tablepoon)", "1 teaspoon dried red chili flakes", "1 (28-ounce) can whole peeled tomatoes", "Kosher salt and freshly ground black pepper", "1 ½ cup homemade or store-bought low sodium chicken broth", "3 cups uncooked penne or ziti", "½ cup grated Parmesan cheese", "1 cup shredded mozzarella", "½ cup picked fresh basil leaves, cut into strips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and treheat the oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in an oven-safe 12-inch skillet over medium-high heat until shimmering. Add the garlic and chili flakes and cook, stirring constantly, until fragrant but not browned, about 30 seconds. Add the tomatoes and a pinch salt and reduce the heat to maintain a gentle simmer, breaking up the tomatoes with a potato masher as they soften until the sauce has thickened, about 10 minutes. Add broth and bring to a gentle simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta and cover. Raise the heat to medium, making sure there are active and vigorous bubbles. cook, stirring occasionally to make sure the pasta isn’t sticking and cook until the pasta is just firm, following package directions for timing (12 to 15 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid, season to taste with salt and pepper, stir in the parmesan, and spread the mozzarella on top (a few stray chunks of mozzarella never hurt). Transfer to oven and bake until cheese has melted and is starting to brown, 8 to 10 minutes. Top with basil and serve.  </p>"}]}