{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130101-235760-cran-apple-nut-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["apple", "cranberry", "frangipane", "pie", "pie of the week", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Apple Nut Tart", "link": "https://www.seriouseats.com/recipes/2013/01/cranberry-apple-nut-frangipane-tart-recipe.html", "description": "This updated take on a classic includes apples and cranberries for a nice tart zing and a sweet and crumbly tart crust made even more delicious with the addition of toasted pecans. It's the perfect little finish to any winter meal.", "totalTime": "8 hours", "recipeYield": "serves 8", "recipeCategory": ["Apple", "Christmas", "Cranberry", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["For The Tart Dough:", "3/4 cup whole pecans, lightly toasted and cooled", "3/4 cup confectioner's sugar", "3/4 cup butter, room temperature", "3 egg yolks", "1 1/4 cups all purpose flour", "1/2 teaspoon kosher salt", " ", "For The Filling:", "5 apples, peeled, cored, and cut into 1/8th inch pieces", "1/2 cup almond paste, room temperature", "2 tablespoons butter, room temperature", "1 cup granulated sugar, divided, plus additional sugar for sprinkling", "Pinch of salt", "1 egg", "1 cup whole fresh cranberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pecans and confectioner's sugar in the bowl of a food processor, fitted with a blade and pulse for 20 seconds, until the pecans are broken into a uniform, mealy consistency. Set aside. In the bowl of a stand mixer fitted with a paddle attachment, beat butter to a smooth, light consistency. Add the pecan mixture and mix on medium speed until the butter and pecan mixture are completely combined. Add the egg yolks and mix until completely combined. Add the flour and salt and mix on low speed until completely incorporated, taking care not to overmix. Form the dough into a disk shape and wrap tightly with plastic wrap. Chill in the fridge for at least 2 hours (overnight is ideal).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough has chilled, unwrap it, place it on a floured surface, and roll it out into a 1/4 inch thick circle (this dough is very tender and delicate, if it crumbles a bit, do not worry, you can use scraps to patch it up in the pan). Transfer the dough to a 12 inch circular tart pan with a removable bottom. Puree with your fingertips to shape the dough, and to fill in any holes with patches of dough. Allow the edges of the dough to extend just slightly higher than the tart pan walls (you can trim these back after chilling) and chill for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 10 minutes. Remove weights and liner, turn pie, and bake until the bottom crust just begins to puff slightly, about 10 minutes more. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the apple slices in a large, heatproof bowl. Bring 2 quarts of water to a boil and pour the water over the apples. Allow them to sit for 2 minutes, then pour the apples through a strainer to drain. Shake the apples in the strainer repeatedly to expel all excess water. Allow the apples to cool and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a mixer fitted with a paddle attachment, combine the almond paste, butter, 1/2 cup granulated sugar, and pinch of salt. Mix on medium speed until it forms a smooth paste. Add the egg and mix until combined. Smooth the frangipane over the bottom of the tart shell. In a medium bowl, toss the cranberries and blanched apples with the remaining 1/2 cup of sugar. The cranberries will settle to the bottom of the bowl. Scoop them out and press them into the frangipane in the tart shell. Arrange the apple slices in a fanned style over the top. Sprinkle with sugar. Bake at 350°F centered on the middle rack of the oven for 20 minutes, then turn and bake for an additional 20-25, until the frangipane puffs up around the apples. Allow the tart to cool completely before serving.</p>"}]}