{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130314-anna-pbj-bars.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["bar cookies", "from the pastry dungeon", "jelly", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peanut Butter Jelly Bars", "link": "https://www.seriouseats.com/recipes/2013/03/peanut-butter-jelly-bars-recipe.html", "description": "Moist, chewy, and nostalgic, these bars appeal to just about everyone.", "totalTime": "3 to 5 hours", "recipeYield": "makes 9 to 12 pieces", "recipeCategory": ["Brownies and Bars", "Nuts", "Very Small Anna"], "recipeIngredient": ["<strong>For the Jelly</strong>:", "1 pound Concord grapes", "1 cup sugar, divided", "1 1/2 teaspoon lemon juice from 1 lemon", " ", "<strong>For the Bars</strong>:", "1/2 cup (1 stick) unsalted butter, melted and cooled", "3/4 cup white sugar", "3/4 cup plus 1 tablespoon (about 7 ounces) dark brown sugar ", "2 eggs", "4 teaspoons vanilla", "1 cup (about 8 ounces) smooth peanut butter", "1 1/2 cups (about 7 1/2 ounces) all-purpose flour", "1 teaspoon baking powder", "1 teaspoon salt", "1/2 cup roasted unsalted peanuts, roughly chopped", "1 cup grape jelly"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Jelly</strong>: Gently squeeze the grapes from their skins, placing the grapes into a large saucepan or a large-bottomed pot. Place skins into a blender with half the sugar and blend roughly, then add to pot along with rest of sugar and lemon juice. Place over medium heat and gently boil for about ten minutes to dissolve sugar and soften grapes, stirring often. Scrape into blender and blend thoroughly, then force back into pot through fine-meshed strainer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small white plate in freezer. Return mixture to a simmer and cook, stirring constantly, until thick, 10 to 15 minutes. Test for doneness by dropping a bit of the jam onto frozen plate and freezing for one minute, then poking. If runny, keep cooking, testing every 2 minutes or so until set. Immediately remove from pot and scrape into a medium mixing bowl, then chill over ice bath or in refrigerator. Store in an airtight container for up to 2 weeks once chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bars</strong>: Place a rack in the center of the oven and preheat oven to 350&deg;F. If you want thick cakey bars, butter and flour an 8- by 8-inch baking dish; for thinner, quicker bars, butter a 9- by 13-inch baking sheet. Line baking sheets with parchment paper, leaving an overhang at both ends. Set prepared pan aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk butter with sugars until fully combined. Whisk in eggs, followed by vanilla and peanut butter. Combine flour, baking powder, and peanuts in a medium bowl and whisk to combine. Fold dry ingredients into batter, then spread evenly into prepared pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For an even chevron pattern, put jelly into a piping bag or plastic bag and cut the tip, then pipe several thin lines fairly close together on surface of batter. Drag a paring knife across the lines, alternating directions. For random swirls, spoon blobs of jelly evenly on surface of batter and swirl with paring knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For a shallow pan, bake 20-30 minutes, turning once halfway through baking. For the smaller, deeper pan, you'll need to bake for at least an hour, turning every 20 minutes. Bars are fully baked when a skewer or paring knife inserted in center comes out with only a few crumbs, which should not be wet but will still be sticky. Allow to cool completely before removing. For faster removal and neater slicing, place in refrigerator to chill for at least 2 hours or overnight. To slice shallow bars, lift out of pan by parchment overhang and place on cutting board. Cut with a clean chef's knife. For thicker bars, flip onto a cutting board, then invert and slice with a clean chef's knife.</p>"}]}