{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130206-240062-valentines-day-souffle.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["quick", "souffle", "Valentine's Day", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Valentine's Day White Chocolate Soufflé", "link": "https://www.seriouseats.com/recipes/2013/02/valentines-day-white-chocolate-souffle-recipe.html", "description": "This white chocolate soufflé is swirled with a touch of red, making it a perfect Valentine's Day treat for two (or four!).", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chocolate", "Desserts"], "recipeIngredient": ["4 tablespoons softened unsalted butter, for greasing", "3 tablespoons red sugar", "6 ounces white chocolate, chopped", "3 egg yolks, beaten, at room temperature", "6 egg whites, at room temperature", "1/4 cup sugar", "6 drops red food coloring", "Powdered sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set an oven rack to the middle of the oven and preheat to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry brush or paper towel, heavily butter the entire insides of all four ramekins, making sure to get every nook and cranny. Divide the red sugar equally among all the ramekins, rotating them to coat the entire inside with sugar. Gently tap out any excess sugar and set the ramekins at least 1 inch apart on a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a pot with 2-inches of water and set to boil over medium heat. When the water is at a simmer, turn off the heat. Add the white chocolate to a metal mixing bowl that will fit snuggly into the pot, and set the bowl into the pot. Stir the chocolate until it is completely melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir egg yolks into chocolate and beat quickly to mix. The mixture will stiffen and may look grainy, which is fine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With an electric mixer or stand mixer, beat the egg whites until foamy. Sprinkle in sugar, continuing to beat just until the white reach stiff peaks. Stir one quarter of the beaten egg whites into the chocolate and mix thoroughly. Gently fold in the remaining whites just until no streaks of white remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the soufflé batter in half. To one half add 6 drops of red food coloring and fold gently until the red is somewhat dispersed into the batter. Do not flatten the egg whites by overmixing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill each ramekin one quarter of the way full with white batter, then fill another quarter with red batter, to the halfway point. Add another layer of white batter, filling to the 3/4 point, and top off with red batter, filling the ramekins to the rim. Use a butter knife to carefully drag through the batter, creating a swirl effect.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until puffed and barely set, about 16 minutes. Remove from oven, sprinkle the tops with powdered sugar, and serve immediately. </p>"}]}