{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130411-247962-CoconutChicken.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["asparagus", "cabbage", "chicken", "coconut", "make ahead", "string beans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Coconut-Poached Chicken with Spring Vegetables and Cashews", "link": "https://www.seriouseats.com/recipes/2013/04/make-ahead-coconut-poached-chicken-spring-vegetables-cashews-recipe.html", "description": "Chicken poached in coconut milk and chicken stock becomes amazingly tender. The rest of this salad is all crunch: napa cabbage, cashews, and blanched asparagus and green beans, dressed in a simple soy vinaigrette.", "totalTime": "25 minutes", "recipeYield": "serves 2", "recipeCategory": ["Asparagus", "Cabbage", "Chicken", "Coconut", "Lunch Box", "Mains", "Salads"], "recipeIngredient": ["1 (15-ounce) can lite coconut milk", "1 cup homemade or store-bought low-sodium chicken stock", "2 boneless skinless chicken breasts (about 12 ounces total)", "Kosher salt and freshly ground pepper", "5 ounces string beans, trimmed", "1/2 bunch asparagus, woody stems removed, peeled, halved crosswise", "4 teaspoons soy sauce", "2 teaspoons rice wine or brown rice vinegar", "1 small head napa (or savoy) cabbage, leaves shredded or sliced", "1/4 cup roasted cashews, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring pot of salted water to a boil. Bring separate large pot with stock and coconut milk to a simmer. Sprinkle chicken with salt and pepper; add to simmering milk and stock. Chicken should be half way to two-thirds submerged. Cook for 6 minutes on one side over medium heat, then flip, and cook until chicken registers 145° to 150°F on an instant read thermometer, about 8 minutes longer. Cover the pot if the liquid is reducing too much. Let cool slightly, then shred meat with two forks into large chunks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, blanch string beans and asparagus in boiling salted water until just bright green, 30 seconds to 1 minute. Drain and run under cold water. Whisk together soy sauce and vinegar. Toss together cabbage, beans and asparagus and chicken with soy dressing. Scatter cashews over top. Transfer to an airtight container until ready to eat. </p>"}]}