{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131106-272126-cook-the-book-green-curry-fish-balls-eggplant.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["andy ricker", "Cook the Book", "curry", "eggplant", "pok pok", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andy Ricker's Kaeng Khiaw Waan Luuk Chin Plaa (Green Curry With Fish Balls and Eggplant) From 'Pok Pok'", "link": "https://www.seriouseats.com/recipes/2013/11/andy-rickers-kaeng-khiaw-waan-luuk-chin-plaa.html", "description": "Green curry was the first Thai food I remember eating. My parents would make it with jarred curry paste, coconut milk, green beans, potatoes, and chicken--I trust many of you are familiar with this meal. I loved this curry, and in fact still make it occasionally when the craving strikes. The green curry in <em><a href=\"https://www.starchefs.com/cook/chefs/bio/andy-ricker\">Andy Ricker's</a></em> <em><a href=\"http://www.amazon.com/Pok-Stories-Roadside-Restaurants-Thailand/dp/1607742888/?tag=serieats-20\">Pok Pok</a></em> cookbook is nothing like that curry.", "totalTime": "1 1/2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Cook the Book", "Eggplant", "Mains", "Other Seafood", "Thai"], "recipeIngredient": ["<strong>Curry Paste</strong>", "1 1/2 teaspoons coriander seeds", "1/4 teaspoon cumin seeds", "1/4 teaspoon yellow mustard seeds", "1/4 teaspoon freshly ground black pepper", "3 grams cilantro roots, thinly sliced", "1 teaspoon kosher salt", "14 grams thinly sliced lemongrass (tender parts only), from about 2 large stalks", "1 (14-gram) piece peeled fresh or frozen (not defrosted) galangal, thinly sliced against the grain", "1 teaspoon finely grated zest from fresh or frozen kaffir lime (if you must, you can skip the zest and add 2 extra kaffir lime leaves later on)", "1 1/4 ounces fresh green Thai chiles or fresh green serrano chiles, thinly sliced", "1 ounce peeled garlic cloves, halved lengthwise", "1 1/2 ounces peeled Asian shallots, thinly sliced against the grain", "1 tablespoon <a href=\"http://www.seriouseats.com/recipes/2013/11/andy-rickers-kapi-kung-homemade-shrimp-paste.html\">Kapi Kung (Homemade shrimp paste)</a>", "&nbsp", "<strong>Curry</strong>", "2 cups unsweetened coconut cream (preferably boxed)", "2 ounces palm sugar, coarsely chopped", "4 cups unsweetened coconut milk (preferably boxed)", "36 fresh or defrosted frozen fish balls", "6 Thai apple eggplants (green and golf ball–size)", "6 or so fresh or frozen kaffir lime leaves", "2 leafy Thai basil sprigs", "1 tablespoon plus 1 teaspoon Thai fish sauce", "6 to 18 fresh green Thai chiles, halved lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the paste:</strong> Combine the coriander, cumin, and mustard seeds in a small pan and set the pan over medium-low heat. Cook, stirring and tossing often, until the spices are very fragrant and the coriander seeds turn a shade or two darker, about 8 minutes. Let the spices cool slightly and pound them, along them with the pepper, in a granite mortar (or grind them in a spice grinder) to a fine powder. Scoop the powder into a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pound the cilantro roots and salt in a granite mortar to a fibrous paste, about 30 seconds. Add the lemongrass and pound to a fibrous paste, about 1 minute. Do the same with the galangal (1 minute), then the lime zest (1 minute), then the chiles (4 minutes), then the garlic (4 minutes), then the shallots (4 minutes), and finally, the shrimp paste (1 minute), fully pounding each ingredient before moving on to the next and stirring occasionally with a spoon. You’ll have a smooth, slightly fibrous paste. Finally, pound the spice powder into the paste until it’s well incorporated, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You’ll have about 9 tablespoons of paste. You can use it right away, or store the paste in the fridge for up to 1 week or in the freezer for up to 6 months. You’ll need about 6 tablespoons of paste for 6 portions of curry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook the curry:</strong> Pour 1/2 cup of the coconut cream into a medium pot or a wok and set it over high heat. Bring the cream to a boil, stirring often, then immediately decrease the heat to maintain a steady simmer. Cook, stirring occasionally, until the cream has reduced by about half and “breaks”—it’ll look like curdled milk—anywhere from 3 to 10 minutes, depending on the brand of coconut cream. What you’re doing as you simmer is cooking off the water in the cream so you’re left with some white-ish solids but primarily the translucent fat, which you’ll use to fry the curry paste. Patience is essential here. (If for some reason it doesn’t crack after 10 minutes, add a tablespoon of vegetable oil, but know that the curry will be oilier than it should be.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decrease the heat to medium-low, add 6 tablespoons of the curry paste, and stir well. Take a careful sniff. You’ll smell the raw shallots and garlic. Cook, stirring frequently, until garlic and shallots in the paste no longer smell raw and the paste has turned a shade or two darker, 6 to 8 minutes. Knowing when it’s done takes experience, but as long as you’re cooking it at a low sizzle, the curry will taste great.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the palm sugar and cook, stirring often and breaking up the sugar once it softens, until the sugar has more or less fully melted, about 2 minutes. Add the remaining coconut cream, the coconut milk, and the fish balls. You’ll notice that the curry is not even close to emerald green but rather a khaki color. That’s what it’s supposed to look like. Have a taste and consider adding, gradually, more of the curry paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the heat to high, bring the mixture to a simmer (don’t let it boil), then decrease the heat to maintain a gentle simmer. Stem and quarter the eggplants, add them to the curry, and cook until they’re tender but still crunchy, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Twist the lime leaves to bruise and break them slightly and add them to the curry with the Thai basil sprigs, fish sauce, and enough of the chiles to make the curry quite spicy. Stir well and turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the pot and let the curry sit for at least 10 minutes or up to an hour (either way, remove the basil sprigs after 10 minutes). It tastes best served slightly warmer than room temperature. The oil that rises to the surface is a good sign, not a bad one.</p>"}]}