{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130415-peppered-goat-cheese-scones-primary.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["from the pastry dungeon", "goat cheese", "scones"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peppered Goat Cheese Scones", "link": "https://www.seriouseats.com/recipes/2013/04/peppered-goat-cheese-scones-recipe.html", "description": "Tangy chevre, along with a blend of finely ground peppercorns, make this scone a zippy, savory breakfast treat that pairs well with virtually any jam, jelly or marmalade.", "totalTime": "2 to 12 hours", "recipeYield": "makes 8 scones", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Very Small Anna"], "recipeIngredient": ["2 cups (10 ounces) all-purpose flour", "2 tablespoons sugar", "1/2 teaspoon salt", "1 tablespoon baking powder", "1/2 teaspoon baking soda", "2 teaspoons freshly ground mixed black, white and pink peppercorns, plus more for dusting", "4 ounces (1 stick) unsalted butter, in 1/2-inch cubes, frozen", "6 ounces chevre, in 1/2-inch cubes, frozen", "3/4 cup (6 ounces) buttermilk, plus more for brushing", "1 egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, sugar, salt, baking powder, baking soda, and pepper in a medium mixing bowl. Add butter and chevre and cut or rub into dry ingredients until the largest pieces are roughly the size of peas. If your kitchen is very warm and the butter and cheese begin to get soft, freeze for a few minutes to firm them back up. Whisk together buttermilk and egg, then add to dry mixture and gently work in with a flexible spatula or plastic bowl scraper. Scrape onto a lightly floured surface and sprinkle with more flour, then fold the left and right thirds over the middle of the dough. Pat into a circle a little over an inch thick and slide onto a parchment-lined baking sheet, then use a bench scraper or knife to cut into eight equal wedges. Wrap baking sheet and freeze until solid, at least an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake scones, set a rack in center of oven and preheat oven to 400&deg;F. Remove scones from freezer and allow to thaw slightly before re-cutting wedges. At this point you can separate all the wedges and place any that you want to save for later in a freezer bag. Place any scones you will be baking immediately onto a parchment or silicone-lined baking sheet an inch apart. Brush tops lightly with buttermilk and sprinkle with pepper mixture. Bake for 10 minutes, then turn and bake for another 5 minutes. Lower oven to 350&deg;F and bake for another 5 minutes. Allow to cool slightly before eating, but eat while they're still quite warm.</p>"}]}