{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130228-very-small-anna-carrot-cake-ice-cream-sandwich.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["cream cheese", "ice cream", "ice cream sandwich", "very small anna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Carrot Cake Ice Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/03/carrot-cake-ice-cream-sandwiches-recipe.html", "description": "This cream cheese semifreddo is so airy from the whipped eggs and so creamy from the cream cheese that it's scoopably soft straight from the freezer, and the carrot cake is so moist that it thaws almost immediately upon removal from the freezer.", "totalTime": "2 days", "recipeYield": "Makes 8 sandwiches", "recipeCategory": ["Ice Cream and Frozen Treats", "Very Small Anna"], "recipeIngredient": ["<strong>For the Cake</strong>:", "1 cup (5 ounces) all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon cinnamon", "1/2 teaspoon allspice", "1/4 teaspoon salt", "2 eggs", "1/2 cup plus 2 tablespoons vegetable oil", "1/2 cup (3 1/2 ounces) sugar", "2/3 cup (about 6 ounces) dark brown sugar", "1/4 cup (2 ounces) buttermilk", "1 1/2 cups (about 5 ounces) finely grated carrot", " ", "<strong>For the Semifreddo</strong>", "3 eggs, separated", "1/2 cup (3 1/2 ounces)  sugar, divided", "3/4 teaspoon vanilla extract", "8 ounces cream cheese", "Pinch salt", "1/4 cup golden raisins", "1/4 cup chopped toasted pecans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake</strong>: Place a rack in the middle of the oven and preheat to 350&deg;F. Butter and flour a standard-sized loaf pan, set aside. Combine flour, baking powder, baking soda, cinnamon, allspice and salt in a medium mixing bowl and whisk or sift to combine, set aside. Place eggs in bowl of a stand mixer fitted with whisk attachment or a medium mixing bowl if using a handheld mixer.  Whip on highest speed until light and fluffy, about 5 minutes. Lower speed slightly and slowly drizzle in oil. Lower speed to medium and gradually add sugars, return to highest speed to break up any chunks of brown sugar. Lower mixer speed to medium and drizzle in buttermilk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn mixer off and add dry mixture all at once, then mix on medium-low speed until just combined, about 30 seconds. Turn mixer off and fold in carrot, then scrape into prepared pan. Bake for 30 minutes, then turn and bake until a skewer or paring knife inserted in center comes out clean, 25 to 30 minutes longer. Cake will be very soft. Remove from oven and allow to cool in pan for 5 to 10 minutes, then run a paring knife around edge of pan and invert onto a parchment-lined pan to cool. Once cooled to room temperature, wrap in plastic and freeze at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cake is frozen solid, trim one end with a serrated knife. sixteen 3/8th-inch thick slices and store lightly wrapped in freezer until ready to assemble sandwiches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Semifreddo</strong>: Line a loaf pan with plastic wrap, set aside. In the bowl of a stand mixer fitted with a whisk attachment, combine egg yolks, 1/4 cup of the sugar, and vanilla extract. Whip on high speed until thick and ribbony. With mixer running on low, gradually add the cream cheese, thoroughly incorporating between each addition. Transfer to a medium mixing bowl and thoroughly clean and dry your bowl and whip attachment before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place egg whites and salt in stand mixer bowl. Whip on second to highest setting until foamy, then slowly pour in remaining 1/4 cup sugar and turn to highest setting, whipping to shiny, stiff peaks. Fold half of meringue into cream cheese mixture, then scrape cheese mixture into remaining meringue and carefully fold until smooth. Mixture should still be very airy and ribbony. Quickly and gently fold in raisins and nuts, then scrape into prepared pan and cover surface lightly with plastic wrap. Freeze at least 8 hours or overnight, until frozen solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble</strong>: Remove surface layer of plastic wrap from semifreddo. Have a large plate or cutting board ready. Run a trickle of warm water from the faucet and hold the semifreddo sideways. Being careful not to get water in the pan, carefully but quickly run the pan under the water, then invert semifreddo onto plate or board. If not ready to assemble sandwiches, leave plastic on semifreddo and keep in freezer until ready. Remove plastic and use a warm knife to trim one sloping end off, then cut into eight 3/4 inch slices, wiping the knife with a warm damp towel between cuts. Trim to 2 inches tall if your semifreddo came out particularly tall. Sandwich each piece of semifreddo between two pieces of cake and wrap individually in plastic. Store in freezer for up to 2 weeks.</p>"}]}