{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130827-gnocchi-parisian-souffle-27.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["corn", "gnocchi", "parisian gnocchi", "pasta", "pastry", "pate a choux", "summer", "tomato", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Parisian Gnocchi With Roasted Cherry Tomatoes, Corn, and Zucchini", "link": "https://www.seriouseats.com/recipes/2013/09/parisian-gnocchi-roasted-cherry-tomato-corn-zucchini-food-lab-recipe.html", "description": "A perfect end-of-summer meal with light and airy Parisian-style gnocchi crisped in olive oil and served with oven-roasted cherry tomatoes, zucchini, and sweet corn.", "totalTime": "30 minutes (plus 45 minutes to make gnocchi)", "recipeYield": "Serves 4", "recipeCategory": ["Corn", "Mains", "Pasta", "The Food Lab", "Tomato", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 pint cherry tomatoes, each tomato split in half", "5 tablespoons extra-virgin olive oil", "1 medium clove garlic, minced (about 1 teaspoon)", "Kosher salt and freshly ground black pepper", "1 cup fresh corn kernels (from about 1 large ear of corn)", "1 small zucchini, split in half lengthwise and cut into 1/4-inch half moons", "1 small summer squash, split in half lengthwise and cut into 1/4-inch half moons", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/09/parisian-gnocchi-recipe.html\">Parisian Gnocchi</a>", "2 tablespoon chopped fresh parsley leaves", "2 tablespoons finely chopped chives", "1/4 freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 300°F. Toss cherry tomatoes in a large bowl with 1 tablespoon olive oil and garlic. Season to taste with salt and pepper. Transfer to a foil-lined rimmed baking sheet and roast until tomatoes are tender and softened, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 1 tablespoon oil in a large non-stick or cast iron skillet over high heat until lightly smoking. Add corn, season to taste with salt and pepper, and cook, tossing occasionally, until well-browned, about 5 minutes total. Transfer to a large plate and set aside. Wipe out skillet with a paper towel and return to high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tablespoon oil to now-empty skillet and heat until lightly smoking. Add zucchini and squash and cook, tossing occasionally, until well-browned, about 4 minutes total. Transfer to another large plate and set aside. Wipe out skillet with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When tomatoes have finished roasting, remove from oven and set aside. Heat remaining 2 tablespoons olive oil in now-empty skillet over high heat until lightly smoking. Add gnocchi and cook, tossing occasionally, until well-browned on all sides, about 6 minutes total. Add corn, zucchini, squash, tomatoes, and herbs to pan and toss to combine. Transfer to a serving platter or individual plates, top with grated Parmesan cheese, and serve.</p>"}]}