{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/091113-265552-cook-the-book-caramelized-onion-bayley-hazen-blue-galette.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "galette", "onion", "pastry", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Caramelized Onion and Bayley Hazen Blue Galette from 'The Vermont Farm Table Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/09/caramelized-onion-bayley-hazen-blue-galette-recipe-from-vermont-farm-table-cookbook.html", "description": "If there's one thing that Vermont is known for (other than maple syrup), it's cheese. And one of the biggest names in the Green Mountain cheese game is <strong><a href=\"http://www.cellarsatjasperhill.com/index.php?option=com_content&amp;view=category&amp;layout=blog&amp;id=30&amp;Itemid=136\" target=\"_blank\">Jasper Hill Farm</a></strong>. Their famously fudgy <a href=\"http://www.cellarsatjasperhill.com/pos/Sellsheets/bayley%20hazen.pdf\" target=\"_blank\">Bayley Hazen Blue</a> gets a starring role in this caramelized onion galette&mdash;its complex grassy and peppery notes truly shine atop buttery pastry and sweet, soft caramelized onions.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Cook the Book", "Onion", "Sides", "Vegetarian"], "recipeIngredient": ["1 1/4 cups all-purpose flour", "8 tablespoons (4 ounces) salted butter, cut into pieces and chilled", "1/4 cup crème fraiche", "1/4 cup ice water, plus extra as needed", "2 tablespoons olive oil or bacon fat", "4 medium yellow onions, peeled and thinly sliced", "Pinch granulated sugar", "2 garlic cloves, minced", "1/2 teaspoon finely chopped fresh rosemary or thyme", "5 ounces blue cheese, preferably Bayley Hazen Blue Cheese, crumbled (1 1/4 cups)", "1 large egg yolk, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour in a large bowl. Cut in the butter with a pastry cutter, two butter knives, or with your fingers, until the mixture begins to form pea-sized pieces. Combine the crème fraiche and ice water and add in a steady stream while mixing the dough with your fingertips. If necessary, add a bit more water until the dough holds together, but do not over mix. Turn the dough out onto a clean, floured work surface and form into a ball. Wrap in plastic wrap or waxed paper and refrigerate for at least 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the oven to 400 degrees. Heat the oil in a large skillet over medium heat. Add the onions and sugar and cook for 2 minutes. Reduce the heat to medium-low and continue to cook, stirring frequently, until the onions are soft and golden, 35 to 40 minutes. Add the garlic and rosemary and cook for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a floured work surface, roll the dough out into a 13-inch round. Transfer the dough to an ungreased baking sheet. Evenly spread the onion mixture over the dough, leaving a 1 1/2- inch border. Evenly sprinkle the cheese over the top. Fold the border over the filling, pleating the edges as you go around. The center will be open. Brush the crust with the beaten egg yolk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the galette until the crust is golden brown and the cheese is sizzling, about 30 minutes. Remove from the oven and let cool for 5 minutes before cutting and serving.</p>"}]}