{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/021313-240750-SundaySupper-Roast-Chicken-Creamed-KaleB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["blue cheese", "chicken", "kale", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Thyme-Roasted Chicken With Blue Cheese, Hazelnuts And Creamed Kale", "link": "https://www.seriouseats.com/recipes/2013/02/thyme-roasted-chicken-blue-cheese-hazelnuts-cream-recipe.html", "description": "Full-flavored thyme-lemon roast chicken is finished with hazelnuts, blue cheese, and pan gravy, with creamed kale alongside.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4", "recipeCategory": ["Cheese", "Chicken", "Kale", "Mains", "Sunday Supper"], "recipeIngredient": ["1 large whole chicken (5 to 6 pounds total)", "2 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "2 tablespoons minced fresh thyme", "1 tablespoon grated zest and 2 tablespoons juice from 1 lemon", "2 pounds kale, tough stalks removed", "1 small white onion, minced (about 3/4 cup)", "1 medium garlic clove, minced (about 1 teaspoon)", "1 cup heavy cream", "1 teaspoon onion powder", "1/8 teaspoon crushed red pepper flakes", "1/4 cup grated Parmesan", "1/2 cup dry white wine", "1 cup homemade or store-bought low sodium chicken broth", "6 tablespoons unsalted butter, divided", "2 ounces crumbled blue cheese", "1/4 cup chopped hazelnuts, lightly toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 400&deg;F. Brush the outside of chicken with olive oil. Season with salt, pepper, thyme and lemon zest. Drizzle with lemon juice. Place chicken in a roasting pan and transfer to the oven to cook, basting periodically.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken cooks, bring a large pot of salted to a boil. Add kale and cook until barely tender but still bright green, about 3 minutes. Drain kale, rinse under cold water, and cut into ribbons. Melt remaining 4 tablespoons butter in a large skillet over medium heat. Add the onion and garlic cook until softened, 5 to 7 minutes. Add the kale, heavy cream, onion powder, and pepper flakes. Season with salt and pepper. Reduce heat to low and simmer for 4 minutes. Add Parmesan and cook until cream has reduced and thickened, about 1 minute longer. Cover and keep warm while chicken finishes cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chicken is done cooking when a thermometer inserted into thickest part of thigh registers 175&deg;F, 1 to 1 1/2 hours total. Transfer to a cutting board and allow to rest for 15 minutes. Place roasting pan on stove top over medium-high heat and add wine and stock. Bring to a boil, scraping browned bits off of bottom. Lower heat to a simmer and cook until reduced to 1 cup, about 10 minutes. Remove from heat and whisk in remaining 2 tablespoons butter. Taste and adjust seasonings if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve chicken, drizzle with sauce, and sprinkle with hazelnuts and blue cheese. Serve immediately with additional gravy and creamed kale. </p>"}]}