{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/080513-261661-cook-the-book-clemenceaud-shrimp.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "gulf shrimp", "lemon butter sauce", "lolis eric elie", "mushrooms", "roast potatoes", "shrimp clemenceau", "snap peas", "treme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Clemenceau'd Shrimp from 'Treme'", "link": "https://www.seriouseats.com/recipes/2013/08/clemenceaud-shrimp-from-treme.html", "description": "Shrimp Clemenceau is a New Orleans classic that appears on the menus of the old-school restaurants like <strong><a href=\"http://www.dookychaserestaurant.com/\">Dooky Chase</a></strong> and <strong><a href=\"http://www.galatoires.com/\">Galatoire's</a></strong>. The big, juicy gulf shrimp are tossed with potatoes, mushrooms, and peas, and then topped with a rich lemon-butter sauce.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Cook the Book", "Gluten-Free", "Legumes", "Mains", "Mushrooms", "Shrimp"], "recipeIngredient": ["18 large or 24 medium Gulf shrimp, heads intact", "1 1/2 pounds baby new potatoes, preferably some combination of red, white, yellow, and purple", "4 ounces enoki or cremini mushrooms, wiped clean", "1/4 cup extra-virgin olive oil", "Sea salt and freshly ground pepper", "2 fresh thyme sprigs", "6 cloves garlic, unpeeled, lightly smashed", "1 pound sugar snap peas, ends trimmed", "2 Meyer lemons", "3/4 cup (1 1/2 sticks) cold unsalted butter, cut into tablespoons", "3 tablespoons canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper. Peel and devein the shrimp, making sure to keep the heads attached. Arrange the peeled shrimp in a single layer on the prepared baking sheet, cover with plastic wrap, and keep refrigerated until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Scrub the potatoes (but do not peel), pat dry, and place them in a large mixing bowl. Add the mushrooms. Drizzle with the olive oil and season with salt and pepper. Toss gently to mix well and coat evenly with the oil. Spread them in a single layer on a large, rimmed baking sheet. Scatter the thyme sprigs and crushed garlic on top. Roast until tender, 25 to 30 minutes. (The potatoes can be made up to 1 day ahead.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium saucepan of salted water to a boil. While the water is heating, prepare an ice bath by filling a large bowl halfway with ice, then adding enough water just to cover the ice. Add the peas to the boiling water and blanch just until tender, about 2 minutes. Drain the peas and immediately plunge them into the ice bath to stop the cooking and preserve their color. Using a slotted spoon, remove them from the ice bath and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a microplane or the smallest holes on a box grater, finely grate the lemon zest. Set aside the zest. Using a sharp paring knife, remove the skins of the lemons and discard. Over a small bowl, supreme the lemons by gently cutting in between each segment to remove the flesh, letting the segments fall into the bowl as you work. Squeeze the rinds and pulp over the lemon supremes to extract any remaining juice, and discard the peels. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 1/4 cup water to boil in a small saucepan set over medium-high heat. Reduce the heat to low and whisk in the cold butter, 1 tablespoon at a time, until all the butter is melted and a fully emulsified sauce forms. Season to taste with salt. Remove from the heat and cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the potatoes were cooked ahead of time, rewarm them in a 350°F oven. Place the cooked sugar snap peas in a medium saucepan with 2 tablespoons water and heat over medium-high heat until hot. Season with salt and pepper. Spoon 2 tablespoons of the butter sauce over the peas and toss to coat. Remove from the heat and cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the tray of shrimp from the refrigerator. Divide the canola oil between 2 large nonstick skillets and heat over medium-high heat. (Alternatively, you can cook the shrimp in 1 pan but in 2 batches; what’s important is to avoid overcrowding the pan.) Season the shrimp on both sides with salt and pepper. Add the shrimp to the hot pans and sear until the shrimp start to turn opaque, 1 to 1 1/2 minutes. Turn the shrimp and continue cooking just until cooked through, 1 to 1 1/2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the potatoes and a spoonful of sugar snap peas in the center of each of six large plates, along with 3 or 4 shrimp. Stir the lemon segments, zest, and juice into the butter sauce and spoon the sauce over and around the shrimp. Serve at once.</p>"}]}