{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130130-238412-cook-the-book-black-bean-glazed-pork-spareribs.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Vietnamese", "keywords": ["black bean sauce", "Charles Phan", "Cook the Book", "rib", "spareribs", "The Slanted Door", "Vietnamese", "Vietnamese Home Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Charles Phan's Black Bean-Glazed Pork Spareribs", "link": "https://www.seriouseats.com/recipes/2013/01/charles-phans-black-bean-glazed-pork-sparerib.html", "description": "The name \"steamed ribs\" may not be particularly appealing to many of you. Perhaps this fact is why <strong><a href=\"http://charlesphan.com/index.html\">Charles Phan</a></strong> left out the adjective when naming the <strong>Black Bean-Glazed Pork Spareribs</strong> in his cookbook, <em><a href=\"http://www.amazon.com/Vietnamese-Home-Cooking-Charles-Phan/dp/1607740532/?tag=serieats-20\">Vietnamese Home Cooking</a></em>. But consider this: When cooked properly, steamed fish, dumplings, and vegetables take on a silky smooth and supple texture. Why not apply the technique to pork ribs?", "totalTime": "1 hour and 40 minutes", "recipeYield": "serves 4 to 6 as part of a multi-course meal", "recipeCategory": ["Cook the Book", "Mains", "Pork", "Vietnamese"], "recipeIngredient": ["2 pounds meaty pork spareribs, cut crosswise through the bone into 1 1/2-inch pieces (ask your butcher to do this) ", "3 tablespoons canola oil", "2 tablespoons fermented black beans ", "2 teaspoons minced garlic", "2 tablespoons light soy sauce ", "2 tablespoons rice wine ", "2 teaspoons minced fresh ginger", "1 teaspoon kosher salt ", "1 teaspoon cornstarch", "1 teaspoon sugar", "1 teaspoon freshly ground black pepper", "1/2 teaspoon red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a large ice-water bath. Bring a large pot of water to a boil. Working in small batches, add the ribs to the boiling water and blanch for 1 minute, allowing the water to return to a boil between batches. As each batch is ready, using a slotted spoon or a spider, transfer the ribs to the ice bath to stop the cooking. When cool, scoop them out into a large bowl. Add more ice to the ice bath as needed to keep it ice-cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small sauté pan, heat the oil over medium-high heat. Add the black beans and garlic and cook, stirring, for about 30 seconds, until fragrant Transfer to a small bowl, add the soy sauce, wine, ginger, salt, cornstarch, sugar, black pepper, and red pepper flakes and stir to mix well. Pour the black bean mixture over the ribs and toss well to coat evenly. Cover and let stand at room temperature for 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour water into a wok or stockpot and set the steamer in the wok or on the rim of the stockpot. Make sure the water does not touch the bottom of the steamer. Bring the water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the ribs in a large rimmed plate that will fit in your steamer basket (a glass pie plate works well). When the water is boiling, place the plate in the steamer basket, cover, and steam for 25 to 30 minutes, until the ribs are cooked through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the ribs are ready, carefully remove the plate from the steamer and serve immediately.</p>"}]}