{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/2013.05.05-Parsi-Prawn-Kebabs.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["Beyond Curry", "Indian", "seafood", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Indian Prawn Patties", "link": "https://www.seriouseats.com/recipes/2013/05/prawn-kebabs-recipe.html", "description": "They take minutes to make and seconds to polish off. Prawn patties, or <em>Kolmi Na Kavaab</em>, makes quite an impression on a dinner table and is a good dish to have in your repertoire if you're a newbie in the kitchen.", "totalTime": "25 mins total", "recipeYield": "Serves 2", "recipeCategory": ["Beyond Curry", "Indian", "Mains", "Shrimp", "Vegetarian"], "recipeIngredient": ["1/2 pound medium shrimp, shelled and deveined", "1/2 teaspoon turmeric powder", "2 teaspoons ground black pepper", "1 teaspoon cumin powder", "1 teaspoon coriander powder", "1/2 teaspoon red chilli powder", "1 tablespoon chopped fresh cilantro leaves", "1 small green chili (such as a Thai bird chili), chopped fine", "1 medium potato boiled and mashed", "1 slice bread, dipped in water and squeezed dry", "1 teaspoon Kosher salt", "1 tablespoon Worcestershire sauce ", "1 teaspoon white vinegar", "1 egg, beaten", "2 tablespoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shrimp in a food processor and pulse until finely chopped, about 10 short pulses. Alternatively, chop finely by hand. Transfer to a large bowl. Add turmeric, black pepper, cumin, coriander, red chili, cilantro, green chili, potato, bread, salt, Worcestershire sauce, vinegar, and egg. Mix with hands until well mixed. Transfer to refrigerator and allow the mixture to rest for about ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large heavy-bottomed non-stick skillet over high heat until shimmering. Lower heat to medium-low. With a tablespoon scoop out prawn mixture into hands and shape into rounds (wet your hands with some water so the mix doesn't stick). Lower gently into the hot oil, standing a little away from the pan. Fry until golden brown on both sides, about 5 minutes total, flipping occasionally. Transfer to a paper towel-lined plate to drain. Repeat until all patties are cooked. Serve immediately with coriander chutney, kachumbar (salad), or with spicy tomato sauce as a starter or with a main meal as a side. </p>"}]}