{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130224-243400-dinner-tonight-udon-bay-scallops-bok-choy-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "bok choy", "Dinner Tonight", "Japanese", "noodle", "quick", "scallops", "udon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Udon Noodles with Bay Scallops and Baby Bok Choy", "link": "https://www.seriouseats.com/recipes/2013/03/dinner-tonight-udon-noodle-bay-scallop-baby-bok-choy-recipe.html", "description": "When it comes to cooking Asian noodles, I tend to obsess over each and every ingredient or make them needlessly fussy and complex. But I'm learning to lighten up and focus on simplicity. This week I decided what I could do with the trio of bay scallops, baby bok choy, and udon noodles.", "totalTime": "15 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner Tonight", "Japanese", "Mains", "Other Seafood", "Pasta"], "recipeIngredient": ["3 tablespoons vegetable oil ", "Kosher salt and freshly ground black pepper", "1/2 pound bay scallops, dried on paper towels", "1 pound baby bok choy, ends trimmed, roughly chopped ", "1/2 cup homemade or store-bought low-sodium chicken stock", "3 tablespoons soy sauce", "1 teaspoon sesame oil", "1 teaspoon mirin (see note)", "1/2 teaspoon sugar ", "2 servings fresh or frozen udon", "Pinch togarashi (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Meanwhile, heat 2 tablespoons of oil in a 12-inch stainless steel skillet over high heat until just starting to smoke. Season scallops with salt and pepper and add half of scallops to skillet. Cook without moving until well browned on once side, about 45 seconds. Stir and continue cooking until lightly browned on remaining sides, about 30 seconds longer. Remove scallops with a slotted spoon and set aside on a plate. Reheat oil until smoking and repeat with remaining scallops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining tablespoon oil to skillet and heat over medium-high heat until shimmering. Add bok choy and stir well. Stir fry until bright green and tender, about 1 minute. Pour in stock, soy sauce, sesame oil, and mirin. Bring to a boil, and then reduce heat to low. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook udon according to directions on the packaging. Drain in a colander and immediately transfer to the skillet. Toss well and cook over medium-high heat until noodles mostly absorb the sauce, about 30 seconds. Stir in scallops and cook until barely heated through. Sprinkle with togarashi (if desired) and serve immediately.</p>"}]}