{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130722-watermelon-spoom-very-small-anna.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["from the pastry dungeon", "shrub", "spoom", "watermelon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Watermelon-Mint Shrub with Watermelon Spoom", "link": "https://www.seriouseats.com/recipes/2013/07/watermelon-three-ways-recipe.html", "description": "Shrubs have been gaining in popularity lately. An old-timey way of preserving, they generally involve fruit, sugar and vinegar, and make quite a refreshing beverage if well-balanced.", "totalTime": "2 days", "recipeYield": "makes 1 quart shrub, 1 1/2 cup mint syrup, 2-3 cups pickled rind, about 1 quart spoom", "recipeCategory": ["Fruit Desserts", "Very Small Anna", "Watermelon"], "recipeIngredient": ["<strong>For the Shrub</strong>", "3/4 cup sugar", "3/4 cup water", "3 cups puréed, strained watermelon", "2 tablespoons fresh juice from about 2 limes", "3/4 cup plus 2 tablespoons rice wine vinegar", " ", "<strong>For the Mint Syrup</strong>", "1 cup sugar", "1 cup water", "1/2 cup chopped fresh mint leaves", " ", "<strong>For the Pickled Rind</strong>", "Rind from 1/2 medium watermelon", "1 cup water", "1 cup champagne vinegar", "2 packets unsweetened watermelon Kool Aid", "1 1/2 cups sugar", " ", "<strong>For the Spoom</strong>", "3 cups watermelon purée", "2/3 cup water", "3 egg whites", "Pinch salt", "1/2 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Shrub</strong>: Combine sugar and water in small saucepan and bring to a boil. Continue boiling briefly, until all sugar crystals are dissolved. Allow to cool completely before proceeding. Combine with watermelon purée, lime, and vinegar. Skim off any foam from surface. Cover and let rest in refrigerator for at least 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mint Syrup</strong>: Combine sugar and water in small saucepan. Bring to boil and cook to dissolve sugar. Add mint, reduce heat and simmer 1 minute. Remove from heat, cover and steep 30 minutes. Strain out mint and discard. Chill syrup thoroughly before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pickled Rind</strong>: Peel the green skin from the outside of the melon rinds. Trim any remaining flesh from the inside or overly tough rind from the outside. Slice remaining rind into 1/4-inch planks. Cut into small decorative shapes with a cookie cutter or knife. Combine water, vinegar, Kool-aid, and sugar in a medium saucepan and bring to a simmer. Add watermelon and simmer for 30 minutes. Strain rind out into a heat proof container and continue simmering liquid until it reduces by about a third, around ten minutes. Pour reduced liquid over rind and allow to cool to room temperature, then cover and chill at least 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spoom</strong>: Combine watermelon purée and water. Using a stand mixer or electric handheld mixer, whip egg whites with salt on medium-high speed until foamy, then add sugar and whip on high speed until it forms glossy, firm peaks. Pour watermelon purée into meringue and fold with a whisk. Don't panic when it doesn't incorporate like most meringue-based treats, just keep mixing. Eventually you'll have a light pink, slightly fluffy thick liquid. Process in an ice cream maker according to manufacturer's instructions. Allow to firm up in the freezer in a sealed container for at least 4 hours before scooping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make a Drink</strong>: For a 10 ounce glass, mix together 1/4 cup shrub and 1 tablespoon mint syrup. Fill glass with ice and pour in shrub mixture, then top with still or sparkling water. Add a few pieces of pickled watermelon rind and stir gently with a straw. Serve with watermelon spoom.</p>"}]}