{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20120411-grilled-cheese-variations-38-thumb-600x458-232477.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["grilled cheese", "muffuletta", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Muffuletta Grilled Cheese", "link": "https://www.seriouseats.com/recipes/2013/04/grilled-cheese-muffuletta-recipe.html", "description": "A grilled cheese sandwich layered with sliced meats and olive salad.", "totalTime": "15 minutes", "recipeYield": "Makes 1 sandwich and enough olive salad for at least 4 sandwiches", "recipeCategory": ["Cheese", "Sandwiches"], "recipeIngredient": ["<strong>For the Olive Salad:</strong>", "3/4 cup pitted mixed oil-packed olives", "1 tablespoon capers", "1/4 cup chopped roasted red peppers", "2 tablespoons parsley leaves", "1/2 cup giardiniera (Italian-style pickled vegetable salad, see note)", "1 medium garlic clove, minced (about 1 teaspoon)", "1 tablespoon red wine vinegar", "3 tablespoons extra-virgin olive oil", " ", "<strong>For the Sandwich:</strong>", "2 tablespoons butter, cut into three even pieces", "2 slices hearty white bread, such as Pepperidge Farm or Arnold, or 2 slices hearty French or Italian bread", "2 slices mild Provolone cheese", "3 slices sweet soppressata", "3 slices mortadella", "3 slices hot capicola", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Olive Salad:</strong> Combine olives, capers, peppers, parsley, giardiniera, and garlic in the bowl of a food processor. Pulse to chop until no pieces larger than 1/2-inch remain. Transfer to a bowl. Add vineger and olive oil and stir to combine. For best results, let olive salad rest overnight before continuing to step 2.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sandwich:</strong> Melt one third of butter in a large non-stick skillet over medium heat until foaming subsides. Add both bread slices and cook, swirling occasionally, until pale golden brown on bottom side, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a cutting board toasted-side-up. Place one cheese slice on top of one slice of bread. Spread a layer of olive salad across bread with a spoon, then top with soppressata, mortadella, and capicola, followed by second cheese slice. Close sandwich, with both toasted sides facing inwards.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt one more piece of butter in the skillet and reduce heat to medium low. Add sandwich and cook, swirling occasionally, until deep, even golden brown, about 5 minutes. Remove sandwich using a flexible metal spatula. Add the remaining butter. Return sandwich to skillet cooked-side up. Season with salt. Cook, swirling occasionally, until second side is deep, even golden brown and cheese is thoroughly melted, about 5 minutes. Serve immediately.</p>"}]}