{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130905-bison-burgers-recipe-08.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bison", "Bison Council", "burger", "cheeseburger", "grill"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Home-Ground Bison Burgers", "link": "https://www.seriouseats.com/recipes/2013/09/home-ground-bison-burgers.html", "description": "By grinding meat fresh and handling it with care, you create a much lighter, almost fluffy patty full of internal nooks and crannies that are essential for capturing the dripping juices that can make even a lean burger taste juicy and moist.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Burger", "Mains", "Sandwiches", "The Food Lab"], "recipeIngredient": ["20 ounces (1 1/4 pounds) bison chuck, cut into 1-inch cubes", "Kosher salt and freshly ground black pepper", "4 slices cheddar, Swiss, or American cheese (if desired)", "4 hamburger buns, toasted", "Condiments as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Grind in Meat Grinder:</strong> Place meat on rimmed baking sheet or large plate, leaving a small space between each cube. Place in freezer until firm but not frozen, about 15 minutes. Meanwhile, set up meat grinder with 3/8ths inch plate. Grind meat according to manufacturer's instructions. Switch grinder to 1/4-inch plate and grind again, chilling meat in between batches in freezer if it starts to get too warm (it should remain freezing cold to the touch). Transfer ground beef to a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Grind in Food Processor:</strong> Place meat on rimmed baking sheet or large plate, leaving a small space between each cube. Place in freezer until firm but not frozen, about 15 minutes. Working in four batches, pulse meat cubes int he food processor until finely ground, about 15 short pulses. Transfer to a rimmed baking sheet</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently press ground beef into four even patties about 4-inches across, pressing until they hold together and making a slight indentation in their center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a grill to high heat. Season burgers generously with salt and black pepper. Grill, turning occasionally, until well-charred and center registers 125°F on an instant read thermometer for medium rare or 135°F for medium, adding cheese for last 30 seconds of cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to buns, top as desired, and serve.</p>"}]}