{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131220-277114-cook-the-book-cream-potato-lefse.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["amy thielen", "Cook the Book", "cream", "flatbread", "lefse", "potato", "the new midwestern table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Cream Potato Lefse From 'The New Midwestern Table'", "link": "https://www.seriouseats.com/recipes/2013/12/cream-potato-lefse-from-the-new-midwestern-table.html", "description": "<em>Lefse</em> is a Norwegian flatbread made with potatoes, cream, and a whole lot of care. Prepared and eaten at holiday gatherings, the tender bread requires finesse, experience, and many hands on deck to make properly. But, much like making homemade tortillas, the time and effort is worth it. <strong><a href=\"http://www.amythielen.com/\" target=\"_blank\">Amy Thielen</a></strong>'s recipe in <em><a href=\"http://www.amazon.com/The-New-Midwestern-Table-Heartland/dp/0307954870/?tag=serieats-20\">The New Midwestern Table</a></em> is a clear, specific, and helpful guideline for those wanting to dip their toes into <em>lefse</em> cookery.", "totalTime": "1 hour and 40 minutes, plus 3 hour to overnight rest", "recipeYield": "Makes about 36 <em>lefse</em>", "recipeCategory": ["Bread", "Cook the Book", "Potato", "Sides", "Snacks", "Vegetarian"], "recipeIngredient": ["4 large (2 1/2 pounds) russet potatoes, unpeeled", "1 cup heavy cream", "2/3 cup vegetable oil", "6 tablespoons sugar", "3 teaspoons fine sea salt", "1 3/4 cups all-purpose flour, plus more for rolling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes in a saucepan, add enough water to cover generously, and salt the water. Cover and cook at a slow simmer over medium heat until the potatoes are tender when poked with a fork, about 40 minutes. Drain, and push through a ricer into a bowl, discarding the skin. Measure 7 cups very lightly packed riced potatoes into a large bowl (save the rest for another purpose).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately add the cream, oil, sugar, and salt to the potatoes and mix until smooth. Let cool to room temperature, and then store in the refrigerator, uncovered, until very cold, at least 3 hours and preferably overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat an electric griddle to 450°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour to the potato dough and mix with a wooden spoon to combine. Scoop up a golf-ball-size ball of dough and pat it into a 3-inch-diameter round on a heavily floured surface. Roll out the <em>lefse</em>, letting the roller sit lightly in your hands so that its weight flattens the dough into a 6-inch-diameter round. Run your flat <em>lefse</em> stick (or thin spatula) underneath the dough and flip it onto the hot griddle. Cook until brown spots form on both sides, about 1 minute; you want it cooked through but still pliant enough to roll. Stack the <em>lefse</em> on a plate, and when they are cool, store the pile in a plastic bag at room temperature.</p>"}]}