{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130303-243012-bar-bites-coffee-and-chipotle-rubbed-steak-kabobs-with-stout-molasses-pan-sauce.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["bar bites", "beef", "ribeye steak", "steak", "stout", "strip steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Coffee and Chipotle-Rubbed Steak Kabobs With Stout Molasses Pan Sauce", "link": "https://www.seriouseats.com/recipes/2013/03/coffee-and-chipotle-rubbed-steak-kabobs-with-stout-molasses-pan-sauce-recipe.html", "description": "Rib eye steaks are massaged with a potent mix of ground coffee, cocoa powder, and chipotle powder before being sizzled in a hot cast-iron pan. As the steaks rest, a quick pan sauce is made from oatmeal stout, soy sauce, and molasses.", "totalTime": "45 minutes", "recipeYield": "Serves 4-6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bar Bites", "Beef", "Mains"], "recipeIngredient": ["<strong>For the rub:</strong>", "1 tablespoon ground coffee", "2 teaspoons brown sugar", "1 teaspoon unsweetened cocoa powder", "1 teaspoon chipotle powder, or other chili powder", "Kosher salt and freshly ground black pepper", "2 boneless rib eye or strip steaks, each about 1-inch thick (about 1 pound total)", "1 tablespoon canola oil", " ", "<strong>For the pan sauce:</strong>", "2 teaspoons flour", "1 cup oatmeal stout or chocolate stout beer", "1 tablespoon soy sauce", "2 teaspoons molasses"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the rub, combine the coffee, cocoa powder, sugar, chipotle powder, 1 teaspoo salt, and 1 teapsoon pepper in a small bowl. Evenly distribute the rub on all sides of the steak, making sure to rub and massage the spices into the meat. Set the meat aside for at least 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a large cast-iron pan over moderately high heat. When the oil is shimmering and nearly smoking, place the steaks in the pan and cook until brown and crusty, about 3 to 4 minutes per side. Steaks should register 125°F on an instant-read thermometer for medium-rare. Remove the steaks from the pan and rest on a cutting board for at least 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pan sauce, pour off all but 1 tablespoon of fat from the pan. Whisk the flour into the fat in the pan and cook until brown, about 1 minute. Stir in the stout, soy sauce, and molasses and continue to whisk until the sauce is reduced and thickens a bit, 3 to 5 minutes longer. Taste the sauce and season with salt and pepper. Remove the sauce from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the rested beef into 1-inch cubes and transfer to a large platter. Drizzle the warm pan sauce over the cubed steaks and serve immediately with toothpicks.</p>"}]}