{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/254726-20130611-GFTues-FlatbreadRecipes.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["bread", "flatbread", "gluten free", "gluten free tuesdays", "quick", "quick breads"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Skillet Flatbread", "link": "https://www.seriouseats.com/recipes/2013/06/gluten-free-skillet-flatbread-recipe.html", "description": "If you're in the mood for bread but it's too hot to turn on the oven, then I've got the perfect recipe for you. Hearty but delicate, this versatile flatbread goes well with whatever lands on your summer table, from barbecue to the simplest garden salad. Made quickly in a hot skillet, they're an easy way to enjoy bread without waiting for it to rise. And although they may resemble \"wraps,\" they're best eaten out of hand.", "totalTime": "30 minutes", "recipeYield": "Makes 10 small breads", "recipeCategory": ["Breakfast and Brunch", "Gluten-Free", "Gluten-Free Tuesday", "Quick Bread"], "recipeIngredient": ["2 1/4 cups (9 1/4 ounces) sorghum flour (see ingredient note above)", "3/4 cup (3 ounces) tapioca starch", "1 tablespoon baking powder", "1 1/2 teaspoons salt", "1/2 teaspoon xanthan gum", "3/4 cup water, plus additional as needed", "1 large egg", "3 tablespoons olive oil, plus additional for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, whisk together sorghum flour, tapioca starch, baking powder, salt, and xanthan gum. Add water, egg, and olive oil. Stir with a wooden spoon until a stiff, but not dry, dough forms. If dough is dry, add an additional teaspoon water. Turn dough out onto a lightly floured countertop and pat dough into a ball. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut dough into ten pieces. Round into balls (lightly flour your hands to prevent dough from sticking). Generously flour your countertop and roll dough into small rounds, about five inches across.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat one teaspoon olive oil in a ten-inch cast iron skillet over high heat until lightly smoking. Two at a time, cook the bread until golden brown, about four minutes per side. Cool bread on a wire rack. This bread is best enjoyed the day it's made. </p>"}]}