{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131017-269439-cook-the-book-green-rice-with-grapes-and-pecans.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grape", "Mollie Katzen", "parsley", "pecan", "rice", "salad", "the heart of the plate", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mollie Katzen's Green Rice with Grapes and Pecans", "link": "https://www.seriouseats.com/recipes/2013/10/mollie-katzens-green-rice-with-grapes-and-pecans.html", "description": "Between the bright, lemony, parsley-filled dressing, the sweet grapes, and the crunchy pecans, it's easy to see why this green rice salad is a hit.", "totalTime": "1 hour, plus time to chill the salad", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Cook the Book", "Dairy-Free", "Gluten-Free", "Grapes", "Nuts", "Rice", "Salads", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["2 cups long-grain brown rice (plain or basmati)", "1 teaspoon minced or crushed garlic", "6 tablespoons fresh lemon juice", "1 tablespoon light-colored honey, agave nectar, or pure maple syrup", "1 teaspoon salt, or more if needed", "1/4 cup extra-virgin olive oil", "6 scallions, whites and light greens cut into 2-inch lengths", "1/2 (packed) cup fresh flat-leaf parsley, larger stems removed", "2 cups seedless grapes, halved", "Black pepper", "1 cup chopped pecans, lightly toasted, or to taste", "Lemon wedges (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large saucepan with water and bring it to a boil. Add the rice and cook, uncovered, at a gentle boil over medium heat for about 40 minutes, or until tender. (Check the water level during the cooking.) Drain thoroughly in a colander in the sink when done, then shake dry. You can help this along by patting the grains with a kitchen towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine the garlic, lemon juice, sweetener, and 1 teaspoon salt in a large bowl (a wide, shallow one, if possible) and whisk to blend. Keep whisking as you drizzle in the oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the freshly cooked, drained rice (it’s OK if it’s still hot or warm) to the dressing, mixing it in gently with a fork until completely coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the scallions in a mini food processor with the parsley, and buzz until feathery. If you don’t have a small food processor, just go at the herbs on a cutting board with a very sharp knife until finely minced.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the herbs to the rice mixture, stirring gently with a fork until well combined. (The rice will turn a lovely shade of green.) Gently stir in the grapes, then taste to adjust the salt if needed and add some black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover tightly and chill well before serving. Serve cold or at cool room temperature. Stir in the pecans shortly before serving or just sprinkle them on top. Serve with lemon wedges, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Optional enhancements:</strong><br />\r\nChopped or grated lemon zest for the top (zest the lemons before juicing) <br />\r\nUp to 1/2 cup minced fresh mint leaves added to the herbs <br />\r\nChopped apple or other fruit in addition to the grapes<br />\r\n</p>"}]}