{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131122-273951-cook-the-book-cider-braised-rabbit-with-apples-creme-fraiche.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["apple", "cider", "Cook the Book", "creme fraiche", "jonathan miles", "rabbit", "the wild chef"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Cider-Braised Rabbit With Apples and Crème Fraîche From 'The Wild Chef'", "link": "https://www.seriouseats.com/recipes/2013/11/cider-braised-rabbit-with-apples-and-creme-fraiche-from-the-wild-chef-jonathan-miles.html", "description": "For those celebrating Thanksgiving on a small scale, there's no reason to sacrifice festivity just because there are only a few seats at the table. This braised rabbit from <strong><a href=\"http://www.fieldandstream.com/\" target=\"_blank\">Jonathan Miles</a></strong>'s new cookbook, <em><a href=\"http://www.amazon.com/The-Wild-Chef-Jonathan-Miles/dp/1616285478/?tag=serieats-20\">The Wild Chef</a></em> makes for a rustic-chic dish that celebrates the fall season with a triple-punch of apples.", "totalTime": "2 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Apple", "Cook the Book", "Mains", "Other Meats"], "recipeIngredient": ["Flour for dredging", "2 rabbits, cut into serving pieces, loins reserved", "Salt and freshly ground black pepper ", "5 tablespoons (3 fl oz/80 ml) vegetable oil", "2 tablespoons unsalted butter", "2 yellow onions, halved and thinly sliced crosswise", "<em>Bouquet garni</em> of 4 Italian parsley sprigs, 4 thyme sprigs, and a bay leaf, tied together with kitchen twine", "2 tablespoons Calvados or applejack", "4 cups (32 fl oz/1 l) dry hard cider", "2 cups (16 fl oz/500 ml) chicken stock", "4 slices bacon or pancetta", "2 Granny Smith apples, peeled, cored, and quartered", "1⁄2 cup (4 fl oz/125 ml) crème fraîche or heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl, season enough flour to dredge the rabbit with salt and pepper. Coat all the rabbit pieces except the loins in the flour mixture; shake off the excess and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot or Dutch oven over medium-high heat, heat 3 tablespoons of the vegetable oil. Add the dredged rabbit and brown it nicely, 2–3 minutes per side. Transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off the fat from the pot. Add the butter and onions; reduce the heat to medium-low. Sauté until the onions are well softened, about 12 minutes. Return the meat to the pot, along with the herbs and a generous sprinkling of salt and pepper. Cook for 2 minutes, then sprinkle the Calvados over the rabbit. Ignite the Calvados with a long-necked lighter (off the stove). When the flames subside, add the cider and stock. Bring to a boil, then reduce the heat to low, cover, and simmer gently until the rabbit is tender, about 1 hour and 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a slotted spoon, remove the rabbit pieces to a platter and cover with foil. Discard the herbs. Cook the liquid over high heat until reduced by about half, about 20 minutes, occasionally skimming the surface. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As the sauce is reducing, wrap the reserved rabbit loins in the bacon, securing with toothpicks. Heat a skillet over high heat and add the remaining 2 tablespoons vegetable oil. Add the loins and cook until brown, about 4 minutes per side. Transfer to a cutting board and let rest for a few minutes before slicing thinly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the braising liquid is reduced, add the apples and cook until just tender. Gently add the crème fraîche or cream and stir to incorporate. Arrange the braised rabbit pieces and sliced loin on a platter with the apples, and top with the sauce.</p>"}]}