{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130410-kettle-pizza-baking-steel-pizza-15.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["coppa", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "New York-Style Pizza with Bacon-Cherry Pepper Relish and Coppa", "link": "https://www.seriouseats.com/recipes/2013/04/new-york-style-pizza-bacon-cherry-pepper-relish-coppa-recipe.html", "description": "New York-style pizza with a sweet and savory bacon cherry pepper relish and coppa.", "totalTime": "30 minutes (plus time to make dough and allow to rise)", "recipeYield": "Serves 4 to 6 (makes 3 pies)", "recipeCategory": ["Bacon", "Pizza"], "recipeIngredient": ["1 1/2 cups pickled cherry peppers, seeds and stems removed, roughly chopped", "1/2 pound bacon, cut into 1/2-inch pieces", "1/2 cup sugar", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">Basic New York Pizza Dough</a>, divided and risen at least 2 hours", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2010/10/new-york-style-pizza-sauce.html\">New York Pizza Sauce</a>", "1 pound grated full-fat dry mozzarella cheese (about 4 cups)", "6 ounces thinly sliced coppa", "12 to 16 basil leaves", "3 tablespoons extra-virgin olive oil", "Kosher salt", "3 ounces coarsely grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 45 minutes before baking, place a baking stone or steel on an oven rack set to the top position and preheat oven to 550°F. Place cherry peppers in the work bowl of a food processor. Pulse until finely chopped, 8 to 10 short pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat bacon in a 12-inch non-stick or cast iron skillet over medium heat. Cook, stirring, until crisp, about 8 minutes.  Add sugar and chopped cherry peppers and their juices. Cook until juices are mostly evaporated and pepper-bacon mixture has a chunky, relish-like texture, about 8 minutes. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn single dough ball out onto lightly flour surface. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough by draping over knuckles into a 12 to 14-inch circle about 1/4-inch thick. Transfer to pizza peel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread approximately 2/3 cup of sauce evenly over surface of crust, leaving 1/2 to 1-inch border along edge. Evenly spread 1/3 of mozzarella over sauce. Dot cherry pepper-bacon relish in uneven spots around the surface of the pizza. Top with sliced coppa and a few basil leaves. Drizzle with 1 tablespoon extra-virgin olive oil and sprinkle with with salt. Slide pizza onto stone or steel and bake until cheese is melted, coppa has started to crisp, and crust underbelly is spotty brown, 6 to 12 minutes total. Remove from oven with metal pizza peel, sprinkle with 1 ounce Parmesan, transfer to cutting board, slice, and serve. Repeat steps 3 and 4 with remaining ingredients to make 2 additional pizzas.</p>"}]}