{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131123-274810-pumpkin-roll.1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["cake", "chocoholic", "holiday", "roll cake", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Roll With White Chocolate Cream Cheese", "link": "https://www.seriouseats.com/recipes/2013/12/pumpkin-roll-with-white-chocolate-cream-chees.html", "description": "Creamy white chocolate lemon cream cheese fills a moist spiced pumpkin cake.  The pretty presentation makes it perfect for the holidays.", "totalTime": "4 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Cakes", "Chocolate", "Pumpkin", "Thanksgiving"], "recipeIngredient": ["2 large eggs", "2/3 cup (4 2/3 ounces) granulated sugar", "1/4 teaspoon salt", "1/2 cup plus 1 tablespoon pumpkin puree", "1/2 cup (2 1/2 ounces) all-purpose flour", "1/2 plus 1/8 teaspoon baking powder", "1 1/2 teaspoons ground cinnamon", "1/2 plus 1/8 teaspoon teaspoon ground ginger", "1/4 plus 1/8 teaspoon ground nutmeg", "8 ounces cream cheese, softened", "3/4 cup (3 ounces) confectioners' sugar, plus extra for dusting", "2 tablespoons (1 ounce) unsalted butter, softened", "1 teaspoon juice and 1 teaspoon zest from 1 lemon ", "4 ounces white chocolate, melted and slightly cooled, plus extra for shavings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375&deg;F. Line 9- by 13-inch sheet pan with parchment paper. In mixer fitted with whip attachment, whip eggs on medium high speed until frothy. Slowly add sugar and increase speed to high. Whip until thick and lemon colored, about 5 minutes. Whip in salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from mixer and begin to fold in pumpkin. When not completely combined, sift flour, baking powder, cinnamon, ginger, and nutmeg into the bowl. Continue to fold in until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread into pan and bake until just set, about 15 minutes. Run knife along edges of cake to loosen. Let cool in pan 10 minutes, then gently slide paper and cake onto cooling rack to cool completely, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat cream cheese, confectioners' sugar, and butter on mixer fitted with paddle on medium speed until light and fluffy, about 2 minutes. Beat in lemon juice and zest. Remove from mixer and fold in melted chocolate. If loose, chill until just thick enough to spread (but still soft).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cake (with paper still attached) to work surface. Spread cream cheese filling evenly over cake, keeping within about 1/2-inch on all sides. Starting from short end, gently roll up cake into a tight roll, carefully peeling back paper as you go. Chill to set, at least 2 hours (see note). When ready to serve, transfer to serving plate and trim ends. Top with white chocolate shavings (see note) and confectioners' sugar.</p>"}]}