{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130525-252350-sunday-brunch-braised-bacon-smoked-paprika-pancakes.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["pancakes", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Bacon with Smoked Paprika Pancakes", "link": "https://www.seriouseats.com/recipes/2013/05/sunday-brunch-braised-bacon-paprika-pancakes-recipe.html", "description": "If you really think about bacon, it's basically smoked and cured pork belly. And in my mind, pork belly makes for a really excellent braise. It may seem counterintuitive to braise bacon instead of slicing it and serving it crisp, but after trying it on some savory pancakes with a few sliced scallions and some chili sauce, you'll be looking at the brunch staple in a whole new way.", "totalTime": "2 hours 40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Pancake"], "recipeIngredient": ["2 teaspoons vegetable oil, divided", "1 1/4 pounds slab bacon, rind removed", "1 medium onion finely sliced (about 1 cup)", "1 small bunch thyme", "2 1/2 cups homemade or store-bought low sodium chicken stock", "1 cup all-purpose flour", "1 tablespoon sugar", "2 teaspoons baking powder", "1 teaspoon salt", "2 teaspoons smoked paprika", "3/4 cup milk", "3 tablespoons butter, melted, divided", "2 eggs, beaten", "Sliced scallions, to garnish", "Chili sauce, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bacon</strong>: Adjust oven rack to middle position and preheat to 325&deg;.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Score the fat on the bacon in 1/2 inch cross hatch pattern. Heat vegetable oil in a dutch oven over medium high heat until shimmering. Add bacon, fat side down. Cook until fat begins to render and crisp, about 5 minutes. Flip and cook until underside of bacon is brown, about 4 minutes. Remove fro dutch oven and reserve. Add onions to pan and cook, stirring, until softened, about 4 minutes. Add thyme. Place slab bacon on top of onions and add stock. Bring to a simmer, cover, and place in the oven. Cook until the bacon yields when a knife is inserted in the center, about 2 hours. Remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the bacon rest on a cutting board, and strain the cooking liquid. Reserve the liquid and discard onions and thyme.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pancakes</strong>: Lower the oven to 200[&deg;] and place a lined baking sheet in the oven. Whisk together flour, sugar, baking powder, salt, and smoked papika. In a separate bowl whisk together milk, 2 tablespoons melted butter and beaten eggs. Whisk the wet ingredients into the dry ingredients until a smooth lumpless batter forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large non-stick skillet melt the remaining butter. Add batter to pan by the scant 1/4 cup to form small pancakes. Cook until bubbles begin to form on surface, about 2 minutes. Flip and cook until second side is browned, about 2 minutes longer. Place cooked pancakes on a rack set in a rimmed baking sheet in the oven and repeat with remaining batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all the pancakes are cooked wipe out the non-stick skillet and place it back over medium high heat with remaining teaspoon vegetable oil. When the oil is shimmering add the bacon fat side down and cook until the fat has crisped, about 4 minutes. Slice the bacon and place on a platter with the pancakes. Spoon a tablespoon of the reserved cooking liquid over the bacon and garnish with scallions and chili sauce. Serve immediately.<br />\r\n</p>"}]}