{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130223-240802-sunday-brunch-homemade-breakfast-sausage-edit.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["breakfast", "breakfast sausage", "brunch", "pork", "sausage", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Garlicky Breakfast Sausage", "link": "https://www.seriouseats.com/recipes/2013/02/homemade-breakfast-sausage-recipe.html", "description": "Even if you have a minimal amount of equipment in your kitchen, it's possible to make great breakfast sausage that will take a plain old egg sandwich to something really spectacular.", "totalTime": "12 hours", "recipeYield": "Makes 2 pounds of sausage", "recipeCategory": ["Breakfast and Brunch", "Mother's Day", "Pork"], "recipeIngredient": ["1 teaspoon yellow mustard seeds", "2 pounds pork shoulder with at least 20% fat, cut into rough 1-inch chunks (or 2 pounds ground pork, see note)", ".6 ounces kosher salt (see note)", "1 tablespoon brown sugar", "1 teaspoon freshly ground black pepper", "1 medium clove garlic, minced (about 1 teaspoon)", "2 teaspoons finely chopped fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat mustard seeds over high heat in a dry skillet until they begin to smell toasted, about 3 minutes. Transfer to a mortar and pestle or spice grinder and process until fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all ingredients in a large bowl and toss to coat. Cover and refrigerate for at least 8 hours and up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using pre-ground pork, skip to step 4. If using chunked pork, place feed shaft, screw, blade, and 1/4-inch plate of a meat grinder in the freezer for at least 2 hours. Grind sausage meat according to manufacturer's directions into the bowl of a stand mixer or a large bowl. If finer texture is desired, chill meat in freezer for 15 minutes before grinding again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle attachment, beat the sausage meat on medium high speed until it becomes tacky and sticky, about one minute. Alternatively, knead by hand for three to four minutes. Transfer to a zipper-lock bag and seal. Sausage will keep for up to 1 week in the refrigerator. Form into patties for breakfast sandwiches, or use your imagination to incorporate it into lots of delicious brunch dishes.</p>"}]}