{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/042313-249100-cook-the-book-roasted-stuffed-artichokes.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "lemon", "louisa shafia", "mint", "ricotta", "saffron", "stuffed artichokes", "the new persian kitchen", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Roasted Stuffed Artichokes with Mint Oil from 'The New Persian Kitchen'", "link": "https://www.seriouseats.com/recipes/2013/04/roasted-stuffed-artichokes-with-mint-oil-from.html", "description": "It took me a long time to come around to the prickly artichoke. For the longest time, this vegetable seemed like too much work for too little food--there's peeling, scraping, poking, and snipping involved in most preparations. But in the last few years, I've come to appreciate the slow process as well as the slight grassy sweetness of the heart and the meditative undertaking of eating the flesh off the tiny leaves. <strong><a href=\"http://lucidfood.com/about-louisa/\">Louisa Shafia's</a></strong> stuffed artichokes recipe in <em><a href=\"http://www.amazon.com/The-Persian-Kitchen-Louisa-Shafia/dp/1607743574/?tag=serieats-20\">The New Persian Kitchen</a></em> adds another couple layers of greatness to the humble artichoke. To the center she adds a subtly fragrant and fluffy ricotta, egg, and saffron filling that puffs and browns over a long slow roasting time. Drizzled atop is a brilliant mixture of lemon juice, dried mint, and grape seed oil that permeates the delicate leaves a reduced sauce in the pan perfect for greedy dipping and slurping.", "totalTime": "about 2 hours", "recipeYield": "serves 2", "recipeCategory": ["Cheese", "Cook the Book", "Gluten-Free", "Lemon", "Mains", "Vegetarian"], "recipeIngredient": ["1 lemon", "2 globe artichokes", "1/2 cup freshly squeezed lemon juice", "1 tablespoon dried mint", "1/4 cup grapeseed oil", "1 clove garlic, finely minced", "Sea salt", "2 ounces ricotta cheese, drained", "Pinch of saffron, ground and steeped in 1 tablespoon hot water", "Grated zest of 1 lemon", "1 egg, whisked", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium bowl three-quarters full with cold water. Cut the lemon in half, squeeze the juice into the water, and throw in the rind.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice off the top third of 1 artichoke with a serrated knife, and cut off the stem to make a flat base. Pull off the small leaves around the bottom, and snip the tips of the remaining leaves with scissors. Stretch open the center of the artichoke with your thumbs, and pluck out the inner yellow leaves. Pull out the purple choke, and scrape out the fibrous hairs with a melon baller, a grapefruit spoon, or a paring knife. Place it in the lemon water to prevent browning, and repeat with the remaining artichoke.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the lemon juice with the mint, oil, and garlic. Add a pinch of salt, and set aside for a few minutes to allow the mint to soften.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the ricotta, saffron, and lemon zest in a small bowl, and season to taste with salt and pepper. Mix in the egg. Spoon the ricotta into the center of the artichokes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the artichokes in a rimmed baking dish. Pour the mint oil over the artichokes, drizzling it on the outer leaves as well as the filling. Add a splash of water to the baking dish, and cover tightly. Roast the artichokes for 1 1/2 hours, until the flesh is very tender and the ricotta is firm and doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm, topped with the pan juice. To eat an artichoke, pull off the leaves and dip the fleshy part in the pan juice. When you reach the center, cut into the ricotta and the artichoke heart with a fork.</p>"}]}