{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130617-256535-dinner-tonight-tilapia-almond-olive-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["almond", "fish", "green beans", "quick", "seafood", "tilapia"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tilapia with Toasted Almonds and Green Olives", "link": "https://www.seriouseats.com/recipes/2013/06/tilapia-with-toasted-almonds-and-geen-olives-recipe.html", "description": "I always cringe before starting a recipe where I have to make sure something adheres to fish. Instead, I took the easy way out and sprinkled on almonds at the end. That way I could focus on making sure they were properly toasted, and not on whether they were sticking to the fish or burning in the pan.", "totalTime": "20 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Fish", "Legumes", "Mains", "Nuts"], "recipeIngredient": ["1 cup whole blanched almonds, roughly chopped ", "1/2 cup green olives, pitted and thinly sliced ", "1 tablespoon Sherry vinegar", "1 teaspoon fresh juice from about 1 lemon ", "1/2 teaspoon Dijon mustard", "5 tablespoons extra-virgin olive oil, divided ", "4 (6-ounce) tilapia fillets  ", "Kosher salt and freshly ground black pepper", "1 pound green beans, ends trimmed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Meanwhile, toast almonds in a large 12-inch stainless steal skillet over medium heat until light brown. Transfer to a medium bowl and stir in sliced olives. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together Sherry vinegar, lemon juice, Dijon mustard, and 3 tablespoons olive oil in a medium bowl. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet. Heat remaining 2 tablespoons olive oil in skillet over medium-high heat until shimmering. Season fillets with salt and pepper and then add as many to the skillet as will fit in one layer. Cook until golden brown on the bottom, about 4 minutes. Flip and brown on the other side, another 4 minutes. Repeat if necessary with remaining fillets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add green beans to boiling water and cook until bright green and tender, but still slightly crunchy, 3 to 4 minutes. Drain green beans in a colander and then toss with 2 tablespoons of the vinaigrette. Taste, and add more of the vinaigrette if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve fish with green beans. Sprinkle almond and olive mixture on top, and drizzle with a little extra of the vinaigrette.  </p>"}]}