{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130506-ramp-recipes-fritata-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "brunch", "egg", "frittata", "ramps"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Puffy Ramp Frittata", "link": "https://www.seriouseats.com/recipes/2013/05/puffy-ramp-frittata-recipe.html", "description": "A quick and easy puffy ramp frittata.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mains", "Mother's Day", "Vegetarian"], "recipeIngredient": ["6 eggs, separated", "3 tablespoons minced fresh parsley, tarragon, chives, or a mix", "3 tablespoons unsalted butter, divided", "16 ramps, washed, whites sliced thinly, greens cut into 2-inch segments (see note)", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust rack to 8 inches below broiler element and preheat broiler to high. Combine egg yolks, 3 egg whites, and the herbs in large bowl and whisk until homoegnous and frothy. Heat 1 tablespoon butter in a 10-inch non-stick or cast iron skillet over medium-high heat until foaming subsides. Add ramps, season with salt and pepper, and cook, stirring frequently, until lightly browned, about 2 minutes. Add to bowl with eggs and set aside. Wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk egg whites in a large bowl until soft peaks form, about 3 minutes. Fold egg whites into beaten egg and ramp mixture. It's ok if it deflates significantly. Fold until a homogenous color is achieved. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons butter in the same skillet over medium-high heat until foaming subsides, swirling the pan as the butter melts. Add egg mixture and cook, stirring with a rubber spatula and scraping the bottom and sides until partially set, about 30 seconds. Smooth top with spatula, then transfer to the broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Broil until lightly puffed and golden brown on top, about 4 minutes. Carefully loosen frittata with a thin metal spatula until it moves freely in the skillet. Invert onto a serving plate or cutting board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice frittata and serve immediately.</p>"}]}