{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/041613-carrot-pie.JPG", "author": {"@type": "Person", "name": "Sarah Baird"}, "recipeCuisine": "", "keywords": ["carrot", "cream cheese", "mascarpone", "pie", "pie of the week", "vanilla bean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Carrot Vanilla Bean Mascarpone Pie", "link": "https://www.seriouseats.com/recipes/2013/04/carrot-vanilla-bean-mascarpone-pie-recipe.html", "description": "A carrot and mascarpone pie flavored with vanilla, pressed into a tender cream cheese crust.", "totalTime": "3 hours 10 minutes", "recipeYield": "makes one 9-inch pie", "recipeCategory": ["Pie of the Week", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Crust:</strong>", "1 1/2 cups (7 1/2 ounces) all-purpose flour", "1/8 teaspoon baking powder", "3 ounces cream cheese (chilled, cubed)", "8 tablespoons unsalted butter (chilled, cubed)", "2 tablespoons heavy cream", "1 teaspoon vanilla extract", "1 1/2 teaspoons apple cider vinegar", " ", "<strong>For the Filling:</strong>", "2 large carrots, peeled and cut into 1 inch chunks", "1 cup dark brown sugar", "2 medium eggs", "1 vanilla bean, split and scraped (seeds reserved, pod discarded)", "1 teaspoon cinnamon", "8 ounces mascarpone cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Pulse flour, salt, and baking powder in food processor until combined, about 10 short pulses. Add cream cheese and pulse until coarsely incorporated, about 8 short pulses. Add butter cubes and pulse until dough forms pea-sized balls, about 8 short pulses. Add cream, vanilla, and vinegar and continue to pulse until dough pulls away from sides, 8 to 12 short pulses. Transfer dough to a large sheet of plastic wrap and shape into a 1/4-inch thick disc. Cover with plastic wrap and refrigerator for at least 2 hours and up to three days hours. Remove from refrigerator and press into a 9-inch pie plate, using fingertips to form an even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Steam or simmer carrot pieces until completely tender, about 15 minutes. Transfer to a food processor or blender and blend until completely smooth, adding just as much water as necessary to allow it to process smoothly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350°F. Using a handheld mixer and a large bowl or a stand mixer fitted with the paddle attachment, beat carrot puree and sugar on medium speed until blended. Add eggs one at a time until each is incorporated. Add vanilla seeds, cinnamon, and mascarpone, mixing until smooth. Pour filling into prepared crust. Bake until pie is set in the middle and a toothpick inserted in the center comes out clean, about 45 minutes. Let cool 15 minutes. Slice and serve.</p>"}]}