{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130228-241976-cook-the-book-strawberry-fruit-roll-ups.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Casey Barber", "Classic Snacks Made from Scratch", "Cook the Book", "gluten free", "snacks", "strawberries", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Strawberry Fruit Roll-Ups from 'Classic Snacks Made from Scratch'", "link": "https://www.seriouseats.com/recipes/2013/02/strawberry-fruit-roll-ups-from-classic-snacks-made-from-scratch-recipe.html", "description": "I was rarely given <strong>Fruit Roll-Ups</strong> as a kid. Instead, my siblings and I were stuck with the healthier, thicker fruit leathers from the natural foods aisle. We often yearned for the pliable texture, bright color, and saccharine flavor of the decidedly fruit-less roll-ups in our friends lunch boxes. Now that I make my own food choices, I honestly prefer the more wholesome choice. Luckily, <strong><a href=\"http://www.caseybarber.com/\">Casey Barber's</a></strong> recipe for <strong>Strawberry Fruit Roll-Ups</strong> in <em><a href=\"http://www.amazon.com/Classic-Snacks-Made-Scratch-Brand-Name/dp/1612431216/?tag=serieats-20\">Classic Snacks Made from Scratch</a></em> bridges the divide.", "totalTime": "6 to 7 hours", "recipeYield": "makes 12 (5x5-inch) rolls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Dairy-Free", "Fruit Desserts", "Gluten-Free", "Snacks", "Strawberry", "Vegan", "Vegetarian"], "recipeIngredient": ["1 pound strawberries, hulled", "3/4 cup (5 1/4 ounces) granulated sugar", "1 tablespoon freshly squeezed lemon juice (from about 1/2 lemon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the strawberries in half or quarters, depending on size, and mash roughly with a potato masher in a large bowl. You should have about 2 cups mashed berries. Stir in the sugar and lemon juice and let sit at room temperature for 30 minutes to break down the berries slightly. Stir once or twice while they sit to dissolve the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the strawberries and their natural syrup into a blender and blend for 1 minute, until a smooth purée forms. Pour into a high-sided pan or Dutch oven (the wider the better, to help the liquid evaporate evenly) and bring to a low boil over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook for 20 to 25 minutes, stirring often. Visual cues are your best friend when you're cooking fruit: the liquid will foam, then clarify as the bubbles slow and the purée thickens. At the final stage, the purée will be consistently thick and almost opaque, and it will \"mound\" slightly instead of immediately seeping back when pushed across the bottom of the pan with a spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 175&deg;F. Line 2 rimmed baking sheets with parchment paper or Silpat liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the cooked fruit between the baking sheet and use an offset or silicone spatula to spread evenly into as thin and wide a rectangle as possible. The jam should be no more than 1/8 inch thick but still as evenly opaque as you can manage; thinner, more translucent spots will harden into brittle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat in the oven for 5 to 6 hours, or until the fruit feels slightly tacky but no longer sticky. The timing will depend on the humidity level; a rainy day makes for a longer set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the parchment or Silpats to wire racks and cool completely then transfer the fruit leather to sheets of waxed paper large enough to leave overhang on all sides. Use kitchen shears to cut the fruit leather from each pan into 6 (5 by 5-inch) squares. Fold the extra waxed paper over the edges before rolling so they won't fuse. Store the Roll-Ups at room temperature in an airtight container for up a week.</p>"}]}