{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131216-duck-fat-cracker-primary.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["appetizer", "cracker", "duck fat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Duck Fat Crackers", "link": "https://www.seriouseats.com/recipes/2013/12/duck-fat-crackers-recipe.html", "description": "This recipe is based on a lavash cracker recipe and when the dough is handled minimally with almost no flour added in the rolling process it results in a perfectly light, crispy cracker which is still sturdy enough to stand up to a slice of cheese perched atop it.", "totalTime": "12 hours", "recipeYield": "Makes several dozen, depending on size", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Duck", "Very Small Anna"], "recipeIngredient": ["<strong>For Dough</strong>", "1 cup milk", "Juice from 1/2 lemon", "4 cups plus 2 tablespoons all purpose flour", "1/4 cup sugar", "1 teaspoon salt", "1 teaspoon baking powder", "Zest from 1 lemon", "4 ounces duck fat", "&nbsp;", "<strong>To Finish</strong>", "1 egg yolk", "1 tablespoon water", "Flaky sea salt", "Finely ground black pepper", "Dried herbs and spices, to taste (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk and lemon juice, set aside. Combine flour, sugar, salt, and baking powder in medium mixing bowl and mix thoroughly. Add lemon zest and duck fat and cut in with pastry cutter or rub in by hand until mixture is crumbly. Add curdled milk and knead gently until smooth. Wrap tightly in plastic and refrigerate for at least 3 hours, overnight if possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rack in center of oven. Preheat oven to 400&deg;F. Use bench scraper to cut small portions of dough. Use as little flour as possible to roll out gently but evenly until very thin; almost translucent is fine but the dough should not tear. Use a sharp knife or pastry roller to cut strips, then rectangles or triangles from each strip. Lay out evenly on parchment-lined sheet trays (edges may touch but not overlap). Use a fork or very small whisk to mix together egg yolk and water, then brush gently and lightly onto crackers. Prick holes in each cracker with a fork or skewer, then season evenly with salt, pepper and whatever other seasonings you prefer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 5 minutes, then rotate pan(s) and continue baking, checking crackers every minute or so. If any appear evenly golden-brown, carefully remove to a separate sheet or cooling rack, then continue baking the rest, removing them as they finish. They take a few minutes to get going but can cook unevenly and burn very quickly so check often (if you have an oven with a glass door and interior light, you'll be at an advantage). Repeat until all crackers are baked and allow to cool fully before storing in airtight containers for up to one week.</p>\n\n<p>Do not bother trying to reuse scraps; no matter how long you rest them the crackers will be thick and possibly tough.</p>"}]}