{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131113-273557-dinner-tonight-kimchi-fried-rice-squid-poached-egg.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Korean", "keywords": ["easy", "fried rice", "kimchi", "quick", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Kimchi Fried Rice with Sautéed Squid and a Poached Egg", "link": "https://www.seriouseats.com/recipes/2013/11/kimchi-fried-rice-sauteed-squid-poached-egg-recipe.html", "description": "I realize now that I haven't been adding enough of the liquid from the kimchi jar when I make kimchi fried rice. It makes all the difference.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Fried Rice", "Korean", "Mains", "Other Seafood"], "recipeIngredient": ["2 tablespoons canola oil, divided", "1 pound squid bodies, cleaned, cut into bite-sized pieces ", "1 cup kimchi, chopped ", "1/4 cup kimchi juice ", "1/4 cup water", "1 tablespoon gochujang (optional)", "3 cups cooked white rice, at room temperature ", "2 scallions, ends trimmed, white and green parts thinly sliced and reserved separately", "1 tablespoon sesame oil ", "4 eggs ", "1 tablespoon roasted sesame seeds", "1 sheet nori, thinly sliced  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm 1 tablespoon canola oil in a large non-stick skillet over high heat. When shimmering, add the squid pieces and use a wooden spoon to spread out in one layer. Cook until browned on the bottom, 15 to 30 seconds. Stir and brown on the other side, another 15 to 30 seconds, and then turn off the heat and transfer the squid to a bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablespoon of oil in skillet over medium. Cook kimchi for a minute, and then add kimchi juice, water, gochujang (optional), rice, and white scallion slices. Stir mixture occasionally and cook until all of the liquid has evaporated, about 7 minutes. When done, turn off heat, return the squid pieces, and add the sesame oil and green scallions slices. Stir well and then divide the kimchi fried rice between four large bowls. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, poach the eggs according to <a href=\"http://www.seriouseats.com/2013/03/how-to-poach-eggs-easy-way-poached-breakfast-video.html\">Kenji’s foolproof method</a>. Set a medium-pot of water over medium heat until it reaches 180&deg;F, approximately at the point where the water starts to quiver but is not simmering. Adjust heat to low or medium-low to maintain the temperature. Crack each egg into a separate bowl. One at a time, transfer an egg to a fine mesh strainer, gently swirl it around until the excess white is removed, and then gently lower the egg into the pot and roll it into the water using the strainer. Once all the eggs are added, use a large slotted spoon to carefully move them around until they form a nice egg shape. After the whites set, about 3 1/2 to 4 minutes, remove eggs with the strainer, and transfer each one to a bowl of fried rice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top each bowl with a quarter of the sesame seeds and sliced nori. Serve immediately. </p>"}]}