{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130423-248674-chicken-risotto-primary.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "Italian", "keywords": ["chicken", "chicken dinners", "Italian", "mains", "peas", "rice", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Risotto with Lemon, Asparagus and Peas", "link": "https://www.seriouseats.com/recipes/2013/04/chicken-risotto-lemon-asparagus-peas-recipe.html", "description": "This creamy risotto starts with homemade chicken stock and fall off the bone tender chicken.", "totalTime": "2 1/2 hours", "recipeYield": "4 to 6", "recipeCategory": ["Chicken", "Chicken Dinners", "Italian", "Legumes", "Mains", "Rice"], "recipeIngredient": ["2 medium onions, divided", "1 whole small chicken, about 3 pounds", "3 stalks celery, cut into thirds", "Kosher salt and freshly ground black pepper", "8 ounces asparagus, ends trimmed, cut into 1-inch lengths", "1 cup frozen peas", "2 tablespoons olive oil", "4 tablespoons (1/2 stick) unsalted butter", "2 cups short grain rice (see note)", "1 tablespoon zest from 1 lemon", "2 ounces Parmesan cheese, grated (about 1 cup)", "1/2 cup parsley leaves, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and quarter one onion. Place chicken, celery, onion, and 2 teaspoons salt in stock pot and just cover with water (8 to 10 cups). Bring to simmer on medium heat, reduce heat to low, and gently simmer until chicken is tender and falling off the bone, about 1 hour. Transfer chicken to plate, strain broth, and return broth to pot. When chicken is cool enough to handle, remove meat from the bones and shred into bite-size pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring broth to simmer over medium heat. Add asparagus and cook until just tender, about 2 minutes. Remove asparagus with slotted spoon and set aside. Add peas and cook for 30 seconds. Remove with slotted spoon and set aside. Remove broth from heat but keep warm (you should have 6 to 8 cups broth).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop remaining onion. In Dutch oven or large saucepan, heat oil over medium heat until shimmering. Add onion and 1 teaspoon salt. Cook, stirring, until onion is soft, about 6 minutes. Stir in butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice and stir to coat. Cook, stirring, for 3 minutes. Reduce heat to low and stir in 1 cup broth. Cook, stirring, until broth is almost completely absorbed. Continue to add broth, 1 cup at a time, and stirring, until rice is tender but retains a slight bite and consistency is creamy and the consistency of thick soup, about 30 minutes. Stir water into risotto if there isn't enough chicken broth to sufficiently cook the risotto. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in peas, asparagus, chicken, lemon zest, and 1/2 teaspoon pepper. Stir in Parmesan and season to taste. Stir in parsley and serve immediately.</p>"}]}