{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131106-272644-dinner-tonight-roasted-italian-sausage-peppers-mushroom-sandwich.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Italian Sausage, Pepper, and Mushroom Sandwich", "link": "https://www.seriouseats.com/recipes/2013/11/roasted-italian-sausage-pepper-and-mushroom-s.html", "description": "Most non-grill recipes simply cook everything in a skillet, a method that can certainly lead to a tasty meal, but lacks a certain <em>something</em>. It wasn't until I thought about roasted peppers, and how great they tasted, that I finally got the idea that <em>everything</em> should go in the oven.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Meats and Poultry", "Sandwiches"], "recipeIngredient": ["4 tablespoons olive oil, divided", "4 (6-inch) Italian sausage links (preferably hot)", "kosher salt ", "8 ounces cremini mushrooms, ends removed, caps quartered", "2 medium red bell peppers, stemmed, seeded, cut into 1/4-inch thick slices", "2 medium green bell peppers, stemmed, seeded, cut into 1/4-inch thick slices", "1 medium yellow onion, sliced ", "2 garlic cloves, minced ", "1/2 teaspoon dried orgeno", "4 italian rolls ", "8 leaves fresh basil, thinly sliced ", "1 tablespoon balsamic vinegar ", "giardiniera, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower middle and upper middle positions, and preheat to 500&deg;F. Add sausage links and mushrooms to a large baking sheet, and toss with a tablespoon of oil and a pinch of salt. Add red bell peppers, green bell peppers, onion, garlic, and oregano to a second large baking sheet and toss with a tablespoon of oil and a pinch of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer both baking sheets to the oven and cook for 15 minutes. Remove baking sheet with sausages and mushrooms. Use a meat thermometer to check if the sausages are cooked through, around 140&deg;F. The mushrooms should be tender. Using a pair of tongs, stir the pepper and onion mixture. Cook until onions and peppers are tender and starting to brown, 10 to 15 minutes more. At this time, wrap Italian rolls in aluminum foil and set in the oven to warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the peppers and onions finish cooking, warm remaining two tablespoons in a large non-stick skillet over medium heat. Add sausage links, and brown on both sides, about 5 minutes total. Set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When peppers and onion are done, carefully remove pan from the oven. Transfer mixture to a large mixing bowl and add in the cooked mushrooms, fresh basil, and balsamic vinegar. Toss well and season with a pinch of salt, if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove rolls from oven and unwrap. If not already cut, slice horizontally through the roll, stopping a half-inch from the other side. Load each with an Italian sausage, a generous scoop of the pepper and onion mixture. If you need more heat, add some giardiniera. </p>"}]}