{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20120205-chickpea-fritters-mashed-avocado-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["avocado", "chickpeas", "falafel", "herb", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "5"}, "name": "Vegan Chickpea Cakes with Mashed Avocado", "link": "https://www.seriouseats.com/recipes/2013/02/vegan-chickpea-cakes-with-mashed-avocado-recipe.html", "description": "These vegan falafel-esque patties made with chickpeas and bulgur wheat have a crunchy breadcrumb and are served with mashed avocado for a rich and creamy texture.", "totalTime": "30 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Avocado", "Dairy-Free", "Legumes", "Mains", "Other Grains", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 cup bulgur wheat", "1/2 cup loosely packed parsley leaves", "1/2 cup loosely packed mint leaves", "1/2 cup loosely packed cilantro leaves", "1 medium clove garlic, roughly chopped", "1/2 teaspoon ground coriander", "1 serrano or jalapeño chili, stemmed, seeded, and roughly chopped (optional)", "1 (15 ounce) can of chickpeas, drained, rinsed, and dried on paper towels", "Kosher salt and freshly ground black pepper", "1/2 cup flour", "1/2 cup water", "1 1/2 cups vegan panko-style breadcrumbs", "1/2 cup vegetable or canola oil", "1 avocado", "1 tablespoon juice from 1 lime", "lime or lemon wedges, sliced onion, chopped cilantro, and pickles for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 cups of water to a boil over high heat. Add bulgur wheat and cook until tender, about 10 minutes. Drain carefully.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While wheat cooks, combine parsley, mint, cilantro, garlic, jalapeño and coriander in the bowl of a food processor. Pulse until finely chopped, scraping down sides as ncessary, about 10 to 12 short pulses. Add half of chickpeas and pulse until a rough puree is formed, scraping down sides as necessary, about 8 to 10 short pulses. Transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining chickpeas to food processor and pulse until roughly chopped, 4 to 6 pulses. Transfer to bowl with chickpea/herb mixture. When bulgur wheat has drained, add to bowl. Season with salt and pepper, then fold mixture together, starting with a rubber spatula, and finishing by hand when cool enough to handle. Form mixture into patties roughly 3/4-inch thicka dn 3 inches wide (you should be able to work 8 to 12 patties)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and water in a medium bowl and whisk until smooth. Place breadcrumbs in second medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one patty at a time, dip in flour mixture to coat, then transfer to breadcrumbs. Cover with breadcrumbs on all sides, then transfer to a plate. Repeat with remaining patties.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat half of oil in a large cast iron or non-stick skillet over medium-high heat until shimmering. Add half the patties in a single layer and cook, swirling pan occasionally, until golden brown on bottoms, about 2 minutes. Carefully flip and cook second side, swirling pan occasionally as they cook, about 2 minutes longer. Transfer to a plate and keep warm while you cook the remaining patties.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place avocado in a medium bowl and mash the flesh with a fork. Season with salt and add lime juice. serve fried chickpea patties with mashed avocado, sliced onions, herbs, and lime or lemon wedges.</p>"}]}