{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130124-banana-cajeta-upside-down-cake-step1.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["banana", "cake", "creme anglaise", "from the pastry dungeon", "upside-down cake", "very small anna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Banana Cajeta Upside Down Cake", "link": "https://www.seriouseats.com/recipes/2013/01/banana-cajeta-upside-down-cake-recipe.html", "description": "This cake transforms into something extra amazing after a night of chilling in the fridge. The caramel-soaked edges become chewy and addictive and the bananas melt into something akin to a glaze.", "totalTime": "1 day", "recipeYield": "serves 6 to 8", "recipeCategory": ["Banana", "Cakes", "Fruit Desserts", "Very Small Anna"], "recipeIngredient": ["<strong>For the Cake</strong>:", "3 very ripe bananas", "6 tablespoons unsalted butter (3/4 stick or 3 ounces), room temperature, plus more for brushing pan", "1 1/4 cup sugar, divided", "2 eggs", "1/2 teaspoon vanilla", "1 cup (5 ounces) all-purpose flour", "1/2 teaspoon baking powder", "1/4 teaspoon salt", "1/2 cup (about 5.5 ounces) Cajeta (see note)", " ", "<strong>For the Anglaise</strong>:", "2 cups half and half (or one cup each cream and milk)", "1/4 cup plus 2 tablespoons sugar", "1 vanilla bean", "4 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the cake</strong>: Peel bananas and slice in half lengthwise, then crosswise, set aside. Place 1/2 cup sugar in a small saucepan, add enough water to moisten and place over medium heat. Cook until it begins to caramelize, remove from heat and swirl gently until caramel is a uniform amber color, between the color of honey and maple syrup. Immediately pour into the bottom of a standard loaf pan. Wearing oven mitts or holding dry towels, lift pan and tilt back and forth to evenly coat the bottom. While caramel is still soft, carefully place bananas cut side down into it, cutting them as needed to get as much coverage as you can. Brush sides of pan with soft butter, set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a rack in center of oven. Preheat oven to 350&deg;F. In stand mixer fitted with paddle attachment or in a medium bowl using handheld electric mixer, cream together butter and remaining sugar. Add eggs one at a time, fully incorporating each one before adding the next and scraping bowl as needed. Beat in vanilla extract. Combine flour, baking powder and salt and add to batter, combining on low speed. With mixer off, add Cajeta and slowly mix until fully incorporated, scraping often. Be sure to scrape the bottom of the bowl thoroughly, as the Cajeta usually needs some help getting down there.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape batter into pan and set on a small baking sheet to catch any caramel that might bubble out of the pan. Bake for 40 minutes, then rotate and continue baking until a skewer inserted in the middle comes out clean, 15 to 20 minutes longer. Allow to bake another 3 to 5 minutes after that to allow cake to set up enough to adhere to bananas. Remove to wire rack to cool for 5 to 10 minutes. When cake is still warm but pan is noticeably cooler, run a paring knife around the edge and flip onto a plate. Don't panic if your bananas stick to the pan and your corners aren't perfect, quickly use a paring knife to remove bananas from pan and replace on cake. Immediately wrap in plastic and chill overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the anglaise</strong>: Place half and half and sugar in a medium saucepan. Split and scrape vanilla bean and add to pan. Have egg yolks ready in a medium bowl. Place saucepan over medium heat, stirring occasionally to be sure sugar is dissolved, and heat until steaming but do not allow to boil. Remove from heat and gradually whisk into yolks. Scrape everything back into the pan and place over medium-low heat, stirring constantly until custard coats the back of a spoon. Strain into a bowl and chill over an ice bath or in the refrgerator for a couple hours with plastic wrap pressed directly over the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve</strong>: Slice cake into slabs around 1 inch thick. Briefly reheat in a warm oven or microwave and serve in a pool of chilled anglaise.</p>"}]}