{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130225-vegan-steamed-buns-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["bao", "Chinese", "king oyster", "mushrooms", "steamed buns", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Steamed Buns With Tempura King Oyster Mushrooms and Agave-Miso Mayonnaise (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/02/steamed-buns-agave-miso-mayonnaise-tempura-king-oyster-mushroom-recipe.html", "description": "Chinese-style steamed buns stuffed with tempura-fried simmered king oyster mushrooms and an agave-miso mayonnaise.", "totalTime": "1 hour", "recipeYield": "makes enough for 12 steamed buns, serving 4 to 6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Christmas", "Dairy-Free", "Mushrooms", "Sandwiches", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 cup soy sauce", "1 cup sake", "1/2 cup sugar", "1/2 cup mirin (see note)", "2 king oyster mushrooms, about 6 inches long and 1 1/2 to 2 inches wide", "1 quart vegetable, canola, or peanut oil", "1/2 cup corn starch", "1/2 cup all-purpose flour", "1 cup ice-cold club soda", "Kosher salt", "12 Chinese sandwich-style steamed buns (bao)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/02/miso-agave-mayonnaise-recipe.html\">Miso-Agave Mayonnaise</a>", "1 1/2 cups finely shredded iceberg lettuce", "4 scallions, very thinly sliced on an extreme bias, stored in a bowl of cold water in the fridge", "1/2 cup picked fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine soy sauce, sake, sugar, mirin, and 1 cup water in a medium saucepan and whisk until sugar is dissolved. Add king oyster mushrooms. Place a clean, lint-free paper towel or kitchen towel directly on the surface of the liquid, pressing down until it is completely saturated and keeps the mushrooms partially submerged. Bring to a simmer over high heat, then reduce to maintain a bare simmer. Cook until mushrooms are completely tender (a cake tester or paring knife inserted should meet little resistance as it goes through), about 30 minutes, flipping mushrooms once halfway through cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove mushrooms from liquid and dry carefully with paper towels. Return remaining liquid to a gently boil over medium heat and cook until reduced to 1/2 cup, about 10 minutes. Set aside to cool. When mushrooms are cool enough to handle, slice each into 12 disks about 1/2-inch wide.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large wok, saucepan, or deep fryer to 350°F and adjust flame to maintain temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cornstarch and flour in a large bowl and stir with chopsticks until roughly combined. Add soda and stir very rapidly with chopsticks while shaking bowl. Do not overmix&mdash;there should be plenty of lumps and bubbles. Add sliced mushrooms to bowl and turn to coat. Working one piece at a time, lift mushroom, allow excess batter to drip off, then slowly lower into hot oil. Repeat until all mushrooms are in the oil. Cook mushrooms, agitating oil and turning mushrooms occasionally with a wire mesh spider or long chopsticks until pale golden brown and completely crisp, about 1 1/2 minutes. Transfer to a paper towel-lined plate and season with salt immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place steamed buns on a plate and cover with a damp paper towel. Microwave on high power until hot, about 1 minute. Spread miso mayonnaise in each steamed bun, then add shredded lettuce, two fried mushroom slices, a drizzle of the reduced simmering liquid, sliced scallions, and cilantro leaves. Close sandwiches and serve with extra miso mayonnaise on the side for dipping.</p>"}]}