{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/101513-270220-Serious-Eats-Sunday-Supper-Potato-Pancakes-Roasted-Applesauce-EggB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Kosher", "keywords": ["apple sauce", "easy", "egg", "latke", "potato", "potato pancake", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato Pancakes With Oven-Roasted Thyme Applesauce, Sour Cream, and Poached Eggs", "link": "https://www.seriouseats.com/recipes/2013/10/potato-pancakes-thyme-apple-sauce-recipe.html", "description": "Crisp potato pancakes are slathered with savory, oven-roasted thyme applesauce and sour cream and served with a gently poached egg.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Eggs", "Kosher", "Mains", "Potato", "Sunday Supper", "Vegetarian"], "recipeIngredient": ["<strong>For the Applesauce:</strong>", "2 pounds apples, peeled, cored and cut into rough slices", "2 teaspoons sugar", "1/4 teaspoon cinnamon", "2 sprigs thyme, plus extra for garnish", "Kosher salt", "2 tablespoons water", "&nbsp", "<strong>For the Potato Pancakes:</strong>", "1 large egg white plus 4 whole eggs, divided", "3 cups peeled and coarsely grated Idaho potatoes, squeezed of excess liquid", "1 small white onion, grated and squeezed of excess liquid", "Freshly ground black pepper", "2 tablespoons matzo meal", "1/2 cup vegetable oil", "1 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Apple Sauce:</strong> Adjust oven rack to lower-middle position and preheat oven to 350°F. Combine apples, sugar, cinnamon, thyme, a pinch of salt, and water in a large, ovenproof baking dish. Toss to combine and transfer to oven to cook until apples are tender, about 45 minutes. Remove from oven, discard thyme and roughly mash with the back of a fork, leaving some texture. Refrigerate and reduce oven to 200°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Potato Pancakes:</strong> In a large mixing bowl, lightly beat egg white. Add potatoes, onion, 1 teaspoon of salt, 1/2 teaspoon pepper, and matzo meal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil in a large frying pan until shimmering. Working in batches, drop in a heaping 2 tablespoons for each potato pancake, flattening them to make thin pancakes. Cook until bottoms are browned, 2 to 3 minutes. Flip and brown second side, adding additional oil as needed. Drain on paper towels and sprinkle with additional salt while they’re still hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place drained pancakes on a baking sheet and transfer to the oven to keep warm. Continue working in batches until all pancakes are cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium saucepan of salted water to a boil and reduce to a sub-simmer. Crack eggs into individual bowls. Working one egg at a time, tip egg into a fine mesh strainer and gently swirl over sink or bowl to remove watery whites. Lower into water and gently roll the egg out. Repeat until all the eggs are in the pot. Cook, gently swirling and flipping the eggs for even cooking until the whites are set but the centers are still runny, 3 1/2 to 4 minutes. Carefully lift with a slotted spoon and transfer to a paper towel-lined plate. (See <a href=\"http://www.seriouseats.com/2013/03/how-to-poach-eggs-easy-way-poached-breakfast-video.html\">here</a> for a video of the egg poaching process.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, plate potato pancakes with a generous dollop each of sour cream and applesauce. Add an egg to each plate, season egg with salt and pepper, sprinkle with fresh thyme leaves, and serve.</p>"}]}