{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130426-btb-yellowcake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Alexandra Guarnaschelli", "Bake the Book", "cake", "caramel", "chocolate", "layer cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Yellow Cake with Chocolate Frosting and Caramel Top", "link": "https://www.seriouseats.com/recipes/2013/04/yellow-cake-with-chocolate-frosting-and-caramel-recipe.html", "description": "This is a messy version of Dobos Torte. Fewer layers, with drippier frosting. But just as delicious. Yellow cake layered with chocolate and caramel is a mouthful of classic flavor, courtesy of <strong><em>Old School Comfort Food</em></strong>.", "totalTime": "60 minutes", "recipeYield": "serves 10 to 12", "recipeCategory": ["Bake the Book", "Cakes", "Chocolate", "Desserts"], "recipeIngredient": ["<strong>Cake</strong>", "2 cups all-purpose flour", "2 1/4 teaspoons baking powder", "3/4 teaspoon kosher salt", "16 tablespoons (2 sticks) lightly salted butter, at room temperature, plus more for greasing the pans", "2 cups sugar", "6 large eggs", "Grated zest and juice of 1 lemon", "&nbsp;", "<strong>Frosting</strong>", "14 ounces bittersweet chocolate", "roughly chopped (about 2 3/4 cups)", "11/4 cups sugar", "1/2 teaspoon kosher salt", "2 cups heavy cream", "1 teaspoon vanilla extract", "12 tablespoons (1 1/2sticks) lightly salted butter, cut into thin slices", "&nbsp;", "<strong>Caramel Top</strong>", "1 cup sugar", "2 teaspoons light corn syrup", "Flaky sea salt, such as Maldon (for garnish)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Grease two 8-inch round cake pans with butter.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the cake batter: In a bowl, stir together the flour, baking powder, and salt. In the bowl of a stand mixer fitted with the paddle attachment, beat the butter until smooth, 2 to 3 minutes. Add the sugar and continue beating until the mixture becomes fluffy, 5 to 8 minutes. Add the eggs, one by one, taking care that each one is thoroughly integrated before adding the next. Add the lemon zest and lemon juice and then the flour mixture and mix until fully blended. Do not overmix.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cake: Divide the batter between the prepared cake pans. Bake until the centers are firm and the tip of a small knife emerges clean when it pierces the center of each cake, 30 to 40 minutes. Remove from the oven, unmold the cakes, and allow to cool thoroughly on a rack.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the frosting: In a medium bowl, combine the chocolate, sugar, and salt. In a medium saucepan, bring the cream and vanilla to a simmer, about 5 minutes. Pour over the chocolate and stir until all of the chocolate has melted. Gently whisk in the butter slices. Set aside to cool.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost the cake: When the frosting is cool, whip the frosting in the bowl of a stand mixer fitted with a whisk attachment to lighten it, 1 to 2 minutes. Split each cake in half horizontally so you have 4 equal layers. Put the first cake layer on a rack set over a baking sheet, cut side up. Frost the layer and the remaining ones, stacking them neatly and uniformly on top of each other. Frost the entire outside of the cake as well. Refrigerate for at least 30 minutes so it gets cold.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the caramel: In a large skillet, heat the sugar and corn syrup over low heat until the sugar melts and turns a caramel color. Swirl the sugar gently in the pan as it cooks so it browns evenly. Take the skillet and pour the caramel over the top of the cake, allowing it to drip down the sides and onto the pan below. It is normal that the hot caramel will melt the frosting slightly. Try to pour it in as even and as thin a layer as you can over the cake. Have fun with it! If the caramel cools before pouring, warm it gently over low heat to loosen it again. Allow the caramel topping to cool and harden on top of the cake, at least 5 to 10 minutes before serving, or up to 1 hour. Do not refrigerate. Sprinkle with a pinch of Maldon salt.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the cake: I will not lie. This is not a “neat” cake. When ready to slice, use the heel of a knife to crack the caramel top before cutting slices. The caramel can be a little uneven but I have always found people like it so much, it doesn’t matter. This cake is best served at room temperature.<br />\n</p>"}]}