{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131106-brussels-sprouts-lasagna-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brussels sprout", "comfort food", "lasagna", "mushroom", "pasta", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5714285714286", "ratingCount": "7"}, "name": "Creamy Brussels Sprout and Mushroom Lasagna", "link": "https://www.seriouseats.com/recipes/2013/12/creamy-brussels-sprouts-mushroom-lasagna-food-lab-recipe.html", "description": "A rich, creamy, gooey, cheesy lasagna with mushrooms and Brussels sprouts.", "totalTime": "2 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Christmas", "Lasagna", "Mains", "Mushrooms", "Thanksgiving", "The Food Lab", "Vegetarian"], "recipeIngredient": ["1 package (15 sheets) no-boil lasagna noodles", "24 ounces button mushrooms, cleaned and trimmed", "1 pound Brussels sprouts", "5 tablespoons unsalted butter, divided", "2 medium shallots, finely chopped (about 1/2 cup)", "4 medium garlic cloves, minced (about 4 teaspoons)", "1 tablespoon picked fresh thyme leaves", "2 cups heavy cream (divided)", "Kosher salt and freshly ground black pepper", "2 tablespoons canola oil", "3 tablespoons flour", "3 cups whole milk", "1/4 teaspoon grated nutmeg", "1 pound whole milk mozzarella cheese, grated, divided", "1 ounce grated Parmiggiano-reggiano", "2 tablespoons chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place lasagna noodles in a 9- by 13-inch baking dish and cover with warm water. Let soak 15 minutes, then arrange on a clean kitchen towel or paper towels to dry. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/4 of mushrooms in the bowl of a food processor. Pulse until roughly chopped, 6 to 8 short pulses. Transfer to a large bowl and set aside. Repeat with remaining three batches of mushrooms. Fit food processor with grater attachment and grate all of the Brussels sprouts. Transfer to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in a large non-stick or cast iron skillet over high heat until foaming subsides. Add mushrooms and cook, stirring occasionally, until all excess moisture evaporates and mushrooms begin to sizzle and brown, about 12 minutes. When mushrooms are browned, add shallots, garlic, and thyme. Cook, stirring, until shallots are translucent, about 4 minutes. Add 1 cup heavy cream and cook until mixture is reduced to a loose paste, about 2 minutes. Season to taste with salt and pepper. Transfer to a large bowl and wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in the now-empty skillet over high heat until shimmering. Add shaved Brussels sprouts. Cook, tossing occasionally, until well-charred on most sides, about 10 minutes. Add remaining cup heavy cream and cook until reduced to a loose sauce-like consistency. Season to taste with salt and pepper and transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining 3 tablespoons butter in a medium saucepan over medium-high heat. Add flour and cook, stirring, until pale brown and nutty, about 2 minutes. Whisking constantly, slowly add milk in a thin, steady stream. Bring to a boil, whisking constantly. Remove from heat and stir in nutmeg and 3/4 of mozzarella. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400°F. To assemble lasagna, lay 1/6th of cheese sauce on bottom of lasagna pan. Add three noodles. Top with 1/4 of Brussels sprouts mixture, 1/4 of mushroom mixture, another 1/6th of cheese sauce, and a sprinkle of grated mozzarella. Repeat noodle, sprouts, and mushroom layer three more times. Top with last three noodles, remaining cheese sauce, and remaining grated mozzarella.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to oven and bake until heated through and top is browned and bubbly, about 30 minutes. Remove from oven sprinkle with Parmesan and parsley, let rest 10 minutes, and serve.</p>"}]}