{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130402-246804-dinner-tonight-kale-refried-beans-tostada-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["beans", "cinco de mayo", "Dinner Tonight", "kale", "Mexican", "quick", "refried beans", "tostada", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tostadas With Kale, Refried Beans, and Cheese", "link": "https://www.seriouseats.com/recipes/2013/04/tostadas-with-kale-refried-beans-cheese-recipe.html", "description": "Creamy, well-seasoned beans pair well with the earthy, tender kale on this fried tortilla.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Kale", "Mains", "Mexican", "Vegetarian"], "recipeIngredient": ["3 tablespoons canola oil, plus more for frying ", "1 medium white onion, chopped (about 1 cup)", "1 jalapeño, stemmed, seeded, and chopped (about 2 tablespoons)", "2 medium garlic cloves, minced (about 2 teaspoons", "1 teaspoon ground cumin ", "1 (15 ounce) can whole tomatoes, drained and chopped ", "1 (32 ounce) can pinto beans with liquid", "Salt", "2 bunches kale (approximately 1 1/2 pounds), stems removed, leaves roughly chopped ", "12 corn tostadas ", "1/2 pound Mexican melting cheese (Oaxacan, quesillo, or Monterrey Jack), pulled into small strands or shredded ", "2 limes, quartered "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in a large saucepan over medium heat. Add onion and jalapeño, and cook until soft and translucent, about 5 minutes. Add garlic and cumin, stir well, and cook until fragrant, about 30 seconds. Add tomatoes and cook until chunks begin to break down, stirring often, about 4 minutes. Add beans and liquid and bring to a boil. Reduce heat to medium-low and simmer gently for 15 minutes. Use a potato masher or the back of a wooden spoon to mash beans until chunky. Season with salt, if necessary (it will depend on how salty the canned beans are). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 2 tablespoons oil in a 12-inch skillet over medium-high heat until shimmering. Add half of the kale, season with a pinch of salt, and cook until bright green and starting to wilt, about 1 minute. Stir in the remaining bunch, and cook until all of the kale bright green. Pour in 1 cup water. It should boil immediately. Reduce heat to low and cover. Cook until tender, about 10 minutes. Remove the cover, and let any excess water evaporate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smear some of the refried beans on top of each tostada, and top with a sprinkling of cheese and kale. Serve with lime wedges. </p>"}]}