{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130114-pomelo-shrimp-one-bite-salad-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "Thai", "keywords": ["fish sauce", "light eating", "lime", "pomelo", "quick", "salad", "seafood", "shellfish", "shrimp", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai Pomelo and Shrimp Salad (Miang Som O)", "link": "https://www.seriouseats.com/recipes/2013/01/my-thai-she-simmers-pomelo-shrimp-salad-miang-recipe.html", "description": "I used to call miang \"one-bite salad,\" but I'm rethinking it as it seems to suggest that you're supposed to wrap the whole thing up into a big bundle and eat it in one bite. Calling it \"salad cups\" doesn't do it either since a miang like this isn't usually served assembled in little lettuce cups. Either way, this shrimp and pomelo salad served with chili jam is simple, balanced, and delicious.", "totalTime": "30 minutes", "recipeYield": "serves 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Lime", "Salads", "Shrimp", "Thai"], "recipeIngredient": ["3/4 cup store-bought or <a href=\"http://shesimmers.com/2011/01/nam-prik-pao-thai-chilli-jam-secret.html\">homemade</a> Thai chili jam (nam prik pao) ", "1/4 cup fish sauce  ", "1 pound medium shrimp, peeled and deveined  ", "2 quarts water  ", "1 tablespoon salt  ", "3/4 cup of fresh ginger (the younger the better) that has been peeled and cut into 1/4-inch dice", "3 medium shallots or 1/2 a medium red onion, peeled and cut into 1/4-inch dice (about 1/2 cup)", "Half a large cucumber, seeded and cut into 1/4-inch dice (about 1 1/2 cups)", "3/4 cup of roasted cashews or peanuts", "3 to 4 bird’s eye chilies, cut crosswise into 1/8-inch slices", "One large lime (choose one with thin and smooth skin), cut into 1/4-inch cubes (peel and all), or 1 tablespoon lime juice (see note)", "One large pomelo, peeled and separated into segments, pith removed, cut roughly into large pieces (see note)", "Two heads of Boston (Bibb) lettuce, separated into individual leaves, washed and spun dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small condiment bowl, mix together chili jam and fish sauce; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place water and salt in a 4-quart pot; bring to a boil. Reduce to a sub-simmer. Water should be steaming, but not bubbling. Add shrimp to pot; stir until shrimp are barely opaque, about 1 1/2 minutes. Remove with a metal spider or slotted spoon. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange poached shrimp, dressing, shallots, cucumber, peanuts, chilis, lime, pomelo, and lettuce leaves on a large platter. To assemble and serve: place one shrimp in a lettuce leaf and a \"little bit of this and a little bit of that,\" followed by a teaspoonful of dressing; wrap it up in one bite and consume.</p>"}]}