{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130326-245901-one-pot-chicken-brown-rice-primary.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["chicken", "chicken dinners", "one pot", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "One-Pot Sesame Chicken, Shiitake, and Brown Rice", "link": "https://www.seriouseats.com/recipes/2013/04/sesame-chicken-shiitake-brown-rice-recipe.html", "description": "Tender, moist chicken is simmered with chewy brown rice, flavorful shiitake mushrooms, and crunchy chestnuts. Sesame oil pulls the flavors together in this easy one-pot meal.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chicken Dinners", "Mains", "Rice"], "recipeIngredient": ["1 1/2 pounds chicken thighs ", "Kosher salt and freshly ground black pepper", "1 tablespoon olive oil", "1 leek rinsed, white and light green parts chopped, greens discarded", "2 small shallots, minced (about 1/3 cup)", "10 ounces shitake mushrooms, rinsed, ends trimmed, sliced 1/4-inch thick", "2 medium cloves garlic, minced (about 2 teaspoons)", "4 teaspoons sesame oil", "5 ounces sliced water chestnuts (fresh or canned)", "1 3/4 cup brown rice, rinsed", "2 cups homemade or store-bought low-sodium chicken stock", "1/4 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken dry and season both sides with salt and pepper. Heat oil in Dutch oven over medium-high heat until shimmering. Place chicken in pot skin side down. Cook until the skin is well-browned, 3 to 4 minutes. Flip and brown the other side, about 3 minutes longer. Transfer chicken to plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium and add leeks, shallots, mushrooms, and 1 teaspoon salt to pot. Cook, stirring occasionally, until vegetables have softened and are beginning to brown, 8 to 12 minutes. Stir in garlic and cook until fragrant, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in sesame oil, water chestnuts, and rice. Cook, stirring, for 1 minute. Increase heat to medium-high and stir in broth and water. Bring to simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle chicken into rice, skin side up. Cover and reduce heat to low. Simmer until rice is tender, chicken is cooked, and liquid is evaporated, 35 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off heat and set lid slightly ajar. Let sit 5 to 10 minutes before serving.</p>"}]}