{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130408-very-small-anna-tonka-bean-ice-cream.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["caramel", "from the pastry dungeon", "ice cream", "scotch", "tonka beans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tonka Bean Ice Cream with Scotch Caramel Swirl", "link": "https://www.seriouseats.com/recipes/2013/04/tonka-bean-ice-cream-with-scotch-caramel-swirl-recipe.html", "description": "This ice cream is something special. The flavor of tonka bean makes the ice cream taste surprisingly like my favorite storebought flavor, Cherry Garcia. And though the caramel contains no butter, the caramel swirl is decidedly buttery and savory from the smoky scotch.", "totalTime": "12 hours", "recipeYield": "makes 1 1/2 quarts", "recipeCategory": ["Ice Cream and Frozen Treats", "Very Small Anna"], "recipeIngredient": ["<strong>For the Ice Cream</strong>", "1 quart half and half (or 2 cups each milk and heavy cream)", "1 cup sugar", "2 small or 1 very large tonka bean", "6 egg yolks", "&nbsp;", "<strong>For the Caramel</strong>", "1/2 cup sugar", "2 tablespoons water", "1/2 teaspoon salt", "Seeds from 1/2 vanilla bean", "1/4 cup scotch", "1/4 cup heavy cream or half and half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ice Cream Base</strong>: Combine half and half with sugar in medium saucepan. Grate tonka bean into liquid with microplane. Bring to a simmer over medium heat, stirring occasionally to be sure sugar is completely dissolved. Remove from heat and allow to steep for 15 minutes. Place yolks in medium mixing bowl. Whisking constantly, pour half-and-half mixture into bowl with yolks, then scrape mixture into saucepan and cook over medium-low heat, stirring constantly with spatula and scraping bottom often to prevent curdling. Once thick enough to coat spatula, remove from heat and strain immediately through fine mesh strainer. Chill over ice, then place in a lidded container and allow to rest overnight in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caramel</strong>: Place sugar, water, and salt in medium saucepan and set over medium-high heat. Allow to come to a boil, then watch carefully until sugar begins to caramelize. Gently swirl to promote even caramelization. Once caramel reaches a dark honey color, remove from heat. Allow to darken slightly more off the heat to almost the color of maple syrup. Slowly and away from yourself, drizzle in scotch and cream. It will bubble and sputter and your caramel will seize so be careful. Place over low heat, whisking gently every few minutes, until seized caramel is fully melted. Set aside and allow to cool. Chill thoroughly before churning ice cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you're ready to churn, pour chilled base into ice cream maker and process according to manufacturer's instructions. When ice cream is ready, pack a thin layer into the bottom of a heavy duty plastic or metal container, then drizzle with caramel. Repeat until all ice cream and caramel has been layered into container. Freeze at least 1 hour until firm.</p>"}]}