{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130115-kumquat-lemongrass-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["ice cream", "kumquats", "lemongrass", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kumquat Lemongrass Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/01/kumquat-lemongrass-ice-cream-recipe.html", "description": "A bright citrus-loaded ice cream studded with sweet-tart kumquats.", "totalTime": "1 hour, plus an overnight chill", "recipeYield": "makes 1 quart", "recipeCategory": ["Ice Cream and Frozen Treats", "Scooped"], "recipeIngredient": ["2 cups heavy cream", "1 cup whole milk", "3 stalks lemongrass, tender bottom halves only, tough outer leaves removed, chopped into 1/4-inch segments", "1 cup (about 6 1/2 ounces) kumquats, washed and minced, seeds removed", "6 egg yolks", "1 cup sugar, divided", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy medium saucepan, bring cream and milk to a simmer over medium heat. When dairy begins to bubble, add lemongrass, cover, shut off heat, and let steep for 2 hours. Pour through a fine-mesh strainer into a 1 quart liquid measure. Discard lemongrass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While dairy is steeping, toss minced kumquats with 1/2 cup sugar in a bowl until sugar begins to dissolve. Let sit on counter for 10 minutes, toss again, then refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another heavy medium saucepan, whisk egg yolks and remaining 1/2 cup sugar together until lighter in color and slightly thickened. Slowly pour in strained dairy, whisking constantly, about 1/4 cup at a time until half of dairy is integrated into eggs. Pour in remaining dairy and whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook over medium heat, whisking frequently, until a custard forms on the back of a spoon and a finger swiped across the back leaves a clean line. Stir in salt to taste, then strain custard into an airtight container and chill overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, churn ice cream according to manufacturer's instructions. Drain kumquats from syrup, reserving syrup for another use. Transfer ice cream to an airtight container and quickly fold in kumquats. Chill in freezer for at least 4 hours before serving. </p>"}]}