{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/2012122-bakethebook-crepecake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Bouchon Bakery", "cake", "crepes", "pastry cream", "Thomas Keller"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Bouchon Bakery's Crêpe Cake", "link": "https://www.seriouseats.com/recipes/2013/01/thomas-keller-bouchon-bakery-crepe-cake-recipe.html", "description": "According to Keller, this is the easiest recipe in the Bouchon Bakery Cookbook. It's also one of the most fun. Toasty vanilla crêpes sandwich layer upon layer of thick, orange-zested pastry cream.", "totalTime": "overnight, for setting", "recipeYield": "Serves 8", "recipeCategory": ["Bake the Book", "Cakes", "Crepe", "Desserts"], "recipeIngredient": ["Orange Diplomat Cream", "13 crêpes", "1/4 cup + 2 1/2 teaspoons (60 grams) granulated sugar", " ", "<strong>Orange Diplomat Cream</strong>", "1 and 1/8 sheets (2.7 grams) silver leaf gelatin", "1 cup + 2 tablespoons (267 grams) heavy cream, whipped to medium peaks", "Zest of 2 medium oranges", " ", "<strong>Pastry cream</strong> (ingredients follow)", "1/2 cup + 2 1/2 tablespoons (160 grams) egg yolks", "1 vanilla bean, split lengthwise", "1/2 cup + 2 1/2 tablespoons (133 grams) granulated sugar", "1/2 cup + 3 1/2 tablespoons (100 grams) custard powder* or all-purpose flour", "2 1/2 cups + 2 1/2 tablespoons (666 grams) whole milk", "1.2 ounces (33 grams) unsalted butter, cut into 1/4-inch pieces, at room temperature", "*for this recipe, we use Bird’s custard powder.", " ", "<strong>Crêpes</strong>", "2 cups (500 grams) whole milk", "3/4 cup + 1/2 tablespoon (200 grams) eggs", "1 1/4 cups + 3 tablespoons (200 grams) all-purpose flour", "1 tablespoon + 2 teaspoons (20 grams) granulated sugar", "1 1/2 teaspoons (5 grams) kosher salt", "1 vanilla bean, split lengthwise", "0.7 ounces (20 grams) unsalted butter, melted and cooled", "Canola oil, for cooking"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crêpes:</strong>Place the milk, eggs, flour, sugar, Grand Marnier, and salt in a Vitamix.* Scrape the seeds from the vanilla bean and add them at medium-low speed for about 15 seconds. Scrape down the sides of the blender container. With the blender running on medium-low, drizzle in the melted butter. Strain through a fine-mesh strainer into a covered container; use a spatula to force through any batter remaining in the strainer. Refrigerate overnight.</p>\r\n\r\n<p><i>*SE note:</i> If you don't have a Vitamix, a regular high-powered blender is fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a paper towel, rub a large crêpe pan or a 10-inch nonstick frying pan with a light coating of canola oil (if the crêpes begin to stick at any point, rub it again) and set it over medium to medium-high heat. Once the pan is hot, lift it from the heat and ladle ¼ cup (55 grams) cup of the batter into the center of the pan. Immediately swirl and shake the pan so that the batter covers the bottom, then rotate the pan a couple of times so the batter comes ½ inch up the sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the heat and cook for 15 to 30 seconds, depending on the heat level, until the batter is set and the bottom is a light golden brown. Slip your fingers under the crêpe and flip it over (if you just grab the edge, it may tear as you flip). Cook on the second side until a light golden brown, then transfer the crêpe to a sheet pan. Repeat to make the remaining crêpes, stacking or overlapping them once they cool. Let them sit for at least 10 minutes before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pastry Cream:</strong> Set up an ice bath. Place a medium bowl in the ice water and set a fine-mesh strainer over the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the yolks in the bowl of a stand mixer fitted with the whisk attachment. Scrape the seeds from the vanilla bean, add them to the yolks, and mix on medium-low speed for about 30 seconds. Reduce the speed to low and slowly pour in the sugar, then whisk on medium speed until lighter in color, about 1-3 minutes. Scrape down the sides and bottom of the bowl, then whisk on medium-high speed for about 3 minutes, until the mixture is pale yellow and thick. When the whisk is lifted, the mixture should form a slowly dissolving ribbon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the speed to low, add the custard powder or flour, and mix for 30 seconds. Scrape down the sides and bottom of the bowl. With the mixer running on the lowest speed, slowly pour in the milk. Scrape the bowl again and mix on low speed for another minute, or until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into a large saucepan, set over medium heat, and stir gently until it begins to thicken. Switch to a whisk and whisk as the cream comes to a simmer, rotating the whisk around the bottom to keep the cream from scorching. Once you see bubbles breaking the surface, cook for about 5 minutes longer, whisking constantly, until the pastry cream has thickened.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the pastry cream through the strainer, pressing gently on it to push the thickened cream through. Whisk in the orange zest, whisking for about 1 minute to cool slightly. Then whisk in the butter in 2 additions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into a covered container and press a piece of plastic wrap against the surface to prevent a skin from forming. Refrigerate for at least 1 hour before creating Orange Diplomat Cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Creating Orange Diplomat Cream:</strong> Place the gelatin in a bowl of ice water to soften.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer one-third of the pastry cream to a medium microwave-safe bowl or a small saucepan. Remove the gelatin from the water, squeezing out excess water, and add to the bowl or pan. Heat, gently stirring, to loosen the pastry cream and dissolve the gelatin.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, transfer the remaining pastry cream to the bowl of a stand mixer fitted with the paddle attachment or to a medium bowl and mix or stir until smooth.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the warm pastry cream through a fine-mesh strainer into the bowl with the rest of the pastry cream and mix or stir until smooth. Remove the bowl from the mixer stand and fold in the whipped cream one-third at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press a piece of plastic wrap against the surface to prevent a skin from forming and refrigerate until firm, at least 4 hours. (The cream can be refrigerated for up to 4 days.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to use the cream, transfer to a bowl and stir gently until it has a creamy consistency.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembling the Crêpe Cake:</strong> Wrap a 10-inch cardboard round or a flat tray in plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the cream into the pastry bag. Choose the most attractive crêpe for the top of the cake. Place it with its better side down on the plastic wrap and pipe 1/3 cup (80 grams) of the cream into the center. Using a small offset spatula, spread the cream over the crêpe, leaving a 1/4-inch border. The crêpe is naturally thinner on the edges; to prevent a dome from forming as you fill and stack the crêpes, spread the filling at the edges a bit thicker. Top the cream with another crêpe, spread it with cream, and continue to layer the crêpes and cream, ending with a crêpe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the cake in the plastic wrap and refrigerate for at least 4 hours, but preferably overnight.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Unwrap the cake and invert it onto a serving platter. Sprinkle the top with an even layer of the sugar and, using the propane torch, caramelize the top of the cake, working from one side to the other. Cut the cake into 8 wedges and serve.</p>"}]}