{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130320-244758-matzoh-crack-smores.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate", "chocolate dessert", "desserts", "marshmallow", "matzo", "s'mores"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Matzo 'Crack' S'mores", "link": "https://www.seriouseats.com/recipes/2013/03/matzo-crack-smores-kosher-smores-passover-recipe.html", "description": "Marshmallow s'mores sandwiches made with caramel and chocolate-coated matzo crack.", "totalTime": "2 hours", "recipeYield": "Serves 10", "recipeCategory": ["American Classics", "Chocolate", "Cookies", "Passover"], "recipeIngredient": ["4 to 6 sheets of kosher for Passover matzo", "1 cup (2 sticks) kosher for Passover margarine", "1 cup (7 1/2 ounces) brown sugar, firmly packed", "12 ounces high quality dark or semi-sweet kosher for Passover chocolate", "1 vanilla bean", "1/2 teaspoon kosher salt", "20 Kosher for Passover marshmallows"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350°F. Cut out 2 sheets of aluminum foil&mdash;each should be approximately 20 inches in length. Place the sheets on top of each other and fold over several times on the long side to join the sheets of foil and form a seam. (Forming the seam is crucial, otherwise your pan will be improperly lined and the caramel syrup will end up seeping under the foil). Take the large aluminum sheet and line a 12- by 17-inch rimmed baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place matzo side-by-side in the pan as tightly as possible without overlapping. Use matzo pieces to fill any gaps at the bottom of the pan. Set aside. Chop chocolate so pieces are about the size of standard chocolate chips and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice vanilla bean in half lengthwise and scrape out the seeds. Set aside. In a medium saucepan melt margarine over medium heat stirring frequently with a spatula. Once margarine has melted, add brown sugar and vanilla, stirring to combine. Cook until mixture is an even dark brown color and has begun to bubble, about 5 minutes. Remove from heat and pour over matzo using spatula to spread sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake matzo for until margarine mixture begins to bubble and crackers begin to lightly brown, 5 to 10 minutes. Remove from oven and sprinkle evenly with chocolate allowing the heat to melt the chocolate for a few moments. Spread chocolate evenly with the spatula so all of the matzo are completely covered. Refrigerate until chocolate sets and hardens. Sprinkle with salt then break apart into 20 squares and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Line a jelly roll pan with parchment paper. Arrange the marshmallows the pan spacing them a couple inches apart. Place the tray in the oven and keep an eye on the marshmallows (either through a windowed oven or by checking every 15 to 30 seconds) removing from the oven to rotate until they reach the desired stage of browness. Add marshmallows to matzo crack and make s'mores sandwiches. Serve immediately.</p>"}]}