{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131003-bakethebook-pearstrudel.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["cranberry", "Desserts for Every Season", "pear", "phyllo dough", "strudel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jenny McCoy's Pear-Cranberry Strudel", "link": "https://www.seriouseats.com/recipes/2013/10/jenny-mccoy-pear-cranberry-strudel.html", "description": "Pears are tossed with cranberries, rolled in sheets of phyllo coated with crackling sugar, and left to crisp in the oven to make this autumnal strudel.", "totalTime": "40 minutes", "recipeYield": "makes 12 servings", "recipeCategory": ["Bake the Book", "Cranberry", "Fruit Desserts", "Pastry", "Pear"], "recipeIngredient": ["6 ripe Bartlett Pears", "Finely grated zest of 1/2 lemon", "1/2 teaspoon fine sea salt", "3/4 cup packed light brown sugar", "3/4 teaspoon ground cinnamon, plus more for topping", "4 1/2 ounces (9 tablespoons) unsalted butter, divided", "3/4 cup cranberries, sliced in half", "12 sheets (about 6 ounces) fresh or frozen phyllo dough, thawed", "Granulated sugar", "1 tablespoon turbinado sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat to 350°F. Cover a large, flat work surface with 2 sheets of parchment paper. Line a baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel, core, and dice the pears into 1/4-inch cubes. Gently toss the pears, lemon zest, salt, brown sugar, and cinnamon in a large bowl until evenly combined.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan, melt 1 tablespoon of the butter. Add the pear mixture and cook over high heat until just softened. Using a slotted spoon, transfer the pears to a shallow dish and discard the excess liquid. Let cool to room temperature. Transfer the mixture to a bowl, add the cranberries, gently stir to combine, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the stack of phyllo sheets on one of the sheets of parchment that is on your work surface and cover with plastic wrap to prevent the phyllo dough from drying out. In a small saucepan, melt the remaining 8 tablespoons butter over low heat.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange 1 sheet of phyllo on the second sheet of parchment, with the long side of the sheet parallel to the edge of the work surface. Lightly brush the entire surface area of the phyllo with melted butter, starting from the center of the sheet and working outward to prevent tears. Lightly sprinkle the entire sheet of phyllo evenly with a few pinches of granulated sugar and top with another sheet of phyllo, taking care to line up the corners of each layer. Brush with melted butter, sprinkle with granulated sugar, and repeat with 2 more sheets of phyllo to create a four-layer stack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pizza wheel, and the straight edge of a ruler as a guide, cut the buttered and sugared phyllo stack in half widthwise. Then cut the 2 pieces in half again, creating 4 strips. About 2 inches from the bottom edges of the 4 strips, evenly divide one-third of the pear-cranberry filling, ￼￼￼￼￼￼￼￼￼￼￼￼￼￼￼fold the edge over the filling, and tightly roll up. Lightly brush the entire exterior surface of the rolled strudel with melted butter and sprinkle the tops of the assembled strudel generously with turbinado sugar and ground cinnamon. Repeat two more times with the remaining 8 sheets of phyllo and the remaining two-thirds of the pear-cranberry filling to make 8 more strudels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the tops of the assembled strudels generously with turbinado sugar and cinnamon and bake until golden brown, 35 to 40 minutes.<br />\r\n</p>"}]}