{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20120206-vegan-pizza-potatoes-zucchini-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["mashed potatoes", "pizza", "potatoes", "rosemary", "The Food Lab", "the pizza lab", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Easy Pan Pizza With Potato, Onion, and Rosemary (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/02/easy-pan-pizza-potato-onion-rosemary-vegan-recipe.html", "description": "Ok, so maybe it's a bit of a carb overload, but potato on pizza is <em>truly</em> great, especially when the potato slices brown and crisp around the edges and the dollops of mashed potato come out crusted and golden, like these ones do.", "totalTime": "1 day (including time for dough to rise)", "recipeYield": "serves 4 (makes two 10-inch pizzas)", "recipeCategory": ["Bread", "Dairy-Free", "Mains", "Mashed Potatoes", "Pizza", "The Pizza Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/01/foolproof-pan-pizza-recipe.html\">Foolproof Pan Pizza</a> (dough only), or 1 1/2 pounds store-bought pizza dough", "1 pound Yukon gold potatoes (about 3 medium)", "Kosher salt", "1/2 cup extra virgin olive oil", "1 small yellow onion, finely sliced", "2 tablespoons roughly chopped fresh rosemary leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into two equal balls. Pour 2 tablespoons of oil in the bottom of each of two 10-inch cast iron skillet or round cake pans. Place 1 ball of dough in each pan and turn to coat evenly with oil. Using a flat palm, press the dough around the pan, flattening it slightly and spreading oil around the entire bottom and edges of the pan. Cover tightly with plastic wrap and let the dough sit at room temperature for two hours. After the first hour, adjust an oven rack to the lower middle position and preheat oven to 550°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While dough rises, make mashed potatoes. Peel and roughly dice 1 potato and cover with salted water in a medium saucepan. Cook until tender, about 15 minutes. Drain and press potato through ricer, returning to now-empty pot. Add two tablespoons extra-virgin olive oil, season with salt and pepper, and fold with a wooden spoon until incorporated. Set mashed potatoes aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, slice remaining two potatoes into 1/8th inch thick slices, using a mandoline-style cutter if necessary. Transfer slices to a large bowl filled with water. When all potatoes are sliced, drain and rinse, then carefully dry slices in a salad spinner or with paper towels. Return to bowl, add onions, remaining 2 tablespoons olive oil olive oil, and rosemary, and season with salt and pepper. Toss to coat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After dough has risen for two hours, dough should be mostly filling in the pan up to the edges. Use your fingertips to press it around until it fills in every corner, popping any large bubbles that appear. Lift up one edge of the dough to let any air bubbles underneath escape and repeat, moving around the dough until there are no air bubbles left underneath and the dough is evenly spread around the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer potatoes slices on top of pizzas, letting some onion pieces cling to them and shingling them to make a pretty pattern. Add any remaining onion slices, rosemary, and oil to top of pizzas. Use a small spoon to add mashed potatoes to top of pizzas in 1-inch dollops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until potatoes are browned around the edges, mashed potatoes are crisp and browned, and bottom of pizzas is a crisp golden brown, about 15 minutes. Remove from oven and serve immediately.</p>"}]}