{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130508-ramp-bacon-dumplings-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "dumpling", "pork", "ramps"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bacon and Ramp Dumplings", "link": "https://www.seriouseats.com/recipes/2013/05/bacon-and-ramp-dumplings-recipe.html", "description": "Ramps and bacon go exceptionally well together. Here they go hand in hand inside a crisp Chinese-style dumpling.", "totalTime": "1 1/2 hours", "recipeYield": "Makes about 40 dumplings", "recipeCategory": ["Bacon", "Chinese", "Mains", "Pork"], "recipeIngredient": ["<strong>For the Dough:</strong>", "2 cups (10 ounces) all purpose flour", "1 cup boiling water", "&nbsp;", "<strong>For the Filling</strong>:", "2 tablespoons vegetable oil", "1/2 pound ramps, whites finely sliced, greens roughly chopped", "2 cups roughly chopped fresh napa cabbage", "1/2 teaspoon kosher salt", "4 ounces bacon, roughly chopped", "4 ounces fatty ground pork", "1/4-inch disk fresh ginger, roughly chopped", "1 teaspoon soy sauce", "2 teaspoons sugar", "2 teaspoons toasted sesame oil", "1 tablespoon Shaoxing wine or dry sherry", "&nbsp;", "<strong>To Serve</strong>:", "2 tablespoons soy sauce", "2 tablespoons Chinkiang vinegar (or rice vinegar)", "1 teaspoon sugar", "1 teaspoon finely minced ginger", "Vegetable oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough</strong>: place flour in bowl of food processor. With machine running, slowly drizzle in water until cohesive dough is formed (you probably won't need all the water). Allow dough to ride around processor for 30 seconds. Form into a ball using floured hands and transfer to a bowl. Cover with a damp towel and let rest for at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Heat vegetable oil in a wok over high heat until smoking. Add ramps and cook, stirring and tossing frequently, until lightly browned and fragrant, 30 seconds to 1 minute. Transfer to a bowl and wipe out wok. Place cabbage and salt in food processor and pulse until finely chopped, about ten 1-second pulses. Transfer to a fine-meshed strainer set over a bowl. Allow to rest for 30 minutes to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine ramps, drained cabbage, bacon, pork, ginger, soy sauce, sugar, sesame oil, and rice wine in a food processor and pulse until a paste-like mixture is formed, about 15 short pulses, scraping down sides as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Microwave a small ball of the filling in a bowl for 10 seconds and eat it to taste for seasoning. Add more salt, soy sauce, or sugar as necessary and repeat tasting/seasoning step until the filling tastes like you want it to. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Dumplings</strong>: Divide dough into 4 sections, and each section into 10 small tablespoon-sized balls, making 40 balls total. On a well-floured work surface, roll each ball into a round 3 1/2- to 4-inches in diameter. Stack wrappers and keep under plastic until all of them are rolled out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form dumplings, place 1 tablespoon of filling in the center of a wrapper. Moisten the edges of the wrapper with a wet fingertip or a pastry brush. Fold in half and pinch the bottom-right corner closed. Pleat the front edge of the wrapper repeatedly, pinching the edge closed after each pleat until the entire dumpling is sealed. Transfer sealed dumplings to a lightly floured wooden or parchment-lined board.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Combine soy sauce, vinegar, sugar, and ginger in a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Add a 6 to 12 dumplings and boil until they float (about 1 minute). Continue boiling for 2 minutes longer, then transfer to a plate with a wire-mesh spider or slotted spoon. Heat 3 tablespoons vegetable oil in a 10-inch nonstick skillet or the bottom of a well-seasoned cast wok over medium heat until shimmering. Carefully add dumplings flat-side down and cook, swirling occasionally, until bottom of dumplings are golden brown and crisp. Serve immediately with dipping sauce. Repeat step 7 with remaining dumplings, working in batches.</p>"}]}