{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/07062013-brown-butter-lasagna-noodles.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["egg", "pasta", "poached eggs", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Torn Pasta Sheets With Brown Butter, Herbs, and Poached Eggs", "link": "https://www.seriouseats.com/recipes/2013/07/torn-pasta-sheets-butter-herbs-poached-eggs-recipe.html", "description": "This buttery tangle of torn lasagna noodles gets amped up with a touch of umami-rich soy sauce, brightened with fresh lemon juice, enriched with grated cheese, and made into a complete meal with the addition of a few runny poached eggs.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Pasta", "Poached Eggs", "Poaching", "Vegetarian"], "recipeIngredient": ["3/4 pound dried lasagna sheets, broken into pieces", "2 teaspoons white, rice or apple cider vinegar", "4 eggs", "3/4 stick (6 tablespoons) butter", "1 medium shallot, minced (about 1/4 cup)", "1/3 cup grated romano, pecorino or parmesan cheese", "2 tablespoons juice from 1 lemon", "1 teaspoon soy sauce", "1/2 cup mixed chopped fresh herbs, such as dill, parsley, chives, and basil", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot and a medium saucepan with water and bring both to a boil over high heat. Add pasta to large pot and cook until al dente, 12 to 14 minutes. Reserve 1/4 cup pasta water, then drain pasta. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pasta cooks, poach eggs in smaller pot: add vinegar to water and reduce heat to low. When water drops to a simmer, crack eggs one by one into a small bowl, transfer to a fine mesh strainer, swirl gently to drain excess whites, then slowly lower eggs into water, tipping them out of the strainer as they begin to set. Repeat until all eggs are in the water. Poach, stirring gently to prevent sticking, until eggs are barely set, 2 to 3 minutes. Using a slotted spoon, transfer eggs to a paper-towel-lined plate to drain. Season eggs with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry large pot and set over medium heat. Add butter. When butter foams, add shallot and cook, stirring, until shallots and butter are golden brown, 6-8 minutes. Reduce heat to low, add drained pasta and reserved pasta water and stir until pasta is well-coated. Turn off heat. Add grated cheese, soy sauce, lemon juice, and herbs, and stir to combine. Divide pasta between 4 serving plates and top each serving with a poached egg. Serve immediately.</p>"}]}