{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130117-236662-cook-the-book-kimchi-grilled-cheese.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grilled cheese", "kimchi", "Lauryn Chun", "sandwich", "The Kimchi Cookbook", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled MILKimcheeze Sandwich from 'The Kimchi Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/01/grilled-milkimcheeze-sandwich-from-the-kimchi-cookbook-recipe.html", "description": "Okay. Grilled cheese is not the kind of dish that really needs a recipe. Bread, cheese, butter, plus a moderately hot pan, and dinner is served, right? Sure, these steps will lead to a tasty sandwich, but it is easy to get into a grilled cheese rut without the proper inspiration. Enter the <strong>Grilled MILKimcheeze</strong> from <strong>Lauryn Chun's</strong> <em><a href=\"http://www.amazon.com/The-Kimchi-Cookbook-Traditional-Modern/dp/1607743353/?tag=serieats-20\">Kimchi Cookbook</a></em>. Nothing more than a standard gooey warm sandwich, except for the generous application of napa cabbage kimchi. Not only does the kimchi add welcome crunch to the melty cheese, but its spicy funk adds an addictive layer of flavor to the lunchtime favorite.", "totalTime": "10 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Mains", "Sandwiches", "Vegetarian"], "recipeIngredient": ["1/4 cup unsalted butter", "8 (1/2-inch-thick) slices country-style bread", "16 ounces cheese, such as Havarti, Monterey jack, or Swiss, sliced thick", "1 cup any napa cabbage kimchi, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a griddle or a large skillet over medium-low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter the slices of bread on one side and place them on the skillet, butter side down (you may need to do this in batches). Distribute the cheese evenly on half of the bread slices and cook until slightly melted. Place the kimchi on top of the cheese, top with the remaining toasty bread slices, and cook for 1 minute more, or until the cheese is completely melted and the bread is toasted golden brown. Using a spatula, gently flip the sandwich and cook for 1 minute longer. Remove from the pan and cut each sandwich in half for easier handling. If working in batches, repeat with the remaining ingredients. Serve hot.</p>"}]}