{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131009-269101-banana-crumb-cake.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["banana", "breakfast sweet", "cake", "chocolate", "coffee cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Banana Crumb Cake", "link": "https://www.seriouseats.com/recipes/2013/10/banana-crumb-cake-homemade-entenmanns-banana-cake-recipe.html", "description": "What do you get when you top a moist buttermilk banana cake with sandy crumbs and chocolate ganache squiggles? A darn good knock off of Entenmann's Banana Crunch Cake.", "totalTime": "1 hour and 30 minutes", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Banana", "Breakfast Sweets", "Cakes"], "recipeIngredient": ["<strong>For the Crumb Topping</strong>", "1 1/2 cups all purpose flour", "3/4 cup light brown sugar", "1/4 cup sugar", "6 tablespoons unsalted butter, melted", " ", "<strong>For the Cake</strong>", "2 cups (9 ounces) flour", "1 teaspoon baking soda ", "1 teaspoon cinnamon ", " 1/2 teaspoon salt ", " 1/4 cup buttermilk ", "2 teaspoons vanilla ", "8 Tablespoons unsalted butter, soften to room temperature", "1 cup (7 ounces) sugar ", "2 large eggs", "1 cup mashed ripe bananas (2 large bananas or 3 medium bananas)", " ", "<strong>For the Chocolate topping</strong>", "2 ounces 72% cacao chocolate, melted in the microwave or double boiler", "2 tablespoons heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the crumb topping</strong>: In a medium bowl, whisk together flour, sugars and cinnamon until thoroughly combined. Drizzle melted butter over the flour mixture use a fork to incorporate and form a fine, sandy crumb (if you prefer a more compact crumb, please see instructions above). Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move oven rack to the center position and preheat oven to 350°F. Grease and flour cake pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cake</strong>: In a medium bowl, whisk together flour, cinnamon, baking soda, and salt. Set aside. Whisk together buttermilk and vanilla in a small bowl or measuring cup. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl or the bowl of a stand mixer cream butter and sugar together. Beat in eggs, one at a time, scraping down the sides to fully incorporate each addition. Add half of the flour mixture to the batter, mix on medium to just incorporate, repeat the process adding the buttermilk mixture and the remaining flour. Stir in the mashed bananas until just combined. Pour into prepared pan and top with crumbs. Bake until cake is golden brown and a cake tester inserted into the middle comes out clean, about 50 to 60 minutes. Remove from oven to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While cake is cooling, quickly whisk together chocolate and cream in a small bowl, then transfer mixture to a pastry bag fitted with a small round tip. Once cake has cooled for about 20 minutes, pipe chocolate in wavy diagonal lines across the surface of the cake&mdash;it will take several hours for the chocolate to firm up. Cover and store leftovers up to three days.</p>"}]}