{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/042413-249105-cook-the-book-jeweled-brown-basmati-rice-quinoa.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["brown rice", "Cook the Book", "louisa shafia", "nuts", "quinoa", "rice", "the new persian kitchen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jeweled Brown Basmati Rice and Quinoa (Morassa Polo) from 'The New Persian Kitchen'", "link": "https://www.seriouseats.com/recipes/2013/04/jeweled-brown-basmati-rice-and-quinoa-morassa.html", "description": "Jeweled rice is a magnificent dish. Adorned with dried fruit, toasted nuts, rose petals, and pomegranate seeds, it is a panoply of flavors and colors. In <strong><a href=\"http://lucidfood.com/about-louisa/\">Lousia Shafia's</a></strong> <em><a href=\"http://www.amazon.com/The-Persian-Kitchen-Louisa-Shafia/dp/1607743574/?tag=serieats-20\">The New Persian Kitchen</a></em>, the jeweled rice is made even more compelling with a combination of grains included. The mixture of quinoa and brown basmati rice adds an earthy complexity to the dish that counters the sweet and rich flavors from the toppings.", "totalTime": "about 2 hours", "recipeYield": "serves 6 to 8", "recipeCategory": ["Cook the Book", "Gluten-Free", "Quinoa", "Rice", "Sides", "Vegetarian"], "recipeIngredient": ["1 cup brown basmati rice, soaked in cold water for 1 hour", "1 1/2 cups quinoa, soaked in cold water for 1 hour", "5 tablespoons grapeseed oil", "Sea salt", "4 cups water, boiling", "2 tablespoons butter or \u2028unrefined coconut oil, \u2028at room temperature", "1 large yellow onion, minced", "1/2 cup barberries, soaked in warm water for 1/2 hour \u2028and drained", "1 cup minced dried apricots", "1 tablespoon dried rose petals or dried whole rosebuds pulled apart and stems removed, plus extra for garnish", "1 teaspoon ground cumin", "1/2 teaspoon ground cinnamon", "1 teaspoon ground cardamom", "1/2 cup pistachios, lightly toasted and coarsely chopped", "1/2 cup slivered blanched almonds, lightly toasted", "1/2 teaspoon saffron, ground and steeped in 1 tablespoon hot water", "Pomegranate seeds, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the rice and quinoa and rinse under cold water. Heat a medium stockpot over low heat and add the rice and quinoa, 2 tablespoons of the oil, and a pinch of salt. Sauté the grains, stirring often to prevent sticking for about 5 minutes until dry and fragrant. Add the boiling water and return to a boil; turn down the heat to very low and cook, covered, for 40 minutes. Turn off the heat and let the grains rest for 10 minutes, then toss in the butter and fluff with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the grains cook, heat a large skillet over medium heat and sauté the onion in the remaining 3 tablespoons oil for about 15 minutes, until lightly browned. Add the barberries, apricots, rose petals, cumin, cinnamon, and cardamom. Cook for about 5 minutes, until heated through. Reserve half of the pistachios and almonds for garnish, and add the rest of the nuts to the skillet. Season with salt, and remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss the fruit and nuts with the grains and drizzle in the saffron. Season with salt. Garnish with the remaining nuts, a few rose petals, and the pomegranate seeds.</p>"}]}