{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130211-240432-dinner-tonight-skirt-steak-tacos-guacamole-rajas-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["Dinner Tonight", "fajitas", "Mexican", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Skirt Steak With Guacamole and Rajas", "link": "https://www.seriouseats.com/recipes/2013/02/grilled-skirt-steak-guacamole-rajas-recipe.html", "description": "Tasting sort of like mini-burritos with all the extraneous ingredients expelled, two of these make for a solid meal. Just remember that the skirt steak needs to be coddled, or it will pay back your carelessness by being tough and chewy. Basically, it needs to be treated like the steak it is.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Beef", "Dinner Tonight", "Mains", "Mexican"], "recipeIngredient": ["1 pound skirt steak, trimmed of any fat or silver-skin", "2 tablespoons fresh juice from about 2 limes, plus 1 quartered lime for garnish ", "Kosher salt and freshly ground black pepper", "2 whole poblano peppers", "2 ripe avocados ", "1 medium clove garlic, minced (about 1 teaspoon)", "1/4 white onion, finely chopped (about 1/4 cup)", "1 jalapeño, stemmed, seeded, chopped (about 1 tablespoon)", "1/4 cup fresh cilantro leaves, chopped  ", "8 small radishes, ends trimmed, thinly sliced ", "8 (10-inch) flour tortillas  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the skirt steak into four equally sized portions. Season both sides with salt and pepper. Add 1 tablespoon lime juice to a small baking dish, add the skirt steak, tossing it in the juice. Set aside for ten minutes, flipping the pieces halfway through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust rack to four inches below broiler element. Preheat broiler to high. Place the poblanos on a sheet pan wrapped in aluminum foil, and set under the broiler. Cook until charred on top, 3 to 4 minutes. Flip char on the other side, another three to four minutes. Transfer peppers to a medium bowl, cover tightly in plastic wrap, and let steam for ten minutes. Remove blackened skin with your fingers. Cut off the stems, remove the seeds, and then cut the flesh into 1/4-inch wide strips. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skirt steak pieces from the dish, and use a paper towel to dry the pieces. Place the pieces on the sheet pan and set underneath the broiler. Cook until browned on the top, 3 to 4 minutes, rotating the pan halfway through. Flip the steaks and brown on the other side, until thickest part of steak registers 125 to 130°F on an instant read thermometer and surface is well browned, 3 to 4 minutes longer. Transfer to cutting board and allow to rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, plit avocados in half, remove pits, and scoop out flesh into a medium bowl. Mash with a potato masher or large spoon. Stir in the garlic, white onion, jalapeño, and a tablespoon of lime juice. Season with salt to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the tortillas on a 10-inch skillet set over medium heat for a few seconds until soft and pliant. Slice steak thinly against the grain. To construct for serving, add a few pieces of sliced steak to each tortilla, and top with rajas, guacamole, and sliced radish. Serve with lime wedges. </p>"}]}