{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130626-257378-dinner-tonight-crispy-noodles-shrimp-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Dinner Tonight", "noodle", "quick", "shrimp", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-Fried Noodles with Shrimp, Snap Pea, and Carrot", "link": "https://www.seriouseats.com/recipes/2013/07/pan-fried-noodles-shrimp-snap-peas-recipe.html", "description": "Why go to the trouble of boiling noodles, draining them in a colander, rinsing them under cold water, draining them again, and then stir-frying them? Sure, sometimes I love making things needlessly difficult for myself, but this is not one of those cases. Instead, I was after a crunchy noodle base, which would maintain its integrity even after toppings and a strong sauce are poured on top.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Dinner Tonight", "Mains", "Pasta", "Shrimp", "Stir Frying"], "recipeIngredient": ["1/2 pound thin Hong Kong-style noodles ", "6 tablespoons canola oil, divided", "1/2 cup water ", "1 tablespoon soy sauce ", "1 tablespoon oyster sauce", "1 teaspoon sesame oil ", "1 teaspoon white rice vinegar ", "1 teaspoon Shaoxing wine ", "1 teaspoon sugar ", "Black pepper ", "1 tablespoon peeled and minced fresh ginger.", "2 medium garlic cloves, minced (about 2 teaspoon)", "1/2 cup snap peas ", "1/4 cup carrot", "1/2 pound shrimp, peeled and deveined ", "1 tablespoon cornstarch mixed with 3 tablespoons cold water", "2 scallions, ends trimmed, thinly sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add the noodles and cook until tender, about 3 minutes. Drain noodles in a colander and rinse with cold water. Drain again, and then dry noodles on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 4 tablespoons of oil in a large non-skillet over high heat. When oil begins to smoke, add the noodles and toss well with the oil until the noodles are evenly spread out in the skillet. Stir the noodles every 30 seconds or so until lightly browned and starting to crisp up. Reduce head to medium-high or medium if they start to burn. Continue stirring and flipping until noodles are brown and crisp. Set noodles aside. Wipe out skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, stir together the water, soy sauce, oyster sauce, sesame oil, white rice vinegar, Shaoxing wine, sugar, and a few grinds of black pepper in a medium bowl. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons oil in the cleaned non-stick skillet over high heat until just starting to smoke. Add garlic and ginger and stir fry until very fragrant, about 15 seconds. Add snap peas and carrots and stir fry until tender but still a bit crunchy, 2 to 3 minutes. Add shrimp and cook until pink and plump, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the sauce and stir well. Slowly drizzle in the cornstarch mixture, stir well, and cook until sauce starts to thicken. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the crispy noodles between four plates and top with the shrimp and snap pea mixture. Garnish with scallions and serve. </p>"}]}