{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131213-276245-cook-the-book-kamo-nanban-soba.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "Cook the Book", "duck", "Japanese", "japanese soul cooking", "soba", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kamo Nanban Soba From 'Japanese Soul Cooking'", "link": "https://www.seriouseats.com/recipes/2013/12/kamo-nanban-soba-recipe-from-japanese-soul-cooking.html", "description": "<strong><a href=\"http://www.maisononyc.com/\">Tadashi Ono</a></strong> and <strong><a href=\"http://www.harrissalat.com/about.html\">Harris Salat</a></strong> proclaim that this duck and soba dish in their new cookbook, <em><a href=\"http://www.amazon.com/Japanese-Soul-Cooking-Tonkatsu-Kitchens/dp/1607743523/?tag=serieats-20\">Japanese Soul Cooking</a></em>, is one of their favorites. What's not to like? Hot soba noodles are served in a warm dashi and soy broth with slivers of perfectly cooked duck breast and green onions fried in duck fat. A final dollop of wasabi is a key accent, brightening the flavor of the rich bird. Best of all, it's an impressive-looking dish that isn't much harder than boiling a pot of noodles.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Japanese", "Mains", "Other Meats", "Pasta", "Soups and Stews"], "recipeIngredient": ["6 cups <a href=\"http://www.seriouseats.com/recipes/2009/10/how-to-make-dashi-asian-miso-soup-bonito-flakes-kelp-kombu.html\">dashi</a>", "3/4 cup <a href=\"http://www.seriouseats.com/recipes/2013/12/kaeshi-from-japanese-soul-cooking-recipe.html\">kaeshi</a> ", "6 tablespoons mirin", "2 duck breasts (about 1 1/2 pounds total)", "Salt", "2 negi, white parts only, sliced into 1 1/2-inch pieces", "4 servings soba (400 grams)", "1/4 cup thinly sliced negi or scallion", "4 teaspoons wasabi", "Shichimi togarashi"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the hot soba broth, add the dashi, kaeshi, and mirin to a saucepan and bring to a boil over high heat. Remove from the heat and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the duck, trim off excess fat from the duck breasts. Cut crisscross notches about 1/8 inch deep into the duck’s skin, so the skin doesn’t shrink when cooking and the layer of fat under the skin renders easier. Season the duck with salt on both sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a dry skillet over medium heat. Lay the duck breasts in the skillet, skin side down. Cook for about 2 minutes, until the skin browns and fat begins to render. Turn the duck, and reduce the heat to low. Cook for 3 more minutes and turn again, so the skin side is again down. Cook for 2 minutes and transfer the duck to a cutting board. The duck will be cooked rare.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour out the fat that has accumulated in the skillet and discard. Return the skillet to the heat. Add the 1 1/2-inch pieces negi and cook for about 1 minute, until the negi caramelizes slightly. Transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice the duck, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the soba, bring at least 3 quarts of unsalted water to a boil over high heat. Add soba, making sure to pull off the plastic band from each serving. Swirl the noodles with chopsticks to separate them. Cook the noodles for 4 minutes. Drain the soba in a colander. If not serving immediately, cool the soba under cold, running water and reheat just before eating by plunging the noodles into boiling water for 10 seconds, swirling constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the duck slices and negi to the broth. Return the broth to a boil over medium heat. Turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the soba noodles among 4 bowls. Use a ladle to pour the broth over the soba. Use chopsticks or tongs to pick up the duck slices and negi from the saucepan, and arrange them over the soba. Garnish each bowl with about 1 tablespoon sliced negi and 1 teaspoon wasabi. Season with shichimi togarashi, to taste.</p>"}]}