{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130227-241617-british-bites-buttery-rowies.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["biscuits", "british bites", "buttery rowies", "quick breads", "scones"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Buttery Rowies", "link": "https://www.seriouseats.com/recipes/2013/02/buttery-rowies-recipe.html", "description": "Buttery rowies are native to Aberdeen, and are typically made with lard and served with butter and jam. This is a version of the crisp, layered rolls that uses salted butter to achieve the fatty layers and adds a tablespoon of brown sugar to the last layer of butter. Adding a thin layer of brown sugar gives the rolls a bit of sweetness that complements the salty butter perfectly.", "totalTime": "1 hour 45 minutes", "recipeYield": "Makes 16 rowies", "recipeCategory": ["Breakfast and Brunch", "British Bites", "Yeast Bread"], "recipeIngredient": ["2 1/4 cups (about 11 1/4 ounces) all-purpose flour", "1 1/2 teaspoon kosher salt", "2 1/4 teaspoons (1/4 ounce package) instant yeast", "1/4 teaspoon salt", "1 cup warm water", "1 cup (2 sticks) salted butter, room temperature", "1 tablespoon brown sugar", "1 egg white, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a standing mixer fitted with a paddle attachment, mix together the flour, salt, yeast, and salt on low speed just until combined. With the mixer, add the water in a thin stream and mix just until all the ingredients are incorporated. Continue to mix until a soft dough forms and comes away from the sides of the bowl, about 5 minutes. Cover the bowl with a clean kitchen towel and let the dough rest for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the butter in half, then cut half the softened butter into slices 1/4 inch thick. When the dough is ready, turn it out onto a floured work surface. Pat the dough into a rectangle about 12- by 6-inches and about a 1/2-inch thick. Drop half of the butter slices evenly over the rectangle. Using a thin spatula and, spread the butter evenly over the dough, leaving a 1 inch border all around. Fold the dough crosswise into thirds to create a 4- by 6-inch rectangle and pinch the edges tightly to seal. Rotate dough 90 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a rolling pin, re-roll the dough gently into a 12- by 6-inch rectangle. Spread the remaining butter slices evenly over the rectangle leaving a 1 inch border, then sprinkle brown sugar on top. Fold the dough into thirds again crosswise to create a 4- by 6-inch rectangle and pinch the edges tightly to seal. Let the dough rest for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 400°F. Line a rimmed baking sheet with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the rolling pin to roll the dough gently into a rectangle about 10- by 8-inches and 3/4 inch thick. Cut dough in half crosswise into two 4- by 10-inch rectangles. Cut each half into quarters crosswise into four 4- by 2 1/2-inch rectangles (8 rectangles total). Cut each rectangle into two triangles to create 16 triangles total. Place the triangles on the prepared baking sheet, Cover with a clean kitchen towel and let rest 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the rowies have rested for 30 minutes and are beginning to become puffy, brush them with egg white and bake until golden brown, about 20 minutes. Remove from oven and let rest for 10 minutes before serving.</p>"}]}