{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130424-248726-salmagundi.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["chicken", "salmagundi", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salmagundi", "link": "https://www.seriouseats.com/recipes/2013/04/salmagundi-recipe.html", "description": "Salmagundi is more of a concept than a recipe.  Essentially, it is a large composed salad that incorporates meat, seafood, cooked vegetables, raw vegetables, fruits, and nuts and is arranged in an elaborate way.  Think of it as the British answer to Salad Niçoise.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["British Bites", "Chicken", "Mains", "Salads", "Shrimp"], "recipeIngredient": ["1 1/2 pounds chicken pieces (bone in, skin on thighs are ideal)", "3/4 pounds small potatoes", "6 sprigs thyme", "4 medium cloves garlic", "1 tablespoon vegetable oil", "Kosher salt and freshly ground black pepper", "1 tablespoon butter, divided", "2 tablespoons sliced almonds", "1/2 bunch asparagus", "1 small shallot, finely chopped", "1/4 pound green beans", "1 teaspoon grated lemon zest, from 1 lemon", "1/2 pound medium shrimp, peeled and deveined", "1 tablespoon finely chopped chives", "6 tablespoons red wine vinegar", "1/2 teaspoon grainy mustard", "1 tablespoon finely chopped tarragon ", "3 tablespoons olive oil", "8 ounces mixed greens", "6 radishes, thinly sliced", "1 pear, cored and thinly sliced", "2 beefsteak tomatoes, quartered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the oven rack to middle position and preheat to 400°F. Place chicken, potatoes, thyme, and garlic in a roasting pan. Drizzle with vegetable oil then sprinkle liberally with salt and pepper. Using your hands, toss all the ingredients together so they are evenly coated. Place in the oven and roast until potatoes are soft, and chicken is fully cooked and golden brown, about 30 minutes. Remove from oven and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 1 teaspoon butter in a large nonstick skillet over medium-high heat. When foaming subsides, add the almonds and toss to coat. Cook until fragrant, about 2 minutes. Add the asparagus and toss to coat with almonds and butter. Cover and cook, shaking pan occasioanally, until asparagus is just tender, about 5 minutes. Season to taste with salt and pepper. Transfer to a plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium-high heat and melt another teaspoon of butter. Add the shallots and cook, stirring, until just beginning to soften, about 2 minutes. Add the green beans and toss to coat with shallots and butter.  Cover and cook, shaking pan occasioanally, until beans are just tender, about 5 minutes. Season to taste with salt and pepper. Transfer to a plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium-high heat and melt remaining teaspoon butter. Add the lemon zest and cook until fragrant, about 1 minute. Add the shrimp and cook, stirring often, until shrimp is just cooked through, about 3 minutes. Add chives and season to taste with salt and pepper. Transfer to a plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together red wine vinegar, mustard, tarragon, and olie oil. Season to taste with salt and pepper. In a large bowl, dress the lettuce with some of the vinaigrette and place on a large serving platter. Using the vinaigrette dress the radishes and place on one section of the platter, then repeat with sliced pears and tomatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the asparagus and the green beans on the platter, followed by shrimp, chicken, and potatoes topped with the whole roasted garlic cloves. Drizzle any remaining vinaigrette over the vegetables and serve immediately.</p>"}]}