{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20131001-268080-dinner-tonight-walleye-roasted-grapes-potatoes-2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["easy", "fish", "grape", "potato", "quick", "seafood", "walleye"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Walleye With Roasted Grapes and Fingerling Potatoes", "link": "https://www.seriouseats.com/recipes/2013/10/walleye-roasted-grapes-fingerling-potatoes-recipe.html", "description": "While I consume most of my grapes in liquid form, I do look forward to fall harvest in the Upper Midwest, when I can pick up little red grapes just bursting with acidity. They are great on their own, but when roasted they gain extra depth without simply turning into a sweet grape jam.", "totalTime": "30 mintues", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Fish", "Grapes", "Mains", "Potato"], "recipeIngredient": ["1 pound small fingerling potatoes", "4 tablespoons olive oil, divided ", "Kosher salt and freshly ground black pepper", "10 ounces tart red seedless grapes ", "4 walleye or other white fish fillets such as cod, haddock, or tilapia, about 6 ounces each ", "1 medium clove garlic, thinly sliced ", "1 lemon, half left whole, half thinly sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 450&deg;F. Add potatoes to a rimmed 12- by 18-inch baking sheet and drizzle with 2 tablespoons olive oil and season with a pinch of salt and pepper. Toss until evenly coated. Transfer sheet to oven and cook for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove sheet pan from oven, and use a pair of tongs to move the potatoes to one end.  Drizzle a tablespoon of oil over the empty end, and then add the grapes and the walleye fillets skin-side down. Season each fish fillet with a pinch of salt and pepper, and then top with few slices of garlic and a couple slices of lemon. Drizzle remaining tablespoon of olive oil over the fish. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the sheet pan to the oven and cook until fish is fully cooked and potatoes are tender, 10 to 12 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the fish, grapes, and potatoes between four plates. Squeeze some juice from the uncut lemon half over each plate. Serve immediately. </p>"}]}