{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131114-Preserved-Cranberry-Chutney-overhead.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["Christmas", "chutney", "cranberry", "preserve", "quince", "tangerine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cranberry Quince Chutney", "link": "https://www.seriouseats.com/recipes/2013/11/cranberry-quince-chutney.html", "description": "This wintry chutney, spiced with clove and bright with cranberries and tangerine, is versatile for the holidays either as a gift or on a cheese tray. Plus, the natural pectin in the cranberries helps it set even with a short cooking time, so you can spend less time preserving and more time partying", "totalTime": "2 hours", "recipeYield": "Makes 9 half-pint jars", "recipeCategory": ["Condiments and Sauces", "Cranberry", "Preserved"], "recipeIngredient": ["24 ounces (2 bags) whole fresh cranberries", "2 medium quince, cored and finely diced (about 2 cups)", "3/4 cup dried apricots (6 ounces), minced", "1 1/2 cups red or white onion or a combination, finely chopped", "2 cups white or apple cider vinegar", "1 tangerine, zest & juice (1/2 cup)", "1 cup light brown sugar, packed", "2 cups white sugar", "2 tablespoons fresh ginger, peeled and finely grated", "2 garlic cloves, finely grated", "1 tablespoon mustard seed", "1 whole cinnamon stick", "1/2 teaspoon ground cloves", "1 teaspoon ground allspice", "1/2 tsp cayenne pepper", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare boiling water canner and sterilize 9 half-pint jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids, and rings to sit in hot water until you need them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, you'll build the brine that will form the base of your chutney. In a large, heavy-bottomed, non-reactive pot, bring brown sugar, white sugar, vinegar, mustard seeds, cinnamon stick, cloves, allspice, cayenne pepper and salt to a simmer and stir to dissolve sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add quince, onion, garlic, ginger, and apricots and simmer until quince feels slightly softened, 2-5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cranberries, tangerine zest, and tangerine juice and bring the whole mixture to a boil, stirring every few minutes.  Allow mixture to boil, uncovered, for 8-10 minutes while cranberries pop and break apart. Once cranberries have broken down into the mixture slightly (a few whole berries is fine) remove mixture from heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle into prepared jars, leaving a half inch of headspace. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight.</p>"}]}