{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131219-266270-candycanecookie5.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cookie", "holiday cookie", "pecan", "peppermint", "wedding cookie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peppermint Snowball Cookies", "link": "https://www.seriouseats.com/recipes/2013/12/peppermint-snowball-wedding-cookies.html", "description": "All it takes to mint-ify these cookies is is a simple swap of the usual vanilla extract for peppermint, and instead of dusting the cookies twice with confectioners' sugar, you conduct the second coating with crushed candy canes. The resulting cookies are kissed with mint, which works rather well with the rich butter and nut mixture. It doesn't give this cookie a completely different personality, but it's different enough to make you appreciate snowballs anew.", "totalTime": "45 minutes", "recipeYield": "Makes about 3 dozen cookies", "recipeCategory": ["Cakespy", "Cookies", "Nuts"], "recipeIngredient": ["1 cup (2 sticks, or 8 ounces) butter, softened", "1 cup (about 4 ounces) confectioners' sugar, divided", "1/2 teaspoon salt", "1 teaspoon pure peppermint extract", "2 cups (about 7 3/4 ounces) finely chopped pecans", "2 cups (about 8 1/2 ounces) all purpose flour", "3 medium candy canes, crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, cream the butter with 1/2 cup of the confectioners' sugar and the peppermint extract. Mix in the flour, nuts, and salt until the dough comes together in a slightly crumbly but cohesive form. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll about 1 tablespoon or so of dough into balls and place on an ungreased cookie sheet with about an inch of space for each cookie (they will spread only very slightly).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 minutes, or until the sides are set and the bottoms are a slightly toasty color. It's better to undercook these cookies than to overcook them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the cookies cool on the sheets for about five minutes. They are extremely fragile at this point, and if you handle them too soon, they will crumble in your hand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining confectioners' sugar in a shallow bowl. In a second shallow bowl, place the crushed candy canes. While the cookies are still quite warm, roll them in the sugar. Gently tap off any excess sugar. Remember to handle them very gently as they are still fragile. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, roll the cookies in the crushed candy cane mixture. You should have cookies which are snowy and studded with candy cane bits.</p>"}]}