{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2013/08/GarlicParmFrenchToast.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bread", "breakfast", "brunch", "French toast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Savory Cheese-Crusted French Toast With Garlic and Parmesan", "link": "https://www.seriouseats.com/recipes/2013/08/savory-french-toast-recipe.html", "description": "Savory French toast made with plenty of garlic and herbs, all crusted in crisply browned Parmesan cheese.", "totalTime": "30 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Father's Day", "French Toast", "Mains", "Mother's Day", "The Food Lab"], "recipeIngredient": ["4 eggs", "3/4 cup whole milk or half and half", "3 medium cloves garlic, minced (about 1 tablespoon)", "Pinch red pepper flakes", "1/4 cup finely minced fresh parsley leaves, plus more to garnish", "4 ounces finely grated Parmesan cheese, divided", "Kosher salt and freshly ground black pepper", "4 tablespoons (1/4 stick) unsalted butter", "8 (1/2-inch) slices hearty country bread, challah, or brioche, preferably one day old", "1/4 cup finely sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 200°F. In a large bowl, whisk together eggs, milk, garlic, red pepper flakes, parsley, 1 ounce cheese, and salt and pepper to taste. Place remaining Parmesan on a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons butter in a large non-stick or cast iron skillet or griddle over medium heat until melted. Working one slice at a time, dip bread in egg mixture, then dredge in grated Parmesan to coat well on both sides. Lay in skillet. Repeat until four slices of bread are in skillet. Cook, swirling pan and flipping occasionally, until deep golden brown on both sides, about 8 minutes total. Transfer to a large plate and keep warm in the oven. Repeat with remaining butter and second batch of bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle french toast with scallions and more chopped parsley and serve immediately.</p>"}]}