{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130122-237460-cook-the-book-hot-and-sour-soup.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Dave Becker", "hot and sour soup", "soup", "Stewed"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hot and Sour Soup from 'Stewed'", "link": "https://www.seriouseats.com/recipes/2013/01/hot-and-sour-soup-from-stewed.html", "description": "Is it just me or is hot and sour soup one of the weirdest in the Chinese take-out canon? Most bowls consist of a gloppy mass of orange sweet liquid, giving way to a slightly sour and slightly spicy finish. Bites of mushroom, pea, and tofu add a bit of interest, but they can't save the soup bowl. But there's no reason why a homemade bowl of hot and sour can't make for a warming, pleasant meal. <strong><a href=\"http://bostonchefs.com/restaurant/sweet-basil/chef/dave-becker/\">Dave Becker's</a></strong> recipe in <em><a href=\"http://www.amazon.com/Stewed-Collection-Soups-Braises-Stews/dp/0981850715/?tag=serieats-20\">Stewed</a></em> is one such example. He eschews the sweet element of too many take-out containers, instead favoring the naturally sour taste lemongrass, rice vinegar, and lime juice and the gentle heat of red chiles and white pepper. Carrots, shiitakes, bell peppers, and snow peas make up the bulk of the vegetables, and a small amount of rice noodles or rice turns the appetizer into a full meal. It's a far cry from any hot and sour I'd ever eaten--and that's a good thing.", "totalTime": "40 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cook the Book", "Mains", "Soups and Stews"], "recipeIngredient": ["2 tablespoons coconut oil", "2 cups carrots, scrubbed and cut into 1/4-inch wide slices", "2 cups Spanish onions, cut into 1/4-inch wide slices", "2 tablespoons celery, cut into 1/4-inch wide slices", "3 cups shiitake mushrooms, cut into 1/4-inch wide slices", "1 teaspoon lemongrass, minced", "1 tablespoon fresh ginger, peeled and minced", "1 tablespoon garlic, minced", "1 cup rice vinegar", "1 cup sake", "3 dried bird's beak chiles", "1 1/2 quarts chicken stock or veggie stock", "Kosher salt and white pepper", "1 cup yellow peppers, cut into 1/4-inch wide slices", "1 cup snow peas", "2 cups cooked rice or thin rice noodles", "&nbsp", "<strong>Garnish</strong>", "Sesame oil", "Chopped fresh cilantro", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a sauté pan over medium-high heat, and then add the coconut oil. Allow the oil to heat for a couple seconds, and then add the carrots, onions, celery, and shiitake mushrooms. Sauté for 1 minute, and then add the lemongrass, ginger, and garlic. Continue to sauté for 1 or 2 more minutes (do not let this mixture brown, as it will prevent the soup from attaining its sought after light and fresh flavor). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice vinegar, bring to a boil, and then add the sake. If you crave the spice, throw in the chiles at this point, add the stock, bring it to a boil, and then season to taste with salt and white pepper (see note). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you’re satisfied with the seasoning, add the yellow peppers, snow peas, and noodles or rice. Cook for 1 or 2 more minutes, and then remove from the heat (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the soup into bowls, drizzle with a little sesame oil, garnish with the cilantro and lime wedges, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> Make sure to season the soup with more white pepper than you think you should. This is the only soup in the book that specifically calls for white pepper, since it’s unique flavor can’t be replaced by any other ingredient.</p>\r\n\r\n<p>The snow peas and peppers in this soup should be light and crisp—not overcooked and soggy. For that reason, make sure to remove the soup from the heat when they are still crisp and have a little life left in them.</p>"}]}