{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130102-skillet-suppers-couscous.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["butternut squash", "cous cous", "One Pot Wonder", "pancetta", "quick", "skillet suppers", "squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Couscous With Crispy Pancetta and Butternut Squash", "link": "https://www.seriouseats.com/recipes/2013/01/couscous-crispy-pancetta-butternut-squash-recipe.html", "description": "A one-skillet supper of couscous, squash, and pancetta.", "totalTime": "30 minutes", "recipeYield": "serves 3 to 4", "recipeCategory": ["Mains", "One-Pot Wonders", "Other Grains", "Squash", "Stovetop"], "recipeIngredient": ["3 tablespoons olive oil", "1/4 pound pancetta, cut into 1/4-inch cubes", "1 medium shallot, thinly sliced (about 1/4 cup)", "1 serrano pepper, finely chopped (about 2 tablespoons, see note)", "Kosher salt and freshly ground black pepper", "1 tablespoon ground cumin", "2 medium cloves garlic, minced or grated with a Microplane grater (about 2 teaspoons)", "2 pounds butternut squash, peeled, seeded and cut into 3/4-inch pieces", "6 ounces Israeli or pearled couscous", "3 cups homemade or store-bought low sodium chicken or vegetable broth", "1 (15-ounce) can chickpeas, drained and rinsed", "2 tablespoons freshly squeezed lemon juice from 1 lemon", "1/4 cup chopped fresh cilantro leaves and fine stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of oil in a 12-inch skillet over medium-high heat until shimmering. Add the pancetta and cook, stirring frequently, until crisp and rendered, 4 to 5 minutes. Remove the pancetta and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pan to medium heat. Add the remaining oil and then add the shallots, serrano peppers, and a pinch of salt and pepper, and cook, stirring frequently, until softened, but not browned, about 3 minutes. Add the cumin and garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add the squash and cook, stirring frequently, until it begins to soften slightly, about 5 minutes. Add the couscous and broth and simmer, stirring occasionally, until most of the liquid is absorbed and squash is tender, about 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chickpeas and pancetta to the pan to warm through, season to taste with salt and pepper and toss with lemon juice. Let sit for a few minutes to allow cous cous to finish hydrating, stir in cilantro, and serve.</p>"}]}