{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130909-kale-carbonara.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["carbonara", "easy", "kale", "one pot", "pasta", "quick", "spaghetti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Skillet Spaghetti alla Carbonara with Kale", "link": "https://www.seriouseats.com/recipes/2013/09/spaghettie-carbonara-with-kale-recipe.html", "description": "We cook our pasta directly in the skillet (no big pot required!) and flavor it with bacon, black pepper, parmesan cheese, and kale, all in a creamy, egg-based sauce.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Kale", "Mains", "One-Pot Wonders", "Pasta"], "recipeIngredient": ["8 ounces bacon, pancetta, or guanciale, cut into 1/2-inch pieces", "1 shallot, thinly sliced (about 1/4 cup)", "3 cups chopped curly kale, stems discarded, leaves cut into 2-inch ribbons", "Kosher salt and freshly ground black pepper", "3 ½ cups homemade chicken stock or store-bought low-sodium chicken broth", "1 pound spaghetti", "4 eggs", "1 cup freshly grated Parmigiano-Reggiano, plus more for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat bacon in a 12-inch skillet over medium heat and cook, stirring occasionally, until most of the fat is rendered and begins to crisp, about 5 minutes. Add the shallot and cook until fragrant and lightly softened, about 1 minute. Add the kale and cook, stirring, until the kale cooks down and begins to crisp, 3 to 4 minutes. Season to taste with salt and pepper. Transfer kale, bacon, and shallots to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot, add the broth and pasta, adjust the heat to maintain a vigorous boil, and cook according to the package directions until al dente, stirring occasionally to ensure nothing sticks. While the pasta is almost done cooking, add the raw eggs, cheese and black pepper to the kale and bacon mixture. When the pasta is finished, remove from the heat, add the kale mixture to the pan, and vigorously stir with a wooden spoon until thickened and creamy. Season strongly with black pepper and serve immediately with more cheese and black pepper on the side.</p>"}]}