{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/060213-254998-Serious-Eats-Sundau-Supper-Flank-Nectarines-CornB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["basil", "beef", "blue cheese", "butter", "corn", "flank steak", "nectarines", "steak", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flank Steak With Blue Cheese-Honey Nectarines and Basil-Buttered Corn", "link": "https://www.seriouseats.com/recipes/2013/06/flank-steak-blue-cheese-honey-agave-nectarines-basil-butter-corn-recipe.html", "description": "Flank steak is marinated in red wine vinaigrette and served with basil butter corn and grilled nectarines drizzled with honey and stuffed with blue cheese.", "totalTime": "About 1 day", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Cheese", "Corn", "Mains", "Nectarine", "Sides", "Sunday Supper"], "recipeIngredient": ["<strong>For the Steak:</strong>", "1 whole flank steak, about 2 pounds", "2 tablespoons red wine vinegar", "5 tablespoons olive oil, divided", "4 medium cloves garlic, smashed, divided", "5 sprigs thyme", "Kosher salt and freshly ground black pepper", "2 tablespoons juice from 1 lemon", "&nbsp", "<strong>For the Corn:</strong>", "4 tablespoons unsalted butter", "2 tablespoons roughly chopped fresh basil", "4 ears of corn, shucked", "&nbsp", "<strong>For the Nectarines:</strong>", "3 nectarines, halved and pitted", "2 ounces crumbled blue cheese", "1 1/2 tablespoons honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Steak:</strong> Place flank steak in a resealable bag and add vinegar, 3 tablespoons olive oil, 2 cloves garlic, 4 sprigs thyme and a generous sprinkle of salt and black pepper. Seal bag tightly and squish around to blend marinade and coat the meat. Place in the refrigerator to marinate for at least 4 hours and up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Corn:</strong> Combine butter, basil, and remaining 2 cloves of garlic in the bowl of a food processor. Pulse until garlic is finely chopped. Season with salt and pepper, puree until smooth, and reserve in the refrigerator until use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate, the other area empty for the corn and nectarines. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap corn in foil and place in between hot and cool side of grill and cook until tender and slightly charred, turning several times during cooking, about 20 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After the corn has been on the grill for 10 minutes, remove steak from marinade and pat dry with paper towels. Place flank steak over hot side of grill. Cook until charred, about 3 minutes. Flip meat. Cook meat the center of the steak registers 125&deg;F on an instant-read thermometer for medium-rare, or 135&deg;F for medium. While the steak is on the grill, fill each nectarine cavity with blue cheese. Drizzle with honey and season with pepper. Place nectarines on the cooler side of the grill next to the corn to allow blue cheese to melt and the exterior to char slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove corn and nectarines from the grill. Finish nectarines with thyme leaves from the remaining sprig. Transfer meat to a cutting board, tent with foil and allow steak to rest for at least 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove corn from foil. Slather with basil butter. Carve meat on the bias, pour lemon juice evenly over meat and sprinkle with salt. Serve flank steak immediately with corn and nectarines.</p>"}]}