{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20120411-grilled-cheese-variations-50-thumb-600x458-232481.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cheese", "grilled cheese", "jalapeño", "jalapeño popper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jalapeño Popper Grilled Cheese", "link": "https://www.seriouseats.com/recipes/2013/04/jalapeno-popper-grilled-cheese-recipe.html", "description": "All the flavor of a bacon-wrapped jalapeño popper in a grilled cheese sandwich.", "totalTime": "25 minutes", "recipeYield": "Makes 1 sandwich", "recipeCategory": ["Bacon", "Cheese", "Sandwiches"], "recipeIngredient": ["2 jalapeño peppers", "2 slices bacon, sliced in half crosswise", "2 slices hearty white bread, such as Pepperidge Farm or Arnold", "2 teaspoons butter", "2 ounces cream cheese, softened", "2 slices American or Cheddar cheese", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place jalapeño peppers directly over a gas burner, turning occasionally, until charred on all sides, about 5 minutes total. Alternatively, place under a preheated broiler as close as possible to the heat source, turning occasionally, until charred on all sides, about 10 minutes. Transfer charred jalapeños to a sheet of aluminum foil and wrap tightly to seal. Let rest five minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place bacon in a large nonstick or cast iron skillet and cook over medium-low heat, turning occasionally, until crisp all over, about 8 minutes. Transfer bacon to a paper towel-lined plate and bacon fat to a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap jalapeños. Peel skin and discard. Remove stems and seeds. Split each pepper in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet and return to medium heat. Melt butter until foaming subsides. Add both bread slices and cook, swirling occasionally, until pale golden brown on bottom side, about 2 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a cutting board toasted-side-up. Place cheese slice on top of one slice, followed by bacon slices and jalapeño peppers. Place cheese slice on top of other slice of bread and spread cream cheese over it. Close sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of reserved bacon fat to skillet and heat over medium-low heat. Add sandwich and cook, swirling occasionally, until deep, even golden brown, about 5 minutes. Remove sandwich using a flexible metal spatula. Add the remaining bacon fat. Return sandwich to skillet cooked-side up. Season with salt. Cook, swirling occasionally, until second side is deep, even golden brown and cheese is thoroughly melted, about 5 minutes. Serve immediately.</p>"}]}