{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/082913-264025-cook-the-book-smoky-yellow-split-peas.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chana dal", "Cook the Book", "indian cooking unfolded", "potatoes", "Raghavan Iyer", "tomato", "yellow split pea dal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Smoky Yellow Split Peas (Tamatar Chana Dal) from 'Indian Cooking Unfolded'", "link": "https://www.seriouseats.com/recipes/2013/08/smoky-yellow-split-peas-tamatar-chana-dal-from-indian-cooking-unfolded.html", "description": "Yellow split peas get flavored with a blended paste of toasted spices, chiles, and tomato. Stirring in the paste towards the end of cooking allows the spices to retain their vibrancy.", "totalTime": "1 hour", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Dairy-Free", "Gluten-Free", "Mains", "Potato", "Sides", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1 pound potatoes, russet or Yukon Gold", "1 cup yellow split peas", "1/4 teaspoon ground turmeric", "2 to 4 dried red cayenne chiles (like chile de árbol), stems discarded", "1 tablespoon coriander seeds", "1 teaspoon cumin seeds", "1 medium-size tomato, cored and diced", "2 tablespoons finely chopped fresh cilantro leaves and tender stems", "1 1/2 teaspoons coarse kosher or sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the potatoes and cut them into 1/2-inch cubes. Transfer the cubed potatoes to a bowl large enough to hold them. Add enough cold water to cover the potatoes to prevent them from oxidizing and turning black.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the split peas in a medium-sized saucepan. Add water to cover and rinse the peas, rubbing them between your fingertips (I just use the fingers of one hand to do this). The water will become cloudy and may have some debris like the odd skin from the peas (even though they are skinless) or dust from the packaging. Drain this water. Repeat 3 to 4 times until the water, upon rinsing the peas, remains clearer. Add 4 cups water to the pan with the peas and let it come to a boil over medium-high heat. You will see some foam rise to the surface; scoop it out and discard it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the potatoes and add them with the turmeric to the peas, stirring once or twice. Reduce the heat to medium-low and cover the pan. Cook the mélange, stirring occasionally, until the peas are tender but still firm looking and the potatoes are cooked, 20 to 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat a small skillet over medium-high heat. Once the skillet feels hot (when you hold the palm of your hand close to the bottom of the skillet you will feel the heat), usually after 2 to 4 minutes, add the chiles, coriander, and cumin. Toast the spices, shaking the skillet every few seconds, until the chiles blacken and smell smoky hot and the seeds turn reddish brown and smell incredibly aromatic (nutty with citrus undertones), 1 to 2 minutes. Immediately transfer the spice blend to a blender and plunk in the tomato. Puree, scraping the insides of the blender as needed, to make a smooth, reddish brown paste with a smoky aroma that is sure to knock your socks off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the peas are cooked, add the tomato and spice paste to the pan. I usually pour some of the liquid from the peas into the blender and process it for a brief second to make sure I get every last bit of the tomato paste, and then pour it back into the pan. Stir in the cilantro and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the heat to medium-high and let the dal boil vigorously, uncovered, stirring occasionally, until the flavors mingle and the sauce thickens slightly, 12 to 15 minutes. If you would like the sauce to be thicker, mash some of the peas and potatoes with the back of your spoon. Serve the dal warm.</p>"}]}