{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130509-peanut-butter-oat-cookies.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["Cookies", "oatmeal cookies", "peanut butter", "peanut butter cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peanut Butter Oat Cookies", "link": "https://www.seriouseats.com/recipes/2013/05/peanut-butter-oat-cookies-recipe.html", "description": "Rich, oaty peanut butter cookies perfect for making ice cream sandwiches.", "totalTime": "1 hour", "recipeYield": "makes 18 cookies", "recipeCategory": ["Cookies", "Desserts", "Nuts"], "recipeIngredient": ["1 1/2 cup (7.5 ounces / 213 grams) cake flour", "3/4 teaspoon baking soda", "1/2 teaspoon baking powder", "1 teaspoon kosher salt", "8 tablespoons (1 stick) unsalted butter, softened", "1 cup (8 ounces / 227 grams) no-stir peanut butter", "1 cup (7.4 ounces / 208 grams) brown sugar, packed", "1/4 cup (2.5 ounces / 70 grams) white sugar ", "2 large eggs", "1/2 teaspoon vanilla extract", "3/4 cup (3.3 ounces / 96 grams) rolled oats"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350&deg;F and adjust two racks to middle of oven. In a large bowl, whisk together cake flour, baking soda, baking powder, and salt until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, mix butter on high speed until light and creamy, about 30 seconds, then add in peanut butter and mix on high until well combined, scraping down the sides of the bowl with a spatula as needed. Reduce speed to low and add brown and white sugars, then mix on medium speed until everything is well combined, lighter in color, and fluffy, about 2 minutes, scraping down the sides of the bowl as needed. Add eggs and vanilla and mix until they completely disappear.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce mixer speed to low and add flour mixture, slowly, just until it is fully combined. Bring mixer back up to medium speed, add oats, and mix until fully combined. Move mixing bowl to refrigerator to chill for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two half sheet pans with parchment paper. Using a 3 tablespoon ice cream scoop, portion dough into 18 scoops and divide evenly across 2 sheet pans, leaving 1 1/2 inches of space between scoops. If you don't have an ice cream scoop, measure one scoop of dough with a tablespoon measure and make other portions a similar size. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 5 minutes, then using the back of a spatula, press down on cookies until they form flat 3 inch discs. Return to oven, moving the top pan to the bottom and vice versa, and bake until bottoms begin to turn brown, about 4 minutes. Cookies may not look fully done, but do not overbake. Transfer cookies to cooling rack and cool completely if using for ice cream sandwiches.</p>"}]}