{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130610-asparagus-eggs-chorizo-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["aioli", "allioli", "asparagus", "chorizo", "egg", "mayonnaise", "spanish", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sautéed Asparagus With Chorizo, Fried Eggs, and Smoked-Paprika Allioli", "link": "https://www.seriouseats.com/recipes/2013/06/asparagus-chorizo-fried-eggs-smoked-paprika-aioli-allioli-mayonnaise-recipe.html", "description": "A super quick, one skillet meal made with fresh spring asparagus, Spanish chorizo, and an egg fried to frizzled perfection, all served with a smoky and tangy paprika allioli.", "totalTime": "15 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Asparagus", "Breakfast and Brunch", "Eggs", "Mains", "Spanish"], "recipeIngredient": ["<strong>For the Smoked Paprika Allioli</strong>:", "1 egg", "1 teaspoon dijon mustard", "1 teaspoon fresh juice from 1 lemon", "1 medium clove garlic, minced", "1 teaspoon mild (dulce) smoked paprika", "1/2 cup canola oil", "1/4 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper", " ", "<strong>To Assemble</strong>:", "2 tablespoons extra-virgin olive oil", "4 ounces <a href=\"http://www.amazon.com/Palacios-Mild-Chorizo/dp/B000NO72UE/?tag=serieats-20\">Spanish-style dry-cured chorizo</a>, finely diced", "3/4 pound thin asparagus, trimmed and cut into 2-inch lengths", "2 medium cloves garlic, finely sliced", "1/2 teaspoons sherry or red wine vinegar", "2 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Smoked Paprika Allioli:</strong> (see note) Combine egg, mustard, lemon juice, garlic, and smoked paprika in the bottom of a cup that just fits the head of a hand blender. Carefully pour in canola oil. Place head of blender in bottom of jar. Start blender and slowly pull it up through the mixture. A thick, creamy emulsion should form. Transfer mixture to a bowl. Whisking constantly, slowly drizzle in olive oil. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Heat olive oil and chorizo in a large cast iron or non-stick skillet over medium heat. Cook, stirring, until chorizo is crisp, about 3 minutes.Transfer chorizo and rendered fat to a small bowl. Return 2 teaspoons of fat to the skillet and heat over medium-high until shimmering. Add asparagus and cook, stirring and tossing, until bright green, about 1 minute. Add garlic and continue to cook until asparagus is tender and garlic is fragrant, about 45 seconds. Season to taste with salt and pepper, add vinegar and toss to coat. Transfer asparagus to serving plates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining chorizo fat to skillet (there should be about 2 tablespoons) and heat over high heat until shimmering. Add eggs, season with salt and pepper, and cook, spooning the hot fat over the top of the eggs so they set rapidly. Continue to cook until whites are barely set and frizzled around the edges, but yolk is still runny. Top asparagus with fried eggs, chorizo bits, and chorizo fat. Serve with smoked paprika allioli.</p>"}]}