{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130326-crab-cakes-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["crab", "crab cakes", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "The Best Crab Cakes", "link": "https://www.seriouseats.com/recipes/2013/04/the-food-lab-crab-cakes-recipe.html", "description": "Tender, succulent crab cakes with no starchy binders at all.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Lobster and Crab", "Mains", "The Food Lab"], "recipeIngredient": ["1 pound fresh lump or jumbo lump crab meat, picked over", "2 tablespoons mayonnaise", "2 tablespoons chopped chives, tarragon, parsley, or a mix (optional)", "2 large eggs, divided", "1 1/2 cups panko-style bread crumbs", "3 tablespoons canola or vegetable oil", "3 tablespoons unsalted butter", "Kosher salt", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/08/tartar-sauce-recipe.html\">Extra Tangy Tartar Sauce</a> or lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine crab, mayonnaise, herbs (if using), and 1 egg in a large bowl and fold gently with a spatula until combined, being careful not to break up the large lumps of crab.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a sheet of aluminum foil roughly 12- by 18-inches on a work surface with the short end parallel to the edges of the table. Transfer crab mixture to the foil, forming it into a rough log about 6 inches wide, starting about 4-inches from bottom of foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully lift bottom edge of foil and lift it over the crab log. Roll the log away from you until it is completely wrapped in foil, then twist the ends to form a tight roll 6- to 8-inches wide and 3- to 4-inches in diameter. Place log on a tray or plate and transfer to the freezer until lightly stiffened, 20 to 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the log from the freezer and using a sharp chef's knife, slice off one of the twisted ends. Remove crab mixture from inside twisted end and reserve. Slice the log into 4 to 6 individual disks about 1 1/2-inch thick each. Transfer the disks (with their foil) to a rimmed baking sheet cut-side down. Combine any crab mixture removed from twisted ends and form into a free-form crab cake and place on tray along with foil-wrapped disks. Transfer to freezer until disks are relatively stiff, about 20 to 25 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place remaining egg in a small bowl and beat until homogenous. Place bread crumbs in a second small bowl. Working one crab disk at a time, lift by grasping the foil-lined edges. Dip one cut surface in egg, then in bread crumbs, pressing down gently to adhere. Return to baking sheet, cut-side down and repeat with remaining disks (including free-form disk).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 6 inches below broiler element and preheat broiler to high. Heat oil and butter in a large cast iron skillet over medium heat until foaming subsides. Add crab cakes, breaded side down and cook, swirling occasionally, for 3 minutes. Carefully peel off foil from each cake using your fingertips, without lifting the cakes. Discard the foil. Continue cooking, swirling pan occasionally until underside of crab cakes is light golden brown, about 2 minutes longer (check underneath with a thin flexible metal spatula, but be careful not to break crab cakes, they will be fragile)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grasp the handle of the pan and tilt it towards you so the fat collects in the bottom. Use a spoon to baste each cake with fat, making sure that it is completely coated, then transfer skillet to broiler. Broil until light golden brown on top and crab cakes are cooked through (an instant read thermometer inserted into their center should register 145 to 160°F), about 5 minutes. Remove from oven. Transfer the crab cakes breaded-side-down to a paper towel-lined plate. Flip crab cakes and season with salt. Serve immediately with <a href=\"http://www.seriouseats.com/recipes/2012/08/tartar-sauce-recipe.html\">Extra Tangy Tartar Sauce</a> or lemon wedges.</p>"}]}