{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/vsa%20jam.jpeg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["coconut", "pineapples", "tarts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pineapple Jammy Tarts", "link": "https://www.seriouseats.com/recipes/2013/01/pineapple-jammy-tarts-recipe.html", "description": "Spicy pineapple jam encased in a buttery, flaky crust makes for a unique breakfast treat.", "totalTime": "3 hours", "recipeYield": "Makes 16 mini tarts", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Coconut", "Fruit Desserts", "Pies, Tarts, and Crumbles", "Very Small Anna"], "recipeIngredient": ["<strong>For the Pineapple Jam</strong>", "4 cups (about 1 1/2 pounds) ripe fresh pineapple (from about 1 medium fruit), chopped roughly to about 1/2 inch pieces", "1 3/4 cups (about 12 ounces) granulated sugar", "3 tablespoons fresh juice and 2 teaspoons grated zest from 3 limes", "Up to 1/8 teaspoon cayenne pepper (optional)", " ", "<strong>For the Crust</strong>", "2 cups plus 2 tablespoons (about 11 ounces) all-purpose flour, divided", "1 cup (2 sticks) unsalted butter, cut into 1/2 inch cubes and frozen", "1 teaspoon sugar", "1 teaspoon salt", "1/4 cup cold water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Jam:</strong> Combine pineapple, 1 3/4 cups sugar, lime juice, and lime zest in a large heavy-bottomed pot. Add cayenne pepper according to your taste (you can leave it out if you don't like spicy things). Cook over medium-high heat, stirring often, until sugar dissolves and pineapple releases its juices, 5 to 10 minutes depending on ripeness. Continue to cook, stirring occasionally, until pineapple is bright yellow and translucent, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blend with an immersion blender or in a standing blender on low speed until roughly pureed but some small chunks still remain. Place a small white plate in the freezer to chill. Return pineapple to pot if you removed it to blend and continue to cook over medium heat, scraping the bottom of the pot often until most of the liquid has cooked away, 15 to 20 minutes. To test for doneness, place a blob of jam on the chilled plate and let sit until cold, about 10 seconds. If the chilled jam runs at all, continue cooking for another 3 to 5 minutes and repeat the test. Once the jam is done, remove to a bowl to chill in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Place half the flour in the bowl of a stand mixer fitted with a paddle attachment. Add the frozen cubed butter and mix on the lowest speed until the flour and dough come together. Remove to a medium bowl. Place remaining flour, sugar and salt into mixer bowl and mix on low to combine, then add the butter mixture in chunks and mix on lowest speed until butter is in pea-sized chunks. Slowly pour in the water until the dough comes together, finishing by hand. Divide in 2 equal rectangles, wrap with plastic wrap, and chill for at least half an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with parchment paper or a silicone baking mat. If your dough has chilled into a brick, allow it to warm on the counter until slightly soft. On a floured surface, roll one piece into a 13- 11-inch rectangle, then trim to 12- by 10-inches. Cut into sixteen 3- by 2 1/2-inch rectangles and place evenly on lined baking sheet. Roll and cut the second portion of dough the same way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place between one and two teaspoons of pineapple jam in the middle of each rectangle on the sheet pan and cover each with another rectangle. With lightly floured fingers, press around the edges of each rectangle to seal. Crimp the edges with a fork. Prick a few holes in the top of each tart over the jam and freeze the tarts. Once thoroughly frozen you can wrap them individually in plastic if you like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To bake, set rack in the middle of the oven and preheat to 375&deg;F. Unwrap as many tarts as you want to bake and set them at least a half inch apart on a sheet pan lined with parchment paper or a silicone mat. Bake for ten minutes, rotate the pan and continue baking until golden brown and puffed, about 10 minutes longer. Remove from oven and allow to cool on pan at least five minutes before removing. Serve warm.</p>"}]}