{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131020-english-muffin-pizza-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "english muffin", "pepperoni", "pizza", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Best English Muffin Pepperoni Pizza", "link": "https://www.seriouseats.com/recipes/2013/10/the-best-english-muffin-pizza-recipe.html", "description": "The ultimate English muffin pizza made with a fresh tomato sauce and crisp pepperoni.", "totalTime": "30 minutes", "recipeYield": "Makes 8 English muffin pizzas", "recipeCategory": ["Pizza", "Snacks", "The Food Lab", "The Pizza Lab"], "recipeIngredient": ["1 tablespoon extra-virgin olive oil, plus more for drizzling", "1 tablespoon butter", "2 medium cloves garlic, minced (about 2 teaspoons)", "3 tablespoons finely chopped fresh parsley leaves, divided", "3 tablespoons finely chopped fresh basil leaves, divided", "pinch red pepper flakes", "1/2 teaspoon dried oregano", "1 (14-ounce) can crushed tomatoes", "1/2 teaspoon sugar", "Kosher salt and freshly ground black pepper", "1 stick pepperoni, preferably natural casing, cut into 32 slices", "4 English muffins, split in half", "4 ounces grated Mozzarella cheese", "2 ounces grated Parmesan cheese, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper middle position and preheat oven to 500°F. Heat oil and butter in a medium saucepan over medium-high heat until butter is melted. Add garlic, 1 tablespoon parsley, 1 tablespoon basil, pepper flakes, and oregano and cook, stirring frequently until aromatic, about 1 minute. Add tomatoes and sugar. Bring to a simmer and cook, stirring occasionally, until lightly thickened, about 15 minutes total. Season to taste with salt and pepper and stir in another tablespoon of parsley and a tablespoon of basil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While sauce is cooking, heat half of pepperoni slices in a large non-stick skillet over medium-high heat until cupped and crisp around edges, about 2 minutes. Transfer to a large plate, leaving rendered fat in pan. Add four English muffin halves cut-side-down to skillet and swirl to pick up all fat. Cook until well-toasted, about 2 minutes. Transfer to a foil-lined baking sheet. Repeat with remaining pepperoni and English muffin halves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat each English muffin half with sauce. Spread half an ounce of mozzarella on each English muffin, followed by 1/4 ounce of Parmesan cheese. Place 4 pepperoni slices on top of each pizza and top with a little bit more grated Parmesan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until English muffins are crisp underneath and cheese is melted and just starting to brown, about 5 minutes. Top with extra Parmesan cheese immediately after removing from oven. Drizzle with olive oil, sprinkle with remaining parsley and basil, and serve.</p>"}]}