{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130204-skillet-suppers-pasta-chickpeas-chicken.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["chicken", "One Pot Wonder", "pasta", "quick", "skillet suppers"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Skillet Whole Wheat Pasta with Chicken and Chickpeas", "link": "https://www.seriouseats.com/recipes/2013/02/skillet-suppers-whole-wheat-pasta-chicken-chickpeas-recipe.html", "description": "A quick and filling one-skillet supper. Whole wheat pasta, chickpeas, and chicken, all in a rich tomato sauce.", "totalTime": "45 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Chicken", "Mains", "One-Pot Wonders", "Pasta", "Stovetop"], "recipeIngredient": ["1 1/2 pounds boneless skinless chicken breasts, trimmed of excess fat (3 to 4 breast halves)", "Kosher salt and freshly ground black pepper", "3 tablespoons olive oil", "1 medium shallot, thinly sliced (about 1/4 cup)", "2 medium cloves garlic, minced or grated with a Microplane (about 2 teaspoons)", "½ teaspoon dried red chile flakes, or more if desired", "1 (28-oz) can whole peeled tomatoes", "1 sprig fresh rosemary", "1 3/4 cups homemade or store-bought low sodium chicken broth", "3 cups whole wheat farfalle pasta or other type of noodle", "1 (15-oz) can chickpeas, drained and rinsed", "½ cup grated Parmesan, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken breasts with salt and pepper. Heat 2 tablespoons of oil in a 12-inch skillet over medium-high heat until hot. Add the chicken breasts and sear on all sides until golden-brown, 5 to 6 minutes per side. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pan, heat the remaining tablespoon of olive oil over medium heat until hot. Add the shallots and a pinch of salt and cook until softened, about 2 minutes. Add the garlic and chile flakes and cook, stirring constantly, until aromatic, about 30 seconds. Add the tomatoes and allow to cook until the tomatoes soften, then break them apart with a potato masher, 3 to 4 minutes. Add the rosemary sprig to the pan. Cover, and lower the heat to maintain a gentle simmer, and allow the sauce to cook until thickened, 10 to 12 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock and bring to a simmer. Stir in the pasta, chickpeas and ½ cup grated Parmesan. Cover and cook for 5 minutes. Stir pasta, place the chicken breasts over top, pouring in any pan juices, cover, cover, and continue cooking until pasta is done and the chicken has cooked through, 5 to 7 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the rosemary sprig and discard. Slice chicken if desired. Serve the pasta in bowls, place the chicken breasts on top and finish with a generous sprinkling of Parmesan. </p>"}]}