{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131015-269921-dinner-tonight-butternut-squash-soup-kale-red-pepper.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["easy", "fall", "kale", "lemon", "pepper", "soup", "squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Butternut Squash, Kale, and Lemon Soup", "link": "https://www.seriouseats.com/recipes/2013/10/roasted-butternut-squash-kale-lemon-soup-recipe.html", "description": "I have something of an aversion to blended soups, mostly because the homogeneous texture gets boring after a while. Instead, I love brothy soups&mdash;ones with all kinds of things floating in the bowl for me to scoop out. But who says you can't add things into a blended soup to get the best of both worlds?", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Kale", "Lemon", "Soups and Stews", "Squash", "Vegetarian"], "recipeIngredient": ["4 tablespoons olive oil ", "1 butternut squash, peeled, seeds removed, chopped into 3/4-inch pieces ", "1 medium onion, chopped (about 1 cup)", "1 red bell pepper ", "Kosher salt", "1 bunch kale, ends trimmed, leaves roughly chopped ", "1 lemon, quartered  ", "2 medium garlic cloves ", "3 cups homemade or store-bought low sodium vegetable or chicken stock", "Smoked hot paprika to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust racks to upper middle and lower position and preheat oven to 450&deg;F. Add 2 tablespoons oil to a large roasting pan or rimmed baking sheet. Add squash, onion, and bell pepper and toss to coat. Season with salt. Add remaining oil to a second roasting pan or baking sheet and add kale, lemon, and garlic. Season with salt and mix well. Place squash on top rack and kale on lower rack and cook, stirring every 10 minutes or so, until squash and red pepper are tender and kale is crispy, about 20 minutes for the kale and 30 minutes for the squash.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer butternut squash, onion, and garlic to a blender and add the stock. Blend until smooth. Pour this mixture into a large saucepan set over medium heat. Being careful not to add any seeds, squeeze the roasted lemon wedges into the soup and season with salt to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the red pepper is cool enough to handle, remove skin, stem, and seeds, and roughly chop the flesh. Ladle the soup into four bowls. Top with a handful of roasted kale and a quarter of the chopped red pepper. Sprinkle some paprika over everything and serve. </p>"}]}