{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130809-bakethebook-sugarnspice.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["breakfast sweet", "brioche", "cinnamon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sugar &amp; Spice Doughnut Holes", "link": "https://www.seriouseats.com/recipes/2013/08/sugar-spice-doughnut-holes.html", "description": "Frying already-rich brioche dough results in these unimaginably indulgent, tender little bites. Representing the third category of <em><strong><a href=\"http://www.amazon.com/?tag=serieats-20\" target=\"_blank\">Glazed, Filled, Sugared, &amp; Dipped</a></strong></em>, they're coated in cardamom sugar, which provides contrasting flavor &amp; texture.", "totalTime": "5 hours, including resting/proofing", "recipeYield": "makes about 2 dozen doughnut holes", "recipeCategory": ["Bake the Book", "Breakfast and Brunch", "Breakfast Sweets", "Desserts", "Doughnuts", "Pastry"], "recipeIngredient": ["<strong>Doughnut Holes</strong>", "1 cup bread flour", "1 1/2 tablespoons sugar", "2 large eggs", "1/2 teaspoon packed fresh yeast, or 1/8 teaspoon active dry yeast", "1/2 cup (1 stick) unsalted butter, cubed and cold", "1 teaspoon salt", "vegetable oil, for frying", "&nbsp;", "<strong>Cardamom Sugar</strong>", "1 cup sugar", "3/4 teaspoon ground cardamom", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> In the bowl of a stand mixer fitted with the dough hook, mix the flour and sugar on low speed. Add the eggs and beat well. Add the yeast, mixing for about 1 minute, until the ingredients are evenly combined. Gradually add the butter a few cubes at a time, and then add the salt. Increase the mixer speed to medium and continue to mix until the butter is completely incorporated and the dough has pulled away from the sides of the bowl, about 10 minutes. The dough will typically make a slapping sound when it’s ready to come out, and it should be glossy and smooth.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a medium metal bowl and cover it tightly with plastic wrap. Let it sit in a draft-free environment until it has doubled in size, 1 hour 30 minutes to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the proofed dough in the refrigerator until it’s cool and firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the chilled dough out of the refrigerator and turn it out onto a sheet of parchment paper. Put a second sheet of parchment paper on top of the dough and roll it out until it is 1/2 inch thick. Put the dough back in the refrigerator and chill it for about 20 minutes more. (At this stage, the dough may be chilled for up to 24 hours before continuing.)<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare two baking sheets: one lined with paper towels, and the other with greased parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel off the top sheet of parchment paper and flip the dough onto a floured surface. Remove the second sheet of parchment paper and dust the dough with flour. Using a floured biscuit or doughnut cutter about the size of a half dollar, cut the dough into rounds and put them on the greased baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with plastic wrap and let the doughnut holes proof at room temperature until they double in size, 30 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate them once more until chilled, about 20 minutes. Meanwhile, heat at least 2 inches of oil in a heavy-bottomed pot fitted with a deep-fry thermometer until the oil reaches 350°F.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the doughnut holes in batches, taking care not to crowd the pot, until golden brown all over, 3 to 4 minutes per side. Drain on the paper towel-lined baking sheet. Toss the doughnut holes in the cardamom sugar (simply combine the sugar, salt, and cardamom in a bowl) and serve them immediately.<br />\n</p>"}]}