{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130415-charred-corn-jicama-radish-salad-recipe2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "Charred Corn, Radish, Jicama, and Green Bean Salad With Lime Dressing", "link": "https://www.seriouseats.com/recipes/2013/04/charred-corn-jicama-radish-green-bean-salad-recipe.html", "description": "A bright summer salad of charred corn, green beans, radishes, and jicama in a lime and olive oil dressing.", "totalTime": "30 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Dairy-Free", "Easter", "Salads", "Vegan", "Vegetarian"], "recipeIngredient": ["1 1/2 tablespoons lime juice and half teaspoon zest from about 2 limes", "1 teaspoon honey or agave necar", "4 tablespoons extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "1 tablespoons vegetable oil", "3 ears corn, shucked, kernels cut off with a knife (about 1 1/2 cups kernels)", "1 red or orange bell pepper, cut into 1/2-inch squares", "1 jalapeño or serrano pepper, finely minced", "4 scallions, finely sliced, whites and greens reserved separately", "4 ounces green beans, ends trimmed, cut into 1-inch lengths", "4 ounces radishes, cut into bite-sized pieces (quarters, sixths, or eighths, depending on size)", "1 bulb jicama, peeled and cut into 3/4-inch dice (about 1 1/2 cups)", "1/4 small white onion, finely sliced and rinsed under warm running water", "1/2 cup roughly chopped fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine lime juice, lime zest, and honey in a medium bowl. Whisking constantly, slowly drizzle in olive oil. Season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Heat vegetable oil in a large non-stick or cast iron skillet over high heat until shimmering. Add corn, shake once to distribute, and cook without moving until darkly charred on first side, about 3 minutes. Toss and flip corn and repeat until corn is covered in dark spots, about 8 minutes total. Add bell pepper, jalapeño, and scallion whites. Cook, tossing frequently, until softened, about 2 minutes. Season to taste with salt and pepper. Transfer to a large bowl and allow to cool for a few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add green beans to boiling water and cook just until tender-crisp, about 3 minutes. Drain beans and run under cold running water until cool. Add beans to bowl with corn. Add radishes, jicama, white onion, cilantro, scallion greens, and dressing and toss to combine. Season to taste with salt and pepper. Serve.</p>"}]}