{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131209-276190-cook-the-book-classic-pork-gyoza.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "Cook the Book", "gyoza", "Japanese", "japanese soul cooking", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Pork Gyoza From 'Japanese Soul Cooking'", "link": "https://www.seriouseats.com/recipes/2013/12/pork-gyoza-recipe-from-japanese-soul-cooking-cookbook.html", "description": "Japanese gyoza dumplings are the perfect nibble: great on their own, but made even better with a cold beer. The classic pork gyoza recipe in <strong><a href=\"http://www.maisononyc.com/\" target=\"_blank\">Tadashi Ono</a></strong> and <strong><a href=\"http://www.harrissalat.com/about.html\" target=\"_blank\">Harris Salat</a></strong>'s new cookbook, <em><a href=\"http://www.amazon.com/Japanese-Soul-Cooking-Tonkatsu-Kitchens/dp/1607743523/?tag=serieats-20\">Japanese Soul Cooking</a></em>, is a fine example of the form, filled with a piquant mixture of ground pork, garlic chives, ginger, cabbage, and minced garlic.", "totalTime": "1 1/2 to 2 hours", "recipeYield": "Makes about 50 gyoza", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Japanese", "Pork", "Snacks"], "recipeIngredient": ["3 cups trimmed and finely chopped green cabbage (about 8 ounces) ", "1/2 teaspoon salt", "1 1/2 cups nira (Japanese green garlic chives), bottom 2 inches trimmed to remove the hard stem, and finely chopped (about 1/3 pound)", "1 tablespoon finely chopped garlic (about 2 cloves)", "1 tablespoon finely chopped ginger (about 1 ounce ginger, peeled)", "2/3 pound ground pork", "2 teaspoons soy sauce", "4 tablespoons toasted sesame oil", "1/2 teaspoon ground black pepper", "1/2 teaspoon salt", "2 teaspoons sugar", "2 tablespoons katakuriko (potato starch), plus extra for dusting ", "50 round gyoza skins, 3 to 4 inches in diameter", "1 tablespoon katakuriko (potato starch) mixed with 3 tablespoons warm water", "Soy sauce", "Japanese rice vinegar", "<a href=\"http://www.seriouseats.com/recipes/2013/12/homemade-rayu-from-japanese-soul-cooking-cookbook.html\">Rayu</a>", "2/3 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the filling, add the cabbage and 1/2 teaspoon salt to a large bowl and thoroughly mix together. Let the cabbage sit at room temperature for 15 minutes. When it’s ready, transfer the cabbage to a clean kitchen towel or large cheesecloth. Roll up the cloth and wring out the liquid in the cabbage, like you’re wringing dry a wet towel. This is a key step so the gyoza doesn’t become watery. Wring out as much liquid from the cabbage as possible. Do this in batches if it’s easier. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wrung-out cabbage, nira, garlic, ginger, pork, soy sauce, 2 tablespoons of the sesame oil, black pepper, salt, sugar, and katakuriko to a large bowl. Use your hands to mix the ingredients together for about 2 minutes. Mash and mush the mixture together, squeezing it through your fingers, so it turns into a sticky filling that will hold together when you spoon it into a dumpling skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dumplings, prepare a tray by lightly dusting it with katakuriko. Place a gyoza skin in the palm of one hand with the floured side down. (The skins are sold with one side floured.) Dip a finger in the katakuriko mixed with warm water and wet the entire edge of the skin. This water-starch mixture is the “glue” that will hold the skin closed. Add about 1 tablespoon of the filling to the center of the skin. Use the index fingers and thumbs of both hands to fold the skin and pinch it together. Place the completed gyoza on the tray, fold side up. Repeat until you’ve used up all the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the dipping sauce, combine the soy sauce, vinegar, and rayu. A classic proportion is 4 parts soy sauce to 2 parts vinegar to 1 part rayu. Adjust to your own taste. Pour the dipping sauce into individual small bowls and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the gyoza, preheat a nonstick pan or cast-iron skillet over high heat for about 5 minutes. (We like to use a 12-inch-diameter skillet with a cover to prepare gyoza.) When the skillet is hot, add 1 table-spoon of the sesame oil, making sure the entire surface is coated (you can use a wadded-up paper towel to carefully spread the oil). Begin adding the gyoza, one at a time, in neat rows, with the seam side up. A 12-inch skillet will hold about 20 gyoza. Once all the gyoza are added, fry them for about 10 seconds. Now quickly pour in the water over the gyoza and cover the skillet tightly. Cook over high heat for about 4 minutes. Uncover the skillet; there should be little or no water remaining. Cook for 1 minute more. Drizzle the remaining 1 tablespoon sesame oil over the gyoza and cook for an additional 1 minute, for about 6 minutes total cooking time. The gyoza should look glossy with the skins cooked through. Turn off the heat and use a thin fish spatula to transfer the gyoza to a serving plate, this time with the seam side down (you want to show off the beautifully crispy, browned bottoms of the dumplings). Serve the dumplings steaming hot, with the dipping sauce on the side. Dip in the sauce to eat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat and use a thin fish spatula to transfer the gyoza to a serving plate, this time with the seam side down (you want to show off the beautifully crispy, browned bottoms of the dumplings). Serve the dumplings steaming hot, with the dipping sauce on the side. Dip in the sauce to eat. </p>"}]}