{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131017-bakethebook-ecclescakes.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["british", "cake", "currant", "Nose to Tail", "puff pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "St John Eccles Cakes", "link": "https://www.seriouseats.com/recipes/2013/10/st-john-eccles-cakes-british-current-cake-recipe.html", "description": "Eccles cakes, named after the English town of Eccles, are small, round cakes made of flaky pastry and stuffed with currants. These <em><strong><a href=\"http://www.amazon.com/?tag=serieats-20\" target=\"_blank\">Nose to Tail</a></strong></em> Eccles cakes are much the same, except they use buttery puff pastry to cuddle the currants.", "totalTime": "50 minutes, or overnight if making puff pastry", "recipeYield": "makes a dozen cakes", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Cakes"], "recipeIngredient": ["1 3/4 ounces unsalted butter", "Scant 4 ounces dark brown sugar", "7 3/4 ounces currants ", "1 tsp ground allspice", "1 tsp ground nutmeg", "3 egg whites, beaten with a fork ", "Shallow bowl of caster sugar ", " ", "<strong>Puff Pastry</strong>", "1 pound 2 ounces strong white flour ", "2 tsp sea salt", "4 1/2 ounces cold unsalted butter, diced, plus 1 cup cold unsalted butter", "1 cup cold water", "2 tsp white wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the puff pastry: Sift the flour into a bowl, then add the salt and the diced butter. Rub the butter in with your fingertips until the mixture looks like breadcrumbs. Add the water and vinegar, and mix to a firm paste. Shape into a ball, wrap in cling film, and leave in the fridge overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, take the pastry out of the fridge and leave it to soften for 1-2 hours. The remaining butter should be at the same temperature as the pastry (if the butter is too soft it will melt and ooze out of the pastry, whereas if it is too hard it will break out of the pastry and ruin your puff). A good way to achieve the correct temperature is to put the butter between a couple of sheets of baking parchment (or re-use your butter wrappers), beating with a rolling pin to soften it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the butter and pastry are ready, roll out your pastry. First roll it into a square, then roll out each side in turn to extend the square into a cross. Leave the center thick, keeping the ends and sides square. Place the butter in the center of the pastry, molding it to the right size if necessary. Then wrap the arms of your cross over and around the butter: start by putting the left arm over the butter, then the right arm over the first arm, next the top and finally the bottom arm. The four arms of your cross should add up to the same thickness as the center of the pastry. Now you have butter in a pastry package. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn your pastry so the top seam is on the right-hand side and roll it out on a floured surface into a rectangle about 8 inches wide and 28 inches long. Brush the excess flour off, then fold the rectangle in three, like a letter, with one end of the rectangle to the center and the other end over this. Give the pastry a quarter turn, so the seam is on the right-hand side, then roll out and fold again. Wrap in plastic wrap and leave to rest in the fridge for about 4 hours. Repeat twice more, so you have rolled out the pastry and butter six times, resting it after every two turns. Finally, wrap it in plastic wrap and store in the fridge until ready to use. It also keeps well in the freezer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, melt the butter and sugar together, then add them to the dry ingredients, mix well, and then leave to cool before using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the puff pastry out to 1/3-inch thick and cut circles approximately 3 1/2 inches in diameter. Onto these spoon a blob of your filling mixture in the center of the circle, and pull up the sides of the pastry to cover the filling. Seal it with your fingers, then turn it over and slash the top. Paint the top with the egg white, then dip it into the sugar. The Eccles cakes are now ready to bake for 15 to 20 minutes in a hot to medium oven; keep an eye on them so that they don’t burn. They can be eaten hot or cold and, as I mentioned earlier, are particularly marvelous when eaten with Lancashire cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The reason we slash the top of the Eccles cake three times is for the Holy Trinity (well, that’s what I have been told).</p>"}]}