{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130624-lettuce-garlic-scape-soup.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["garlic", "garlic scapes", "lettuce", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Creamy Lettuce and Garlic Scape Soup", "link": "https://www.seriouseats.com/recipes/2013/06/creamy-lettuce-and-garlic-scape-soup-recipe.html", "description": "Cooking lettuce doesn't make it more watery and wan; on the contrary, it deepens the greens' flavors, bringing out the peppery notes that characterize lettuce's more assertive cousins like watercress and radicchio.", "totalTime": "20 minutes", "recipeYield": "Makes 2 quarts", "recipeCategory": ["Garlic", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["3 tablespoons butter", "4 garlic scapes, chopped, or substitute 1 chopped shallot plus 3 garlic cloves, chopped", "2 tablespoons flour", "1/2 cup dry white wine, sherry or vermouth", "1 quart low-sodium vegetable broth", "3 heads soft lettuce such as Boston, rinsed of any grit and chopped", "Kosher salt and freshly ground black pepper", "Freshly ground nutmeg", "1/2 cup half-and-half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in a large, heavy-bottomed saucepan or Dutch oven over medium heat until shimmering. Add garlic scapes and cook, stirring, about 4 minutes. Add flour and cook, stirring, until golden brown, about 3 minutes. Add wine and cook, stirring, about 3 minutes. Add broth, lettuce, and salt and pepper to taste. Cover pot and bring liquid to a boil, then drop to a simmer and cook until lettuce is tender, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove soup from heat, add a dash of nutmeg and the half-and-half, and use a hand blender to blend until smooth. Alternatively, blend soup in a blender in two batches. Serve immediately, with a touch of extra cream in each bowl, if desired; alternatively; chill soup before serving. </p>"}]}