{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130715-jerk-chicken-final-food-lab-38.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Caribbean", "keywords": ["barbecue", "barbecue chicken", "chicken", "grill", "jamaica", "jerk chicken", "poultry", "scotch bonnet", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7", "ratingCount": "10"}, "name": "Spicy Grilled Jerk Chicken", "link": "https://www.seriouseats.com/recipes/2013/08/jerk-chicken.html", "description": "To make our spicy Jamaican-style jerk chicken, start with a powerfully flavored marinade and brine combination, followed by a low and slow smoke over smoldering allspice berries and bay leaves.", "totalTime": "12 to 24 hours", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Caribbean", "Chicken", "Grilled Chicken", "Grilling, Smoking, and Barbecue", "July 4th", "Labor Day", "Mains", "Memorial Day", "Summer", "The Food Lab"], "recipeIngredient": ["6 whole Scotch bonnet peppers (see note)", "6 scallions, roughly chopped", "1 (2-inch) knob fresh ginger, roughly chopped", "6 garlic cloves", "2 tablespoons freshly picked thyme leaves", "1 tablespoon ground allspice", "1 teaspoon freshly grated nutmeg", "2 tablespoons dark brown sugar", "1/2 cup soy sauce", "2 tablespoons zest and 1/4 cup juice from about 4 limes", "1/4 cup olive oil", "Kosher salt and freshly ground black pepper", "1 large whole chicken, back removed, split in half along breastbone (4 to 4 1/2 pounds, see note)", "1/4 cup whole allspice berries", "3 dozen dried bay leaves (about 2 loosely packed cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine peppers, scallions, ginger, garlic, thyme, allspice, nutmeg, brown sugar, soy sauce, lime zest and juice, olive oil, 2 teaspoons black pepper, and 1 tablespoon kosher salt in the work bowl of a food processor or the jar of a blender. Blend until a rough purée is formed, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chickens in a large bowl or baking dish. Pour marinade over chickens and turn until thoroughly coated. Divide chicken and marinade between two gallon-sized zipper-lock bags, or place in a large baking dish and cover tightly with plastic wrap. Place whole allspice berries and bay leaves in a gallon-sized zipper-lock bag and fill with water. Refrigerate chicken and bay leaves at least 10 hours and up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, remove chicken from bags, allow excess marinade to drip off, and transfer to a large plate. <a href=\"https://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one half chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and pile the coals against one wall of a kettle grill. Alternatively, set the leftmost burners of a gas grill to medium-high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"https://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"https://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Set bottom and lid vents to half open.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain bay leaves and allspice berries in a fine mesh strainer. Spread 2/3rds of bay leaves evenly over the cooler side of the grill (it's ok if some allspice berries fall through) in a pattern just large enough to fit the chickens. Lay the chickens over the bay leaves skin side up with the legs pointed towards the hotter side of the grill. Place 1/3 of remaining bay leaves over hot side of grill and immediately cover, with the vent above the chicken. Cook for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open lid and place half of remaining bay leaves and allspice berries on hot side of grill directly above the coals. Immediately cover and cook for another 15 minutes. Open lid, add 15 new coals to the pile of hot coals, then place remaining bay leaves and allspice berries on hot side of grill directly above the coals. Cover and continue to cook until the coolest part of the chicken breast registers 145°F on an instant read thermometer, about 20 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover grill and wait five minutes until coals are hot again (if using gas grill, increase heat to high). Carefully lift the chicken off the bay leaves and transfer it to the hot side of the grill skin side up. Using tongs, drop the bay leaves into the grill directly onto the coals or burners so that they smoke. Cook the chicken until lightly charred, about 3 minutes. Flip chicken and continue to cook until skin is crisp and charred and coolest part of breast registers 150 to 155°F on an instant read thermometer, 4 to 6 minutes longer. Transfer to a large platter, allow to rest 5 minutes, and serve.</p>"}]}