{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130211-239967-banana-coconut-sesame-cake-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "", "keywords": ["bananas", "cakes", "coconut", "my thai", "sesame seeds"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Banana-Coconut-Sesame Cake", "link": "https://www.seriouseats.com/recipes/2013/02/banana-coconut-sesame-cake-recipe.html", "description": "Bananas and brown sugar caramelize in this upside-down cake flavored with sesame seeds.", "totalTime": "45 minutes", "recipeYield": "makes one 9-inch round cake", "recipeCategory": ["Banana", "Cakes", "Coconut"], "recipeIngredient": ["1 tablespoon sesame seeds", "1 1/2 tablespoons cold butter, cut into tiny cubes", "1/4 cup brown sugar, packed", "2 large semi-ripe bananas, peeled and sliced into 1/4-inch-thick rounds", "3 large eggs, separated", "1/4 cup vegetable oil", "1/3 cup (about 2 1/2 ounces) granulated sugar", "1/2 teaspoon salt", "1 teaspoon baking powder", "1/2 cup coconut milk", "1/2 teaspoon coconut extract (optional)", "3/4 cup (about 3 1/2 ounces) all-purpose flour", "Powdered sugar, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet set over low heat, toast sesame seeds until they turn light brown. Keep an eye on them and stir constantly for they burn easily. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease the sides of the pan. (No need to grease the bottom.) Scatter butter cubes all over bottom of pan. Sprinkle brown sugar all over bottom of pan, making sure it's evenly distributed. Arrange banana slices in single layer on top of butter and brown sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 F. Set rack in the middle of oven. In a mixing bowl, whisk together egg yolks, granulated sugar, salt, baking powder, oil, coconut milk, and coconut extract (if using). Once mixture is smooth, whisk in all-purpose flour, one tablespoon at a time. Make sure mixture is free of lumps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another clean mixing bowl, whisk egg whites until stiff peaks form. With a rubber spatula, fold half of beaten egg whites into batter; mix well. Fold remaining egg whites into batter, folding just until no white streaks remain, being careful not to deflate batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour batter into pan, right over banana topping. Spread out batter with rubber spatula all the way to edges of pan. Tap pan on kitchen counter a few times to get rid of air pockets and make sure batter goes into spaces between banana slices. Sprinkle toasted sesame seeds all over surface of batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until a cake tester or toothpick inserted into center comes out clean, 30 to 35 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cake cool down to room temperature (or only slightly warmer than room temperature), then unmold upside down into serving platter. Dust powdered sugar on top, if desired.</p>"}]}