{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131030-bakethebook-chocolatetoffee.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["candy", "chocolate", "the gramercy tavern cookbook", "toffee"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate-Covered Toffee with Pumpkin Seeds and Sea Salt", "link": "https://www.seriouseats.com/recipes/2013/11/chocolate-covered-toffee-with-pumpkin-seeds-a.html", "description": "It doesn't get simpler than this toffee made with semi-dark chocolate and buttery caramel from <em><strong><a href=\"http://www.amazon.com/Gramercy-Tavern-Cookbook-Michael-Anthony/dp/0307888339/?tag=serieats-20\" target=\"_blank\">The Gramercy Tavern Cookbook</a></strong></em>.", "totalTime": "2 hours, including setting/cooling", "recipeYield": "makes about 1 1/4 pounds", "recipeCategory": ["Bake the Book", "Candy", "Chocolate", "Desserts", "Pumpkin"], "recipeIngredient": ["12 tablespoons (1 1/2 sticks) unsalted butter, cubed", "1 cup sugar", "1/2 teaspoon salt", "1 teaspoon vanilla extract", "8 ounces bittersweet chocolate, chopped", "3/4 cup toasted pumpkin seeds, toasted", "Sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large baking pan with parchment paper. Put the pan on a flat surface and protect the surface—because toffee is sugar cooked at a high temperature—with a trivet or a towel underneath. In a small saucepan, combine the butter, sugar, and 2 tablespoons water (being careful not to get sugar on the sides of the pan, where it can crystallize) and bring to a boil over medium-high heat, stirring until the sugar dissolves. Boil the mixture, stirring constantly, until it turns a beautiful caramel color (about 295°F on a candy thermometer), about 7 minutes. Immediately remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the salt and stir to combine, then add the vanilla and stir to combine. Be careful: the mixture is very hot and will sputter. Immediately pour the toffee onto the parchment paper–lined pan and, with a heatproof spatula, quickly spread it in an even layer almost to the edges. (This is very hot, so resist the temptation to stick a finger in it.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Temper the chocolate. Bring 2 inches of water to a bare simmer in a medium pot. Set a medium metal bowl over it, add two-thirds of the chocolate, and gently melt it. Remove the bowl from the heat and stir in the remaining chocolate until melted and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat the surface of the cooled toffee dry to make sure the chocolate will adhere properly. With the heatproof spatula, spread the melted chocolate in an even layer over the toffee, then quickly scatter the pumpkin seeds on top and sprinkle with sea salt. Let stand until the chocolate hardens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the toffee into large pieces. The toffee will keep, covered, for up to 2 weeks.</p>"}]}