{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130220-bakethebook-doubleamarettosemifreddo.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["amaretto", "apricot", "Bake the Book", "nigellissima", "semi-freddo"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Double Amaretto Semifreddo with Golden Gleaming Sauce", "link": "https://www.seriouseats.com/recipes/2013/02/nigella-lawson-amaretto-semifreddo-recipe.html", "description": "This doubly flavored delight from <em> <strong>Nigellissima</strong></em> owes its taste to amaretto liqueur, as well as a generous helping of crunchy amaretto cookies mixed into a rich, creamy semifreddo base. A coating of apricot-almond golden sauce is a luxurious final touch.", "totalTime": null, "recipeYield": "serves 6", "recipeCategory": ["Apricot", "Bake the Book", "Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["2 ounces amaretti cookies (crunchy, not morbidi)", "1 egg white", "1 cup heavy cream", "2 tablespoons confectioners’ sugar", "3 tablespoons amaretto liqueur", "&nbsp;", "<strong>For the Sauce</strong>", "1/4 cup apricot preserves", "1/4 cup amaretto liqueur", "6 1/2-cup metal rum baba/dariole molds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the amaretti cookies into a resealable plastic bag and bash them with a rolling pin until you have crumbs: you should end up with a mixture of coarse and fine crumbs but don’t be so brutal that you end up with sand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the egg white in a bowl and whisk to soft peaks. In a separate bowl whisk the cream until soft peaks form, then fold in the egg white. You can use a hand mixer for speed and you don’t need to wash the beaters between whisking the whites and the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold in the confectioners’ sugar and amaretto liqueur, then fold in the cookie crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill 6 dariole molds, packing in the mixture, tamping it down, and smoothing the top. Then cover each one with plastic wrap and place in the freezer, leaving for at least 6 hours or overnight (and not longer than 1 week).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, put the preserves and amaretto liqueur into a small saucepan and bring to a boil, whisking together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil for 1 minute, then take off the heat and let cool slightly before pouring into a small milk or cream pitcher. Leave to cool, then cover and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve the semifreddo, sit the bottom of each dariole mold, one at a time, in a bowl of just boiled water for a brief 30-second dip, wipe off the water, then put a small plate or saucer on top, upturn the mold, and turn out the semifreddo (dip again if it won’t come out first time), and spoon a little of the golden, gleaming sauce over it. I’d put the bottle of amaretto and 6 shot glasses on the table, too.</p>"}]}