{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/051613-251842-cook-the-book-sardines-in-spicy-tomato-sauce.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Filipino", "keywords": ["Cook the Book", "Filipino", "fish", "mains", "marvin gapultos", "rice", "sardines", "seafood", "the adobo road cookbook", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sardines in Spicy Tomato Sauce from 'The Adobo Road Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/05/sardines-in-spicy-tomato-sauce-from-the-adobo-road-cookbook-recipe.html", "description": "For <strong><a href=\"http://burntlumpiablog.com/about\" target=\"_blank\">Marvin Gapultos</a></strong>, canned sardines in tomato sauce were the ultimate bachelor comfort food. These days, however, he has ditched the can for a fresh version featured in his new cookbook, <em><a href=\"http://www.amazon.com/The-Adobo-Road-Cookbook-Journey-From/dp/0804842574/?tag=serieats-20\" target=\"_blank\">The Adobo Road</a></em>. His sauce is a perfect example of the melting pot of culinary influences in the Philippines: tomatoes from the Americas, smoked paprika and white wine from Spain, and fish sauce and <em>calamansi</em> lime juice from Southeast Asia. Fresh sardines quickly broiled atop the fragrant sauce are a step above the canned variety and just as effortless to prepare.", "totalTime": "50 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cook the Book", "Filipino", "Fish", "Gluten-Free", "Mains", "Rice"], "recipeIngredient": ["2 tablespoons, plus 3 tablespoons olive oil", "2 large shallots, minced (2 tablespoons)", "4 cloves garlic, minced (1 tablespoon)", "1/2 teaspoon dried red pepper ﬂakes", "1/2 teaspoon smoked Spanish paprika, or regular paprika", "1 tablespoon tomato paste", "1 pound (500 g) cherry tomatoes, halved", "1/2 cup (125 ml) white wine", "1/4 cup (65 ml) water", "1 tablespoon ﬁsh sauce", "8–10 small fresh sardines, about 1 pound (500 g), cleaned and gutted", "2 teaspoons salt", "1 teaspoon freshly ground black pepper", "1 tablespoon fresh calamansi juice, or fresh lemon juice", "Fresh calamansi limes, or fresh lemon wedges, for squeezing over the sardines"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the olive oil in a large oven-proof sauté pan over moderately high heat. Add the shallot, garlic, dried red pepper ﬂakes, and paprika and cook until the shallot becomes soft and translucent, 3-5 minutes. Add the tomato paste and stir to combine, continuing to cook until the tomato paste just begins to brown, 1 minute more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the cherry tomatoes into the pan and sauté until the tomatoes soften and have released some of their juices, 5-7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the wine into the pan, stirring to scrape up any browned bits from the bottom of the pan. Add the water and ﬁsh sauce and simmer until the liquid reduces and thickens a bit, about 5 minutes more. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the sardines, inside and out, with the salt and black pepper. In a large bowl, whisk together the remaining 3 tablespoons of olive oil with the calamansi (or lemon) juice. Using your hands, toss the sardines in the olive oil and citrus mixture, making sure the mixture dresses the ﬁsh inside and out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place an oven rack in the closest position to the broiler and turn the broiler on high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the sardines from the bowl and arrange them in a single layer on top of the tomato sauce in the sauté pan. Place the pan underneath the broiler and broil for 10-12 minutes, ﬂipping the ﬁsh over once. The sardines are ready when the skin is nicely browned and crisped, and the thickest part of the ﬁsh easily ﬂakes from the tip of a knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with steamed white rice and calamansi limes, or lemon wedges, on the side for squeezing over the ﬁsh</p>"}]}