{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130207-vegan-udon-mushroom-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["cabbage", "Japanese", "mushrooms", "noodle", "noodle soup", "soup", "tofu", "udon", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Japanese Udon With Mushroom-Soy Broth, Stir-Fried Mushrooms, and Cabbage (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/02/vegan-udon-mushroom-soy-cabbage-vegan-experience-recipe.html", "description": "Dried mushrooms are the secret to this intensely-flavored mushroom-soy broth that is 100% vegan. Serve it with udon noodles topped with with stir-fried mushrooms and cabbage, scallions, and fried tofu.", "totalTime": "1 hour", "recipeYield": "serves 2", "recipeCategory": ["Cabbage", "Dairy-Free", "Japanese", "Mains", "Mushrooms", "Pasta", "Soups and Stews", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 ounce dried woodear mushrooms (see note)", "1/2 ounce dried morel mushrooms (see note)", "4 ounces mixed small fresh mushrooms (shiitake, shimeji, oyster, and enoki are all good options), trimmed, stems and scraps reserved", "8 scallions", "2 cloves garlic, smashed", "1 small yellow onion, skin-on, split in half", "1 (4-inch) piece of kombu (see note)", "2 tablespoons soy sauce", "2 tablespoons mirin (see note)", "Kosher salt", "2 tablespoons vegetable oil, divided", "1 cup napa cabbage, cut into 3/4-inch strips", "2 servings fresh or dried udon noodles", "2 to 4 pieces fried tofu (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine woodear and morels mushrooms in a medium saucepan and cover with 1 1/2 quarts water. Bring to a boil over high heat, then remove from heat and let rest 10 minutes while mushrooms rehydrate. Remove mushrooms with a slotted spoon and set aside. Add fresh mushroom scraps and stems, botton 1-inch of scallions, garlic cloves, onion, and kombu to pot. Bring to a boil and reduce to a sub-simmer. Cook for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, rip out the tough central stems from the woodear mushrooms and discard. Slice woodears and morels into strips and transfer to a small bowl. Slice fresh mushrooms and add to bowl (if using enoki, reserve separately). Finely slice remaining scallion tops and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When broth is simmered, strain through a fine mesh strainer and return to pot, discarding solids. Add soy sauce and mirin and season to taste with salt. You should have about 1 quart of broth. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon vegetable oil in a wok or a 12-inch skillet over high heat until lightly smoking. Add mushrooms (except for enoki, if using) and stir-fry until lightly browned and completely tender, about 2 minutes. Season to taste with salt and transfer to a plate. Add remaining tablespoon oil and heat until lightly smoking. Add cabbage and stir-fry until tender and charred in spots, about 2 minutes. Season to taste with salt. Transfer to plate with mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook udon in boiling water according to package directions, adding fried tofu to the water as they cook to heat. Strain and divide noodles between two serving bowls. Pour hot broth over noodles. Top with chopped scallions, stir-fried mushrooms and cabbage, raw enoki (if using), and fried tofu. Serve immediately.</p>"}]}