{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131004-sous-vide-101-egg-chorizo-corn-crouton-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["basil", "brioche", "chorizo", "corn", "egg", "poach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Poached Eggs With Corn, Chorizo, Basil, and Brioche Croutons", "link": "https://www.seriouseats.com/recipes/2013/10/poached-eggs-corn-chorizo-basil-brioche-croutons-sous-vide-recipe.html", "description": "Tender poached eggs served with a ragout of corn, chorizo, scallions, and basil, and topped with brioche croutons toasted in chorizo oil.", "totalTime": "", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Corn", "Eggs", "Poaching", "Sous Vide"], "recipeIngredient": ["4 ounces Spanish-style chorizo, cut into 1/2- to 1/4-inch cubes (see note)", "1 slice brioche, cut into 1/2-inch cubes", "Kosher salt and freshly ground black pepper", "2 tablespoon olive oil", "2 ears corn, kernels cut off of ears (about 3 cups kernels)", "1 medium clove garlic, minced (about 1 teaspoon)", "2 scallions, thinly sliced, greens and whites reserved separately", "1/2 cup homemade or store-bought low sodium chicken or vegetable stock", "3 tablespoon unsalted butter", "2 tablespoons chopped basil leaves", "4 poached eggs (see note)", "Crunchy sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat chorizo in a medium non-stick skillet over medium heat, tossing and stirring occasionally until crisp and fat has rendered. Transfer to a paper towel-lined plate with a slotted spoon, leaving fat in skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add brioche cubes to skillet and increase heat to medium high. Season with salt and pepper and cook, tossing and stirring occasionally, until well toasted on all sides, about 4 minutes. Bread will stick to skillet at first and be difficult to toss or stir, but will loosen up as it absorbs fat and cooks. Transfer to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add oil to now-empty skillet and heat over high heat until lightly smoking. Add corn and toss to coat with oil. Season with salt and pepper. Cover and cook, tossing occasionally, until corn is charred in spots, about 6 minutes. Add garlic, all of scallion whites, and half of scallion greens. Cook, stirring constantly, until aromatic, about 30 seconds. Add stock and butter and cook, stirring, until emulsified and saucy, about 1 minute. Season to taste with salt and pepper. Return chorizo to skillet and stir to combine. Stir in basil, reserving some small leaves for garnish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide 3/4 of the corn mixture between four small warm bowls or cups, leaving a small well on one side for the eggs. Add poached eggs to each cup. Spoon remaining corn mixture over and around eggs, making sure that the liquid gets divided evenly. Divide croutons evenly between each cup. Sprinkle with remaining scallion greens and basil leaves. Sprinkle egg with coarse sea salt. Serve immediately.</p>"}]}