{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130807-preserved-lemonade-curd-closeup-edit.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["lemon", "lemon curd", "Preserved", "Preserves"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pink Lemonade Curd", "link": "https://www.seriouseats.com/recipes/2013/08/pink-lemonade-curd.html", "description": "A pitcher of pink lemonade on a hot summer day can bring near instant gratification,  but canning pink lemon curd will allow you to enjoy summery flavor in January, when a 90-degree day would be a welcome change from winter.", "totalTime": "1 1/2 hours", "recipeYield": "Makes six (1/2 pint) jars", "recipeCategory": ["Condiments and Sauces", "Lemon", "Preserved"], "recipeIngredient": ["3 cups granulated sugar", "2 pints raspberries (about 4 cups, 1 ½ pounds), gently washed", "1 cup lemon juice, squeezed from 6-8 lemons", "Zest from 2 lemons", "8 whole eggs", "1/2 teaspoon salt", "12 ounces butter (3 sticks), cubed", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare boiling water canner and sterilize 6 half-pint jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids and rings to sit in hot water until you need them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush the raspberries by turning them in a food mill or crushing them through a fine sieve using the back of a spoon until all that remains are the seeds. You should have about one cup of raspberry juice/pulp. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a double boiler by bringing an inch of water to a boil in a medium-sized (3 quart) saucepan. Once the water boils, drop the heat to low and maintain an even simmer. Set a non-reactive, heat-safe bowl on top of the saucepan. Make sure that the bottom of the bowl is not in contact with the water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, eggs, lemon zest, lemon juice, raspberry pulp, and salt in the bowl of your double boiler and mix well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook curd, whisking frequently, until the mixture begins to lighten in color and thicken, about ten minutes. Whisk in butter and vanilla and continue to cook until it registers 170&deg;F on a candy or instant read thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once curd has reached desired consistency, turn off heat and strain through a fine sieve to catch large bits of lemon zest or any solidified egg. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle curd into prepared jars, leaving a quarter inch of head space. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight. </p>"}]}