{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130925-figpasta3.jpg", "author": {"@type": "Person", "name": "Deborah Mele"}, "recipeCuisine": "Italian", "keywords": ["easy", "fig", "Italian", "italian easy", "pasta", "quick", "spaghetti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pasta With Figs and Prosciutto", "link": "https://www.seriouseats.com/recipes/2013/10/italian-easy-pasta-figs-prosciutto-recipe.html", "description": "A unique fall pasta dish that combines the luscious sweetness of ripe, fresh figs with the saltiness of prosciutto.", "totalTime": "25 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Italian", "Mains", "Pasta"], "recipeIngredient": ["8 thin slices of Prosciutto, about 6 ounces, divided", "4 tablespoons olive oil", "1/2 cup finely chopped onion (about 1/2 medium onion)", "2 garlic cloves, minced (about 2 teaspoons)", "1 tablespoon freshly ground black pepper", "1/2 to 1 teaspoon red chili flakes", "8 to 10 medium fresh, ripe figs, about 2 1/2 cups chopped", "1 pound pasta of choice (see note)", "1/3 cup chopped fresh parsley leaves", "1/3 cup lightly toasted pine nuts (see note)", "Grated Pecorino Romano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F. Place two slices of prosciutto on a baking sheet. Bake the prosciutto until crispy, about 7 minutes then cool to room temperature. Once cool, crumble the prosciutto into pieces and set aside to garnish the completed pasta dish. Roll the other 6 slices of prosciutto up lengthwise, and then thinly slice into strips and set aside until needed for the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large pot of lightly salted water on to boil. While the pasta water is coming to a boil, heat the oil in a small pot over medium heat until lightly smoking, then cook the onion, stirring, until it is soft and translucent, about 5 minutes. Add the garlic, sliced prosciutto, pepper, and chili flakes and cook, stirring often for about 4 minutes. Add the figs, stir gently to mix and lower the heat to medium-low, then continue to cook until the figs begin to break down, about 4 minutes. Keep warm. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta until it is \"al dente\" following the package instructions, then drain, reserving a small cup of the pasta water. Return the pasta to the pot and empty the fig and prosciutto mixture on top. Place the pot over medium high heat, and stirring constantly, add as much pasta water as is needed to lightly coat the pasta strands, usually about 1/4 to 1/3 of a cup. Once the pasta is piping hot and well mixed, add the parsley and toss.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the pasta in individual bowls, topped with a sprinkling of the toasted pine nuts, and crispy prosciutto crumbles. Pass grated cheese at the table.<br />\r\n</p>"}]}