{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130116-kumquat-tart-primary.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["citrus desserts", "kumquats", "tart", "very small anna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Kumquat Tart", "link": "https://www.seriouseats.com/recipes/2013/01/kumquat-tart-recipe.html", "description": "Everyone's had a lemon tart, so why not kumquat? I couldn't resist creating a dessert that used the mighty kumquat as the focal point.", "totalTime": "4 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Citrus", "Fruit Desserts", "Pies, Tarts, and Crumbles", "Very Small Anna"], "recipeIngredient": ["<strong>For the Crust:</strong>", "5 tablespoons plus 1 teaspoon unsalted butter, softened", "1/4 cup plus 2 tablespoons confectioner's sugar", "1/2 vanilla bean", "1 egg yolk", "1 1/4 cups (about 5 ounces) cake flour", "Pinch salt", " ", "<strong>For the Curd</strong>", "2 cups fresh kumquats", "3/4 cup (about 5 ounces) sugar", "2 teaspoons cornstarch", "2 eggs plus 2 egg yolks", "1/2 cup (8 tablespoons) butter, cut in 1/2 inch cubes", "2 tablespoons extra virgin olive oil", " ", "<strong>Optional</strong>", "1/4 cup jam or marmalade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust</strong>: Place butter and confectioner's sugar in bowl of stand mixer fitted with a paddle attachment. Split and scrape vanilla bean and add scrapings to bowl, reserving pod for another use. Set mixer on medium-low speed and mix until butter is light and fluffy, about 2 minutes, scraping as necessary. With mixer running, add yolks one at a time, scraping bowl in between additions. Add cake flour and salt and mix on low until fully incorporated, about 15 seconds. Transfer to a lightly floured board, pat into a 4-inch circle, wrap in plastic and chill at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the middle of the oven. Preheat the oven to 350&deg;F. When ready to roll, on a lightly floured surface, roll the dough out to 1/8-inch thick, turning often to keep the dough as circular as possible. Place an 8 inch springform pan in the middle of the dough and cut a circle one inch larger than the pan around it. Remove the pan and center the dough in it, smoothing it into the bottom. Don't worry if it tears or folds over itself; the dough is very forgiving and you can patch it as you need to. Make sure you have a nice right angle all the way around the edge and flatten the extra dough against the rim of the pan. Measure with a ruler to be sure it's an inch high all the way around, trimming with a paring knife if necessary. Dock the bottom of the crust with a fork, paring knife of cake tester, then freeze until solid, at least ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the crust in the center of the oven and bake for 10 minutes, then turn and bake for another 5. If the crust has bubbled up when you go to turn it, gently press the bubbles down with your hand, using an oven mitt or dry kitchen towel. Set crust aside until fully cooled, at least 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the outer ring from the springform pan. If using, put the jam or marmalade in a small saucepan and warm over low heat until liquid. Pour into crust and spread evenly with a small offset spatula or the back of a spoon. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Place kumquats in a blender and blend until finely pureed. Place in a medium saucepan, set aside. Combine sugar and cornstarch in a small bowl and whisk until incorporated. Whisk into kumquat puree. Add eggs and yolks and whisk to combine. Set a fine mesh strainer over a medium bowl. Set a timer for two minutes but don't start it yet. Place kumquat mixture over medium heat, whisking constantly, until the mixture boils, about 5 minutes. Once mixture begins boiling, turn on the timer. Whisk constantly while the mixture boils to cook the cornstarch, being careful not to scorch on the bottom. Once timer goes off, immediately remove from heat and whisk in butter and olive oil. Once incorporated, press through strainer into bowl, discarding the solids. Scrape filling into crust and spread evenly with a small offset spatula or the back of a spoon. Place in refrigerator and allow to set for at least two hours before slicing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, rock a large chef's knife through the crust first and then through the middle. Pull the knife straight out and wipe it clean before making the next cut. Remove to plates with a cake server or a chef's knife turned sideways. Tart can be stored for up to 3 days in the refrigerator, well wrapped.</p>"}]}