{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130128-238401-cook-the-book-hoi-an-wontons-spicy-tomato-sauce.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Vietnamese", "keywords": ["Charles Phan", "Cook the Book", "Hoi An wontons", "The Slanted Door", "tomato sauce", "Vietnamese Home Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Charles Phan's Hoi An Wontons with Spicy Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2013/01/charles-phans-hoi-an-wontons-with-spicy-tomat.html", "description": "As <strong><a href=\"http://charlesphan.com/index.html\">Charles Phan </a></strong>explains in <em><a href=\"http://www.amazon.com/Vietnamese-Home-Cooking-Charles-Phan/dp/1607740532/?tag=serieats-20\">Vietnamese Home Cooking</a></em>, Chinese cuisine has a strong influence in certain places in Vietnam like the port town <strong>Hoi An</strong>. There, much of the food is a mash-up of cultures (including even Japan), so serving fried wontons is not a major leap, cuisine-wise. Phan's fried wontons use the same filling as his wonton soup--mainly shrimp, pork, mushrooms, and chestnuts--but here they are sealed like ravioli (no tricky folding!) and fried in canola oil. The richness of the dumplings is balanced by serving them with a spicy tomato sauce spiked with fish sauce.", "totalTime": "2 hours and 15 minutes", "recipeYield": "serves 8 to 10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Pork", "Shrimp", "Vietnamese"], "recipeIngredient": ["<strong>Tomato Sauce</strong>", "2 tablespoons canola oil", "3/4 cup thinly sliced shallots", "2 teaspoons minced garlic", "4 Thai chiles, stemmed and minced", "2 tablespoons rice wine", "2 pounds ripe tomatoes (such as Roma or Early Girl), cored and diced", "3/4 cups chicken stock ", "1 tablespoon fish sauce", "&nbsp", "<strong>Pork and Shrimp Wonton Filling</strong>", "8 ounces shrimp, peeled, deveined, and finely chopped", "4 ounces ground pork", "1/3 cup <a href=\"http://www.seriouseats.com/recipes/2013/01/charles-phans-fried-shallots.html\">fried shallots</a>", "3 tablespoons <a href=\"http://www.seriouseats.com/recipes/2013/01/charles-phans-fried-shallots.html\">shallot oil</a>", "1 1/3 cups finely chopped fresh water chestnuts or jicama", "1/3 cup black trumpet mushrooms", "2 tablespoons finely chopped fresh cilantro", "2 tablespoons finely chopped scallion, white and light green parts only", "1 tablespoon plus 1 teaspoon oyster sauce", "1 tabelspoon sesame seeds, toasted and ground to a coarse powder", "1 tablespoon finely minced shallot", "1 tablespoon fish sauce", "2 teaspoons toasted sesame oil", "Pinch ground black pepper", "&nbsp", "50 square wonton wrappers (1-pound package)", "Cornstarch, for dusting", "Canola oil, for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the tomato sauce:</strong> In a saucepan, heat the oil over medium heat. Add the shallots and cook, stirring occasionally, for about 3 minutes, until light golden brown. Add garlic and chiles and cook, stirring occasionally, 45 seconds more, until aromatic. Stir in the rice wine, tomatoes, and stock and bring to a boil. Decrease the heat so the mixture is at a gentle simmer and simmer, stirring occasionally, for \u202845 minutes, to blend the flavors.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the sauce from the heat and stir in the fish sauce. Let cool slightly, then transfer to a blender and process until smooth. Keep warm. (The sauce can be made a day ahead, cooled, covered, and refrigerated; reheat before using.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the wontons:</strong> In a bowl, combine the shrimp, pork, fried shallots, shallot oil, water chestnuts, mushrooms, cilantro, callion, oyster sauce, sesame seeds, raw shallot, fish sauce, sesame oil, and pepper and mix well. The mixture will be loose.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To form the wontons:</strong> Place a wonton wrapper on a work surface. Lightly brush the edges of the wrapper with water and place 1 teaspoon of the filling in the center. Top with a second wonton wrapper, pressing to enclose the filling and form a square, like a ravioli. Force out as much air as possible as you seal the edges to prevent the wontons from puffing up when you fry them. Transfer the finished wontons to a baking sheet or large tray lightly dusted with cornstarch. Repeat until you have used up all of the filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil to a depth of \u20282 inches into a wok or high-sided pot and heat over high heat to 375°F on a deep-frying thermometer. Line a rimmed baking sheet with paper towels and place near the stove. Place a second rimmed baking sheet alongside. Preheat the oven to 200°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil is ready, add one-third of wontons to the oil and fry for 3 minutes, until deep golden brown and crisp. Using a spider or slotted spoon, transfer to the paper towel–lined baking sheet to drain briefly, then transfer to the second sheet pan and keep warm in the oven. Repeat with remaining wontons in two batches, always allowing the oil to return to temperature between batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the wontons on a platter and serve immediately, accompanied by the tomato sauce. Dip the wontons in the sauce and eat.</p>"}]}