{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/092513-267151-cook-the-book-bran-fermented-vegetables.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["beer", "bran", "Cook the Book", "pickle", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bran-Fermented Vegetables from 'Mastering Fermentation'", "link": "https://www.seriouseats.com/recipes/2013/09/bran-fermented-vegetables-from-mastering-fermentation-cookbook.html", "description": "Even if I'd never tried making salami or kombucha before doesn't mean I haven't put it into my body at some point. But these bran-fermented vegetables are a different story. Called <em>nuka</em> in Japan, they're traditionally made by burying relatively dense vegetables, like daikon or carrot, in a salty fermented rice bran mixture fortified with kelp, miso, and/or beer. The vegetables take only a day or so to ferment, and emerge from the bran relatively crisp, tasting lightly of salted sourdough.", "totalTime": "4 to 5 days", "recipeYield": "About 2 cups", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Pickling", "Sides", "Vegetarian"], "recipeIngredient": ["1-gallon crock", "2 pounds bran (rice, wheat, or oat)", "3 strips dried kelp (optional)", "2 1/2 cups nonchlorinated water", "3/4 cup handcrafted beer (ale or lager), at room temperature", "3/4 cup unrefined fine sea salt", "1/4 cup miso (optional)", "1-inch piece fresh ginger, cut into small chunks", "Vegetable scraps (about 1/2 to 3/4 cup), for jump-starting the bran mixture ", "2 to 2 1/2 cups vegetables (small root vegetables, pickling cucumbers, baby onions, cauliflower florets, asparagus, green beans, and ginger), for pickling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry-toast the bran in a large skillet over medium heat for about 5 minutes, or spread on a baking sheet and roast in a 300°F oven just until you can smell it, about 7 minutes. Remove from the heat and cool. Place in a large bowl and toss in the dried kelp, if using. In a separate bowl, combine the water and beer and stir in the salt to combine and dissolve. Stir this into the bran to incorporate; it should look like wet sand. Mix in the miso, if using, and the ginger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Massage the mixture with clean hands until it is a smooth paste sort of like wet sand. For the initial batch, you’ll need to get the bacteria happening a few days in advance of burying the vegetables meant for pickles. In the crock, layer an inch or two of “sand” and then layer in the vegetable scraps. Top with the rest of the “sand,” set the crock on the kitchen counter, cover it with fine-weave cheesecloth, and let the fermentation party begin. Let stand for 3 days, and then remove the pieces of vegetable scraps. The wet sand is then ready to be used for making <em>nuka</em> pickles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and trim the vegetables. Peel if the skin is not to be eaten. Small whole vegetables of about equal size are best. They will ferment at about the same pace, and they are easy to bury and then find in the sand. They can be sliced into smaller pieces post-pickling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump out the wet sand mixture from the crock onto a baking sheet. Mix in a bit more water if the mixture has be-come crumbly. Taste and smell it. To me, it smells like healthy bread dough or even miso. If at any time the mixture smells sour or funky, discard it and start a fresh batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the bottom of your crock with about 2 inches of the “sand.” Partially bury one variety of vegetable into the mixture, leaving space between the pieces to fill with sand. Fill with sand in between, and then place another layer of sand on top (this time about 1 inch deep), and proceed with the next vegetable. Repeat the process, finishing with a layer of sand to completely enclose the vegetables. Cover the crock with fine-weave cheesecloth and secure with a rubber band. Set it on your kitchen counter or in a cool place to ferment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste-test one piece after 12 hours. If still “raw,” continue fermenting; most vegetables take 1 to 2 days. If you like it (it should still be a bit crunchy), gently dump the mixture onto a baking sheet and dig for your treasures. Brush off any bits of bran from the pickles or gently slosh them in a bowl of cool water to remove excess. The pickles are ready to consume. It is best to eat them within a day or two after pickling. Cut into slices or chunks as desired and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather up the wet sand and store in the same crock. You do not need to wash the crock, as the bacteria within will be good for the next batch. Start a new batch of pickles or plug in a few bits of veggies to keep the bacteria colony going. Cover the crock with cheesecloth and set at room temperature for a day. If not using within 24 hours, cover with plastic wrap and refrigerate. Bring to room temperature and massage with your clean hands before making your next batch of pickles. Handled properly, with salt and water replenished as needed, this bran mixture will only get better with time. You’ll be able to pass it along to a loved one! </p>"}]}