{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131104-272122-cook-the-book-thai-cucumber-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["andy ricker", "Cook the Book", "cucumber", "salad", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andy Ricker's Tam Taeng Kwaa (Thai Cucumber Salad) From 'Pok Pok'", "link": "https://www.seriouseats.com/recipes/2013/11/andy-ricker-thai-cucumber-salad-recipe-from-pok-pok.html", "description": "<strong><a href=\"http://newyork.seriouseats.com/2012/06/pok-pok-authentic-northern-thai-cuisine-brooklyn-andy-ricker-review.html\">Andy Ricker</a></strong> opens his new <em><a href=\"http://www.amazon.com/Pok-Stories-Roadside-Restaurants-Thailand/dp/1607742888/?tag=serieats-20\">Pok Pok</a></em> cookbook with a series of variations on papaya salad. These are the beating heart of his namesake restaurant, providing its inspiration as well as a sweet and sour bridge between the range of complex savory dishes. This particular salad, made with cucumbers instead of papaya, is a cool and refreshing twist.", "totalTime": "45 minutes", "recipeYield": "Serves 2 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Cucumber", "Salads", "Sides", "Thai"], "recipeIngredient": ["1 tablespoon medium-size dried shrimp, rinsed and patted dry", "1 ounce palm sugar", "1/4 teaspoon water", "1 small lime (preferably a Key lime), halved through the stem", "3 grams peeled garlic (about 1 medium clove), halved lengthwise", "1 gram dried Thai chiles (about 4), soaked in lukewarm water just until pliable, about 10 minutes, then drained", "1 ounce long beans, ends trimmed, cut into 2-inch lengths (about 1/2 cup)", "7 ounces Persian, English, or Japanese cucumbers (or any firm variety without large seeds and thick, bitter skin)", "1 tablespoon Thai fish sauce", "1 tablespoon naam plaa raa (fermented fish sauce)", "1 tablespoon lime juice (preferably from Key limes or spiked with a small squeeze of Meyer lemon juice)", "2 ounces cherry tomatoes (about 4), halved, or quartered if very large", " generous tablespoons coarsely chopped unsalted roasted peanuts", "2 ounces cooked Vietnamese or Thai dried rice vermicelli (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Dry fry the shrimp and soften the palm sugar:</strong> Heat a small dry pan or wok over medium heat, add the dried shrimp, and cook, stirring frequently, until they’re dry all the way through and slightly crispy, about 5 minutes. Set them aside in a small bowl to cool. They’ll keep covered at room temperature for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the palm sugar in a small microwavable bowl, sprinkle on the 1/4 teaspoon of water, cover the bowl with plastic wrap, and microwave on low just until the sugar has softened (not liquefied), 10 to 30 seconds. Pound the mixture in a mortar (or mash it in the bowl) until you have a smooth paste. Covered, it will keep soft for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the salad:</strong> Cut one of the lime halves lengthwise into thirds, then cut the thirds in half crosswise. Set aside 3 of the pieces (reserve the remaining lime for another purpose).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic, chiles, and 1 heaping teaspoon of the softened palm sugar in a large clay mortar and pound just until you have a chunky sludge with small but visible pieces of garlic and slightly broken down chiles (do not turn the chiles into mush), 5 to 10 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the 3 lime wedges and pound very lightly and briefly, just to release the juice. Add the shrimp, pound lightly just to release their flavor (don’t smash or pulverize them), then add the long beans and pound lightly to bruise them (they should not break into pieces or dramatically flatten).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve the cucumber lengthwise and cut it into angled, irregular 3/4- to 1-inch chunks. Add the cucumber, both fish sauces, and lime juice. The next step is easy but subtle. You want to use the pestle to barely bruise the cucumber (lightly pounding at a slight angle, not directly up-and-down) for about 10 seconds, while simultaneously using a large spoon to scoop up from the bottom of the mortar, essentially tossing the cucumber, palm sugar mixture, and the other ingredients as you pound. Do not smash the cucumber.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes and pound lightly, just to release the juices. Add the peanuts and mix briefly but well with the spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’re using the noodles, put them on a plate with raised edges or in a shallow bowl. Spoon the contents of the mortar, liquid and all, over them. Stir well before you eat.</p>"}]}