{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/032113-244663-cook-the-book-barely-smoked-salmon.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["avocado", "Cook the Book", "fish", "pumpernickel", "richard blais", "salmon", "seafood", "smoked salmon", "try this at home"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Richard Blais's Barely Smoked Salmon with Pumpernickel-Avocado-Egg Salsa and 'Everything Bagel' Vinaigrette", "link": "https://www.seriouseats.com/recipes/2013/03/richard-blais-barely-smoked-salmon-pumpernickel-avocado-egg-salsa-everything-bagel-vinaigrette-recipe.html", "description": "Blais's <strong>Barely Smoked Salmon with Pumpernickel-Avocado-Egg Salsa and \"Everything Bagel\" Vinaigrette</strong> takes a deli staple, bagel and lox, and upends its style in a decidedly refined form. The anchor is a small fillet of salmon, smoked for only five minutes. This leaves the fish almost raw with a faint whiff of smoke. The bagel appears crumbled and crunchy in a \"salsa\" like assemblage with avocado and peeled cherry tomatoes. Capers, red onion, and egg also show up, along with the \"everything bagel\" seeds and spices present in the vinaigrette. It makes for a beautiful plate, unfamiliar in appearance, but comforting in flavor.", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Avocado", "Bread", "Breakfast and Brunch", "Cook the Book", "Salmon"], "recipeIngredient": ["Cooking spray", "1/2 cup hickory chips", "Four 4-ounce center-cut skin-on wild salmon fillets", "2 cups cubed or roughly torn (1/2-inch pieces) pumpernickel bagel, pumpernickel bread, lightly toasted, or toasted pumpernickel croutons", "1/2 small red onion, finely chopped", "1 tablespoon capers, drained", "1 ripe avocado, halved and pitted", "8 cherry tomatoes, peeled", "1 large hard-boiled egg, white and yolk separated", "2 tablespoons chopped fresh flat-leaf parsley", "1 teaspoon chopped fresh tarragon", "Kosher salt and freshly ground black pepper to taste", "<a href=\"http://www.seriouseats.com/recipes/2013/03/richard-blaiss-everything-bagel-vinaigrette.html\">\"Everything Bagel\" Vinaigrette</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray the rack of a stovetop smoker with cooking spray and set the salmon on it. Pour the hickory chips into the chamber of the smoker, close the lid three-quarters of the way, and heat over medium heat. After about 5 minutes, when the chips begin to smolder, open the lid and place the salmon on the rack over the chips. Close the lid and remove from the heat. Let stand for 5 to 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large bowl, combine the bagel, onion, and capers. With a small melon baller, cut balls from the avocado and add to the bowl along with the tomatoes. Finely chop the hard-boiled egg white and add it, along with the parsley and tarragon. Season with salt and pepper and gently toss with a rubber spatula. Drizzle enough vinaigrette over the pumpernickel mixture to moisten. Toss very gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, transfer the salmon to four plates. Divide the pumpernickel salsa among the plates. Drizzle the remaining vinaigrette over the salmon and crumble the egg yolk over the salmon. Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong If you don’t have a stovetop smoker, you can easily replicate one with two stacked 9 x 11-inch aluminum foil pans or an old rectangular cake pan. Put the hickory chips in the pan and use a double layer of aluminum foil to cover it for smoking. If you don’t have a small rack<br />\r\nthat rests on top of the chips, simply roll pieces of aluminum foil into tight sturdy rods and lay them close together in the pan; spray them with cooking spray before you heat the hickory chips. Place the salmon on the rack or foil rods and smoke as directed.</p>"}]}