{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130415-stuffed-chilies-recipe01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["poblano", "rice", "stuffed poblano", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "8"}, "name": "Stuffed Roasted Poblano Peppers With Cashew-Chipotle Sauce", "link": "https://www.seriouseats.com/recipes/2013/04/stuffed-poblano-pepper-cashew-chipotle-sauce-recipe.html", "description": "Smoky poblanos stuffed with rice flavored with raisins and capers in a creamy cashew-chipotle sauce.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Christmas", "Mains", "Rice", "Vegetarian"], "recipeIngredient": ["<strong>For the Cashew-Chipotle Salsa</strong>", "4 tablespoons olive oil", "1 cup cashews", "2 medium cloves garlic, minced (about 2 teaspoons)", "1/2 teaspoon ground cumin", "1/2 cup homemade or store-bought low sodium vegetable or chicken stock (see note)", "3 whole chipotles packed in adobo sauce, roughly chopped", "1 teaspoon red wine vinegar", "1 teaspoon sugar", "Kosher salt and freshly ground black pepper", "&nbsp;", "<strong>For the Peppers</strong>", "6 medium poblano peppers", "1 small onion, finely diced (about 1 cup)", "1 green bell pepper, finely diced (about 1 cup)", "1 red bell pepper, finely diced (about 1 cup)", "1 1/2 cups long grain rice", "1/2 cup raisins", "1/2 cup capers, drained, rinsed, and roughly chopped", "3 cups homemade or store-bought low sodium vegetable or chicken stock (see note)", "1/2 cup roughly chopped cilantro", "6 ounces grated jack, mozzarella, or Oaxacan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a small saucepan over medium heat until shimmering. Add cashews and cook, stirring frequently, until lightly browned, about 2 minutes. Add garlic and cumin and cook, stirring constantly, until fragrant, about 30 seconds. Add chicken stock, chipotle peppers, vinegar, and sugar and bring to a simmer. Transfer to a blender and blend on high speed until smooth, about 2 minutes Season to taste with salt and black pepper. Transfer to a container and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place poblano peppers directly over the flame of a gas burner and cook, turning occasionally, until charred on all surfaces, about 10 minutes total. Alternatively, arrange on a rimmed baking sheet, preheat broiler to high, and broil as close as possible to heating element, turning occasionally, until charred on all sides, about 15 minutes total. Transfer hot charred poblanos to a large sheet of aluminum foil. Wrap tightly and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons olive oil in a large saucepan or Dutch oven with a tight fitting lid over medium-high heat until shimmering. Add onions and bell peppers and cook, stirring occasionally, until softened, about 5 minutes. Stir in rice and cook, stirring frequently, until lightly toasted, about 3 minutes. Stir in raisins and capers. Add stock and bring to a simmer over high heat. Reduce to low, cover and cook until liquid is totally absorbed, about 25 minutes. Fluff rice with a fork and stir in cilantro.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400°F. Alternatively, ignite a large chimney full of coal, allow it to burn to gray ashes, then spread coals over one side of coal grate. Cover grill and allow to preheat. Alternatively, set half the burners of a gas grill to high. Cover and allow to preheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap poblano peppers and carefully peel. Slit each pepper lengthwise and remove seeds. Spread a thin layer of sauce over the bottom of a 9- by 13-inch baking dish or a 10-inch cast iron skillet. Stuff each pepper with rice and close until the shape resembles a pepper. Place in the sauce seam-side-down. Repeat until all six peppers are stuffed and placed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover peppers with more sauce and grated cheese. Transfer baking dish or skillet to the oven or to the cooler side of the grill. Cook until cheese is melted and sauce has browned, about 25 minutes total. Serve immediately with extra rice on the side.</p>"}]}