{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/2013.5.02-Pork%20Vindaloo.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["Beyond Curry", "dinner", "Indian", "pork", "pork vindaloo", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Pork Vindaloo", "link": "https://www.seriouseats.com/recipes/2013/02/beyond-curry-pork-vindaloo-recipe.html", "description": "Spicy and piquant, Pork Vindaloo has pride of place on Sundays and days of feasting in Indian Catholic homes. Usually mopped up with soft white bread or drenched over fluffy white rice.", "totalTime": "1 hour", "recipeYield": "Serves 2", "recipeCategory": ["Beyond Curry", "Indian", "Pork"], "recipeIngredient": ["15 dried Kashmiri chillies (see note)", "2 teaspoons toasted whole cumin seeeds", "2 teaspoons turmeric", "2 (1-inch) pieces of cinnamon", "9 whole black peppercorns", "7 whole cloves", "1 teaspoon sugar", "10 garlic flakes (or 2 medium cloves garlic, roughly chopped)", "1 inch piece ginger, peeled and roughly chopped", "1/2 cup of palm vinegar, or 1/3 cup rice vinegar", "1/2 pound pork shoulder, cut into 1-inch cubes", "Kosher salt", "1 medium onion, roughly chopped (about 1 cup)", "1 1/2 tablespoons vegetable oil", "1 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chilies, cumin, turmeric, 1 piece of cinnamon, 5 peppercorns, 4 cloves, and sugar in a spice grinder. Grind until a fine powder is formed. Transfer spice mixture to food processor or mortar and pestle and add garlic, ginger, and vinegar. Process or pound until a fine paste is formed. Scrape out paste into a small bowl and set aside without washing food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork in a large bowl and season with salt. Add half of spice paste and turn pork to coat. Add onion to food processor and process until a paste is formed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a heavy-bottomed saucepan over medium heat until shimmering. Add the onion paste (do not wash food processor bowl), remaining 4 peppercorns, remaining cinnamon stick, and remaining 3 cloves. Cook, stirring constantly, until onion is soft and oil is fragrant, about 5 minutes. Add remaining spice paste and cook, stirring occasionally, until the oil separates and mixture starts to sizzle, about 5 minutes longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pork and cook, stirring occasionally, until browned, about 10 minutes. Add water to the food processor bowl and swirl to rinse. Pour mixture into pan and bring to a simmer, stirring occasionally. Reduce heat to maintain a gentle simmer, cover, and cook until the pork is fork tender, about 1 hour longer. Serve immediately with bread or rice, or for better flavor, cool, store overnight in a sealed container in the refrigerator, and reheat before serving.</p>"}]}