{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131024-270145-cook-the-book-creamed-spinach-with-citrus-kosho.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Aki Kamozawa", "Cook the Book", "H. Alexander Talbot", "ideas in food", "maximum flavor", "side", "spinach", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Creamed Spinach With Citrus Kosho From 'Maximum Flavor'", "link": "https://www.seriouseats.com/recipes/2013/10/creamed-spinach-with-citrus-kosho-from-maximum-flavor.html", "description": "Far from a stodgy, cream-leaden bowl of green mush, this creamed spinach is bright and spicy thanks to homemade citrus kosho (a blend of zest, chiles, lemongrass, and salt) and a puréed mixture of onion and garlic.", "totalTime": "30 minutes, plus 48 hours resting time for the kosho", "recipeYield": "Serves 6", "recipeCategory": ["Cook the Book", "Dairy-Free", "Gluten-Free", "Sides", "Spinach", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>Citrus Kosho</strong>", "12 limes", "2 grapefruits", "2 oranges", "18 lemons", "2 serrano chiles", "3 stalks lemongrass", "2 tablespoons (36 grams) fine sea salt", "3 drops (0.25 gram) Boyajian lemon oil or lemon essential oil (optional)", "3 drops (0.25 gram) Boyajian lime oil or lime essential oil (optional)", "3 drops (0.25 gram) Boyajian orange oil or orange essential oil (optional)", " ", "<strong>Creamed Spinach</strong>", "1 small onion, chopped", "3 garlic cloves", "1 tablespoon (15 grams) Citrus Kosho (above) or store-bought yuzu kosho", "4 tablespoons (56 grams) unsalted butter", "1 1/2 teaspoons (38 grams) fine sea salt", "1 1/2 pounds (680) grams baby spinach", "1/2 cup (120 grams) crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the kosho:</strong> Zest the limes, grapefruits, oranges, and lemons into a small bowl. Thinly slice the chiles. Remove the tough outer leaves of the lemongrass to expose the tender hearts. Slice the heart of the lemongrass. Put the citrus zest, chiles, lemongrass, and salt into a mortar. Use the pestle to pulverize the ingredients to a uniform paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Juice and strain 1 lime and 1 lemon and add them to the mortar and stir to combine. Add the lemon, lime, and orange oils if using to the mortar and stir to combine. Put the citrus kosho into a small jar and refrigerate for at least 2 days to let the flavors develop. Citrus kosho can be stored in an airtight container in the refrigerator for up to 1 month.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the spinach:</strong> Put the onion, garlic, and citrus kosho in a blender and purée until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, melt the butter over medium heat. Add the onion purée, salt, and cook, stirring, for 4 to 5 minutes until the mixture has thickened slightly and lost its sharp, raw flavor. Add the spinach a handful at a time, wilting each new addition before adding the next, seasoning the mixture very lightly with salt after every few additions. Add the crème fraîche and bring the mixture to a simmer. Taste for seasoning and serve immediately.</p>"}]}