{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130226-242425-homemade-shamrock-shake.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "ice cream", "ice cream desserts", "mint", "shake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Homemade \"Shamrock Shakes\"", "link": "https://www.seriouseats.com/recipes/2013/03/how-to-make-a-homemade-mcdonalds-shamrock-shake-recipe.html", "description": "This homemade recipe uses few ingredients and comes together without the corn syrup (high fructose or otherwise) and additives and preservatives included in the real deal. Pleasantly minty and thick enough for quality slurping/straw cloggage, this is a shake that goes down easy.", "totalTime": "9 hours", "recipeYield": "Serves 2", "recipeCategory": ["American Classics", "Drinks", "Ice Cream and Frozen Treats", "Non-Alcoholic", "St. Patrick's Day"], "recipeIngredient": ["12 ounces heavy cream", "8 ounces whole milk", "6 ounces sugar", "1/2 teaspoon salt", "6 large egg yolks", "2 cups mint leaves (about 2 ounces), coarsely chopped", "1 vanilla bean, split", "1-2 drops green gel food coloring", "1/2 teaspoon of mint extract (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy medium saucepan, whisk together cream, milk, sugar, salt, and egg yolks until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place saucepan over medium heat and cook, whisking occasionally to prevent scorching, until mixture registers 145° F. Remove from heat and strain into an airtight container. Place container over ice bath and whisk until cooled to room temperature. Stir in mint leaves. Add split vanilla bean. Cover and refrigerate custard overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove custard from refrigerator. Remove vanilla bean, set aside. Strain custard through fine-mesh sieve into large measuring cup. Press on mint leaves to strain out all of the liquid then discard the leaves. Scrape out vanilla bean seeds and whisk them into the strained mixture. Discard the pod. Whisk in green food coloring and mint extract (if desired) then transfer custard to electric ice cream maker and churn according to manufacturer's directions until mixture is the desired thickness (should be about as thick as soft serve). Transfer into two glasses and serve immediately.</p>"}]}