{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131113-266267-crandonut7.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "Kosher", "keywords": ["cranberry", "cranberry sauce", "hanukkah", "sufganiyot", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cranberry Sauce Jelly Doughnuts", "link": "https://www.seriouseats.com/recipes/2013/11/thanksgiving-hanukkah-cranberry-sauce-jelly-doughnut.html", "description": "It's Thanksgiving! It's Hanukkah! All at once! With this momentous overlap of food holidays, why decide on one type of cuisine? These jelly doughnuts, inspired by the Hanukkah specialty <em>sufganiyot</em>, have a Thanksgiving flair thanks to a cranberry sauce \"jelly\" inside.", "totalTime": "3 hours, 30 minutes", "recipeYield": "Makes 12 large doughnuts", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Cakespy", "Cranberry", "Doughnuts", "Kosher", "Pastry"], "recipeIngredient": ["2 cups (about 8 1/2 ounces) all purpose flour, plus more for work surface", "1 packet active dry yeast", "1 teaspoon salt", "1/3 cup (about 1.58 ounces) granulated sugar", "2 large eggs", "3/4 cup (6 ounces) whole milk", "2 tablespoons unsalted butter", "enough vegetable oil to fill a pan at least 3 inches deep", "1 1/2 cups (about 12 ounces) jellied cranberry sauce", "confectioners' sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the flour, yeast, and salt in the bowl of a stand mixer. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, warm the milk, sugar, and butter until the butter has melted, or the mixture reaches about 105&deg;F. Remove from heat and whisk in the eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the wet mixture to the dry, and using the paddle attachment, mix on low speed until the dough comes together. Increase the speed to medium-high, and continue mixing until the dough is smooth and pulls away from the sides of the bowl, five to seven minutes. It will still be somewhat sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the dough into a ball and place in an oiled bowl. Cover with a towel and let it rise in a warm place for about an hour, or until doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Near the end of the rising period, prepare your work area. Dust a work surface with flour, and place the dough on top. Using a floured rolling pin, roll the dough to about 1/4 inch thick. Using a 2- or 3-inch round cutter (or even a floured drinking glass rim, or the top of a wide mouth mason jar top, as I did), cut out as many circles as you can and place on a lightly floured baking sheet. Re-roll the scraps and continue cutting out circles until you've used all the dough. Cover the rounds with plastic wrap and again let them rise, this time for about 30 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place paper towels under a wire rack. Have it near your frying surface. This is where you'll put the doughnuts to cool off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>It's time to get frying. Heat your oil in a large deep skillet or deep pan until it has reached 350&deg;F. Transfer the rounds a couple at a time (you don't want them crowded) and fry until browned&mdash;about 1 to 2 minutes. Flip, and remember the second side takes less time to fry. Using a slotted spoon, transfer to the wire rack. Continue frying until you've finished them all.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By the time you're done frying, the first of the fried doughnuts should be cool enough to handle. Using a small, sharp knife, cut a small but deep hole in one side, large enough to fit a piping tip into. Try to lightly shift the knife from one \"entry\" point, so that you have a small hole on the outside of the doughnut that leads into a larger space inside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Load up a piping bag with your cranberry sauce, and pipe 1-2 tablespoons of sauce into each doughnut. You can also spoon it in if you prefer. Dust with confectioners' sugar for a pretty finish. These doughnuts are best the same day made. </p>"}]}