{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/090613-264853-cook-the-book-swiss-chard-and-spinach-ravioli-nudi.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "Domenica Marchetti", "spinach", "swiss chard", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Swiss Chard and Spinach Ravioli Nudi in Simple Tomato Sauce from 'The Glorious Vegetables of Italy'", "link": "https://www.seriouseats.com/recipes/2013/09/swiss-chard-and-spinach-ravioli-nudi-in-simple-tomato-sauce-recipe.html", "description": "Ravioli nudi are not the first thing that comes to mind when I think of Italian pasta-like dishes. But the small cheesy dumplings, essentially ravioli without the pasta, are a perfect vehicle for enjoying Italian vegetables. The nudi in <strong><a href=\"http://www.domenicacooks.com/about/\">Domenica Marchetti's</a></strong> new cookbook, <em><a href=\"http://www.amazon.com/Glorious-Vegetables-Italy-Domenica-Marchetti/dp/1452108862/?tag=serieats-20\">The Glorious Vegetables of Italy</a></em>, are just as much leafy green as they are ricotta and Parmesan. She combines big leafy spinach with even bigger leafy swiss chard and the cheese for a grassy, earthy dumpling mixed with a light, delicate touch.", "totalTime": "1 1/2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cheese", "Condiments and Sauces", "Cook the Book", "Mains", "Pasta", "Spinach", "Tomato", "Vegetarian"], "recipeIngredient": ["<strong>Ravioli Nudi</strong>", "1 pound (455 g) swiss chard, stems removed and reserved for another use, leaves shredded", "8 ounces (225 g) fresh spinach leaves", "12 ounces (340 g) fresh sheep's milk or well-drained cow's milk ricotta cheese", "Fine sea salt", "Freshly ground black pepper", "Pinch of freshly grated nutmeg", "3/4 cup (85 g) freshly grated Parmigiano-Reggiano cheese, plus more for serving", "2 large egg yolks, lightly beaten", "1/4 cup (30 g) flour, plus more for coating the nudi", "3 cups (720 g) Simple Tomato Sauce (below), heated to a simmer", "&nbsp", "<strong>Simple Tomato Sauce</strong>", "2 garlic cloves, lightly crushed", "1/4 cup (60 ml) extra-virgin olive oil", "2 (28-ounce) can diced tomatoes, with their juice", "Fine sea salt", "5 large fresh basil leaves, shredded or torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the shredded chard leaves in cold water. Place the leaves, with the water still clinging to them, into a large saucepan, cover, and set the pan over medium heat. Cook the chard, tossing it from time to time, for 12 to 15 minutes, until tender and most of the water has evaporated. Turn off the heat, and using tongs, transfer the chard to a colander and let it cool. Rinse out the saucepan and return it to the stove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the spinach leaves in cold water. Place the leaves, with the water still clinging to them, into the saucepan, cover, and set the pan over medium heat. Cook the spinach, tossing it from time to time with tongs, for 5 minutes, until tender. Remove from the heat and transfer to the colander with the chard to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the greens are cool enough to handle, squeeze as much excess water from them as you can. Transfer them to a cutting board and chop finely. You should end up with about 1 packed cup of freshly chopped greens weighing between 7 and 8 ounces (200 and 225 g).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the greens in a large bowl and add the ricotta, 1/2 teaspoon salt, a generous grinding of pepper, the nutmeg, the Parmigiano, and the egg yolks. Mix together gently but thoroughly. Sprinkle in the flour, and gently fold it into the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour some flour into a small shallow bowl. Have ready a large rimmed baking sheet lined with waxed paper or dusted with flour. With your hands, pinch off a piece of the greens mixture, form it into a ball about the size of a chestnut, roll it in the flour, and set it on the baking sheet. Continue to form the nudi until you have used all of the greens mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil over high heat and salt generously. Carefully drop in 8 to 10 nudi. Within 1 or 2 minutes, they will begin to float to the surface. Continue to cook the nudi for another 5 to 6 minutes, until they have floated to the surface and are puffed up. With a large skimmer, remove the nudi and transfer them to a warmed serving bowl. Spoon about 1 cup of the tomato sauce over the nudi and mix very gently. Continue to cook the nudi until you have cooked them all. When they have all been added to the serving bowl, spoon additional sauce over the top and sprinkle with Parmigiano. Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the tomato sauce:</strong> Warm the garlic in the olive oil in a large saucepan over medium heat. Use a wooden spoon to press down on the garlic to release its flavor. Cook for about 2 minutes, or until the garlic begins to sizzle. Don't let it brown. Carefully pour in the tomatoes and their juice (the oil will splatter) and stir to coat with the oil. Season with 1 teaspoon salt and raise the heat to medium-high. Bring the sauce to a simmer, reduce the heat to medium-low, and simmer gently, stirring from time to time, for 30 to 35 minutes, or until the sauce has thickened and the oil is pooling on the surface. Remove from the heat and stir in the basil. Tate and add more salt if you like.</p>"}]}