{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/03000713-243600-SeriousEats-Sunday-Supper-Whiskey-Brisket-HashB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["brisket", "hash", "Sunday Supper", "sweet potatoes", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Whiskey Brisket and Sweet Potato Hash", "link": "https://www.seriouseats.com/recipes/2013/03/whiskey-brisket-sweet-potato-hash-recipe.html", "description": "Whiskey-braised brisket and sweet potato hash is a comforting weekend supper, especially when served with a gently poached or lightly fried egg.", "totalTime": "About a day", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Mains", "Sunday Supper", "Sweet Potatoes and Yams"], "recipeIngredient": ["2 pound piece beef brisket, trimmed of fat", "1/4 cup whiskey", "2 medium cloves garlic", "2 medium white onions, chopped (about 2 cups), divided", "Kosher salt and freshly ground black pepper", "3 1/2 tablespoons olive oil, divided", "2 carrots, peeled and roughly chopped", "2 bay leaves", "3 sprigs thyme", "2 cups homemade or store-bought low sodium chicken broth, or homemade beef broth (do not use storebought beef broth)", "3 medium sweet potatoes, mostly peeled and cut into French fry-style matchsticks", "1 red or yellow bell pepper, finely chopped (about 1 cup)", "2 Serrano peppers, minced (about 1/4 cup)", "1 tablespoon maple syrup", "2 tablespoons Worcestershire sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place brisket in a resealable plastic bag or container. Add whiskey, garlic, half of onion, and a generous pinch of salt and pepper. Close tightly, squeezing out as much air as possible, and shake to combine and refrigerate overnight, turning once or twice during process.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower-middle positions. Preheat oven to 300&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove brisket from marinade and pat dry with paper towels, reserving marinade for later. Heat 1 tablespoon oil in a Dutch oven or large, oven-safe, lidded roasting dish over medium-high heat. Season meat with a sprinkle of salt and pepper. When oil is shimmering, brown meat on both sides, about 6 minutes total. Add reserved marinade along with carrots, bay leaves, thyme, and stock. Bring to a boil, cover, and transfer to lower oven rack. Cook until tender, about 2 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, spray a large baking tray with cooking spray and place sweet potatoes on the tray. Season with salt and pepper, drizzle with 1 tablespoon olive oil and toss to combine. Arrange in a single layer on baking sheet. Place sweet potatoes on upper rack in oven and cook until just tender, about 45 minutes. Remove from oven, chop into small cubes and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When brisket is tender remove from oven and allow to cool. Remove meat from pan and chop into small pieces. Strain sauce, separate fat and discard solids but reserve sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 1 1/2 tablespoons olive oil in a large frying pan over medium-high heat. When oil is hot, add sweet potatoes in a single layer and cook without moving until well browned, 4 to 5 minutes. Add remaining onion, bell pepper and Serrano peppers. Stir to combine and cook, stirring occasionally, until vegetables begin to soften, 4 to 5 minutes longer. Add reserved brisket, maple syrup, Worcestershire sauce, and strained pan sauce. Continue cooking, tossing occasionally, until vegetables are tender, meat and potatoes are nicely browned, and flavors have melded. about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season to taste with more salt and pepper if necessary. Serve immediately with eggs, or reserve and reheat later.</p>"}]}