{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130220-pasta-snap-peas-lemon-garlic-black-pepper4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["pasta", "quick", "snap peas", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pasta With Snap Peas, Garlic, Lemon Zest, and Black Pepper (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/02/pasta-with-snap-peas-garlic-lemon-zest-black-pepper-recipe.html", "description": "A quick and easy vegan pasta dish with snap peas flavored with garlic and black pepper. A touch of cornstarch helps the sauce to emulsify into a pasta-coating texture.", "totalTime": "20 minutes", "recipeYield": "serves 2 to 3", "recipeCategory": ["Dairy-Free", "Legumes", "Mains", "Pasta", "Vegan", "Vegetarian"], "recipeIngredient": ["1 pound snap peas, trimmed", "Kosher salt", "1/2 teaspoon corn starch", "1/2 pound ridged pasta such as cavatappi, penne rigate, or ziti", "1/4 cup extra virgin olive oil", "4 cloves garlic, finely sliced", "Pinch red pepper flakes", "Freshly ground black pepper", "1 tablespoon juice and 1 teaspoon zest from 1 lemon", "2 tablespoons minced fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large saucepan of salted water to a boil. Add snap peas and cook until bright green but still crunchy, about 2 minutes. Strain and run under cool water until chilled. Drain and transfer to a small bowl. Toss with corn starch and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pasta in now-empty saucepan and cover with water by 1 inch. Season to taste with salt. Place over high heat and bring to a boil, stirring occasionally. Continue to cook until pasta is barely al dente (follow package instructions for timing). Drain pasta, reserving 1/2 cup of cooking liquid. Add cooking liquid to bowl with snap peas, stirring to ensure cornstarch is dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Empty saucepan and wipe out with paper towels to dry. Add oil and garlic. Cook over medium high heat, stirring frequently, until garlic starts to take on hints of color around the edges, about 2 minutes. Add pepper flakes and a few good grinds of black pepper followed by snap peas. Bring to a boil, then add drained pasta, lemon juice, and parsley leaves. Toss to combine, Continue cooking, stirring constantly, until sauce is reduced to desired consistency (about 1 minute), season to taste with more salt and pepper if desired, and serve, topping each serving with lemon zest.</p>"}]}