{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131026-thanksgivakkuh-cranberry-latke-turkey-stuffing-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Kosher", "keywords": ["gravy", "hanukkah", "latke", "snack", "stuffing", "thanksgiving", "Thanksgivukkah", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Latke-Crusted Turkey Stuffing Fritters With Liquid Cranberry Core and Schmaltz Gravy", "link": "https://www.seriouseats.com/recipes/2013/11/food-lab-latke-crusted-turkey-stuffing-fritters-liquid-cranberry-center-schmaltz-gravy-thanksgiving-hanukkah-thanksgivukkah-recipe.html", "description": "A mashup of traditional Thanksgiving and Hanukkah flavors in honor of the once-in-a-lifetime convergence of the two holidays. These deep fried balls of stuffing have a crisp potato and onion coating and a liquid cranberry core, served with turkey schmaltz gravy.", "totalTime": "3 hours", "recipeYield": "Makes about 12 stuffing fritters", "recipeCategory": ["Kosher", "Snacks", "Thanksgiving", "The Food Lab", "Turkey"], "recipeIngredient": ["6 ounces fresh cranberries", "1/2 cup sugar", "1/2 cup water", "1 quart <a href=\"http://www.seriouseats.com/recipes/2010/11/classic-sage-and-sausage-stuffing-or-dressing-recipe.html\">Classic Sage and Sausage Stuffing</a>, made with turkey sausage if desired", "3 eggs, divided", "2 large yukon gold potatoes", "1 medium yellow onion", "1/2 cup flour, plus more as necessary", "1/4 cup finely sliced chives, divided", "Kosher salt and freshly ground black pepper", "1 1/2 quarts peanut or canola oil", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2010/11/dead-simple-turkey-gravy-recipe.html\">Dead Simple Turkey Gravy</a>, preferably made with turkey fat in place of butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cranberries, sugar, and water in a small saucepan and bring to a simmer over medium-high heat. Cook, stirring occasionally and breaking up cranberries with a wooden spoon or spatula until cranberries have all popped, about 10 minutes. Strain mixture through a fine mesh strainer. Fill 24 cavities in a <a href=\"http://www.amazon.com/gp/product/B004M6M6OG/?tag=serieats-20\">.3-ounce half sphere silicone mold</a> with cranberry mixture. Refrigerate until set, then remove half of the hemispheres and place them on top of the other half to create full spheres. Press gently on each one to stick two halves together. Cover with plastic and transfer to freezer until frozen.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine stuffing with 1 egg and fold with hands until combined. Fill 12 wells in a <a href=\"http://www.amazon.com/gp/product/B004GJ9ARU/?tag=serieats-20\">1.5 ounce half sphere silicone mold</a> with stuffing mixture, then press a frozen cranberry sphere into the center of each one. Top with more stuffing mixture, sculpting it to create as perfect a sphere as possible and ensuring that the cranberry sphere does not show. Transfer to freezer until completely frozen, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel potato and grate using the grating attachment of a food processor or the large holes of a box grater. Transfer to a large bowl. Grate onion and add to potatoes. Add remaining two eggs, flour, 3 tablespoons chives, 2 teaspoons salt, and a generous grind of black pepper. Mix with hands, adding more flour as necessary until mixture holds together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil to 400°F in a large wok or Dutch oven. Adjust flame to maintain temperature. Preheat oven to 300°F. Working one at a time, remove a stuffing ball from the silicone mold and transfer to potato mixture. Use your hands to carefully mold a thin layer of potato mixture around the ball, then gently lower into hot oil. Repeat until you have four balls in the oil. Oil temperature will drop to about 300°F. Increase heat and adjust the flame to maintain a temperature of 325°F for the duration of the cooking time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry balls, agitating oil and turning occasionally until deep golden brown and hot throughout (use a cake tester or thermometer to test internal temperature), about 8 minutes. Transfer to a paper towel-lined bowl using a slotted spatula, season with salt, and transfer to a wire rack set in a rimmed baking sheet. Hold in oven while you fry the remaining balls in 2 more batches, reheating oil to 400°F before adding each new batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all balls are fried, season with salt in a large bowl, toss with remaining chives, and serve with hot gravy.</p>"}]}