{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/032213-244678-cook-the-book-potato-linguine-conch.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["bread crumsb", "conch", "Cook the Book", "potato linguine", "richard blais", "try this at home", "white wine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Richard Blais's Potato \"Linguine\" with Conch and White Wine", "link": "https://www.seriouseats.com/recipes/2013/03/richard-blaiss-potato-linguine-with-conch-and.html", "description": "Blais has a number of what he calls \"impastas\" in the book--most are in the \"<em>I-wouldn't-mistake-this-for-pasta-any-day</em>\" camp. However, the potato \"linguine\" stands out. He first made the dish on <a href=\"http://www.bravotv.com/top-chef/season-8/episode-14-island-sun\">Top Chef Masters</a> (those viewers among us will probably remember the chef-testants doing their best to look cool cooking in bathing suits) and appeared to fool the judges into thinking that the potatoes were indeed freshly made pasta. Indeed, russet potatoes make ideal pasta substitutes, as they are mild in flavor and high in starch. Mingled with chopped conch (or clams), parsley, oregano, and bread crumbs, this \"linguine\" is more than just a substitute for pasta.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Mains", "Other Seafood", "Pasta"], "recipeIngredient": ["3 large russet (baking) potatoes, peeled", "1 1/2 cups chicken stock or store-bought low-sodium broth", "2 tablespoons unsalted butter", "1 pound fresh conch, minced, or 1 1/2 cups chopped shucked cherrystone or whole small white clams", "1 tablespoon chopped fresh oregano", "1/2 teaspoon finely minced jarred brined Calabrian chiles or red pepper flakes", "Kosher salt and freshly ground black pepper to taste", "1/4 cup dry white wine", "3 tablespoons chopped fresh flat-leaf parsley", "Grated zest and juice of 1/2 lemon", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2013/03/richard-blaiss-toasted-herb-bread-crumbs.html\">Toasted Herb Bread Crumbs</a>, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a Japanese mandoline or a very sharp long knife, cut the potatoes lengthwise into long, thin sheets (as thin as possible—ideally, you should be able to see through them). Stack the slices a few at a time and cut them lengthwise into 1/4-inch-wide ribbons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the chicken stock into a large skillet and bring to a simmer over medium-high heat. Add the potatoes and butter and cook until the potatoes begin to absorb the stock, about 4 minutes. Add the conch, oregano, and chiles and cook until the potatoes are al dente and most of the stock is absorbed, about 5 minutes. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the wine and toss the potatoes gently until it evaporates. Stir in the parsley.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the “linguine” among four warmed shallow bowls. Squeeze some lemon juice over each bowl and top with a sprinkling of bread crumbs. Serve immediately.</p>"}]}