{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130403-246999-chocolate-hazlenut-torte.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["cake", "chocolate", "hazelnut", "let them eat", "Torte"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Chocolate Hazelnut Torte", "link": "https://www.seriouseats.com/recipes/2013/04/chocolate-hazelnut-torte-cake-recipe.html", "description": "This torte is a classically dense, rich dessert. Hazelnuts rounds out this cake with a wonderfully toasty flavor, while a healthy dose of vanilla provides a gently sweet aroma to balance out all that dark chocolate.", "totalTime": "1 hour", "recipeYield": "Serves 8", "recipeCategory": ["Cakes", "Chocolate", "Let Them Eat...", "Nuts"], "recipeIngredient": ["6 ounces of dark chocolate (65-70%), chopped", "5 ounces of whole hazelnuts (1 heaping cup)", "1/2 cup (1 stick) butter, at room temperature", "1/2 cup plus  2 tablespoons sugar", "4 large eggs, at room temperature", "1 1/2 teaspoon vanilla", "1/4 cup flour", "3/4 teaspoon salt", "1/2 teaspoon cinnamon ", "Powdered sugar for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the oven rack to the middle of your oven, and preheat to 400°F. Grease an <a href=\"http://www.amazon.com/gp/product/B0012Q5QQY/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B0012Q5QQY&linkCode=as2&tag=httpwwwwasabi-20\">8-inch round cheesecake pan</a> with butter and set aside. (An 8-inch springform pan will work just fine as well.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the chocolate over a double boiler. Start by setting a small pot of water to boil on the stove. Once the water is boiling, reduce the heat to low and set a heatproof bowl into the pot so that it rests on top and does not fall in. Add the chocolate to the bowl and stir constantly until completely melted. Remove the chocolate from the heat and allow to cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the nuts evenly on a rimmed baking sheet. When the oven is at temperature slide the baking sheet into the oven. Roast nuts until they are golden brown, about 6 minutes. Remove nuts from oven and allow to cool completely. <strong>Lower oven temperature to 350°F.</strong><br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a dry, rough washcloth, rub the nuts together to remove most of the skins. Transfer the nuts to the bowl of a food processor and pulse until they form a semi-fine powder, about the texture of coarse sand, 10 to 12 short pulses. Do not over chop, or you'll end up with an oily, separated mess. Set aside ground nuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, beat butter and sugar on medium speed until fluffy, about 2 minutes. Add eggs and vanilla, beating until mixed. Add flour, salt, and cinnamon, beating for another 30 seconds. Pour in the ground hazelnuts and scoop in chocolate, beating until well mixed, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the greased pan and bake until a toothpick inserted in the middle of the cake comes out with just a few streaks of matte-looking chocolate, about 30 minutes. The middle may still look a little underdone, which is fine as long as the toothpick isn't covered with what looks like wet chocolate batter. Once done, remove the cake from the oven and allow to cool in the pan on a cooling rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cake is cool, carefully remove the sides of the pan. Invert the cake onto a serving platter and remove the parchment circle. Let sit for 20 minutes before dusting liberally with powered sugar for garnish. Serve immediately or seal in plastic before storing in the refrigerator.</p>"}]}