{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130510-turkish-baked-stuffed-eggplant.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["eggplant", "turkish", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Fainting Imam (Turkish Baked Stuffed Eggplant)", "link": "https://www.seriouseats.com/recipes/2013/05/fainting-imam-turkish-baked-stuffed-eggplant-recipe.html", "description": "The intoxicating aromas of this Turkish dish of baked stuffed eggplant supposedly caused the Muslim priest for whom it was made to faint.", "totalTime": "2 hours 15 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Christmas", "Eggplant", "Mains", "Vegetarian"], "recipeIngredient": ["6 small to medium eggplants, rinsed", "1/2 cup extra virgin olive oil, divided", "1/2 cup water", "3 medium or 2 large onions, peeled and quartered", "4 garlic cloves, smashed, peels removed", "1-inch knob ginger, peeled and smashed", "1 large handful parsley leaves", "5 plum tomatoes, quartered", "2 teaspoons ground cumin", "1 teaspoon ground coriander", "Kosher salt", "1/2 cup plain yogurt", "3 tablespoons pomegranate molasses ", "1/4 cup toasted slivered almonds, or use toasted pinenuts ", "1/2 cup mint leaves, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the eggplants: using a sharp vegetable peeler, peel away some of the eggplant skin lengthwise, leaving some stripes of skin. Cut eggplants in half lengthwise, leaving stem intact. Using a tablespoon, scrape out seedy inside of eggplant; reserve. Place eggplants into one very large glass baking dish (divide between two dishes if necessary); pour 1/2 cup water and 1/4 cup olive oil into bottom of dish. Salt eggplants lightly, then cover dish tightly with tin foil and place in oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While eggplant bakes, prepare filling: heat 1/4 cup olive oil in a large Dutch oven over medium-high heat until shimmering. Place onions, garlic, ginger and parsley into bowl of food processor. Pulse until onions are finely chopped. Add mixture to hot pan and stir. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatoes to bowl of food processor and pulse until finely chopped. Add to pan with onions and stir. Finally, add reserved eggplant flesh to bowl of food processor and pulse until finely chopped. Add eggplant to pan and cook vegetable mixture, stirring occasionally, until it has reduced by half, about 10 minutes. Add cumin, coriander and salt to taste and cook, stirring, 2 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Very carefully remove eggplant from oven and remove tin foil. Divide filling between eggplant halves and re-cover with tin foil. Return to oven and bake an additional hour. Remove eggplant from oven, remove tin foil, and bake, uncovered, for 15 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove eggplant from oven and cool to room temperature, about 30 minutes. Place eggplant on a platter and drizzle with yogurt and molasses, then sprinkle with toasted nuts and mint. Serve immediately. </p>"}]}