{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/274700-20131130-sunday-brunch-black-bean-egg-avocado-tostada.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "Mexican", "keywords": ["avocado", "breakfast", "egg", "Mexican"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Black Bean, Avocado, and Egg Tostadas", "link": "https://www.seriouseats.com/recipes/2013/11/black-bean-avocado-egg-tostada-recipe.html", "description": "If you've never had tostadas, then you're in for a treat. That is, if you like things that are crunchy, salty, and topped with eggs and avocados.", "totalTime": "1 hour 30 minutes, plus overnight", "recipeYield": "Serves 4", "recipeCategory": ["Avocado", "Breakfast and Brunch", "Eggs", "Mexican", "Mother's Day", "Vegetarian"], "recipeIngredient": ["<strong>For the Black Beans</strong>:", "1 tablespoon vegetable oil", "1 medium onion, finely chopped (about 1 cup)", "1/2 jalapeño pepper, finely chopped (about 1 tablespoon)", "1 tablespoon chopped fresh cilantro leaves, plus more for garnish", "1/4 teaspoon ground cumin", "1/2 pound dried black bean, soaked overnight", "Kosher salt and freshly ground black pepper", "1 tablespoon juice from about 1 lime", " ", "<strong>For the Tostadas</strong>:", "About 2 cups vegetable, canola, or peanut oil", "8 corn tortillas", "8 eggs", "2 avocados, sliced ", "4 scallions, thinly sliced", "1 lime, cut into wedges", "Hot sauce for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Black Beans</strong>: Heat vegetable oil in a medium saucepan over medium high heat until shimmering. Add onion, jalapeño, cilantro, and cumin. Cook, stirring, until the onions are soft, about 4 minutes. Add the soaked black beans, then add water until the beans are covered by 2 inches and bring to a simmer. Cover and cook, adding water if necessary to keep the beans just covered, until the beans are soft and the liquid has begun to slightly thicken, about 40 minutes. Season to taste with salt, pepper, and lime juice. Beans can be made up to 3 days in advance and reheated before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tostadas</strong>: Heat 1/4 inch of oil in a medium saucepan until shimmering, add a tortilla and cook until golden and puffed, then flip and continue to cook until both sides are golden. Transfer to a paper towel-lined plate and immediately season with salt. Repeat with remaining tortillas. Once cooled, tostadas can be kept in a sealed container for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve divide tostadas between 4 plates, have the beans warm and the avocado and garnishes at hand before you start to fry the eggs. Heat a drizzle of vegetable oil in a large non-stick or cast iron skillet over medium-high heat, when oil just begins to smoke add as many eggs as your pan will allow without overcrowding. Fry the eggs until the whites are set and the yolks are runny. Top as many tostadas as you have fried eggs with beans, then top each one with an egg, followed by sliced avocado, cilantro, and scallions. Serve immediately with sliced lime and hot sauce.</p>"}]}