{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130713-ramen-crusted-chicken-5.jpg", "author": {"@type": "Person", "name": "Luke Davin"}, "recipeCuisine": "", "keywords": ["chicken", "fried chicken", "ramen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ramen-Crusted Fried Chicken", "link": "https://www.seriouseats.com/recipes/2013/08/ramen-fried-chicken.html", "description": "Fried chicken brined in buttermilk, seasoned with ramen flavorings, breaded in crushed ramen, and deep fried.", "totalTime": "4 1/2 hours to overnight", "recipeYield": "Serves 3 to 5", "recipeCategory": ["Deep Frying", "Fried Chicken", "Mains"], "recipeIngredient": ["2 packages of shrimp- or chicken-flavored instant ramen noodles", "8 ounces (about 1 cup) buttermilk", "1 ounce (about 2 tablespoons) soy sauce", "2 pounds chicken thighs with bone (about 6 thighs)", "2 quarts peanut oil", "2 cups shredded cabbage, for serving", "1 lemon, cut into wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly mix contents of one seasoning packet, buttermilk, and soy sauce. Place chicken pieces in zipper-lock bag and add buttermilk mixture. Seal bag, squeezing out as much air as possible. Let chicken rest at least 4 hours and up to overnight.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush two ramen bricks by hand into rough 1/4- to 1/8th-inch pieces. Transfer 3/4 of ramen pieces to a blender and blend until texture resembles coarse meal. Combine the ramen meal and ramen pieces in a wide, shallow dish. Take thighs one at a time from the buttermilk, allowing excess buttermilk to drip off and dredge them heavily in the ramen pieces. Carefully transfer to a wire rack set in a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 300°F. Heat oil in a large Dutch oven or wok to 325°F. Carefully transfer chicken pieces to oil and fry until golden brown on first side, about 3 minutes. Carefully flip and fry on second side until golden brown, about 2 minutes longer. Transfer to a wire rack set in a rimmed baking sheet and transfer to oven. Roast until chicken registers 170ºF on an instant read thermometer, about 10 minutes. Dust finished chicken with remaining seasoning packet. Serve immediately with cabbage and lemon wedges.</p>"}]}