{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20072013-Assorted-Indian-Poppadums.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["Beyond Curry", "bread", "Indian", "poppadom"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pepper Poppadoms", "link": "https://www.seriouseats.com/recipes/2013/07/beyond-curry-pepper-poppadom-recipe.html", "description": "Poppadoms are an Indian staple made from little more than flour, water, and spices. Roasted, toasted, fried, or sun-dried, the thin, flavorful crisps make for a quick, healthy snack or side.", "totalTime": "26 hours", "recipeYield": "Serves 12", "recipeCategory": ["Beyond Curry", "Bread", "Indian", "Sides"], "recipeIngredient": ["1 pound (about 2 1/2 cups) urad daal (black gram flour, see note)", "1/2 teaspoon whole cumin seeds", "1/4 teaspoon baking soda", "1/4 teaspoon asafoetida (see note)", "1 1/2 teaspoon coarsely ground black pepper", "Kosher salt", "1/4 cup water", "1 tablespoon oil divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine black gram flour, cumin seed, baking soda, asafoetida, black pepper, and a large pinch of kosher salt. Add half of water and work into mixture with hands. Gradually add more water until the dough just holds together. Gradually add the oil and knead into a very stiff dough. Cover and set aside for at least two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from bowl and knead with greased hands until it is very pliable, about 5 minutes. Using a tablespoon measure, divide into 12 to 15 small balls. Roll each ball into very thin rounds with a rolling pin on a lightly oiled surface. The rounds should be evenly thin and about 6 inches in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Space the dough rounds on rimmed baking sheets and dry in direct sunlight until totally dry, 24 to 48 hours. Alternatively, dry in the oven at the lowest possible heat for 4 to 6 hours, or in a dehydrator. Store the dry papads in an airtight container for up to 6 months. To serve, heat directly over an open flame or gas grill until lightly toasted. Alternatively, preheat broiler to high and broil until lightly toasted.</p>"}]}