{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/083013-264029-cook-the-book-ultimate-chicken-curry.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Indian", "keywords": ["chicken", "Cook the Book", "curry", "indian food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6", "ratingCount": "5"}, "name": "Ultimate Chicken Curry (Tamatar Murghi) from 'Indian Cooking Unfolded'", "link": "https://www.seriouseats.com/recipes/2013/08/raghavan-iyer-ultimate-chicken-curry-from-indian-cooking-unfolded.html", "description": "Chicken curry is an obvious choice when assembling an Indian menu: it is often fairly simple, the subtle flavors of the poultry take Indian spice well, and it's generally a crowd pleaser. But obvious doesn't have to mean dull or predictable. In fact, chicken curry is a good place to show off carefully layered spices and a rich, voluptuous sauce. <strong><a href=\"http://raghavaniyer.com/\" target=\"_blank\">Raghavan Iyer</a></strong>'s version in <em><a href=\"http://www.amazon.com/Indian-Cooking-Unfolded-Recipes-Ingredients/dp/0761165215/?tag=serieats-20\" target=\"_blank\">Indian Cooking Unfolded</a></em> is just the ticket.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Gluten-Free", "Indian", "Mains"], "recipeIngredient": ["<strong>Raghavan's Blend</strong>", "2 tablespoons coriander seeds", "1 tablespoon cumin seeds", "2 teaspoons black or yellow mustard seeds", "1 teaspoon black peppercorns", "1/2 teaspoon whole cloves", "12 to 15 dried red cayenne chiles (like chiles de arbol), stems discarded", "1 teaspoon ground turmeric", "&nbsp", "<strong>Curry</strong>", "2 tablespoons canola oil", "1 small onion, coarsely chopped", "4 medium-size cloves garlic, coarsely chopped", "4 pieces fresh ginger (each about the size and thickness of a 25-cent coin; no need to peel the skin), coarsely chopped", "2 teaspoons Raghavan’s Blend (above) or store-bought Madras curry powder", "1/2 cup canned diced tomatoes with their juices", "1/2 cup half-and-half", "1 1/2 pounds skinless, boneless chicken breasts, cut into 2-inch cubes", "1 teaspoon coarse kosher or sea salt", "2 tablespoons finely chopped fresh cilantro leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the spice blend:</strong> Place the coriander, cumin, mustard seeds, peppercorns, cloves, and chiles in a spice grinder (you can also use a coffee grinder) and grind them to the consistency of finely ground black pepper. Stir in the turmeric, which will yellow the spice blend with its characteristic sunny bright disposition. Store the spice blend in a tightly sealed container, away from excess light, heat, and humidity, for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the curry:</strong> Heat the oil in a large skillet over medium-high heat. Once the oil appears to shimmer, add the onion, garlic, and ginger and stir-fry until the onion is light caramel brown around the edges, 4 to 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the spice blend into the skillet and stir to mix. Let the spices roast in the onion medley until the aromas dramatically change, 10 seconds. Pour in the tomatoes and stir once or twice. Lower the heat and simmer the chunky sauce, uncovered, stirring occasionally, until the tomato pieces soften, the excess moisture evaporates, and some of the oils in the spices start to dot the edge of the sauce, 5 to 7 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the half-and-half into the skillet and scrape the bottom once or twice to release any bits of onion, garlic, and ginger, effectively deglazing the skillet and releasing those flavors back into the sauce. Transfer the chunky curry to a blender. Holding the lid down, puree the curry until it is slightly curdled looking but smooth, and saffron orange-hued.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the sauce to the skillet and stir in the chicken and salt. Simmer the curry, covered, over medium-low heat, stirring occasionally, until the chicken, when cut with a fork or knife, is cooked through, no longer pinkish-red, and its juices run clear, 12 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the cilantro on top of the chicken curry and serve.</p>"}]}