{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130129-238669-OverstuffedBurrito.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["burrito", "lunch box", "rice", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Make-Ahead Overstuffed Burrito with Mushrooms, Cheddar and Tomato Rice", "link": "https://www.seriouseats.com/recipes/2013/02/overstuffed-burrito-mushrooms-cheddar-tomato-rice-recipe.html", "description": "A make-ahead vegetarian burrito that only gets better the second day. Wrap and go, and then microwave at work for a hot, cheesy roll-up that doesn't require a giant stack of paper napkins at your desk.", "totalTime": "40 minutes", "recipeYield": "serves 2", "recipeCategory": ["Lunch Box", "Mains", "Rice", "Vegetarian"], "recipeIngredient": ["1 medium yellow onion, halved and sliced into 1/4-inch-thick half-moons", "1 large green bell pepper, halved, seeded, cut into strips", "4 1/2 teaspoons extra-virgin olive oil", "1/4 teaspoon chili powder", "Kosher salt and freshly ground black pepper", "1/2 cup basmati rice", "About 1 cup tomato juice, preferably from canned San Marzano tomatoes", "1 tablespoon unsalted butter", "10 ounces baby bella or cremini mushrooms, sliced 1/4-inch thick", "1/2 cup shredded Cheddar cheese", "2 large or 4 small flour tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450 degrees F. Toss onions and peppers with 3 teaspoons oil, chili powder, 1/2 teaspoon salt and 1/4 teaspoon black pepper until well coated. Lay in single layer on parchment-lined baking sheet. Roast until onions are charred in spots and peppers are tender and beginning to brown, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook rice according to package instructions with tomato juice (instead of water or stock) and butter. Meanwhile, heat 1 teaspoon oil in large skillet over high heat until shimmering. Add mushrooms. Sprinkle with 1/4 teaspoon each salt and black pepper. Cook without moving until well-browned, about 2 minutes. Reduce heat to medium-high and cook, stirring, until mushrooms release juices and brown. Add remaining 1/2 teaspoon oil if needed. Turn heat down slightly and cook, stirring occasionally, until thoroughly browned and lightly crisped, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let vegetables and rice cool, then toss together in a large bowl. Sprinkle 2 tablespoons Cheddar onto each tortilla; divide rice and vegetable mixture between them on top of cheese. Sprinkle 2 more tablespoons Cheddar into each tortilla over vegetables. Fold in sides of tortillas and tightly wrap. Store in refrigerator until ready to eat. To reheat, cover with lightly damp paper towel and microwave about 1 minute 30 seconds to heat through and melt cheese, flipping halfway through. Let sit 1 minute before cutting. </p>"}]}