{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131004-sous-vide-101-egg-chorizo-corn-crouton-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6", "ratingCount": "5"}, "name": "Sous Vide Soft Poached Eggs", "link": "https://www.seriouseats.com/recipes/2013/10/sous-vide-soft-poached-eggs.html", "description": "Get foolproof eggs with liquid yolks, tender whites, and a perfect shape every time.", "totalTime": "50 minutes", "recipeYield": "Makes 1 to 12 eggs", "recipeCategory": ["Eggs", "Sous Vide", "The Food Lab"], "recipeIngredient": ["1 to 12 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust sous-vide cooker to 143°F. Alternatively, fill a large beer cooler with hot water and use a kettle of boiling water to adjust heat to 146°F. Add eggs to sous-vide cooker or to cooler (cover if using cooler) and cook for 45 minutes. Remove from cooler and allow to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium pot of water to a bare simmer, then lower heat until bubbles cease entirely. Working on egg at a time, carefully crack the egg near the fat end and use your fingertips to peel off an area about 1 1/2 inches square. Invert egg over a small bowl. It should slip out of the shell easily. Repeat with remaining eggs, using a separate small bowl for each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a perforated spoon, carefully pick up eggs one at a time and dump out excess loose whites from bowls. Return eggs to bowls. Once all eggs are drained, carefully slip the eggs into the pot, swirling the water occasionally to prevent eggs from sticking to bottom. Cook until outer whites are just set, about 1 minute. Retrieve eggs with the perforated spoon and serve immediately. Alternatively, eggs can be stored in cold water in the refrigerator for up to 3 days. To reheat, place eggs in a bowl of hot water for a few minutes until warm.</p>"}]}