{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131212-fruitcake-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["holiday dessert", "ice cream", "panettone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Leftover Panettone Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/12/leftover-panettone-ice-cream.html", "description": "If you have some panettone turning stale and want something different than French toast, consider making it into ice cream.", "totalTime": "2 1/2 hours, plus five to six hours or an overnight chilling time", "recipeYield": "makes 1 pint", "recipeCategory": ["Ice Cream and Frozen Treats", "Scooped"], "recipeIngredient": ["8 ounces panetonne (about 5 cups), diced into 1-inch cubes", "2 2/3 cup heavy cream", "1 1/3 cup whole milk", "4 egg yolks", "1/4 cup plus 2 tablespoons sugar", "1/4 to 1/2 teaspoon kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 250&deg;F and arrange panettone chunks on a half-sheet pan in a single layer. Toast until chunks turn golden brown, 10 to 20 minutes. (Keep your eyes on them.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan over medium heat, bring cream and milk to a simmer. Stir in toasted panettone chunks, cover, and let steep for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour bread and dairy mixture through a fine mesh strainer, pressing on bread with a wooden spoon or spatula to squeeze out as much liquid as possible. Measure out 2 cups of panettone-infused dairy and reserve the rest for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean, heavy-bottomed saucepan, whisk egg yolks together with sugar until very well combined, pale yellow in color, and slightly thick. Slowly pour in panettone-infused dairy, whisking constantly, then bring saucepan over medium heat. Cook, stirring frequently, until a custard forms on the back of a spoon and a finger swiped across the back leaves a clean line, or until custard reaches 160&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour custard through a fine mesh strainer into an airtight container and chill overnight (or until ice cream base falls to 40&deg;F or below). The next day, churn according to manufacturer's instructions. Transfer ice cream to airtight container and chill in freezer for at least 4 to 5 hours before serving.</p>"}]}