{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130513-251751-british-bites-marmite-bacon-chicken-legs.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "chicken", "gravy", "marmite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bacon Wrapped Marmite Chicken Legs", "link": "https://www.seriouseats.com/recipes/2013/05/bacon-wrapped-marmite-chicken-legs-recipe.html", "description": "In our third week of Marmaggedon, we bring you a marmed-up version of the classic roast chicken legs. In this version the legs get wrapped in bacon, and then coated in a mixture of Marmite, chicken stock and brown sugar.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "British Bites", "Chicken", "Mains"], "recipeIngredient": ["1 1/3 cup homemade or store-bought low sodium chicken stock, divided", "3 teaspoons Marmite", "3 teaspoons brown sugar", "4 chicken legs, skin removed", "8 strips bacon", "2 tablespoons butter", "2 tablespoons flour", "reserved drippings", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 375°F. In a saucepan combine 1/3 cup chicken stock, Marmite, and brown sugar and bring to a simmer. Reduce sauce to 1/4 cup, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap each chicken leg with two pieces of bacon and place on a baking sheet. Brush Marmite mixture over chicken and place in the oven. Roast until bacon has rendered and chicken has reached an internal temperature of 160 to 165°F, about 1 hour. Transfer chicken to a cutting board (reserve the juices in the pan), tent with foil, and allow to rest while you make the gravy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken rests, heat butter in a small saucepan over medium high heat until melted. Add the flour and stir until the flour just begins to brown, about 3 minutes. Add the reserved drippings, whisking constantly to get rid of any lumps. Add remaining cup of stock, whisking constantly. Bring to a simmer and cook until lightly thickened, about 5 minutes. Season to tastes with salt and pepper. Serve chicken with gravy and sides as desired.</p>"}]}