{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130330-245686-sunday-brunch-empty-the-fridge-strata.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "egg", "strata", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Empty the Fridge Strata", "link": "https://www.seriouseats.com/recipes/2013/03/sunday-brunch-empty-the-fridge-strata-recipe.html", "description": "Strata is a great vehicle for turning leftover odds and ends into a filling meal for a crowd.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Eggs"], "recipeIngredient": ["1 1/2 cups milk", "5 eggs, beaten", "4 cups day-old bread, cut into 1 inch cubes", "Kosher salt and freshly ground black pepper", " ", "<strong>Possible Additions (add up to 2 cups)</strong>:", "1/2 to 3/4 cups shredded cheese (cheddar, mozzarella, Havarti, etc.)", "1/2 to 1 cup chopped bacon, ham, or hot dogs", "1/2 to 1 cup leftover meat, shredded or chopped (shredded braised beef, chicken, steak, pork chops, etc.)", "1/4 to 1/2 cup pesto or leftover pasta sauce (marinara, alfredo, or Bolognese, etc.)", "2 to 4 tablespoons chopped fresh herbs (parsley, thyme, oregano, chives, etc.)", "1/2 to 1 cup frozen peas, spinach, or corn, thawed and drained", "1/4 to 1 cup onions and/or garlic cooked in butter until just beginning to brown"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl combine milk and eggs and mix until combined. Place bread in the bowl and fold with a spatula until bread is coated, let stand 5 minutes to allow milk and egg mixture to saturate the bread. Fold in any additional ingredients. (If using fresh herbs, reserve 1 tablespoon to sprinkle on top before serving). Season with salt and pepper and transfer to a baking dish. Bake until strata is puffed and edges begin to brown, about 30 minutes. Sprinkle with reserved herbs (if using) and serve immediately.</p>"}]}