{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130429-rhubarb-lime-pavlovas2.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["from the pastry dungeon", "lime", "meringue", "pavlovas", "rhubarb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rhubarb and Lime Pavlovas", "link": "https://www.seriouseats.com/recipes/2013/04/rhubarb-lime-pavlova-recipe.html", "description": "Pavlovas are classically served with sour passion fruit or kiwi to offset the sweetness of meringue. Here, pretty pink rhubarb with tart, buttery lime curd makes an excellent substitution and a colorful spring dessert.", "totalTime": "5 hours", "recipeYield": "Serves 6", "recipeCategory": ["Fruit Desserts", "Lime", "Rhubarb", "Very Small Anna"], "recipeIngredient": ["<strong>For the Pavlovas</strong>:", "3 egg whites, room temperature", "1/4 teaspoon salt", "1/2 teaspoon lime juice from 1 lime", "1/2 teaspoon vanilla extract", "3/4 cup plus 2 tablespoons sugar", " ", "<strong>For the Lime Curd</strong>:", "6 tablespoons (3/4 stick) unsalted butter", "1 cup sugar", "4 teaspoons zest and 2/3 cup lime juice (from about 8 limes)", "4 eggs", "Pinch salt", " ", "<strong>For the Rhubarb</strong>:", "3 medium stalks rhubarb (about 6 1/2 ounces)", "1/2 cup sugar", "1 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pavlovas</strong>: Place a rack in center of oven. Preheat oven to 225°F. In stand mixer fitted with whisk attachment or with hand mixer, whip egg whites with salt, lime juice, and vanilla until foamy, then gradually add sugar. Whip to stiff, glossy peaks, then transfer to piping bag or large ziploc bag with the tip cut off. Line a baking sheet with parchment paper, then pipe meringue into 6 equal mounds about 4 inches across. Bake for 1 hour, turn and continue baking until outside is slightly firm but not browned, 30 to 50 minutes longer. Turn oven off and allow pavlovas to cool to room temperature in oven, at least 40 minutes. Store in an airtight container once cooled for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lime Curd</strong>: Combine butter, sugar, half of zest, juice, eggs, and pinch salt in a medium bowl. Place over simmering water and whisk constantly until very thick, at least 10 minutes. Immediately strain through a fine mesh sieve or chinois and stir in remaining zest. Place plastic wrap over surface of curd, poking a few holes to allow steam to escape, and chill in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Rhubarb</strong>: Place rack in center of oven. Preheat oven to 350&deg;F. Wash rhubarb thoroughly and cut into 3-inch pieces. Place in baking dish. Combine sugar and water in a medium saucepan and bring to boil until sugar is completely dissolved. Immediately pour hot syrup over rhubarb and place in oven. Cook for 10 minutes, then gently stir and continue cooking until rhubarb yields to a fork or skewer but is not broken down, 3 to 5 minutes longer. Remove from oven and allow rhubarb to cool in the syrup. Strain rhubarb out and place syrup in a small saucepan, simmer over medium heat until reduced by half. Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve</strong>: Drizzle plate with rhubarb reduction. Place pavlova in center of plate, top with curd and rhubarb chunks..</p>"}]}