{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131123-274809-malted-hazelnut-meringue-torte.1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["cake", "chocoholic", "chocolate", "gluten free", "hazelnut", "malted chocolate", "meringue", "Torte"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Malted Hazelnut Meringue Torte", "link": "https://www.seriouseats.com/recipes/2013/12/malted-hazelnut-meringue-torte.html", "description": "Crunchy, delicate layers of malted hazelnut meringue form the \"cake\" layers of this decadent dessert. For gluten-free just omit the malt.", "totalTime": "5 hours", "recipeYield": "make one 8-inch cake", "recipeCategory": ["Cakes", "Chocolate", "Gluten-Free", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 1/4 cups (about 7 ounces) blanched hazelnuts, lightly toasted and cooled ", "1 cup (7 ounces) granulated sugar, divided", "4 tablespoons malted milk powder", "4 large egg whites", "1/4 teaspoon cream of tartar", "1/8 teaspoon salt", "16 ounces bittersweet chocolate, finely chopped", "1 cup heavy cream", "8 malted milk balls"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle positions and preheat to 250&deg;F. Trace two 8-inch circles on 2 separate sheets of parchment paper. Flip over (so ink is on bottom) and place on baking sheets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse hazelnuts and 2 tablespoons sugar in food processor until finely ground. Transfer to bowl, toss with malted milk powder, and set aside. Place egg whites and cream of tartar in bowl of standing mixer fitted with whip attachment (see note). Beat on medium high speed to soft peaks. Slowly add remaining sugar and continue to beat until stiff peaks form, 2 to 3 minutes. Beat in salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from mixer and gently fold in hazelnut mixture in 3 batches until just combined (do not overmix). Spoon meringue into large pastry bag fitted with 1/2-inch tip. Starting in the center of each circle, pipe in a spiral motion to form a disc shape meringue, keeping within about 1/2 inch from the border (see note). You should have just enough meringue to complete the 4 discs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven and bake until completely dry, about 2 hours. Store in a cool, dry place until ready to assemble.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat chocolate and cream in heatproof bowl over pan of barely simmering water, stirring gently, until just melted. Set aside (or chill) until just firm enough to spread. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble torte, place a meringue on serving plate, top side up. Spread 1/4 cup ganache onto meringue. Continue to layer meringues and ganache, using remaining ganache to frost top and sides of torte. Garnish with malted milk balls. Chill to set, at least 2 hours. Use a hot, wet knife to cut slices.</p>"}]}