{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/082813-264022-cook-the-book-sweet-corn-with-toasted-coconut.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chili", "coconut", "Cook the Book", "corn", "indian food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet Corn with Toasted Coconut (Thénga Makkaí) from 'Indian Cooking Unfolded'", "link": "https://www.seriouseats.com/recipes/2013/08/cook-the-book-sweet-corn-with-toasted-coconut-from-indian-cooking-unfolded.html", "description": "This toasted coconut and chile spice blend from <strong><a href=\"http://raghavaniyer.com/\" target=\"_blank\">Raghavan Iyer</a></strong>'s new cookbook, <em><a href=\"http://www.amazon.com/Indian-Cooking-Unfolded-Recipes-Ingredients/dp/0761165215/?tag=serieats-20\" target=\"_blank\">Indian Cooking Unfolded</a></em>, is a wonderful way to jazz up a pan of sautéed corn&mdash;the nuttiness of the coconut tones down the sweetness of the kernels, the dried chiles add intensity, and the citrus notes of the coriander seeds brighten the richness of the coconut.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Coconut", "Cook the Book", "Corn", "Gluten-Free", "Sides", "Vegetarian"], "recipeIngredient": ["1 tablespoon coriander seeds ", "2 to 3 dried red cayenne chiles (like chile de árbol), stems discarded", "1/4 cup dried unsweetened coconut shreds", "2 tablespoons canola oil", "1 teaspoon black or yellow mustard seeds", "1 small onion, finely chopped", "4 cups sweet corn kernels (fresh or frozen; if using frozen, no need to defrost)", "1 medium-size tomato, cored and finely chopped (do not remove the seeds)", "1 teaspoon coarse kosher or sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large skillet over medium-high heat. Once the skillet is hot (when you hold the palm of your hand close to the bottom of the skillet you will feel the heat), usually after 2 to 4 minutes, add the coriander seeds and chiles. The seeds will start to crackle a bit and turn reddish brown and the chiles will blacken slightly, after 1 to 2 minutes. Quickly add the coconut and keep stirring constantly as the coconut will start to brown and smell nutty almost instantly and impart a slight oily sheen. Transfer the spicy coconut to a small bowl or plate to cool. Keeping the coconut mixture in the skillet will burn the blend, making it unpalatable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil in the hot skillet. It will instantly appear to shimmer. Add the mustard seeds, cover the skillet, and cook until the seeds have stopped popping (not unlike popcorn), about 30 seconds. Immediately add the onion and stir-fry until light brown, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the corn and 1/2 cup of water. Stir once or twice and cover the skillet. Reduce the heat to medium and let the corn cook gently, stirring occasionally, until it is still juicy sweet when tasted and not overly cooked, 5 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, transfer the cool spiced coconut to a spice grinder (you can also use a coffee grinder) and grind it to the consistency of slightly coarse black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the ground coconut spice blend to the corn along with the tomato and salt. Let it all simmer, uncovered, stirring occasionally, until the tomato is warmed through, about 1 minute. Serve the corn warm.</p>"}]}