{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130221-241100-cook-the-book-zhajiang-noodles.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "Cook the Book", "Fuchsia Dunlop", "noodle", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fuchsia Dunlop's Zhajiang Noodles (Zha Jiang Mian)", "link": "https://www.seriouseats.com/recipes/2013/02/fuchsia-dunlops-zhajiang-noodles-zha-jiang-mian-recipe.html", "description": "<a href=\"http://www.fuchsiadunlop.com/\">Fuchsia Dunlop's</a> <strong>Zhajiang Noodles</strong> from her new cookbook <em><a href=\"http://www.amazon.com/Every-Grain-Rice-Chinese-Cooking/dp/0393089045/?tag=serieats-20\">Every Grain of Rice</a></em> feature a thick, savory concoction of ground pork belly and sweet fermented sauce (tianmianjiang)&mdash;almost blindingly salty on its own, but mellowed when tossed with the mild wheat noodles and assorted blanched vegetables.", "totalTime": "45 minutes", "recipeYield": "serves 2", "recipeCategory": ["Chinese", "Cook the Book", "Mains", "Pasta", "Pork"], "recipeIngredient": ["2 tablespoons cooking oil", "1 teaspoon whole Sichuan pepper", "2 star anise", "4 1/4 ounces (125 grams) finely chopped or coarsely ground belly pork", "2 tablespoons finely chopped ginger", "1 tablespoons Shaoxing wine", "5 tablespoons sweet fermented sauce", "Salt, to taste", "7 ounces (200 grams) dried Chinese wheat flour noodles, or 11 ounces (300 grams) fresh noodles", " ", "<strong>To serve, any of the following:</strong>", "Small section of cucumber", "1 celery stick", "1 small carrot", "Some Chinese cabbage", "1 small piece of purple-hearted Chinese radish (xin li mei)", "Good handful of bean sprouts", "Handful of cooked green soy beans or peas", "A few slices of red chilli (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the oil to a seasoned wok over a high flame and swirl it around. Immediately add the Sichuan pepper and star anise and stir-fry for a few moments until they smell delicious. Then remove the spices with a slotted spoon, leaving the fragrant oil in the wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pork and stir-fry until it has become pale, pressing the meat with the back of your ladle or wok scoop to help separate it out into little morsels. Then add the ginger and stir-fry until you can smell it. Add the Shaoxing wine, stir once or twice, then add the sweet fermented sauce. Stir-fry for a few moments more until it smells rich and delicious, then cover the pork generously with water. Bring to a boil, then simmer over a low heat for about 15 minutes, until the sauce is dark and luxuriantly thick. Season with a scattering of salt (the sauce should be intensely-flavored and seem on its own a little over-salted, because it will be used to flavor the bland noodles).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you wish to eat, bring a pan of water to a boil. Cut whichever you are using of the cucumber, celery, carrot, cabbage, and radish into fine slivers. Blanch the beansprouts and all the vegetables except for the cucumber in the boiling water; they should remain a bit crisp. (It is best to blanch each vegetable separately, using a slotted spoon to remove them from the water.) Refresh the blanched vegetables immediately under a cold tap and drain well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat the pork sauce. Cook the noodles, rinse briefly under the tap, shake dry, then divide between two serving bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add some of each of your vegetables to the bowls. Top with the pork sauce. Stir everything together with chopsticks before eating, scattering with chilli slices, if you like.</p>"}]}