{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20130816-bison-council-pot-roast-beer-braise-onion-16.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beer", "bison", "Bison Council", "braise", "chuck", "pot roast", "stew", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Beer-Braised Bison Pot Roast", "link": "https://www.seriouseats.com/recipes/2013/11/beer-braised-bison-pot-roast.html", "description": "Beer-braised bison chuck roast in a rich sauce.", "totalTime": "1 day", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Beef", "Braising and Stewing", "Mains", "Soups and Stews"], "recipeIngredient": ["1 rolled bison chuck roast, 5 to 6 pounds", "Kosher salt and freshly ground black pepper", "2 tablespoons canola oil", "2 medium onions, finely sliced (about 2 cups)", "1 medium carrot, finely diced (about 1/2 cup)", "2 stalks celery, finely diced (about 1/2 cup)", "4 anchovy filets, minced", "4 medium cloves garlic, minced (about 4 teaspoons)", "1 tablespoons chopped fresh rosemary leaves", "2 teaspoons chopped fresh thyme leaves", "1/4 cup tomato paste", "2 tablespoons soy sauce", "1 tablespoon Asian fish sauce", "12 ounces dark lager", "3 cups homemade or store-bought low sodium chicken stock", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 275°F. Season bison chuck generously with salt and pepper on all sides. Heat oil in a large Dutch oven over high heat until lightly smoking. Add bison and cook without moving until well-browned, about 8 minutes. Flip and continue cooking until well browned on all sides, about 20 minutes total. Transfer to a large plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions, celery, and carrots and cook, stirring frequently, until vegetables are softened and beginning to brown, about 10 minutes. Add anchovies, garlic, rosemary, thyme, and tomato paste and cook, stirring, until fragrant, about 1 minute. Add soy sauce, fish sauce, and beer. Use a wooden spoon to scrape up browned bits from bottom of pan. Bring to a boil and cook until reduced by half, about 5 minutes. Add chicken stock and bay leaves, then nestle meat into pot. Bring to a boil, then cover pot leaving lid slightly ajar. Transfer to oven and cook until a fork or paring knife can be inserted into meat with no resistance, about 4 hours, flipping meat once during cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pot from oven, transfer to stovetop, and let cool for 2 hours. Transfer to refrigerator and let cool overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove meat from pot and transfer to cutting board. Discard bay leaves and any hardened fat from top of liquid. Bring liquid to a boil, reduce to a bare simmer, and cook until reduced to a saucy glaze, about 15 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, slice meat into 1/2-inch thick slices. Transfer to a large skillet and fan out to arrange. Pour hot juices over top of meat, cover, and cook over low heat until meat is heated through. Garnish with extra rosemary and thyme, and serve.</p>"}]}