{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131026-turkey-ramen-15.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "Japanese", "noodle", "ramen", "soup", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Turkey Paitan Ramen With Crispy Turkey and Soft-Cooked Egg", "link": "https://www.seriouseats.com/recipes/2013/11/turkey-paitain-ramen-crispy-turkey-soft-cooked-egg-recipe.html", "description": "A rich and creamy turkey broth flavored with miso and sesame with crispy braised turkey meat, a soft boiled egg, and Brussels sprouts leaves.", "totalTime": "9 hours", "recipeYield": "Makes about 3 quarts broth, serving 6 to 8", "recipeCategory": ["Chicken", "Japanese", "Mains", "Ramen", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["3 pounds turkey backs and wings or leftover roasted turkey bones and carcass, roughly chopped with a cleaver or a heavy duty chef's knife", "2 pounds turkey drumsticks and/or thighs", "3 tablespoons vegetable oil, divided", "1 large onion, skin on, roughly chopped", "16 garlic cloves, divided", "One 3-inch knob ginger, roughly chopped", "2 whole leeks, washed and roughly chopped", "2 dozen scallions, white parts only (reserve greens and light green parts for garnishing finished soup)", "6 ounces whole mushrooms or mushroom scraps", "1/2 cup red or white miso paste", "1/4 cup sesame tahini", "12 Brussels sprouts, divided into individual leaves", "Kosher salt", "6 to 8 servings ramen-style noodles, store-bought or <a href=\"https://www.seriouseats.com/recipes/2018/11/homemade-ramen-noodles.html\">homemade</a>", "6 to 8 <a href=\"http://www.seriouseats.com/recipes/2012/03/ajitsuke-tamago-japanese-marinated-soft-boiled-egg-recipe.html\">marinated eggs</a>, or <a href=\"http://www.seriouseats.com/recipes/2013/10/sous-vide-soft-boiled-eggs.html\">sous-vide soft boiled eggs</a>", "2 to 3 tablespoons <a href=\"http://www.seriouseats.com/recipes/2013/09/mayu-black-garlic-oil-for-ramen-recipe.html\">mayu</a> (black garlic oil) or toasted sesame oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place turkey bones and drumsticks or thighs in a large stockpot and cover with cold water. Place on a burner over high heat and bring to a boil. Remove from heat as soon as boil is reached.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pot is heating, heat 2 tablespoons vegetable oil in a medium cast iron or non-stick skillet over high heat until lightly smoking. Add onions, 12 cloves garlic, and ginger. Cook, tossing occasionally until deeply charred on most sides, about 15 minutes total. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once pot has come to a boil, dump water down the drain. Carefully wash all bones and meat under cold running water, removing any bits of dark marrow or coagulated blood. Bones should be uniform grey/white after you've scrubbed them. Meat should be lightly rinsed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return turkey to pot along with charred vegetables, leeks, scallion whites, and mushrooms. Top up with cold water. Bring to a rolling boil over high heat, skimming off any scum that appears (this should stop appearing within the first 20 minutes or so). Use a clean sponge or moist paper towels to wipe and black or gray scum off from around the rim of the pot. Reduce heat to a bare simmer and place a heavy lid on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the lid is on, check the pot after 15 minutes. It should be at a slow rolling boil. If not, increase or decrease heat slightly to adjust boiling speed. Boil broth until turkey legs/drumsticks ares completely tender, about 3 hours. Carefully remove turkey legs/drumsticks with a slotted spatula. Transfer to a sealed container and refrigerate until step 7. Return lid to pot and continue cooking until broth is opaque with the texture of light cream, about 3 to 5 hours longer, topping off as necessary to keep bones submerged at all times. If you must leave the pot unattended for an extended period of time, top up the pot and reduce the heat to the lowest setting while you are gone. Return to a boil when you come back and continue cooking, topping up with more water as necessary.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once broth is ready, cook over high heat until reduced to around 3 quarts. Strain through a fine mesh strainer into a clean pot. Discard solids. For an even cleaner soup, strain again through a chinois or a fine mesh strainer lined with several layers of cheese cloth. Skim liquid fat from top with a ladle and discard. Return to a medium pot on the stovetop and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk miso paste and tahini into broth. Grate garlic cloves and whisk into broth. Season to taste with salt and/or soy sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick turkey meat from turkey legs and finely shred by hand. Place in a cast iron or non-stick skillet and heat over medium-high heat. Cook, flipping and breaking up the meat occasionally, until crusty and browned all over. Season to taste with salt and transfer to a bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablespoon oil in a large skillet over high heat until lightly smoking. Add Brussels sprouts leaves. Season to taste with salt and cook, tossing frequently, until bright green and charred in spots, about 2 minutes. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook ramen noodles according to package directions. Drain and transfer to individual serving bowls. Top with broth, Brussels sprouts leaves, sliced scallion greens, shredded turkey, and an egg. Drizzle with <a href=\"http://www.seriouseats.com/recipes/2013/09/mayu-black-garlic-oil-for-ramen-recipe.html\">mayu</a> or toasted sesame oil. Serve immediately.</p>"}]}