{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130306-243522-doberge-cake-in-progress.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "cake", "chocolate desserts", "layer cake", "lemon meringue pie", "New Orleans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Doberge Cake", "link": "https://www.seriouseats.com/recipes/2013/03/doberge-cake-new-orleans-birthday-cake-lemon-chocolate-layer-cake-recipe.html", "description": "New Orleans may be best known around these parts for beignets and King Cake, but when it comes time to celebrate your birthday in the Big Easy, it's the Doberge Cake (that's pronounced DOUGH-bash for the folks at home), a layered cake with lemon and chocolate that steals the show.", "totalTime": "3 hours", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Cakes", "Chocolate"], "recipeIngredient": ["<strong>For the Cake</strong>:", "11 1/2 ounces (about 2 1/4 cups) all-purpose flour, plus more for flouring pans", "5 tablespoons buttermilk powder", "1 tablespoon baking powder", "3/4 teaspoon salt", "2 sticks (16 tablespoons) unsalted butter, softened ", "11 1/2 ounces (about 1 2/3 cups) sugar", "1 tablespoon grated zest from 1 lemon", "4 whole eggs, room temperature", "2 egg yolks, room temperature", " 1 tablespoon vanilla extract", "10 ounces (1 1/4 cups) water, room temperature", " ", "<strong>For the Lemon Filling</strong>", "5 large egg yolks", "9 ounces (about 1 1/4) cups sugar", "2 ounces (about 1/3 cup) cornstarch", "2.5 ounces (about 1/3 cup) cold water", "12 ounces (1 1/2 cup) very hot water", "2 tablespoons unsalted butter, melted", "1/2 cup fresh juice plus 1 tablespoon grated zest from 4 lemons", "2 teaspoons vanilla extract", " ", "<strong>For the Chocolate Pudding Filling</strong>:", "2 tablespoons cornstarch", "2 tablespoons sugar", "1 1/2 tablespoons unsweetened cocoa powder", "1/4 teaspoon salt", "1 1/2 cups (about 12 ounces) whole milk", "2 ounces 70% cacao chocolate, melted in a double boiler or microwave-safe bowl", "1 teaspoon vanilla extract", " ", "<strong>For the Lemon Frosting</strong>:", "10 tablespoons (1 1/4 sticks) unsalted butter", "9 ounces (about 11/2 cups) confectioner's sugar", "2 teaspoons vanilla extract", "1 tablespoon zest from 1 lemon", " ", "<strong>For the Chocolate Frosting</strong>:", "8 tablespoons (1 stick) unsalted butter", "6 ounces (about 1 cup) confectioner’s sugar", "4 ounces 72% cacao chocolate, melted in a double boiler or microwave-safe bowl"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake</strong>: Set oven rack to middle position and preheat oven to 350°F. Grease and flour three  8-inch round cake pans and set aside. In a medium bowl whisk together flour, buttermilk powder, baking powder, and salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of a stand mixer fitted with a paddle attachment, cream butter, sugar and zest together on high speed until light and fluffy (about 3 minutes). Reduce mixer speed to medium and add eggs and yolks, one at a time, mixing well between each addition until incorporated and scraping down sides with a rubber spatula as needed. Once eggs have been added, mix in vanilla. Alternate adding dry ingredients and water a third at a time on low speed, mixing until just incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter equally among 3 cake pans and bake until golden brown and springy to the touch and cake tester inserted into center comes out clean, 25-27 minutes, rotating the pans halfway through. Cool cakes in the pan for 15 minutes then carefully release from the pan onto cooling racks to cool completely. Do not assemble cake until it has completely cooled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lemon Filling:</strong> While the cake is baking, prepare your fillings. Whisk together egg yolks in a medium bowl and set aside. In a medium saucepan, mix together the sugar and cornstarch. Add cold water and stir to moisten. Then add hot water, while stirring, and cook over medium-high heat, stirring occasionally. Mixture will begin to turn translucent and thicken. When mixture begins to bubble lightly, remove from heat. Stir in melted butter. Add egg yolks while whisking constantly. Add lemon juice whisking until thoroughly combined. Strain mixture into a clean medium bowl, rinse out your pan then return the mixture to the pan. Whisk in the lemon zest and vanilla. Heat over medium, whisking constantly until mixture thickens to the consistency of pudding. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and transfer to a medium bowl. Set bowl over an ice bath and whisk continuously to cool to room temperature (about 10 to 15 minutes). Cover and refrigerate until you're ready to assemble the cake. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Filling:</strong> In a small saucepan whisk together cornstarch, cocoa powder, sugar, and salt. Slowly whisk in the milk. Bring to a light boil over medium heat while whisking constantly. Once pudding has thickened to desired consistency (usually a couple more minutes) remove from heat and pour immediately into a medium bowl. Quickly whisk in chocolate and vanilla.  Set bowl over an ice bath and whisk continuously to cool to room temperature (about 10 to 15 minutes). Place a piece of waxed paper or plastic wrap on top of the pudding to prevent pudding skin from forming. Refrigerate until you're ready to assemble the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lemon Frosting:</strong> In the bowl of an electric stand mixer fitted with a paddle attachment, beat butter and sugar on medium speed until well combined, scraping down the sides as necessary. Add zest and vanilla beating until thoroughly combined. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Frosting:</strong> In the bowl of an electric stand mixer beat butter and sugar on medium speed until well combined, scraping down the sides as necessary. Then add melted chocolate beating until thoroughly combined. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Cake:</strong> Using a sharp knife, carefully split the cooled cake layers so that you have six layers.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place your first layer on your desired serving platter. Spread lemon filling to cover half of the layer and chocolate pudding on the other half coming just shy of the edge. Place the next layer of cake on top and repeat, matching up the chocolate and lemon layers as you go. When you finish you will have five layers of filling and the top layer will be cake. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If necessary use a knife to scrape off any excess filling that might have leaked out of the cake then frost the chocolate side generously with chocolate frosting and the lemon side with lemon frosting. </p>"}]}