{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/2013_1_28_237769_preserved_cara_cara_marmalade_primary.jpg", "author": {"@type": "Person", "name": "Lucy Baker"}, "recipeCuisine": "", "keywords": ["cara cara orange", "Jam", "Marmalade", "orange", "Preserved"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cara Cara Orange Marmalade", "link": "https://www.seriouseats.com/recipes/2013/02/cara-cara-orange-marmalade-recipe.html", "description": "This Cara Cara orange marmalade is all about comfort. Tangy chunks of peel, a whiff of honey, and a hint of spice from my secret ingredient, herbal tea, offset the sweet flesh of the oranges. I used Twinnings Hebal Unwind, but feel free to substitute whatever you have on hand. Try it on English muffins or crumpets.", "totalTime": "2 hours", "recipeYield": "makes 7 (8-ounce) jars", "recipeCategory": ["Condiments and Sauces", "Orange", "Preserved"], "recipeIngredient": ["2 bags Twinnings Herbal Unwind tea, or other herbal spice tea", "2 1/4 cups boiling water", "4 cups granulated sugar", "4 large Cara Cara oranges ", "4 tablespoons plus 1 teaspoon regular powdered fruit pectin", "1/4 teaspoon unsalted butter", "1 cup honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the tea bags into a small bowl and cover with the boiling water. Steep for 10 minutes, then remove and discard the tea bags. Measure the sugar into a medium bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash the oranges and remove the rind in quarters. Set the flesh aside. Scrape away as much of the white pith from the rinds as possible. Thinly slice the rinds lengthwise, then coarsely chop the crosswise into smaller pieces. Transfer the rind to a large pot and add the tea. Bring to a boil over medium heat, cover and simmer until the rinds have softened, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, coarsely chop the orange flesh and transfer it to a food processor. Pulse until the fruit is coarsely pureed, about 8 to 10 pulses. Add the orange puree to the pot with the rind and return to a simmer. Simmer, covered, for 15 minutes. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure out exactly 5 cups of the mixture (discard any extra). Return the mixture to the pot and add the pectin and butter. Bring to a boil over high heat, stirring constantly. Add the honey and sugar. Return the mixture to a full rolling boil for one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and skim any foam from the surface of the marmalade with a cold metal spoon. Ladle the marmalade into hot sterilized jars and process them in a hot water bath for 10 minutes.</p>"}]}