{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130830-tompastaslice.jpg", "author": {"@type": "Person", "name": "Deborah Mele"}, "recipeCuisine": "Italian", "keywords": ["cheese", "Italian", "italian easy", "pasta", "ricotta", "summer", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Pasta With Cherry Tomatoes and Herbed Ricotta", "link": "https://www.seriouseats.com/recipes/2013/09/italian-easy-pasta-with-cherry-tomatoes-and-herbed-ricotta.html", "description": "An end-of-summer pasta dish with cherry tomatoes and a dollop of creamy, herbed ricotta cheese.", "totalTime": "20 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cheese", "Italian", "Mains", "Pasta", "Tomato", "Vegetarian"], "recipeIngredient": ["1 pound dried pasta", "1/4 cup plus 1 tablespoon extra virgin olive oil ", "3 medium cloves garlic, minced (about 1 tablespoon)", "1/2 to 1 chili pepper such as Serrano or Thai, finely minced (optional) ", "2 pints very ripe cherry tomatoes, cut in half", "Kosher salt and freshly ground black pepper", "6 tablespoons finely chopped fresh basil leaves, divided", "1 teaspoon balsamic vinegar", "1 cup ricotta cheese", "1/4 cup grated Pecorino Romano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large pot of salted water on to boil.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small pot, heat the 1/4 cup of olive oil until lightly smoking over medium heat, then drop in the garlic and chili pepper if using. Cook until fragrant, about 30 seconds to 1 minute. Add the tomatoes, season with salt and pepper, and continue to cook, stirring often, just until the tomatoes begin to soften, about 4 minutes. Remove from the heat, stir in 4 tablespoons of the chopped basil and the balsamic vinegar, then set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, mix together the ricotta cheese, remaining tablespoon of olive oil, 2 tablespoons chopped basil, and the pecorino cheese. Season with salt and pepper and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pasta following manufacturer's direction until it is al dente. Drain, reserving 1/2 cup of pasta water and return the pasta to the pot along with the tomato mixture. Toss to mix well, adding pasta water as necessary to adjust consistency, then serve the pasta in individual bowls topped with a large spoonful of the herbed ricotta cheese on each.<br />\r\n</p>"}]}