{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131022-one-pot-wonders-kale-pumpkin-pasta.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["easy", "fall", "kale", "pasta", "quick", "squash", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Skillet Kale and Pumpkin Pasta", "link": "https://www.seriouseats.com/recipes/2013/10/skillet-kale-pumpkin-pasta-recipe.html", "description": "A quick and easy single skillet meal of pasta served with pumpkin and black kale. Perfect for a Halloween feast!", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Halloween", "Kale", "Mains", "One-Pot Wonders", "Pasta", "Pumpkin", "Squash", "Vegetarian"], "recipeIngredient": ["2 tablespoons extra virgin olive oil, plus more for serving", "3 1/2 cups cubed, peeled and seeded sugar pumpkin or kabocha squash", "Kosher salt and freshly ground black pepper", "1 medium shallot, thinly sliced (about 1/2 cup)", "Pinch of dried red chili flakes", "1 clove garlic, minced or grated with a Microplane (about 1 teaspoon)", "4 cups homemade or store-bought low-sodium vegetable or chicken stock", "1 pound farfalle pasta", "3 cups chopped lacinato kale (tuscan or cavolo nero), stemmed and leaves removed from ribs and cut into 1-inch ribbons", "1 tablespoon fresh juice from 1 lemon", "2 ounces finely grated Parmigianno-Reggiano, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 12-inch skillet over medium-high heat until hot. Add the pumpkin, season with salt and pepper, and cook, stirring occasionally, until lightly browned, about 4 minutes. Push to the side and and add the shallot and chili flakes and cook until softened, about 1 minute more, then add the garlic and cook until fragrant, another 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock and the pasta and adjust the heat to maintain a vigorous boil and cook, stirring occasionally, until pasta has about 4 minutes left to finish and stir in the kale leaves. Allow the pasta to finish cooking and the kale to wilt. Remove from the pan and toss with the lemon juice and cheese. Season to taste. Serve drizzled with olive oil and sprinkled with more cheese.</p>"}]}