{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130527-bacon-lobster-tomato-avocado-lettuce-sandwich-07.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["avocado", "BLTs", "lettuce", "lobster", "sandwich", "The Food Lab", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Ultimate Lobster, Bacon, Lettuce, Avocado, and Tomato Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/05/food-lab-ultimate-lobster-bacon-avocado-lettuce-tomato-sandwich-recipe.html", "description": "The ultimate lobster, bacon, lettuce, avocado, and tomato sandwiches, made with a bacon sheet, tomato filets, perfectly cooked lobster, homemade mayonnaise, and bread toasted in bacon fat.", "totalTime": "1 hour", "recipeYield": "Makes 2 large sandwiches, serving 2 or 4", "recipeCategory": ["Avocado", "Bacon", "Lobster and Crab", "Mains", "Sandwiches", "The Food Lab", "Tomato"], "recipeIngredient": ["2 ripe tomatoes", "2 small lobsters (about 1 pound each)", "2 to 3 tablespoons <a href=\"http://www.seriouseats.com/2011/10/the-food-lab-homemade-mayo-in-2-minutes-or-le.html\">fool-proof homemade mayonnaise</a>", "2 teaspoons fresh juice from 1 lemon", "2 tablespoons finely sliced chives", "Kosher salt and freshly ground black pepper", "1 pound thick-cut bacon", "2 small loaves ciabatta, split in half horizontally", "1 avocado, thinly sliced", "4 iceberg lettuce leaves, crisp white/pale yellow parts only"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tomatoes:</strong> Bring a large pot of water that can fit a steamer attachment to a boil. Cut a small X in the bottom of each tomato. Place tomatoes in water and cook for 30 seconds, then immediately transfer to a bowl of cold water. Set aside. Pour off all but 1 inch of water from Dutch oven and add steamer insert. Cover and keep hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lobster:</strong> Adjust oven rack to middle position and preheat oven to 350°F. Meanwhile, kill each lobster by pressing the tip of a heavy chef's knife in the crack just behind the eyes in the center of the carapace. Press down firmly, then split head in half. Using kitchen towels, twist off tail and claws (including knuckles) from carapace. Save carapace for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place lobster claws and tails in steamer insert. Cover and steam for exactly 2 minutes, then transfer lobster to a foil-lined rimmed baking sheet (lobsters may still be twitching slightly—this is a reflex reaction. Don't worry, they are dead). Repeat with remaining lobster. Transfer to oven and roast until claws reach 135°F in the center as measured on an instant-read thermometer, about 7 minutes. Remove claws and set aside on large plate. Continue roasting until tails reach 135°F in center, 7 to 15 minutes longer (depending on exact shape of tails). Remove from oven and transfer to a bowl of cold water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cold, shuck lobster meat. Roughly chop, drain on paper towels, then transfer to a large bowl. Add 1 to 2 tablespoons mayonnaise (to taste), lemon juice, and chives. Season to taste with salt and pepper. Keep lobster salad refrigerated until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bacon:</strong> Lay bacon slices on a foil-lined rimmed baking sheet, allowing each slice to overlap slight lengthwise to form a solid sheet of bacon. Transfer to oven and cook until crisp, about 20 minutes. Remove from oven and let cool slightly. Preheat broiler to high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While bacon cooks, peel tomatoes (the skins should slip off). Split each tomato into quarter, then using a sharp chef's knife, remove the inner flesh and seeds to form 8 tomato filets. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer bacon sheet to a cutting board, reserving fat separate. Cut bacon sheet into large pieces that just fit the bread. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread cut surface of each piece of bread with 1 teaspoon rendered bacon fat. Broil cut-side-up until well-browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Spread mayonnaise to taste on each bottom bread half. Arrange avocado slices on top. Arrange bacon sheet on top of avocado. Add tomato filets. Spread mayonnaise to taste on the top of each bread half. Add lettuce leaves. Press lobster salad into lettuce leaves, compressing bread slightly. Close sandwiches. Cut in half, and serve.</p>"}]}