{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130220-hearts-of-palm-grilled-tacos-refried-beans-cabbage-slaw-vegan-07.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["beans", "Mexican", "pinto beans", "refried beans", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Spicy Vegan Refried Beans", "link": "https://www.seriouseats.com/recipes/2013/02/spicy-vegan-refried-beans.html", "description": "A basic refried bean recipe flavored with onion, garlic, jalapeño, and chipotle. 100% vegan.", "totalTime": "overnight (if using dried beans), 30 minutes if using canned", "recipeYield": "Makes about 2 quarts beans, serving 8 to 10", "recipeCategory": ["Beans and Pulses", "Dairy-Free", "Mexican", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["1 pound dried pinto beans (see note)", "Kosher salt", "1 bay leaf", "2 medium onions, one split in half, one chopped (about 1 cup)", "1/4 cup vegetable oil", "3 medium cloves garlic, minced on a microplane grater (about 1 tablespoon)", "1 jalapeño pepper, seeded and finely minced (about 1 tablespoon, optional)", "2 tablespoons finely chopped canned chipotle chilies in adobo sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beans in a large bowl and add 1 gallon water. Stir in two tablespoons kosher salt. Set aside at room temperature and let rest overnight. The next day, drain and rinse beans. Transfer to a large Dutch oven. Add bay leaf, split onion, and 3 quarts water. Bring to a boil over high heat, reduce to a bare simmer, cover, and cook until beans are completely tender and skins are loose, 2 to 2 1/2 hours. Discard onion and bay leaves. Drain beans, reserving liquid. (See note for pressure cooker or canned bean variations).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a large Dutch oven over medium-high heat until shimmering. Add onions, garlic, and jalapeño (if using) and cook, stirring frequently, until softened but not browned, about 3 minutes. Add beans and chipotle (if using) and cook, folding with a wooden spoon until homogenous. Add 2 cups of reserved bean liquid. Mash beans with a potato masher until desired consistency is reached, adding extra cooking liquid as necessary to loosen to desired texture. If smoother texture is required, use a hand blender or a food processor to process beans to desired texture. Season with salt to taste. Serve. Uneaten beans can be stored in an airtight container in the refrigerator for up to 5 days.</p>"}]}