{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130319-green-risotto-vegan-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["mushrooms", "risotto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Green Risotto With Mushrooms (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/03/green-risotto-with-mushrooms-recipe.html", "description": "Creamy risotto tinted bright green with spinach and herbs, served with pan-seared mushrooms.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Christmas", "Dairy-Free", "Mains", "Mushrooms", "Rice", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 cup loosely packed fresh parsley leaves", "1/4 cup loosely packed fresh tarragon leaves", "6 cups <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">vegetable stock</a> or water, divided", "2 cups loosely packed fresh spinach leaves", "4 scallions, whites finely chopped, greens reserved separately", "4 tablespoons extra-virgin olive oil", "2 medium cloves garlic, minced (about 2 teaspoons)", "1 1/2 cups (about 13 1/2 ounce) risotto-style rice (see note)", "2 tablespoons canola or vegetable oil", "8 ounces mixed wild mushrooms, such as trumpet royale, chanterelle, morel, or oyster, cleaned and cut in half if large", "1 small shallot, minced (about 2 tablespoons)", "1 teaspoon juice and 1 teaspoon grated zest from 1 lemon", "1 teaspoon soy sauce", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop 1 tablespoon parsley leaves and 1 tablespoon tarragon leaves. Cover with a damp paper towel and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a large ice bath. In a medium saucepan, bring stock to a boil over high heat. Add spinach, remaining whole parsley and tarragon leaves, and scallion greens. Press down with a wire mesh spider to submerge. Cook for 30 seconds, then transfer to ice bath and chill completely. Remove stock from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer blanched greens to the jar of a blender and add 1/2 cup broth. Blend on high speed until completely smooth, about 30 seconds. Transfer to a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a heavy 12-inch skillet over medium-high heat until foaming subsides. Add rice and cook, stirring and tossing frequently until all liquid is evaporated, fat is bubbling, and rice has begun to take on a pale golden blond color and nutty aroma, about 3 minutes. Add garlic and scallion whites and continue to cook, stirring frequently until aromatic, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add all but 1 1/2 cups of broth to skillet. Stir rice once, cover, and reduce heat to lowest possible setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook rice for ten minutes undisturbed. Stir once, shake pan gently to redistribute rice, cover, and continue cooking until liquid is mostly absorbed and rice is tender with just a faint bite, about 10 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat canola or vegetable oil in a 10-inch skillet over medium-high heat until shimmering. Add mushrooms and cook, tossing occasionally, until well browned, about 5 minutes. Add shallot and cook, stirring constantly, until aromatic, about 30 seconds. Carefully add 1/4 cup broth, lemon juice, and soy sauce. Remove from heat, toss to combine, season to taste with salt and pepper, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid from risotto, add remaining broth, Increase heat to high and cook, stirring and shaking rice constantly until thick and creamy. Off heat, stir in green puree, lemon zest, chopped parsley, and chopped tarragon. Season to taste with salt and pepper. Serve immediately on hot plates, topping with mushrooms and their pan juices.</p>"}]}