{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130513-anzac-pineapple-sandwiches.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["from the pastry dungeon", "frozen desserts", "ice cream", "ice cream sandwiches", "pineapple"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Anzac Cookie and Pineapple Ice Cream Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/05/anzac-cookie-pineapple-ice-cream-sandwiches-recipe.html", "description": "Anzac biscuits are a classic treat in Australia and New Zealand. Spoom is a British term for sorbet lightened with meringue. I put the two foreign treats together for a happy, crunchy little ice cream sandwich.", "totalTime": "2 hours", "recipeYield": "Makes 10 to 12 sandwiches", "recipeCategory": ["Cookies", "Ice Cream and Frozen Treats", "Pineapple", "Very Small Anna"], "recipeIngredient": ["<strong>For the Biscuits</strong>:", "2 cups (about 10 ounces) all purpose flour", "2 cups (about 10 ounces) whole oats", "1 cup (about 4 1/2 ounces) dessicated coconut (unsweetened)", "2 cups (about 14 ounces) sugar", "1 cup (2 sticks, 16 tablespoons) unsalted butter", "2 tablespoons golden syrup or honey", "3/4 teaspoon baking soda", "1/4 cup boiling water", " ", "<strong>For the Spoom</strong>:", "1 2/3 cup pineapple puree", "1 cup cold water", "1 tablespoon juice from 1 lime", "3 egg whites", "Pinch salt", "3/4 cup (about 5 ounces) sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Biscuits</strong>: Set a rack in center of oven. Preheat oven to 350&deg;F. Place flour, oats, coconut, and sugar in medium mixing bowl and whisk to evenly combine. Combine butter and golden syrup/honey in a small saucepan over low heat and allow butter to melt fully. Stir to evenly combine; set aside. Dissolve baking soda in boiling water, then add to butter mixture. Pour liquid mixture into dry ingredients and fold to fully incorporate. Allow dough to rest  until butter cools and sets up to create a firm dough, 5 to 10 minutes. Divide dough into 1 inch balls and place on parchment or silicone-lined baking sheet, leaving 2 to 3 inches between the balls. Flatten slightly into thick discs, then bake for 8 minutes, turn and continue baking until dark golden-brown. Allow to fully cool before removing from sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spoom</strong>: Prepare an ice cream maker for churning. Combine pineapple puree, water, and lime juice in a medium bowl and mix well. Place egg whites and salt in bowl of stand mixer and whip until foamy. Continue whipping to stiff peaks. Whisk half of meringue into puree mixture, then gently fold in rest of meringue with whisk. Immediately churn in ice cream maker until spoom is thoroughly chilled and holds its shape when spooned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble</strong>: Once spoom is done churning (it will be very fluffy), pile onto half of the biscuits and top with remaining biscuits, pairing up similarly shaped and sized biscuits. Place on lined baking sheet and immediately freeze until firm, then wrap individually in plastic.</p>"}]}