{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131003-bakethebook-pumpkinpie.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "Desserts for Every Season", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin-Milk Chocolate Pie with Gingersnap Crust", "link": "https://www.seriouseats.com/recipes/2013/10/pumpkin-milk-chocolate-pie-with-gingersnap-cr.html", "description": "Behold! <em><strong><a href=\"http://www.amazon.com/Jenny-McCoys-Desserts-Every-Season/dp/0847841014/?tag=serieats-20\" target=\"_blank\">Desserts for Every Season</a></strong></em> has devised a pumpkin pie recipe that hits all the marks. Sweet, spicy, earthy and warm, with a freshly made filling that puts it head and shoulders over your average Thanksgiving dessert.", "totalTime": "2-4 hours, if roasting squash", "recipeYield": "makes 8 servings", "recipeCategory": ["Bake the Book", "Chocolate", "Pies, Tarts, and Crumbles", "Pumpkin"], "recipeIngredient": ["Nonstick cooking spray", "1 1⁄2 cups (about 6 ounces) gingersnap cookie crumbs", "2 tablespoons plus 1⁄2 cup packed light brown sugar, divided", "3⁄4 teaspoon fine sea salt, divided", "2 1⁄2 ounces (5 tablespoons) unsalted butter, melted", "1 1⁄2 cups Roasted Sugar Pumpkin and Kabocha Squash (recipe follows)", "4 large eggs", "1 large egg yolk", "3/4 cup heavy cream", "1 tablespoon molasses", "1 teaspoon pure vanilla extract", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground ginger", "1/4 teaspoon ground nutmeg", "1 recipe Milk Chocolate Ganache (recipe follows)", " ", "One 4-pound sugar pumpkin ", "One 4-pound kabocha squash", " ", "2 cups (about 3 ounces) chocolate chips", "3 tablespoons heavy cream", "1 tablespoon light corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Roast the squash:</strong> Cut the pumpkin and squash into eighths; remove and discard the seeds. Place the pumpkin and squash pieces in a large baking dish, fill with about 1/4 inch of water, and cover with aluminum foil. Roast for 1 hour to 1 hour and 15 minutes, until the flesh is fork tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and discard the foil. When the pumpkin and the squash pieces are cool enough to handle, use a large spoon to scrape the flesh from the skin; discard the skins. Puree the pumpkin and squash flesh in a food processor until smooth. Let cool to room temperature before refrigerating or using.</p>\r\n\r\n<p>note: This recipe makes more puree than called for in any of the recipes in this book. Freeze the leftovers in small containers for up to 3 months and defrost just before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Ganache:</strong> In a small saucepan, bring the cream and corn syrup to a boil. Pour over the chocolate, let stand for 2 minutes, then gently whisk until smooth. Transfer the mixture to a liquid measuring cup with a pour spout and let cool until slightly warmer than room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Pie:</strong> Position a rack in the center of the oven and preheat to 350°F. Lightly coat a 9-inch pie plate with nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the gingersnap crust, stir together the cookie crumbs, 2 tablespoons of the brown sugar, 1/4 teaspoon of the salt, and the butter until evenly combined and the mixture has the consistency of wet sand. Pour into the pie plate and, very evenly and firmly, pack the mixture into the base and up the sides of the pan, taking care to avoid too much buildup in the corner of the pan. Allow about 1/4 inch of excess to rise above the top of the pan’s edge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pie plate on a baking sheet and bake until the crust is slightly puffed and a bit darker in color, about 8 minutes. Let cool at room temperature for about 5 minutes, then transfer to the freezer until ready to use.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the oven temperature to 325°F.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the remaining 1/2 cup brown sugar, the remaining 1/2 teaspoon salt, the roasted pumpkin and squash, the whole eggs, egg yolk, cream, molasses, vanilla, cinnamon, ginger, and nutmeg until completely smooth. Pour into the prepared piecrust and bake until the custard is set in the center when the pie plate is slightly jiggled, 50 to 60 minutes. Let cool to room temperature and refrigerate for 30 to 45 minutes to set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the back of a spoon or ladle, spread the ganache in an even circle on top of the pie. Place the pie in the refrigerator until the ganache has just begun to set, 3 to 5 minutes. Remove the pie from the refrigerator and use the spoon or ladle to spread the ganache again to create a decorative, rustic texture. Refrigerate until fully set before slicing, about 20 minutes.</p>"}]}