{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130206-239877-coeur-a-la-creme.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "French", "keywords": ["coeur de la creme", "creme fraiche", "French", "heavy cream", "mascarpone", "pies", "puddings", "tarts", "Valentine's Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Valentine's Day Coeur à la Crème With Raspberries", "link": "https://www.seriouseats.com/recipes/2013/02/valentines-day-coeur-de-la-creme-with-raspberries-recipe.html", "description": "This quick, creamy dessert is perfect for two people. It needs to be made the night or morning before serving, but requires less than ten minutes of actual work!", "totalTime": "8 hours", "recipeYield": "serves 2", "recipeCategory": ["French", "Fruit Desserts", "Mother's Day", "Pies, Tarts, and Crumbles", "Puddings and Custards", "Valentine's Day"], "recipeIngredient": ["1 cup of mascarpone cheese, at room temperature", "1/2 cup crème fraîche", "3/4 cup powdered sugar", "1 teaspoon vanilla extract ", "2 teaspoons lemon zest from 1 lemon", "Pinch of salt", "2 cups heavy cream", "&nbsp", "<strong>For The Raspberry Sauce</strong>", "1 cup raspberries", "2 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a small cooling rack inside of a small, rimmed baking sheet. Line a coeur à la crème mold with four sheets of cheesecloth, one of top of the other. Set the mold on top of the cooling rack and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, combine mascarpone and crème fraîche, beating on medium-low speed until creamy. Slowly add powdered sugar, beating until fully incorporated. Scrape down the sides of the bowl as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vanilla, lemon zest, and salt. Beat until well mixed. Drizzle in heavy cream, in a thin stream, and beat until the cream has thickened to soft peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the cream into the lined heart mold, making sure to push it down into the corners of the mold. Fold the edges of the cheesecloth over the top of the mold to cover the cream. Make sure that there is space between the mold and the pan beneath it to allow for proper drainage. Slide the baking sheet into the refrigerator and let drain for eight hours, or overnight. Once the cream has drained, discard the runoff liquid and unmold the heart onto a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the raspberry sauce</strong>: Combine raspberries and sugar in a bowl and stir well, gently mashing the berries to create a little added texture. Cover the bowl and allow to sit for 1 hour, stirring occasionally. Drizzle over unmolded coeur à la crème and serve immediately (with two spoons!). </p>"}]}