{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130805-pork-chop-peaches.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["One Pot Wonder", "peach", "pork", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Chops With Fresh Peaches and Basil", "link": "https://www.seriouseats.com/recipes/2013/08/pork-chops-peaches-basil-recipe.html", "description": "Pan-seared pork chops served with spinach and a rich, sweet peach sauce make up this simple, seasonal one-pot meal.", "totalTime": "20 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Mains", "One-Pot Wonders", "Peach", "Pork"], "recipeIngredient": ["2 bone-in rib or center-cut chops (4 to 6 ounces each)", "Kosher salt and freshly ground black pepper", "2 tablespoon olive oil", "3 peaches, pits removed, cut into 1/4-inch slices", "2 teaspoons zest and 2 tablespoons fresh juice from 1 lemon", "1 teaspoon sugar", "1/2 teaspoon salt", "Pinch of dried red chili flakes ", "2 cups fresh raw baby spinach", "¼ cup fresh basil leaves, roughly chopped", "1 tablespoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the pork chops generously with salt and pepper. Heat 1 tablespoon olive oil in a 12-inch skillet over high heat until lightly smoking. Add the pork chops and cook until first side is nicely browned, 4 to 6 minutes. Flip and continue to cook until the internal temperature registers 145°F on an instant read thermometer, about 3 minutes longer. Transfer to a plate and tent with foil. Do not wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower heat to medium low and add the peaches, lemon zest, sugar, salt, and dried chili flakes. Stir gently until the peaches begin to soften but don’t lose their shape, 2 to 3 minutes. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the spinach between two plates and put the pork chops on top. Pour any juices from the plate back into the skillet and add butter and lemon juice. Cook, scraping up any browned bits from the bottom of the pan and swirling pan until butter is melted and incorporated into the sauce. Season to taste with salt and pepper. Stir in half of basil. Divide the peaches between the two plates and then pour the pan juices on top and sprinkle with remaining basil. Serve immediately.</p>"}]}