{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/080913-261672-cook-the-book-oatmeal-parfaits-chantilly-cream.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Bake the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oatmeal and Fresh Berry Parfaits with Chantilly Cream from 'Treme'", "link": "https://www.seriouseats.com/recipes/2013/08/oatmeal-fresh-berry-parfait-chantilly-cream-from-treme-cookbook.html", "description": "Parfaits are not my usual choice when it comes to dessert, despite my penchant for sweets made primarily with berries and cream. Something about layering everything in a tall glass strikes me as fussy. But that's not a good enough reason to miss this delightful, slightly boozy parfait from the new <em><a href=\"http://www.amazon.com/books/dp/1452109699/?tag=serieats-20\">Treme</a></em> cookbook.", "totalTime": "2 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Breakfast and Brunch", "Breakfast Sweets", "Cook the Book", "Fruit Desserts", "Vegetarian"], "recipeIngredient": ["6 cups fresh blueberries, blackberries, or strawberries, or a combination", "2 tablespoons granulated sugar", "6 tablespoons fruit liqueur such as pear brandy, elderflower liqueur, or orange-flavored liqueur", "1 cup uncooked oatmeal, preferably steel-cut", "5 tablespoons unsalted butter", "1/4 cup loosely packed light or dark brown sugar", "&nbsp", "<strong>Chantilly Cream</strong>", "1 quart heavy (whipping) cream", "2 tablespoons sour cream", "2 tablespoons orange-flavored liqueur", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 2 hours before assembling the parfaits for serving, if using strawberries, stem them and cut into pieces about the same size as the other berries. Put all the berries in a medium glass, ceramic, or stainless-steel bowl. In a small bowl, combine the granulated sugar and liqueur and stir until the sugar is completely dissolved. Add the sweetened liqueur to the berries and stir gently with a rubber spatula until the berries are well coated with the syrup, being careful not to break up the berries. Cover with plastic wrap and refrigerate until ready to serve, stirring very gently about every 45 minutes with the spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook the oatmeal according to the package directions. Then cover and set aside at room temperature until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before assembling the parfaits, gently rewarm the oatmeal over low heat; thin with a little water, if needed. (It shouldn’t be too hot, or it will melt the Chantilly cream.) Add the butter and brown sugar and stir to mix well. Cover to keep warm and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Also just before assembling, make the cream: In a large bowl, combine the heavy cream, sour cream, liqueur, and vanilla. Whisking by hand or using an electric mixer set on medium speed, beat the mixture just until soft peaks form, 5 to 10 minutes if beating by hand or about 3 minutes if using an electric mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the parfaits, layer in each glass 2 tablespoons oatmeal, then 2 tablespoons drained berries, then 2 tablespoons Chantilly cream, then another 2 tablespoons oatmeal. Top with more berries, dividing them evenly, and end with 1 tablespoon Chantilly cream on top of parfait with a few more berries for garnish. Serve at once, with long-handled spoons.</p>"}]}