{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130511-252109-provincial-braised-chicken.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["capers", "chicken", "comfort me with", "olive", "poultry", "rustic", "stews", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Rustic Chicken Stew with Tomatoes, Olives, and Red Wine", "link": "https://www.seriouseats.com/recipes/2013/06/rustic-braised-chicken-recipe.html", "description": "Rustic Braised Chicken is a hearty stew full of tomatoes, olives, capers, and chicken.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chicken", "Mains", "Olives", "Soups and Stews", "Tomato"], "recipeIngredient": ["3 tablespoons olive oil", "1 pound boneless skinless chicken thighs, chopped into 1-inch cubes", "1 small onion, finely chopped (about 1 cup)", "1/2 cup black olives, rinsed, pitted, and sliced", "1/2 cup green olives, rinsed, pitted, and sliced", "1/4 cup capers, rinsed", "1 (28-ounce) can whole peeled tomatoes, roughly broken up by hand", "1/2 cup dry red wine", "2 bay leaves", "2 stems fresh basil", "Kosher salt and freshly ground black pepper", "1/4 cup chopped fresh parsley or basil leaves", "Cooked rice for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 300°F. Heat olive oil over medium heat in a large Dutch oven until shimmering. Add chicken and cook without moving until well browned on one side, about 4 minutes. Stir and continue cooking until lightly browned on remaining sides, about 3 minutes longer. Transfer to a plate. Add onion to pot and cook,  stirring, until lightly browned, about 5 minutes. Add black olives, green olives, and capers, and cook for 1 minutes, stirring constantly. Add tomatoes, red wine, bay leaves, and basil. Add 1 teaspoon salt and season with pepper. Return chicken to pot and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pot and transfer to oven. Cook until chicken is completely tender, about 2 hours. Remove lid and continue cooking for 15 minutes to lightly reduce cooking liquid. Discard basil. Season to taste with more salt and pepper as desired. Stir in chopped parsley or basil, reserving some for garnish. Serve with rice, or cool and store in a sealed container in the refrigerator for up to 3 days. Reheat before serving.</p>"}]}