{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130711-apricot-almond-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["almonds", "apricots", "ice cream", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Apricot and Almond Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/07/roasted-apricot-almond-ice-cream-recipe.html", "description": "The perfect thing to do with less than perfect apricots. The ice cream gets a double dose of almonds: some chopped up into the final scoop, but also some steeped into cream, which adds a deep, nutty flavor to the base.", "totalTime": "5 hours", "recipeYield": "makes 1 quart", "recipeCategory": ["Apricot", "Ice Cream and Frozen Treats", "Nuts", "Scooped"], "recipeIngredient": ["4 ounces roasted, unsalted almonds, divided", "2 cups heavy cream", "2 pounds (whole) apricots, halved and stoned", "1 cup sugar", "1/2 teaspoon kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast 2 ounces almonds in a <a href=\"http://www.seriouseats.com/2014/11/toast-nuts-in-the-microwave.html\">microwave</a> or a dry saucepan over high heat until they darken slightly and begin to smell nutty, about 1 minute, then finely chop and set aside. In a heavy-bottomed saucepan over medium heat, bring cream to a simmer, then remove from heat, cover, and let steep for 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cream is about 45 minutes away from done, heat oven to 450&deg;F with an oven rack in the middle position. Line a baking sheet with aluminum foil and arrange apricots in a single layer, cut side facing up. Roast until apricots are completely soft and begin to caramelize around the edges, about 20 minutes. Check on apricots frequently after the first 15 minutes to make sure they don't burn. Let apricots cool for 10 minutes before handling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour steeped cream through a fine mesh strainer to strain out and discard almonds. Transfer apricots to blender or food processor and top with strained cream and sugar, then purée on high speed until well combined, about 30 seconds. Strain mixture into a lidded container and stir in salt to taste. Chill in refrigerator until very cold, about 3 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast remaining 2 ounces almonds in a microwave or a dry saucepan over high heat until they darken slightly and begin to smell nutty, about 1 minute. Remove from heat and chop. A mix of sizes is ideal: small crumbs and pea-sized chunks. Set aside in freezer while ice cream churns.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Churn chilled ice cream base according to manufacturer's instructions. In last minute of churning, add frozen chopped almonds. Transfer ice cream to airtight container and chill in freezer for at least 3 to 4 hours before serving.</p>"}]}