{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130601-252946-sunday-brunch-sweet-potato-tarragon-goat-cheese-omelete.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["egg", "omelets", "quick sweet potato", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet Potato, Tarragon, and Goat Cheese Omelet", "link": "https://www.seriouseats.com/recipes/2013/06/sweet-potato-tarragon-and-goat-cheese-omelet.html", "description": "The licorice flavor of tarragon, combined with earthy sweet potato and the acidic creaminess of goat cheese, gives this omelet a perfect balance. Combine great flavor with ease of preparation and you've got a stand-out brunch you can be proud to serve.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Omelettes"], "recipeIngredient": ["5 tablespoons butter, divided", "1 onion, finely chopped (about 1 cup)", "1 large sweet potato, peeled and cut into 1/4 inch pieces", "1 tablespoon finely chopped tarragon", "Kosher salt and freshly ground black pepper", "12 eggs", "5 ounces goat cheese", "Chopped fresh parsley, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 10-inch non-stick skillet melt 1 tablespoon butter over medium high heat. When butter has melted add onion and cook until onions just begin to brown, about 4 minutes. Add sweet potato, tarragon, and 1/4 cup water and cover with a lid. Cook, stirring often until sweet potato is fully cooked, about 15 minutes. Place cooked sweet potato in a bowl and season to taste with salt and pepper. Wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat 3 eggs in a large bowl and season with salt. Heat butter in the skillet over medium high heat until melted. Add the beaten eggs, and using a rubber spatula to gently move the edges of the omelet. Once the edges of the omelet are cooked but the center is still a bit runny, add 1/4 of the sweet potato and 1/4 of the goat cheese down the center of the omelet. Fold each side of omelet over the center and carefully lift or roll onto a plate. Repeat with remaining ingredients and garnish each omelet with chopped parsley. Serve.</p>"}]}