{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130913-breadchicken8.jpg", "author": {"@type": "Person", "name": "Deborah Mele"}, "recipeCuisine": "Italian", "keywords": ["arugula", "chicken", "cutlet", "easy", "Italian", "italian easy", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Breaded Chicken Cutlets With Tomatoes and Arugula", "link": "https://www.seriouseats.com/recipes/2013/09/breaded-chicken-cutlets-with-tomatoes-and-arugula.html", "description": "Crispy, golden chicken cutlets are topped with peppery arugula and sweet cherry tomatoes in this quick and easy recipe.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chicken", "Italian", "Leafy Greens", "Mains", "Tomato"], "recipeIngredient": ["4 cups stale bread cubes", "1 1/2 teaspoons grated zest and 1 teaspoon juice from 1 lemon", "1/2 to 1 teaspoon chopped hot red chile pepper (optional)", "1/4 cup chopped fresh parsley leaves ", "1/2 cup grated parmesan cheese", "1/3 cup pine nuts", "Kosher salt and freshly ground black pepper", "1 cup all-purpose flour", "2 large eggs ", "8 chicken cutlets, about 1 1/2 to 2 pounds total weight, pounded to 1/2 inch thickness (see note) ", "4 cups ripe cherry tomatoes, halved", "2 cloves garlic, minced (about 2 teaspoons)", "7 tablespoons olive oil, divided", "4 tablespoons butter", "4 cups washed and dried fresh arugula", "Lemon wedges to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the cutlets, place the bread cubes, lemon zest, chile pepper, parsley, grated cheese, salt and pepper in the food processor, and pulse until finely blended. Add the pine nuts and pulse just until the nuts are coarsely chopped and dump mixture into a shallow bowl. Place the flour in a plastic bag and season with salt and pepper. Beat the eggs in a separate shallow bowl. Working 1 cutlet at a time, dredge in the flour, then dip into the eggs, and finally the breadcrumbs pressing down with your fingertips to help the crumbs adhere. Place the breaded cutlets on a baking sheet, and refrigerate the for 1 hour to allow the crumb coating to set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the tomatoes, garlic, 3 tablespoons of olive oil, and lemon juice in a bowl. Season to taste with salt and pepper and toss to mix well, then set aside until needed.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400° F. While the oven preheats, set cutlet tray at room temperature. Line two baking sheets with aluminum foil, and divide the butter and 4 tablespoons of the olive oil between each. Place the trays into the oven until the butter is melted, about 5 minutes. Divide the chicken cutlets between the two trays and bake until golden brown on the bottom, about 15 minutes. Turn the cutlets over, return to the oven and cook until golden brown on second side, 10 to 12 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken onto a platter and arrange the arugula on top. Spoon the tomato mixture over the arugula and serve immediately along with the lemon wedges.<br />\r\n</p>"}]}