{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130607-bakethebook-caramelrisotto.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Bakeless Sweets", "caramel", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salted Caramel Risotto", "link": "https://www.seriouseats.com/recipes/2013/06/salted-caramel-risotto-recipe.html", "description": "With a mantle of superdark caramel enrobing al dente grains, <strong><em>Bakeless Sweets</em></strong> Salted Caramel Risotto is rice pudding's sexier sister.", "totalTime": "2-3 hours, including cooling", "recipeYield": "makes 3 cups, or six servings", "recipeCategory": ["Bake the Book", "Puddings and Custards"], "recipeIngredient": ["1/2 tablespoon (7 g) unsalted butter", "1/2 cup (100 g) short-grain white rice, such as arborio", "1 cup (240 ml) whole milk", "1 cup (200 g) sugar", "1 cup (240 ml) cream", "1 1/2 teaspoons pure vanilla extract", "1/2 teaspoon kosher salt", "Unsweetened whipped cream, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast the rice: Heat 2 cups (480 ml) water. Melt the butter in a heavy 3-quart (2.8-L) pan over medium-high heat. When the butter foams up, add the rice and cook for 3 to 4 minutes, stirring until it is translucent and golden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the rice: Pour in the milk and the hot water. Bring to a boil, then lower to a steady simmer and cook, stirring frequently, for 15 minutes, or until the rice grains have softened and are al dente (completely cooked through but still with some chewiness).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the caramel: While the rice is cooking, mix the sugar and 1/4 cup (60 ml) water in a 4-quart (3.8-L) or larger heavy pot with tall sides. Cook over high heat, stirring, until the sugar dissolves and the mixture comes to a boil. Stop stirring and watch the syrup; when light golden streaks appear, carefully swirl the pot to help the sugar caramelize evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue boiling until the mixture turns a dark amber color. The sugar will begin to smoke; this is normal. When the caramel has been smoking for about 15 seconds, pull the pan off the heat and carefully add the cream in a slow stream, whisking constantly. Be careful, as hot steam will bubble up furiously. Whisk this mixture until smoothly combined. (If the caramel seizes and becomes a solid mass when the cream is added, return the pan to low heat and continue whisking until it is melted and smooth. You can minimize the chance of seizing by heating the cream prior to pouring it in.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sweeten the rice: Add the rice to the caramel, stirring well. Simmer over medium-low heat, for 15 to 20 minutes, until much of the liquid has evaporated. Stir frequently to keep the rice from scorching. The liquid will reduce and get darker, and the rice will soften a little more. The pudding will look soupy and thin, but it will thicken considerably as it cools. Stir in the vanilla and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a container and refrigerate until the pudding is at your desired consistency and temperature—about 30 minutes for a warm pudding, and 2 hours for a cold pudding. (If the cold pudding is too firm, thin with a little whole milk.) Serve warm with unsweetened whipped cream.</p>"}]}