{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131121-btb-sugarcreampie.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["cream pie", "pie", "The Hoosier Mama Book of Pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hoosier Mama's Sugar Cream Pie", "link": "https://www.seriouseats.com/recipes/2013/11/hoosier-mamas-sugar-cream-pie.html", "description": "The great thing about this pie is that you probably already have everything you need to make it. <em><strong><a href=\"http://www.amazon.com/The-Hoosier-Mama-Book-Pie/dp/1572841435/?tag=serieats-20\" target=\"_blank\">The Hoosier Mama Book of Pie</a></strong></em> shows you how to take sugar and cream and turn it into a pie with notes of creme brulee and buttery vanilla.", "totalTime": "overnight, including dough-making", "recipeYield": "makes 1 9-inch pie", "recipeCategory": ["Bake the Book", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1 single-crust, blind-baked All-Butter Pie Dough shell ", "1/2 cup (100g) granulated sugar", "1/2 cup (120g) dark brown sugar", "2 tablespoons all-purpose flour", "Pinch kosher salt", "2 cups heavy cream", "1 teaspoon (5g) vanilla paste ", "&nbsp;", "<strong>Pie Dough Shell</strong>", "1 3/4 sticks unsalted butter, divided", "1 tablespoon red wine vinegar ", "1/2 cup cold water", "2 1/4 cups (333g) all-purpose flour", "2 1/4 teaspoons (6.5g) kosher salt ", "1/2 tablespoon (6.5g) granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Dough Making:</strong> Cut the butter into 1/2-inch cubes. Freeze 5 tablespoons for 20 minutes or overnight; chill the remaining 1 1/8 sticks in the refrigerator until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the red wine vinegar into the cold water and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the flour, salt, and sugar in the bowl of a food processor and pulse 5 or 6 times to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chilled butter and mix for 25 to 30 seconds, until the mixture resembles coarse meal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the frozen butter and pulse 15 to 20 times, until the butter is in pea-sized pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 6 tablespoons of the vinegar water and pulse 6 times. The dough should start to look crumbly. Test the dough by squeezing a small amount in the palm of your hand. If it easily holds together, it is done. If not, add 1/2 tablespoon of the vinegar water and pulse 3 more times. Repeat this process as needed until the dough holds together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a lightly floured work surface and knead together until smooth; dough should never come together in the food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into 2 equal parts and roll each into a ball. Flatten the balls slightly and wrap separately in plastic wrap. Let the dough rest in the refrigerator until ready to use, at least 20 minutes but preferably overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to use, take one of the dough balls out of the refrigerator. The other can be frozen, for future pies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough out into a 14-inch circle, 1/16 to 1/8 inch thick. Use a pan lid or bowl as a guide. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat a 9-inch pie tin with cooking spray and dust with flour. Rotate the tin to coat the side. Turn the tin over and tap out any excess flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick the dough circle up firmly by the edges and center onto the prepared pie tin. Tap the pie tin on the counter several times until the dough settles into it. Gently press the dough into the corners of the pie tin with your fingertips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crimp the shell: Gently roll the edges of the pie dough under, with your thumb and index finger resting the rolled edge on the rim of the tin. Be careful not to pull the dough up out of the pie tin as you go. This will cause the shell to sink back into the tin as it bakes and leave you with a too-short pie crust.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grab the edge of the pie shell with the thumb and index finger of each hand, about an inch apart. Bring your right hand toward you and to the left as you push your left hand away from you and to the right. Place your left hand 1/2 inch to the right of the first crimp and repeat the process until you have worked your way around the pie shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place your index finger behind each crimp and squeeze the point on the outside of the pie shell with your thumb and index finger. Because our pie dough is all butter, and butter softens and melts so quickly in the oven, it is important to start with as sharp and well-defined a crimp as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the crimped pie shell in the refrigerator to rest for at least 20 minutes, then transfer to the freezer for 20 minutes to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Blind Baking:</strong> Preheat the oven to 400°F (200°C).<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the frozen, crimped pie shell on a baking sheet. Line the inside of the shell with parchment paper or a coffee filter. Fill with uncooked beans until the beans are even with the top edge of the crimp. Press down on the beans to make sure they spread to the edges of the shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 20 minutes, rotating 180 degrees halfway through. The outer edge of the crimp should be dry and golden brown.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Pie Making:</strong> Preheat the oven to 400°F (200°C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pie shell on a baking sheet. Set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the granulated sugar, brown sugar, flour, and salt in a medium bowl. Mix with a whisk or your hands to break up any clumps and to combine ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently stir in the heavy cream with a wooden spoon or spatula. Do not overmix. Whipping the cream will prevent the pie from setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the vanilla paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the filling into the prepared pie shell and bake for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rotate 180 degrees and bake for 20 to 25 more minutes, until large bubbles cover the surface. The pie will not appear to be set when it comes out of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool to room temperature, then chill in the refrigerator for at least 4 hours, up to overnight, before slicing. Dust with confectioners’ sugar before serving.</p>"}]}