{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130123-237979-Lunchbox-TomatoChickpeaSoup.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["chard", "chickpeas", "lunch box", "quick", "rice", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tomato-Chickpea Soup with Rice and Swiss Chard", "link": "https://www.seriouseats.com/recipes/2013/01/lunch-box-tomato-chickpea-soup-swiss-chard-recipe.html", "description": "This is an ode to soup lovers looking for a meal in a bowl, with crispy fried chickpeas, tender chard and rice. Packed with antioxidants and fiber, it's also ideal for your eat-healthier, your-body-is-a-temple New Years' resolutions--no kale chips required.", "totalTime": "40 minutes", "recipeYield": "serves 2 to 3", "recipeCategory": ["Legumes", "Lunch Box", "Mains", "Rice", "Soups and Stews"], "recipeIngredient": ["5 teaspoons extra-virgin olive oil", "1 small yellow onion, diced (about 3/4 cup)", "1 bunch rainbow chard, stems removed and chopped into 1/2-inch pieces, leaves roughly chopped", "2 medium cloves garlic, minced (about 2 teaspoons)", "1 (28 ounce) can crushed tomatoes", "Kosher salt", "2 cups low-sodium vegetable stock", "1 (15.5 ounce) can chickpeas, drained and rinsed", "1/2 cup basmati rice, cooked according to package directions", "Freshly ground black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 teaspoons oil in medium pot over medium heat. Add onions and chard stems (not leaves) and sauté until onions are translucent and stems are softened, about 5 minutes. Add garlic and cook, stirring until fragrant, about 1 minute. Add tomatoes and sprinkle with salt. Cook 2 minutes, then add stock. Bring to a boil, reduce to a simmer, and cook until slightly reduced, about 10 minutes. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 teaspoons oil in a large sauté pan over high heat until oil is hot and shimmering. Add chickpeas, sprinkle with salt, and fry over medium-high heat until browned and crispy, about 3 minutes. Drain on paper towel, and then stir into soup along with rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir chard leaves into soup over medium-high heat in batches, waiting until just wilted and soft before adding more. Simmer 1 minute to heat everything through, and then season with salt and pepper. Let cool before storing in an airtight container for the next day, or freeze for future use. </p>"}]}