{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130312-244219-PeanutSoba-edit.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["lunch box", "make ahead", "soba", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Peanut Soba Noodles with Tofu and Pickled Bean Sprouts", "link": "https://www.seriouseats.com/recipes/2013/03/make-ahead-peanut-soba-noodle-tofu-pickled-bean-sprout-recipe.html", "description": "As something of a seasoned peanut noodle slurper, I wanted my version to be spot on, and up to snuff. The sauce is a balance of salty, sharp, sweet and rich, and just hovering between liquid and paste for the perfect amount of \"noodle cling\". I threw in some easy pickled bean sprouts for kick (and crunch) and some simply seared tofu to make this a well-rounded lunch box. Just try not to slurp too loudly.", "totalTime": "8 hours 10 minutes (includes pickling time)", "recipeYield": "serves 2", "recipeCategory": ["Lunch Box", "Mains", "Pasta", "Tofu", "Vegetarian"], "recipeIngredient": ["1/2 cup white, apple cider or rice wine vinegar", "1 tablespoon sugar", "1 teaspoon salt", "1 cup bean sprouts", "2 scallions, finely sliced", "2 1/2 tablespoons creamy peanut butter", "1 tablespoon soy sauce or tamari", "4 teaspoons sesame oil", "2 teaspoons fish sauce", "1 teaspoon honey", "1 tablespoon juice from 1 lime", "4 ounces dried soba noodles", "2 teaspoons white or black sesame seeds", "8 ounces firm tofu, cubed and dried on paper towels", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together 1/2 cup water, vinegar, sugar and salt in small bowl until sugar and salt are dissolved. Combine brine with sprouts and scallions in a small sealed container and refrigerate for 1 hour or up to overnight. (This can be done ahead and combined with the salad the next day when serving).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together peanut butter, soy sauce, 3 tablespoons warm water, 2 teaspoons sesame oil, fish sauce, honey, lime juice. Cook soba noodles in lightly salted water according to package instructions. Drain and run under cold water to cool. Toss together noodles with peanut sauce and sesame seeds to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 teaspoons sesame oil in saute pan. Saute tofu until lightly browned on all sides, about 3 minutes. Drain on paper towels and season with salt. Place noodles in containers and top with tofu. Refrigerate until ready to serve. To serve, top with pickled bean sprouts and scallions.</p>"}]}