{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/10302013-btb-germanchoccake-edit.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["cake", "chocolate", "coconut", "layer cake", "pecan", "the gramercy tavern cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gramercy Tavern's German Chocolate Cake", "link": "https://www.seriouseats.com/recipes/2013/11/german-chocolate-cake.html", "description": "If you're already sick of pumpkin, but searching for a dessert that can feed a holiday crowd, look no further than <em><strong><a href=\"http://www.amazon.com/Gramercy-Tavern-Cookbook-Michael-Anthony/dp/0307888339/?tag=serieats-20\" target=\"_blank\">The Gramercy Tavern Cookbook</a></strong></em>'s German chocolate cake. Crunchy, chewy frosting is spread between sweet and simple chocolate cake. It's an intersection of coconut, chocolate and toasted pecan that's deeply satisfying.", "totalTime": "2 hours", "recipeYield": "makes one 9-inch 3-layer cake", "recipeCategory": ["Bake the Book", "Cakes", "Chocolate", "Coconut", "Desserts", "Nuts"], "recipeIngredient": ["<strong>Frosting</strong>", "4 large egg yolks", "1 cup sugar", "1 cup unsweetened coconut milk", "8 tablespoons (1 stick) unsalted butter, cubed", "1 3/4 cups sweetened shredded coconut, toasted to light golden brown", "1 1/2 cups chopped pecans, toasted", "&nbsp;", "<strong>Cake</strong>", "2 tablespoons unsalted butter, melted, plus butter for the pans", "7 tablespoons unsweetened cocoa powder, sifted if lumpy, plus more for the pans", "1 cup plus 1 tablespoon sugar", "3/4 cup plus 2 tablespoons all-purpose flour", "3/4 teaspoon baking powder", "3/4 teaspoon baking soda", "3/4 teaspoon salt", "1 large egg", "1/2 cup whole milk", "2 tablespoons vegetable oil", "1 1/2 teaspoons vanilla extract", "7 tablespoons boiling water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F, with a rack in the middle position.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the frosting. In a medium bowl, whisk the egg yolks until smooth. In a medium saucepan, bring the sugar and coconut milk to a boil over medium-high heat, stirring until the sugar dissolves. Slowly whisk about a cup of the hot milk mixture into the yolks to temper them, then pour the contents of the bowl back into the saucepan and cook over medium-low heat, stirring constantly with a wooden spoon, until the mixture thickens enough to hold a line drawn with a finger down the back of the spoon, about 10 minutes. (Be careful not to let the mixture boil.) Stir in the butter, toasted coconut, and pecans, then pour the frosting into a shallow baking pan. Cover the surface with plastic wrap and let the frosting cool until it’s spreadable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the cake. Butter three 9-inch round cake pans and dust with cocoa powder. In a large bowl, whisk together the cocoa powder, sugar, flour, baking powder, baking soda, and salt. In a medium bowl, whisk together the egg, milk, oil, vanilla, and melted butter. Add the wet ingredients to the dry ingredients and whisk until well combined and smooth. Whisk in the boiling water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter (which will be quite thin) into the prepared pans. Bake until the layers spring back when lightly touched, about 12 minutes. Let cool completely in the pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unmold the cake layers. Put one layer on a serving plate and spread one-third of the frosting over the top. Cover with another layer, spread with another one-third of the frosting, and then repeat the process one more time. The cake will keep for up to 3 days.</p>"}]}