{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130107-Toast-Entry.jpg", "author": {"@type": "Person", "name": "Lee Zalben"}, "recipeCuisine": "", "keywords": ["almond butter", "almonds", "bostock", "That's Nuts"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Almond Butter Bostock", "link": "https://www.seriouseats.com/recipes/2013/01/almond-butter-bostock.html", "description": "Bostock is a traditional French recipe which transforms day-old brioche into something nutty and wonderful.  Sort of how we Americans make french toast, only more French and without the eggs. Its strong almond flavor pairs really well with coffee, tea, and hot chocolate.", "totalTime": "2 hours", "recipeYield": "serves 8", "recipeCategory": ["Breakfast Sweets", "Desserts", "Nuts", "Puddings and Custards"], "recipeIngredient": ["Non-stick cooking spray, oil, or butter for preparing foil", "3 cups sugar, divided", "4 tablespoons orange juice (pulp-free)", "2 teaspoons almond extract", "1 cup almond butter (preferably unsalted and unsweetened)", "4 ounces (1 stick) unsalted butter", "1 pinch salt (omit if using salted almond butter)", "1 loaf of stale brioche or challah (about 1 pound), cut into 1- to 1 1/2-inch slices", "1 cup sliced almonds (preferably with skins)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Line two baking sheets with foil and apply a thin coat of butter, oil, or cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 2 cups water with 2 cups sugar and 4 tablespoons orange juice in a medium saucepan. Bring to a boil over high heat, stirring until sugar dissolves. Remove from heat and stir in almond extract. Transfer the syrup to a bowl large enough to dip the brioche slices.  Allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the almond butter, butter, and salt with the remaining 1 cup of sugar. Mix with an electric mixer or wooden spoon until light and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with one slice at a time, dip each side of brioche in syrup and press lightly to drain excess liquid. Place on prepared baking sheets and top with 1/4 cup of frangipane and about 2 tablespoons of sliced almonds. Repeat with remaining brioche.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the frangipane has set and the edges of the toast have begun to caramelize, 15 to 20 minutes. Serve warm, or allow to cool and store in an airtight container for up to 5 days.</p>"}]}