{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130212-240223-cook-the-book-polish-country-house-wild-mushrooms.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Anne Applebaum", "Cook the Book", "Danille Crittenden", "dill", "From A Polish Country House Kitchen", "sour cream", "vegetarian", "wild mushrooms"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "From A Polish Country House Kitchen's Twice-Cooked Wild Mushrooms", "link": "https://www.seriouseats.com/recipes/2013/02/from-a-polish-country-house-kitchens-twice-co.html", "description": "During foraging season, mushrooms appear on the Polish table in many forms. They can be sauteed, pickled, and simmered into soups. These <strong>Twice-Cooked Wild Mushrooms</strong> present a unique technique: the 'shrooms are first boiled basically to smithereens. Once totally tender, they take a trip to a skillet with butter, onions, and dill to become even more silky smooth before being finished with sour cream.", "totalTime": "45 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Cook the Book", "Mushrooms", "Sides", "Vegetarian"], "recipeIngredient": ["1 lb (455 g) mixed fresh wild mushrooms, cleaned and trimmed ", "2 tablespoons unsalted butter", "1 small onion, peeled and minced", "1/4 cup (60 ml) sour cream", "1/4 cup (10 g) chopped fresh dill", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off the very bottom of each mushroom’s stem. Chop the mushrooms roughly into chunks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the mushrooms in a large pot and cover with water. Bring to a boil, remove from the heat, drain, and rinse. Cover with fresh water, bring to a boil a second time, and continue boiling for at least 20 minutes, until the mushroom caps and stems are completely soft. Drain the mushrooms, and strain the broth through cheesecloth if you would like to use it for another purpose.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a large saucepan or sauté pan over medium heat. Add the minced onion, cook for 1 minute, and add the mushrooms. Cook for about 10 minutes, stirring occasionally, until the onion is translucent and the mushrooms are lightly browned. Add the sour cream and dill, stir well for another minute, sprinkle with salt and several good grinds of pepper, and serve immediately.</p>"}]}