{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20121224ShrimpPuttanesca-edit.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "Italian", "keywords": ["capers", "Dinner for Two", "Italian", "light eating", "olive", "puttanesca", "quick", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Shrimp with Chunky Cherry Tomato Puttanesca Sauce", "link": "https://www.seriouseats.com/recipes/2013/01/shrimp-chunky-cherry-tomato-puttanesca-cause-recipe.html", "description": "Spicy, fresh, and aromatic, this fresh puttanesca sauce, made from fresh cherry tomatoes, olives, capers, chilies, oregano, and lemon, flavors a gorgeous stew of jumbo tomatoes.  A light take on a classic that's a perfect after-work dinner for two.", "totalTime": "20 minutes", "recipeYield": "serves 2", "recipeCategory": ["Dinner for Two", "Italian", "Mains", "Olives", "Shrimp"], "recipeIngredient": ["1 tablespoon olive oil", "3 medium cloves garlic, sliced or chopped (about 1 tablespoon)", "1 Fresno or jalapeño chili pepper, seeded and finely sliced or chopped", "1 tablespoon capers, drained and rinsed", "35 pitted Kalamata olives, halved (about 1 cup)", "1 teaspoon anchovy paste (or 1 anchovy filet, mashed with a fork)", "1 pound cherry tomatoes (about 3 cups)", "1 pound large peeled and deveined shrimp", "Kosher salt and freshly ground black pepper", "1 tablespoon fresh oregano leaves", "2 teaspoons grated zest from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in a large skillet over medium heat until shimmering.  Add the garlic and chilies and cook, stirring frequently, until fragrant, about 1 minute.  Add the capers, olives, and anchovy paste, and stir around to combine.  Add the tomatoes, toss to combine, cover, and cook, shaking occasionally, until tomatoes are cooked through and softened, about 10 minutes. Use a potato masher to roughly mash tomatoes. Add the shrimp, season to taste with salt and pepper, and cook just until opaque, 2 to 3 minutes (do not overcook). Add oregano and lemon zest and toss to combine. Serve as-is, or on top of cooked pasta.</p>"}]}