{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130904-taro-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["coconut", "coconut milk", "egg-free", "ice cream", "taro"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Taro Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/09/taro-ice-cream-recipe.html", "description": "Taro's light, nutty flavor works especially well in ice cream, and cooking it releases so much starch that your ice cream won't need any eggs.", "totalTime": "8 hours", "recipeYield": "makes 1 quart", "recipeCategory": ["Coconut", "Ice Cream and Frozen Treats", "Scooped"], "recipeIngredient": ["2 tablespoons unsalted butter", "2/3 pound grated taro (about 2 cups, packed)", "2 cups heavy cream", "1 14-ounce can coconut milk", "3/4 cup sugar", "3/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed medium saucepan, melt butter on medium heat. When butter has melted completely and foam has subsided, increase heat to high and add taro. Stir to coat with butter and cook until the taro turns slightly translucent, begins to color at the edges, and reduces in volume to a soft, starchy lump, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a wooden spoon to scrape any starchy bits off the bottom of the saucepan, then stir in cream, coconut milk, and sugar. Bring to a simmer and then reduce to very low heat. Cover and cook until taro is completely soft, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dairy mixture to a blender and carefully puree on high speed until very smooth, about 30 seconds. (To keep blender top from popping off, remove the plastic knob in the center of the lid and cover with a paper towel folded over several times.) Pour through a strainer into an airtight container, add salt to taste, and chill in refrigerator until very cold, at least 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ice cream base is cold, transfer to ice cream maker and churn according to manufacturer's instructions. Transfer ice cream to airtight container and chill in freezer at least 6 hours before serving. Let ice cream sit on counter for 5 minutes before scooping.</p>"}]}