{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130107-236125-dinner-tonight-mushroom-fried-rice-pickled-ginger-primary-edit.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Chinese", "keywords": ["carrot", "Chinese", "Dinner Tonight", "egg", "fried rice", "mushrooms", "peas", "quick", "rice", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mushroom Fried Rice with Pickled Ginger", "link": "https://www.seriouseats.com/recipes/2013/01/mushroom-fried-rice-with-pickled-ginger-recipe.html", "description": "if pickled ginger works so well with sushi, there's no reason it can't help out all kinds of other dishes, too. As I found, it manages to add some serious perk to a bowl of fried rice.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chinese", "Dinner Tonight", "Eggs", "Fried Rice", "Ginger", "Legumes", "Mains", "Mushrooms", "Vegetarian"], "recipeIngredient": ["2 tablespoon oyster sauce or vegetarian oyster sauce", "1 1/2 tablespoons light soy sauce ", "1 1/2 tablespoons rice wine ", "4 tablespoons canola oil, divided ", "4 eggs, cracked into a bowl, beaten lightly ", "1/2 pound cremini mushrooms, cleaned, stems removed sliced 1/4-inch thick ", "1/2 pound shiitake mushrooms, cleaned, stems removed sliced 1/4-inch thick ", "2 medium carrots, peeled, cut into 1/4-inch cubes ", "6 cups leftover white rice (break up any clumps with your fingers)", "2 scallions, ends trimmed, green parts thinly sliced ", "1/2 cup frozen green peas", "1/2 cup pickled ginger, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together oyster sauce, soy sauce, and rice wine in a medium-sized bowl. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a tablespoon of the canola oil in a large wok over high heat until smoking. Swirl the oil around to cover the bottom, and pour in the eggs. Stir-fry until eggs are cooked, breaking them up into small pieces with a wooden spoon. Transfer eggs to a bowl and further break into 1/2-inch pieces. Wipe out wok. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return wok to high heat and add another tablespoon oil. Heat until smoking. Swirl the oil around to cover the bottom, and add as many of the mushrooms as will fit in one layer, approximately half. Stir-fry until tender, but before they become too soft, about 1 minute. Transfer to bowl with the eggs, and repeat with remaining mushrooms. Wipe out wok. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return wok to high heat and add remaining tablespoon oil. Heat until smoking. Swirl the oil around to cover the bottom, and add the carrots. Cook until they turn bright orange, about 30 seconds. Add the rice, and stir-fry until very hot, making sure none sticks on the bottom of the wok. Add the cooked eggs and mushrooms, along with the frozen peas. Stir-fry until everything is warm. Pour in the sauce, and stir-fry until the rice is evenly coated, and no remaining sauce is left. Turn off the heat and stir in half the scallions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the fried rice between four plates. Top with a generous helping of pickled ginger, along with some extra scallions if you'd like. Serve immediately.</p>"}]}