{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130320-cookiemonster-lemontulipcookies2.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["cookie monster", "lemon", "quick", "sugar cookies"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Iced Lemon Tulip Cookies", "link": "https://www.seriouseats.com/recipes/2013/03/iced-lemon-tulip-cookies-decorated-for-easter-recipe.html", "description": "For Easter, these lemon sugar cookies are cut out into tulip shapes and decorated in spring colors.", "totalTime": "2 hours", "recipeYield": "makes about 2 dozen 4-inch cookies", "recipeCategory": ["Cookie Monster", "Cookies", "Easter", "Lemon"], "recipeIngredient": ["<strong>For the Cookies</strong>:", "1 1/2 cups (7 1/2 ounces) all purpose flour", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "6 tablespoons unsalted butter, at room temperature", "1/2 cup (3 1/2 ounces) sugar", "1 egg", "1 teaspoon juice a 1 packed tablespoon zest from 1 lemon", " ", "<strong>For Decorating</strong>:", "3 ounces pasteurized egg whites", "3 1/2 to 4 cups confectioners sugar", "Colored sanding sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For The Cookies</strong>:In a medium bowl, whisk together flour, baking powder, and salt; set aside. In the bowl  of a stand mixer fitted with a paddle attachment, beat together butter and sugar until light and fluffy, about 3 minutes. Beat in egg, lemon juice, and lemon zest. Add dry ingredients and mix until just combined. Divide dough in two, wrap each section in plastic wrap, and refrigerate for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle and lower positions and preheat oven to 350&deg;F. Line two baking sheets with parchment paper. Flour a clean work surface. Unwrap one of the balls of dough, leaving the other in the fridge until you are ready to use it. Roll it out until 1/4-inch thick, occasionally picking it up and reflouring the board to avoid sticking. Use your cookie cutter to cut out shapes, then transfer them to the prepared baking sheet. Continue until all dough is used. Bake cookies until golden at the edges, 12 to 15 minutes. Let cool 5 minutes then transfer to a wire rack to finish cooling completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Decorating</strong>: While cookies are cooling, whisk together egg whites and confectioners sugar until smooth. Place colored sanding sugar or sprinkles in a shallow bowl. Use a small knife or brush to cover a cookie with icing, then lightly press cookie, icing side down, onto sprinkles to coat. Repeat with remaining cookies. </p>"}]}