{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130603-greek-cornish-hen-grilled-zucchini-recipe4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "cornish hen", "greek", "grilled chicken", "grilled cornish hen", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Easy Grilled Cornish Hens and Zucchini With Greek Marinade, Tzatziki, and Greek Salad", "link": "https://www.seriouseats.com/recipes/2013/06/easy-grilled-cornish-hen-zucchini-greek-marinade-tzatziki-greek-salad-recipe.html", "description": "Perfectly juicy, crisp, and smoky grilled cornish hens in a garlicky, lemony greek marinade flavored with oregano and peppers. Serve it with grilled zucchini, pita bread, tzatziki, and a greek salad.", "totalTime": "1 hour", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Chicken", "Mains"], "recipeIngredient": ["<strong>For the Tzatziki:</strong>", "1 large cucumber, peeled, seeds removed, grated on the large holes of a box grater (about 3/4 cup)", "1 pint (2 cups) Greek-style yogurt", "2 tablespoons juice from 1 lemon", "2 tablespoons chopped fresh mint leaves", "1/2 cup extra virgin olive oil", "Kosher salt and freshly ground black pepper", " ", "2 Cornish hens, about 1 pound each", "1 tablespoon kosher salt", "1 teaspoon freshly ground black pepper", "2 tablespoons fresh oregano leaves, roughly chopped", "1 tablespoon juice and 2 teaspoons zest from 1 lemon", "3 medium cloves garlic, finely minced", "2 tablespoons extra-virgin oliveo oil", "2 medium or 1 large zucchini, split in half lengthwise", " ", "2 to 3 pocketless Greek-style pitas", "1 recipe <a href=\"http://www.seriouseats.com/2013/06/easy-chopped-greek-salad.html\">Easy Chopped Greek Salad</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tzatziki:</strong> Place cucumber in the center of a clean dish towel and gather edges. Squeeze firmly to remove excess liquid. Transfer cucumber to a bowl. Add yogurt, lemon juice, chopped mint, and olive oil. Season to taste with salt and pepper. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Hens:</strong> Pat hens dry with paper towels and place breast-side-down on a large cutting board. Using sharp kitchen shears, remove the backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten the chicken. For added stability, run a metal or wooden skewer horizontally, entering through one thigh, going through both breast halves, and exiting through the other thigh if desired. Tuck wing tips behind back of breasts. Repeat with remaining hens. Split zucchini in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine salt, pepper, oregano, lemon juice, lemon zest, garlic, and olive oil in a small bowl and stir with fingers until homogenous. Rub mixture evenly over all surfaces of hens and zucchini, washing hands in between.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one half chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to medium-high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place hens skin-side-up directly over the coals. Arrange zucchini around hens. Cover and cook until lightly charred on bottom, about 5 minutes. Carefully flip zucchini and flip birds skin-side-down. Cover and continue to cook until golden brown, crisp, charred in spots, and center of breasts registers 145 to 150°F on an instant read thermometer, about 15 minutes longer. If birds threaten to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and cook until done. Remove birds and zucchini from grill to a cutting board and let rest five minutes. Meanwhile, toast pita bread directly over coals to soften and char slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roughly chop zucchini and split hens in half lengthwise. Serve with warm pita, tzatziki, and greek salad, pulling meat and folding into the pitas with sauce and salad as you go.</p>"}]}