{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130626-256529-british-bites-oat-stuffed-chicken-legs-edit.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "chicken", "oats"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oat-Stuffed Chicken Legs", "link": "https://www.seriouseats.com/recipes/2013/06/british-bites-oat-stuffed-chicken-legs-recipe.html", "description": "This quick chicken dish is a more modern variation of the Scottish preparation sometimes called howtowdie, which features a whole chicken stuffed with oats and served over spinach and poached eggs. Here, I've use exclusively chicken legs and added some quickly sautéed mushrooms to the oat filling. Serve it with some roasted vegetables and a dollop of good mustard for a satisfying, simple supper.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["British Bites", "Chicken", "Mains", "Other Grains"], "recipeIngredient": ["2 tablespoons unsalted butter", "2 medium shallots, finely chopped (about 1/2 cup)", "1 teaspoon dried rosemary", "10 ounces button mushrooms, chopped into 1/4 inch pieces", "1/2 cup rolled oats", "1/2 cup chicken stock", "Kosher salt and freshly ground black pepper", "2 medium onions, chopped (about 2 cups)", "2 tablespoons olive oil", "4 chicken legs, thigh bone removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 425º. Heat butter in a large skillet over medium high heat until melted. Add shallots and cook until beginning to brown, about 4 minutes. Add rosemary, and chopped mushrooms. Cook stirring often until mushrooms release their liquid and begin to brown, about 8 minutes. Add oats and toast for 1 minutes then add chicken stock and cook until liquid has been absorbed, about 4 minutes.  Remove from heat and season to taste with salt and pepper. Allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place onions in the bottom of a roasting pan and toss with olive oil. Season with salt and pepper. Divide the filling between the pocket of each chicken thigh where the bone was removed. Place chicken on top of onions seam side down and roast until the chicken is golden brown and an instant read thermometer inserted into thickest part of thigh registers 165°F, about 25 minutes. Remove from oven and let rest for 10 minutes before serving.</p>"}]}