{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130307-243536-chocolate-decadence-cake.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["buttercream", "cake", "chocolate", "chocolate cake", "ganache", "layer cake", "let them eat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Chocolate Decadence Cake", "link": "https://www.seriouseats.com/recipes/2013/03/chocolate-decadence-cake-triple-chocolate-cake-recipe.html", "description": "As far as chocolate cakes go, this one is the ultimate in decadence, hence its name. The moist cake is hugged tightly by smooth buttercream, and thick blanket of ganache on top seals the goodness in with a kiss. There's no escaping this cake, so don't even try.", "totalTime": "2 hours", "recipeYield": "Makes one 9-inch cake", "recipeCategory": ["Cakes", "Chocolate", "Let Them Eat..."], "recipeIngredient": ["Butter for greasing", "2 cups (about 8 ounces) sifted cake flour", "1 cup (about 4 ounces) Dutch process cocoa powder ", "1 tablespoon instant espresso powder", "1 teaspoon baking soda", "1/2 teaspoon baking powder", "1 teaspoon salt", "3/4 cups (about 5 1/3 ounces) granulated sugar", "3/4 cups (about 7 1/4 ounces) packed brown sugar", "1 cup (2 sticks, 8 ounces) unsalted butter, at room temperature", "3 large eggs", "1 1/2 cups (12 ounces) sour cream ", "1 teaspoon vanilla extract", "1/2 cup (8 ounces) sour milk or buttermilk", "3 cups of <a href=\"http://www.williams-sonoma.com/recipe/quick-chocolate-buttercream-frosting.html\">chocolate buttercream frosting</a>", "3 cups of <a href=\"http://savorysweetlife.com/2010/03/buttercream-frosting/\">vanilla buttercream</a> frosting", "2 cups of <a href=\"http://www.theculinarylife.com/2009/easy-chocolate-ganache-recipe/\">chocolate ganache</a>, gently warmed and of pouring consistency"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 325°F. Grease three 9-inch cake pans generously with butter and dust with flour. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, stir together flour, cocoa, espresso powder, baking soda, baking powder, and salt. Set aside. Use an electric mixer or stand mixer fitted with a paddle attachment to cream together white sugar, brown sugar, and butter, beating until light and airy (about 3 minutes). Add eggs one at a time, incorporating entirely before adding the next. Beat in sour cream and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one third of the dry ingredients to the wet, then half of the sour milk or buttermilk, beating well. Add the second third of the dry ingredients, followed by the rest of the sour milk, again beating well. Add the rest of the dry ingredients and mix just until there are no more white whisps of flour. Divide the batter evenly between the three cake pans and bake until a toothpick inserted in the middle of the cake comes out clean, about 30 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow cakes to sit in the pans for 10 minutes before turning them out onto a cooling rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To construct the cake</strong>: Level each cake with <a href=\"http://www.amazon.com/gp/product/B00004S7YB?tag=serieats-20\">a cake leveler</a> so they are perfectly flat. Set your first layer of cake on a cake board and apply half of the chocolate buttercream to the top, smoothing it around the surface with an offset spatula. Stack the second layer of cake on top and apply the rest of the chocolate buttercream to the top, again smoothing it perfectly with an offset spatula. Top with the third layer of cake and apply a small amount of pressure to the cake to gently compress the layer. Don't press too hard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply half of the vanilla buttercream to the sides of the cake only, creating a crumb coat. Set the cake in the refrigerator for 15 minutes. After the icing has chilled, apply the remaining vanilla buttercream to just the sides of the cake. Use an offset spatula heated under warm water and then wiped dry to smooth the vanilla buttercream to a fine finish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the cake onto a cooling rack that has been placed over a rimmed baking sheet. Carefully pour the warm ganache into the center of the cake, allowing it to run out and cover the top of the cake. Stop pouring once the ganache reaches the edges of the top, and allow some&mdash;but not a lot&mdash;of the ganache to dribble down the sides. Set the cake in the refrigerator to firm up for 1 hour. This cake will stay fresh for up to three days if well sealed and kept in the refrigerator.</p>"}]}