{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130723-beet-green-pesto.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["beets", "pasta", "radishes", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beet Green and Radish Green Pesto Pasta With Roasted Beets and Radishes", "link": "https://www.seriouseats.com/recipes/2013/07/beet-and-radish-green-pesto-pasta-recipe.html", "description": "Many people cook with beet greens, incorporating them into soups and stews, but radish greens, which have a soft texture and peppery bite, are totally underutilized. Ground with olive oil, walnuts, and garlic, the greens are bolder and spicier than your average basil pesto, but just as versatile.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Mains", "Pasta", "Vegetarian"], "recipeIngredient": ["3 medium beets, with greens", "1 bunch radishes, with greens", "About 3/4 cup plus 2 tablespoons extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "1/2 cup toasted walnuts", "6 medium cloves garlic, peeled and smashed", "1/4 cup grated Parmesan cheese", "1 pound box spaghetti or cappellini "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400°F. Prepare beets and radishes: tear off greens and reserve. Peel beets and cut beets and radishes into a medium dice. Place beets and radishes on a rimmed baking sheet in separate piles (to avoid color bleeding); season each vegetable with 1 tablespoon olive oil and salt and pepper to taste. Toss to coat and roast, stirring occasionally, until tender, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While vegetables are roasting, blanch greens: pick off any large stems and bring a large, covered pot of salted water to a boil. Prepare an ice bath for greens by filling a medium bowl with cold water and a tray of ice cubes. Add greens and cook, pushing on them to submerge, until bright green, about 1 minut. Transfer to ice bath immediately using tongs. Return pot of water to a boil. When greens are cool, drain, then wring thoroughly with your hands to remove excess liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place walnuts and garlic in bowl of food processor and season to taste with salt and pepper. Pulse until nuts and garlic are coarsely ground. Add beet and radish greens and pulse until mixture is coarsely ground. With machine running, stream in 3/4 cup olive oil or more, as needed, until pesto is sufficiently loose. Add Parmesan cheese, pulsing to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pasta in boiling water until al dente, 10 to 12 minutes. Before draining, reserve 1 cup pasta water. Combine pasta and about 3/4 cup prepared pesto in a large bowl. Drizzle in some pasta water and toss to combine using tongs, adding more pesto or pasta water as necessary. Transfer pasta to serving dish and top with roasted beets and radishes. Serve immediately.</p>"}]}