{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130318-245123-dinner-tonight-bibimbap-bacon-kimchi-spinach-2-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Korean", "keywords": ["Bibimbap", "Dinner Tonight", "Korean", "quick", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bibimbap with Bacon and Kimchi", "link": "https://www.seriouseats.com/recipes/2013/03/bibimbap-bacon-kimchi-recipe.html", "description": "Bibimbap is not a strict dish, and a number of different ingredient combinations work. So, I decided to pick an assortment that would still provide all the contrast and color that I crave without taking multiple hours to prepare.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Korean", "Mains", "Rice"], "recipeIngredient": ["1 cup brown rice", "1/4 cup Korean red pepper paste (gochujang)", "1 tablespoon sugar", "1 tablespoon sesame oil ", "1 tablespoon toasted sesame seeds ", "4 ounces bacon, chopped ", "2 medium cloves garlic, minced (about 2 teaspoons)", "1/4 teaspoon red pepper flakes ", "1/2 pound mushrooms (cremini or shiitake), cleaned, stems removed, caps sliced", "1 cup bean sprouts ", "1 pound spinach, stems removed ", "4 eggs", "1 cup kimchi, drained and sliced ", "1 carrot, julienned ", "1/2 head red cabbage, thinly sliced", "8 (2- by 4-inch) sheets toasted nori", "2 scallions (green parts only), sliced "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss brown rice in a mesh strainer and rinse under cold water. Transfer to a rice cooker and cover with 1 1/2 cups water and a pinch of salt. Turn the rice cooker on. It usually takes somewhere between 30 and 45 minutes to cook. If rice is not done, add another 1/2 cup of water and cook until tender. Fluff with a fork when done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium bowl stir together red pepper paste, sugar, sesame oil, and three tablespoons water. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon to a 12-inch cast iron or non-stick skillet and cook over medium heat, stirring occasionally, until crisp and fat has rendered, about 5 minutes. Remove pieces with a slotted spoon and transfer to paper towels, leaving behind the fat in the skillet. Use a spoon to carefully remove all but one tablespoon of the fat, keeping the extra in a small bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With heat still on medium, add garlic and red pepper flakes. Cook until fragrant, about 30 seconds. Add mushrooms, stir well, and spread out into a single layer. Cook the mushrooms, stirring occasionally, until tender and browned, 3 to 5 minutes. Remove mushrooms and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a tablespoon of reserved bacon fat to the skillet and add bean sprouts. Cook, stirring occasionally, until lightly browned, about 2 minutes. Remove and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a tablespoon of reserved bacon fat (or vegetable oil if you're out of fat) to the skillet and add the spinach. Sprinkle with salt, and toss spinach in the fat with a pair of tongs. Cook until spinach has wilted, but still has some body, about 30 seconds. Sprinkle with a teaspoon of the sesame seeds. Remove and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When brown rice is done, divide between four large bowls. Around the edges of the inside of the bowl, start add the toppings on in any order you'd like. The final list includes mushrooms, bean sprouts, spinach, kimchi, carrot, red cabbage, and nori. Drizzle on some of the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finally, add two tablespoons of bacon fat (or vegetable oil if you're out) to the skillet set over medium heat. Crack in the eggs and cook until the whites are set, but the yolk is still runny. Transfer a cooked egg to the center of each bowl. Garnish with scallions and sesame seeds. Serve with remaining sauce. </p>"}]}