{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131212-266259-gingernanaimo2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["bar cookie", "cookie", "gingerbread", "holiday dessert", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gingerbread Nanaimo Bars", "link": "https://www.seriouseats.com/recipes/2013/12/gingerbread-nanaimo-bars.html", "description": "This version of the Nanaimo bar is dressed up for the holidays with a gingerbread base and a \"blonde\" white chocolate topping. The spicy gingerbread works superbly with the classic Nanaimo bar filling, which is made with Bird's custard powder, an ingredient which can typically be found in the International aisle of grocery stores (with the British imports). These bars are very sweet, very rich, and very perfect for holiday parties or cookie exchanges. If you feel like overdoing it in a very pleasurable way, go ahead and pair them with eggnog.", "totalTime": "2 hours", "recipeYield": "Makes 24 small bars", "recipeCategory": ["Brownies and Bars", "Cakespy"], "recipeIngredient": ["<Strong>For the Base</strong>", "1/2 cup (1 stick) unsalted butter", "1 1/4 cups (about 4 ounces) finely crumbled gingerbread cookies (or gingersnaps)", "1/2 cup (about 1 7/8 ounces) finely chopped pecans", "1 cup (about 3 ounces) flaked coconut", " ", "<strong>For The Middle Layer</strong>", "1/2 cup (1 stick) unsalted butter", "2 tablespoons cream", "2 tablespoons Bird's custard powder (instant vanilla pudding powder works, too)", "2 cups (about 8 ounces) confectioners' sugar", " ", "<strong>For the Topping</strong>", "4 ounces white chocolate ", "1/4 cup (about 1 ounce) coarsely crumbled gingerbread cookies (or gingersnaps)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare bottom layer:</strong> Melt the butter in a large saucepan. Add crumbled cookies, coconut, and pecans. Stir until combined. Press down firmly into a well greased and parchment-lined 8- x 8-inch pan; try to make the mixture as flat as possible in the pan. Let cool for about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the middle layer:</strong> in a stand mixer fitted with the paddle attachment, cream the butter, cream, custard powder, and confectioners' sugar together until very light and fluffy. Spread over the bottom layer, taking care to spread it as flat and evenly as possible. Place the pan in the refrigerator while you prepare the topping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the top layer:</strong> in a medium saucepan or double boiler, melt the white chocolate over low heat until it is pourable. Remove from heat. Pour it over the second (middle) layer and gently spread it with a spatula to ensure even coverage (but work carefully, because the warm chocolate will begin to set quickly once it hits the chilled layer below, and if you are too forceful, you will tear up the delicate custard layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately after adding the white chocolate topping, garnish with the additional crumbled cookies. Score the bars to make slicing them easier once the chocolate sets. Chill for 30 minutes or until the topping is set before cutting into bars.</p>"}]}