{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130510-bakethebook-proseccojelly.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "boozy desserts", "elderflower", "home made summer", "jelly", "melon", "Prosecco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Prosecco and Elderflower Jelly with Melon", "link": "https://www.seriouseats.com/recipes/2013/05/prosecco-and-elderflower-jelly-with-melon.html", "description": "According to <strong><em>Home Made Summer</em></strong> author Yvette van Boven, every children's party in Ireland served jelly and cream for dessert. The combination wasn't a favorite, but the memory of refreshingly jiggly jelly stuck. This version has a flowery, delicate flavor bubbled up with prosecco. Adding edible flowers is the final, lovely touch.", "totalTime": "", "recipeYield": "fills a 4-cup (1L) gelatin mold", "recipeCategory": ["Bake the Book", "Melon", "Puddings and Custards"], "recipeIngredient": ["4 sheets unflavored gelatin", "2 tbsp elderflower syrup", "1 cup (200 g) sugar", "3 cups (700 ml) prosecco (Italian sparkling wine)", "1 cantaloupe or honeydew melon", "Edible (white) pansies (available at specialty grocers), or unsprayed rose petals, daisies, or edible white carnations"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the gelatin sheets in a small saucepan and cover with cold water. Let stand for 5 minutes to soften. Remove the sheets from the pan and squeeze out excess water. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate saucepan over medium-high heat, combine the elderflower syrup with 1 1/4 cups (300 ml) water and the sugar and boil it down for about 10 minutes. Remove from the heat. Stir the softened gelatin sheets into the syrup, let it cool slightly, then add the prosecco and stir well. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop small balls from the melon. Put them in a 4-cup (1 liter) mold or bowl. Add the flowers. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the gelatin liquid, cover the bowl with plastic wrap, and place in the fridge for at least 4 hours to firm up. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To get the jelly out of its mold, fill a larger bowl with hot water. Gently lower the mold into the water to warm it. Not too long, or the jelly will melt, and make sure the water doesn’t overflow into the mold, as that will melt the jelly as well. When you see the sides come loose, it’s time. Place a plate upside down on the mold, invert it, and the jelly should slowly and carefully slide out of its bowl. If that doesn’t work, warm the mold a little longer and try again. Serve immediately. Without cream.<br />\r\n </p>"}]}