{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130112Londonfoglemon.jpg", "author": {"@type": "Person", "name": "Jeff Lucas"}, "recipeCuisine": "", "keywords": ["cocktails", "milk punch", "punch", "rum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "London Fog Milk Punch", "link": "https://www.seriouseats.com/recipes/2013/01/london-fog-english-milk-punch-curdled-milk-rum-punch-with-tea-recipe.html", "description": "Before the Bourbon Milk Punch (made famous in New Orleans), there was English Punch. Don't be afraid of the curdled milk&mdash;think of it as a science experiment. A very delicious science experiment.", "totalTime": "36 hours", "recipeYield": "Serves 10", "recipeCategory": ["Rum"], "recipeIngredient": ["<strong>For Vanilla Simple Syrup:</strong>", "2 cups water ", "2 cups sugar ", "1 vanilla bean, split", " ", "<strong>For Rum Mix:</strong>", "1 (750 milliliter) bottle white rum (such as Ron Barcelo)", "2 tablespoons loose Earl Grey tea", "1 cup lemon juice from about 8 lemons", " ", "<strong>For the Milk Mix:</strong>", "2 cups whole milk ", "2 cinnamon sticks ", "7 whole cloves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Vanilla Simple Syrup:</strong> Combine sugar and water on medium heat until the sugar is dissolved. Remove from heat. Scrape seeds from vanilla bean into syrup and add scraped split pod. Set aside for 1 hour. Vanilla syrup can be stored in a sealed container in the refrigerator for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Rum Mixture:</strong> Combine loose tea and rum in a glass container and allow to infuse for 4 hours at room temperature. Periodically shake the mixture so that it is thoroughly mixed. Strain through a fine mesh strainer and discard leaves. Rum can be stored in a sealed container in a dark, cool cabinet for up to 3 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pitcher or bowl, add vanilla syrup to infused rum and stir well to combine. Add lemon juice and stir again. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Milk Mixture:</strong> In a medium saucepan heat milk, cinnamon stick, and cloves over medium heat, stirring occasionally, until it reaches 180°F (milk should be steaming with small bubbles beginning to form around the edges). Pour hot milk into the rum mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside until mixture curdles, about 30 minutes at room temperature. Strain the mixture through a fine mesh strainer lined with several layers of cheesecloth. Do not remove the curd while straining as it acts an additional filter. Discard curds. Milk punch can be stored in a sealed container in the refrigerator for up to 1 month. Strain again before serving if desired. Serve over ice.</p>"}]}