{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130204-239233-chicken-green-bean-yellow-chili-stir-fry-recipe.jpg", "author": {"@type": "Person", "name": "Leela Punyaratabandhu"}, "recipeCuisine": "Thai", "keywords": ["chicken", "green beans", "long beans", "my thai", "quick", "stir fry", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken-Green Bean Yellow Chili Stir-Fry", "link": "https://www.seriouseats.com/recipes/2013/02/chicken-green-bean-yellow-chili-stir-fry-recipe.html", "description": "This quick and easy Thai-style chicken and long bean stir-fry flavored with fish sauce, chilis, and kaffir lime comes together in under fifteen minutes and uses a simmering/reducing technique that packs in the flavor without overwhelming your kitchen with smoke.", "totalTime": "15 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Legumes", "Mains", "Stir Frying", "Thai"], "recipeIngredient": ["4 yellow or red jalapeño or Serrano peppers", "2 tablespoons vegetable oil", "3/4 pound chicken breasts or tenderloins, cut against the grain into bite-size pieces", "2 large cloves garlic, peeled and minced (about 1 tablespoon)", "1 tablespoon fish sauce (more or less to taste)", "1 tablespoon oyster sauce", "1/4 cup homemade or store-bought low-sodium chicken stock", "1/2 teaspoon granulated sugar", "1/3 pound long beans or green beans, trimmed and cut crosswise into 1/4-inch pieces ", "4 to 5 fresh <a href=\"http://en.wikipedia.org/wiki/Kaffir_lime\">makrut</a> lime leaves, hand-torn into pieces and lightly bruised"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut yellow chilies crosswise into 1/2-inch pieces and pound them in a mortar until they're broken up into small chunks, about 1/4-inch in size; set aside. (If you don't have a mortar, place cut-up chilies in a plastic zipper bag, seal bag well and get rid of trapped air, wrap bag with a kitchen towel, then pound on it with a meat tenderizer or something heavy.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 10- or 12-inch skillet over medium-high heat. Add chicken, minced garlic, fish sauce, oyster sauce, chicken stock, and sugar. Cook, stirring occasionally, until chicken is almost cooked through, 2 to 3 minutes. Add long beans, crushed chilies, and kaffir lime leaves. Continue to stir-fry until chicken is cooked through and long beans are still crisp and retain their green color, 1 to 2 minutes longer. Season to taste with more fish sauce if desired. Transfer to a serving platter and serve with steamed rice.</p>"}]}