{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130316-243714-sunday-brunch-potato-knish.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["baking", "bread", "knish", "potato", "Sunday Brunch", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato Knish", "link": "https://www.seriouseats.com/recipes/2013/03/potato-knish-recipe.html", "description": "Filling potato turnovers that reheat easily.", "totalTime": "2 hours 15 minutes", "recipeYield": "Makes 8 knishes", "recipeCategory": ["Breakfast and Brunch", "Potato", "Vegetarian"], "recipeIngredient": ["<strong>For the Dough:</strong>", "2 1/2 cups (12 1/2 ounces) all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon kosher salt", "1 egg, beaten", "1/2 cup vegetable oil", "1 teaspoon lemon juice from 1 lemon", "1/2 cup water", " ", "<strong>For the Filling:</strong>", "1 pound russet potatoes, peeled and cut into 1 inch pieces (about 3 medium)", "Kosher salt and freshly ground black pepper", "2 tablespoons butter", "1/2 cup finely sliced scallion whites and greens (about 4 scallions)", "1 egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> In a large bowl combine flour, baking powder, and salt and whisk to combine. In a separate bowl whisk together egg, vegetable oil, lemon juice, and water. Pour wet ingredients over dry and using a wooden spoon mix until a dough forms. Using your hands knead until dough comes together and is smooth, about 1 minute. Wrap dough tightly with plastic wrap and let sit for 1 hour at room temperature or up to overnight in the refrigerator. Allow to come to room temperature before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> In a large pot cover the potatoes with water, season well with salt, and bring to a simmer. Cook until potatoes are easily pierced with a knife, about 10 minutes. Drain potatoes and let dry for a few minutes before adding the butter and mashing until almost smooth. Add scallions and mix, then season to taste with salt and pepper.  Allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 375&deg;F. Line a baking sheet with foil or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half and roll it out into a wide, thin rectangle, less than 1/4-inch thick. Divide half the filling into 4 balls and place them along the bottom of the dough. Loosely roll the dough around the filling balls then twist and pinch off the dough between each ball. Leaving one end of each knish open, pinch the dough on the opposite end of the knish until sealed and place the knish sealed side down on the baking sheet and press gently on the top to form a short, squat roll. Repeat with remaining dough and filling then brush the knishes with beaten egg. Bake until golden, about 45 minutes. Serve immediately.</p>"}]}