{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131024-turkey-porchetta-recipe-thanksgiving-17.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["low carb", "porchetta", "thanksgiving", "turchetta", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "8"}, "name": "Turkey Porchetta", "link": "https://www.seriouseats.com/recipes/2013/11/turkey-porchetta-food-lab-recipe.html", "description": "Deeply seasoned, easy to slice, juicier than any turkey breast you've ever tasted, bone-free, and covered in crisp skin, if the best flavor is what you're going for, this is truly the ultimate Thanksgiving roast.", "totalTime": "up to 2 days", "recipeYield": "Serves 5 to 6", "recipeCategory": ["Christmas", "Mains", "Thanksgiving", "The Food Lab", "Turkey"], "recipeIngredient": ["Kosher salt and freshly ground black pepper, plus 1/2 tablespoon whole black peppercorns", "1/4 cup fresh sage leaves", "4 medium cloves garlic", "1/2 tablespoon whole fennel seeds", "1/2 teaspoon red pepper flakes", "1 whole bone-in, skin-on turkey breast (about 4 to 5 pounds), patted dry", "2 tablespoons canola oil", "1 quart low sodium homemade or store-bought chicken or turkey stock", "1 small carrot, roughly chopped", "1 large stalk celery, roughly chopped", "1 medium onion, roughly choppped", "2 bay leaves", "2 tablespoons unsalted butter", "2 tablespoons flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 2 teaspoons kosher salt, whole black peppercorns, sage leaves, garlic, fennel seed, and red pepper flakes in the bowl of a food processors. Process until a rough paste is formed, scraping down sides as necessary, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove skin from the turkey breast and lay it flat. Reserve the carcass for gravy. Using your hands and a boning knife, carefully remove the breast meat from the carcass. Set aside the tenderloins for another use. Follow the <a href=\"http://www.seriouseats.com/2013/11/the-food-lab-turkey-porchetta-thanksgiving-recipe-slideshow.html\" target=\"_blank\">slideshow here</a> for step-by-step photos.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay one breast half on top of the turkey skin and butterfly the thicker end by cutting through it horizontally with a boning knife, leaving the last 1/2 inch intact, then folding out the flap. Repeat with the other breast half. Follow the <a href=\"http://www.seriouseats.com/2013/11/the-food-lab-turkey-porchetta-thanksgiving-recipe-slideshow.html\" target=\"_blank\">slideshow here</a> for step-by-step photos.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a series of parallel slashes at 1-inch intervals in the turkey meat cutting about 1/2 inch into the meat. Repeat with a second series of slashes perpendicular to the first. Rub the spice/herb mixture into the meat, making sure to get it into all of the cracks. Follow the <a href=\"http://www.seriouseats.com/2013/11/the-food-lab-turkey-porchetta-thanksgiving-recipe-slideshow.html\" target=\"_blank\">slideshow here</a> for step-by-step photos.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully roll of the turkey meat into a tight cylinder, using the skin to completely enclose it. Tie the roast tightly with butcher's twine at 1-inch intervals, as well as once lengthwise. Transfer the roast to a wire rack set in a rimmed baking sheet, cover loosely with plastic wrap, and refrigerate at least 6 hours and up to 2 days. Follow the <a href=\"http://www.seriouseats.com/2013/11/the-food-lab-turkey-porchetta-thanksgiving-recipe-slideshow.html\" target=\"_blank\">slideshow here</a> for step-by-step photos.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey rests, make the gravy. Roughly chop the carcass with poultry shears or a heavy cleaver. Heat 1 tablespoon canola oil in a large saucepan over high heat until shimmering. Add turkey carcass and cook, stirring occasionally, until well browned, about 8 minutes. Add carrots, celery, and onion, and cook, stirring frequently, until lightly browned, about 5 minutes longer. Add chicken stock, bay leaves, and enough water to barely cover bones. Bring to a boil, reduce to a simmer, and cook for 2 hours. Strain through a fine mesh strainer, discard solids, and spoon any fat off the surface. Return to a saucepan and simmer until reduced to about 3 cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a medium saucepan over medium heat. Add flour and cook, stirring with a whisk, until deep golden brown, about 3 minutes. Slowly whisk in turkey broth. Bring to a simmer to thicken lightly, then season with salt and pepper. Let cool and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, adjust an oven rack to center position and preheat oven to 275°F. Season exterior of turkey lightly with salt and pepper. Heat remaining tablespoon canola oil in a large cast iron or stainless steel skillet over high heat until shimmering. Add turkey and cook, turning occasionally, until well-browned on all sides, about 8 minutes total. Transfer turkey to a wire rack set in a rimmed baking sheet and transfer to oven. Roast until thickest part of turkey registers 145 to 150°F on an instant-read thermometer, about 2 hours. Remove from oven, transfer to cutting board, and let rest for 10 minutes. Meanwhile, reheat gravy. Snip off twine using poultry shears. Carve and serve with hot gravy.</p>"}]}