{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130328-246162-easter-egg-cake-slicing-layers.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "cakes", "chocolate dessert", "chocolate frosting"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easter Egg Cake", "link": "https://www.seriouseats.com/recipes/2013/03/easter-egg-cake-recipe.html", "description": "This recipe is inspired by a <a href=\"http://pinterest.com/pin/2674080999410498/\">1950s Swan's Down Cake ad</a> I discovered via Pinterest. The beauty of it is that you can make it however you please, just choose your favorite cake and frosting recipe; it's all about how you assemble and decorate the cake.", "totalTime": "2 hours", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Cakes", "Easter"], "recipeIngredient": ["<strong>For the Cake:</strong>", "2 (8-inch) round layer cakes such as this <a href=\"http://www.seriouseats.com/recipes/2011/08/yellow-birthday-cake-recipe-chocolate-ganache-frosting-flour-bakery.html\">Yellow Birthday Cake</a> from <i>Flour</i> by Joanne Chang, or your favorite boxed cake mix", " ", "<strong>For the Chocolate Frosting</strong>:", "20 tablespoons (2 1/2 stickes) unsalted butter, slightly softened", "12 ounces (about 2 cups) confectioner’s sugar", "12 ounces 72% cacao chocolate, melted in a double boiler or microwave-safe bowl", "1 (12.6 ounce) bag of Easter M &amp; Ms (I used the dark chocolate ones)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Prepare <a href=\"http://www.seriouseats.com/recipes/2011/08/yellow-birthday-cake-recipe-chocolate-ganache-frosting-flour-bakery.htm\">Yellow Birthday Cake</a> or favorite boxed cake mix as 2 (8-inc) round cakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting:</strong> In the bowl of an electric stand mixer beat butter and sugar on medium speed until well combined, scraping down the sides as necessary. Add melted chocolate beating until thoroughly combined. Conitnue beating until easily spreadable. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Cake:</strong> Using a sharp knife, carefully split the cooled cake layers horizontally so that you have four full layers. Stacking the layers on top of each other, cut the layers about 3/4 inch off center so you have four large pieces and four smaller pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread each layer with enough frosting to hold the layers together and assemble and arrange the layers on a large platter in the upright position (cut side-down). The four larger layers will make up the center of the cake with two smaller layers on each side. Be sure to save the two domed small top layers for the very outer pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once layers are arranged, use a sharp knife to carefully trim the outer edges into a more egg-like shape. You can adhere the trimmed pieces with frosting if desired to add additional shaping (I added a little piece that had been trimmed off the edge to the \"tip\" of the egg to give it a more rounded look).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the outside of the cake with remaining frosting and decorate with M&Ms in whatever pattern you desired. To create the striped egg effect I first sorted all of the M&Ms by color then applied them in thick stripes.</p>"}]}