{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/091613-266393-cook-the-book-mussels-fra-diavolo.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Italian", "keywords": ["Cook the Book", "Italian", "mussel", "seafood", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mussels Fra Diavolo with Roasted Garlic from 'The Catch'", "link": "https://www.seriouseats.com/recipes/2013/09/ben-sargent-mussels-fra-diavolo-with-roasted-garlic-from-the-catch.html", "description": "Mussels are pretty much my default shellfish. They're easy to cook, easy to eat, and taste of little more than the sweet, briny ocean. In <strong>Ben Sargent</strong>'s Mussels Fra Diavolo from his new cookbook, <em><a href=\"http://www.amazon.com/The-Catch-Sea-Table-Recipes/dp/0307985520/?tag=serieats-20\" target=\"_blank\">The Catch</a></em>, the usual diavolo players (chili flakes, tomatoes, white wine) are present, but it's the uncommon addition of roasted garlic that makes the dish memorable.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Clams, Mussels, and Oysters", "Cook the Book", "Italian", "Mains"], "recipeIngredient": ["2 large heads garlic, top quarter cut off", "6 tablespoons olive oil", "Salt and freshly ground black pepper", "1 bunch scallions, finely chopped", "1 teaspoon chile flakes or 1 habanero chile, finely chopped", "3 large plum tomatoes, finely chopped", "3/4 cup dry white wine", "4 pounds mussels, scrubbed", "1/2 cup chopped fresh basil or flat-leaf parsley", "Toasted baguette slices, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Put the garlic in a small baking dish, cut sides up, and drizzle the cut sides of the garlic with 1 tablespoon of the olive oil, then season with salt and pepper. Cover and bake for about 1 hour, until very soft. Squeeze the soft garlic from the papery skins into a small bowl. Stir in 2 tablespoons of the olive oil and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, heat the remaining 3 tablespoons of olive oil. Add the scallions and chile flakes, and cook over medium heat for 2 minutes. Add the tomatoes, cover, and cook until the tomatoes dissolve, about 4 minutes. Raise the heat to medium-high and add the garlic purée and the wine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the scallion-garlic mixture to a boil and add the mussels. Cover and cook, shaking the pot a few times, until the mussels open, about 5 minutes. With a large slotted spoon or Chinese wire strainer, lift the open mussels from the pot and transfer to serving bowls. Discard any mussels that do not open.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat. Season the sauce with salt and pepper and add the basil. Pour the sauce over the mussels and serve right away with toasted baguette slices.</p>"}]}