{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130828-bakethebook-coffeebrownies.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Balaboosta", "brownie", "cardamom", "chocolate", "coffee", "espresso"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Turkish Coffee Brownies", "link": "https://www.seriouseats.com/recipes/2013/09/turkish-coffee-brownies-recipe-balaboosta.html", "description": "A spoonful of cardamom added to espresso powder gives these brownies a decidedly Middle Eastern flavor. Perfect as a post-meal pick-me-up, or to keep your dinner guests perked.", "totalTime": "45 minutes", "recipeYield": "makes about 16 pieces", "recipeCategory": ["Bake the Book", "Chocolate", "Cookies"], "recipeIngredient": ["8 tablespoons (1 stick) unsalted butter, plus butter for the pan", "2/3 cup all-purpose flour, plus flour for the pan", "3 ounces 72% cacao chocolate ", "3 large eggs", "3/4 cup sugar", "1 1/4 teaspoons ground espresso beans, or instant espresso powder", "1 teaspoon ground cardamom", "1 teaspoon vanilla extract", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Grease the sides and bottom of an 8-inch square baking pan with butter and coat lightly with flour.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the chocolate and the 8 tablespoons butter in a small bowl over a pot of barely simmering water. Meanwhile, whisk the eggs and sugar together in a large bowl until the mixture is fluffy and pale yellow. Whisk in the espresso, cardamom, vanilla, and salt until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the melted chocolate and butter from the heat and stir with a rubber spatula. Then very slowly add the chocolate to the egg mixture and mix until thoroughly combined. Sift the 2/3 cup flour into the batter and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the brownie batter into the greased pan and use a rubber spatula to scrape out all that chocolate goodness. This is the part where I usually lick the spatula if no one is looking. Bake the brownies in the oven for 25 to 30 minutes. You can check for doneness by sticking a toothpick right in the middle. If it comes out clean, you’re only seconds away from chocolate heaven. Cool the brownies before cutting.</p>"}]}