{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131106-brussels-sprouts-grilled-cheese-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brussels sprouts", "cheese", "easy", "grilled cheese", "quick", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brussels Sprouts Grilled Cheese Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/12/brussels-sprouts-grilled-cheese-sandwiches-recipe.html", "description": "Grilled cheese sandwiches with nutty charred brussels sprouts and sweet, lightly caramelized onions.", "totalTime": "40 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Cheese", "Mains", "Sandwiches"], "recipeIngredient": ["4 teaspoons extra-virgin olive oil", "1 small onion, finely sliced", "Kosher salt and freshly ground black pepper", "1 1/2 cups finely shredded brussels sprouts (about 6 ounces)", "4 slices hearty sourdough or French bread", "6 ounces sharp cheddar cheese, sliced", "3 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 teaspoons olive oil in a medium cast iron pan or skillet over medium heat until shimmering. Add onions, season with salt and pepper, and cook, stirring frequently, until golden brown, 15 to 20 minutes. Transfer to a bowl and wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to high heat and add remaining 2 teaspoons oil. Heat until lightly smoking. Add brussels sprouts, season with salt and pepper, and cook, tossing and stirring occasionally, until wilted and lightly charred, about 2 minutes. Transfer to bowl and wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread onions and sprouts over one side of two slices of bread. Top with cheddar cheese and remaining two slices of bread. Melt 1 1/2 tablespoons butter in same skillet over medium-low heat. Swirl to coat pan. Add sandwiches. Place a skillet on top of them and press down gently. Cook, turning pan and moving sandwiches occasionally until well browned on first side, about 4 minutes. Remove from skillet with a flexible metal spatula. Melt remaining 1 1/2 tablespoons butter. Return sandwiches to skillet uncooked-side-down and continue cooking, turning pan and moving sandwiches occasionally until well browned and cheese is melted, about 4 minutes longer. Serve immediately.</p>"}]}