{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130407-wonton-soup-food-lab-13.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "dumpling", "soup", "The Food Lab", "wonton", "wonton soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Homemade Wonton Soup", "link": "https://www.seriouseats.com/recipes/2013/04/homemade-wonton-soup-recipe.html", "description": "A classic wonton soup made with Chinese superior stock flavored with chicken, pork, ham, and shrimp. The wontons are stuffed with a mixture of pork and shrimp. The shrimp are brined in a solution of salt and baking soda to make them extra crisp.", "totalTime": "3 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Pork", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["<strong>For the Broth</strong>:", "2 pounds chicken backs, wingtips, and/or bones. roughly chopped with a cleaver", "1 1/2 pound pig's trotters, split or sliced", "3 ounces Chinese ham or prosciutto", "1 (3- by 4-inch) square piece of kombu (see note)", "1 ounce dried shrimp or stockfish (optional)", "8 scallions, whites and greens reserved separately", "1 (4-inch) knob fresh ginger, sliced, plus 2 teaspoons grated fresh ginger", "12 leaves napa cabbage, cut into 2-inch pieces, divided", "Kosher salt", "&nbsp;", "<strong>For the Wontons</strong>:", "24 small shrimp, shells removed and reserved", "1/2 teaspoon baking soda", "3/4 pound ground pork", "2 teaspoons sugar", "1 teaspoon soy sauce", "2 teaspoons sesame oil", "1/2 cup sliced yellow chives, divided (see note)", "24 wonton wrappers (thin variety preferred)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Broth</strong>: Combine chicken, pork trotters, and ham in a large stockpot and cover with water. Bring to a boil over high heat. Boil for 10 minutes, then dump contents into the sink and liet liquid drain. Clean bones and meat until cold running water, rubbing off any scum or blood clots that may appear and return to the stockpot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill stockpot with cold water until water is about 1 inch above the surface of the bones. Add kombu, dried shrimp (or stockfish), scallion whites, 4-inch knob of sliced ginger, and 4 cabbage leaves. (If using shell-on shrimp for the wontons, add the removed shells to the broth as well). Bring to a boil over high heat, reduce to a bare simmer, and cook, uncovered, until broth is deeply flavorful, about 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, discard bones from broth. Strain through a fine mesh strainer into a large saucepan. Defat broth with a ladle if using the same day. Broth can also be transfered to sealed containers, refrigerated overnight, then skimmed the next day, using a spoon to remove the solid fat from the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Wontons</strong>: Place shrimp in a small bowl. Add baking soda, 1 teaspoon salt, and 1/4 cup water and mix with fingers. Set aside for at least 15 minutes and up to 1 day in the refrigerator. Drain when ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine pork, 2 teaspoons grated fresh ginger, sugar, soy sauce, sesame oil, half of chives, and 1 teaspoon salt in a medium bowl. Mix with fingers until thoroughly combined. To test for seasoning, place a small amount on a microwave-safe plate and microwave on high power until cooked through, about 10 seconds. Taste for seasoning and add more salt as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one wonton wrapper in the center of the cutting board, keeping the rest covered in plastic. Place a 1 tablespoon-sized portion of pork filling in center of wrapper, and top with a single shrimp. Using your finger tip, moisten the wrapper with water around the edge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift two opposite corners up to meet at a point, then use your fingertips to seal the rest of the sides, forming a triangle, and squeezing out as mush as as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull the two opposite corners towards each other to form the triangle into a plump folded crescent shape, using a little water to seal the edges. Transfer to a plate and repeat with remaining wontons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Soup</strong>: Bring broth to a boil. Add wontons and cabbage and cook until wontons are cooked through, about 3 minutes. Stir in remaining chives and remove from heat. Allow to cool for 1 minute. Serve immediately.</p>"}]}