{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/042313-249422-Serious-Eats-Sunday-Supper-Pork-Cordon-BleuB-edit.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["mushrooms", "mustard", "pork", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Pork Tenderloin Cordon Bleu with Mushroom-Mustard Cream Sauce", "link": "https://www.seriouseats.com/recipes/2013/05/pork-tenderloin-cordon-bleu-recipe.html", "description": "This take on cordon bleu swaps chicken for pork tenderloin and finishes with a mustard cream sauce.", "totalTime": "1 hour", "recipeYield": "4 to 6", "recipeCategory": ["Mains", "Mushrooms", "Pork", "Sunday Supper"], "recipeIngredient": ["2 pork tenderloins (2 to 2 1/2 pounds total), trimmed of fat and silver-skin and butterflied", "Kosher salt", "Cracked black pepper", "4 medium-thick slices smoked tavern ham", "4 medium-thick slices Swiss cheese", "3 tablespoons coarse-ground mustard, divided use", "4 ounces cream cheese", "4 tablespoons olive oil", "1 cup flour", "1 cup breadcrumbs", "2 eggs, lightly beaten", "8 ounces cremini mushrooms, thinly sliced ", "1/4 cup dry white wine", "1/2 cup heavy whipping cream", "1/2 tablespoon Worcestershire sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork with salt and pepper. Lay two ham slices over the inside of each butterflied pork tenderloin. Top with two slices of Swiss cheese each. Mix 1 1/2 tablespoons mustard and cream cheese in a small bowl. Spread mixture evenly on top of Swiss cheese. Starting about 1/2-inch from the bottom and leaving 1/2-inch on either side, pull the bottom edge of meat up and over the filling and roll up into a thick cylinder, burrito-style. Using butcher's twine, tie the meat to seal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season flour with salt and pepper to taste and place in a large, shallow baking or pie dish. Season breadcrumbs with salt and pepper to taste and place in another large, shallow dish. Place egg in a third large, shallow dish. Dredge pork in flour and shake off excess. Next, dredge it in egg, taking care to coat all surfaces. Finally, roll meat in breadcrumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a large, stove top-safe roasting pan over medium-high heat. When oil is shimmering, sear tenderloins on all sides, about 7 minutes total. Add mushrooms on either side of meat. Drizzle meat and mushrooms with remaining 2 tablespoons olive oil and transfer to oven to cook until it reaches an internal temperature of 145&deg;F, about 35 minutes. Remove pork from oven, transfer to a platter and tent with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place roasting pan on the stove top over medium-high heat. Add white wine and scrape pan with a wooden spoon to loosen browned bits. Add remaining 1 1/2 tablespoons mustard, along with heavy cream and Worcestershire sauce. Season with salt and pepper, if needed. Bring to a boil, reduce heat to medium and reduce slightly until sauce just coats the back of a spoon but a swiped finger leaves a clean line.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard string from pork tenderloin, slice, and serve immediately with mushroom-mustard sauce.</p>"}]}