{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130531-bakethebook-no-bake-cremebrulee.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Bakeless Sweets", "Crème Brûlée", "custard", "vanilla bean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "No-Bake Crème Brûlée", "link": "https://www.seriouseats.com/recipes/2013/06/no-bake-creme-brulee-without-an-oven-recipe.html", "description": "No-fuss, no-bath, stovetop crème brûlée from <strong><em>Bakeless Sweets</em></strong> serves up milky sweetness in every bite, with a healthy helping of crunchy caramelized sugar.", "totalTime": "4 to 8 hours (due to cooling/thickening)", "recipeYield": "makes 8 1/2 cup servings", "recipeCategory": ["Bake the Book", "Desserts", "Puddings and Custards"], "recipeIngredient": ["2 tablespoons cornstarch", "1/4 teaspoon salt", "2 1/2 cups (600 ml) cream", "8 large egg yolks", "1 cup (240 ml) whole milk", "6 tablespoons (75 g) sugar", "1 vanilla bean, or 2 teaspoons pure vanilla extract", "Fine turbinado sugar, for brûléeing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a cornstarch and egg yolk slurry: Put the cornstarch and salt in a medium bowl, and whisk out any lumps. Slowly whisk in the cream, making sure there are no lumps. Whisk in the egg yolks. It is important that this mixture be as smooth as you can make it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm and flavor the milk: Whisk the milk with the sugar over medium heat in a 3-quart (2.8-L) saucepan. If you’re using the vanilla bean, scrape it and add the seeds to the pan. Whisk the mixture so the seeds are incorporated into the liquid. (It should look speckled, like milk after an Oreo has been dunked in it repeatedly!) When the vanilla bean has been scraped out, drop the entire pod into the pan as well. Warm until bubbles form around the edge of the milk and the entire surface begins to quiver. Remove the vanilla bean and discard it. Turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Temper the slurry: Pour all of the milk mixture into the slurry. Whisk vigorously to combine. The mixture should come together smoothly, with no lumps. Pour the mixture back into the pan. Thicken the pudding: Turn the heat back on to medium and bring to a simmer, whisking constantly and vigorously. Work all the angles of the pot, and scrape the bottom. It will take 2 to 5 minutes to bring the custard to a boil, with large bubbles that slowly pop up to the surface. Boil, whisking constantly, for 2 minutes. Turn off the heat. (If you didn’t use a vanilla bean, stir in the vanilla extract now.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain and chill the pudding: Pass the custard through a fine-mesh strainer. Pour it into eight 1/2-cup (120-ml) ovenproof ramekins and refrigerate. Do not cover them; in this case, you want a thin, dry skin to form on top. Chill the puddings for at least 4 hours, or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brûlée the pudding! Lightly sprinkle the surface of each pudding with an even layer of turbinado sugar. Shake the ramekins from side to side to even out the layer. Use a kitchen torch to caramelize the sugar. Let sit 5 minutes before serving so the sugar layer can cool and harden.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternate method: Make sure your ramekins are broiler-safe. Move a rack up to the highest position and heat your broiler. Broil the ramekins for 3 to 7 minutes, until the sugar is evenly melted and browned. Keep a close watch and turn the ramekins once or twice to help them brown evenly.<br />\n</p>"}]}