{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131008-cookiemonster-apple-caramel-crumb-bars-2.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["apple", "bar cookie", "caramel", "cinnamon", "cookie", "crumb bar", "Fall dessert"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Caramel Apple Crumb Bars", "link": "https://www.seriouseats.com/recipes/2013/10/caramel-apple-crumb-bars.html", "description": "In these decadently delicious bars, a shortbread crust is layered with spiced apples and homemade caramel then finished with a crumb topping.", "totalTime": "1 hour 45 minutes, plus 30 minutes cooling", "recipeYield": "makes 12 large or 24 small bars", "recipeCategory": ["Apple", "Brownies and Bars", "Cookie Monster", "Fruit Desserts", "Thanksgiving"], "recipeIngredient": ["<strong>For Caramel</strong>", "1 1/2 cups sugar", "1 cup heavy cream", "6 tablespoons unsalted butter, diced", "1 teaspoon vanilla", "1/2 teaspoon salt", " ", "<strong>For Apple Layer</strong>", "5 cups apple slices (see note) from about 4 large Granny Smith apples", "1 cup sugar", "1 tablespoon freshly squeezed lemon juice", "1 teaspoon cornstarch", "1 teaspoon cinnamon", "1/2 teaspoon nutmeg", " ", "<strong>For Crust and Crumble</strong>", "3 cups all purpose flour", "1 cup sugar", "1/2 teaspoon salt", "1 teaspoon baking powder", "16 tablespoons (1 cup) cold unsalted butter, diced", "1 egg", "3 tablespoons heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the caramel</strong>: Assemble all the ingredients you will need for the caramel and place close to the saucepan you will be using. Place sugar in a large heavy sauce pan over medium high heat. Let the sugar begin to melt, then start to mix with a spoon. Mix occasionally until sugar has completely melted into a lightly golden color. Slowly and carefully pour in heavy cream&mdash;the sugar is going to immediately steam and harden into a lump. Turn the heat down to medium and continuously stir caramel until it is completely melted again and mixture is smooth, about 5 minutes. Stir in butter, vanilla, and salt, and mix until butter has melted completely. Take caramel off the heat and let come to almost room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>While caramel is cooling, make apple layer</strong>: In a large bowl, combine apples, sugar, lemon juice, cornstarch, cinnamon, and nutmeg, and stir to make sure it is well mixed. Let stand for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make crust and crumble</strong>: Adjust oven rack to middle position and preheat oven to 375&deg;F. Line the baking dish with foil, then grease foil with butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put flour, sugar, baking powder, and salt in the bowl of a food processor. Pulse 5 times to combine. Add butter and pulse until it is cut to the size of peas. Add egg and heavy cream and pulse until mixture has the texture of wet sand and, when pressed between your fingers, holds its shape. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take 3/4 of the shortbread dough and press it into the prepared baking sheet. The bottom crust should be about 1/2-inch thick. Use a slotted spoon to remove apples from the bowl and spread evenly over top of shortbread. Cover the apples with the caramel sauce, gently reheating it over low heat if it's become too thick to spread. Use your fingers to form the remaining shortbread into crumbs and sprinkle the top with crumbs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake bars until top is golden and bubbling, about 50 minutes. Let cool completely before cutting.</p>"}]}