{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/040513-246494-cook-the-book-yellow-mole-masa-dumpings.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Mexican", "keywords": ["Cook the Book", "dumplings", "masa", "Mexican", "mole", "pati jinich", "pati's mexican table", "poultry", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Yellow Mole with Masa Dumplings (Mole Amarillito con Chochoyotes) from 'Pati's Mexican Table'", "link": "https://www.seriouseats.com/recipes/2013/04/yellow-mole-with-masa-dumplings-mole-amarillito-con-chochoyotes-patis-mexican-table-recipe.html", "description": "This yellow mole in this recipe from <em>Pati's Mexican Table</em> only takes an hour or so, and almost all the ingredients can be found your average grocery store.", "totalTime": "1 hour and 15 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Chicken", "Cook the Book", "Mains", "Mexican"], "recipeIngredient": ["<strong>Mole Sauce</strong>", "2 ancho chiles, rinsed, stemmed, and seeded", "2 guajillo chiles, rinsed, stemmed, and seeded", "1 pound tomatillos (6–8), husks removed, rinsed", "1 medium ripe tomato", "4 garlic cloves", "2 whole cloves", "1 teaspoon ground cinnamon", "1 teaspoon dried oregano, preferably Mexican", "2 teaspoons kosher or coarse sea salt", "1/4 teaspoon freshly ground black pepper", "3 tablespoons vegetable oil", "1/4 cup chopped white onion", "5 cups chicken broth, homemade or storebought", "3 medium fresh <em>hoja santa</em> leaves or 5 dried, or 2 cilantro sprigs (optional)", " ", "<strong>Mexican Masa Dumplings</strong>", "1 cup instant corn masa flour, such as Maseca", "3/4 cup lukewarm water", "1 1/2 tablespoons lard or vegetable shortening", "1/4 teaspoon ground cinnamon", "1 teaspoon kosher or coarse sea salt, or to taste", "1/2 teaspoon sugar", " ", "3 tablespoons vegetable oil", "8 chicken breasts, thighs, or drumsticks, or a combination", "Kosher or coarse sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Sauce:</strong> Heat a <em>comal</em> or large skillet over medium heat until hot. Lay the chiles flat in the pan and toast them for 10 to 15 seconds per side until they become fragrant and pliable and their color darkens. Take care not to let them burn, or they will turn bitter. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the toasted chiles with the tomatillos, tomato, and garlic. Add water to cover and bring to a boil, then reduce the heat to a medium simmer and cook for 10 minutes, or until the tomatillos and tomato are soft. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a slotted spoon, transfer the chiles, tomatillos, tomato, and garlic to a blender or food processor and let cool slightly. Add the cloves, cinnamon, oregano, salt, and pepper and purée until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, heat the oil over medium-high heat. Add the onion and sauté for 3 to 4 minutes, until soft and translucent. Add the tomatillo purée and cook until it thickens, about 10 minutes, stirring often.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken broth and hoja santa leaves, if using. Bring to a simmer over medium heat and cook for about 15 minutes. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dumplings:</strong> In a large bowl, mix the masa flour with the water, then knead for about 1 minute, until the dough is smooth and free of lumps. Add the lard, cinnamon, salt, and sugar and mix for another minute, until well incorporated and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough into 1-inch balls, then, with your little finger, make a dimple in the middle of each dumpling. Keep covered until ready to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To finish:</strong> In a deep skillet or Dutch oven, heat the 3 tablespoons oil over medium-high heat until hot but not smoking. Sprinkle the chicken pieces with salt and pepper to taste. Working in batches, add the chicken to the pan skin side down and brown on each side for 4 to 5 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return all the chicken to the pan, pour the mole sauce on top, and bring to a simmer. Reduce the heat to medium-low. Make the dumplings as directed. One by one, add them to the mole and cook for another 15 minutes, or until the dumplings are cooked through and the mole has thickened enough to coat the back of a wooden spoon. Serve.</p>"}]}