{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130605-buttered-popcorn-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["caramel corn", "cracker jacks", "ice cream", "popcorn", "Scooped"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Buttered Popcorn Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/06/buttered-popcorn-ice-cream-recipe.html", "description": "Sweet and salty, rich and buttery, fragrant with freshly popped popcorn&mdash;this ice cream is an easy choice for movie night.", "totalTime": "2 hours, plus a 6 hour to overnight chill", "recipeYield": "makes about 1 quart", "recipeCategory": ["Ice Cream and Frozen Treats", "Scooped"], "recipeIngredient": ["2 cups heavy cream", "1 cup whole milk", "2 cups freshly popped butter-flavored popcorn (see note)", "6 egg yolks", "3/4 cup sugar", "Salt to taste", "Optional: 1 cup Cracker Jacks or caramel corn, chilled in freezer (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed saucepan, bring milk and cream to a bare simmer. Remove from heat, stir in popcorn, cover, and let steep for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a second heavy-bottomed saucepan, whisk together egg yolks and sugar until pale in color and slightly thickened. Chill in refrigerator until dairy has finished steeping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour dairy through a fine mesh strainer into pot with egg-sugar mixture, then whisk rapidly until very well combined. Press on strained popcorn with a spoon against the strainer to squeeze out all remaining dairy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put saucepan on medium heat and cook, stirring occasionally, until a custard forms on the back of a spoon but a swiped finger across the back leaves a clean line. Add salt to taste in 1/4 teaspoon increments, then strain custard into an airtight container and chill overnight, or at least 6 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, churn according to manufacturer's instructions. If using Cracker Jacks or caramel corn, add them in the last few seconds of churning and let churn until well integrated. Transfer ice cream to container and chill in freezer for at least 3 to 4 hours before serving.</p>"}]}