{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130315-matzoh-pizza-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["matzo", "pizza", "pizza-like objects"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Matzo Pizza", "link": "https://www.seriouseats.com/recipes/2013/03/matzo-pizza-recipe.html", "description": "Matzo pizza can be bland and soggy. Our recipe solves that problem by using a two-step cooking process that guarantees an extra-crisp, flavorful crust.", "totalTime": "15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Passover", "Pizza", "The Pizza Lab"], "recipeIngredient": ["1 1/2 cups whole canned tomatoes (preferably San Marzano)", "2 whole matzos, split in half to form 4 pieces, roughly 4- by 8-inches each", "3 ounces grated mozzarella cheese", "Toppings, as desired", "Kosher salt", "1/2 ounce grated Parmesan cheese", "4 teaspoons extra-virgin olive oil, plus more for drizzling", "Fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 500°F. Place tomatoes in a fine mesh strainer and break apart with your fingers into rough 1/2-inch chunks. Toss in strainer over sink to drain all excess liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place matzos on a foil-lined baking sheet. Spread half of mozzarella evenly over matzos, then transfer to oven. Bake until cheese is melted, about 3 minutes. Remove from oven and add tomatoes to matzos, distributing in small dollops. Top with remaining mozzarella and other toppings as desired. Season with kosher salt. Return to oven and bake until bubbly, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pizza from oven and sprinkle with Parmesan cheese. Heat 2 teaspoons oil in a large non-stick or cast iron skillet over medium heat. Using a wide, stiff spatula, carefully remove two pizzas from baking sheet and add to skillet. Cook, swirling and rotating occasionally, until crisp and well-browned on the bottom, about 2 minutes. Transfer to cutting board. Repeat with remaining pizzas. Serve immediately, drizzled with extra olive oil and sprinkled with fresh basil if desired.</p>"}]}