{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130514-252313-dinner-tonight-shrimp-red-curry-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Thai", "keywords": ["carrot", "coconut", "curry", "Dinner Tonight", "shrimp", "soup", "thai", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "5"}, "name": "Red Curry with Shrimp, Zucchini, and Carrot", "link": "https://www.seriouseats.com/recipes/2013/05/red-curry-with-shrimp-zucchini-and-carrot.html", "description": "When it comes to convenient pantry staples to have on hand for a quick meal, a can of good Thai curry paste ranks up there with bacon and kimchi. Grab a can of coconut milk and whatever happens to be in the fridge, and twenty minutes later you have a stunningly spicy dinner waiting for you.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Coconut", "Dinner Tonight", "Mains", "Shrimp", "Soups and Stews", "Thai", "Zucchini"], "recipeIngredient": ["1 (14 ounce) can coconut milk", "4 tablespoons red curry paste", "2 small zucchini, cut into 1-inch cubes (about 3 cups)", "2 small carrots, peeled, ends trimmed, cut into 1/2-inch pieces (about 2 cups)", "1 to 2 jalapeños, stemmed, seeded, and sliced (optional) ", "1/2 cup fresh or frozen peas", "2 tablespoons Asian fish sauce", "2 tablespoons palm sugar or brown sugar", "1/2 cup low-sodium chicken stock or water", "8 ounces shrimp, peeled and deveined ", "Handful cilantro, stems removed, chopped ", "Handful mint leaves, stems removed, half chopped ", "2 tablespoons fresh lime juice, from about 2 limes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the coconut milk can and scoop off 1/4 cup of the thick cream. Add this to a large 12-inch non-stick skillet set over medium-high heat, and cook until liquid starts to bubble furiously. Add the red curry paste, reduce heat to medium-low, and stir with a wooden spoon until combined. Cook, stirring occasionally, until the curry paste is very fragrant, about three minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the zucchini and carrots, turn the heat to medium, and stir until the pieces are completely covered in the paste. Cook, stirring occasionally, until vegetables just start to soften, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the remaining coconut milk, and stir well. Bring to a boil over high heat, and then reduce heat to maintain a steady simmer. If using jalapeños, add them now. Cook until vegetables are completely tender, about 7 minutes. Add shrimp and peas, and cook until shrimp are pink and plump, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium sized bowl, stir together the fish sauce, chicken stock, and sugar. When sugar has dissolved, pour this into the skillet. Stir well and simmer for a minute. Turn off the heat, add cilantro, chopped mint, and lime juice. Serve the curry with the whole mint leaves as a garnish and a side of white rice. </p>"}]}