{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/061213-255153-cook-the-book-ramen-with-chashu-pork.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Japanese", "keywords": ["chashu pork", "Cook the Book", "dashi", "hiroko shimbo", "hiroko's american kitchen", "ramen", "soup", "soy broth", "soy egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ramen with Chashu Pork from 'Hiroko's American Kitchen'", "link": "https://www.seriouseats.com/recipes/2013/06/ramen-with-chashu-pork-from-hirokos-american-kitchen.html", "description": "Like many big city serious eaters, I enjoy probably more than my fair share of ramen. Until this week, all of these sips and slurps were at restaurants or food trucks; even though I cook almost everything for myself, ramen has always seemed like a dish best left to experts with plenty of time to tend a long-simmered broth. However, when I opened up <strong><a href=\"http://www.hirokoskitchen.com/bio\">Hiroko Shimbo</a></strong>'s new cookbook, <em><a href=\"http://www.amazon.com/Hirokos-American-Kitchen-Cooking-Japanese/dp/1449409784/?tag=serieats-20\">Hiroko's American Kitchen</a></em>, and saw not one, but two recipes for the noodle soup, I knew I needed to give it a shot.", "totalTime": "4 hours, plus overnight rest", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Japanese", "Mains", "Pork", "Ramen", "Soups and Stews"], "recipeIngredient": ["<strong>Dashi Stock</strong>", "8 cups prepared <a href=\"http://www.seriouseats.com/recipes/2013/06/kelp-stock-from-hirokos-american-kitchen.html\">Kelp Stock</a>", "4 cups katsuobushi (skipjack tuna fish flakes; 2 ounces)", "&nbsp", "<strong>Ramen</strong>", "2 cloves garlic, peeled", "1 thumb-size piece ginger (1 ounce), peeled", "5 cups low-sodium chicken stock, plus more if needed", "1 cup Dashi Stock (above) or low-sodium chicken stock ", "2 cups water", "1 pound pork belly, skin and excess fat removed", "1/2 cup sake (rice wine)\u2028", "1 cup shoyu (soy sauce)\u2028", "1 cup mirin (sweet cooking wine) ", "4 hard-boiled large eggs\u2028", "1/2 sheet nori seaweed\u2028 ", "2 scallions\u2028", "2 1/2 cups shredded red cabbage", "10 ounces dried <em>chukasoba</em> (ramen) or dried Chinese egg noodles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the dashi stock:</strong> Heat the prepared Kelp Stock in a large pot over medium heat to 176°F. Do not bring the stock to a boil. Add the fish flakes all at once, gently pushing the flakes down into the stock with a spatula. Wait for the stock to come to a gentle simmer and then quickly turn off the heat. Leave the fish flakes in the stock for about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the stock through a moist paper towel–lined strainer, ensuring that none of the fish flakes pass into your stock. Dashi Stock should be very clean and clear. I store the prepared stock in 4-cup plastic containers—one in the refrigerator for use in a day or two, and the other in the freezer for later use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the ramen:</strong> Crush the garlic with the side of the knife. Cut the ginger into 3 pieces. Heat the chicken stock, Dashi Stock, and water in a large pot over medium heat until boiling. Add the pork belly, garlic, and ginger to the stock mixture and cook for 1 hour. The pork should be completely submerged while cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork belly from the stock and strain the cooking liquid through a moist paper towel-lined strainer set over a bowl. Measure the cooking liquid and, if necessary, add additional chicken stock until you have 6 cups. Refrigerate the stock—from this point it will be referred to as ramen stock—overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sake, soy sauce, and mirin in a small saucepan over medium heat and bring it to a gentle simmer. Add the pork belly, decrease the heat to medium-low, and cook for 20 minutes. While cooking, turn the pork belly several times to ensure even flavoring. Remove the pot from the stovetop and let the pork belly and cooking liquid cool for 30 minutes. Then transfer the pork belly with the cooking liquid into a small sealable container (the pork belly should be barely submerged in the cooking liquid) and refrigerate for 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pork belly from the cooking liquid and transfer it into another sealable container, reserving the cooking liquid in the container. Refrigerate the pork belly overnight. Shell the hard-boiled eggs, add the eggs to the reserved cooking liquid, and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, remove the eggs from the cooking liquid, reserving the liquid. This liquid is used to flavor the ramen stock for your ramen noodle soup bowl, so let us call it ramen sauce. Cut the eggs in half lengthwise. Cut the pork belly into thin diagonal slices, about 1/4 inch thick and 2 inch square. You will use 3 to 5 slices per serving of noodles. Any sliced pork belly not used in this recipe can be frozen for later use. Cut the nori into 4 rectangles. Cut the scallions diagonally into thin slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat serving bowls by filling them with very hot water. Bring a large pot of water to a boil over medium heat and cook the cabbage for \u20282 minutes. Remove the cabbage with a slotted spoon and drain in a colander. Add the chukasoba noodles to the boiling water and cook them according to the directions on the package. While cooking the noodles, in another medium pot add the ramen stock and bring it to a simmer over medium heat. Add 7 to 8 tablespoons of the ramen sauce to the pot and bring it to a simmer. This is the completed ramen broth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the noodles. Do not rinse the noodles in cold water. Discard the hot water from the noodle bowls and divide the noodles and the hot ramen broth among the bowls. Garnish each bowl with the chashu pork slices, half and egg, the cabbage, scallions, and nori. Serve piping hot.</p>"}]}