{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131024-turkey-porchetta-recipe-thanksgiving-65.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["deep-fried", "holiday", "low carb", "porchetta", "thanksgiving", "turchetta", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "12"}, "name": "Deep-Fried Sous Vide Turkey <em>Porchetta</em> (Turchetta)", "link": "https://www.seriouseats.com/recipes/2013/11/sous-vide-deep-fried-turkey-porchetta-recipe.html", "description": "Turkey <em>porchetta</em>&mdash;deboned turkey breast cured with garlic, fennel, sage, and red pepper and wrapped in its own skin before roasting&mdash;might be the best way to cook turkey using a <em>conventional</em> oven, but if you want to <em>really</em> break out the big guns, cooking it sous vide, followed by a stint in a hot oil bath, Peking duck&ndash;style, is the way to go.", "totalTime": "Up to 2 days", "recipeYield": "Serves 5 to 6", "recipeCategory": ["Christmas", "Deep Frying", "Fall", "Mains", "Sous Vide", "Stovetop", "Thanksgiving", "The Food Lab", "Turkey", "Winter"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/11/turkey-porchetta-food-lab-recipe.html\">turkey <em>porchetta</em></a>, prepared through the end of step 7, skipping wrapping and refrigerating step at end of step 5", "1 1/2 quarts (1.4L) peanut or canola oil for deep-frying, or 2 tablespoons (30ml) canola oil for pan-frying", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After forming and tying turkey porchetta (as described in step 5 of our <a href=\"http://www.seriouseats.com/recipes/2013/11/turkey-porchetta-food-lab-recipe.html\">turkey porchetta recipe</a>), transfer to a sous vide&ndash;style vacuum-sealer bag. Seal tightly and let rest for at least 6 hours and up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat sous vide water bath to 140&deg;F (60&deg;C). Add turkey and cook for 4 to 5 hours. Remove and run under cool running water, or transfer to an ice bath to chill for 5 minutes. Remove from bag and add any congealed juices to gravy. Rinse turkey porchetta thoroughly and carefully pat dry with paper towels. Trim ends for a more cylindrical shape, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish by Deep-Frying: </strong>Heat 1 1/2 quarts (1.4L) peanut oil to 400&deg;F (204&deg;C) in a large wok or Dutch oven. Do not fill cooking vessel more than one-third of the way, in order to allow for bubbling and displacement when you add turkey. Carefully slide turkey into oil using spatulas and tongs (it will not be fully submerged). Immediately cover and cook, shaking pan occasionally, until sputtering dies a bit, about 2 minutes. Adjust flame to maintain a consistent 350&deg;F (177&deg;C) temperature. Using a large metal ladle, continuously spoon hot oil over exposed portions of roast until bottom half is cooked and crisp, about 5 minutes. Carefully flip and cook on second side, basting the whole time. Proceed to step 5.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish by Pan-Roasting:</strong> While wearing an apron (the turkey can splatter), heat 2 tablespoons (30ml) canola oil in a large stainless steel or cast iron skillet over high heat until gently smoking. Add turkey and cook, turning occasionally, until well browned on all sides, about 10 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove turchetta to a large paper towel&ndash;lined plate and blot all over. Season with salt. Let rest 5 minutes. Carve and serve with gravy on the side.</p>"}]}