{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130909-ramen-hacks-new-burger-03-610px.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "cheeseburger", "noodle", "ramen", "ramen burger", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Ramen Burger", "link": "https://www.seriouseats.com/recipes/2013/09/ramen-burger.html", "description": "A cheeseburger with crispy ramen noodles in place of the bun.", "totalTime": "20 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Beef", "Burger", "Mains", "Sandwiches"], "recipeIngredient": ["1 pack instant ramen noodles", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable oil", "8 ounces freshly ground beef, formed into two 4-ounce patties", "2 slices American, Cheddar, or Swiss cheese", "Toppings as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook noodles according to package directions, draining 1 minute before time indicated on package. Transfer to a rimmed baking sheet and spread out to allow them to dry slightly. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide noodles into 4 piles. Heat oil in a large non-stick or cast iron skillet over medium-high heat until shimmering. Place ring mold or empty 28-ounce can with both ends cut off on one side of pan. Place 1 pile of noodles into mold and press down gently with a rubber spatula to form a thin, even layer. Carefully lift mold. Repeat with other piles of noodles until you have four circular piles of noodles cooking. Cook without moving until well browned on first side, about 3 minutes. Carefully flip and brown on second side, about 3 minutes longer. Transfer to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season meat with ramen seasoning packet, adding additional salt and pepper to taste. Wipe out skillet with paper towel and heat over high heat until lightly smoking. Add burger patties and press down immediately with a stiff spatula so that patties make contact with skillet. Cook without moving until seared on first side, about 2 minutes. Carefully scrape up patties and flip. Top with cheese and continue to cook until desired doneness is achieved, about 1 minute for medium rare.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top bottom ramen buns as desired, add burger patties, top with second ramen buns, and serve immediately.</p>"}]}