{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130424-red-wine-syrup.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["boozy desserts", "citrus", "frozen drink", "lemons", "Scooped", "slushies", "sorbet", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Whiskey Sour Slushy", "link": "https://www.seriouseats.com/recipes/2013/04/whiskey-sour-slushie-recipe.html", "description": "What's better than making slushies at home? Making boozy slushies at home&mdash;all the more so with a rich red wine syrup.", "totalTime": "2 1/2 hours", "recipeYield": "makes 1 quart slushie base", "recipeCategory": ["Ice Cream and Frozen Treats", "Lemon", "Scooped", "Whiskey"], "recipeIngredient": ["<strong>For the Slushy Base:</strong>", "1 1/4 cup lemon juice from 8 to 10 lemons", "1 1/2 cups filtered or bottled water", "1 cup corn syrup", "7 tablespoons bourbon or rye, plus more for serving", "1 tablespoon grated lemon zest from 1 to 2 lemons", "3/4 teaspoon kosher salt", " ", "<strong>For the Red Wine Syrup:</strong>", "1 1/2 cups red wine (see note)", "3/4 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Slushy Base:</strong> In a large bowl whisk together lemon juice, water, corn syrup, whiskey, lemon zest, and salt until very well combined. Transfer to freezer and chill until very cold, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chilled base into ice cream maker and churn until base looks like a soft sorbet without visible liquid pooling at the top. A spoon pressed against the base should leave a clear indentation once removed. Transfer churned base to an airtight container and chill in freezer until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Red Wine Syrup:</strong> In a small saucepan, whisk together wine and sugar over high heat. Once all sugar is dissolved, let wine boil until it reduces in volume by half, bubbles begin to stack on each other, and the syrup reads 222&deg;F on a candy thermometer. Transfer to a small container and chill in refrigerator until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Spoon 1 to 2 tablespoons of wine syrup in the bottom of each bowl or cup. Scoop about 1/2 cup slushie base into a small work bowl, then stir in additional whiskey to each person's taste. Slushy base will remain semi-solid even with a generous amount of added alcohol. Serve with a spoon or a thick straw.</p>\r\n\r\n<p>You can also mix each slushy directly in its bowl or glass and then top with the syrup, but the presentation won't look quite as neat.</p>"}]}