{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130215-pasrydungeon-smores.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["desserts", "quick", "Rice Krispies", "s'mores"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "S'mores Krispie Treats", "link": "https://www.seriouseats.com/recipes/2013/02/smores-krispies-treats-recipe.html", "description": "With only a couple of extra steps you can make rice krispie treats that taste just like s'mores.", "totalTime": "60 minutes", "recipeYield": "makes 32 pieces", "recipeCategory": ["Brownies and Bars", "Very Small Anna"], "recipeIngredient": ["1 (10-ounce) bag large marshmallows", "3 tablespoons unsalted butter", "2 tablespoons honey", "6 cups crispy rice cereal", "1 ounce (1/4 cup) graham or whole wheat flour", "1 teaspoon ground cinnamon", "1 standard size (1.55 ounce) Hershey bar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high and adjust a rack about 4 inches from element. Spread marshmallows in an even layer on a small sheet pan lined with foil or a silicone mat. Broil until well-toasted on top, about 5 minutes. Remove and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel marshmallows (which will now be a single sticky mass) off the lined pan and place in a large pot. Add butter and honey and cook over low heat, stirring often, until fully melted. Meanwhile, butter an 8- by 8-inch glass or metal pan. Break up chocolate bar into a microwave-safe bowl and microwave in 15 second intervals, stirring between sessions until fully melted, about 30 seconds total. Set aside. Combine cereal, flour, and cinnamon in a mixing bowl and toss until fully combined, then add to the melted mixture and stir to incorporate thoroughly. Scrape half into prepared pan and pack tightly with a buttered or greased spatula. Spread evenly with melted chocolate, then add rest of mixture and pack down tightly. Allow to cool and set for at least 30 minutes, then flip onto a cutting board and cut into 1 by 2-inch rectangles. Treats can be stored in an airtight container at room temperature for up to 5 days.</p>"}]}