{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/052313-252752-cook-the-book-shrimp-and-grits.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grit", "matt lee", "shrimp", "ted lee", "the lee bros. charleston kitchen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Shrimp and Grits from 'The Lee Bros. Charleston Kitchen'", "link": "https://www.seriouseats.com/recipes/2013/05/shrimp-and-grits-from-the-lee-bros-charleston-kitchen-recipe.html", "description": "A seamless union of land and sea, shrimp and grits just may be the perfect example of lowcountry cuisine. Briny shrimp tossed in butter, cream, or tomato-y gravy are a graceful foil to sweet, earthy grits. The dish itself has been around at least since the early 20th century and as such has spawned many variations. Some are totally bare-bones, containing only shrimp, butter, and grits, while others include bacon, tomatoes, and spice. <strong><a href=\"http://mattleeandtedlee.com/lee-bros/about-us/\" target=\"_blank\">Matt and Ted Lee's</a></strong> version in <em><a href=\"http://www.amazon.com/The-Lee-Bros-Charleston-Kitchen/dp/0307889734/?tag=serieats-20\" target=\"_blank\">The Lee Bros. Charleston Kitchen</a></em> is more akin the latter.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Cook the Book", "Mains", "Shrimp"], "recipeIngredient": ["1 1/4 pounds headless large (21 to 25 count) shell-on shrimp", "1 bay leaf", "Kosher salt", "3/4 teaspoon sugar", "1 pinch of cayenne", "1 pound vine-ripened tomatoes, cored and quartered", "1 teaspoon red wine vinegar, plus more to taste", "4 ounces slab bacon, cut into large dice", "1 lemon, halved", "1 tablespoon all-purpose flour", "2 garlic cloves, minced", "Freshly ground black pepper", "<a href=\"http://www.seriouseats.com/recipes/2013/05/charleston-hominy-from-the-lee-bros-charleston-kitchen-recipe.html\">Charleston Hominy</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and devein the shrimp, reserving the shrimp in a bowl and the shells in a small saucepan. Add 2 cups of water, the bay leaf, 1/2 teaspoon kosher salt, 1/4 teaspoon of the sugar, and the cayenne to the saucepan with the shells. With a spoon, tamp the shells down beneath the surface of the water, cover, and bring to a simmer over high heat. Uncover, turn the heat to medium low, and let the shrimp stock simmer until reduced by half, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, with a sharp knife, slice the shrimp in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the tomatoes in a blender or food processor and add the vinegar, 1/2 teaspoon salt, and the remaining 1/2 teaspoon sugar. Process to a smooth purée, then strain through a fine sieve, pressing the skin and seeds to extract as much juice as possible. Discard the skin and seeds. You should have 1 1/2 cups of tomato purée.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter the bacon in a large sauté pan over medium-high heat and cook, stirring occasionally, until the bacon is alluringly browned and has rendered its fat, about 8 minutes. Using a slotted spoon, transfer the bacon to a small paper-towel-lined plate and cook the shrimp in the bacon fat in batches, taking care not to crowd the pan, and stirring occasionally, just until they’ve curled into corkscrews and turned pink, about 2 minutes; reserve on a plate. Squeeze half the lemon over the shrimp and sprinkle with 2 pinches of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the shrimp stock into the sauté pan, discarding the solids, and stir with a wooden spoon to pick up the tasty browned bits from the bottom of the pan. When the stock simmers, spoon off 2 tablespoons and then whisk them into the flour with a fork in a small bowl to make a paste. Add the tomato purée and the garlic to the pan, stir to combine, and then whisk the flour paste into the sauce. Cook until the mixture thickly coats the back of a spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the heat, and fold the shrimp in just to warm through. Season to taste with salt, black pepper, and red wine vinegar. Cut the remaining lemon half into 4 wedges. Serve the shrimp over hot Charleston Hominy, and garnish with the reserved bacon and the lemon wedges.</p>"}]}