{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130523-very-small-anna-apricot-shortbread-sabayon.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["apricots", "boozy desserts", "from the pastry dungeon", "fruit desserts", "sabayon", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apricots with Toasted Wheat Shortbread and Summer Ale Sabayon", "link": "https://www.seriouseats.com/recipes/2013/05/apricots-with-toasted-wheat-shortbread-and-summer-ale-sabayon-recipe.html", "description": "This dessert comes out looking impressive, but it's as mind-blowingly simple as it is complexly delicious. It would make a gorgeous end to any outdoor early summer meal. The apricots and shortbread can be done a day or two ahead, and the sabayon completed right before serving.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Apricot", "Cookies", "Fruit Desserts", "Very Small Anna"], "recipeIngredient": ["<strong>For the Apricots</strong>:", "2 pounds fresh apricots", "3 cups water", "2/3 cup sugar", "1/3 cup honey", "1 vanilla bean", "Pinch salt", " ", "<strong>For the Cookies</strong>:", "1/2 cup unsalted butter, softened", "2 tablespoons powdered sugar", "1 cup whole wheat flour", "1/4 teaspoon salt", "3/4 teaspoon grains of paradise, roughly ground", " ", "<strong>For the Sabayon</strong>:", "2 egg yolks", "1/2 cup sugar", "1/2 cup Sam Adams summer ale"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Apricots</strong>: Halve and pit each apricot, then cut the halves into quarters or sixths, depending on the size of the apricots. In a large saucepan, combine the water, honey, and sugar. Split and scrape the vanilla bean and add to pan, along with salt. Bring to a boil to dissolve the sugar, then add apricots and gently simmer for 8-10 minutes, until fruit is very fragrant and cooked through, but not mushy or broken down. Remove from heat and allow to cool. Store cooled apricots in syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Shortbread</strong>: In the bowl of a stand mixer or with a handheld electric mixer, cream together butter and powdered sugar until light and fluffy. Combine flour, salt, and grains of paradise, then add flour mixture all at once to butter mixture and mix on low speed to just combined, finishing by hand to eliminate any floury or buttery patches. Pat into a log about 2 inches thick, wrap tightly in plastic and chill for at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, set a rack in center of oven and preheat oven to 300&deg;F. Slice dough into discs that are somewhere between 1/4 and 1/2 inch thick and place on parchment or silicone lined baking sheet, leaving at least 1/2 inch between each cookie. Bake for 30 minutes, then increase temperature to 350&deg;F and bake for another 8-10 minutes, until browned and toasty-smelling. Allow to cool fully and store in an airtight container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sabayon</strong>: Combine yolks, sugar, and ale in a large mixing bowl, whisking immediately to keep the sugar from creating dried lumps of yolk. Set bowl over a large pot of simmering water and whisk constantly for 10-15 minutes, until entire mixture is foamy and no liquid remains at the bottom. Layer into serving glasses with apricots and crushed shortbread and serve immediately.</p>"}]}