{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130930-vegetarian-torta2.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "Mexican", "keywords": ["easy", "Mexican", "quick", "sandwich", "torta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Loaded Vegetarian Tortas With Avocados, Queso Oaxaca, Black Beans, and Pickled Jalapeño", "link": "https://www.seriouseats.com/recipes/2013/10/recipe-loaded-vegetarian-tortas-with-avocado.html", "description": "Heaped with creamy black bean spread, salty white cheese, and creamy avocados, these sandwiches are dead-easy to prepare at home: in the time it would take you to head out to your favorite Mexican joint and order a torta, you could make five of them from the comfort of your own home.", "totalTime": "30 minutes", "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Mexican", "Sandwiches", "Vegetarian"], "recipeIngredient": ["3 jalape&ntilde;os, thinly sliced into rounds", "2/3 cup water", "1/3 cup apple cider vinegar", "2 teaspoons kosher salt, plus additional for seasoning", "1 tablespoon sugar", "One large (25 ounce) can black beans, rinsed and drained", "1 teaspoon ground cumin", "3 tablespoons mayonnaise, plus additional for spreading sandwiches", "4 soft round rolls", "1 pound queso Oaxaca (Mexican string cheese), thinly sliced", "2 ripe avocados, thinly sliced", "1 small head iceberg lettuce, shredded", "1 lime", "1/2 cup picked fresh cilantro leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place sliced jalapeños in a small bowl. In a small saucepan, combine water, vinegar, salt, and sugar and bring to a boil over high heat. Pour pickling solution over jalapeños and cover bowl with a plate; let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place beans in a medium mixing bowl and add cumin, mayonnaise and kosher salt to taste. Mash with a potato masher until beans come together as a spread but remain chunky. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut rolls in half. Divide black bean spread among bottom 4 halves of rolls (you may have extra spread), then layer cheese over black beans, dividing evenly between the 4 sandwiches. Top each sandwich with 1/2 a sliced avocado, then add a few jalapeño slices to each sandwich. Top each sandwich with a layer of shredded lettuce and a few cilantro leaves; spritz each sandwich with lime juice. Spread tops of rolls with mayonnaise, place on top of each sandwich, press down gently, and slice in half. Serve immediately. </p>"}]}