{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131107-272129-cook-the-book-phat-thai-shrimp-tofu.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["andy ricker", "Cook the Book", "noodle", "peanut", "pok pok", "shrimp", "thai", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Andy Ricker's Phat Thai (Stir-Fried Rice Noodles With Shrimp, Tofu, and Peanuts)", "link": "https://www.seriouseats.com/recipes/2013/11/andy-rickers-phat-thai-stir-fried-rice-noodles-shrimp-tofu-peanuts.html", "description": "Phat thai wasn't on <strong><a href=\"https://www.starchefs.com/cook/chefs/bio/andy-ricker\" target=\"_blank\">Andy Ricker's</a></strong> original menu at his Portland restaurant, <a href=\"http://www.pokpokpdx.com/\" target=\"_blank\">Pok Pok</a>. It wasn't until he opened <a href=\"http://www.pokpokphatthai.com/index.php?id=162\" target=\"_blank\">a noodle shop</a> in New York that he fully embraced the public's demand for a serious plate of Thai fried noodles. Ricker's recipe in his new <em><a href=\"http://www.amazon.com/Pok-Stories-Roadside-Restaurants-Thailand/dp/1607742888/?tag=serieats-20\" target=\"_blank\">Pok Pok</a></em> cookbook is a version of the dish he serves in New York. Even though it has a long, somewhat chaotic ingredient list, the final dish is subtle and almost delicate.", "totalTime": "1 hour", "recipeYield": "Serves 1", "recipeCategory": ["Cook the Book", "Mains", "Nuts", "Shrimp", "Thai", "Tofu"], "recipeIngredient": ["<strong>Shrimp and Sauce</strong>", "1 tablespoon medium-size dried shrimp, rinsed and patted dry", "3 tablespoons <a href=\"http://www.seriouseats.com/recipes/2013/11/andy-rickers-naam-makham-tamarind-water.html\">Naam Makham (Tamarind water)</a>", "2 tablespoons plus 3/4 teaspoon <a href=\"http://www.seriouseats.com/recipes/2013/11/andy-rickers-naam-cheuam-naam-taan-piip-palm-sugar-simple-syrup.html\">Naam Cheuam Naam Taan Piip (Palm sugar simple syrup)</a>", "1 1/2 tablespoons Thai fish sauce", "&nbsp", "<strong>Stir-Fry</strong>", "4 ounces (about 2 cups, tightly packed) semi-dried thin, flat rice noodles (sometimes labeled “phat thai”), see note", "2 tablespoons rendered pork fat or vegetable oil", "1 large egg, at room temperature", "1 1/4 ounces unflavored pressed tofu (firmer than “extra firm”), cut into small pieces (about 1 inch long, 1/2 inch wide, and 1/4 inch thick), about 1/4 cup", "1 tablespoon shredded salted radish, soaked in water 10 minutes then drained", "2 ounces bean sprouts (about 1 cup, lightly packed)", "2 ounces medium shrimp, (about 4), shelled and deveined", "1/4 cup very coarsely chopped (about 1-inch lengths) garlic chives, plus a pinch or two for finishing", "2 generous tablespoons coarsely chopped unsalted roasted peanuts", "&nbsp", "<strong>To Serve Alongside</strong>", "2 small lime wedges (preferably from a Key lime)", "Fish sauce", "Granulated sugar", "<a href=\"http://www.seriouseats.com/recipes/2013/11/andy-rickers-phrik-naam-som-vinegar-soaked-chiles.html\">Phrik Naam Som (Vinegar-soaked chiles)</a>", "<a href=\"http://www.seriouseats.com/recipes/2013/11/andy-rickers-phrik-phon-khua-toasted-chile-powder.html\">Phrik Phon Khua (Toasted-chile powder)</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Toast the shrimp and make the sauce:</strong> Heat a small dry pan or wok over medium heat, add the dried shrimp, and cook, stirring frequently, until they’re dry all the way through and slightly crispy, about 5 minutes. Set them aside in a small bowl. Covered at room temperature, they’ll keep for up to 1 week.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the tamarind water, simple syrup, and fish sauce in a small bowl and stir well. Measure 1/4 cup plus 2 tablespoons, discarding the rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Soak the noodles and stir-fry the dish:</strong> Soak the noodles in lukewarm water until they’re very pliable but not fully soft, about 20 minutes. Drain them well and snip them into approximately 8-inch lengths just before stir-frying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large, heavy skillet over medium-high heat (or a wok over very high heat), add the pork fat, and swirl it to coat the sides. When it begins to smoke lightly, crack the egg into the center of the pan (it should spit and sizzle violently and the whites should bubble and puff). Add the tofu, radish, and dried shrimp beside the egg. If you’re using a skillet, decrease the heat to medium; if you’re using a wok, keep the heat very high.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, stirring everything but the egg, until the edges of the egg are light golden brown, about 1 minute, then flip the egg (it’s fine if the yolk breaks), break the egg into several pieces with the spatula, and stir everything together well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the noodles and bean sprouts, and stir-fry (constantly stirring, scooping, and flipping) until the noodles and bean sprouts have softened slightly, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the shrimp, then stir the tamarind mixture once more and add it to the pan. Stir-fry, making sure the shrimp get plenty of time on the hot surface, until they are cooked through, just about all the liquid has evaporated, and the noodles are fully tender and no longer look gloppy or clumpy, 2 to 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chives and 1 tablespoon of the peanuts. Stir-fry briefly, then transfer it all to a plate, sprinkle on the remaining peanuts and chives, and serve with the lime wedges. Season to taste with the fish sauce, sugar, vinegar-soaked chiles, and chile powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: Semi-dried noodles (fairly pliable rather than brittle, like fully dried) are widely available in the refrigerated sections of Asian markets. If you can’t find semi-dried noodles, you can substitute 2 1/4 ounces of fully dried “phat thai” noodles soaked in lukewarm water for about 10 extra minutes (to approximate the texture of semi-dried noodles).</p>"}]}