{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131215-bison-council-tenderloin-ancho-rub-roast-herb-salsa-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bison", "Bison Council", "main", "tenderloin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ancho-Rubbed Bison Tenderloin With Spicy Cilantro Sauce", "link": "https://www.seriouseats.com/recipes/2013/12/ancho-rubbed-bison-tenderloin-with-spicy-cilantro-sauce.html", "description": "Bison tenderloin rubbed with a sweet-and-spicy ancho chili rub, slow roasted and served with a cilantro-based <em>salsa verde</em>.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Beef", "Christmas", "Mains"], "recipeIngredient": ["<strong>For the Bison:</strong>", "1 tablespoon brown sugar", "Kosher salt and freshly ground black pepper", "2 tablespoons ancho chili powder", "1 teaspoon cumin", "1/2 teaspoon Mexican oregano", "1/2 teaspoon ground coriander", "1 center-cut bison tenderloin, trimmed and tied for roasting (about 2 pounds, see note)", "&nbsp;", "<strong>For the Sauce:</strong>", "1 bunch fresh cilantro leaves and fine stems (about 2 loosely packed cups)", "2 medium cloves garlic, roughly chopped", "1/2 teaspoon red pepper flakes", "1 tablespoon red wine vinegar", "1/4 cup extra-virgin olive oil", "&nbsp;", "2 tablespoons canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, 1 tablespoon kosher salt, 1 teaspoon freshly ground black pepper, chili powder, cumin, oregano, and coriander in a small bowl and mix with fingers until homogenous. Rub evenly over entire surface of tenderloin. Transfer to a wire rack, refrigerate, and let rest for at least 45 minutes and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine cilantro, garlic, red pepper flakes, vinegar, and olive oil in the bowl of a food processor or blender. Process until a rough sauce is formed, about 20 seconds. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, adjust oven rack to center position and preheat oven to 275°F. Heat oil in a large cast iron or stainless steel skillet over medium-high heat until shimmering. Add tenderloin and cook, turning occasionally, until browned on all sides, about 4 minutes. Transfer tenderloin to a wire rack set in a rimmed baking sheet and transfer to oven. Roast until an instant read thermometer inserted into center of roast registers 125°F for medium rare or 135°F for medium, about 20 minutes. Remove from oven and let rest 5 minutes before carving and serving with sauce.</p>"}]}