{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/031813-244645-cook-the-book-pimento-jack-cheese-sandwiches.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grilled cheese", "pimento cheese", "richard blais", "tomato chutney", "try this at home", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Richard Blais's Pimento Jack Cheese Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/03/richard-blaiss-pimento-jack-cheese-sandwiches.html", "description": "Pimento cheese is one of my favorites from the Southern canon, and I find it is at its best with sandwiched between buttered white bread and grilled until crisp on the outside and gooey on the inside. So when I run into a pimento grilled cheese recipe in a cookbook, it's one of the first things I bookmark. That said, the <strong>Pimento Jack Cheese Sandwich</strong> in <strong><a href=\"http://www.richardblais.net/\">Richard Blais's</a></strong> new cookbook, <em><a href=\"http://www.amazon.com/Try-This-Home-Recipes-Plate/dp/030798527X/?tag=serieats-20\">Try This at Home</a></em>, is nothing like a pimento cheese sandwich you'd see down south. There is pepper jack where there should be sharp cheddar. There are homemade roast poblanos instead of jarred red pimentos. There is cilantro and lime zest. Surprisingly, these apparent foibles turn out to be assets once the sandwich takes shape, and I immediately regretted scoffing at the ingredients once taking a bite.", "totalTime": "30 minutes", "recipeYield": "makes 4 sandwiches", "recipeCategory": ["Cheese", "Cook the Book", "Mains", "Sandwiches", "Vegetarian"], "recipeIngredient": ["8 ounces white pepper jack cheese, coarsely grated", "1 small poblano pepper, roasted, peeled, seeded, and finely diced", "1 small jalapeno, seeded and minced", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2013/03/richard-blaiss-aioli.html \">Aioli</a> or good quality store-bought mayonnaise", "1 tablespoon chopped fresh cilantro", "Grated zest and juice of 1/2 lime", "Kosher salt to taste", "1/4 cup creme fraiche or sour cream", "2 tablespoons freshly grated Parmesan", "1 large egg yolk", "1 to 2 drops white truffle oil", "1/2 teaspoon sugar", "Eight 1/2-inch-thick slices brioche or Pullman sandwich white loaf", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2013/03/richard-blaiss-gentlemans-chutney.html\">Gentleman's Chutney</a>", "2 tablespoons unsalted butter", "1/2 cup arugula for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir the cheese, poblano, jalapeno, aioli, cilantro, lime zest and juice, and salt together until well combined. In a small bowl, whisk the creme fraiche, Parmesan, egg yolk, truffle oil, and sugar together until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay 4 of the bread slices on a work surface and spread one-quarter of the cheese mixture evenly over each slice. Spread 2 tablespoons of the relish on each of the 4 remaining slices of bread, place them on top of the cheese, and press down lightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a large skillet over medium-low heat. With a pastry brush, spread a thin layer of the creme fraiche mixture on the top of each sandwich. With a spatula, transfer the sandwiches to the skillet, creme fraiche side down, and cook until golden brown on the bottom, 3 to 4 minutes. Lightly brush the tops of the sandwiches with the remaining creme fraiche mixture, flip them, and continue cooking until the bottoms are golden brown and the cheese is melted, 2 to 3 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the sandwiches stand for 5 minutes to allow the cheese to set up. Lift the top slice and add the arugula. Slice the sandwiches in half and serve warm.</p>"}]}