{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/051313-251829-cook-the-book-pork-and-vegetable-lumpia.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "lumpia", "marvin gapultos", "pork", "spring rolls", "the adobo road cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork and Vegetable Lumpia from 'The Adobo Road Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/05/pork-and-vegetable-lumpia-from-the-adobo-road.html", "description": "These <em>lumpia</em>, or Filipino spring rolls, are fried and filled with moist ground pork, carrots, peas, and bean sprouts. Fish sauce adds a layer of salty complexity, but otherwise these are simply straight-up, easy-to-eat, fried goodness.", "totalTime": "55 minutes", "recipeYield": "makes about 2 dozen spring rolls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Pork", "Sides"], "recipeIngredient": ["2 tablespoons high-heat cooking oil, plus more for frying", "1 small onion, diced", "4 cloves garlic, minced", "1 pound (500 g) ground pork", "1 tablespoon ﬁsh sauce", "1/2 teaspoon freshly ground black pepper", "1 cup (70 g) grated carrot", "1 cup (70 g) mung bean sprouts", "1/2 cup (65 g) frozen peas", "25 square spring roll wrappers (8 x 8 in/20 x 20 cm), thawed", "Water, for sealing the spring rolls", "<a href=\"http://www.seriouseats.com/recipes/2013/05/garlic-vinegar-dipping-sauce-from-the-adobo-r.html\">Garlic Vinegar Dipping Sauce</a>, for serving", "<a href=\"http://www.seriouseats.com/recipes/2013/05/pineapple-sweet-and-sour-sauce-from-the-adobo.html\">Pineapple Sweet and Sour Sauce</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large wok or sauté pan over high heat until a drop of water sizzles and evaporates on contact. Swirl the oil into the pan and then add the onion and stir-fry until the onion wilts and begins to lightly brown, 2–3 minutes. Add the garlic and cook until the garlic just begins to brown, 1–2 minutes. Stir in the ground pork and cook for 1 minute, using a spatula or wooden spoon to break the meat into small pieces. Add the ﬁsh sauce, black pepper, carrot, bean sprouts and peas and stir to combine. Continue cooking until the meat is cooked through and the vegetables are tender, 3–4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cooked ﬁlling to a ﬁne-mesh sieve set over a large bowl and set aside. Draining the ﬁlling helps to prevent soggy spring rolls, allow the ﬁlling to drain and cool completely. After the ﬁlling has cooled, discard any liquid that has accumulated in the bowl and then transfer the ﬁlling into the same bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To roll the lumpia:</strong> Place 1 spring roll wrapper on a clean, dry work surface so that one corner of the wrapper is pointing at you (positioned like a diamond, rather than a square). Place 1 heaping tablespoon of the filling just under the midpoint of the diamond, closest to the corner pointing at you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the corner closest to you and roll it up and over the filling, until half of the wrapper remains. Fold the left and right corners of the wrapper over the filling. Using your fingers, or a pastry brush, dab the edges of the wrapper with water, and then continue to roll the lumpia toward the final corner at the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the finished lumpia aside, underneath a moist towel, and continue rolling until all of the filling has been used. (To freeze the lumpia, place them in a single layer on a baking sheet and place in the freezer until completely frozen. Transfer the frozen lumpia to a large resealable food storage bag and store in the freezer for up to 3 months.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To fry the lumpia:</strong> Fill a large frying pan with at least a 1/2 in (1.25 cm) of vegetable oil. Heat over moderately high heat until the oil reaches 350°F (175°C) on a deep fry thermometer. Alternatively, you can drop a small piece of lumpia wrapper into the hot oil; if it sizzles and immediately begins to brown, the oil is hot enough and ready for frying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil is ready, fry the lumpia in batches, being careful to not overcrowd the pan. Fry the lumpia, turning occasionally, until golden and crisp, 3–4 minutes total. If frying frozen lumpia, add 1 minute of cook time to each side. Transfer the fried lumpia to a paper towel-lined plate to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with <a href=\"http://www.seriouseats.com/recipes/2013/05/garlic-vinegar-dipping-sauce-from-the-adobo-r.html\">Garlic Vinegar Dipping Sauce</a> or <a href=\"http://www.seriouseats.com/recipes/2013/05/pineapple-sweet-and-sour-sauce-from-the-adobo.html\">Pineapple Sweet and Sour Sauce</a>.</p>"}]}