{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131114-273775-Gouda-Apple-Pie-edit.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["apple pie", "gouda", "pie", "Thanksgiving dessert"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gouda and Tart Apple Pie", "link": "https://www.seriouseats.com/recipes/2013/11/gouda-apple-pie-recipe.html", "description": "When it comes to cheese infused apple pies, cheddar isn't the only game in town. This <em>Pushing Daisies</em> inspired pie pair the tartness of Granny Smith apples with nutty Gouda cheese.", "totalTime": "4 hours", "recipeYield": "Serves 8", "recipeCategory": ["American Classics", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Crust:</strong>", "2 1/2 cups (11.25 ounces) unbleached all-purpose flour", "1 teaspoons salt", "20 tablespoons unsalted butter, cut into 1 inch pieces", " 4 ounces Gouda, grated finely", "6-7 tablespoons ice water", " ", "<strong>For the Filling:</strong>", "3 pounds Granny Smith apples, peeled cored, and sliced into 1/4-inch slices", "3 quarts boiling water", "5 tablespoons granulated sugar, plus 1 tablespoon for sprinkling over crust", "5 tablespoons light brown sugar", "1 teaspoon cinnamon", "1/4 teaspoon salt", "3 tablespoons cornstarch", "1 egg white, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the flour, salt, and grated Gouda in a large mixing bowl. Using a food processor, mix butter and flour/cheese mixture until the largest butter chunks are the size of large peas. . </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the top of the food processor and sprinkle ice water over the flour mixture in increments of one tablespoon, pulsing a couple times between additions. Repeat until dough begins to clump together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove flour mixture from food processor return it to the large mixing bowl. Gather the dough together with your hands and press into two disks. Wrap the dough in plastic wrap and refrigerate for two hours or up to overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add apple slices to a large bowl and pour boiling water on top. Cover bowl and set aside for ten minutes. Drain apples completely and let sit in a colander in the sink, tossing occasionally until completely dry, about 10 to 15 minutes. Return apples to the large bowl and add sugars, cinnamon, salt, and cornstarch, and toss until apples are evenly coated. Set mixture aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move oven rack to the center position and preheat to 425°F. Roll out one disk of pie dough into a circle about 12-inches in diameter and transfer to a 9-inch pie plate. Add filling. Roll out the remaining pie dough into a 10-inch rectangle and cut into 1/2-inch strips. Use the strips to weave a <a href=\"http://sweets.seriouseats.com/2011/07/sweet-technique-shaping-pie-crust-how-to-make-lattice-topped-pie-woven-crust-slideshow.html#show-174807\">lattice top</a>. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the pie evenly with the egg white and then sprinkle evenly with a tablespoon of sugar. Transfer pie to a parchment covered rimmed sheet pan in the oven. Bake until light golden brown, about 20 minutes. Reduce heat to 375°F and continue baking until deep golden brown, about 25 minutes longer. If the edges are getting overly browned, you can cover with tin foil or crust protectors. Remove from oven and let cool to room temperature for at least 2 hours before serving.</p>"}]}