{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130218-241336-CurriedQuinoa.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["coconut", "curry", "lunch box", "quinoa"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Make-Ahead Curried Coconut Quinoa with Shrimp and Basil", "link": "https://www.seriouseats.com/recipes/2013/02/make-ahead-curried-coconut-quinoa-with-shrimp-and-basil-recipe.html", "description": "Somewhere between saucy and soupy, this dish is just shy of a full-blown curry. Quinoa, mushrooms and shrimp are cooked in coconut milk and curry powder so they're infused with flavor--and then finished with fresh basil. Adding coconut milk makes the quinoa extra brothy, so it won't dry out when you reheat it the next day.", "totalTime": "45 minutes", "recipeYield": "serves 2", "recipeCategory": ["Coconut", "Lunch Box", "Mains", "Quinoa"], "recipeIngredient": ["1 1/2 tablespoons unsalted butter or olive oil, more if needed", "5 ounces cremini or baby bella mushrooms, sliced", "1 medium yellow onion, diced", "Kosher salt and freshly ground black pepper", "1 tablespoon curry powder", "2 medium cloves garlic, minced", "1 cup unsweetened coconut milk", "1 cup vegetable stock", "1/2 cup quinoa", "8 ounces shrimp, peeled and deveined, sliced in half lengthwise if very large", "1/4 cup torn fresh basil leaves (about 10 large leaves)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in saucepot, then add mushrooms and onions and sprinkle with salt and pepper. Cook over medium-high heat, stirring occasionally, until mushrooms are browned and crispy. Add more butter or oil if pot gets too dry. Add curry powder and garlic and cook until garlic is fragrant and curry is toasted, 1 to 2 minutes. Pour in coconut milk and stock, bring back to simmer. Add quinoa, cover, and cook over low heat, about 12 minutes, then remove from heat and let stand, covered, for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover quinoa and stir. Stir in shrimp to submerge in curry broth, then cover and cook over medium-low heat until just pink, 3 to 5 minutes. Season with salt and pepper, then stir in basil. Serve hot, or let cool slightly, then ladle into an airtight container for later use. Reheat in microwave until broth is hot. </p>"}]}