{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/042613-249109-cook-the-book-green-herb-and-kidney-bean-stew.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "herb stew", "kidney beans", "louisa shafia", "the new persian kitchen", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "2"}, "name": "Green Herb and Kidney Bean Stew (Ghormeh Sabzi) from 'The New Persian Kitchen'", "link": "https://www.seriouseats.com/recipes/2013/04/green-herb-and-kidney-bean-stew-ghormeh-sabzi.html", "description": "Herb stew sounds like one of those \"recipes\" I'd come up with as a kid poking around in the garden for kitchen experiments. After all, in western cuisine, fresh herbs are usually added at the end of cooking for a burst of greenery and bright flavor. But according to <strong><a href=\"http://lucidfood.com/about-louisa/\">Lousia Shafia</a></strong>, author of <em><a href=\"http://www.amazon.com/The-Persian-Kitchen-Louisa-Shafia/dp/1607743574/?tag=serieats-20\">The New Persian Kitchen</a></em>, herb filled stews are some of the most famous in Iran. Her version is a lighter, vegetarian take on the green stew, filled with cubes of turmeric-laced tofu and fat red kidney beans. But the bulk of the stew is, indeed, chopped parsley, cilantro, and scallions (bulked up with a bit of spinach); and the mixture is surprisingly delicious. The grassy greens cook down and mellow, turning into a fragrant, earthy melange excellent atop fluffy rice or stuffed into a pita.", "totalTime": "24 hours (including tofu freezing time)", "recipeYield": "serves 4", "recipeCategory": ["Beans and Pulses", "Cook the Book", "Dairy-Free", "Gluten-Free", "Mains", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["1 (14-ounce) package firm tofu ", "5 tablespoons grapeseed oil", "Sea salt and freshly ground black pepper", "1 teaspoon ground turmeric", "1 large yellow onion, thinly sliced", "4 cloves garlic, minced", "2 cups cooked kidney beans \u2028(one 15-ounce can), rinsed and drained ", "2 cups vegetable or chicken stock, boiling", "1/2 pound spinach, coarsely chopped", "1 cup tightly packed, coarsely chopped fresh flat-leaf parsley ", "1 cup tightly packed, coarsely chopped fresh cilantro", "1 cup thinly sliced scallions", "2 dried limes, soaked in hot water to cover for 15 minutes", "3 tablespoons freshly squeezed lemon juice", "Extra-virgin olive oil, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the tofu and cut it into 1-inch-thick slabs. Freeze until solid, about 6 hours, then defrost in the refrigerator overnight. Squeeze the tofu slices to remove excess water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Line a baking sheet with a nonstick baking mat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together 2 tablespoons of the grapeseed oil, 1 teaspoon salt, a few grinds of pepper, and the turmeric. Add the tofu and toss to coat it in the seasoning. Spread the tofu on the baking sheet and bake for 50 minutes, flipping the slabs once halfway through. The tofu should be golden and springy. Let cool and dice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tofu bakes, caramelize the onion. Heat a large, deep skillet over medium-high heat and add the remaining 3 tablespoons grapeseed oil, followed by the onion. Brown the onion for 10 minutes, until it starts to darken, then cook slowly over low heat for about 30 minutes, until it is dark brown and about half its original volume. Add the garlic, beans, tofu, and stock and bring to a boil; then turn down the heat and simmer, partially covered, for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the spinach in large handfuls, adding more as each batch wilts, then stir in the herbs and scallions. Pierce the limes and add them to the stew along with their soaking water. Simmer for 20 minutes. The herbs should be tender but still bright green. Stir in the lemon juice and season with salt and pepper. Turn off the heat and let the stew rest for 15 minutes. Drizzle with extra-virgin olive oil and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation:</strong> Heat a large, deep skillet over medium-high heat and add 1 tablespoon grapeseed oil to the pan. Lightly salt 2 pounds skinless chicken breasts and legs. Add the chicken to the skillet and sear for 6 to 7 minutes per side, until well browned, then transfer to a plate. Add the chicken to the stew along with the beans</p>"}]}