{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/050913-250893-cook-the-book-grilled-pizza-edit.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "gluten free", "gluten-free girl every day", "gluten-free pizza dough", "pizza", "shauna james ahern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shauna James Ahern's Grilled Pizza", "link": "https://www.seriouseats.com/recipes/2013/05/shauna-james-aherns-grilled-pizza-recipe.html", "description": "If you're looking for a gluten-free pizza to try, start here. <strong><a href=\"http://glutenfreegirl.com/about/\" target=\"_blank\">Shauna James Ahern's</a></strong> grilled pizza recipe in <em><a href=\"http://www.amazon.com/Gluten-Free-Every-Shauna-James-Ahern/dp/111811521X/?tag=serieats-20\" target=\"_blank\">Gluten-Free Girl Every Day</a></em> uses dough made from a mixture of millet, sweet rice flour, potato starch, psyllium, oil, egg, and yeast. Once mixed and risen, it looks more like cookie batter than pizza dough, but it rolls out easily and bakes into a half crackery, half bready crust.", "totalTime": "2 to 3 hours", "recipeYield": "serves 6", "recipeCategory": ["Bread", "Cook the Book", "Gluten-Free", "Mains", "Pizza", "Vegetarian"], "recipeIngredient": ["750 grams <a href=\"http://www.seriouseats.com/recipes/2013/05/shauna-james-aherns-all-purpose-gluten-free-flour-mix-recipe.html\">All-Purpose Gluten-Free Flour Mix</a>", "1 tablespoon whole or powdered psyllium husks ", "1 envelope (2 1/4 teaspoons) active dry yeast", "1 teaspoon sugar", "1 teaspoon kosher salt", "1 large egg, at room temperature", "1/4 cup extra-virgin olive oil", "1 1/2 to 2 1/2 cups warm water, at about 110°F", "Toppings of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the flour, psyllium husks, yeast, sugar, and salt in the bowl of a stand mixer. With the stand mixer running, add the egg and oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly, drizzle in half the water and continue mixing the dough. Pour in more water and mix until you have a sticky ball of dough that slumps off the paddle when you stop the mixer. Do not add more flour. Gluten-free doughs are wetter than gluten doughs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the dough into a lightly greased bowl. Let the dough rise until the texture has firmed into something close to a traditional pizza dough, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Oil your hands again. Gently turn the dough out onto a floured surface. Cut it into 6 equal pieces and form them into balls. Cover them with a damp cloth and let the dough rest for another 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fire up the grill. Get it as hot as you can. (If you have a thermometer on your grill, it should read over 700°F.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out each of the balls of dough into an oval about 6 inches long. (It might help to roll them out between 2 pieces of lightly greased parchment paper, to avoid sticking.) Place the oval of dough, oil side down, onto the grill. Repeat with the remaining dough. (If you have a small grill, you may have to do this in batches.) Put the lid on the grill and cook until the bottom of the pizzas are set and have grill marks, 4 to 6 minutes. Pull the pizza crusts off the grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This is where you top your pizzas. Of course, you may use anything. However, I like to keep it simple. Brush the grilled side with extra-virgin olive oil and tomato sauce and put the pizzas back on the grill for 3 minutes. Add some fresh mozzarella you have torn with your hands. Close the cover of the grill and let the pizzas cook until the mozzarella has melted. Take the pizzas off the grill and toss on some fresh basil leaves and a sprinkle of kosher salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> If you want, you can make this the night before you want to cook it, with cool water, and put it in the refrigerator. Let the dough come to room temperature before you grill it. You can take out a hunk of dough to make a little pizza every night for a week. This pizza also bakes up great in the oven. Set your oven on as high as it can go and preheat for 30 minutes. If you have a pizza stone, please put it in before you turn on the oven. You can use a pizza tray, a large piece of parchment paper, or put the pizza dough directly onto the pizza stone. Use half the dough this recipe yields for a 12-inch pizza.</p>"}]}