{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130821-skillet-suppers-steak-tacos-primary.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["cinco de mayo", "corn", "easy", "greek yogurt", "one pot", "quick", "Sriracha", "steak", "taco", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Easy Steak Tacos With Charred Corn and Sriracha", "link": "https://www.seriouseats.com/recipes/2013/09/steak-tacos-charred-corn-sriracha-recipe.html", "description": "A one-skillet taco feast with charred spice-rubbed skirt steak and corn, topped with greek yogurt, mint, and sriracha.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Corn", "Mains", "One-Pot Wonders", "Quick Dinners"], "recipeIngredient": ["1 1/2 teaspoons ground cumin", "1 1/2 teaspoons ground coriander", "1 tablespoon chili powder", "1 1/2 teaspoons dried oregano", "Kosher salt and freshly ground black pepper", "1 1/4 pounds skirt steak, trimmed and cut into 4- to 5-inch sections (see note)", "2 tablespoons olive oil", "2 ears of corn, removed from the cob (about 2 cups kernels)", "1 jalapeño pepper, minced (about 1 tablespoon)", "1/2 medium red onion, minced (about 1/2 cup)", "1 medium clove garlic, minced (about 1 teaspoon)", "1 tablespoon juice from 1 lime, plus extra lime wedges for serving", "8 corn tortillas", "1/4 cup roughly chopped fresh mint leaves", "Greek yogurt, for serving", "Sriracha, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cumin, coriander, chili powder, oregano, 2 teaspoons salt, and 1 teaspoon ground black pepper in a bowl. Rub aggressively into steak so that it is worked into all cracks and crevices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat half of the oilin a large stainless steel or cast iron skillet over high heat until shimmering. Add steak and cook, turning frequently, until an instant-read thermometer registers 120 to 125°F for medium-rare, about 6 minutes. Reduce heat as necessary if steak smokes excessively or starts to burn.  Transfer to a large plate to rest. Repeat with the remaining oil and steak and then add to the plate. Proceed to step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Alternatively, to finish on a grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Place steak directly on hot side of grill and cook, turning frequently, until well browned and an instant read thermometer inserted into the center registers 125°F for medium, 3 to 8 minutes total depending on thickness. Transfer steak to a cutting board and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium and add the corn. Cook without moving until well-charred, about 3 minutes. Stir, scraping up browned bits from the bottom of the skillet and keep cooking until well-charred on several sides, about 6 minutes total. Add the jalapeño, onion, and garlic and cook until softened, about 1 minute longer. Add lime juice and scrape any browned bits off bottom of pan. Season to taste with salt and pepper and reduce heat to low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the tortillas out over the mixture, overlapping as needed. Cover and cook until tortillas are softened and warm, about 1 minute. Meanwhile, slice steak thinly against the grain. Place tortillas on serving plates and top with the corn mixture. Top with steak, a dollop of yogurt, and a drizzle of sriracha as desired. Sprinkle with mint and serve immediately with lime wedges.</p>"}]}