{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131004-pork-belly-bun-recipe-11.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["appetizer", "Asian", "Chinese", "Japanese", "pork belly", "pork belly bun", "snack", "steamed bun"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Sous Vide Pork Belly Buns With Pork Braise Mayonnaise and Quick-Pickled Cucumbers", "link": "https://www.seriouseats.com/recipes/2013/10/sous-vide-pork-belly-bun-pork-braise-mayonnaise-quick-pickled-cucumbers-recipe.html", "description": "Steamed buns stuffed with pork belly cooked sous-vide in a Japanese-style marinade.", "totalTime": "1 day", "recipeYield": "Makes about 2 dozen pork buns, serving 8 to 12", "recipeCategory": ["Chinese", "Christmas", "Japanese", "Snacks", "Sous Vide", "The Food Lab"], "recipeIngredient": ["1/2 cup soy sauce", "1/2 cup mirin", "1/2 cup granulated sugar", "2 tablespoons fish sauce", "2 whole scallions, roughly chopped", "3 medium cloves garlic, roughly chopped", "1 (2-inch) chunk ginger, peeled and roughly chopped", "2 1/2 pounds pork belly, in as large pieces as possible (preferably 1 or 2 whole slabs)", "2/3 cup mayonnaise, preferably <a href=\"http://www.seriouseats.com/2011/10/the-food-lab-homemade-mayo-in-2-minutes-or-le.html\">homemade</a>", "24 fresh or frozen Chinese-style steamed buns", "1 head bibb lettuce, washed, dried, and torn into medium-sized pieces", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/10/quick-pickled-cucumbers-rice-vinegar-recipe.html\">Quick-Pickled Cucumbers with Rice Vinegar</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a sous-vide style water bath to 170°F (77°C). Combine soy sauce, mirin, sugar, fish sauce, scallions, garlic, and ginger in the bowl of a food processor. Process until vegetables are roughly pureed. Transfer pork belly and marinade to a food-saver style vacuum bag and seal. Alternatively, transfer to a heavy duty gallon-sized freezer bag and seal by slowly submerging into a pot full of water, sealing the top just before it goes underwater to remove all air. Transfer to sous vide cooker and cook until completely tender, about 10 hours. Remove bag from cooker and chill thoroughly. Pork belly can be stored in the refrigerator for up to 2 weeks after cooking if the bag remains sealed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, open sous vide bag and remove pork belly. Discard solid chunks of fat. Warm congealed liquids in a small saucepan, then strain through a fine mesh strainer. Return to saucepan and simmer until reduced to 2 tablespoons, making sure that the syrup doesn't reduce too far and burn, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer reduced cooking liquid to a medium bowl. Add mayonnaise and whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Cut pork belly into 1 1/2-inch wide strips, then slice into 1/2- to 1/3-inch slices. Transfer to a foil lined broiler pan. Broil pork belly until crisp and charred on one side, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Steam buns in a bamboo steamer or in the microwave on a large plate under a damp towel. Spread mayonnaise onto each bun, then stuff with lettuce leaf, slices of pork belly, and pickles. Serve immediately.</p>"}]}