{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130621-peas-carrots-salad-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["carrot", "goat cheese", "peas", "salad", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peas and Carrots Salad With Goat Cheese and Almonds", "link": "https://www.seriouseats.com/recipes/2013/06/peas-and-carrots-salad-recipe.html", "description": "A light but filling take on peas and carrots with crunchy marcona almonds and citrus-scented goat cheese, drizzled with honey and toasted pumpkin seed oil.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Legumes", "Salads", "Vegetarian"], "recipeIngredient": ["4 ounces fresh goat cheese", "3 tablespoons extra-virgin olive oil, divided", "1 teaspoon zest and 2 teaspoons juice from 1 lemon", "Kosher salt and freshly ground black pepper", "1/2 pound baby carrots, trimmed and peeled, handful of tender fronds reserved", "1/2 pound fresh shell peas, shucked", "1/2 pound sugar snap peas, string removed, cut on a bias into 1/2-inch pieces", "1 teaspoon dijon mustard", "2 teaspoons toasted pumpkin seed or walnut oil, plus more for drizzling", "1/2 cup Marcona almonds, toasted and cut in half", "4 teaspoons honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine goat cheese, 2 tablespoon olive oil, and lemon zest in the bowl of a food processor. Process until smooth, about 15 seconds, scraping down sides as necessary. Season with salt and pepper and transfer to a small bowl. Store at room temperature until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil and prepare an ice bath. Working with one vegetable at a time, blanch carrots, peas, and snap peas until just tender, about 3 minutes for the carrots and 2 minutes each for the peas and snap peas, transferring each to the ice bath to chill after blanching. Transfer chilled vegetables to a rimmed baking sheet lined with a clean kitchen towel or paper towels to dry carefully.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine mustard and lemon juice in large bowl. Slowly whisk in remaining tablespoon olive oil and 2 teaspoons toasted pumpkin seed or walnut oil. Season to taste with salt and pepper. Add dried vegetables and toss to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, smear some goat cheese onto each of four serving plates or one large platter. Top with salad. Sprinkle with toasted almonds. Drizzle with honey and a bit of toasted pumpkin seed or walnut oil. Rub carrot fronds in any dressing remaining in bowl and use to garnish. Serve immediately.</p>"}]}