{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130724-260528-ice-cream-bon-bons.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "chocolate", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Chocolate Covered Ice Cream Bon Bons", "link": "https://www.seriouseats.com/recipes/2013/07/ice-cream-bon-bons-chocolate-covered-ice-cream-balls-recipe.html", "description": "By making these easy chocolate-dipped ice cream balls at home, you can use your favorite top quality chocolate with your very favorite ice cream.", "totalTime": "2 hours", "recipeYield": "Serves 8", "recipeCategory": ["American Classics", "Chocolate", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 pint vanilla ice cream (or your favorite flavor)", "12 ounces best quality dark chocolate, melted in the microwave or double boiler", "3 tablespoons coconut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large baking sheet with parchment paper. Use a melon baller to make mini scoops of ice cream adding them to the parchment lined tray. Freeze scoops until firm, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl whisk together melted chocolate and coconut oil until thoroughly combined. Let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a second baking sheet with parchment paper. Remove ice cream from freezer. Working quickly, use a spoon to place ice cream scoops in the chocolate and roll it around until coated. Carefully remove the bon bon with a fork and place it on the second baking sheet. If at any point your ice cream scoops start to get overly melty, return them to the freezer for 15 to 20 minutes to allow them to firm up. Store in freezer until immediately before serving.</p>"}]}