{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131109-273105-TurkeyWaldorf1.JPG", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["fennel", "salad", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Make-Ahead Turkey Waldorf Salad With Fennel, Roasted Grapes, and Spicy Walnuts", "link": "https://www.seriouseats.com/recipes/2013/11/make-ahead-turkey-waldorf-salad-fennel-roasted-grapes-thanksgiving-recipe.html", "description": "If you think Waldorf salad connotes American culinary relic, a dish best forgotten alongside jellied salads, then this fresh take will forever change your mind. In lieu of sliced raw celery, I added fennel and chopped fronds for crunch and flavor, and toasted the walnuts with a quick homemade spice mix of cumin, paprika and cayenne for some kick. My favorite part of this dish is the roasted red grapes&mdash;alongside fresh green ones.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Mains", "Salads", "Turkey"], "recipeIngredient": ["2 tablespoons unsalted butter, melted", "1/2 teaspoon cumin", "1/2 teaspoon paprika", "1/4 teaspoon cayenne", "Kosher salt", "1 cup chopped walnuts", "1 cup halved (lengthwise) red grapes", "1 sprig rosemary ", "2 cups shredded cooked turkey meat ", "2 Honeycrisp apples, cut into about 3/4-inch chunks ", "2 tablespoons fresh lemon juice from 1 lemon", "1 cup quartered (lengthwise) green grapes", "1 small bulb fennel, quartered, thinly sliced, cut into 1/4-inch sticks, plus 2 tablespoons fronds, roughly chopped", "1/4 cup mayonnaise", "2 teaspoons apple cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425 degrees F. Stir together half the melted butter, cumin, paprika, cayenne and 1/4 teaspoon salt in small bowl. Add walnuts and toss to coat. Spread in single layer on foil or parchment-lined baking sheet and toast in the oven until lightly browned in spots and fragrant, 10 to 12 minutes. Meanwhile, toss red grapes with remaining melted butter, 1 teaspoon olive oil and 1/4 teaspoon salt. Spread in single layer on foil-lined rimmed baking sheet, pinching up corners to catch juices. Lay rosemary branch on top and roast until softened and shriveled around edges, 10 to 12 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine turkey, green grapes, fennel and fennel fronds in medium bowl. Toss apples thoroughly with lemon juice and add to bowl. Remove roasted grapes from foil with slotted spoon, reserving the juices. Add roasted grapes and walnuts to bowl and gently mix everything together. Whisk together mayonnaise, vinegar, 1/4 teaspoon salt and reserved juices from grapes. Wrap salad and dressing separately in plastic or airtight containers and refrigerate until ready to eat. Let dressing come to room temperature, then spoon into salad and stir to coat and combine. Serve on its own or on bread or a bed of lettuce. </p>"}]}