{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/050813-250886-cook-the-book-zucchini-noodles-with-spinach-pesto.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "feta", "gluten-free girl every day", "gruyere", "shauna james ahern", "spinach pesto", "sunflower seeds", "zucchini noodles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shauna James Ahern's Zucchini Noodles with Spinach Pesto, Feta, and Sunflower Seeds", "link": "https://www.seriouseats.com/recipes/2013/05/shauna-james-aherns-zucchini-noodles-with-spi.html", "description": "It was with trepidation that I approached the pasta chapter of <strong><a href=\"http://glutenfreegirl.com/about/\">Shauna James Ahern's</a></strong> new cookbook <em><a href=\"http://www.amazon.com/Gluten-Free-Every-Shauna-James-Ahern/dp/111811521X/?tag=serieats-20\">Gluten-Free Girl Every Day</a></em>. Most of the pasta recipes in the book call for store-bought pasta. (She does include one recipe for gluten-free fresh pasta, but doesn't provide an assembled recipe using it.) While I'm sure that gluten-free pasta options have improved significantly since that fateful quinoa noodle disaster, I wasn't sure I wanted to mess up dinner with a poor grocery store choice. Instead, I turned to this recipe for zucchini \"noodles.\" While many may scoff at the idea of replacing carbo-goodness with healthy raw veggies, I find thinly sliced vegetables to be a fine vehicle for pasta sauce, especially one as vibrant and flavorful as Ahern's spinach pesto.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cook the Book", "Gluten-Free", "Mains", "Pesto", "Vegetarian"], "recipeIngredient": ["2 cups chopped spinach", "1/2 cup pine nuts", "2 cloves garlic, peeled and chopped", "1 large lemon, zested and juiced", "1/2 cup grated Gruyère", "1 cup extra-virgin olive oil", "3 large ripe zucchini", "1/4 cup crumbled feta cheese, crumbled (we prefer French feta)", "1/4 cup sunflower seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the spinach, pine nuts, garlic, and lemon zest and juice to the bowl of a food processor. Whirl them up until everything is broken down into small pieces. Add the Gruyère and run the processor. You should have a great-smelling paste by now. With the food processor running, slowly drizzle in the oil until you have rich green pesto.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grab a zucchini with your left hand. Using a vegetable peeler, grate long, even strips of the zucchini until you have reached the fleshy center and can peel no longer. (You can eat the outer skin, of course.) Repeat with the remaining zucchini.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the zucchini noodles so they are all separated. Plop a couple of tablespoons of pesto into the noodles and toss them together. If you want more pesto, add a tablespoon at a time. You don’t want to overpower the zucchini. When you have dressed the noodles to your liking, add the feta and sunflower seeds. Toss and serve.</p>"}]}