{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/20130410-escalivada-catalana-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["catalan", "eggplant", "onion", "pepper", "spanish", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Catalan-Style Ash-Roasted Vegetables (Escalivada)", "link": "https://www.seriouseats.com/recipes/2013/04/catalan-ash-roasted-vegetables-escalivada-recipe.html", "description": "Eggplant, peppers, onions, and tomatoes slow-roasted over the dying embers of a coal fire. Sounds romantic, tastes delicious.", "totalTime": "2 hours", "recipeYield": "Makes about 1 pint, serving 4 to 6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Eggplant", "Onion", "Sides", "Spanish", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1 medium eggplant", "1 large bell pepper", "1 small onion (unpeeled)", "3 to 4 roma tomatoes (optional)", "1/2 cup extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "2 tablespoons chopped fresh parsley leaves", "1 teaspoon sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss eggplant, red pepper, onion, and tomatoes (if using) with half of olive oil, rubbing them with your hands to coat them evenly. Season with salt and pepper. Wrap each vegetable individually in foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on Grill</strong>: Build a fire out of 1 chimney full of coals and let it die out until only smoldering coals remain (you can cook on it while it is still hot). When ready, place foil-wrapped vegetable directly on coals, piling some of the coals on top. Place lid on grill and let cook until vegetables are completely tender, about 2 hours and up to overnight. Remove from coals, unwrap vegetables, and discard eggplant, pepper, onion, and tomato skins. Discard pepper and eggplant seeds. Roughly chop flesh and combine with remaining olive oil and parsley. Season to taste with salt and pepper. Serve, drizzling with sherry vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish in Oven</strong>: Preheat oven to 350°F. Place foil packets on a rimmed baking sheet and bake until vegetables are completely tender, about 2 hours. Unwrap vegetables and discard eggplant, pepper, onion, and tomato skins. Discard pepper and eggplant seeds. Roughly chop flesh and combine with remaining olive oil and parsley. Season to taste with salt and pepper. Serve, drizzling with sherry vinegar.</p>"}]}