{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131209-pear-chestnut-strudel.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["brown butter", "chestnut", "pastry", "pear", "strudel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pear and Chestnut Strudel", "link": "https://www.seriouseats.com/recipes/2013/12/pear-and-chestnut-strudel.html", "description": "I created a strudel that doesn't get a traditional strudel dough wrapping, instead getting rolled in a very thin brown butter pie crust. It's considerably less intimidating than an actual strudel dough, and tastes great.", "totalTime": "2 hours", "recipeYield": "Serves 6-8", "recipeCategory": ["Fruit Desserts", "Nuts", "Pastry", "Pear", "Very Small Anna"], "recipeIngredient": ["<strong>For Crust</strong>", "1/2 cup unsalted butter", "1 cup all purpose flour", "Pinch salt", "2 tablespoons plus 2 teaspoons water", " ", "<strong>For Filling</strong>", "1/4 cup sugar", "1 1/2 tablespoon unsalted butter", "Pinch salt", "1 teaspoon apple cider vinegar", "1 pound ripe pears, peeled and cut into 1/2 inch pieces", "2 tablespoons finely chopped boiled chestnuts", "1/2 cup dry bread or cake crumbs (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Crust</strong>: Place butter in medium saucepan and heat over medium heat. Once butter begins to brown and smell nutty, about 5 minutes, remove from heat and gently swirl pan until liquid is medium golden-brown and there are many deep brown solids on bottom. Immediately pour into a heatproof container, scraping as much from bottom of pan as you can. Once slightly cooled, stir gently to suspend browned solids and measure out 1/3 cup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and salt in medium mixing bowl, then add browned butter and water. Using a fork, gently mix until all dry flour is absorbed. Pat dough into a rectangle, wrap in plastic and chill slightly, until somewhat firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Filling</strong>: Combine sugar, butter, salt, and vinegar in medium saucepan over low heat. Cook, stirring often, until butter and sugar are both completely melted. Remove from heat and stir in pears, chestnuts and crumbs. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake</strong>: Preheat oven to 375&deg;F. If you have parchment sheets, fold one in half, creasing sharply. If you are using rolled parchment, cut a piece that is at least two feet long and crease sharply in the middle. Place dough in between parchment and roll as thin as possible, turning, peeling and flipping parchment as needed to keep dough even and rectangular. You should end up with a rough square of about 12- by 12- inches, though it may be more rectangular if using sheet parchment. Gently peel parchment from top, then flip and repeat so dough won't stick and tear.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange filling evenly in a line an inch or two up from the bottom edge of the dough. Use parchment to roll bottom of dough up over filling, then gently peel it away. Continue to tightly roll dough, using parchment to push, until all dough is rolled around filling and top edge is tucked underneath. Trim parchment to fit on a baking sheet, then use remaining parchment on either side of roll as a sling to gently lift strudel onto baking sheet. If desired, brush gently with beaten egg before baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 20 minutes, then turn and bake another 15-20, until dough is fully cooked. Don't be too concerned about any cracking or juices leaking. Allow to cool fully before slicing and reheat before serving.</p>"}]}